{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Nice modern establishment”", "Author": "AleksiHelsinki", "ReviewID": "UR128208722", "Content": "Lindemann's is nice, clean and modern hotel. Its' breakfast is worth of the charge (12,50 eur), however somehow it would have been more expensive to book it in advance than paying it on location. If you are a smoker, the hotel's 1st floor rooms facing to the street are dedicated for you. Just remember when you get out of the shower that the full size windows to the street are transparent both ways. Spacious bathroom was great however it lacked a bidet. The hotel has a wifi for a separate charge, however its limited to one device only which I've never encountered before. All together Lindemann's offers good value to your money.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Finland", "Title": "“Stylish and very friendly”", "Author": "zack68", "ReviewID": "UR127818438", "Content": "If you look for a modern, comfortable hotel near Schöneberg district this a place to be. Spacious, clean and modern rooms. Super comfy beds and spacious bathroom. Excellent breakfast, almost like brunch for only 12,5 eur. Very friendly, no frills staff. I highly recommend! Only minus that the bathroom did not have bidet shower.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Prague, Hlavni Mesto Praha, Czech Republic", "Title": "“ok”", "Author": "Veronika D", "ReviewID": "UR126332294", "Content": "The hotel is not in a very nice area. However the rooms are nice, modern and very clean and good value (we had a discounted rate). I wouldn't stay again for a full price but would consider it if could get a special deal.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Very clean, would definately stay here again!”", "Author": "CharshankRedemption", "ReviewID": "UR124779803", "Content": "True, this is not the most central location in Berlin. But with a bus stop literally in front of the hotel (which takes you o Potsdamer Platz in 8 minutes) and the U-Bahn a 5 minute walk away, this is a great hotel option in Berlin. The area feels very safe, and I even felt comfortale walking the streets alone late at night being a woman travelling alone. The rooms are very, very clean, maybe even one of the cleanest hotel rooms I have ever stayed at. I had the most basic room available, which was just great. Big bathroom, comfy bed and well designed with loads of closets; The room was very well designed. My room was situated at the front of the hotel. If you are a light sleeper, definately book a room at the back side, the sounds of the busy road at the front side might be too much for you. Would definately stay here again!", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Excelent Hotel”", "Author": "Rafael_Ricoldi", "ReviewID": "UR122830758", "Content": "Great place to stay in Berlin. The staff are absolutelly helpful and friendly, the breakfast is great, the rooms are exactly as the website and they have a good price.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Clean and Modern”", "Author": "EmmaArmitage83", "ReviewID": "UR122627568", "Content": "Very good value for money hotel. It was clean and modern, along with the rooms being very spacious. It is a little walk from transport and resturants but not too far out. Nice coktail bar close by and a grocery store just around the corner. Staff were pleasant and overall it was a really nice stay.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London UK", "Title": "“Rooms excellent, drink elsewhere.”", "Author": "Dellaph_Kite", "ReviewID": "UR122421718", "Content": "Seven of us stayed here for New Year. Although the rooms were incorrectly assigned (twins/doubles) this was rectified on arrival. The only soap provided is in dispensers, no shampoo, but the rooms are clean and very comfortable. Both U & S stations are easily accessible on foot and the bus stop by the front door covers useful routes. The female staff were friendly and helpful. The male staff couldn't even be bothered to turn the lights on in the bar area when asked, and provided slow, dismissive service. All in all, a good place to stay but use local bars and cafes.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Barrie, Canada", "Title": "“For One Night, Not Bad”", "Author": "PolyglotTraveller", "ReviewID": "UR121782447", "Content": "We stayed at this hotel December 5th. It quite a distance from the city centre and you'll either have to drive or take the subway/light rail to get to the main shopping district or Haupbahnhof. The uBahn or SBahn are about 1 km max. walk from hotel. We were upgraded at check in since all the rooms for our category had been 'booked'. The room we got was very spacious but reeked of smoke. We didn't bother complaining since we were only there for one night but seriously I had to launder my PJs et. al. the next day. The room was very spacious facing the road. There was not much noise (1st floor - European 1st floor; not ground floor) from the road or other rooms. There was a large screen tv, lots of closet and counter space, beds were good (soft), with a cordless phone and alarm clock. No fridge. Bathroom very spacious, walk-in shower with no current or door but very private (i.e. you can shower behind the wall while someone else brushes their teeth - if you're okay with that). Large mirror and sink. We were treated to a Saint Nicholas gift the next morning (Dec. 6th is Feast Day) that was left on our door handle. Friendly front desk staff. Easy check in. Overall not a bad stay. No internet unless you pay using your credit card. We booked over \"expedia-like\" website and got the room for $114 CND (but remember it was an upgrade) which lists for 89 euros. Just, seriously, if you have any 'smoke' allergies, check the room first.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "London", "Title": "“Great stay in Berlin”", "Author": "prescriptiondog", "ReviewID": "UR120134795", "Content": "We stayed in the Lindemanns in August this summer and enjoyed the most amazing service and quality we had in a hotel for some time! The staff are amazingly friendly, attentive, but not in your face. Also the rooms are super, contemporary and clean, amazing walk in showers. We had a standard room for start but as we had booked the business special package we asked for an upgrade after the first night and were put into a slightly larger room with an even more spacious bathroom with walk in shower. Great service, thanks. Also, the hotel is conveniently located for both visits to the old West part of Berlin as well as easy connections to the new Mitte and Kreuzberg. The hotel is not in a super trendy area but close walking distance to Schoeneberg as well as a short bus ride to Potsdamer Platz. Overall, I would definitely stay there again, the price is good, affordable for this type of quality hotel, so I m definitely coming back. Also, the breakfast was amazing, good range of different types of food, and again, the lovely hotel staff were at help throughout and couldnt be any better!", "Date": "November 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Berlin", "Title": "“Nice place to spend the vacation”", "Author": "Achim K", "ReviewID": "UR119168889", "Content": "perfectly clean, quiet, great friendly and helpful staff & also great hospitalization. And also lots of food restaurants within very small space.Best transport facilities with bus stop right out front of Hotel.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Had a nice stay...”", "Author": "HungryJack32", "ReviewID": "UR119003478", "Content": "My husband and I stayed here for 4 nights, and it was a very nice stay. Took the bus directly from the airport to the hotel where the stop was right outside the hotel. Their U and S bahns were very easy to use and there was a stop about a 5min walk away (although bullowstrasse was closed for renovation, but the next closest stop was just ~10min. further). Hotel can sell you passes to use the public transportation (we bought day passes when we needed them). Hotel itself had excellent staff that spoke English and were super helpful. Rooms were very clean and had plenty of space for 2 people (compared to other hotels we stayed at in Europe). Soap/shampoo combo is from a liquid dispenser in shower. Wasn't a problem for me. Breakfast buffet was great, although very different from the U.S. Lots of cold meats and cheeses, bread, cereals, yogurt and fruit. The area it is in is still a little run down, not the prettiest, but it was great in the hotel itself and I think it was a good value. If you want to be in a fancier area, you'll be paying more. Also, since I live in a city and walk a lot, we walked quite a bit if we didn't want to take the bahn. Sights were not down the street though. It was easy for us to get around, but if you don't like to walk or take the bahn/bus/etc then you might want to look into other places. Wifi is a requirement for me, and it worked fine. I had read it was $10 for 3 days, but I didn't pay anything extra, might have been the package I bought though. Things we visited: Reichstag (parliament building), Brandenburg gate, victory tower, zoo, olympic stadium. Berlin was very nice! The locals were very helpful and friendly.", "Date": "October 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“great place, clean & friendly”", "Author": "alisonmili", "ReviewID": "UR118000712", "Content": "Incredibly clean, quiet, great friendly and helpfull staff... cant really fault it. lots of food restaurants within walking distance. had a very pleasant stay would def stay there again :) i ended up extending my stay i loved berlin and the hotel so much :)", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Very nice hotel in a slightly rough neighberhood”", "Author": "PeterP-Swe", "ReviewID": "UR117312931", "Content": "Nice hotel with very clean and updated design. Nice and clean. Very good value for the money. Is placed in a slightly rough neighborhood where I did not feel 100% comfortable. There are though nice buses that stops very close. Easy access to metro as well. First time ever I got a course in the reception on how to open the look. It was actually needed ;-)", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "York, United Kingdom", "Title": "“It set the standard for all the other hotels we now choose!”", "Author": "MegandDave37", "ReviewID": "UR116395353", "Content": "My partner and I stayed here in February 2008. Decided to write a review as we still think of our break in Berlin with very fond memories. Our stay was made all the more magical by the hotel and by the weather we had whilst there. It would be a shame for others to miss out on a fab hotel and city. It was a very snowy, very very cold Berlin evening when we arrived and we couldn't wait to get to our warm hotel. We weren't disappointed. The heating was on in our room which was really spacious, clean and modern and we were able to warm our selves and our coats/gloves/boots (perfect for the next couple of days which were just as cold) on the huge radiator that covered one of the walls. I spent a lot of time sitting by it! The bathroom was fabulous - slate look floor and walls with a walk in shower/wetroom. Amazing shower! Clean, fresh and modern. After staying at the Lindemann Hotel we realised we could get lovely modern hotels for decent prices, so it has set the standard for EVERY other hotel we now pick! Go to this hotel!", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lafayette, IN", "Title": "“Great Value”", "Author": "KeithLafayette", "ReviewID": "UR115304323", "Content": "I stayed here for five nights in one of the Penthouse rooms for an average rate of about $100 a night. Overall, this was a great value. The rooms were quite large, modern and clean with really nice bathrooms and a terrace seating area. The employees were all very nice, especially the guys at the front desk who were always friendly and eager to help. The area around the hotel is just fine (I cannot understand why some reviews say it is rundown or unsafe). It is about 5-10 minutes walk from U and S Bahn stations and 15 minutes to the Schoneberg area. Wifi is a reasonable 10 euros for three days. I would certainly stay here again: one the best values for the price in all my years of international travel.", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lausanne", "Title": "“Good value for money, nice, modern, clean”", "Author": "camille_o1", "ReviewID": "UR114807372", "Content": "Nice place, very modern, clean, nice people, the transport are not too far: we can really easily go to the U-Bahn or take a bus (right in front of the hotel). For night owls: it could be a bit long to come back on foot after a night party (depending where the club is)... We didn't take the breakfast or internet-wifi but we could easily find a place to get a coffee and a short wifi-connection to check emails once outside the hotel ;) I would definately come back, it's a good address!! Thanks!!", "Date": "June 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Melbourne", "Title": "“Great designer rooms - internet didn't work”", "Author": "suwii", "ReviewID": "UR105389836", "Content": "Everything was superb with this hotel - book early as you get a great discount! Service was great though it varied from person to person. We could not get the paid wireless internet to work, but they didn't charge us. The other little thing that was annoying was getting the key to work to open the door. We had a bit of difficulty with this but the receptionist was able to help us right a way without hesitation. The bed was very clean and shower/toilet was kept fantastically well. Shower leaked water, however and had to put our towels to stop water from overflowing. This was only a minor issue...We had a great time at Lindemann's and would be sure to recommend it to others. The bus service M85 esp was frequent as ever and would take about 15mins to get to the heart of Berlin! Some great places to eat around the hotel anyway!", "Date": "April 25, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Stylish but a few problems that undermine a potentially great hotel”", "Author": "johnfbobrien", "ReviewID": "UR103290528", "Content": "Lindemann's hotel is in the Schoenefeld district of the City and is surrounded by slightly rundown shops and buildings. However within a 10 minute walk is the lively Nollendorf area which is full of bars, cafes and restaurants and a mixed, vibrant crowd. The hotel itself is very modern in style, lots of dark slate, low lighting, monochrome furnishing etc. It is stylish but not overly comfortable, particularly if you want a long, lazy breakfast. My partner and I stayed in a penthouse suite on the 6th floor which had a communal roof terrace but no views. The room was spacious and clean with a large bed, long sofa, two flat screen TVs and a wetroom. However, the shower had very weak water pressure and lost water supply twice mid shower. The hotel bar has a very limited range of drinks and the lights are turned off in the evening to conserve power so it is not the best place for pre-dinner drinks. There was a sole member of staff covering phones, reception and the bar in the evening so service can be slow. We had to wait to check in as the receptionist was on the phone when we arrived, tired and hungry. We arrived back at the hotel at 1ish on Satruday morning and some local youths were hanging around a bus stop outside the hotel. They accused my friends and I of being \"rich, middle class\" - we are not, we just dress well - and one followed us into the hotel and started to give us grief. There was no security or attempt to remove him from the hotel and it was only the fact that he was outnumbered 4:1 that seemed to deter him from causing trouble. Not a pleasant experience but it is indicative of the immediate envrionment. It's about an hours walk from the hotel to Mitte for shopping and main tourist attractions and about a 10 minute walk to the Ubahn.", "Date": "April 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bristol, England", "Title": "“Fantastic stay”", "Author": "Briercliffe", "ReviewID": "UR102820258", "Content": "We stayed for a long weekend at Lindemanns, and I have to say that i was pleasantly surprised. Most of the reviews are true. Good points: lovely, friendly staff, very spacious penthouse studio (well worth the upgrade!), comfy big bed, huge walk in shower and modern, funky interiors. Downsides: the immediate area is a little scruffy but hopefully on the up. Water pressure at peak times in the top floor penthouses is almost non-existent... almost a drip! (you'd think that would be easy to design out!). Never experienced that before, even at budget UK hotels. Being on the 6th floor the penthouses are well sound proofed from the main road, so we slept well. Only one slight unpleasantness.... being followed into the hotel on the friday by a drunk punk who was vandalising the bus shelter outside the hotel having been at a big party in the building opposite. He was very rude and agressive to our party of four, and the duty receptionist didn;t do much to stop him. Quite unnerving!! Not quite the hotels fault, but they may want to consider night time security.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Lima", "Title": "“Great Service”", "Author": "EliuCampos", "ReviewID": "UR100784172", "Content": "I have just arrived back home from a short trip to Berlin and i must say this hotel has an excellent service from the moment i arrived till i left i felt like staying in a 5 star hotel (Outstanding Service). All employees were great but i must say, Philips needs a particular mention, this guy is a star! He was very helpful and provided all the information i needed. I got maps, directions, train and bus tickets, early check in at the last minute and change my reservation without any penalty! Definitely i will stay again in Lindemann's hotel. Rooms are fine, very comfy beds, big windows and enough space in the room, and price is good too.", "Date": "March 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Perfect!”", "Author": "ww-wef", "ReviewID": "UR99156955", "Content": "Great location, great value, very friendly staff, and the rooms are beautiful - small, but very modern and clean, with a fantastic bathroom, and a powerful shower. The location is brilliant for visiting all of Berlin, as it's right by a metro stop, and there is a bus stop just across the road. Much better than a 3*, will definitely be staying here on my next visit to Berlin!", "Date": "March 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Moscow", "Title": "“Everything we were promised and more...”", "Author": "sofushka", "ReviewID": "UR94517230", "Content": "There are \"buts\" about our stay in Lindemann's Berlin - it was all we wished for. The room was clean and airy, decorated in a slick manner, bathroom was huge. We had a feeling as if no one else was living in the hotel - it was so quiet and we havent actually seen anyone. Housekeeping impeccable, very friendly and professional staff who spoke fluent English. Not in the center, but there is a bus stop right next to the Hotel with buses running every 3-5 minutes and it takes you to Alexanderplatz through Potsdamerplatz. A cheap supermarket Lidl just around the corner if you need a bottle of water or a jogurt in the morning. We didnt buy breakfast, but there is a lovely bakery just opposite the Hotel (100 meters up towards Bulower Str) and we had a coffee and some sandwiches there for 8Euro for two persons. If you do stay at Lindemanns, you might want to visit an Italian restaurant nearby called Caruso (10 min walk from the hotel, Winterfeldtstrasse 35). We went there once and kept coming back every night, they have a nice atmosphere and the pasta is simply amazing.. also best Panna cotta I have tried ever. I'm not sure what the hotel would be like for a family visit, but it was perfect for a young couple on their first visit to Berlin..", "Date": "January 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Jordan", "Title": "“Good Hotel, Good location, friendly staff in beautiful Berlin!”", "Author": "Zanz-Jo", "ReviewID": "UR92495332", "Content": "Arrived at the hotel to an extremely friendly receptionist who was very helpful in providing us with useful information about the city and the metro station. The room was small but sufficient and clean with everything a person could need in a room. The bathroom was relatively big given the size of the room and also spotless. The U-BHAN is a five minute walk from the Hotel, and there are plenty of supermarkets around. Overall great experience.", "Date": "January 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Two thumbs up!”", "Author": "beloni", "ReviewID": "UR86678368", "Content": "The hotel is well located, the staff is friendly and the rooms are nice and clean. Very good value for money. The rooms might be a little small but overall very good.", "Date": "November 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Clean room, helpful staff”", "Author": "Jaravv", "ReviewID": "UR82144231", "Content": "We stayed here for three days. Good location, near metro. Our room was clean, spacious. Helpful staff. We enjoyed our stay at the hotel and recommend it.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Disappointed with amenities and room condition”", "Author": "DrPwk", "ReviewID": "UR79128023", "Content": "Good points: * Large rooms * Good breakfast, although expensive for range available (12.50 Euro) * Rooms clean * Location is good enough, road is busy but you cannot hear it and it is between two U-Bahn lines and near-ish to an S-Bahn line. * Comfortable beds but we had two singles/queens instead of a King. * Nice bathroom but only shower gel, no shampoo/conditioner/body lotion. Bad points: * Room in poor condition, marks all over the white walls and a very poor job painting over previous marks with the wrong type of paint. It looked sloppy and really lowered my view of the quality of the room for me. * Cheap fittings, all looked very IKEA. * Only a few choices of channels if you are non-german speaking, or not fluent. * No mini bar, no safe, nothing other than a phone and a TV. * No room service, you have to order drinks at the reception and carry them upstairs yourself, no food available other than breakfast. * Some dodgy service at breakfast, waitress seemed cheery at times, at other times was visibly annoyed at being asked to do things by patrons. Literally huffing and walking off making a scene. I found it pretty uncomfortable. * Staff were OK but often only seemed to be one person available and some of the staff felt a little inexperienced or uncomfortable being asked to do things. * Rooms very hot when air con not on (automatically switches off when you leave the room, so everytime you come back it was hot) This place is nice enough, and if you are only interested in a comfy bed and a large room then it's fine, but as there wasn't even a safe if you are carrying high value items that you are not willing to leave in the room then I'd consider somewhere else. If you are used to above average quality of rooms and amenities you will be disappointed I think.", "Date": "September 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wicklow, Ireland", "Title": "“Chic hotel - in a chic city!”", "Author": "robnliz", "ReviewID": "UR72294689", "Content": "We loved our stay at Lindemann's - we found a modern hotel that was so convenient to all public transport making ideal for getting around Berlin. As well it's located in a really nice district: safe with an abundance of good, reasonably-priced restaurants. The staff could not have been more helpful. Our days started with a gorgeous buffet breakfast which truly set us up for the day. Even though we picked one of their smaller rooms it was bright, spotlessly clean with a really comfortable bed. Would we go back? You bet we will!", "Date": "July 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Munich, Germany", "Title": "“Nice place”", "Author": "mianth0ny", "ReviewID": "UR70367937", "Content": "Good place in Schöneberg. Not very central though as you have to take a long way by metro to get to TXL airport. As for SXF there is a bus service from Sükreuz which is not too far away. The rooms are small but nice and there is free WiFi which is also very helpful. I did not have breakfast. Good rates are availble on some online booking sites such as hrs.de. I would recommend the hotel if you are happy to be just about outside the buzz", "Date": "July 10, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Shenzhen, China", "Title": "“Great Stay at Lindemann's”", "Author": "jt1929", "ReviewID": "UR69851128", "Content": "Just stayed four nights in a penthouse room and couldn't be happier. Since we were just exploring the city every day and night, we didn't need a full-service hotel. We didn't eat there or even need to call down to the front desk for anything, so I can't speak to the service. But the property itself is great. Very new, very clean -- funky design touches without being weird. Highly recommend the penthouse units. It had a couch and two separate wall-mounted TVs. The terrace is spacious and features a great little sitting area that makes for nice sunset happy hours. Bathroom was stylish and spotless. The price was right as we paid about US$150 per night in the middle of summer. Location isn't right next to any transit but a five-minute walk from three different lines. Walk to Brandenberg Gate is about 30 minutes. Walk to Wittenberg Platz is about 20 minutes. Neighborhoods immediately to the west have lots of great shops and restaurants.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent hotel, superb service!”", "Author": "George_Cantstanza", "ReviewID": "UR69525085", "Content": "This is a spacious, clean, modern yet great value hotel. Although it's not really within walking distance of the main sights of the city, the hotel is just a short bus or metro ride away (public transport is excellent in Berlin). There are plenty of good value cafes and shops on the same street as the hotel and a Lidl round the corner so you don't have to overpay for essentials! There also a couple of banks within 100m of the hotel. Wifi is 5 euros a day and the hotel has a large, stylish bar in the lobby area. The rooms are immaculate. Lack of a room safe was the only downside.", "Date": "July 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "london", "Title": "“Great value for money - go!”", "Author": "muratie", "ReviewID": "UR68711116", "Content": "We stayed at this hotel for 3 nights. The hotel is almost centrally localed, brand new interieur, very stylish and simplistic. In addition to the good location the staff of the hotel is very friendly and helpful! This hotel is great value for money - especially if you are on a short city trip to Berlin! We will probably go again to Lindemann's in Berlin!", "Date": "June 26, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "PARIS", "Title": "“VERY STRANGE BUSINESS PRACTICE ...”", "Author": "AESCH", "ReviewID": "UR63115416", "Content": "I have not stayed and will certainly never stay in this property due to very strange business practice which is close to extorsion. I booked a room for 3 people for 4 nights. Unfortunately it was during the problem with the Eyjafjöll volcano, when all air traffic came to an halt ... I booked the room on Sunday but realized very quickly that travelling to Berlin would be next to impossible so I called the hotel this very Sunday to inform them and advised them that I would confirm or cancel the booking the next morning, the original booking was for Monday to Friday ... I was told that the booking was considered as firm and if I did not turn up they would charge 80% of the first night ... the booking had been 30 mintutes before on internet ... the next morning I called to advise them that I would not come, the airports being closed ... I got a bill for 80% of the first night, with the excuse that the cancellation had been made too late and that they were not able to sell the room ... therefore the charge of about 80 € on my credit card. We will attempt to go to Berlin in the coming months but will definetly select another property. I HAVE BEEN DISGUSTED.", "Date": "May 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Dublin", "Title": "“Great Hotel and incredible staff”", "Author": "fabellaDublin", "ReviewID": "UR58832647", "Content": "We stayed in Lindemann's hotel for 4 nights and we enjoyed it a lot. The hotel is great value, modern, very clean. Rooms are large and so are the bathrooms. Location is ok: the neighborhood is a working-class area and does not offer much for tourists but the hotel is only 10 mn from the Postdammer Platz by bus. Buses are running every 10 mn. The metro is only 8 mn walk from the hotel. The staff are friendly and always there to help. The breakfast buffet has a great selection and is good value (12.50 eur). in summary: great hotel at an affordable price. !", "Date": "March 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "dubai", "Title": "“Higher than expected”", "Author": "phoenician84", "ReviewID": "UR58462026", "Content": "Although the location is not within the best district or street in Berlin, the price and the room makes the balance. Staff were very friendly and very helpful, i had a problem with an internet booking and they were able to help me in it and another problem occured with the check-in (not the room i booked),however to make it up, i was offered breakfast and free internet (its not usually). If you have a mid budget (129 EUR),go to this hotel and book a penthouse, its a huge room (kind of apartment) with a terrasse, i was surprised when i saw the size with 2 LCDs and one corner sofa, its worth the price. As for the transportation, there is a bus stop just in front of the hotel entrance and its very easy to take the underground as well, one great thing about the underground in berlin which amazed me is the non stop operation in the week end (24hr)!!! 2 negative points about this hotel: 1. breakfast is poor and the breakfast hall is in the lobby (verz small) 2. Black color is too much invading the style, i mean that everything is black :from breakfast paper towels to walls to elevator ...", "Date": "March 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Diano Marina, Italy", "Title": "“Friendly staff and good location”", "Author": "Okiya", "ReviewID": "UR56732215", "Content": "Nice hotel in a good location, just a few stops from the heart of the city. Reception staff is very firendly and helpful. The hotel is clean and the room was good, value for money is excellent in my opinion. Wi-fi internet is available in the room on request and with supplement (a bit too expensive, especially in 2010...) and it binds to one single device, so it can't be used on multiple computers or phones.", "Date": "February 22, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Definitely going back!”", "Author": "mexposto", "ReviewID": "UR56695682", "Content": "Berlin is certainly the place to be. And when you're there, this is a great option. Excellent location, close to the subway and with very easy access to everywhere! Lots of good restaurants and coffee shops nearby. Everything is new, rooms have good sizes and are beautifully designed. Staff is also very kind and helpful.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Leeds, UK", "Title": "“Friendly value hotel with designer touches”", "Author": "nickfear", "ReviewID": "UR49176310", "Content": "This hotel is a good modern option for the price if you are visiting Berlin. The location is not great, but not too bad either. There are 3 u-bahn stations within a 5 - 10 minute walk, and from these you can easily get anywhere at anytime. You can walk to Schoneberg, which includes some sights and is worth exploring. Don't be put off by the immediate vicinity either - its safe and has some reasonable dining options. The room wasn't huge and mine suffered from a badly positioned column, but the double bed was very comfortable, the air conditioning/heating effective, there was a flat screen TV with English channels, and the bathroom (shower only) fine. As some previous reviewers have said, this is where the value element does let it down a bit - no in-room safe, towels a bit small and thin. I can't praise the usual evening receptionist/barman highly enough. Friendly, perfect English and always very helpful. He seems to be the sole member of staff in the hotel though from mid afternoon ! Internet is not free, but its cheap by hotel standards and works very well. I had the breakfast twice in a four day stay. In Berlin going out for breakfast is a big thing and I wouldn't recommend anyone to always have breakfast in their hotel - there are some great places to go. But if you do have it here its OK and reasonably priced. There is a bar and coffee shop available 24 hours (I think)", "Date": "November 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Halifax, West Yorks", "Title": "“FANTASTIC”", "Author": "leahlufc", "ReviewID": "UR48496777", "Content": "Could not fault this hotel it was brilliant, a bit hard to find but if you get the bus from the Tegal Airport to the Hauptbahnoff (main train and bus station) and then walk to the front of the building where the bus stops are it is the M85 bus which takes you right outside the door! We didnt have breakfast but the beer was very cheap and seen as though we found it difficult finding any decent bars in the town we really should have stayed there! It was only 5 euro for a large and small beer! The location was good, the busses into town ran every 15 mins and if you get a 'welcome card' from the airport this allows you to go anywhere for 72 hours and costs 22 euro, in our opinion well worth it and you get money off lots of attractions with it! The rooms was massive and bathroom just as big with wet room shower and comfy beds and the whole hotel was spotless clean. All staff were obliging and help you out if your trying to get to somewhere out of town or need to know where to find something. Cant fault it, overall a fab hotel! P.S if your booking ask for a room not near the front of the building as the road noise can be a little annoying if your a light sleeper!", "Date": "November 4, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Netherlands", "Title": "“Nice hotel”", "Author": "Sterres12", "ReviewID": "UR48441106", "Content": "Very nice hotel. The area isn't special, but the hotel is located near three different U-bahn or S-bahnstations, which makes it a good starting point for exploring the city. It is quite modern, without frills; has really modern, spacious and clean rooms and a fantastic breakfast buffet. Staff is efficient and friendly. In short: great for a short and comfortable trip.", "Date": "November 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great hotel!”", "Author": "TorontoGuy2", "ReviewID": "UR47813975", "Content": "I recently stayed at Lindemann's for six nights, and was very, very, pleased with the hotel. I had a basic room, which was larger than I was expecting (I loved the slate bathroom with heated towel rack!). The staff was mutli-lingual and very friendly. The breakfast buffet (at 11 Euros) had a good selection of European breakfast items. You can certainly eat for cheaper at a local cafe or bakery, but I thought the buffet was worth the cost. The hotel does not have a gym or pool, nor is there a coffee maker or iron in the room. A U-Bahn station is only a few minutes walk away. I would definitely stay here again! I selected this hotel based on the Travelocity reviews, and I was not disappointed!", "Date": "October 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "2", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Very Sophisticated and Impeccably Clean for Price”", "Author": "SBSTex", "ReviewID": "UR46258265", "Content": "If in Berlin on a tight budget but tired of ratty rooms, economy look and feel, then this is your hotel. For the price, this hotel offers contemporary style, bright, sunny rooms, a large and pleasant bathroom. The staff is attractive, attentive and professional and the lobby area and breakfast feel like that of a much more expensive property. The working class neighborhood, however, has little to offer in the way of sights or restaurants, requiring one to walk 10 minutes (three blocks) to the U-bahn to access any night life, attractions or central districts. If you don't mind being off the beaten path, this hotel is a pleasant experience at a budget price.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "uk", "Title": "“Highly recommended”", "Author": "sasUk", "ReviewID": "UR45919380", "Content": "We stayed in one of the rooms at the back of the hotel for 3 nights in September. We had a really nice stay - the rooms are nice, modern clean and comfortable. The location of the hotel isn't in the thick of the action, but the transport links locally are amazing and therefore this didn't matter one bit. Having a quiet room is really important to us, and we didn't hear other guests at all during our stay. We were at the back of the hotel, and could hear the busy road at the front at busy times, but it didn't disturb at all, and I'm the type of person who notices! If you prefer your room to be quiet, I'd highly recommend going for one of the rooms at the back, as the hotel is on a fairly busy road. Reception staff were great - very helpful and no complaints there at all. We gave breakfast a miss because we didn't think we could justify the cost of it, so couldn't comment on that. Again, we were so close to places we could get breakfast, it didn't matter. The only other small negative thing I noticed is something another traveller pointed out in her review about a slight smell in the bathroom. But that would be being very fussy as it was barely noticeable. In terms of a more general travel tip, we'd highly recommend buying a Welcome Card/ or the Daily ticket which allows you to use the trains, buses etc on an unlimited basis for the duration of your ticket. We saved a lot of money and saw Berlin for ourselves at the same time, rather than organised tours etc! In summary, great hotel and enjoyable stay.", "Date": "October 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“Elegant and smart”", "Author": "Linetherese", "ReviewID": "UR45638419", "Content": "I have no complaints after my first stay at Lindemann's: The hotel is just as stylish and smart as it looks on the website. Friendly and helpful staff. Elegant and minimalistic design. Even the breakfast selection was minimal, though still eith a taste of quality. Three different U-bahn stations within 10 minuts walking distance. Bulowstrasse, connected to the U2-line (stops at Potzdamer Platz, Alexander Platz, Stadtmitte etc.) is only two blocks from the hotel.", "Date": "October 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "london england", "Title": "“Nice place, great price. Mimimalist look lovely; minimalist feel just a bit lacking in specialness.”", "Author": "noplacelikehomegirl", "ReviewID": "UR39394649", "Content": "I feel it's only fair to offer a review as I am so influenced by them myself... can't book anything without the Tripadvisor seal of approval. Stayed at Lindemann's for a short break last week. The hotel is just as you would expect from a boutique urban venue - clean lines, understated, efficient, no fuss. It looks great, minimalist chic, lovely and clean, still new enough to show no wear & tear, all shiny and squeeky, comfy bed (though hate that two singles for double thing!), fabulous stylish bathroom, really great helpful reception staff and the whole place very peaceful and private - didn't even see another guest or room staff at all. Great. The only quibble is it just cuts tiny corners - so no mini bar, no in room safe. Nice touch sweets on the pillow - but only for one night - same with complimentary toiletries (which no-one ever really bothered about till the liquid restrictions when flying... these days we actually have to use them!!) there on check -in, but never replenished throughout the stay. To be fair we never called down and asked for more - I'm sure they would have been forthcoming, but shouldn't have to bother. This is not an expensive hotel - but it's not a budget one either - the look & feel & staff are certainly what you would expect from a hotel of this price and rating, but there are hints of budget about the feel of the place.", "Date": "August 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“Fantastic hotel!”", "Author": "holidaylover062", "ReviewID": "UR37449336", "Content": "Just got back from our trip to Berlin and could not fault the brilliant hotel - service was great and staff extremely friendly and on hand to answer any questions. Also brilliant location easy to reach the main town.", "Date": "August 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Valencia", "Title": "“Great hotel at great price... if you choose the good moment”", "Author": "miguikarpin", "ReviewID": "UR35167623", "Content": "The hotel is a 3 star hotel, but the rooms seemed taken from a 4-5 star hotel. The hotel has several style rooms. We stayed in a Lyfestyle room and we were impressed by the cleanliness, and the space. The room had huge windows which gave wiew to the Potsdamer Strasse, but we didn't hear a noise from the outside. The bathroom was extremely new and clean (the whole hotel seemed overall very new and clean). The staff was young and very helpful. The last day they offered us the possibility of buying underground tickets in the hotel, if necessary, and gave us 2 free drinks ticket for the hotel bar. The breakfast was expensive (11 euro per person and day), so we didn't have breakfast in the hotel. You have to take into account the price of the room changes a lot depending on the day (maybe depending on how many people is staying at the hotel, or the events there are in Berlin those days), so it ranges (for exemple, for whay I am seeing righ now) from 49 euro to 89 euro the Basic room, or from 59 to 89 euro the Lyfestyle room, or from 69 to 109 euro the Lyfestile plus room. There are also offers you can take, such as 15% discount if you book 4 or more days (but you lose your cancelation rights) or a 30% summer discount in some selected days. Overall, the hotel costed us 65 euros per night. The location is quite nice. Despite it has no monuments close (although you may walk the 170 house numbers through Potsdamer strasse until Postdamer platz, but it can take up to 30 minutes), it is close to 3 underground stations, specially the U2 line, which takes you to most of the important places of Berlin (or to a line which takes you to that places, making only 1 change of line). Overal, I liked MUCH this hotel, and I strongly reccomend it, specially if you can fing a good offer such as we did.", "Date": "July 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“Wunderbar”", "Author": "travellersfare", "ReviewID": "UR34848212", "Content": "What a pleasant experience this was,having booked the other Lindemann (the Fjord one) there was a problem and we were relocated to this one......by taxi with a free bottle of fizz. and it got better from there,with the rooms being fab,the location around 1000m from Potzdamer Platz right on a bus route and with a stop outside the hotel.in fact they even had bus tickets for sale at no premium. just down the road we found a fantastic Greek restaurant \"The Ypsilon\" and a fine little bistro doing Italian also within the scope of the hotel locale. The hotel staff were all wonderful and helpful.simply a perfect three night stay. Highly recommend this hotel if you are planning a visit soon. Berlin itself was a surprise....safe,clean,friendly,not what most large cities are like.And the culture is all around,a mixture of stunning Art Deco with the newer stuff being tastefully incorporated into the whole. More museums than you can do in month.You can even get your passport stamped at Potzdamer Platz by a guy in traditional DDR soldier's get-up. TOP DRAWER..", "Date": "July 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Sheffield", "Title": "“My friends were impressed”", "Author": "GreggSheffield", "ReviewID": "UR32291616", "Content": "This is a really nice hotel and excellent value for money. I knew what to expect after being on this site but my friends were walking past and saying this place looks nice and I had the delight to tell them it was where we were staying! We had large rooms on the 3rd floor facing the road, all very modern and clean with great shower so was right up out street. The staff are very friendly too, as was almost everyone we met in Berlin. If you're looking for cafe's restaurants local then the area around Nollendorf Platz is the place to go, Maassenstrasse has some nice place to eat al fresco. If we come to Berlin again we'd definitely book here again.", "Date": "June 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Groningen, The Netherlands", "Title": "“Great stay, very friendly staff”", "Author": "DrRobert78", "ReviewID": "UR30717345", "Content": "We stayed for 3 nights at the hotel when we visted Berlin for a short city trip. Ofcourse after reading previous reviews on this site. As most of the other guests we too had a very nice experience. We brought our dog and they very helpfull in providing us with what we needed. The hotel staff is very friendly. Rooms are nice, clean and luxurious. Breakfast buffet is good and complete. Different metro lines are in the direct vicinity (5 min walk) and all major sites are therefore closeby. Neighbourhood is multicultural and not suitable for small childeren or fine dining. Nevertheless, an absolute recommendation.", "Date": "May 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "NY", "Title": "“Great value, clean, new, good service, a little out of the way”", "Author": "foxlrf", "ReviewID": "UR29964563", "Content": "Stayed here for 6 nights for $100/per all in w/breakfast for 2. New, clean and modern design w/ friendly service. Near U and S-bahn stop four stops from main attractions of Berlin. The intersection around the hotel was a little seedy but 2 blocks in any direction leads to nice areas. Good place to stay for those wanting inexpensive, clean accomodations.", "Date": "May 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Good alternative to sister hotel”", "Author": "JenEricTravelers", "ReviewID": "UR28392929", "Content": "We were originally booked at the sister hotel, Fjord Lindemann but due to their overbooking ended up at this hotel. Although rooms were not available upon arrival they held our luggage for later check-in. Hotel is located somewhat far away from Potsdamer Platz but is located on U and S-bahn stops (Bulowstrasse) Hotel was modern, recently built. Well appointed with phone, tv (2-english channels), and necessary amenities. I would rate higher if the consolation of having to move farther out of the city was more than a bottle of sparkling cider/wine and breakfast instead. Surrounding neighborhood may not be as comfortable to walk in at night as during the day.", "Date": "April 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Copenhagen", "Title": "“Very controversial. Hard to rate.”", "Author": "Georgi_dk", "ReviewID": "UR27751199", "Content": "This hotel is both good and not so - even from the point of view if one person. I ordered a business package including parking, Internet access and breakfast for two. 110 EUR it cost me probably not the cheapest option in Berlin, but bearable. The hotel is about 30 minutes walk from Potsdama Pladz. Not so close! But take the bus 85M and it will take you there in no time. Rooms are exactly what you see on the pictures - you can trust them 100%. Ours was rather small and had absolute minimum: wardrobe, TV, small bed. It didn't have such usual things as coffee machine or minibar. Same time bathroom was very big with huge mirror and the best shower cabin I ever experienced. Bed in the room was rather small. Personally I slept very bad. Air conditioner didn't really cooled down the room. I found the pillow most uncomfortable in the world. But my wife slept well so maybe it was just me. Breakfast was in the lobby, which works as public bar outside morning hours. I'd say it was very decent but strange to some extend. For example it had traditional omelet and beacon, but missed beans and sausages. Check in was good, people are very sweet. If you asked me if the hotel is worth its money and I had a decent stay? I'd say Yes. If you asked me if I'd stay there again or recommend to friends. I'd say No.", "Date": "April 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Brilliant hotel - Great room, great service.”", "Author": "Slbazza", "ReviewID": "UR26043707", "Content": "Excellent hotel, got a great price through Expedia. Brand new and spacious hotel room with lovely wet-room style bathroom, huge shower, no bath. Warm, comfortable beds, massive windows overlooking street but very quiet. Good bar in lobby too. Did not have breakfast at the hotel so cannot comment but the service of staff was faultless. Great location for us but depends on reason for your visit - Berlin is pretty sprawling, so check it's near where you want to be, though transport links on doorstep. Highly recommended.", "Date": "March 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Madrid", "Title": "“Great hotel”", "Author": "chamdo", "ReviewID": "UR23370250", "Content": "Lindemann´s is clean, modern, well-decorated, comfortable, and offers great service. The only drawback is the location; it´s easy to get to the center and all the sights by metro, but it´s a bit of a walk if you want to go on foot. Still, the neighborhood is fine (residential) and a couple of metro tickets is a very small price to pay in exchange for the value and quality of the hotel.", "Date": "January 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Seattle, Washington", "Title": "“Terrific Value. Modern Hotel.”", "Author": "over40laidoff", "ReviewID": "UR23051052", "Content": "We chose this hotel based on the price and the few reviews available, which were favorable. The location is fairly close to a few metro routes. We found ourselves using the U2 most, which was about 4 blocks away. The neighborhood is not built for tourists. We did find a couple of good resturants and bars nearby. It just takes a little exploring. The room was sleek, in all black and white, with a walk-in slate shower. Its all very new, although it had an Ikea feel to it. Quite spacious and comforatable. I would have liked a second chair in the room, so that one of us didn't have to sit on the bed or the floor. Be careful when booking online. When I selected the rate with breakfast included, it calculated 'extra person fees' and taxes that amounted to $144 for our 4 night stay. We decided to skip breakfast, but the buffet looked nice and is available for 11 Euro/person. Overall, great value at $55/night!", "Date": "December 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Great hotel”", "Author": "Flowr", "ReviewID": "UR22867487", "Content": "When I read reviews I always wonder how like myself the writers are so: we are a husband, wife and four-year old: middle-aged professionals. We travel mainly to England, Florida and the Caribeaan. We loved this hotel. A fantastic value. Very close to everything and the staff were super helpful printing off maps and explaining the subway system. They were also great with our sometimes jet-lagged grumpy son. We enjoyed the breakfast--the coffee is fantastic. After reading other reviews we took our own soap, shampoo etc. but there was a dispenser in the shower we could have used. They do not provide face cloths (flannels for the British). We are completely techonologically challenged but after a few tries did not have too much difficulty with the door handles--maybe they have changed them. It was very clean, we felt very safe. They provided a roll out bed for our son. Beautiful bathroom in black slate. The room was not huge but perfectly adequate. No coffeemaker or fridge. TV got CCN and BBC news. No english kid shows. There was a hairdryer. We only ate breakfast there. I think they only offer snacks at other times but I did see another guest ordering in--the front desk has menus from local restaurants. The hotel gave us coupons for 5 euros off our breakfast each day on the one day we did not eat breakfast they took the 5 off our room bill. The alsatian restaurant recommeded by a previous traveller was great. The italian restuarant rec. by the hotel staff is fantastic. We also loved \"hundert biers\" restaurant. If travelling with children: we did not find many places that offered a children's menu or the toys/colouring pages we are used to in Canada--we took our own. Our son loved Lego land (I did,. too). Kindercity is similar to Toronto's Science Ctr. Kidspark--but not as good--and is mostly in german, so if you only speak English may not be a good deal. All the workshops: chocolate, cars etc etc are extra $, only in german and for 6yrs and up. He loved the rides at the Christmas markets. We are not big shoppers but we loved the atmosphere of the markets. We loved the story of Berlin museum, the Dom, the old masters art gallery. Were a bit disappointed with the zoo--prefer Toronto's.", "Date": "December 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“This was perfect for our stay”", "Author": "Gosomewherenew", "ReviewID": "UR22739898", "Content": "We spent 3 nights here for the Xmas markets and we couldn't fault the place. The rooms were stylish, clean and the beds very comfortable. We were on the front of the hotel on the 4th floor and we weren't affected by traffic noise as mentioned in a previous review. The staff were exceptionally friendly and helpful and the price was brilliant value. We didn't have breakfast but we did make use of the bar after a long day sightseeing.... The immediate vicinity isn't brilliant for bars and restaurants, but this isn't an issue because Berlin has one of the best transport systems going and there is a bus stop directly outside the hotel. Buses from here will take you directly to the Brandenburg Gate in ten minutes and we never waited longer than a few minutes for a bus to arrive. It also has an underground stop 5 minutes away which in 45 minutes including a short bus journey the other end gets you to Shoenfield airport for a few euros.", "Date": "December 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Spacious rooms, clean and efficient.”", "Author": "bckrSTHLM", "ReviewID": "UR22473352", "Content": "We stayed in one of the larger rooms at a superb rate with a terrace connected to the room. The hotel is modern, clean and quiet. The rooms are spacious with fresh bahtrooms, nice beds and a modern light ambience. Really very nice. I did not really enjoy the breakfast as the restaurant is a bit too sterile for my taste... but hey! At the price given i would happily stay and have breakfast there anytime again! It is a nice and basic place too sleep if it is sleep you look for. Coctails and hustle bustle barlife is all out there outside the hotel i alla of Berlin.", "Date": "December 5, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Chicago, Illinois", "Title": "“LIndemann Hotel, Berlin”", "Author": "sosinchi", "ReviewID": "UR22371276", "Content": "I stayed here for 3 nights last week. Great hotel and very helpful staff. I didn't bother posting my pictures of the hotel because everything is completely brand new and in excellent condition - exactly as you see posted on their website. By far the best hotel I stayed in during my 2 week in Germany and Austria, and surprisingly, the cheapest as well. The hotel is in a good location, albeit a bit of a hike to some of the main attractions if you're walking. It was rather cold while I was there so I cabbed to most of the places I went and never paid more than $10 to get anywhere. I highly recommend springing for the breakfast that they offer - its well worth the money. I stayed in one of the \"Lifestyle\" rooms which is a bit larger than the Standard room. While it was a great room, if I stayed there again I would stay in a Standard room. The Lifestyle rooms face the front of the building and you hear a lot of noise from traffic well into the middle of the night (which you become painfully aware of if jet lagged like myself). The hotel is on Potsdamer Strasse which is a 4 lane major thoroughfare for the city. The Standard rooms face the back of the building where there is just a parking lot and I suspect those rooms are much quieter. I hope to get back to Berlin soon and will definitely stay here again.", "Date": "December 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Absolutely wonderful customer service and location!!!!”", "Author": "WorldCitizen2009", "ReviewID": "UR22139931", "Content": "We had a wonderful 3 day stay at this hotel. The acommodations were equivalent to 4 and 5 star hotels we stayed in in Prague, Budapest and Vienna. It is a brand new hotel so the entire facility is spotless. All linens, furniture, and fixtures are new and modern. We paid $72 cad. per night. The location is strategic and central. We were a 20 min. walk away from every single attraction and site in Berlin. We walked everywhere the entire 3 days we were there. The street has several markets, restaurants and a Lidl grocery store around the corner where you can purchase wines and cheeses for 1 euro. Absolutely incredible! All the restaurants were cheap as well as shops on the street. Potsdammer is the main street (the hotel is on this street) with most attractions. Our stay was memorable because of the friendly and extremely knowledgeable staff who had information on everything possible we could ask them. We took a train from Berlin to Vienna. The station is 15 minutes away from the hotel. A great convenience! Most of the guests seemed to be European. The breakfast is geared to this group. We did not have breakfast at the hotel since there are half a dozen cafes and bakeries on the street where we stopped off for treats. Loved it!!!", "Date": "November 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "uk", "Title": "“wow what a place!!”", "Author": "theamericandiner", "ReviewID": "UR19680753", "Content": "this place opened only 5 days ago and what a place stylish good location fantastic price polite staff friendy lovely breakfast a really great place if you are going to berlin go here its fantastic sorry i love it!! photos arent very good sorry", "Date": "September 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London", "Title": "“Some good qualities but still not quite there”", "Author": "g109", "ReviewID": "UR19679220", "Content": "This is a new hotel that has just recently opened with all of the issues that that might ensue. There is so much positive but there is also a lot more that could be done that wouldn't take much effort on the hotel's part, but would create a much better experience for the clients overall. The hotel staff is an asset - one staff member especially provided excellent service - the others tried very hard although did not quite reach the same level. The rooms are of a good size and have excellent storage space. In-room wifi is a reasonable EUR5 per day, although it really should be included in the room rate. Breakfast appears to be reasonably priced at EUR11 although we declined to take it. The shower is excellent. The rooms offer plenty of natural light due to their massive windows looking out onto Potsdamer Str. Unfortunately, the designers failed to take into account the fact that guests might wish to enjoy the natural light while not necessarily wishing the entire street to see what they are doing. Consequently, the windows could either be covered by thick blackout drapes or not at all - why could they not have provided window nets for example? There was no safe in the room at all and the door lock to the room was made unnecessarily complicated - it took at least 3 attempts to open it every time, even after a few days of getting used to it. No mini bar either. What really disappointed was the lack of toiletries in the room. The bathroom consisted of a single soap dispenser located over the sink, which meant having to get out of the shower just to get some soap. It turns out that there is no complimentary soap/shampoo available and these items are charged for at reception. This is disappointing when the rate hovers around EUR90 per night. Housekeeping is also poor - there was a large amount of dust on the bedside table which wasn't cleaned at all during our stay. The hotel is well connected to the public transit network in Berlin and reaching all parts of the city and its airports is very easy. Nevertheless, the neighbourhood is one of the less affluent of the city and while it felt perfectly safe to us, other travellers might have a different impression. I put some of my thoughts to the receptionist on checking out but they were immediately dismissed and I was told simply to close the blackout drapes if I had wanted privacy. I would consider staying here again only as a last resort - it could be so much better, the potential is there and the staff is certainly willing, it just needs some fine tuning and it could be a decent hotel.", "Date": "September 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sweden", "Title": "“New hotel in excellent location”", "Author": "MariaHSweden", "ReviewID": "UR19570751", "Content": "My husband, me and a couple of our friends just returned from a 2 night stay at Lindemann's. The hotel had opened the day before our arrival, so its brand new, modern and very clean. The staff was friendly and helpful at all times. We arrived very early for our check in after a long night travelling, and they had no troubles in giving us our rooms, we just waited half an hour for them to be cleaned and were able to rest and shower before heading to town. The hotel is very close to 2 U Bahn stations. (Bulowstr. and Kleistpark) that take you very quickly to anywhere in Berlin. Trains run often so you have no problem getting around. You can buy day, group and single passes at the hotel. Depending how much walking you'll be doing it might be enough with 2 single tickets per person per day. We used one ticket to get to our starting point and then walk from there. Then use another ticket on the way home. I would recommend you take cash with you, since most of the restaurants do not take credit cards, only cash. We had breakfast at the hotel, which was also very good and with lots of options (fresh bread, fruit, yogurth, lots of hams and cheeses, eff, bacon, cold and hot drinks etc...) It cost 11 Euros if its not included in your package. There is also parking at the hotel, which was included in our room, but I think it costs like 8 Euros for every 24 hour period. I can very highly recommend this hotel! Maria Holm", "Date": "August 31, 2008"}], "HotelInfo": {"Name": "Lindemann's", "HotelURL": "/ShowUserReviews-g187323-d1006459-Reviews-Lindemann_s-Berlin.html", "Price": "$66 - $1,245*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Potsdamer Strasse 171-173</span>, <span class=\"locality\"><span property=\"v:postal-code\">10783</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "1006459", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/a3/f8/a3f86e0e54fed6cea911798b46842b1f5large.jpg"}}