{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "detroit, michigan", "Title": "“Long time customer never disappointed! Great Friendly Staff”", "Author": "cjmack", "ReviewID": "UR123553733", "Content": "We have been staying at this hotel for several years and have never had any issues. The rooms are always clean and ready when we arrive whether it's before check in or late evening. The breakfast is always ready when it is supposed to be and items are fresh and restocked when they become depleted. Close enough to the expressway but not too close that all you hear are the semis rolling by. Good food/restaurants along with fast food close enough via the car. (within a few minutes) Downtown is less than 10 minutes away if you want to go shopping at the mall. No issues at this hotel! Will be staying there next Jan again and maybe in April of 2012 (if we decide to return to Indianapolis). Spacious rooms is a plus at this suite hotel. Some hotels claim they are \"suites\" but you are cramped in. Partial divider between pull out sofa and beds make it nice! You won't be disappointed.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South Carolina", "Title": "“Clean and comfortable, very friendly service”", "Author": "icecream1pharm", "ReviewID": "UR122595949", "Content": "We just returned from a several day trip and stayed at this Comfort Suites. We were greeted by friendly desk clerks. The hotel is very comfortable and clean, rooms were very spacious. The breakfast was adequate for our purposes, included in the room cost. Overall very pleasant experience.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montana", "Title": "“Great: price, friendliness and location!”", "Author": "beessarebest", "ReviewID": "UR122428217", "Content": "We will be returning to this hotel. Why? Because the price was terrific and offered us a large suite type room with continental breakfast. (The kinds of continental breakfasts offered at these type of hotels are not that great but that's not why we stay at there.) The location gets you quickly downtown or to the airport plus Steak n'Shake is right across the street!!!", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "South Bend, Indiana", "Title": "“Comfortable, clean, convenient, congenial!”", "Author": "JustaHoosier", "ReviewID": "UR120824519", "Content": "Two of our friends got married, and arranged for out-of-towners to stay at the Comfort Suites-Indianapolis on Kildeer Drive (Southport Rd. exit on I-65). What a great place! The suite was fine, the bed was comfy, the place was very clean and the staff was terrific! And you couldn't beat the rate they offered for the wedding guests! Downtown is just a short drive away, and the hotel is surrounded by good places to eat, including one of Jimmy Buffet's \"Cheeseburger in Paradise\" outlets. If you are some big-time celebrity, you won't be interested in this hotel. But if you are an average middle-class couple who is looking for a clean, comfortable place to stay in Indy, offering free breakfast, check out the Comfort-Suites on Kildeer Dr. on the south side of Indy!", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Sevice as it should be everywhere...”", "Author": "Travelin_man0001", "ReviewID": "UR119812881", "Content": "Friendly and outgoing describes the staff and completely satisfying describes the facility.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Comfort suites”", "Author": "DeLando M", "ReviewID": "UR119413105", "Content": "HillaryMills Very sweet and helpful great room . Wish to meet more people like her.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "traveling", "Title": "“2nd time here, good as the 1st..........”", "Author": "TravelingFishnet", "ReviewID": "UR118840147", "Content": "newer facility, convenient to several area restaurants. far enough off highway to be quiet, but still convenient to I-65. very friendly staff, spacious clean rooms, frig/microwave, comfortable bed. breakfast is quite adequate....pastries, fruit, yogurt, cereals, hard boiled and scrambled eggs, and sausage (although i have to admit it was \"different looking\"). lots of area restaurants nearby.", "Date": "October 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“I'm hard to please but this place pleased me!!”", "Author": "Haynesworth1", "ReviewID": "UR117471780", "Content": "I live in an Indianapolis suburb called Carmel. I came to this hotel to shut myself in to pray. As a pastor I needed to seek some answers for several major issues. From the time I talked with Melissa, then jaimee, then Hillary I knew I chose the right hotel. I've traveled around the world and I haven't found a nicer staff or as clean and comfortable a hotel. A#1 in my book.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Manager service (Hillary) is outstanding”", "Author": "pentor1", "ReviewID": "UR116691194", "Content": "We chose this location on our family trip back home based on ratings from Trip-Advisor and recommendations on Google Maps. We were not disappointed in the least. Hillary was the front desk manager. When she didn't have the room we needed, she gave us the best alternate at a reduced rate. Additionally, she was willing to refer us to another nearby hotel if we were still unsatisfied. I can't speak highly enough for the service she provided. The room was clean and comfortable. I'd recommend this location to any friend.", "Date": "August 14, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London, Paris", "Title": "“Lovely property”", "Author": "Kevlondon", "ReviewID": "UR116120332", "Content": "This must be a nearly-new hotel as it's spotless inside and out. Room was one of the smaller ones in that it was a junior suite rather than full suite, but still plenty spacious enough. Breakfast was good. Only minor gripes - flat-screen TV was fixed to the wall and could not be angled, meaning it could only be watched from the bed and not the sitting area. Pool was indoor and very small - shame they didn't plan to make it a more useful size. Still nice and refreshing. Close to several restaurants and easy to get out of the city.", "Date": "August 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“A great place to stay.”", "Author": "GCBurge", "ReviewID": "UR116036531", "Content": "We were driving from Asheville to Chicago and ran out of steam near Louisville. A quick look at TAdvisor found this hotel south of Indy. Super clean. Very friendly. New large suite rooms. As loved it. Constance is at the desk and she is professional, cheerful, and super-helpful just like the last reviewer said. You won't regret staying here. Plus it is surrounded by many restaurants.", "Date": "July 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Great Customer Service!”", "Author": "jendawg11483", "ReviewID": "UR107299173", "Content": "We always stay at this Comfort Inn and Suites whenever we have our grad school class in Indianapolis. Melissa and Constance are amazing, so nice and very helpful! I'd definitely recommend this hotel and will come back whenever I'm in town!", "Date": "May 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Charleston, South Carolina", "Title": "“Pretty Impressive”", "Author": "smithjpTurbodog", "ReviewID": "UR92533353", "Content": "My two young children and I stayed for two nights for a wedding. The room offered a large king sized bed with lots of comfy pillows and bedding. It also offered a hideaway bed in a couch. The room also offered a closet to close clothes up inside rather than the typical exposed closet by the bath room. The bathroom was roomy and pleasant - typical hotel bathroom except a nice size and clean. The room decor was very pleasing - it didn't feel like this was some age old hotel. The hotel also offered an impressive workout room with a full set of free weights, half and whole balance ball, treadmill, eliptical, weight machine, water, lots of towels and it over looks the salt water pool with hot tub. The breakfast was fine - lots to chose from though the eggs were not very good. Though the carb selection included bagels, oatmeal, cereal, and fresh waffles. I highly recommend", "Date": "January 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "manlius il", "Title": "“Nice”", "Author": "piplinerswife", "ReviewID": "UR90688694", "Content": "By accident we turned into this parking lot while looking for another hotel. I'm glad we did. Not over priced it's very clean and very modern. The front desk staff was very helpful. Comfortable beds and large rooms. We will be back", "Date": "December 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Colorado Springs, Colorado", "Title": "“OK Stay, If It Fits With Your Location”", "Author": "marcolius", "ReviewID": "UR88421954", "Content": "This one had the strengths of other Comfort Suites: Big, comfortable, clean, modern room,with good bedding. Very nice staff. It's right off the highway, but not really close to downtown Indianapolis. Lots of dining options in the area, however, the entire neighborhood smelled of fast-food frying. Breakfast also wasn't quite as good as I've had at other properties of the same brand, and they weren't as good at keeping it stocked. Slow, unreliable wireless connection with many interruptions was a disappointment.", "Date": "November 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berea, KY", "Title": "“A nice place to stay with an accomodating staff”", "Author": "papagrit", "ReviewID": "UR79126615", "Content": "My wife has had to have surgery in Indianapolis twice this year and we have had to have other doctor visits before her surgery and as I have had luck with most (not all) Comfort Suites, I though this one seemed ok according to the reviews. The little night hostess has been there every stay and knew us after only two trips there by last name when we walked in the third time in a four month span. She works hard to please the customer and was very impressive with her service for us each time we stayed. We even complimented her to the manager the next day before we checked out after our second stay. The rooms are huge and everything is very clean. I usually leave a tip when the room in a motel looks like an extra effort has been made to clean it up well and have left one here all three stays. We will be back there later this month and I hope that this great service during these trying times of illness for my wife continue as they are much appreciated. Ask about the discount rate if you are going to local hospitals for sugery/ appointments as this makes a great place even better with a great deal. (We were told about this by the night hostess.....Thanks!!)", "Date": "September 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Schoolcraft, Michigan", "Title": "“Very nice, quiet and reasonably priced”", "Author": "hockeydad49087", "ReviewID": "UR73913072", "Content": "I stayed here because my reservation at another hotel down the highway was messed up and they were fully booked. It's a little tricky to find (it's behind the Speedway gas station), but it's close to the highway along with other comparable hotels. Being a walk-in, I was expecting a high price, but the price was actualy $10 cheaper than the other hotel I tried booking...bonus for me. Extremely nice, clean, up to date room. I didn't try the buffett, but there was a Cracker Barrell within walking distance as well as other restaurants close by. No gripes or suggestions at all. Would definately recommend it.", "Date": "August 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Berlin, WI", "Title": "“Great stay!”", "Author": "p05dbon", "ReviewID": "UR57411913", "Content": "We stayed at this hotel as we were traveling to South Carolina. Great location and very new and clean! Right off I-65. We had a very spacious room with separate sitting area. Breakfast was also good. Highly recommend.", "Date": "March 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Iowa", "Title": "“Nice, new hotel!”", "Author": "jmebagen", "ReviewID": "UR27945176", "Content": "I have stayed here on a couple occasions and would stay here again when in the area. It is a new hotel with nicely decorated rooms and amenities. Like most Comfort Suites the rooms are huge with a nice sofa area. It is in a very nice area with many nearby restaurants and stores. The staff is very friendly and accommodating as well! It's a great place and a great value!", "Date": "April 13, 2009"}], "HotelInfo": {"Name": "Comfort Suites Indianapolis", "HotelURL": "/ShowUserReviews-g37209-d1008647-Reviews-Comfort_Suites_Indianapolis-Indianapolis_Indiana.html", "Price": "$103 - $115*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">4125 Kildeer Drive</span>, <span class=\"locality\"><span property=\"v:locality\">Indianapolis</span>, <span property=\"v:region\">IN</span> <span property=\"v:postal-code\">46237</span></span> </span> </span> </address>", "HotelID": "1008647", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/b1/74/b1740a258bbb5b8ae4aa8df88e3ad43f4large.jpg"}}