{"Reviews": [{"Ratings": {"Overall": "4.0"}, "AuthorLocation": "DC", "Title": "“Wonderful stay”", "Author": "Kellia", "ReviewID": "UR127891563", "Content": "We only stayed for one night and enjoyed every minute of it here. The hotel was a bit tricky to find, as other reviewers have stated. The decor is modern and colorful, full of character. The employees were very kind and welcoming. The only complaint is in the bathroom. The glass shower door would leak water and leave the floor wet. Not a big deal, but it did cause it to be slippery. Wish all our hotels that we stayed in during the trip were this beautiful!", "Date": "April 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Lovely Hotel...Nice Location”", "Author": "Miss K N", "ReviewID": "UR127852746", "Content": "We stayed here for 4 nights and it was more than what I expected for the price. I have already recommended to two friends as it was great quality and in a perfect location. Hotel Room The room was cosy, modern and at a reasonable rate. The only downside was the bathroom gets very wet! Staff Always smiling, helpful and are happy to map routes to the tourist areas and places to eat. They will also give tips on how much you should pay for a gondola ride etc. Location Away from the busy tourist areas and crowds but conveniently located. We loved the 20 minute walk through the quiet alleys and really taking in the atmosphere before we met the crowds. All the tourist sites are clearly signed.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great little cozy hotel!”", "Author": "Fredy_Marx", "ReviewID": "UR127263486", "Content": "Stayed there for a couple of nights, and was very impressed for a hotel in Italy. By my experience, hotels standards here lower than let's say in Portugal or Spain. Nevertheless, quite impressed with this one. It's on a back street, away from the tourist trail, and very quiet. It's 20m walk to rialto, right off the riva biasio boat stop, so perfect for airport taxi drop-off. If I could change anything, would be the rather stiff mattress, provide proper WiFi coverage (not the rubbish 5 hour voucher coupon to poor coverage), and actually have some international tv channels, rather than 20 Italian ones. The shower was amazing, and the breakfast good throughout. The awkward thing about breakfast were the low tables, with couch type chairs. It felt like I was sitting 2 feet away from the table! Despite all these querkyness, I'd definitely return here.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brussels", "Title": "“Very good choice”", "Author": "rcd1129", "ReviewID": "UR125978367", "Content": "Exceedingly friendly, helpful and efficient staff, comfortable beds, cozy and quiet rooms, free wi-fi, conveniently located to everything yet away from the crowds. And at a very reasonable rate.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“What an incredible hidden gem!!!”", "Author": "JenifaHaych", "ReviewID": "UR125203020", "Content": "This is by far one of the best hotels I have ever stayed in. The attention to detail throughout is second to none. The cleanliness is impeccable. All staff are incredibly polite and helpful. The decor right through is amazing. Breakfast couldn't be any better. The location is perfect. As others have said, it's a bit tricky to find initially - doesn't help that there's no large sign outside with the hotel name on, but once you've found it it's so easy to find again and again, and the lack of signage means the hotel blends in well with the other buildings around it. The hotel is a 5 min walk from San Stae on the Grand Canal which is the closest stop on the Orange Line for getting the Alilaguna from the Airport. Its about a 15 minute walk to Per Rialto, and about 30 minutes to Per San Marco. It's so nice to retreat away from the more lively places back through the quiet old Venetian streets back to this hotel. Only slight grumble is we had upgraded in advance to a superior room, which are on the 3rd floor. The room was beautiful, but the wifi signal did not reach the 3rd floor, so to get Internet access we had to sit in the lounge on the 1st floor. Not a big issue for most people, but a real irk for a techie like me!", "Date": "February 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“fantastic hotel!!!”", "Author": "ellsnffc", "ReviewID": "UR125134021", "Content": "What a beautiful hotel!! Staff are excellent, extremely friendly and helpful, and the daily maid service is fantastic. The room was absolutely beautiful - the decor is prettiest of any hotel i've ever stayed in by far, everything was so clean even the high ceiling, and everything you could possibly need is catered for - even down to a pen and a bookmark left for you on the bedside table. The bathroom was spotless with all of the extras you could need, even a shoe shine kit - and the hair dryer was better than the one i have at home (which i had packed 'just incase') ...also the actual shower itself was lovely, a MASSIVE shower head, heavenly after a long days walking around beautiful Venezia! The attention to detail and the cleanliness in this hotel is immense, both in our room and in public areas. I really reccomend it - stop your search for the perfect accommodation now and book here. Just fantastic. As for location, i found it to be perfect, when i read reviews on here i expected to be miles out but your really not, you're right near the train station which is a really buzzing area, (called ferrovia), but you are indeed up a side street so you dont get any noise. Spot on really. I found breakfast to be excellent, continental of course but a huge amount of choice, - the ham and eggs is lovely, toast, breads, pastrys, all the jams under the sun, cold meats, soft cheese, fruits, yogurts, british cereals, i could go on youre spoilt for choice really, - i was sad that i'm not a big eater at breakfast time as it was all so nice haha. In a nutshell, you wouldnt regret booking this amazing hotel in this amazing city, just brilliant, the photos dont even do it justice. A trip of a lifetime and this hotel just adds to the whole holiday. Thankyou Ca Zusto for a brilliant stay.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Wroclaw", "Title": "“Good”", "Author": "Pawel_EPWR", "ReviewID": "UR124650318", "Content": "The reception staff were lovely and spoke very good English. Good location and close to Venice's railway station. The room was very recently renovated. Great shower and comfy bed. The breakfasts were great. No tea/coffee making facilities in the room. Minibar very expensive!", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Strasbourg", "Title": "“Very nice stay at the hotel”", "Author": "monty1Strasbourg", "ReviewID": "UR123009683", "Content": "We travelled to Venezia just after our wedding and were very nicely accomodated. The staff was very warm and spoke very good english. We had the deluxe room which was clean and nicely decorated. The breakfast was very good. Overall, I recommend this hotel in which we spent a pleasent stay. Congratulations to the staff, keep going!", "Date": "January 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Loved our stay in Venice!”", "Author": "Soniaa13", "ReviewID": "UR122687339", "Content": "Domina Home Ca'Zusta was a great base whilst in Venice and very easy to get to all the attractions. It is a hidden gem away from all the other tourists, so if you want peace and quiet than this is the place to relax. The staff are very helpful, we had a problem with the first room we checked in to, with the shower and so they kindly moved us. The rooms are lovely with a modern Venetian look. Whilst in Venice we decided to do a day trip to the Dolomite mountains - if you get a chance it is worth doing this, as lovely as Venice is, the Dolomites are amazing and it's hard to believe that a place like this exists just an hour drive away from Venice, it felt like we were in Switzerland.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Santa Barbara, CA", "Title": "“Magical stay in Venice”", "Author": "nyladee", "ReviewID": "UR121669671", "Content": "The Domina Home Ca'Zusta is a lovely home base in Venice. The rooms are exciting in decor and all the colors are so warm thru out. The breakfast experience was lovely with international newspapers to add to the homey feel. The staff was incredibly helpful especially with our dash to the airport at 4:30 AM! Look forward to staying there again!", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Paris, France", "Title": "“Very good and quiet!”", "Author": "Richard L", "ReviewID": "UR121666733", "Content": "We stayed there for three nights in October 2011. The hotel location is very convenient as its close to the vaporetto's first stop on Line1. You can also walk from the train or bus station. From the hotel, walking to Rialto is confusing at first but once you get your bearings, you should be able to go around the sestiere (district) easily. Most of Venice's sights can be accesssed from there (30mins walk max) and you can always go for the vaporetto when tired. The hotel is very, very clean. Everything feels brand new without altering the charm of the old building it occupies. The bathroom was well-equipped and tidy. Staff was very helpful and pleasant. Because of the way the lobby is designed, you can't always see that there's actually someone there but even when we had to ring, the person in charge was always there to help us out. The breakfasts were good which is a big plus compared to the usual Italian fare. The other comments are right about the awkward table design in the breakfast room but it did not prevent us from enjoying our meals every morning. The downside: our room was on the ground floor and hence a little dark (but we didn't stay there during the day..obviously). We could hear people talking loudly and drinking on Saturday night but they were probably lost tourists as this area is really quiet at night (by the way, the whole of Venice is rather quiet at night.... but this area is dead calm so sleep is usually undisturbed). In short: it's beautiful, it's clean, it's lovely. Highly recommended.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Excellence in Venice”", "Author": "GHWSydney", "ReviewID": "UR121035677", "Content": "Very convenient, first ferry stop from Termini. Staff are so friendly - the best in Italy, and service is great !! The room and bathroom are small but they are impeccable, renovated and modern. All amenities are wonderful. Breakfast is really lovely. The only issue is that the beds - although clean and felt wonderful to relax on - gave me back pains (I'm a side-sleeper). However, my 17 yo son did not have issues. Highly recommended.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "hong kong", "Title": "“A nice hostal in venice”", "Author": "van v", "ReviewID": "UR120578935", "Content": "It is small but it seems to be renovated recently. It is clean and located very close to train station Only one people work at the hotel all the time but his service is great and introduce us a good place to have dinner. This is an excellent meal in venice.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Farnham", "Title": "“Perfetto!”", "Author": "RoydiniFarnham", "ReviewID": "UR120239220", "Content": "This Hotel is small, discreet, handily placed,but beautifully furnished not just with decor that crosses uniquely between retro and the adventurous, but with staff and a Manager that know there is a choice and go the extra mile for the guests. If you want spacious luxury with 24 hour room service this is not for you, but if you want clean, comfortable, modern, and a quiet location , look no further.You can walk to Rialto in 20 minutes or catch the Vaporetto , just 2 minutes away. If you can negotiate a price at less than 200 Euros a night you will not be disappointed.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great hotel, great location but could have done with a coffee”", "Author": "Sean K", "ReviewID": "UR120068989", "Content": "We really enjoyed this hotel. The staff were very helpful and cheery, and did all they could to assist. The breakfast was excellent (for Italy) and the quality of the room was first class. Looking at the map, you may think that you are far from the major sights but not so; Venice is compact and there are things to see throughout the city. The peace and calm of the hotel's location is a welcome contrast to St. Marks Square or the Rialto area. Our only gripe was with the lack of coffee outside of breakfast time. The hotel provided coffee at breakfast but hot coffee was unavailable at any other time. We would suggest some tea/coffee making facilities in the room.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Wonderful location away from tourist hotspots allows you to experience charming Venice; excellent rooms and good friendly servic”", "Author": "RRemsing", "ReviewID": "UR119807883", "Content": "We stayed for four nights over Easter and loved the location the rooms the very tasty breakfast pastries and would love to return... would not hesitate to recommend...", "Date": "October 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bridge of Weir, United Kingdom", "Title": "“Great location and nice rooms”", "Author": "Alison F", "ReviewID": "UR119566230", "Content": "Really enjoyed my stay in this hotel. THe room lived up to the pictures I saw when booking. Nice decor and furnishings, lovely bathroom. Verrrry quiet in the room, couldn't hear anything outside or in the hotel. Only complaint would be the bed frame was a little creaky, but very comfortable and good quality mattress. Short walk from the railway station (but not in any sleazy railway station type area you might worry about) very near to a water bus stop and within walking distance (20 mins?) of st marcs square. Breakfast buffet in nice dining room, with pots of tea!!! a real boon for tea thirsty Brits. Unfotunatly no kettle in room so make the most of it! Near to restaurants which were not obviously tack or aimed at tourists. Would definetly recommed this hotel!", "Date": "October 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ayr Scotland", "Title": "“Four wonderful days in Venice!”", "Author": "CalebAyrScotland", "ReviewID": "UR119563579", "Content": "We had never been to Venice before and loved the city and found the location of the hotel ideal and easy to find. We bought 72 hour boat passes (33 euros) and managed to travel around the city and islands.We enjoyed Murano and Lido where the film festival is held every September. We regularly jumped on boats and arrived at unplanned destinations for lunch and tea! Our hotel room was on the first floor near the breakfast room but we never heard any noises or got disturbed. The room was large, very comfortable and clean with a super bathroom. The staff were helpful and gave an excellent service. The only thing we found odd was that for a four star hotel there was no bar or restaurant on the premises. The lounge doubled as the breakfast room each morning and each room had a mini bar but there no facilities for making/buying tea/coffee/drinks. There were pleny of local cafes etc where we ate but I missed not being able to make or buy a hot drink.The hotel staff offered to make us coffee but this was not always convenient. I would stay here again and would have no hesitation in recommending the hotel to anyone else. Great holiday and one of the best cities we have ever visited in Europe.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bloomington, Indiana", "Title": "“Best hotel I've stayed at in Venice”", "Author": "gardenerBloomington", "ReviewID": "UR119153573", "Content": "I've been to Venice many times and this is by far the best hotel I have ever stayed in. As an American you are used to nicer hotels, but european hotels are....more like a bad Motel 6 experience to say the least. You put up with it because well.....You are IN VENICE! Or Paris or somewhere else spectacular. But, I was pleasantly surprised by our hotel. I must say that finding it was not easy, but wondering around in Venice is never a bad experience. The front desk staff were very nice and helpful. You will have to get an internet access code every 2 hours, but they had surprisingly good internet access. The rooms were very large compared to european standards and very clean. Our bathroom was also HUGE compared to european standards and we also had a large rain showerhead and a shower door! I was thrilled. Our room had french doors that opened onto a small cobble stone courtyard and a minifridge. They also had the biggest towels that I've ever seen in Italy. The location was wonderful. You just follow the signs to St. Mark's or Rialto and you can walk anywhere. We did get lost one night, but that was part of the fun of it. It is in a quite location but even in the back area's of Venice there are plenty of restaurants and shops right around the corner. I would definately stay here again.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Amazing rooms. Great location. Loved it!”", "Author": "hobbes23", "ReviewID": "UR119068472", "Content": "We stayed here for 2 nights as part of our honeymoon. We followed other travellers advice and had a good idea of how to get there from the train station beforehand. Because of this we found the hotel quite easily on foot from the train station in 5 - 10 minutes and we were totally blown away with our room. It was a large room/suite and everything was immaculate. We loved the vibrant colours and everything was fresh, modern and clean. It had 2 TVs! Breakfast was a little disappointing as it did not have the variety we had experienced in other hotels during our trip but it is a small hotel and staff were attentive and helpful. The hotel is located away from most of the crowds but we were only 2 min walk away from a vaporetto stop on the grand canal which took us to everything we wanted to see. Venice is amazing and we loved it more than we ever thought we would. Staff were friendly and helpful and we would definitely stay here again if we are lucky enough to come to Venice again.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Great location, nice hotel & how to reach Burano easily”", "Author": "WheretoNextNewYork", "ReviewID": "UR118741269", "Content": "We had a nice stay here. It was our third choce as our top two were booked - we waited to long to book. Breakfast was adequate but of our 3 mornings there only once did they refill the scrambled eggs and for a breakfast that runs 3 hours at 9 am re filling eggs should be standard. Modern decor. Didn't expect the circus colors of the walls. Not traditional Venetian decorating. Hated the bathroom. Obviously designed by a man. Not place to dry a towel or place your toiletries. Why is this an issue in so many hotels?? Is a shelf or a towel bar too much to ask. Not even a shelf in the shower for soap/shampoo/razor??I get form but a little function goes a long way towards enhancing a hotel experience. Easy to reach - Riva de Biasio stop on the vaporetto. Take a left off that make a right at the wall. Hotel is on your right at the small tree out front. Easy location with bags. Also easy to get to Burano/Murano/Torecello - take the 52 from Rivio de Biaso stop to Fondamente Nuova then the 42 to Murano or Burano. From Burano then an easy transfer to the #12 vaporetto to Torcello. A 45 minute trip vs an hour + a half plus if you leave from San Marco and take the LN to Punta Sabbion and then transfer again. Room was clean & hotel was well maintained. I would recommend.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“not so far from the maddening crowd, but tranquil!”", "Author": "Homecomfort4me", "ReviewID": "UR118381497", "Content": "We have just returned from a long weekend in Venice. My partner had never been, but I was familiar with the press of crowds and general scrum round San Marco. This hotel is just off the grand canal with almost no way of getting lost (not something that many places can claim in Venice!). It lies in a proper Venetian area with lots of local restaurants frequented by Venetians not so much by tourists. The hotel rooms are kitted out in a unique and thoughtful way; very comfortable furnishings and decent sized rooms. A good functioning bathroom with spa bath is also a rare treat in Italy. Breakfast is continental but with excellent coffee. There is no bar or restaurant, but with so much around, who cares? An excellent find.. we shall be back!", "Date": "September 20, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "new york", "Title": "“Finally- my home in Venice”", "Author": "FrustratedTravelor", "ReviewID": "UR118249050", "Content": "Italy is very expensive- Venice ( with the weak dollar ) is off the wall. Never thought i would say that a $300/night hotel is fairly priced- and mid range-- but- have been to Venice many times- stayed at many hotels- and never happy until now If you fly to Venice- you can walk from where airport bus drops you off- if you arrive by train- walk even shorter An old building- so totally re-done and solid- that free Wi-Fi only works in first floor lounge.. Rooms painted bright colors- nice bath- good breakfast ( my only complaint was you had to beg for really hot coffee ) How can you tell a special hotel? The rooms can't take an American outlet plug- asked desk for adaptor- they didn't have- but by 10 AM next morning- one was bought for my use The location- it is in a very quiet residential area- and most people walk south to a small square with 3 just ok restaurants- but if you walk north-a few minutes more- over the bridge toward the railroad station- and go right- you are on the longest street in Venice- busy and loaded with everything. Suddenly you are not \"out of the way\" at all. TIP- the Vaporetti at 6.5 Euros per ride is crazy expensive- you can walk- but buy a pass for unlimited rides- it gets cheaper the longer the number of days you buy . 36 hours gives you two days/one night if bought in morning. Also - when you get tired of paying 40 Euros for a pizza, a beer, a water, and a salad---- find Brek- on street i mention above- a self service restaurant- where two people can eat like a pig for 35 Euros- You will leave this joint with a smile.- we did.", "Date": "September 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Ponta Delgada, Portugal", "Title": "“Just perfect”", "Author": "Joao39", "ReviewID": "UR118001943", "Content": "We loved staying in this hotel. Grat location, far away from the crouds but in the heart of Venice. The staff was excellent and the hotel is beautiful. We recomend this hotel.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "istanbul, Turkey", "Title": "“Very nice Hotel”", "Author": "Istanbulsteve", "ReviewID": "UR117260228", "Content": "We enjoyed our stay here, and Venice was beautiful. The Hotel was not easy to find, and their e-mail directions were hard to follow, but the people were very nice and helpful and the room was wonderful. Breakfast was good as well. It is very near the water taxi stand and two stops from piazale roma. I suggest you take a water taxi from there and when you get off at the second stop turn left and walk to the dead end along the canal. turn right here and go down about one block and the Hotel is on your right.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bridgewater, New Jersey", "Title": "“Best customer service!”", "Author": "maryannfm", "ReviewID": "UR117241239", "Content": "We stayed at the Domina Home Ca' Zusto for two nights. We were given a room on the ground floor that was tiny for two people and had a strange smell. The receptionist was very concerned that she could not give us a different room that night but promised she would the next night. True to her word she gave us a lovely room on the second floor and went out of her way to make our stay enjoyable. Even the other staff knew who we were and helped us with internet access (free), directions and questions about the area. The customer service turned a disappointing first night into an exceptional stay by the second night. I recommend taking the Vaporotto the one stop from the train station, turn left and then the first right and it's on the right. Did not try to walk it as there is not a direct route. Breakfast was included and was good. Would recommend this hotel.", "Date": "August 25, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“Mysterious power cut but otherwise excellent”", "Author": "MartsAndMarts", "ReviewID": "UR117221738", "Content": "This hotel seamlessly blends an historical old building with a modern and tastefully decorated hotel. It channels the spirit of Venice but with a clean, modern twist. It's hard to find but that could be said of most places in Venice! I think it would help if the hotel gave out more in the way of official directions as it's really not that complicated once you've got your bearings. We read reviews on TripAdvisor suggesting the easiest way to reach this hotel is to take the Riverbus 1 to Riva di Biasio from the main train station and turn right. On balance, this is probably true, but it's slightly frustrating to have to work out the water bus ticketing system and the correct pier for a bus going in the right direction to then go one stop (2 mins on board in total). When we were leaving Venice, we walked to the station and it took 10 minutes and cost nothing (although you do need to cross the Grand Canal and that means a bridge, and steps). This technicality aside, we found the hotel welcoming and efficient. Breakfast was an excellent buffet selection. We stayed two nights and on the first day, there was a power cut. Staff did not acknowledge this but could obviously not offer any hot drinks or toast at breakfast as a result. We were left confused by this until the second day when the power was clearly back on and hot drinks/food available again. A sign explaining the issue (and perhaps apologising for the inconvenience) wouldn't have gone amiss. This hotel isn't in central Venice, this is a short trip down the Grand Canal (or you can easily walk back through the maze of canals and passages), but this is a benefit rather than a disadvantage. It means you don't have to do battle with the crowds to get to your hotel and you get a flavour of the \"real\" Venice - there are local bars and shops. Venice is notoriously busy in summer but this hotel offered a welcome retreat and we would definitely recommend it.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Great boutique hotel”", "Author": "Mariane C", "ReviewID": "UR117031635", "Content": "My husband and I stayed at the Domina Home Ca' Zusto for the first 2 days of our honeymoon in Italy. We do travel a lot around the world and are used to high standards in terms of accomodations. We found the hotel to be very clean, boutique like and with very helpful staff. The breakfast was varied and there was very good free wi-fi connection in the rooms. The room was a little small but the matrimonial bed was actually that and not 2 singles stuck together... It was a few minutes walking distance of Piazza San Marco, which was perfect. We had peace and quiet where we were and only 5 min away was all of the action of Venice. We would definitely recommend it to couples of all ages and even for business travelers.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Fayetteville, Georgia", "Title": "“Good for sightseeing”", "Author": "nsreiter", "ReviewID": "UR116721563", "Content": "Whle the views are not at this hotel, you also do not have to deal with the noise of the canals. The rooms are smartly decorated and of good size. They have a nice continental-type breakfast included. They did have meats, salad, and some wonderful pastries to go along with the usual light fares. We were maybe 2 blocks from the water taxi and the 2nd stop from the main terminal. With suitcases this is a piece of cake, no bridges! We ate at lovely restaurants not far from our hotel, with the locals. It is not marked well, but a local actually walked us to the hotel after we had passed it a couple of times. We found out that house numbers are not necessarily in sequence and your street may end and pick up somewhere else. But they said had we called they would gladly have given us good directions. We located it pre-cruise so we would not have any problems after with our stay.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "North England", "Title": "“A hidden gem in Venice”", "Author": "LKG2008", "ReviewID": "UR116669366", "Content": "So pleased we chose to stay here rather than in the main throngs of the Grand Canal. It was a perfect location to explore the city but also get a great night's sleep! The receptionist was charming and helpful, giving us tips on what to do during our limited stay. I like the fact that this hotel is 'kooky' and totally unique - lots of colour and culture!", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Eugene, Oregon", "Title": "“Wonderful, close to vaporetto, friendly staff”", "Author": "Compassrose50", "ReviewID": "UR115978998", "Content": "Domina Home Ca' Zusto was an excellent choice for our four day stay in Venice. It is a small hotel in the San Croce district, deceptively nondescript from the outside, yet once inside, abundant marble, lovely staircases, warm and very lively decor, just minutes from San Marco and the Rialto bridge. We found it easily right off the Vaparetto as others have remarked. You do need to follow the directions as one is easily and quickly lost in Venice's winding and tall alleys, charming later not so much when first arriving tired with suitcases. The front desk staff were consistently patient and very helpful, the staff throughout the hotel were very friendly. Our room was very clean, It had a jetted bath/shower, and views of rooftops, and the narrow street, at first disappointing, but I grew to enjoy it as you start to notice the varied balconies, shutters, potted plants. Generous breakfast was included with scrambled eggs, bacon and other cold meats, cheeses, greens, tomatoes, canned peaches, yogurts, dry cereals, breads, pastries, and fresh fruit. Many families stayed there as well as couples, the venue appeared to work well for both. Coffee, espresso, cappuccino, tea, cocoa served by the friendly server, as noted in another review, and at no additional fee. Any time you spend on how to read the street signs will not be wasted. I found the maps not that helpful, but looked for landmarks, and by the end of the second day was feeling more comfortable, very comfortable, moving from San Marco/Rialto to the hotel, a 15-20 min walk. Easy easy easy to get lost, which was never scary, Venice feels so safe, however, one helpful hint is to key to the posted (written on walls, usually in yellow, some added as hand written notes on arches--none consistent, but often enough to be helpful) main directions for the Rialto and San Marco, and then your closest vapporetto. Recommend San Marco visit early in the day, you will find a line by 0830, it opens at 0945, but worth it, and you are waiting in the shade, unlike later when the line is longer, and in the sun. Go right upstairs (before the crowds), it cost about five euros, but the view is stunning both of the cupola mosaics, and then outside, the grand canal and square. Another reason to stay at Ca' Zusto: it is close to a very wonderful restaurant, \"Trattoria Al Ponte Del Megio\" just a two minute easy walk from the hotel, get a table on the canal people watch while enjoying some of the best food Venice has to offer. Other: AIr conditioner worked very well and was adjusted easily. Elevator worked well to the second floor. A separate smaller elevator from second to third, I could not get it to work--but perhaps it was simply too slow and I did not wait long enough. This second one will fit only one person, and if in a wheelchair, would recommend you ck dimensions,feasibility. WiFi is free but only available on the first floor, the lounge (breakfast room) is lovely for this purpose as well as for reading and relaxing. Quite hotel, away from the bustle, but within easy walking distance to main sites. Lovely, would recommend.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Nice hotel with outstanding location”", "Author": "Fishercmh", "ReviewID": "UR115970215", "Content": "This place fit our needs perfectly for our 3 nights in Venice. The location is really perfect in that it is close to the train station, bus station and Grand Canal, and a reasonable walk from the San Marco Piazza, but is in a quiet uncrowded location in Santa Croce. It was a perfect starting point for four of us to roam about Venice. I will say walking directions to the hotel are terrible. The easiest route to the hotel is the water taxi from the train station, which is fine if you are buying a 1, 2 or 3 day water taxi pass (and you should), but don't buy a single 6.50 euro ticket to go one stop. Walking works if you don't mind carrying your luggage up the bridge steps. Just be sure to cross the bridge in front of the train station, then try to follow their instructions. We did find it. The hotel was quite comfortable with a very friendly, helpful staff. We really liked our room. The only complaint was from our son and his wife in a separate room - they had no shower stall, just a curtain, so the bathroom was soaked each time they took a shower. I believe it was a room for the physically challenged. (Incidentally, Venice is not easily navigated by people with disabilities.) The breakfast is good. Wi-fi only works reliably in the second floor common area. It may seem expensive, but it is reasonable for Venice. Overall we were very pleased with our stay. Once there, get out and walk the streets and ride the water taxis.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Austin, TX", "Title": "“Very nice hotel - clean, comfortable and easy access to vaporetto stop”", "Author": "Sidewinder192", "ReviewID": "UR115933869", "Content": "We stayed here for only 1 nite but was very pleased with reception and comfort level. Quiet and easy to get good night's sleep. As there is no bridge between the hotel and the vaporetto stop you can easily roll your luggage in. Reasonable size room and very clean bathroom. The breakfast area was also very pleasant as it included an enclosed courtyard to eat in open area in quiet. There are two lifts one small one for luggage only and one for 4 persons.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Durham", "Title": "“Nice staff, comfy bed, disliked the wetroom”", "Author": "katmel", "ReviewID": "UR115797520", "Content": "We stayed here for one night before our flight the next day, so I wanted a hotel within easy walking distance of the bus station. Our room wasn't ready when we arrived, even though it was 1.30 in the afternoon, but the lady behind the desk said we could leave our luggage while we went for something to eat. When we returned our bags had been taken to our rooms. The room itself was very nice. The air conditioning worked, it was spacious enough, spotlessly clean and the bed was comfy. There were fluffy towels and plenty of toiletries on offer. However, what I really didn't like was the wetroom. We appeared to have been assigned a disabled room as there was an emergency cord, hand rails etc in the bathroom and because it was a wetroom the floor was constantly awash. Our grown-up children had a twin room next door and they had a shower cubicle - much better. Better still would have been a bath. I assumed that all rooms just had showers but since coming back I have read on tripadvisor that some people actually had jacuzzi baths - the unfairness of it all!! I would have been happy with an ordinary bath! Breakfast was fine if a little uninspiring. Be aware that if you ask for tea you get a pot of boiling water so pick up the tea bag and milk yourself. Staff were friendly and free wi-fi is available. Expensive, but then so are all of the hotels in Venice.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "sydney", "Title": "“Great location, great staff and great hotel”", "Author": "spj709Sydney", "ReviewID": "UR115408543", "Content": "We just returned from Europe after a couple of weeks. In Venice we stayed at the Domina Home Ca' Zusto Hotel. It was amazing from start to finish. We took a boat from the airport with Viator and they dropped us off at the wharf Riva de Basio which ended up being about 75 meters from the hotel. Upon entry we were greeted by the manager who was charming and very helpful explaining everything - from restaurants to getting around. In very polite terms he told us to get lost - that's the way you find Venice. And he was completely correct. After a day we didn't even use the map. If you look on the buildings as you walk along there are yellow signs indicating in what direction you are travelling. Back to the hotel, it is a very old building and they have done some amazing renovations inside without spoiling things. It took 8 years to get approval. The colours are not what we would have at home but they work. They are colours and fun. Rooms are a reasonable size, breakfast is very good. Any other questions we needed to ask where answered by the staff. And the place was very quiet at night as it was out of the main drag. So I suppose the main features are - well located without having noisy crowds too close, very comfortable, good amenities, good breakfast, handy to restaurants and supermarket. good value for money. Highly recommended by us.", "Date": "July 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Beautiful hotel in a stunning city.”", "Author": "Freedomoffunk", "ReviewID": "UR115041077", "Content": "Having arrived to Venice by train we were very hot and needed a rest. You can only imagine our happiness in being lead to a beautiful, green themed, room in this stunning little hotel. The most comfy bed we slept in during our whole Italian vacation, a breakfast fit for a king and all set in a beautiful area. We were worried after reading the tour guides that Venice was going to be like 'Disneyland with Canals' but the Domina is situated in a lovely quiet area, surrounded by local restaurants and shops. A far cry from the hustle and bustle of the Rialto Bridge, that's for sure! We will shall be returning to Venice and when we do we shall defiantly be returning to the Domina Home Ca'Zusto!", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Melbourne", "Title": "“nice little hotel”", "Author": "privers78", "ReviewID": "UR114862069", "Content": "nice little hotel 10 mins walk from main train station. checkin was easy and we were given city map and lots of tips. staff helful and friendly for our entire visit. the room itself was rather small and quite dark. cleanliness was an issue - lots of dust and dirt on the floor and behind curtains and under the bed. rest of the room was clean. free internet provided also but only on level 1 in the breakfast room. wifi is valid for 2 hours only then you need another ticket. this breakfast/internet room really needed tea and coffee making facilities or a vending machine. the breakfast itself was simple but of good quality and included everything required. hotel is overall of good quality and i would recommend this hotel to anybody - room size isnt a major issue because venice has so much to offer you spend most of the time outdoors. hotel is close to restaurants and 10 mins walk to rialto and easy 25 mins walk to the main square.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“A must stay!”", "Author": "Jagdip121", "ReviewID": "UR114842523", "Content": "We booked this hotel having read the reviews on Trip Advisor. The hotel was located to the north of the island, a two minute walk from River de Biaso Water bus stop. The train station is only a 5 minute walk from the hotel. We recommend coming into Venice by AVTO airport coach to Piazza Roma! You can then take the Water bus and get off after two stops or walk for a further 20 minutes - have you maps ready folks! The Hotel was spotless and the Breakfast buffet was not bad. The air conditioner worked, rooms were beautifully decorated and the bathroom was small but well equipped. High speed internet is available on the first floor only and you must get a password to log in every two hours. This was a little inconvenient The Hotel staff were very helpful, especially Lana who even recommended places to eat and shop!", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dublin", "Title": "“Great hotel”", "Author": "MissAisling", "ReviewID": "UR114820508", "Content": "This hotel is good value in a good location. The room was modern, bright and large (for Venice). The staff were very helpful. The breakfast was lovely. Our room was on the ground floor so we kept the curtains closed so that passers by couldn't see in! We were in a wheelchair accessible room (not requested) so the bathroom was large but it was a wet room and it lived up to it's name! The floor was wet constantly. Overall I would definitely recommend this hotel for a trip to Venice.", "Date": "June 28, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New Delhi, India", "Title": "“Pleasant experience”", "Author": "Rashi06", "ReviewID": "UR114665853", "Content": "We stayed at the Domina Zusto this summer while on a family trip. The hotel is very close to the train and bus station, only 2 stops away. The location is fabulous in not so crowed area. The staff was extremely helpful and courteous. It felt like home more than a hotel!", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Surrey", "Title": "“Pretty Damn Special - even for Venice”", "Author": "HorleyLad", "ReviewID": "UR114230140", "Content": "Inside it's all straight lines of marble, glass and wood, decorated in vibrant colours, and enhanced by gilted scroll-work on mirrors etc, while the building itself has gently bowed walls and beautiful church windows - all kept immaculately clean. The staff were all friendly and very helpful, and the aminities were certainly as good as you would expect from an hotel of this standard. Breakfast was definitely worth waking up for - the fresh orange juice and Italian coffee started ever y day with a zing.We encountered two small problems - the battery on our television remote control ran out, and was promptly replaced, and then the plug in our en-suite sink stuck. We reported the fault as we left to explore, and a handiman was dispatched at once. On our return the plug again failed, and the receptionist was so apologetic that we forgave him at once! The hotel is a ten minute walk from the bus and railway stations, fifteen minutes through atmospheric alleyways to the Realto, and about the same again to St Mark's. There are a number of restaraunts and cafes within a few minute's walk, and the Riva de Biasio stop on the No 1 vaporetto route is only about 150 metres from the hotel.", "Date": "June 18, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Tampa, Florida", "Title": "“Great hotel”", "Author": "dreaan83", "ReviewID": "UR112485685", "Content": "We loved our room. The breakfast was great, the hotel staff was helpful and friendly. The jacuzzi bath was a welcome treat at the end of our trip. We would definitely stay here again.", "Date": "June 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Great hotel. But spoiled somewhat by non-functioning AC and staff's response to it.”", "Author": "JasonManikel", "ReviewID": "UR111465925", "Content": "We stayed here for two nights on a fourteen-day (seven-hotel) trip. We were very impressed by almost every element of this hotel - its location, design and luxuriousness. But we were extremely put-off by the non-functioning air-conditioning (and, in particular) the staff's (non-)response to it. The hotel is well located - quite close to the station and along the \"main drag\" between there and St Mark's Square. At least one other reviewer has recommended taking the ferry there along the Grand Canal, but we walked. The distance isn't a problem at all, and it's not hard to find, but there _are_ two bridges (with stairs) to cross on the way, so consider that if you're lugging suitcases. It's a very modern and renovated place (in an old building). It's listed as four stars and looks it. Quite luxurious, but small and a bit fancier than we needed. And not \"luxurious\" to us in the ways that we find most important. For example, the shower was tinier than most, and the fittings (though modern) don't work well in it. Breakfast was so-so. Nice to have proper coffee and fancy little jams. But the croissants and eggs were no better than places half this price. The only real inconvenience though was the AC - it didn't run, and we suspect the staff were lying about why. The room was quite warm (with not much of a breeze from the windows), and the air-conditioning either didn't work or wasn't turned on. Friends who'd just visited Venice warned us that might be the case - something about laws about the date they can start activating it...? But they also warned us the hotel would be liable to lie to us about the problem. That's pretty much exactly what happened. There were lots of excuses and no real action to resolve the issue - both signs (in our minds) that we were being lied to. We were able to live with no AC. But being misled really rubbed me the wrong way.", "Date": "June 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Lovely hotel”", "Author": "Wanderluster2", "ReviewID": "UR111184635", "Content": "I stayed in a single room at the Domina Home Ca'Zusto for one night. The room was lovely and the decor and design of the room was fun and colourful, a nice alternative to the more traditional Venetian decor found at other hotels in Venice. The room was not large, but had more storage than most other European hotels that I've stayed in. The TV in the room also had a good selection of English channels. The only thing I didn't like about the hotel was that the rooms did not have Wifi, which was only available on the 1st floor of the hotel, where breakfast is served. I came into Venice by train and didn't have any problems finding the hotel. It is within walking distance from the train station, but the walk is feasible only if you do not have a lot of luggage (i.e. more than one suitcase per person), as you'll have to go up and down a few sets of stairs over the bridges. If you do walk from the train station, I would recommend that you print out the walking directions from Google maps ahead of time (from Santa Maria Novella Station to the hotel), as the highlighted path shown is very accurate and also shows names of restaurants and buildings that you should pass by on your way to the hotel, so you know you're on the right track (don't rely on street signs/names, as these are not always available). Once you're near the hotel, you'll see a sign on a building that says Campo Rielo and the entrance to the hotel is on the other side of this building. It is also very easy to walk to the Piazza San Marco from the hotel (20-25 minutes). I took the vaporetto the first day, but it isn't that much faster than walking. There are signs everywhere to provide directions either to the train and bus station (Ferrovia and Piazzala Roma) or Piazza San Marco and the Rialto Bridge, so it's very easy to find your way back to these landmarks. As my time was limited, I didn't have time to visit too many other areas, so I'm not sure how easy other areas would be to find in the absence of signs. I enjoyed my stay at the hotel and would return!", "Date": "June 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southampton, United Kingdom", "Title": "“An excellent small quality hotel”", "Author": "kempr52", "ReviewID": "UR106943701", "Content": "An excellent relatively small (20-22 rooms) hotel quite close to the Grand Canal. Courteous and helpful staff made our short stay in Venice a real pleasure. Our room was spacious with an excellent decor and a huge bed. Truly a lovely hotel.", "Date": "May 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Delhi", "Title": "“Excellent hotel and service!True value for money!”", "Author": "19Madhur", "ReviewID": "UR104739484", "Content": "The hotel is excellent with wonderful staff. The hotel is close to the train station and is convenient to locate. The hotel is located away from the busy tourist road. The staff is helpful and warm. The rooms are beautiful, neat and clean, though a bit small. The breakfast buffet is lavish and great. The hotel is true value for money! Highly recommended!", "Date": "April 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“wonderful stay”", "Author": "katykate77", "ReviewID": "UR103659053", "Content": "We had a 4 night stay and were impressed with everything about the Ca zusto. The rooms were comfortable and immaculate are decorated in a modern regal style. The location is simply superb, it's nice to walk in the middle of Venice. Every room includes a free internet. From the reservation process to the fun fast and warm \"check in\" all the way till checkout, the Hotel Ca Zusto exceeded expectations. Frankly, because of the great reviews, we had very high expectations and the Hotel was even better than that. The warmth of the manager Maurizio who runs it shows in everything. While we had some difficulty in a tour we selected, the Hotel staff were helpful and extremely responsive to our concerns. Venice is a great city to walk and enjoy. This jewel of a Hotel was perfectly located to every spot we went. Venice is lucky to have the Hotel and we will most definitely return. Thank you to the entire staff for a magical stay.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Yorkshire", "Title": "“Brilliant!”", "Author": "Lslou", "ReviewID": "UR101123033", "Content": "Just returned from a fabulous trip to Venice and a wonderful stay at Ca Zusto. The location is perfect, easy to find, central but away from the really busy tourist areas. There are loads of really good restaurants near by and the square around the corner has a fabulous prosecco bar. The hotel it's self is really beautiful, the rooms are decorated in a modern regal style. Breakfast is all so included which us a rariety in Europe these days. To sum up this is a boutique hotel at a reasonable price. We can't wait to return!", "Date": "March 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Berlin", "Title": "“Very nice and clean hotel, tasteful deco, great service”", "Author": "gostram", "ReviewID": "UR97390004", "Content": "It took me a bit of time to find this hotel. I was, like many I guess on a week-end with my wife in Venice. The goal was to find a very nice hotel at less than 150â‚¬ a night, not too far from the main sights. The ca' zusto is in a quiet neighboorhood, out of the main tourist paths, yet conveniently located not too far from the piazzale Roma (bus station) and the ferrovia ( train station). It is not exactly close to San Marco. You'll have to walk about 20 minutes to get there. The hotel is in an old mansion, completely redone in modern roccoco style. I am quite picky about design and I usually do not like plain designs made for American tourists and I was pleasantly surprised. It looks good ans is tasteful. It is super clean, modern. The personnel is great, really helpful and proposed to help in many situations. The breakfast is nice. No extra fancy 20 m lomg buffet, but good products, good coffee, fruits, etc. The room had air conditioning with regulator, decent TV with a few international channels, closet, sleepers, a desk two armchairs, free wi-fi, very clean bathroom, with a lot of hotel cosmetics ( not your usual cheap stuff ). If u want to be slightly iut of the tourist craze, this is where u want to go, and u can get anywhere with the vaporetto. Last but not least, the hotel is very close to canareggio, which is, in my view one of tze coolest neighboorhoods for an evening drink. Lots of wine bars, young Italians and cool hidden restaurants. All in all, I would really recommend this hotel.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Fabulous service”", "Author": "MozaSydney", "ReviewID": "UR95448068", "Content": "We diverted our trip from Cairo as a result of unrest and have been in Venice for 3 days. Found the hotel on the internet. Really funky place. Great room. Fabulous service. Highly recommended", "Date": "February 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“excellent location...small rooms”", "Author": "ElaBizz", "ReviewID": "UR93473443", "Content": "First: DO NOT WALK...waste of time to get to this hotel. Take the #1 and get off at Riva Del Biaiso and go left to the end...turn right on the street and keep walking. You will get to your hotel FAST and EFFORTLESS. Don't be a hero to walk there...the sddresses are so difficult to find it is too confusing. The rooms are nice but very small even in european standards. The breakfast is good and the service at the front desk is excellent. Good places to eat around there not expensive and real good. Try La Zucca ....amazing but you need reservations. Good thig to try: get lost on your way to StMark square and just get back with the #1 line. A real nice walk.", "Date": "January 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Quaint, Lovely, 5 Star Service, Cleanliness, Value and Location”", "Author": "TravelQueen2002", "ReviewID": "UR86952160", "Content": "This little hotel is a jewel in so many ways - location, cleanliness, service and ambiance. The location near the train station and Piazzale Roma canâ€™t be beat. It is easy to get to with a minimum of hauling luggage. You just take the #1 Vaporetto two stops from Piazzale Roma to Riva De Biasio, turn left, pass an alley and then make a right at the first street and it is about 50 meters on your right. Or if you are coming from the train station catch the #1 Vaporetto from Ferrovia and it is one stop to Riva De Biasio. Going to the airport even at the crack of dawn is equally as simple. There is the â€œNâ€� Vaporetto to Piazzale Roma where you can catch the #5 bus to the Airport. There is absolutely no need for a water taxi at $110 Euros. There is no dragging luggage over bridges and for long distances or getting lost trying to find your hotel through a maze of streets. You go about a block to a non-descript entrance on your right (zoning issues in Venice prevent big signs) with two classy looking little potted trees in the front and a glass door. Push the button for entrance and you are in the middle of a 14th century former home of the Zusto family (merchants who traded with the Jewish/Palestinian population in Venice - there is still a Star of David over an entrance that can be seen in the courtyard.) Lovely little courtyard, color scheme, and staff there to greet you. Some people may want to be closer to St. Markâ€™s Square and the Rialto but I found the crowds to be overwhelming and thought the Vaporetto ride down the Grand Canal each morning and evening, a tour in and of itself and the best deal in town given the price of tickets. It is also a wonderful photo opportunity for remembering this lovely city as well. If you have time to walk, itâ€™s a great opportunity to see the back streets and less visited areas and Piazzas. Because the hotel is small the staff is always available and tremendously helpful and professional. I wasnâ€™t there a full day and was given directions to and tickets for the Opera and other venues. Breakfast was a delight and service very good. I did have a problem with the airconditioning, however, it was fixed immediately the next day with workmen awaiting my exit from the room that morning to address the issue. When I left at 3:30 am for the airport, the desk clerk actually helped me with my luggage to the Vaporetto Stop! Ten minutes later he appeared again, assisting another couple with their luggage! Iâ€™ve been in a lot of hotels and this is one of the most memorable in terms of customer service and ambiance. You wonâ€™t be disappointed!", "Date": "November 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ripon, United Kingdom", "Title": "“Excellent hotel - made our trip perfect!”", "Author": "treacle1234", "ReviewID": "UR84124201", "Content": "We came to Venice for a short break and it couldn't have been better. Flew into Treviso with Ryan Air and took a short 40 minute bus journey (5 euro payable at the airport desk) into Venice. The hotel is then a 10 minute walk from the station. It is reasonably easy to find if you locate it on a map before you arrive and remeber what it looks like from the outside! We were checked in by very friendly staff, nothing is too much hassle and they recommend good places to see and eat and directions to the tourist spots. The rooms were clean and comfortable, complimentary toiletries, slippers, flat screen TV's and an Ipod dock. Breakfast was simple but just what you need, juices, tea, coffee, breads, pastries, meat, cheese, cerial, yoghurts and fresh fruit. It is only a 10-15 minute stroll to the rialto and a further 5 minutes to st marks square. The vaparetto (water bus) is just at the end of the street. We only used it once for the experience as everything is in walking distance of the hotel. Only negative point - The wireless internet doesn't work on the 2nd floor. We were offered an ethernet cable for a laptop but only needed it for our phone, the internet does work in the communal seatig area on the first floor though. Would definately go back!", "Date": "October 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Boutique Hotel with Great Service”", "Author": "KA117", "ReviewID": "UR83824179", "Content": "Venice was one of the hardest cities to find a good hotel in. For a four-star hotel this place was very affordable in Venice. It's conveniently located a short walk from the train station, no water taxi required which is a nice way to start your trip simple in Venice. The hotel staff was the best on my trip and before I got there. I emailed the hotel staff about transportation, sights and directions and they responded promptly and thoroughly every time helping me plan my trip. The bathtub had spa jets! The property is very colorful with some floors very pink/purple and others a bright blue, but it gives the property character. The hotel also has a welcoming event for its guests one/two nights a week where they host cocktails. They have a great staff which joins you and you can ask for their inputs on things to do and mingle with other guests staying on the property. By far one of the best finds ever!", "Date": "October 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“A stylish, friendly hotel in an excellent location for exploring Venice”", "Author": "kate376", "ReviewID": "UR82496339", "Content": "Unfortunately we only stayed in this hotel for one night, we would have loved to stay for longer! The hotel is very conveniently located for the vaporetto, being a just a few steps from the nearest stop on the Grand Canal, and it is in walking distance of the railway station. Just around the corner there are some very good restaurants in Santa Croce, and yet its immediate surroundings are quiet and peaceful. The hotel itself is very stylish, an interesting old building decorated in modern style, and our room was large, luxurious and well equipped. All the staff were excellent, friendly and helpful. It wasn't expensive compared to other hotels of the same standard in Venice, and we would happily return if we get the chance.", "Date": "October 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Louisiana", "Title": "“Stay away from the crowds. This is the place.”", "Author": "SarahBeth_LA", "ReviewID": "UR81369091", "Content": "We spent 4 nights here during our honeymoon and really enjoyed this hotel. It is close to the train station and just a block from a water stop on the Grand Canal. It is a 10-15 minute walk to the Rialto Bridge. We liked the location because it is away from the crowds and noise. It is on a very quiet street. We could sleep with the windows open without disturbance. The hotel is decorated well and the rooms are very nice. Our room was small but that is to be expected in Italy and the size was just fine for us. The bathroom is great with a nice size shower. Everything was clean and the staff was fantastic. Breakfast was average. I highly recommend this hotel. It is a great value in a city where everything is overpriced.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Taipei,Taiwan", "Title": "“beautifully decorated 4 stars hotel”", "Author": "woanroulee", "ReviewID": "UR73247169", "Content": "It is located in Santa Croce, not too hard to find , tucked away from the hussle and bussle of the city . The staffs were very friendly and welcoming , we were delighted to see our room -- it's spacious and very venetian style ! We had a jacuzzi , flat TV , King size bed , slippers , toiletries ,hair dryer like others have mentioned.The breakfast area was cute and colourful , and the buffet breakfast was good too. We couldn't be more happier to stay here ....Clean, Quiet , Perfect! It was 155 euro per night at that time .. However, Venice itself was really quite a mysterious place too cus we got lost TWICE ...you might need a map with you at all time ! We also love the food there , very very delicious seafood feast near San Marco, although not cheap too , 160 euro for two person ...but the atmosphere and food were superb!", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Antwerp, Belgium", "Title": "“Price vs value = SUPER !!!”", "Author": "HVK1964", "ReviewID": "UR68718788", "Content": "Staff = very friendly and helpfull Room = large and fully equiped = small refrigerator, flatscreen TV, very good large bed, desk with internet connection, very silent airco Bathroom = small buth enough space, toilet, bidet, sink, rainshower Hallway and rooms = nice decorated and painted Breakfast = large choice in bread, fresh fruit and juices, warm and cold drinks Situation = 10min walk from bus and trainstation, busboat stops around the corner, nice resto's nearby Overall = VERY TOP HOTEL !!! One of the best i've ever been to even though they don't have a separate bar. They are planning to expand with a building nearby (10m from hotel) for bar, resto and extra rooms.", "Date": "June 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Absolute gem in an excellent location”", "Author": "dm_boss", "ReviewID": "UR68439738", "Content": "Have just come back from a 4 nights stay in this hotel. What can I say in addition to what I've already put in the title? That's truly a hidden gem which I my wife and I were pleased to discover. Very very convenient location - about 10 mins walk from Piazzale Roma and the same 10 mins further to Rialto Bridge in a very quiet street. In other words close enough to get there straight from the shuttle bus which takes you from the airport, but not too close... Brilliantly decorated - everything in nice and new. Our room was in purple colors, pretty spacious, with stylish modern furniture and LCD TV. Large modern bathroom with jacuzzi and large window. Breakfast - all products were fresh, including plenty of various juices, Voss water, fresh fruits like strawberries and cherries, fresh Italian prosciutto (dry-cured ham) etc. Friendly personnel speaking good English. Free Wi-Fi. So what else can one wish? Undoubtedly will stay there again during our next trip to Venice!!", "Date": "June 23, 2010"}], "HotelInfo": {"Name": "Domina Home Ca' Zusto", "HotelURL": "/ShowUserReviews-g187870-d1013704-Reviews-Domina_Home_Ca_Zusto-Venice_Veneto.html", "Price": "$179 - $435*", "Address": "<div class=\"amenFloat\">", "HotelID": "1013704", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/62/4b/624b3e2e46a1e45f2a43821374c2efe86large.jpg"}}