{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "dubai", "Title": "“Not an acceptable stanrad of cleanliness”", "Author": "alanlecoyte", "ReviewID": "UR120651170", "Content": "We stayed at the above property on 7 November for 2 nights to attend an exhibition in London. There is no one on site and keys are collected via a safe with a code provided. One of the keys did not fit and was for the wrong apartment. The rooms are a reasonable size, but the sofa was dirty, the walls are scuffed, the bed linen and towels are very old and thin. The matress was also old and lumpy. There is also construction work going on next door woith workman starting around 6.30 onwards For £150 per night the apartments do not affer good value for money and need serious upgrading.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "England", "Title": "“Do not stay here.....”", "Author": "Sorrento1234", "ReviewID": "UR104597551", "Content": "Do not stay here Unless you want to be woken up with extremely loud building work at 8am..it is so noisy it feels as though it is in the apartment. Apartment is ok but small. I am amazed that I was not pre warned that there is building work going on as somebody else complained in November..", "Date": "April 19, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "rochdale", "Title": "“SHAMBLES”", "Author": "tripper_a", "ReviewID": "UR88115478", "Content": "i booked this for some guests, it looks very nice from the pictures but it is not as it seems. Rooms are too cramped and the surroundings of the building are horrible. there is absolutely no customer service, i rang today in their opening hours which is 9-5.30 (at approximately 5.25 and they had already closed and i had to use the emergency number which just told me to leave a message. as my guests really didnt like it we had to move them to a different hotel. Would definitely not recommend for a joyful travel experience allthough i guess the price is ok", "Date": "November 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "prescot", "Title": "“Really good location”", "Author": "sunshinePrescot", "ReviewID": "UR86760718", "Content": "Stayed in an apartment situated on the 2nd floor for two nights (4 adults). The apartments are situated just of fleet street and an ideal location for exploring London a short and safe walk to covent garden. The apartments are clean and tidy but a little worn in places ie flooring scuffed, bathroom in need of TLC. We really enjoyed our stay and would stay again but mainly because of the location as we do not spend that much time in our acfommodation anyway. Down side to the apartment at the moment is that there is lots of building work going on all around and you get woken up at 6.30am due to the noise also not enough hot water generated from the boiler only 1 person had the luxury of a hot shower when all four people getting ready in a morning", "Date": "November 11, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Lugano", "Title": "“It can become good, if they really wish”", "Author": "Carlo_Sormani", "ReviewID": "UR78275750", "Content": "Booking easy on the web but self check in needs codes, they only send against docs and credit card copy by fax. I booked on saturday. They are unreacheble evening/night and in weekends. I arrived tuesday. Monday was holiday in London, so no way. Left a message in the voice mail for getting the codes by sms, arriving late afternoon but no result. Luckily landed early, still in time to call by phone and get the codes. Keys are in a safe, the door could not open: I managed eventually, a pin was worn and did not work properly. Emergency number attend courteously but they range of activity is limited. If not in real emergency and call at night you are charged 50 pounds (beware!). First impression was \"save by all means\" although the structure and the apartments are not in bad conditions. It smells mould in the entrance and there are apartments on ground floor and ONE UNDERGROUND that is number 1 (BEWARE!). I would never take less than second floor (I had second floor in fact) Living and kitchen are quite ok, but we could not get the washing machine to perform a drying program the second time. There was a curtain on the window, removed and not replaced (pity, such simple detail). The staff for setting clotehs for drying was broken, so simple to adjust, only one screw missing but....no screw.. Bathroom has a shower, water just warm, the boiler is modern and should be set at 55-65 C but is set at below 40 (saving reasons?) . Shower should have a glass and the basin is so unreasonably near to the corner of the wall and too close to the towel dryer (good idea, little small, cant use properly). Simple redesign of the bathroom (glass- basin type size and location, more space for towels) would make of it a nice bathroom. Bedroom is very small (acceptable at limit) and bed is HORRIBLE. The mattress absolutely need to be changed (all springs are out...) and the wooden bars underneath are short for the size of the bed so they collapse at places. Tryed to arrange but suffered all the time. Bed sheets and towels are quality and size of poverty (was it luxury apartments right?) and it would cost nothing to give a couple more towels and decent sizes. Internet did not work, called wednesday morning, they said they knew and it was going to take 1-2 dasy to fix (!?!?). Called again on thursday it was fixed friday afternoon (only reboot the router....why not in an hour time?). Finally we liked the location (super) but we would definitely never return there. Unless they decide to go for the improvements. I wrote them, see what happens....", "Date": "September 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Mount Laurel, New Jersey", "Title": "“If only it had looked like the photograph on the website”", "Author": "UKVisi2r", "ReviewID": "UR70348839", "Content": "....and it did, sort of - minus the cleanliness factor and services which were operational (phone, internet, TV). The crockery, glasses and utensils had a layer of grease/grme to them, the Master Bath sink had trouble draining, the Master Bath Loo barely flushed and even the pedal bin in the kitchen didn;t work. It was almost impossible to get a hold of someone to ask them to fix the problems we were having and even when we did, although she had a helpful attittude, nothing really changed. We were there from Monday to Saturday, and had Internet for 1 day, TV for 2 which were the most frustrating problems of all - the rest we could have lived, or made do with but the lack of Interner and TV was a real problem.", "Date": "July 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Great Location and great value for money”", "Author": "sean26", "ReviewID": "UR37262089", "Content": "Staying at Lombard Lane was a pleasant experience. The location was perfect and the its self check-in service made my stay private and personal. The apartment itself was very tidy and new with great facilities. I will definatly be back next time, however i did have to call the office once and they dealt with my query immediatly.", "Date": "August 10, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Singapore", "Title": "“Absolutely Horrible”", "Author": "btraveller22", "ReviewID": "UR35945169", "Content": "Possibly the worst place I have ever experienced. Shower was overgrown with mildew. Staff was impossible to get in contact with after multiple attempts, and will charge a 50gbp service charge for calling. Email address provided does not work. Cleaning services not performed. The saving grace would have been location, however is situated right beside a bar, where patrons had smashed glass bottles over the entrance. All while charging over 120gbp/night on a 7 week stay!", "Date": "July 27, 2009"}], "HotelInfo": {"Name": "MiNC Lombard Lane", "HotelURL": "/ShowUserReviews-g186338-d1016578-Reviews-MiNC_Lombard_Lane-London_England.html", "Price": "0", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">4 - 7 Lombard Lane</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">EC4 8AD</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "1016578", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/25/38/25381ffe19164aa3ea3c1f64037551031large.jpg"}}