{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "HK", "Title": "“Switched to other hotel with unreasonable reason”", "Author": "HKTraveler123", "ReviewID": "UR127328191", "Content": "We have booked the Hotel Opera Roma for 2 nights stay on 28 & 29 Mar. When we checked in, the hotel staff told us that we were needed to switch to Hotel Sonya, their sister hotel, since their computer system and air-condition was out of order. We have no way but to accept their offer since we have paid the room price to the booking online. When we claimed for the price difference from the hotel, the staff said that they've upgraded us to the superior room in which was not. We also discovered that we were being cheated since the staff in Hotel Sonya told us that they quite often exchange guest in between them.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Upgraded to Suite”", "Author": "turistik", "ReviewID": "UR127162667", "Content": "Booked two nights at the main property Hotel Sonya but arrived to early in the morning to check in. So we left our luggage and headed out to explore Rome. When we returned hours later exhausted we found we had been upgraded to a suite up the block in the Hotel Opera. With an abundance of room, comfortable king size bed, jetted shower and a whirlpool tub we enjoyed our days and nights in luxury. The staff was outstanding, reliable and accommodating. Each morning we enjoyed the typical Italian breakfast and coffee. We would recommend this hotel to anyone looking for a great location and awesome quality.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Estero, Florida", "Title": "“Did I stay at a different hotel?”", "Author": "happyjackman", "ReviewID": "UR126724916", "Content": "I use TripAdvisor to choose all my hotels and this is the first time I have ever completely disagreed with the majority of reviews. This place was so bad that my husband and I switched to a different hotel within an hour of check in! First, the entrance is hard to find. We hauled our luggage around Rome for much longer than we needed to because the hotel is a little buried. It is in a good part of town (close to the train station and Via Nazionale), but on a small side street with little signage. I was immediately concerned when there were bars over the doors and we had to be buzzed in. The lobby was small but the gentleman at check in was very friendly. However, our room was the major problem. I think we got room 102 that people have warned about in other reviews. I'm convinced it's a converted closet. We saw one room with a room number and then a tiny door next to it with no room number, just labeled \"private\". That was our room! It was so small that we could not lay our suitcases down to open them. Literally. And to walk to the bathroom, I had to walk OVER the bed because I couldn't squeeze by the space between the end of the bed and the \"closet\". I'm 4'11\" and weigh 115 pounds. If I can't squeeze by, that's saying a lot! We tried to be optimistic and my husband opted to take a shower to start fresh. About 60 seconds into his shower, the bathroom almost flooded because the shower drain was so backed up. He had to turn off the shower every minute for a minute to let it drain before repeating the cycle. We had had enough and immediately went to another hotel around the corner on Nazionale to book a new room. (Sidenote: We had a great stay there - see my other reviews!) We then notified the front desk we'd be departing and, to their credit, the man was very sorry and repeatedly tried to upgrade us to stay. BUT why would you put someone in a bad room in the first place? Bad business and we will not be back!", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belfast", "Title": "“Wonderful, friendly little Italian hotel”", "Author": "DenmBelfast", "ReviewID": "UR126243187", "Content": "This was not a hotel like you would find at home. It is a small reception area with a small breakfast room just off it, in a building that has ordinary apartments in it. The Hotel owns two floors, in saying that the rooms are lovely, they are clean and well furnished with a mini bar that is very reasonably priced. Were this hotel scores high in my opinion is the very friendly and obliging staff, Lito in the reception was great he gave us a map with all the sights marked of with the easiest routes to and from the hotel with bus numbers to always get us back to the hotel. He ordered taxis when we needed them and stored our bags on the last day. The girl in the breakfast room was great she made the most wonderful coffees and teas any way you liked them with seconds and thirds even, on the last day when my daughter came down late just before our taxi arrived she rushed to get her coffee and a croissant and insisted she ate it so she would not be going out on an empty stomach, they were all so thoughtful. As long as you know it is not going to be a Jurys, but a lovely little Italian hotel then you won't be disapointed with the location or the staff or the good clean rooms. All the sights are about a 10-15 minute walk, the only time we used transport was to go to the Vatican and the pantheon everything else was an easy walk, just to let my fellow Irish travellers know the food in the Irish pub around the corner is not what you would want, stick to the little Italian street cafes or the Macdonalds across the road, if you want something familiar.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chobham, United Kingdom", "Title": "“perfetto little hotel for a visit to Rome”", "Author": "Karen C", "ReviewID": "UR125806556", "Content": "When we arrived at the address of this hotel we instantly felt that we had made the right choice. The entrance was very pretty, enclosed, clean and 'Italian looking' with a marble tiled floor and a scenic painted wall to greet you. You get buzzed in everything feels very safe and secure. Reception was very efficient and friendly. The room although small (104) was spotless and well maintained. Tea and coffe making comes free. Mini bar and safe in room. Interms of location, it was perfect. close to the train station (5 mins walk), surrounded by a variety of restaurants. We found the area lively and atmospheric without being rowdy. Breakfast was continental style, coffee and tea was good and there was plenty of choice to eat, yoghurts, fruit, danish pastries, ham & cheese, eggs etc. I would recommend this hotel, it was the perfect for seeing the sights and then retreating to for the night.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "BELFAST", "Title": "“Good 3 star hotel in good location”", "Author": "1STTIMEBERLIN", "ReviewID": "UR124857900", "Content": "All the good reviews are accurate - location, room breakfast etc. The only thing missing is a nice lounge where you can relax with a beer, coffee etc. The is just a small reception area with 2 computer that you can use free for internet. This would not put me off returning as from what I could see many 3 star Rome hotels did not offer this facility. Once again good location, very clean rooms and bathroom, free internet + sky sports etc, lovely continential breakfast and good helpfull staff", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Grand Rapids, Michigan", "Title": "“Hotel Opera Roma”", "Author": "KAC1947", "ReviewID": "UR124715630", "Content": "We made on-line reservations for Hotel Sonya. We stayed for 13 nights. When we arrived to check-in, they escorted us across the street to Hotel Opera, which apparently is owned and operated by the same people. The switch was fine for us and not unexpected, because we had read about it in other reviews. Once you have made reservations, any email question that you send to them is answered quickly. I found it quite amazing. So, here are my observations. Please recognize that I am an American and have done extensive business travel (in the USA mostly) and am used to pretty nice hotels of a 3-star and 4-star level. So be sure to bear that in mind as I give my opinions. Do NOT expect your room to be the equivalent of a Marriott hotel room. If that is what you expect, then expect to pay much more elsewhere. 1. The room was neat, clean, and adequate. It was everything we expected, based on other reviews. It was small, did not have an 'easy chair' or a small table for eating in the room. Again, it was too small to accommodate those amenities and we did not expect it. It had a closet for hanging clothes, plenty of drawers, and a large safe to lock up valuables and laptops. 2. The bathroom was very nice. The towels hung on a heated rack, which was nice because we were in Rome for the first snowfall in 26 years. The shower was all-glass and very clean and suitable. My only complaint is that there were no washcloths. We made do without washcloths. Maybe if we had asked for them we'd have gotten some. (I don't like to act like an American tourist and be too demanding. I want to respect the culture of the host country) 3. The internet was free and adequate. I did not like to get a new userid and password every day, but again, there may be a very good reason for it. 4. The breakfast experience for us was a highlight of the day. The very friendly attendant made us coffee any way we pleased. For us it was cappuccino for my wife and caffe Americano for me. You couldn't buy better coffee anywhere. Plus the attendant remembered our coffee preferences each day.....made us feel quite welcomed. The tables were covered with linen tablecloths. We ate off china, nothing cheap and disposable. The room was very nice and inviting. There were cold cuts and cheese, coffee cakes, cereals, and the most delicious bread-rolls. We ate the bread-rolls every day. There were no hot scrambled eggs, bacon, sausage, etc. Again, we appreciate the culture and enjoyed what was presented. Be sure to try the bread-rolls. They look like a rosette and are crusty. We pulled them apart and ate them with butter and jam..... excellent. 5. The staff. What can I say? They were friendly, spoke English, and always immediately took care of any request (such as a burned out light, extra plastic cups, tv instructions, etc). They were also very likable and seemed eager to be of service. I wish we had used them a little more.....some of the Rome attractions were closed because of weather and the staff would have checked for us and saved us a trip. They also immediately knew the appropriate bus line to take to any attraction. They also suggested an alternative to taking the Leonardo deVinci Express Train back to the airport, saving us 16 euros. We also asked them for restaurant recommendations and were pleased with the result. So my hearty endorsement of the hotel staff. They couldn't have been better. 5. Rome is a very noisy, busy city. Some of the guests were occasionally noisy in the hallways during sleeping hours. Our room was not quiet. There was street noise. Sirens, and early morning trash pickup were clearly audible in our room. If you expect a sound-proof room you will be disappointed. 6. Hotel location was tremendous. Close to Roma Termini station and close to Via Nazionale, a main street.. Close to attractions. We took the Metro train to Saint Peter's, but walked to everything else. 7. We would definitely stay there again.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lincoln, United Kingdom", "Title": "“excellent hotel in great location”", "Author": "thebrookes", "ReviewID": "UR124637906", "Content": "We stayed 2 nights here on our first trip to Rome. Excellent friendly staff who were very courteous and helpful. Our room was very clean and well kept with heating that we could control and a kettle, hairdryer and fridge. The breakfast buffet was excellent. The hotel is in a great location- about 5 mins easy walk from the main 'terminii' but very near to the city . .no more than 10-15 mins and across the road from the opera. Would definately return ! !", "Date": "February 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "nottingham", "Title": "“Simply the best”", "Author": "baronessbrown", "ReviewID": "UR123753300", "Content": "We have just arrived back home in spain and I couldnt wait to write the review...We stayed 3 nights at this hotel,it is our 6th visit to rome,and we have stayed in two 4star hotels that wasnt as good as this one,the staff were exceptional you would think it was there business the way nothing is to much for them...a credit to the owners. The breakfast is very good,large choice....we had room 207,above average size,very warm and cosy,with lots of hot water and a whirlpool bath.....I had a sneak preview of the suite room and did it have that wow factor...A must for the next visit..Hotel is well located for all the sites......would highly recommend.....", "Date": "January 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“A fantastic hotel in Rome - well priced, clean with friendly staff!”", "Author": "champagneplease", "ReviewID": "UR123232068", "Content": "My partner and I stayed here for 4 nights after a month long holiday around Europe and could not have asked for a better hotel. We arrived at Termini station late one night and decided to walk to the Hotel - it wasn't too far, however it is quite dark and scary around the station at night (a note for solo travelers), however we stuck to the main streets and found the hotel with reasonable ease. The gentleman that works at night is absolutely lovely!!! He was so warm and friendly on our arrival, helped us to our room and after staying in a number of B&B's and hostal type accommodation we were so pleased when he opened the door to a large beautiful room and large bathroom (we booked a double room with private bathroom). Air-conditioned, beautiful marble floors and well the bathroom was great - after travelling for a month we were both hoping for a room that was not too small and we were not disappointed. I had requested a room with a balcony overlooking the street and it was quite lovely. The hotel is in a good location - we walked most places and loved getting lost in the streets of Rome and finding beautiful places to eat. It was so nice to come back to the hotel at the end of the day, freshen up and then head out for dinner somewhere. I would recommend trying Hostaria Romana - an absolutely awesome restaurant - must try the carbonara and the buffalo mozzarella (I still dream about these dishes often!!). We went their twice because we loved it so much - we walked there from the hotel (as with most places in Rome)!!! Google it to find the specific location! A few things to note: if you are accustomed to large hotels, this might not be exactly what you are used to, it is a number of rooms on levels of a beautiful building that comprise of Hotel Opera (not one large building that is solely a hotel), the air-con is a must when travelling to Rome in summer, there is free wireless, TV with cable (not many english channels), breakfast in the morning (unfortunately you will need to rely on other reviews on this point, we slept in and missed it most mornings!). Also - we took advantage of the airport transfer for 40 Euro when leaving Hotel Opera - it was great (albeit a bit scary driving in Rome!!!) - we were picked up by a gentleman (he looked like Karl Lagerfield!) in a lovely black Lexus 4WD and off we were to the airport. In retrospect, I wished we had have used this when we arrived at Fiumicino, as we arrived late in the evening and the trains from the airport to Termini are not that regular and it was busy and really for 40 Euro at that time of night being picked up and driven to your hotel door is well worth it. This is offered as a service through Hotel Opera. We loved Rome and this hotel - we look forward to returning to both in the near future!", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wailea, Hawaii", "Title": "“HOTEL OPERA ROMA IS A GEM OF A SMALL HOTEL”", "Author": "MauiHIBlazer", "ReviewID": "UR123117253", "Content": "My family and I (5 adults) spent a wonderful trip in Rome in December 2011 and our stay at the Hotel Opera Roma was a wonderful experience and I strongly recommend the hotel. This is not an institutional hotel, not lavish but comfortable, inviting, and very convenient to any where you want to go in Rome. The rooms were small but comfortable, clean and especially of note is the great service and professional of the hotel staff, in particular the Front Desk. There is WiFi accessible in all the guest room and the lobby (where there also are two computer with printer access), in-room safe, confirmable beds, a mini-bar, cable TV, AC, and a speaking clean bathrooms in the guest rooms. There also is a small elevator. The people at the Front Desk are committed to making your stay pleasant and memorable. They are concerned, professional, responsive and communicative. Prior to arriving I had emailed them often and got immediate and helpful\\ responses. You also can arrange airport pick-ups through them (with a company they use) and you pay the driver directly. Again, very reliable. The hotel is directly across the street from the Opera House in an area with numerous small restaurants and cafes. A block down is Via Nazionale, a major street with adorable shopping and eateries, and two short blocks from the hotel is the Republicca Metro Station and from there you can reach anywhere in Rome. For those who like walks, you can walk to the Trevi Fountain and the Victor Emmanuele Monument. And regarding the bill, I chose to pay in Euros and received a 5% discount. Overall, the Hotel Opera Roma is a gem of a small hotel and one that I would definitely return to.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Clean and friendly”", "Author": "Brian P", "ReviewID": "UR122786060", "Content": "Stayed for 3 nights and thought it was a nice hotel. The free internet is very convenient and appreciated. The reception staff are friendly and helpful. I would stay here again.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "", "Title": "“beautiful accommodation :)”", "Author": "JemmaKBradley", "ReviewID": "UR122770107", "Content": "I stayed here for 3 nights because I had a ticket to the opera. You couldn't ask for a more convenient location not just to Teatro dell'Opera Roma, but to a main street Via Nazionale. It's also close proximity to the buses, Piazza della Republica and Termini Stazione. My single room was lovely, but really very very extremely tiny! This would be the only reason why I wouldn't stay here again. Staff were pleasant, friendly & helpful. There is a lift, breakfast was delicious, the espresso was fantastic and to be most honest, there was nothing wrong here other than my room size.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Navarre, Florida", "Title": "“Third visit”", "Author": "gagirl7143", "ReviewID": "UR121964654", "Content": "This is our third visit to this hotel in 2 years. It is still well maintained and clean. the bathrooms are large and modern. The staff is more than friendly and helpful. It really has the feel of a bed and breakfast. Riza and Litu in the office try to make every request a reality. Angela is the breakfast waitress and the housekeeper for the 1st floor where we had our room. These 3 staff members made our stay wonderful, they are a huge plus for this property! Breakfast is ample and the cappuccino is perfect. The only negative was that the internet was down for 2 of the 4 days of our visit. We were able to access the internet for free at the sister hotel a half block away but this was inconvenient. We have reservations again to stay here next spring.", "Date": "December 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Hidden gem”", "Author": "Mickiedog", "ReviewID": "UR121644842", "Content": "We stay at this hotel for 5 nights before our cruise leaving Livorno. We picked this hotel because it is very close to the central train station. We have read most of the reviews and saw most of the pictures but we were still not too sure. The driver had a difficult time to find this hotel because it has no sign in the front to indicate there is hotel in the building. We were given room 103 which faces the front, Via Firenze. The room is a nice size for European standard. Nice size bathroom but the shower is a little tight. Staff are super friendly and speak perfect English. They give very good recommendations for local restaurants around the neighbourhood. The breakfast was very good. There is always meat, eggs, cereals, yogurts, baked goods, breads and nice strong coffee! The hotel provides free WiFi which we find very helpful. The only complain we have is that Via Firenze was noisey during the weekend and we got woken up late Sat. or early Sun morning. Other than that. The place is a great place to stay at and well worth the money we paid.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Paris, France", "Title": "“Gem of a hotel”", "Author": "kungpao", "ReviewID": "UR120699505", "Content": "On arrival, I was getting more and more nervous about the hotel, as I passed street after street of sketchy hotels. As soon as I found it, though, I was instantly relieved and incredibly happy with the presentation of the hotel. The staff are very friendly and welcoming, and all speak perfect english. The room was a bit stuffy and smelled of bleach when I walked in, but at least I knew it was clean. The air conditioning worked its charm, and the room was perfect. A bit small, but considering I asked for a room for one person, it was just enough. The bathroom was nicely appointed, and the shower's water pressure amazing. Breakfast is included in the price, and is served on the ground floor next to the lobby. A great deal for the price! The only issue was that the drain in the shower wasn't working so well, but upon notifying staff, they immediately called someone to come take a look at it. All in all, very happy with the choice! The area can be a bit dodgy, but if traveling with more than one person, this shouldn't be a problem. As a single female, I wasn't always comfortable in the area, especially at night. It's about a 7 minute walk to the Termini train station, making it incredibly convenient for arrival and departure by train or plane, since the Leonardo Express has trains to/from the airport every 30 minutes.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Updated”", "Author": "MortonGrove", "ReviewID": "UR120535259", "Content": "We stayed here for our last night in Rome through our reservation at Hotel Sonya. The location is great, walking distance to Termini and subway stations. Quiet street just off Via Nacional. Room was newly updated and very nice and comfortable. The towel warmer even worked and this was probably the largest shower stall of 6 hotels we stayed at. They were very good about ordering a van for our morning departure to the airport. They have a Rick Steves discount. No complaints.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“9 Nights at the Opera”", "Author": "Cherylab", "ReviewID": "UR120038563", "Content": "My spouse and I stayed nine nights here. Like some other guests we booked with the Hotel Sonya, but were transferred to the Hotel Opera Roma. At first we had our doubts, but we found the hotel staff friendly, accommodating and speaking excellent English and the hotel exceeded our expectations. Our room was clean, large and comfortable with a firm mattress and pillows. The bathroom, with a jacuzzi, was large with very hot water, but only 1/2 a shower door. (This is a style you see in Italy.) Our room was on the first floor (one flight up), but quiet and windows appeared to have double panes. Breakfast is substantial and includes home-made cakes and addictive cornetti. Hotel location is excellent, only 2 blocks from the Metro and National Museum of Rome, and 6 blocks from the train station. The hotel is around the corner from the the Rome Opera which is a excellent landmark for taxi drivers, and only 1 block from Via Nazionale for fun shopping. The hotel even offers a cash discount. We will stay there again and recommend it to all.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“A Very Nice Hotel”", "Author": "Toni A", "ReviewID": "UR119870386", "Content": "We reserved this hotel off the internet and were very happy we did. It was clean and nice and the service was wonderful. The people were always very willing to help us. The location was great. Public transportation is close by and we loved the Piazza Republica. We really enjoyed it and recommend it to anyone.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sterling, Virginia", "Title": "“A very nice hotel in a pretty convenient location”", "Author": "Sharon S", "ReviewID": "UR119836886", "Content": "My mother and I stayed for four nights in the hotel, just a couple of weeks ago. We knew we were staying in this hotel, and not Hotel Sonya, so that eliminated some potential confusion. The outside sign is very very small, so you must look for the hotel based on the address. The hotel was very clean and comfortable. They held our bags and let us check in early. The breakfast (included with our room price) was quite substantial, and laptop use was free. The beds were comfortable and the room a decent size by European standards. Bonus - the hotel isn't far from the train station, and it is right next to the Opera House, perfect for coming home late after an opera or ballet, if it fits into your itinerary! I would definitely recommend the hotel and stay there again.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "california", "Title": "“A Trip to the Hotel Opera Roma”", "Author": "galve", "ReviewID": "UR119828146", "Content": "My wife and I recently stayed a week at the Hotel Opera Roma. We had never stayed at the hotel and I booked it sight unseen via the Internet. Our experience was great and I would recommend it to anyone wishing a small hotel in a convenient location as the Termini Station was only a few minutes away where one can easily travel via train, bus, or metro, as well, as walk to many of the sights. We had plenty of space in our room and the room was very nice. The staff did a wonderful job of keeping it neat and clean during our stay. The staff was very professional and helpful. Reza, Angela, and Litu were especially helpful. Reza working the front desk was a wealth of information that always proved to be spot on. Overall, we had a wonderful stay and hope you do too.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "", "Title": "“Bait and Switch”", "Author": "grego344", "ReviewID": "UR119110789", "Content": "We booked our room through expedia , when we arrived at 11a.m. we were told there were technical difficulties with the room. and wanted to switch us to their other hotel down the street When I refused to be relocated they started showing me available rooms, none looked like the pictures on the web site and none were acceptable . I agreed to look at the rooms in their Hotel Sonya and after viewing 4 rooms they finally showed me a comperable room to what I had booked online, dont know why they didn't want to give me the room I paid for in the first place. Other than the bait and switch the hotel was just fair. 2 star at best. Who needs the agrivation", "Date": "October 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rio de Janeiro, RJ", "Title": "“\" 100% - Best Deal in Rome \"”", "Author": "MarcosF123", "ReviewID": "UR119106217", "Content": "After looking for more than 80 hotel´s sites at the Internet , I found this \"\" Hidden Treasure \"\" in Rome. My Family and I stayed at the Opera Hotel for 6 nights , we got 2 Rooms ( 410 & 413 ) and it was just 100% PERFECT . All rooms are Super NEW , Modern Style , The ROOMS are bigger than the Average Room size in most Rome hotels. The Room 413 is the Biggest room and has it own Balcony . Lets go for the best of \"\"OPERA Hotel \"\" : LOCATION !!! , it is Located in the Middle of the Action , for example : Train Terminal = 800 meters ( 1/2 mile ) , Repubblica Metro Station = 400 meters ( 1/4 mile ) Colosseum = 800 meters ( 1/2 mile ) , Fontana di Trevi = 1.000 meters (2/3 mile) , Spanish Steps ( shopping area ) 1.100 meters ( 2/3 mile ) , Monument Vittorio Emanuelle = 1.000 meters ( 2/3 mile ) . Between all the GOOD things about this Hotel , Comfort , Cleaning , Location ............................. I would give a SPECIAL ATTENTION to the Hotel´s STAFF , they make you Feel Like HOME !!! On the Front Desk , you have the \" charming \" Valentina and the Very Special EMANUELA ( who Speaks Fluently : English , Portuguese , Spanish and French ) , they do LOVE Help and Talk to you . Do Not leave the Hotel Before have a Good and Pleasant Talking with then . Last , but not least = a \"\" Standing Applause \"\" for the Special Lady at Breakfast , Mrs. GIULIA , I have traveled all around the World , but NEVER had this Kind of Attention & Love as we got from GIULIA , I bet you will be Impressed ............................. After all , I do have to say some things NOT so PERFECT about this Hotel , the Front Desk is Located 15 Steps UP from the sidewalk , so You Do Have to care your Bags up and down this 15 steps .", "Date": "October 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "peckville , pa. usa", "Title": "“5 Star Small Hotel”", "Author": "highlander44", "ReviewID": "UR117989909", "Content": "Impeccable service and amenities. Friendly , extremely professional, courteous, helpful and knowledgable staff ... and so very kind and patient . What a beautiful property with an excellent location , very \"central \" and convenient to all of the most important points of interest . Rooms were immaculate , very quiet and well appointed ...beds extremely comfortable and house keeping absolutely immaculately clean. Typical Italian breakfast that was nicely expanded ,served in a gorgeous room . Included eggs and a lovely selection of meats. and fresh fruit along with all the typical Italian breakfast fare. I will never stay anywhere else when in Rome in future . This small hotel is a perfect find !", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“ONE OF THE BEST CHOICES”", "Author": "Stratis K", "ReviewID": "UR117459223", "Content": "Upon our arrival, we were slightly confused about the location of the hotel since there was no obvious sign of it in the frontage of the building. In fact, the hotel is part of an apartment building where families live as well. However, the service was excellent. The kindness and the professionalism of the staff were really impressive!!! The room was comfortable, although not very big. It was very clean and luxurious. We didn't have the best view from our window but when you visit Rome staying in would be the last thing you would like to do! We were offered a free laptop and free internet access, which was very helpful in buying tickets online for the Vatican museum e.t.c.. The location of the hotel was excellent, very close to the city center and many city sights, the Rome termini and Metro. I would surely stay again in this hotel.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Medford, New York", "Title": "“A great little hotel”", "Author": "lorrisull", "ReviewID": "UR115997960", "Content": "The service was excellent. Always ready to help with directions, reservations and anything we needed. The room was very clean and comfortable. The location was also very good and we found that we could travel all over Rome very easily.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Great stay in Rome”", "Author": "grahatd", "ReviewID": "UR115919723", "Content": "The Hotel Opera was a really nice place to stay in Rome. It is convenient to Termini and Subway and Bus transportation. I took the train from the airport and walked the short distance to the hotel. It was easy to walk or take the subway or bus to all the sights of Rome. I bought a 7 day transit pass so it was easy to hop on a bus or subway and go where I wanted. I had a single room, which was small, but roomy enough to not feel cramped. The room was spotless and looked quite new. The marble bath was very nice as well. The breakfast room was very pretty and they served a continental breakfast that was very good and got my day off to a good start. I will stay here again on my next trip to Rome.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Kamloops, Canada", "Title": "“Perfect location in Rome”", "Author": "Linda531", "ReviewID": "UR115828574", "Content": "This small hotel offers the perfect location for visiting Rome. Within easy walking distance from the train station, Spanish Steps, Trevi Fountain and Metro. Room was small but clean and comfortable. Very reasonable rates with a nice breakfast included. Front desk staff was pleasant and helpful. Safe neighborhood across from the Opera House.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Loved it! Everything was perfect!”", "Author": "Sasha88_11", "ReviewID": "UR115773593", "Content": "The room was very clean and well furnished, plenty of space as well. The bathroom was great! Room service was comprehsive and I think went above and beyond, even folded up some clothes i had all over the place. The staff were very very helpful and freindly and spoke great english, french also i think. Breakfest was nice and there were many options and coffee was made to order. The hotel was located in a great part of the city, a quite side street in a great clean and safe part of the city. We walked to every main attraction in city with out the need to use public transport. Can't say enough good things about our stay with this hotel!", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Oudenaarde, Belgium", "Title": "“Perfect stay in Rome”", "Author": "brandweer", "ReviewID": "UR115578088", "Content": "We stayed for 6 days in Rome. We had booked 2 rooms for hotel Sonya but on arrival we had to transfer across the street to hotel Opera Roma. The hotel was excellent. Breakfast was more than expected. The hotel staff was very friendly and helphull. Very good value for money.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "California", "Title": "“Loved the hotel”", "Author": "Fatheroftwokids", "ReviewID": "UR115221828", "Content": "This was our first stop of our Europe trip and the hotel made the transition very easy. We reached the hotel at around 9:30 in the morning after taking the shuttle from the airport. The front desk person was very friendly and offered us a free breakfast even though we had not begun our stay there. Within about an hour, the room was ready and we checked-in earlier than expected. The person gave us a free netbook for our stay. There was some issue with the netbook connecting to internet, but they sorted it out by the evening. He recommended some nice restaurants in the neighborhood which were excellent. The hotel is within walking distance of two train stations Republica (5 min) and Termini (8-10 min), which made it very easy to see all the sites we wanted to see in Rome. Everything except Vatican was within walking distance anyway. The rooms were comfortable with adequate size (in Europe they tend to be smaller anyway). We had selected a room for four, which had one double and two singles. Breakfast was good, nothing fancy, but adequate. The hotel is on a side street, off a big central street (via Nazionale). This is the perfect combination for us, no noise, but ready access to everything including a Despar supermarket, ATMs, buses on the main street. Highly recommended for family stay!", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "San Dimas, California", "Title": "“Great location in Rome!!”", "Author": "yoliemar6", "ReviewID": "UR115034152", "Content": "We stayed at Hotel Opera Roma on the recommendation of a friend and we were not dissappointed! We wanted a hotel that was walking distance to Termini Staton and this was located within a 15min walk. We were traveling with minimal luggage and we easily walked to Termini Station to catch an early train to Salerno on our last day in Rome, but if your traveling with more luggage, it may be a bit too far. We also easily walked to one of the many metro train stations and arrived at Vatican City with 2-3 stops and also the Coliseum in no time. There were many restuarants to choose from and the staff was very friendly and helpful. Our room was very spacious with modern decor and the AC was great!! We would definately stay here again should we return to Rome. It was an execellent choice and a great rate for this type of room quality in Rome.", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "ny", "Title": "“Good location, great customer service”", "Author": "tayeret", "ReviewID": "UR115020219", "Content": "We spent 5 nights at the Hotel Opera Roma, and really were pleased with our stay. We chose it because it was near the train station. When we arrived, we found that it was a few blocks away and the map was somewhat confusing, but we found our way easily enough. It was also walking distance to many Rome tourist attractions, but there was always a bit of a walk to get there. However, it was very convenient to buses and metro. The room itself was typical small European room, but it was certainly adequate, and we were comfortable. The best thing the hotel had to offer, as far as we were concerned, was their customer service. The people at the desk were so helpful with directions and advice. They really helped us get our bearings in a very large and confusing and city. One of them was also kind enough to lend us an umbrella when it suddenly started pouring as we were heading out to a laundromat. The breakfasts were a wonderful way to start each day. I would definitely recommend this hotel to others.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Noblesville, Indiana", "Title": "“Fabulous place to stay in the beautiful chaos of Rome!”", "Author": "embransteter", "ReviewID": "UR114834076", "Content": "We opted for a real \"hotel\" in Rome rather than the B&Bs we stayed in in smaller cities because we liked that there was staff on hand 24 hours a day. This hotel was also recommended by Rick Steves. We wanted to stay within walking distance of the train station, and this location was excellent. We were happy with how quiet it was despite being in the heart of the city. It is off a side street, and we walked everywhere except the Vatican - which was a 4 minute walk to the Metro! Tons of restaurants and shopping around. There's an Irish Pub and McDonald's just around the corner if you want something you are familiar with, and they're open ALL day. Every staff member we encountered was helpful and friendly. They helped us arrange a transport to the airport and had a very helpful map with the popular sights highlighted. Breakfast was wonderful with many options - eggs, yogurt, croissants, cereal, fruit, juice, coffee, and tea. Our room and bathroom were adequate size. Most things are smaller in Italy, but we had plenty of room. The room was very clean, and the bed was huge! There were TV channels in English, too. The coffee and tea in the room was great to help us wake up from a siesta - the only way to do Rome without complete exhaustion! The free wireless access was fast, and when our password stopped working, the front desk simply gave us another one. I would stay here again if I visit Rome!", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“ok hotel”", "Author": "primerib74", "ReviewID": "UR114769436", "Content": "located by the Opera in Rome. Very difficult to find as the signing in not good. He had to ask a man working in the internet cafe down the street. Rooms had recently been redone and they are very nice but small. ONly 14 rooms in the hotel. Front desk staff is very nice and the breakfast was good. The only real complaint is the we would have rather stayed in the older section of Room", "Date": "June 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Scranton, Pennsylvania", "Title": "“Great find!”", "Author": "WellyWoo09", "ReviewID": "UR114658000", "Content": "My husband and I along with four of our family members stayed at the Hotel Opera for 4 nights in early June. The hotel was fantastic! Prior to our arrival, they were very accomodating, assisting me with booking trasportation from the airport to the hotel. Upon arrival, we were greeted at the door with warm smiles and helping hands to carry our bags. The hotel was spotless & our room was well appointed including the bathroom which had a gorgeous tub perfect for soaking after a long day of sightseeing. Breakfast simple but good and the staff always pleasant during every interaction. The location was perfect too- it was easy to walk to Termini Station and just a short ride from all the major sights. Hotel Opera was really a wonderful find! If we ever travel back to Rome, we will absolutely be staying here again!", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sedona, Ariona", "Title": "“GREAT value in the Heart of Rome”", "Author": "docbones", "ReviewID": "UR114282455", "Content": "We stayed at Hotel Opera Roma, which is located in the heart of Rome. We chose it because it was only $165/euro's a night compared to 300-600 euro's a night at other surrounding hotels. The staff was friendly, familiar with the in's and out's of Rome and were of enormous help. Our room was spare, clean, had a TV, air conditioning, bathtub (important for me). There was no spa, no fitness room or swimming pool. They also had a fabulous breakfast and loved their cafe latte's they made from scratch. Their breakfast was sumptuous, the food fresh and everything spotless. They suggested since we were staying 5 nights with them, an Italian restaurant, Antica Boehome, and it's FABULOUS! We at there every night. Fab service, food fresh and delicious...this is true Italian cooking at it's finest--and very cheap in comparison to other places---a little hole in the wall off on a side street. We will be back, and we'll use Hotel Opera Roma as our center to walk to see all the incredible sites that Roma has to offer. We loved our stay. The room was quiet, non-smoking. It had a good internet connection and phone.", "Date": "June 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Small, but perfect in every way”", "Author": "alie01", "ReviewID": "UR112948072", "Content": "My friend and I recently stayed at the Hotel Opera for 4 nights on a 2 week tour of Italy. It provided a quiet peaceful place to relax after a busy and hot day sight seeing in Rome. Although the room was very small it was comfortable and spotlessly clean. Breakfast was enjoyable, and the friendly and competent staff were a bonus. Great location for everything - including some good local restaurants.", "Date": "June 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Family time for bonding and discovering our Italian heritage”", "Author": "Dianadean", "ReviewID": "UR111817002", "Content": "My husband and I took all of our adult children to Italy for a family vacation in November 2010. We visited Venice, Florence, and Rome. Rome was our last stop. I cannot express enough the wonderful communications I had with every member of Hotel Opera's staff prior to my trip and while I was there. The staff did everything they could to accommodate my entire family including 2 room changes. I worked in the hotel business so I know how stressful it can be to accommodate room changes so that your guests are comfortable. This staff handled the situation with ease and professionalism. By the time we left I felt like I was leaving friends. They even arranged a van to take us to the airport that was very reasonable. Our driver seemed like a tour guide rather than a van driver. If you want a staff that looks for ways to make your stay wonderful this is the hotel! The rooms were clean and attractive. The breakfast was delicious. The location was perfect. I have already recommended the hotel to a cousin. But the staff was the very best!!!! Bravo", "Date": "June 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Greer, South Carolina", "Title": "“Our Second Stay”", "Author": "Andy29650", "ReviewID": "UR111201230", "Content": "Hotel Opera Roma was so great a value four years ago that we returned with friends this year. The hotel is conveniently located near Roma Termini and restaurants on a quiet side street beside the Opera House. The rooms are modern and comfortable. Breakfast is in an attractive room with a variety of food choices. The best aspect of this hotel is the staff. The front desk personnel were especially knowledgable and helpful. The breakfast room was well-run, and the rooms were kept neat and clean. Tips: Two convenient restaurants with good food, fair prices and local flavor: Ristorante da Giovanni ( on the corner of XX Settembre and via Salandra) and Strega ( two blocks from the hotel)", "Date": "June 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Very kind and helpful staff”", "Author": "grethejorg", "ReviewID": "UR106445341", "Content": "The suite was perfect to a family with two teenagers as you could stay together. If the adults have been on their own, an armchair would be fine", "Date": "May 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Very helpful information and efficient service at the front desk.”", "Author": "DLKWI88", "ReviewID": "UR104798206", "Content": "The room was spotless with three very comfortable single beds. Large bathroom, also spotless. Great location next to a major landmark (the Opera House), so it was easy to find your way back. Room was not very well-lit but each bed had a reading lamp over it so that compensated for it. The personnel at the front desk were extremely friendly, extremely helpful, and gave us many tips and advice that saved us time and money. The one time we asked them to call a cab for us (we didn't feel like making the short walk to the train station while schlepping our luggage), it arrived within MOMENTS - truly, the time it took us to walk from the front desk outside to the curb and the cab was pulling up. Incredible!", "Date": "April 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Grapevine, Texas", "Title": "“Spring break in Rome”", "Author": "Peadar18", "ReviewID": "UR104279766", "Content": "Excellent Hotel, staff were friendly and informative, there advise for restaurants was spot on. The location is within easy walking distance of most attractions and close to the Metro. I would highly recommend this hotel", "Date": "April 16, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Williamsburg, Virginia", "Title": "“There are too many hotels in Rome to stay at this one”", "Author": "BLT1991", "ReviewID": "UR104271086", "Content": "I stayed her one night with a family of 4 (2 teenagers) on our last night in Italy…we staged here before an early flight the next morning. The hotel had received fairly high marks on Trip Advisor and was mentioned in Rick Steves, but it didn’t measure up. It is not in a charming part of town…there is no sign out front for the hotel…which makes me wonder a bit. When we arrived, there was some “issue” with our intended room, so they “upgraded” us to their “special room” and then gave us the room next door for the kids. Space-wise, it was fine and the room looked fancy…but like a façade built over an old structure…the fancy suite wasn’t all that. The bathroom was in a grotto downstairs with a hot tub (it all briefs well and makes for a nice picture)…but the hot tub was cold. The bathroom was extremely hot…driven by an overactive towel warmer. There was a fancy Jacuzzi shower…but none of the controls worked…and the water wouldn’t stay at a constant temperature…it tended to get dangerously hot. The entire suite reeked of chlorine. There was broken glass on the floor…which my daughter found with her bare foot. My wife came away with some suspicious bug bites on her feet…fortunately, we think they were fleas and not bed bugs. The breakfast was mediocre at best…the worst we had had in Italy. There are too many hotels in Rome to waste your time and money at this one.", "Date": "April 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Berkshire England", "Title": "“A memorable visit to Rome”", "Author": "LeeBerkshireEngland", "ReviewID": "UR102551916", "Content": "Originally booked to stay in Hotel Sonia, on arrival told we were staying at their new hotel across the road we were not disappointed, staff were friendly and very helpful, good location we walked to most of the attractions,but bus and metro (termini) are all near by to get to the Vatican and Colosseum. The breakfast room was very small, you had a choice of cereal,eggs,cake, yogurts,croissants,rolls and fresh fruit with tea and coffee. Recommend a great restaurant around the corner from hotel called Sapori Nuovie on via delle Fontane.", "Date": "April 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Value and Location - what else can I say?”", "Author": "AlabamaAnne", "ReviewID": "UR101950946", "Content": "This hotel is a tiny bit \"no frills\" but is located in a perfect spot to explore Rome by foot, which is what we did. The hoteliers provided a good breakfast, with fruit, yogurt, eggs, cheese, baked goods including cakes and pastry, and excellent coffee. The rooms are small (it's the heart of Rome!) but well outfitted. We had three to a room (parents and 19 year old), and it was a tad tight. There was good security, too. The bathroom was quite nice. Being on a side street, the room and hotel were fairly quiet at night, too. Free internet was a very welcome finding. It's not the Grand Regency, but the hotel was much more than adequate for our needs, and not overpriced at all.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "1.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Visaginas, Lithuania", "Title": "“Good location, close to Termini station”", "Author": "j_irina2006", "ReviewID": "UR101376777", "Content": "I would recommend this hotel for my friends in case 2-3 days trip. Quiet place but close to Termini station and 15-20 min. walk by foot to sightseeing. It is very small breakfast room.", "Date": "March 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rotterdam, The Netherlands", "Title": "“friendly en welcoming hotel”", "Author": "italyfreak1970", "ReviewID": "UR100972690", "Content": "This hotel is very good for a citytrip. It's central and all the main attractions are in the neighbourhood. The hotelpersonnel are very friendly en welcoming. The breakfast is ok. The room are very clean and each day the room cleaned. This is a wonderfull hotel and I would advise erveybody to go this hotel. There is a supermarket in the neighbourhood (at the corner).", "Date": "March 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "ireland", "Title": "“Disappointed overall”", "Author": "cath32", "ReviewID": "UR98275531", "Content": "Just home from our stay in Rome. Had booked the hotel Sonya, but were given a room here. This hotel has alot of pro's, but unfortunately for us the con's out weighed them ! yes it is only five mins from Termini, a minute walk from Via Nazionale which has bus connections, friendly enough staff and is very clean. However while we were there we had the following issues - - drip from towel heater in the very small bathroom was reported 3 times over 2 days before it was finally fixed. We had to put towels down on the bathroom floor so we wouldn't slip, and had to lay awake ( even with bathroom door closed) listening to the drip drip drip drip aaarrghghh. - room was very cold and by the second morning we asked reception if it was possible to turn up heating as aircon controls didnt seem to be working. ( didnt complain the day before as in true irish style we didnt want to seem like we were complainers and were more concerned with the constant drip at that stage !!). Anyway the reply from reception was that a technician would be here to fix it today, they were aware of the prblem, was a bit annoyed that we were put in a room with these problems considering we hadn't even booked this hotel. -small breakfast room and 2 of the 4 mornings we were there we had to wait for a table, dont know how many rooms are in this hotel but there are 2 tables that seat 4 and 4 tables that seat 2 in the breakfast room. -mouldy fruit in the fruit bowl, and same cakes there for 4 mornings, gradually getting staler. -check out is at 11a.m, my husband asked how much it would be to keep the room til 4p.m, we taught €70 was excessive, considering the room with breakfast was on average €84 per night if paying cash. - 2 computers with free internet access in reception area, but with very slow connection and often bombed out. I'm sure its possible to find a better hotel for the price paid in the termini area.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "PONTELAND", "Title": "“Really really clean. Staff vey helpful. Ideal location”", "Author": "TUCKEN", "ReviewID": "UR87739271", "Content": "New rooms. Very very clean. Great bathrooms.Good location 10 mins from main train station. Staff really helpfuf. Excellent breakfast. Good restaurants very close by.", "Date": "November 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Navarre, Florida", "Title": "“Another wonderfu stay!”", "Author": "gagirl7143", "ReviewID": "UR87458483", "Content": "This was our second stay at Hotel Opera Roma and again we were especially pleased again with our stay. Our room was immaculately clean. The photos on their website are definitely representative of the rooms. The Staff is extremely friendly, helpful and very knowledgeable. This hotel feels much more like a B&B. Litu, Eta, Riza or Simone are always at the front desk. Angela is in charge of breakfast which is very adequate. We highly recommend this charming hotel and will be staying there for a third time next Fall! One feels like a member of the family while staying here. The location is fantastic!", "Date": "November 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lewisville, North Carolina", "Title": "“Okay for the price”", "Author": "lacybass", "ReviewID": "UR87391682", "Content": "Pros-Hotel is in a convenient location near Termini and the Repubblica Subway stop. Rooms were clean and staff helpful. Also our lowest-priced hotel in Italy (under 70 Euro for a double with cash) in November. Cons-Worst breakfast out of 4 hotels in Italy, many of the pastries/breads tasted hard/stale. FYI-We originally made reservations at Hotel Sonya (4 months prior) but were still placed at Hotel Opera Roma which I think is a common occurence. We were upgraded to the suite. The suite is spacious but in an odd configuration. Bathroom/jacuzzi are on the bottom floor, bed on the 2nd floor, and 2 other small beds are in the loft. The bottom level is very humid and pretty hot despite 2 dehumidifers being near the jacuzzi. There is no window or good ventilation on this level. The 2nd level also was quite warm and felt humid and too warm, even in November. The air-conditioning never came on as you can only lower it to a specific level. Although the hotel was a good value and overall it was fine, if we go to Rome again we would pay more to stay in another hotel.", "Date": "November 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Excellent hotel - definitely recommend!”", "Author": "eyylim", "ReviewID": "UR86786043", "Content": "This is a great hotel, the staff are friendly and the rooms are clean and nicely furnished. The hotel is next to the metro which makes it easy to get around and also close to one of the tourist bus stops. We would definitely stay in this hotel again!", "Date": "November 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Beavercreek, Ohio", "Title": "“Excellent hotel in a convenient location”", "Author": "physicsgeek", "ReviewID": "UR86186648", "Content": "Excellent hotel in a busy city. It's conveniently located to Stazione Termini - about a 5 minute walk. It's location is perfect for accessing Rome's attractions. My wife and I occupied a room with a king bed during the first week of November. The bed was very comfortable and the price was very reasonable. We took advantage of their 10% discount on the room rates by paying in cash and booking on-line. Although the room was small, it was very clean, comfortable and quiet - no complaints. The staff was very accommodating and friendly. They were happy to make reservations for us at galleries, their eating recommendations were spot on, and they provided accurate directions to our destinations. We enjoyed a plentiful breakfast each morning. The minibar prices are the best - very inexpensive compared to local stalls. The hotel has free internet which we found very useful. We would definitely use this hotel again!", "Date": "November 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“A fantastic hotel - it was my home away from home”", "Author": "holidayfunMelbourne", "ReviewID": "UR86000128", "Content": "I was nervous about staying in Rome as a female traveller alone however felt perfectly safe and comfortable at the Hotel Opera Rome. It was my home away from home. The staff were absolutely fantastic – so friendly and helpful in particular Silvia, Eta and Giovanna. The hotel had free Sky TV with numerous English channels and free internet which I did not see in many other hotels on my trip. It was only 10 minutes walk from the Spanish Steps and just around the corner from the public transport. The room and public areas were clean, comfortable, modern and so quiet. I could not fault the service and facilities. I will definitely return on my next visit to Rome. Thank you to everyone at Hotel Opera for making my first visit to Rome so memorable..10/10.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Here", "Title": "“Would not hesitate to return”", "Author": "FDPevey", "ReviewID": "UR85857998", "Content": "Good location - wonderful little restaurant right up the street. The king bed room for my husband and me was spacious, had a little quasi-balcony that overlooked the street, and a huge bathroom. The single room for my sister was REALLY small, but it was priced accordingly and the bathroom worked well for a single. Everything was spotless and the beds were wonderfully comfortable. The Sky TV was a great feature - after touring all day it was actually a pleasure to relax and watch TV (once I figured out how to change the language to English - easy when you know how). Breakfast was tasty. Mini-bar prices are reasonable, good to be able to grab a glass of wine when relaxing. If you want a great sleep, a clean room, and a good value - this is the place! DEPARTURE HINT: Leave at least THREE HOURS to check in at the airport when leaving from Rome. I thought the advice the hotel staff gave us was nuts - especially for a 7 a.m. flight, but I was glad we listened. It was a nightmare end to a great trip - we were in line to check in for 2.5 hours! Had we done the usual US two hours before take-off, we would have missed our plane.", "Date": "November 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "melbourne", "Title": "“very friendly and helpful”", "Author": "cjeMelbourne", "ReviewID": "UR85334529", "Content": "It was hard to find Hotel Opera Roma but when we did we were welcomed and it was a very comfortable room. Breakfast was very good. We got down there late and they still served us. They stored our luggage for a late dparture and ordered a car to the airport at a very reasonable cost. Hotel Opera Roma is part of Hotel Sonya and if we had known it would have been easier to find. It is walking distance from the station adn all the sights. Highly recommend.", "Date": "October 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Lovely hotel, great location, friendly staff”", "Author": "Denise186605", "ReviewID": "UR84870316", "Content": "I stayed with friends in this hotel in October, we stayed in a suite the room was spotless and very big, the bathroom was particularly luxurious. The staff was very helpful and friendly and the hotel is located close to all the main attractions. I would definitely recommend this hotel and I will stay there again whenever I am lucky enough to be in Rome.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Spokane, Washington", "Title": "“Great location, excellent service”", "Author": "judym67", "ReviewID": "UR84825329", "Content": "We had a very nice stay at the hotel in early October. We loved the proximity to both Roma Termini and 2 metro stations as well as the easy walking to many of Rome's sights. The staff was extremely friendly and helpful. Our room was quite nice, having been fairly recently renovated, and was very clean. We liked the breakfast that was offered. There were many choices of things to eat and the coffee was excellent. We would definitely stay here again!", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“A relaxing oasis in a bustling big city.”", "Author": "Hollidaze_8", "ReviewID": "UR84214206", "Content": "We stayed at the hotel opera for three days in September and then again for two days in October. The location was wonderful - very close to the termini train station and within walking distance of most of the tourist attractions in Rome. Breakfast was very good and the staff very accomodating and friendly. The first time we stayed there we had a larger room with a jacuzzi and when we came back, we ended up with a much smaller room. We just mentioned that fact to the receptionist and the next day they put us in a suite with a private hot tub! Obviously they care about keeping their customers happy! Would defintely stay there again.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tampa, F.", "Title": "“A wonderful little hotel”", "Author": "SunCitySteve", "ReviewID": "UR83981093", "Content": "My wife and I had the pleasure of staying at the Hotel Opera Roma for three days this past September. The staff was very helpful and friendly Thanks Raza!! The location is on a small, quiet street about 5 blocks from the Termini train station. The Metrro stop at the Termini allowed us to get where we wanted to go without a lot of walking, but we did choose to walk to the Spanish Steps one evening just because we were in Rome! The breakfast at the hotel each morning was a delight, lots of things to choose from and uniformly good. The cafe latte was exceptional! When we are in Rome again we will stay at this wonderful little gem.", "Date": "October 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hong Kong, China", "Title": "“Wonderful Service”", "Author": "rachel524", "ReviewID": "UR83667458", "Content": "After confining in a flight for over 10 hours, my friend and i arrived Rome in early morning and came to the Hotel Opera Roma at about 8.30am. The staff (Ms. Silvia) was so kind to try her best to arrange us an early check-in, and also offer us cups of coffee, which indeed made a very good start of my journey in Italia. Also, the hotel is quite near to the Metro. Also, the room is clean and tidy though not a very big one.", "Date": "October 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "new york", "Title": "“Great service”", "Author": "Lenahl", "ReviewID": "UR82811356", "Content": "Easy walk from the train station and close to metro and sights. There are also cafes and stores nearby. The Indian gentleman at the front desk was very helpful and hardworking making our stay that much better. The hotel is small and the rooms are small but clean. Our windows opened out onto the street which was nice. Breakfast was good too. Overall good value for money.", "Date": "October 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Niteroi, RJ", "Title": "“Best hotel after one month in Europe”", "Author": "AnaAmaral", "ReviewID": "UR82662694", "Content": "I stayed in 5 differents hotels in 5 cities during my vacation in Europe an the best hotel of my trip was, by far, the Opera Roma. The location was better than I expected, the room was also wonderful and the service was amazing. The girl who served us during the breakfast was really nice e most of all, the gentlemen from the front desk, Lito, is a very polite and helpful guy.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Laval, Canada", "Title": "“CIAO ROMA!”", "Author": "acc25", "ReviewID": "UR82622005", "Content": "Gotta tell you how wonderful this hotel was! Especially the morning buffet breakfast! Clean and afordable located in a safe neighborhood. Its minutes for the train station and walking distance to most major attractions! We walked all the way to the Vatican and then took the Metro back. It was a truly a memorable experience for all of us. The staff is very helpful and a map was provided showing the locations of the major sites. Highly recommend this hotel for anyone passing through Rome. We we were there for 3 nights!", "Date": "October 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Charleston, South Carolina", "Title": "“The suite is SWEEETTTT”", "Author": "ABlueAngel", "ReviewID": "UR81992320", "Content": "love the fact that's its a short distance a way from Termini station so we walked from the station to the hotel. We were surprised by the upgrade and got the suite. It's sweeetttt. If the hot tub and jacuzzi shower worked during our stay it's definitely a 5 but since it was broken the whole time we were there (4 nights), I have to give it a 4. But, the room though is really nice. It's nice to go back to a clean hotel after a whole day of venturing the city. The service staff are very nice, friendly, and helpful. I would definitely go back to this place again.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moorpark", "Title": "“Great hotel in a convenient location”", "Author": "kdgross", "ReviewID": "UR81943641", "Content": "We would definitely choose Hotel Opera Roma for our next stay in Rome. This is a lovely hotel that is only 5 minutes walking to the main train terminal in Rome. The Colosseum, Trevi Fountain, and other major attractions are all within walking distance. Best of all, it’s a very well kept hotel and the staff is friendly and helpful with anything you need, directions, restaurants, international phone options, etc. All around delightful.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Grand Haven, Michigan", "Title": "“Good amenities, quiet, clean, comfortable and close to Termini station.”", "Author": "rajna", "ReviewID": "UR81933234", "Content": "Very quiet with good amenities (computer access in room, coffee maker, TV to watch ESPN). Staff was helpful. Morning breakfast was cheerful and a nice way to start the day of sightseeing. Close to Termini station for easy transportation without paying for taxi rides. The only negative was that the hot water fluctuated with cold during a shower. We slept well in the hotel and would not hesitate to stay again.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Pleasant stay in a central location”", "Author": "sueO_RonR", "ReviewID": "UR81668349", "Content": "I had booked on other users recommendations and when we arrived we were placed in a new area of the hotel (across the road in another building in fact) which was recently completed. The room was new and of typical size for Rome 3star; everything worked and we also had a little balcony onto the street. Price was good so we would be happy to stay here again for a short time.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great location, helpful staff, clean modern rooms”", "Author": "SeattleCrazyhair", "ReviewID": "UR80361026", "Content": "It is close (walking distance) to the main train station and the subway. It is a good location for site seeing. Our room was modern, quiet and clean - a little small, but fine. The breakfast room was a little crowded, but the food was good. The front desk staff was very helpful and pleasant (even when dealing with some other guests who were being really rude). They set us up with a private driver to the airport, which was less expensive (for 3 people) than a taxi and more convenient than taking the train.", "Date": "September 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arlington, Virginia", "Title": "“Jacuzzi Tub”", "Author": "PinoSpringTime", "ReviewID": "UR78702131", "Content": "These rooms are amazing, spacious, luxurious, and AIR CONDITIONED! We loved the jacuzzi tub and small balcony overlooking the street below. Highly recommended!", "Date": "September 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Zagreb, Croatia", "Title": "“Very nice peacefull hotel in the center of the city”", "Author": "Ivana2010", "ReviewID": "UR78491830", "Content": "The rooms are recently renovated and the hotel is very clean. The staff is helpful and cordial, the location is excellent (near the Termini station and a large street but nevertheless quiet), and breakfast very nice and satisfactory. The only negative point was the size of the room, but for Rome standards nothing unusual.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Excellent service, cozy, and great location.”", "Author": "Tummy_tum", "ReviewID": "UR77577815", "Content": "My wife and I stayed at the Hotel Opera Roma in July for a total of 7 nights, 5 nights the first stay and then 2 nights the second stay. Both stays were excellent. Rooms: The rooms were both small, but definitely served our needs. There was a mini-fridge with a selection of drinks, a fairly large wardrobe, and a desk for a computer or for reading. There was also a kettle with coffee if desired, and we were able to ask the staff for tea when we wanted. The bed was very comfortable and everything was very clean. The bathroom was also a bit small, but in Europe, hotel rooms are always small. There was a full shower, and the counter wasn't huge, but all in all I have no complaints at all. Location: Simply excellent. Just minutes away from Main Termini, just like advertised, and also very close to Piazza de Republique (where there is also a metro on the red line). It's also very close to Via Nationale, which is a large street in Rome that has a lot of shopping and eateries. Walking in the area was great and it was easy to get on a bus or the metro whenever we wanted. Misc: We got the rooms for what we think was a great deal so we were very happy. Breakfast was included - they served salami/prosciutto, boiled eggs, various pastries, yogurt, coffee/tea/orange juice, and fresh fruit. Definitely more than enough for a great start to the day. Free wireless internet, and there are also a few computers in the lobby in case you need them. The staff were excellent, ESPECIALLY Litu in the front desk - just superb. We didn't have any problems with noise or anything like that. I would definitely stay here again!", "Date": "August 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Beautiful, modern hotel in great location with excellent service & amenities!”", "Author": "ColleensJourneys", "ReviewID": "UR76188777", "Content": "My stay at Hotel Opera Roma was wonderful! The hotel is brand new and top-quality. The location is great – on a quiet street across from the Teatro Opera – while also close to Termini and Repubblica Metro stations – making it easy to get to major sites and attractions. There are many good restaurants in the neighborhood. And the National Museum of Rome is only a couple blocks away. The rooms and bathrooms are modern and well appointed, spotlessly clean and had lovely amenities. The bed was very comfortable – I slept well! The breakfast was delicious and plentiful with a nice variety of pastries (homemade at their sister hotel, Hotel Sonya, down the street), eggs, yogurts, cold cuts and cheese, as well as tea, juice, excellent coffee, and pleasant service. The hotel has aircon and an elevator. The free Wi-Fi was an added bonus. The double & triple rooms are quite spacious, though the single room I saw was quite small, but still modern with a well-appointed bathroom. I had the pleasure of meeting both Nicoli, the owner, and Francesca, the hotel manager. I appreciated their warm hospitality and helpfulness. The staffs at both hotels – the Opera and Sonya (sister hotels with same owner and some shared staff) – provided outstanding and friendly service. They answered my questions patiently – giving me good directions and tips for sightseeing and restaurants and arranged prompt taxi service to the airport at a fair price. Many thanks to Rezza, Silvia, Litu, Farhed (who makes delicious breakfast pastries and cakes each morning), Joy, the lovely woman serving breakfast at Hotel Opera Roma, and all the other helpful staff. I thank everyone for such a positive experience! I highly recommend this hotel to anyone wanting excellent service and an enjoyable experience in Rome.", "Date": "August 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Winthrop Harbor, Illinois", "Title": "“We'd stay here again!!!!”", "Author": "rakherm", "ReviewID": "UR75455648", "Content": "This is a great place to stay. The hotel is nicely decorated with very modern furniture and the hotel room is very clean. It is not on a noisy street and the balcony is a nice touch. The elevator is rather antiquated and be aware that it does not accommodate 2 or more occupants carrying luggage. Staff is wonderful and very attentive. Breakfast was good and in such a luxurious breakfast room, and loved the coffee! Each cup was made to order.", "Date": "August 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kuala Lumpur", "Title": "“One of the best hotels I have stayed in!!”", "Author": "Vicknesh", "ReviewID": "UR72655259", "Content": "My wife and I stayed here for 3 nights for on our honeymoon (last week). I will say that this has got to be the best hotel I have stayed in for the price we paid. We paid EUR87/night (cash) with breakfast. The room was very spacious (by European standards) and it was very clean. The hotel was centrally located as we could walk to most of the major tourist spots (if you don't mind walking under the summer sun)... The hotel reception staffs (I spoke to the day and evening shift guys) were really nice and friendly. They gave us good directions and tips on what to do in Rome. Good chaps both of them. The 1 improvement I could think of was their breakfast menu. It was not bad but I think they could do a bit better in terms of their selections of pastries. Did I mention that the hotel comes with free wi-fi and you can request for netbook from the reception! :) I appreciated this very much since we were in Rome right after visiting Paris and the hotel in Paris charged us for wi-fi (EUR5 for 1 hour!!!)... In summary: A great hotel. Centrally located. Great staff and service. Spacious and very comfortable rooms/beds. Breakfast menu can be improved. I would definitely recommend this hotel to anyone!!", "Date": "July 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Alberta, Canada", "Title": "“Central location close to Trevi Fountain and Colosseum”", "Author": "Calgary14", "ReviewID": "UR72501952", "Content": "We were pleasantly surprised at the size of the family suite. Three floors including a jaccuzi in the basement. My only issue was that the room has little natural light, but it had a lot of room for 2 adults and 2 teenage boys. The staff were always helpful and pleasant and breakfast adequate. Its a central location: Its 5 minutes to Republica Metro station, 15 mins to Trevi Fountain, 20 mins to Colosseum. From Barberini statiion its 20 mins to the Pantheon.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "North Stonington, Connecticut", "Title": "“HOTEL OPERA ROMA--VERY HAPPY!!”", "Author": "ChazotteJ", "ReviewID": "UR69910165", "Content": "The staff is extremely helpful to travellers with directions, tours and internet service. Mr. Litu and Reza were always willing to help us with our endless questions and they made you feel at home in their hotel. It is a small, modern, clean hotel that is near the Metro, Termini Station, buses, shopping and restaurants. It is on a quiet street across from the Opera house...a little hard to locate at first without obvious signs but that should not detract you from staying here. We thoroughly enjoyed Rome and would recommend this hotel to anyone planning a stay in Rome.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Estupendo-Great!”", "Author": "montse05", "ReviewID": "UR69747846", "Content": "Muy buen unicado, al lado teatro Opera y estaciuon Termini y autobuses Ideal para hacer turismo Staff del hote amabilísima.", "Date": "July 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Fabulous!! Would stay again!!”", "Author": "hdunlap", "ReviewID": "UR69639167", "Content": "The Staff at the Hotel Opera Roma were ALL very kind and helpful throughout our visit and my friend and I very much enjoyed our 2 night stay there! I had read about this hotel in the Rick Steves' book and then read reviews online. This hotel is a great value for Rome. It is walking distance to/from the Termini train station which was convenient and not too difficult to find as it is very close to the Opera Theater. We felt very safe at the hotel (needed key to get into building/and of course rooms) We had free breakfast with cappuccinos and juice in the mornings. We also were given small lap tops with free internet service for our stay. The hotel does have a lift and the rooms were clean, had decent beds,hot showers,telephone,security safe and television. If I travel to Rome again this is where I would stay!", "Date": "July 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Exceeded our expections.”", "Author": "jts115", "ReviewID": "UR69554976", "Content": "Only stayed one night. We had a triple and a double. The triple was amazing! Hotel was very clean and everything was in good working order. I would stay there again.", "Date": "July 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Great location, frendly people.”", "Author": "Chuly26", "ReviewID": "UR68193256", "Content": "Great location, nice helpful people, good breakfast, good bathoroom, air condition, good price.", "Date": "June 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary", "Title": "“Great Hotel”", "Author": "CalgaryHappycamper", "ReviewID": "UR68154566", "Content": "We stayed here the first week of June, 2010. This is a great hotel close to the train station and with walking distance from a number of the major historical sites. The rooms were large and well maintained. A hotel like this one helped make our trip very enjoyable.", "Date": "June 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kelowna, Canada", "Title": "“Above and beyond the majority of Rome hotels”", "Author": "Tizmania", "ReviewID": "UR68135731", "Content": "Finally, a modern and clean hotel on a quiet street in the heart of Rome! I sifted through so many expensive Roman dumps, that the Opera was quite a find. A 8 minute walk from Termini station, tucked in behind Piazza Republica - on a whisper quiet street behind the Opera Centre. The entrance of the hotel is not obvious, but once buzzed in, the experience is great. Clean, and very modern - with luxurious room appointments. The rate was good, when paying by cash - and the service and breakfast were also very good. Their pastries especially were great! My only recommendation to the hotel is to get proper desk chairs for your internet stations. The ones you have are far from comfortable. A very minor blip, in an otherwise stellar stay. Thank you Hotel Opera!", "Date": "June 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Austin", "Title": "“Best night of sleep”", "Author": "DSAustin", "ReviewID": "UR68082813", "Content": "Hotel was new and nice. Staff was friendly. Beds were amazing and the best night of sleep on our trip. A little on the high price, but again it's Rome! Great location near Termini makes it easy to get to the trains.", "Date": "June 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Palm Beach, Florida", "Title": "“Great Location, friendly staff, very clean”", "Author": "BeoneHere", "ReviewID": "UR67399403", "Content": "I liked the location, we were able to walk everywhere The staff was very friendly and helpful THe room was clean and i liked the 110v option in the bathroom because I forgot my converter. I would definitely stay here again", "Date": "June 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Halifax, Canada", "Title": "“A great boutique hotel in the heart of the old city”", "Author": "Halifaxduo", "ReviewID": "UR67290005", "Content": "We chose the Hotel Opera Roma for the 7day Rome leg of our trip to Italy based on the positive reviews here on TA. Thanks to all who took the time to share their impressions. The hotel did not disappoint. It is a small boutique hotel on a quiet one-way street in the heart of the old city. The Teatro Opera is just across the street. For some reason Taxi drivers had diffiiculty finding this hotel, so we began asking them to take us to the Teatro, instead. The location is hard to beat. It is just a half-block to the bustling shopping and transportion routes of Via Nazionale. There is a Metro station nearby and several good restaurants in the neighbourhood. Many of the well known tourist sites are within walking distance. We tended to walk to the sites, stopping at cafes alomg the way, and then take a taxi, bus or Metro back at the end of the day. The hotel has a small but comfortable lounge, a nicely appointed breakfast room and 10 newly renovated hotel rooms, We booked a King bed room with a balcony through the hotel's internet site. Upon arrival we got exactly what we had requested. The intelligent design of the room resulted in ample storage space and comfortable movement within the room. The decor gave the room a calm and sophisticated look. The small but modern bathroom included a walk-in shower. The mini-bar was stocked with soda, water and birra at prices less that the street vendors. The lounge included two computers with free access to the internet. Having access to the internet meant that we learned that the departure time for our flight home was changed, which resulted in less waiting time at the airport. The staff at the front desk were friendly and helpful. A special thanks to Mr Litu who not only fixed the safe in our room and the cable connection to the TV but also offered restaurant recommendations, made reservations, and provided us with a bucket of ice cubes at the end of each afternoon. The breakfast room had a pleasant atmosphere. The breakfast buffet had a good selection of brioche, croissants, potatoe onion pie, fruit, cheese and pasteries. Your choice of coffee or chocalata caulda is delivered to the table with a pitcher of orange juice. The waitress was efficient but not particularly friendly. At first, we thought she was having a bad day but her demeanor did not change during the week, A couple of cautions. We noticed that there is another hotel called the Opera Hotel not far away. Be careful when booking to make sure you are at the Hotel Opera Roma. The hotel is owned by the same people who own the Sonya Hotel which is just down the street.. It can be confusing for new arrivals. At the entrance there is a brass plate sign with the Sonya Hotel name and a smaller brass sign with the Hotel Opera Roma name. The breakfast room has the Sonya name on it and the brochures at reception and in the rooms are for the Sonya Hotel. It is as if the owners have not yet decided whether to market the Hotel Opera Roma as a separate hotel, or as an annex of the Sonya Hotel. We recommend that the owners feature the unique qualities of this great liitle hotel, rather than blurring its identity with the Sonya.", "Date": "June 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Denver, Colorado", "Title": "“Skippable”", "Author": "Mahjarunner", "ReviewID": "UR67099879", "Content": "We stayed in this hotel from June 2 through June 5, 2010 (4 nights). We originally were assigned to room 106, which was terrible. The bathtub leaked all over the floor, the air conditioner made a gushing sound (what the fluid rattling around up there was is anyone's guess), the street noise overnight was unbearable, and there was some sort of compressor that made a terrible noise from 8am until 9am, but was then shut off. For the first time ever in many years of travelling in Europe, I requested a room change, and it was immediately granted. We asked for a move to an upper floor facing away from the street, and they took care of moving us while we went out and saw the sights, which was nice. They didn't seem too concerned about the reasons why we wanted to move though, and over the next 4 days, I heard 3 other people request room changes that also went unquestioned. This leads me to believe they were either putting people back in room 106, or they get a lot of complaints. That said, we were totally fine with our new room which was 214. It was very quiet, smaller, had fewer amenities, and no view. We paid 170 euros per night and they didn't discount that despite moving us to a smaller room and having such a bad experience with the first night, which I thought was a little tacky on their part. I also don't see how this is a 3 star hotel. The guys at the front desk were foreigners, but honestly, they were some of the nicest people in Rome. The only exception was the Italian woman who staffed the breakfast area on weekdays (with black hair). The Italian woman with blond hair who staffed the breakfast area on Saturday was wonderful. PROS: -convenient location -comfortable, if small (okay tiny), beds -internet access by computers provided in the lobby -friendly people at the front desk -good breakfast spread including a variety of breads, yogurt, cheeses, sliced cold cuts, cereals, orange juice, and fresh coffee / cappucino drinks -air conditioning -secure lobby and access to rooms by card key -balconies in some rooms that face the street -furnishings in good condition, including flat screen tvs mounted on the wall CONS: -hostile woman overseeing the breakfast area (really, I've never experienced someone who so clearly hated her job, all of the patrons, and never smiled once in 3 days) -they kept the same breakfast goods out until they were gone. For example, several of the pastries that were new when we started out on Tuesday were on their last helpings by the time we checked out on Saturday. We counted squares just to make sure we weren't misjudging this, and also you could tell because they got progressively staler. -tiny bathrooms (and I mean tiny compared to other Italian bathrooms which are already small to begin with) -lots of street noise -nothing special, its like staying at a Best Western - just basic", "Date": "June 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Navarre, Florida", "Title": "“Lovely, small hotel with fantastic location and staff”", "Author": "gagirl7143", "ReviewID": "UR66926926", "Content": "Booked Hotel Sonya and upon arrival we were told that we were moved 1/2 a block away to Hotel Opera Roma since we were staying 6 days and it was their newly remodeled site. After inspection, we gladly accepted the change. Hotel Opera Roma is a small boutique hotel and charming. It is located ideally for walking to all interest points in Rome.It has a bus stop is 1/2 block away, is a 5 min. walk to the train station, and has many good restaurants within easy walking distance. Rooms are very well appointed, clean and the bath was very large. Breakfast was ample and the dining room bright and welcoming. The staff is cheerful, very helpful and always willing to make your stay pleasant. Letu and the other staff were like old friends by the time we left. We are returning to Rome in Oct. and booked this hotel before we checked out. An added bonus was the notebook pc that was furnished free for the asking. The photos on line are representative of the hotel currently.", "Date": "June 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bellaire, Ohio", "Title": "“Enjoyable stay due to very helpful staff, very clean, good location.”", "Author": "linda50072", "ReviewID": "UR66071010", "Content": "The hotel is very small but very comfortable, rather hidden location, nice bathroom with great shower and water pressure. The breakfast buffet was good. Location is convenient to metro. Staff was most helpful in giving directions, and also arranged transportation from the airport and to the port for our cruise. Would stay there again.", "Date": "June 1, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Capitola, California", "Title": "“Great hotel, wonderful location”", "Author": "Stefeire", "ReviewID": "UR65609925", "Content": "We stayed there for one night when we had to change our plans and fly into Rome because of the Volcano. It is a short cab ride, or moderate walk from Termini station, if you take the Metro line there is a stop actually 1 block from the hotel, which we found out later. The pics on here and Venere.com don't do it justice, its much nicer and in better condition. The breakfast was good, better than other places we stayed, with cereal, granola, yogurt, eggs, pastries, and cappuccino made to order. The room had plenty of space for the two of us, even had a little balcony onto the quite street (quiet for Rome that is). The location was great, as I said there is a Metro station close by, Trevi Fountain was an easy walk, and the Colosseum was maybe 10 min away on foot. All in all, a great place to have as home base. We wanted to stay there again when we decided to go back to Rome, but the weekend rates were out of our range. Will definitely try to book it when I go back to Rome, because I AM going back to Rome!!", "Date": "May 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ohio", "Title": "“Nice surprise”", "Author": "rjvanden", "ReviewID": "UR64989971", "Content": "For our first three nights of our trip to Italy, we stayed at Hotel Opera Roma, and it was a great surprise. We've stayed in \"small rooms\" in NYC before so we had braced ourselves for a bed surrounded by walls...but it was a little roomier than we'd expected. The place was very clean, and the staff was very helpful, especially since our Italian is terrible. Props to Sylvia at the desk who was incredibly helpful and very nice. Even though we couldn't check in right away because we arrived early there was no issue while our luggage waited there for us. Great stay. Wireless network doesn't penetrate building very well, but it did work well in the lobby area. Location was great for us, not that far from the major downtown areas like Campo de Fiori and Piazza Novone (not sure I spelled that right). We are big walkers... and it only took 20 minutes or so to walk down there. And with the republicca metro station right around the corner the trip to the vatican was very short.", "Date": "May 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Seattle", "Title": "“Very good value, helpful staff and good location near Termini Station”", "Author": "kitty206", "ReviewID": "UR62550489", "Content": "My husband and I had a nice stay at the Hotel Opera Roma. We were originally supposed to stay at its sister hotel Hotel Sonya, but they directed us here. We weren't sure what to think first, but Hotel Opera Roma was just 1/2 block down opposite (manager nicely walked us over), and it turned out to be a pleasant stay, overall. The general location is a little hard to find the first time--really pay attention to the directions on the website, and bring with you a detailed map. After a day or two, we didn't have any problems, but I wouldn't criticize anyone that decided to take a quick taxi ride (e.g. from the train station) to locate it the first time (Rome streets are so confusing!). The rooms are newer and more modernized. The staff was really nice and the manager went our of her way to help us print out museum tickets that we were having problems with. They honored coupons that we had printed from the Hotel Sonya website. We got two free tickets to one of the Hop-On, Hop-Off buses in Rome, which totally saved our feet the last day touring around Rome. We also paid in cash to get a discount. As Americans, this seemed odd, but apparently this wasn't out of the norm in Rome. They did take a credit card number when we checked-in, just in case. The hotel pricing was competitive with other hotels in the area, and for what we got, we think Hotel Opera Roma was a really good value. PLUSES: relatively large, modernized rooms and bathrooms; location is walking distance to Termini Train Station; free Wi-Fi and 2 computers downstairs in the lobby; mini laptop and memory card adapter available to borrow; satellite TV in multiple languages; friendly and helpful staff; available breakfast buffet, with fresh-squeezed juice and good coffee; has an elevator (but it's small and comes to a heart-jerking stop); very clean. MINUSES: location hard to find the first time, our room had a window but lighting was dim; bed was a little hard (but this seemed to be the norm around Europe); weird placement of fixtures in the bathroom, the toilet was only inches to the front of the sink.", "Date": "April 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lisbon", "Title": "“Inside the opera house”", "Author": "CAOS_Traveller", "ReviewID": "UR61230087", "Content": "The purpose of my trip to Rome was to go to the opera - Norma - in the Opera Theater. This hotel is right at the door, and it was very useful to be there to pick up the tickets one hour in advance and also to be ready on time, without stress. The hotel is not in the center of those busy streets, which turned out to be very good because it is very very silent at night, and just a few minutes from those popular neighborhoods. I also got a nice and new room, with everything that is needed. I recommend.", "Date": "April 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Oxford, UK", "Title": "“Good value hotel, close to rail station with key sights in walking distance”", "Author": "WorldTravellerTony", "ReviewID": "UR61224981", "Content": "Rome is very, very expensive so finding a value for money hotel is difficult. If you want somewhere that is clean, tidy, with helpful staff then this hotel is a good compromise. The room we had was pretty small with no outside window, but to be honest we weren't on our honeymoon, so spent most time sightseeing! Free sat TV, free notebook & breakfast not bad either.", "Date": "April 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "lausanne", "Title": "“Very good hotel, clean and near Roma termini”", "Author": "Voyageuse15", "ReviewID": "UR61197799", "Content": "The service was very good, very kind personal, Breakfast also good, The room was little but i think its normal in Roma 5min to the train station Roma termini, in the center. The entrance it a little bit difficult to find. I recommended this hotel to friend", "Date": "April 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Finland", "Title": "“Nice little hotel”", "Author": "Lena_Pel", "ReviewID": "UR60901415", "Content": "We really enjoyed our stay here! Nice rooms, clean, good sized. Friendly and courteous staff. Free internet . Nice breakfast. Quiet street, short walk to Termini Station. Close to shopping and very well situated to see the sights of the historic centre.We highly recommend this hotel, if we are ever in Rome again we would stay here again.", "Date": "April 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Wonderful Hotel, Great Service, Great Location”", "Author": "SusanRah", "ReviewID": "UR59765065", "Content": "We had booked the sister hotel the Sonya. The Opera is just down the street. I believe the same staff serves both. The staff is very friendly and helpful. The Opera is newly renovated and lovely. Our room was beautiful-small but it functioned well and was well equipped with everything we could want. The breakfast room was lovely and they had a very nice breakfast. The location is great. We walked everywhere. There is free internet in the rooms and two computers in the reception areas guests can use. There is a lift. We were very pleased. We had awful weather in Rome. This was a great place to come home to each day.", "Date": "March 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "travelpam18", "Title": "“Good room, warm and helpful reception from the staff.”", "Author": "travelpam18", "ReviewID": "UR59506918", "Content": "My daughter and I really enjoyed our stay with Hotel Opera Roma. All the staff were so helpful and friendly. They were there to serve our every need. They arranged the transfers to and from the airport for a very reasonable cost and even opened the breakfast area early for us on two monrings to help us out. The location is very convenient to the train station and not too far to walk to the sites in ancient Rome. We enjoyed getting the exercise walking to most of the tourist attractions. The rooms are small, but clean and well cared for. My only complaints would be that the beds and pillows are pretty hard, and the outside street noise is considerable. We used earplugs, so we got a decent nights sleep. They have free internet in the lobby, but it is extremely slow and the keyboards need to be replaced. We would recommend this hotel to others who want to be near the train station. Great service goes a long way toward a relaxing and hassle-free stay.", "Date": "March 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kedainiai", "Title": "“It was excellent leisure in Eternal City”", "Author": "KeliautojasKedainiai", "ReviewID": "UR59156226", "Content": "This hotel is cosy, quiet, clean, with very good location (almost all main sites to visit are situated about 1-1,5 km away), friendly staff, tasteful breakfast. Before trip we decided to choose hotel by reviews of the visitors. And we were 100 % right. I would like to recommend this hotel for every visitor of Rome.", "Date": "March 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "North Carolina", "Title": "“This was a great place to stay in Rome.”", "Author": "Buster_Boy2010", "ReviewID": "UR59152440", "Content": "I would definately stay here again. The room and bathroom were very clean and the bed was very comfortable. We stayed in a standard double room. It was a good sized room. Reza was very helpful and attended to our needs. The breakfast was more than enough to keep one going. It included boiled eggs, ham, cheese, pastires, breads, juice, and the cappucino was he best! The hotel has free internet access. It is also in a good location not very far from the Metro stop. There is also an elevator for those who aren't able to do steps after a long day of walking.", "Date": "March 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Buerstadt", "Title": "“Even the coffee ist smashing”", "Author": "Brocante", "ReviewID": "UR58811088", "Content": "It was a great idea to stay at the „Opera Roma“ when we came to Rome in February 2010. The staff was so helpful and kind, the breakfast was brilliant. We are looking forward to coming back as soon as possible.", "Date": "March 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tewkesbury", "Title": "“Top Hotel in Central Rome”", "Author": "Maz-Daz", "ReviewID": "UR58657961", "Content": "Great hotel (bed and breakfast) located centrally and in walking distance of all main attractions and Central Termini Underground Station. Staff extremely friendly and helpful. Room good size and very clean with all the amenities you would need. Room well decorated - mostly marble, very elegant. Also the room had air conditioning, so would be great for the summer. Excellent value for the money paid. We stayed 4 nights and it was worth every penny.", "Date": "March 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "skiathos", "Title": "“exellent”", "Author": "plateia", "ReviewID": "UR58634523", "Content": "very nice hotel.Exellent service,very good breakfast.The rooms are very clean.we rent the suite they have and it was in logic price.Was big enough clean ,with jaccusi.Everything was perfect.We recommet it.", "Date": "March 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "norfolk", "Title": "“wonderfull hotel opera roma”", "Author": "griggs1964", "ReviewID": "UR57847797", "Content": "we were upgraided from hotel sonya. very pleased. we had a fantastic room with a jaccuzi, t and coffee facilities. the hotel is up a quiet street and near all amenities ie bus, trains and tourist attractions. the staff were friendly and helpfull. not a hot breakfast. only basic.", "Date": "March 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Haifa", "Title": "“wonderful stay”", "Author": "Kathie99", "ReviewID": "UR57533031", "Content": "We stayed in Hotel Opera Roma for 4 nights with a couple of our freinds. We enjoyed our stay there: the otel is centrally located, we could visit all of the attractive places in old Rome by walking. the hotel and the rooms were very clean and newly renovated. The staff were very helpful and freindly. We got a free off charge access to internet and laptop. Its only minus was the size of the rooms; small.", "Date": "March 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canada", "Title": "“We thoroughly enjoyed our stay at Hotel Opera Roma”", "Author": "lovetotravel221", "ReviewID": "UR57485984", "Content": "We highly recommend this hotel. It is easy to find and is within walking distance (with luggage) from the Termini train station. We did alot of walking, which is the best way to see Rome and this hotel is within walking distance to the Colosseum and the Trevi Fountain along with many other attractions. We were very fortunate to have our room upgraded to the multi-level room you see on the web site. It was lovely and we highly recommend this room. The breakfast included with the reservation is excellent, with lots of wonderful pastries along with fruit, yogurt, eggs and beverages. The hotel staff was very helpful in arranging our double decker bus tour of Rome as well as booking our transfer back to the airport. Prior to confirming our reservation with the hotel, we exchanged many emails and the staff answered all of our questions quickly and thoroughly. They were very helpful and friendly to deal with. We definitely recommend this hotel for your stay in Rome and we will stay at the Hotel Opera Roma when we return to Rome in the future.", "Date": "March 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Moscow", "Title": "“Absolutely great!”", "Author": "Netochka", "ReviewID": "UR55946898", "Content": "The hotel has very good location - it's not far from all of the main sightseeing places and it stands quiet at the same time! Staff is very friendly and helpful :) We really enjoyed the room which look more like small apartment!", "Date": "February 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Norway", "Title": "“Small, nice and and clean hotel with a friendly staff made it pleasant”", "Author": "zappa5", "ReviewID": "UR54996702", "Content": "Our room was nice and clean with a small terrace, maybe a bit small (but not any big problem) and a little cold on the floor with the tiles. Good and quiet location in the historical Rome. Very friendly staff. We had a pleasant stay at the hotel and would say good value for the money.", "Date": "February 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Ireland", "Title": "“Nice Location, lovely staff and clean”", "Author": "irishgirlrome", "ReviewID": "UR54320000", "Content": "We were supposed to be staying in Hotel Sonya but when were arrived there we were sent to their sister hotel - Hotel Opera which was just across the road. Check in wasn't till 2 but we were there at about 1.30 and given our room. We were upgraded to a suite. There were 2 and a half floors in the suite, the bathroom was downstairs and was huge and included a Jacuzzi. There was a good choice of food at breakfast. The staff at reception were very nice and helpful. The hotel is very central it was only about 3 mins to a metro station. There were plenty of nice restaurants around the area also.", "Date": "January 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Myconos", "Title": "“Small Friendly Hotel”", "Author": "NCLTFK", "ReviewID": "UR53692844", "Content": "We booked on line after reading some good reviews. Convenient location, most friendly staff, well-appointed accommodation but poor breakfast which we did not mind since a couple of blocks away there's CASTRONI best place to start your day. Free wifi internet access higly appreciated.", "Date": "January 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Israel", "Title": "“Excellent place & staff”", "Author": "zvigold", "ReviewID": "UR53673703", "Content": "Liked my stay at the hotel. liked the room and hotel Cleanliness. the location is very good. breakfast need a bit more variety.", "Date": "January 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "São Paulo", "Title": "“A cozy, welcoming, and nice hotel.”", "Author": "Solaris78", "ReviewID": "UR53120013", "Content": "The staff of the hotel were extremely nice to us and we had a very comfortable stay in your hotel. Thank you very much and we´ll recomend to all people we know that are possibly going to Rome. Thank you very muchand our best regards to you!", "Date": "January 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dublin", "Title": "“Excellent value for money”", "Author": "DublinTemple", "ReviewID": "UR53110527", "Content": "Stayed at Opera Roma (new hotel). Location is excellent to most of the major sights. Room really clean and nice size. Bathroom really spacxious. Breakfast also very good and plenty to choose from. Staff very nice . Would definately return and would recommend to others. Had a really nice stay at the hotel and value for money was excellent.", "Date": "January 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Excellent service, clean, modern rooms, good location - excellent hotel”", "Author": "NCNUK", "ReviewID": "UR52977896", "Content": "Hotel Opera Roma is staffed by friendly, knowledgeable, and helpful people. The hotel has an historic feel, but is fully refurbished, comfortable and very clean. If wanting to stay in the vicinity of the train station and its relative proximity to sites in the city, this hotel cannot be beat for quality, comfort and value. My fiancée and I really enjoyed our stay. You will too.", "Date": "January 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Philadelphia, PA", "Title": "“Disappointed with Suite”", "Author": "ChristineKathleen", "ReviewID": "UR52478426", "Content": "The hotel staff recommended we book their suite b/c we were traveling on our honeymoon. It featured a nice jacuzzi and large room. It was almost twice the amount of the regular room but we splurged because it was our honeymoon. When we arrived at the hotel we were not greeted warmly, we were asked for our passports and shown our room. The jacuzzi did not work-it was empty b/c they were having problems. This was disappointing but we understood. The next day we were glad to see it filled but the water was cold. We inquired about the temperature and we were promised an answer in the morning but we never received one. This happened every night of our four night stay. We were finally told there was no way to make the water warmer, so we were unable to use the jacuzzi the entire time. We are still unsure about whether this reflects a difference in the way we expect a jacuzzi or if there was just something wrong with it. We expected a jacuzzi with hot water and jets, while the water was cold/room temperature with jets. At check out we brought up the issue again. We were given a slight discount after we uncomfortably pressed the issue. No one ever took responsibility for the jacuzzi issue and we constantly felt as if we were bothering them about it. Had we booked the original room we probably would have tons of positive things to say about this hotel because it was clean, the breakfast was nice, and the location was great. The evening staff was mostly nice, especially the woman. I might recommend this hotel for the regular room, but I would probably not stay there again. The main suite was not worth the extra money and the discount they gave us did not reflect the difference.", "Date": "January 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "thessaloniki", "Title": "“A NICE AND SWEET PLACE TO STAY”", "Author": "sprodanas", "ReviewID": "UR51953028", "Content": "we've been at Opera Roma for Xmas holidays with my wife and another couple. It's a little very nice hotel to stay. the location ia very strategic, the staff is very friendly aand the rooms are very clean.I recommend it to everybody because you get much more than what you pay for......The breakfast room maybe is small for someone , but not for me.There is no lobby but there are many bars arround....", "Date": "December 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Singapore", "Title": "“A Wonderful Stay For Our Holiday In Rome”", "Author": "Lancelyaite", "ReviewID": "UR51581117", "Content": "My wife and I had definitely enjoyed our stay at this hotel. Although the room was a little small, it had the necessary amenities we need and was clean and comfortable. The staff were very professional and friendly. The location of the hotel was good as well with food, shopping and transportation facilities within walking distance. The coffee and cakes at breakfast were wonderful too.", "Date": "December 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Alba Iulia", "Title": "“If we'll visit Rome once more we'll stay at the same hotel, for sure.”", "Author": "KRISTIK76", "ReviewID": "UR51567471", "Content": "The most important thing was the good location of the hotel: not far away from Termini station and historical center of Rome. The price for a double room in that location was very good. The services provided was above all our expectations (according to a 3 stars hotel classification): very clean and quiet room with fresh towels every morning, good breakfast, usefull and kind staff etc. Because our return flight was delayed one day and there was no double room available, we received an unforgettable offer for the suite room for the last night.", "Date": "December 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Szczecin", "Title": "“Perfect stay.”", "Author": "an_an2_2", "ReviewID": "UR51292361", "Content": "I my stay in Rome was perfect as to describe it in one sentence. Season was perfect because it was not to hot and not to cold. And stay at Hotel Opera was perfect as well. There are many advantages of this hotel. Two most important for me was excellent localization and cleaness of the room and restaurant. Hotel is situated near the termini station from which everyone can get to every place in rome. It is also situated near many shops, cafeea and restaurants. About the cleaning every day we had new towels, soap and shampoo. Room was small however it was furnished in modern style and it had all the thing that we needed during our trip. Staff was perfect as well. Everyone spoke english and we had no problems to comunicate and get needed information. Breakfast was also one of this many advantages of hotel Opera. To sum up I honestly recomend Hotel Opera Roma for people in every age as it is the perfect place to rest after long day of sightseing The eternal city.", "Date": "December 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Hong Kong", "Title": "“Unexpected stay in Roma”", "Author": "SSGTJW", "ReviewID": "UR51036948", "Content": "First, we were not booked this hotel while we were staying in Roma. Upon our arrival at Sonya Hotel, Roma, where the reception persuaded us to stay their group hotel (Hotel Opera Roma). Owing to our booking a triple room, I knew there was no room for triple in this hotel. This hotel only has Twin/Double rooms. An extra bed would be set up for three. We refused it. Afterward, we had an argument with the reception of Sonya Hotel. To avoid our unpleasant, we moved to this hotel with the assistance of Mr. Litu (staff of Hotel Opera Roma). To be honest, this hotel’s room is not suitable for triple. It is a little bit of tiny and we could not open our suitcase on the floor. On the next morning, Mr. Reza (staff) approached us when we were taking our breakfast. As he knew our unpleasant, he told us a bigger room would be arranged for change. After breakfast, he showed me a suite. To my surprise, it was a great offer which we unexpected. No additional charge would be added. After we did sights in town, our luggage has been already moved in the suite. The Opera Roma offers a high level of comfort and privacy. The imposing classical facade, the finely furnished, modern accommodation make for a truly elegant atmosphere. The suite boast a spacious Jacuzzi. The interior of the hotel is wonderful, the rooms were probably the best we stayed in whilst in Italy. Spacious, clean, very nicely decorated and comfortable. Start our mornings on a rich buffet breakfast comprising savory foods and homemade cakes and pastries, and indulge in free coffee or tea directly in our room. It's just a 10 minute walk from the train station and tube station which is really convenient for train/tube connections. Although the area is not the best as it's close to the train station, we felt quite safe. Staff were very welcoming and courteous, especially, Mr. LITU and REZA. I'd recommend staying here and would stay again!", "Date": "December 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Phoenix, AZ", "Title": "“First Class-Modern and Clean”", "Author": "Lance881Phoenix_AZ", "ReviewID": "UR50317635", "Content": "I can't say enough good things about this hotel. It is a relatively short walk from the train station and one block from Via Nazionale with numerous restaurants and shopping opportunities. The staff could not be more friendly and helpful. The room was clean and cheerful with good lighting. It has obviously been recently been refurbished with new paint, new modern furniture, comfortable bed, a coffee/tea maker, free internet access, a lovely new and bright bathroom, a safe, a nice closet, etc, etc, etc. The breakfast was in a bright, cheery room, nice table cloths and dishes, a large selection of breakfast items and very good coffee and juice. Again the staff was so pleasant. All in all wish we could have stayed here longer, but our cruise ship awaits. Don't hesitate to book here for either a short or extended stay. You won't be disappointed.", "Date": "November 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Bangkok", "Title": "“Very Nice Service Hotel”", "Author": "17always", "ReviewID": "UR50097579", "Content": "The men at front are very nice and kind. Both Mr.Litu & Mr. Reza gave us a very very warm welcome & great service. The room is Beautiful but a little bit small. Anyway it's new & clean. Overall we're very happy, especially with the guys who we mention about. If we have next trip to visit Roma again, we'll choose this hotel. Thanks for your good service Mr.Litu & Mr. Reza. Hope to see both of you again. Please take care.", "Date": "November 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "tweed heads", "Title": "“Great place & they went out of there way to please you!”", "Author": "TweedHeadsMonica", "ReviewID": "UR50091269", "Content": "We stayed at Hotel Opera roma for 3 days in November 09. Staff we very pleasing and went out of there way to help. Room were nice. First room they gave us was small but very nice and then they offered us a larger room which was big. Breakfast was one of the best we've had in Italy, very nice and plentiful and coffee fantastic. Great price and would recommend this hotel to anyone. Monica", "Date": "November 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Amberg", "Title": "“I would visit the hotel next time again.”", "Author": "Romy1109", "ReviewID": "UR49167447", "Content": "A cute hotel near Rome Station Termini. Very quiet location. The service staff was very courteous.", "Date": "November 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Washington", "Title": "“Very hospitable and friendly place”", "Author": "TaylorFamWashington", "ReviewID": "UR48712093", "Content": "The hotel was very well located and we felt safe to walk out at night. The breakfasts were excellent, especially the homemade cakes and lovely coffee. The internet facilities were also great. We would highly recommend this hotel to travelers. Thank you for making our stay great. We loved our stay in Rome.", "Date": "November 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Toronto", "Title": "“Awesome location and excellent service”", "Author": "brightcrystal", "ReviewID": "UR48667816", "Content": "Hy husband and I stayed at Hotel Opera Roma for 6 wonderful days. The staff was always helpful and, in fact, went above and beyond our expectations to meet our every need and request. The breakfast was good particularly the capuccino. The location was great - close proximity to all the great sights of Rome. Close to the Metro, which we used daily. We would highly recommend this hotel to our family and friends.", "Date": "November 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Hilton Head, SC", "Title": "“Tiny Rooms”", "Author": "SCRedOne", "ReviewID": "UR48644247", "Content": "We stayed at Hotel Opera Roma for two nights prior to boarding a cruise. The location was very convenient. Staff was helpful and provided good directions and transportation info. Breakfast was very nice. Our TV never worked properly despite a valient try by the front desk personnel. My main complaint with this hotel was the size of our room. I paid approximately $250 US per night and got the smallest room I've ever had in a major European city. You could bearly get around the bed. There was no comfortable chair to sit on(mainly because one couldn't fit. The bathroom was so small that if you were sitting on the WC, you could easily hit your head on the sink. I believe the room # was 204.", "Date": "November 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Leiden", "Title": "“Your service is such that it distinguishes an excellent hotel from an average one”", "Author": "reismutsje", "ReviewID": "UR48307788", "Content": "My friends and I (6 in all) spent a long weekend in Rome. We were very pleasantly surprised by the location of the hotel Opera Roma but especially by the extremely good and personal service of the staff. All that made our trip very memorable. I forgot part of my luggage, which was sent on promptly, which impressed me even more. I will recommend hotel Opera Roma to anyone going to Rome.", "Date": "November 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Location, Quality and Service all in one”", "Author": "TravelBySelf", "ReviewID": "UR48009870", "Content": "We stayed in a triple room for 1 night in October 2009. This hotel is just within 10-minute walk to the Termini Station in Rome, half a block to the shopping area at Via Nazionale. Location is great. The room has cometmporary furnitures, with two reading lights by the side of the bed. The closet is automatically lit up once you open the door. Water is hot and with good pressure. The bathroom is decorated with marbles. Breakfast is of good value, fresh made coffee, boiled brown eggs, pastries, cakes, yogurt, bread, juices and fresh fruits. The receptionist and staff all very ethusiastic to help. We arrived at 12:30 pm and they allowed us to check in early. Breakfast normally serves at 7:30 am. Since we need to leave early to catch the plane, they accomodated our special request to have breakfast ready half an hour earlier. We really appreciated it. Moreover, they have free internet access in the room. If you don't have a computer, they can provide you a lap top. All in all, I recommend anyone to stay at this hotel because of the convenience in location, service, quality and value. I will definitely go back and stay at this hotel again.", "Date": "October 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Lafayetty, La.", "Title": "“One of the best places we stayed in Italy!”", "Author": "dandy02", "ReviewID": "UR47909985", "Content": "The staff was very helpful and very pleasant. We had a computer to use in our room free. The room was very quiet (no street noise) The beds were comfortable. The bathroom was exceptional. It was very large and had a whirlpool tub with a shower! The coffee served in the morning was some of the best we had while in Rome. The neighborhood had easy access to the train station as well as the subway. We walked everywhere while in Rome. When we traveled by train from Rome to Sorrento and back to Rome from Florence this made walking from the train station very easy. When I go back to Rome I will definitely stay here again. We stayed at the Hotel Sonya on the first leg of our trip, and at the Hotel Opera Roma on our way back. Even though I enjoyed them both, I prefer the Hotel Sonya, because it was a smaller hotel.", "Date": "October 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Yeovil, United Kingdom", "Title": "“This Hotel is in an Excellent Position for all the sights!!!”", "Author": "Loo57", "ReviewID": "UR47897212", "Content": "We were booked into Hotel Sonya but due to over bookings were given a room in the Hotel Opera Roma( Sister hotel). The hotel rooms were comfortable and very clean, but lacked information regarding the services available ie how to obtain internal phone lines, mini bar price list etc ( minor irritation).The staff were friendly and very helpful. The breakfast was excellent both in choice and quality.The hotel is in a perfect position for most of the famous sites especially the Spanish Steps and Trevi Fountain. There are many places to eat locally which offer value for money. I would certainly stay here again and would reccomend to others.", "Date": "October 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "mftravels", "Title": "“A great value hotel based on clean spacious rooms located near transportation and cultural sites.”", "Author": "mftravels", "ReviewID": "UR47894913", "Content": "The hotel is located approximately 5 city blocks from the train station so it was an easy walk. The hotel is on a side street next to the Opera House making it quiet and secure. We were pleased with the room. It was spacious with a full bath that was very clean and with all the amenities for a woman. The breakfast that came with the room was sparse, but adequate. The staff was courteous and helpful. In fact, they were able to give us our room on the first day prior to noon which was unexpected. The metro stop was only 2 blocks from the hotel which we used (1 euro each way) to get to and from the Vatican. We were able to walk to all the other cultural sites we visited. We would definitely return to this hotel on a return visit to Rome.", "Date": "October 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Was good for a budget hotel”", "Author": "ChiTravelgirl42", "ReviewID": "UR47806077", "Content": "We stayed at Hotel Opera for 3 nights in October. We primarily stayed there because of the price, and it was a decent hotel. Rooms were the smallest we encountered in our 2 weeks of Italy, but clean. The bathroom was also the smallest we encountered, but also clean. It was hard to manuever in the shower without hitting your elbow. The breakfast was ok (cheeses, meats, pastries, hard boiled eggs, made to order cappuchino). Internet was free, which was nice. The location was fine for us, but not ideal. About 6 blocks from the train station, and a 20 minute walk from most of the historic sites.", "Date": "October 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "California", "Title": "“The Hotel the Keeps on Giving”", "Author": "piratkween", "ReviewID": "UR47177693", "Content": "We stayed for 9 nights at this wonderful intimate hotel. The rooms are sparkling clean and very comfortable. The breakfast room is lovely and the coffee is so good. We used the computer often and had so much help from the wonderful staff. Today, a month after our stay we are still using their help. We lost our camera, or it was stolen while we were in Sorrento, after leaving Rome. Today we had a phone call from Sorrento Policia saying they had located our camera. We could not understand most of the phone call but we gathered we were to send them an email with our mailing address. So thrilled! But we could not find the email contqct on the web. Finally out of desperation I wrote to Hotel Opera Roma and within an hour they wrote back to me with the email address! We will never stay anywhere else when in Rome, which is often. We also found the most delightful places to eat withing a 2 block walk of the hotel. I cannot say enough about the wonderful way we were treated. We feel like familia. Bill & Kathleen Mero", "Date": "October 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Shushan, NY", "Title": "“All personnel were wonderful...friendly and helpful”", "Author": "babsShushan", "ReviewID": "UR46752563", "Content": "We spent four and a half months traveling in Europe for our honeymoon and found this hotel to be our favorite(we stayed in a total of 10). The main reason for this was the staff..in particular, the desk clerk, REZA, was very welcoming and helpful. He was willing to help us with reservations, directions, etc. and made us feel like we were valued guests. Breakfast room was also very nice with great breakfast and friendly staff. Would definitely stay here again!", "Date": "October 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Ohio, USA", "Title": "“Aahhh the beds!”", "Author": "JW_Cleveland", "ReviewID": "UR46629237", "Content": "Small hotel on a side street next to the drab opera hall. Nothing to look at from the outside but nicely redecorated inside. The room was clean, in good condition, quiet, and had a small balcony which we actually used. The mattresses were foam and super comfortable after long days of walking. Breakfast was very good, and the desk staff very helpful. I would stay here again.", "Date": "October 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“The front desk service was excellent, and helped make our trip great!”", "Author": "laughinginlondon", "ReviewID": "UR46220663", "Content": "This turned out to be quite a little gem of a hotel, minutes from Termini station, and not much farther to most of the major sites. We came here with a group getting ready to go on a cruise, and the front desk staff could not have been friendlier and more helpful to us - especially when it turned out a couple of us had lost our luggage. The staff not only repeatedly called for us to speak to the local baggage agents in Italian, they also called when we hadn't asked, just trying to get further updates for us each day when we had come back from touring (our bags eventually showed up on our third day, and the staff took them straight up to our room to keep them secure). The rooms were a little small - especially the singles, but the bathrooms were a good size, and ours even had whirlpool jets in the tub. Breakfast was fabulous - lattes, cappucinos, pastries, breads, meats, cereals, yoghurts, etc, and the gal running the breakfast room made sure we always had full coffee or orange juice. The front desk staff were also fabulous with passing on tourist information - we asked about tours, grocery stores, restaurants, train schedules, directions, etc., and with each request the guys went above and beyond to make sure we had what we needed - including a bottle of wine when we'd run out after the wine stores had closed. There is free internet access computers in the lobby, or you could take a hotel laptop to your room if you preferred, at no charge. We even had 2 sodas from our 'mini-bar', and it cost just 4 Euros total for both - that was less than buying one at the carts on the street!! Our room overlooked the front entrance and the side of the Opera House, and we didn't have any trouble with noise - and actually enjoyed the afternoon music rehearsal we could hear on one day. The hotel was charming, centrally located, and the service was absolutely 5 star!!!", "Date": "October 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "AMSTERDAM", "Title": "“Pleasant hotel near centre and Termini station”", "Author": "AdelbertJ", "ReviewID": "UR46067470", "Content": "We enjoyed our five day Rome stay in this nice, little hotel. Located next to the Opera and near Termini (metro) Station, all Rome attractions were easy to reach.", "Date": "October 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "1", "Rooms": "2"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Just Okay - Not a good location - stay somewhere else”", "Author": "Bindikitty", "ReviewID": "UR45988073", "Content": "We spent three nights at Hotel Opera and have mixed reviews. We had reserved and paid in advance for a king size bed / room and on checking in were told it wasn't available until the next night - no explanation or apology. The room we were given was tiny and smelled so strongly of smoke that I barely slept. We moved to a bigger room the next day and it a bit better and cleaner. The location is terrible for sightseeing. It is close to the train station, but once you've arrived by train you don't need to be in that area - you're going to spend a lot of time walking to the sights and if you're squeamish about walking at night in a city, you're going to be very unhappy. We were glad to have a TV but the stations were really limited without switching to pay-per-view, which is mostly porn (as openly advertised in the bedside pamphlet) so we avoided it all together and were a bit grossed out. On the good side, the breakfast was delicious and the bigger rooms had nice places to spread out / unpack. The staff was very nice and gave us a free mini laptop and internet access so we could check on things at home via email. Overall, stay somewhere else - the Hotel Opera oversells itself. You only see pictures of the suite and the regular rooms are not much different than an American Holiday Inn, smoking is allowed in the rooms and the location is really out of the way.", "Date": "October 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Canada", "Title": "“Great staff, great rooms and great location!”", "Author": "j_ho_holla", "ReviewID": "UR45914973", "Content": "This was my friend and I's first time to Rome. When looking for hotels we were so overwhelmed as there are so many to choose from, and Rome is SOOOO vast that its nearly impossible to determine where it is to stay location wise. We chose Hotel Opera Roma (formerly Hotel Sonya) mainly for the price. Rome is incredibly expensive, and we decided to find a basic hotel that was clean and decent location, but try to keep it around $200 canadian a night. Hotel Opera was really the only one that fit our budget and from the pictures looked very clean, there were mixed reviews on location, but for the price, we booked it. When we arrived...the hotel went above and beyond our expecations. The hotel is AMAZING. The rooms are small...but who cares! They're modern looking, spotless, air conditioned, and very comfortable. The bathroom was spotless and the water pressure in the shower worked wonderful. Breakfast was included in the price. You walk into the breakfast room and the first thing you see is a friendly face asking you how you like your coffee. The lobby has two computers, and the hotel gives you free internet access which was such a blessing because we used it to email friends and family back home so we didn't have to use the phone. The staff is undoubtedly the nicest people in ALL of Rome. Honestly, italians are rude. People are mean, and they mostly do not provide service with a smile. But at Hotel Opera...its so refreshing because they are soooooooo nice! If it wasn't for this hotel and our wonderful stay there, my overall trip to Rome would be just mediocre (because like I mentioned before, Italians are quite rude even at restaurants and major sites. Our food experience in most of rome was mediocre, which was so disappointing and everything is expensive!). So thank you to the staff for making my trip to Rome a little more memorable. Before you arrive, make sure you email the hotel and ask for shuttle service from the airport. Its 15 euro one way for each person. You can take the train from the airport to the Termini and walk 10 minutes to the hotel OR from the termini take the metro to the 'Opera theater' stop and walk 3 minutes to the hotel from there for about 11 euro, but if you have lots of luggage...I don't recommend it. Arrange with your hotel a shuttle back to the airport while you're checking in so that you don't have to worry about a ride when you check out. Location wise...this hotel in my opinion is GREAT! It was perfectly situated. Its about a 20 minute walk to the spanish steps, trevi fountain and collseum...but if you don't want to walk, then DON'T. The metro is only like a 2minute walk away, and for 4 euro a day, you can ride all day to where ever you need to go, Vatican, Colleseum, Spanish steps, trevi fountain, Termini Station...it will take you there in minutes. Its so easy to use! We never used a taxi not once our entire stay there. There was absolutely no need. The only time we walked was when we were out after 1am (metro stops running), even then, we didn't find the walk that bad, especially because we the hotel provides a map, which honestly is the best map ever. We never got LOST because of that map. Our first time finding our way around was a little difficult because there are no street signs in Rome! The street names are on the side of buildings which can be hard to make out, but after figuring our way around the first time, you just start to remember the routes, so the next time you walk back, its easy. I liked that our hotel was central enough to be close to the major sites, but its nesteled on a tiny side street so that you're away from the hustle and bustle of the crazy Roman traffic. Me and my best friend are both female and we would be out walking about until 1-2am in the morning, and never felt unsafe. The neighborhood is not shady. That is why i think that is perfectly situated. I've seen hotels by the spanish steps and trevi fountain, and I'm glad that we did not decide to stay there because its way dirtier, shady and full of traffic and people, and the hotels look run down and old. I am very happy with where our hotel was situated. There are restuarants and pubs around the hotel if you want something to eat nearby, but I can't really recommend any of them because I didn't really like the food nor the service at any of the places we tried, so go around and experience yourself, you may have a better experience than me. If you want AMAZING italian food for great prices and friendly service, I highly reccomend taking a day trip into Florence, you won't be sorry. The best italian food of our whole Italy trip! So to sum up....STAY AT HOTEL OPERA! Even if it costs a little more, its worth it for the service and location!", "Date": "October 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Isreal", "Title": "“Great hotel in rome ,clean and modern rooms Good value for your money”", "Author": "noamIL", "ReviewID": "UR45724464", "Content": "stayed at Hotel Opera Roma for 3 nights and realy love it ,within 10-13 minutes from termini station and subway stops ,if you walk from termini station to the hotel the easiest way is to walk to Piazza Repubblica & walk down on Via Nazionale than make left on via Firenze (follow the Hotel Centro sign the building is next to the hotel) . on my arrivel I was given a room on the 5th floor which had a strong cigarette odor after complainnig that I can't stay there I switched to a room on the 1st floor (No 102) which had a bigger bathroom and save me useing the realy small and nerrow elevetor. the rooms are not that big but very clean and have all modern facilities from flat screen tv ,safe ,air condition unit ,mini bar ,hair dryer (with 120v-220v outlet) Free WIFI I even got a complementary asus eee laptop for my entire stay which was a big plus for me . the breakfast is very basic but good to start the mornning. the street of the hotel is very quiet and felt safe all the time however in some rooms you can hear any noise, the stuff is very freindly & speak english and given me a city map and marks all main attractions for me. this is not the chipest hotel if you are on a budget but it's worth every cent ,I will definitely see myself staying there again .", "Date": "October 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "HUNTINGTON BEACH, CA", "Title": "“CLEAN ROOM,COURTEOUS & HELPFUL STAFF, GREAT LOCATION, QUIET STREET.”", "Author": "memorabiliak", "ReviewID": "UR45280684", "Content": "Very enjoyable 3 night stay; staff very helpful in accomodating us. Close to most sights in Rome; easily accessible by walking. Train & subway stations very near also. Breakfast included in rate was very satisfactory. Bathrooms very nice(big clean shower area). Lots to like!!", "Date": "September 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Branson, MO", "Title": "“Good location and great service.”", "Author": "MOfun42", "ReviewID": "UR44986186", "Content": "We like everything about this accomodation and the service was excellent. Just remember when traveling in most European countries - there are no washcloths or bar soap. The rooms in the new part where we stayed were modern and very clean. They also provided a computer with internet service to use in the room at no additional cost. We were within easy walking distance to all the major sites in Rome. We would stay there again.", "Date": "September 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "County Durham, England", "Title": "“Good clean hotel, good location but difficult to find”", "Author": "Vicky2405", "ReviewID": "UR44976993", "Content": "The hotel is situated approximately 10 minutes walk from Stazione Termini (where the bus from the airport terminates). This was my first visit to Rome and I found the hotel difficult to find from the directions given - the hotel is not 'exactly in front of the famous Opera House of Rome' as stated in the hotel literature. It is more like if you are standing looking at the entrance to the Opera House the hotel is located in th street running down the left hand side of the Opera House (look for Hotel Centro sign). However the hotel was in a good location with a selection of restaurants within walking distance and one of the many hop on hop off buses 'bus stop' is about a 5 minute walk from the hotel - it took us approximately 25 minutes to walk to the Colloseum. The hotel staff were very polite, friendly and helpful. The hotel room was very clean with good facilities - (whirlpool) bath/shower, TV, tea/coffee facilities, mini bar and small safe. Breakfast was a selection of cereal, bread, meat, egg, tea/coffee/juice and pastries. I threw my coin in the Trevi Fountain so will hopefully return to Rome one day and I would be more than happy to stay at the Hotel Opera Roma again.", "Date": "September 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Ottawa", "Title": "“Very friendly staff!”", "Author": "SergeOttawa", "ReviewID": "UR43945793", "Content": "The hotel is very close to the main station (Termini) but a little far from some of the attactions. Other than that, it was perfect! Very modern, very friendly staff, super breakfast.", "Date": "September 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Very Good Value”", "Author": "phoenix_fqtv", "ReviewID": "UR42720072", "Content": "I chose this hotel based upon the combination of reviews, location and price. The hotel met my high expectations. Room size is small by American standards but good by Italian standards. Bath is compact but modern. Air conditioning is outstanding and the room very quiet. Extremely helpful and cheerful staff. The free wi-fi (and a free laptop if you need one) is greatly appreciated. Breakfast is very good. I would definitely stay here again (actually I stayed twice, both at the beginning and end of my trip) and would definitly recommend it to a friend looking for this type of accomodation.,", "Date": "September 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Glasgow", "Title": "“Great location - would definately recommend this hotel.”", "Author": "Mcnicki666", "ReviewID": "UR42694878", "Content": "The hotel is a 5 minute walk from the subway, and is just off one of the main streets through Rome. Lots of good value restaurants close by. Within walking distance of lots of sights, and only a 20 minute walk to the Colloseum. Hotel was very clean and staff are very friendly and hellpful. We would definately stay here again.", "Date": "September 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "USA", "Title": "“Best Choice in Italy”", "Author": "Newed", "ReviewID": "UR42470749", "Content": "My husband and I recently stayed here for our honeymoon. We toured 4 cities in Italy and Rome was our first stop. We stayed 6 nights at this hotel and it was the best place we stayed in Italy. Number one, the service was excellent. If we needed advice on where something was located, we received it accurately and with a friendly smile. Everyone who worked there always was very polite and gave us \"service with a smile\". Secondly, the location is great. It is within walking distance of Termini train station and the Republica metro stop. This was great for not only traveling in and out of Rome, but also to and from the attractions around Rome. Also, it has a great location along the main street where my husband and I found many restaurants and places to spend our evenings. Thirdly, the rooms were clean and comfortable and the location was safe. There was someone at the front desk all the time and monitored who came and went. Also, we went in August and it was so hot, but the air conditioning was a blessing. We would recommend this hotel in a heartbeat and will stay there again if/when we return to Rome.", "Date": "September 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "USA", "Title": "“Perfect hotel stay while in Rome”", "Author": "smokeyUsa", "ReviewID": "UR41722877", "Content": "In my opinion, The Hotel Opera Roma provides everything a traveler needs while touring Rome. The location was perfect. The Metro and bus stop were 2 blocks away; the Stazione Termini, where you catch trains in and out of Rome, was maybe 3 or 4 blocks. The hotel and our room was spotless. The hospitality of the staff around the clock was wonderful. Always available and willing to assist with any needs. They also suggested itineraries and made themselves available to arrange any tour bookings, etc., we may have requested. Two computers with internet access are in the lobby area and made available for guests at your leasure. Great services is not always easy to come by these days and The Hotel Opera Roma was a refreshing place to spend some at while vacationing in Rome.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Washington DC", "Title": "“Rick Steve's was right, this place is great!!”", "Author": "HappyRunner1", "ReviewID": "UR41596411", "Content": "We arrived at Hotel Opera Roma on August 4th, 2009, having made reservations for 3 nights. How delighted we were. The immaculate room wasn’t large by US standards, but it wasn’t as small as we’d expected, having stayed in European hotels before. We had room for our 4 LARGE suitcases, with enough room to walk around them to the ample bathroom, w/all the necessities, including a hair dryer. There was plenty of storage, a small fridge, coffee and a small walk-out balcony that just big enough for us to sit out a couple on nights with a glass of vino and watch the world go by. The location was ideal; close to both the National Museum and the Termini Station. The hotel staff couldn’t have been more accommodating. From the offer of a free laptop for our room upon check-in to the cappuccino & hot assorted teas offered each morning with breakfast in the dining room. The breakfast well surpassed our expectations as well as there were delicious pastries, cereals, meats, yogurts, fruits, etc. We were given a friendly greeting each time we returned and were impressed. There were also two computers available for free use in the hotel lobby and we asked many, many questions that were always answered in great detail. We would definitely recommend Hotel Opera Roma to anyone looking for a clean, convenient and reasonable hotel room in Rome with very nice staff!", "Date": "September 14, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Northern California", "Title": "“Our best of Rome”", "Author": "NativeCalif", "ReviewID": "UR41340591", "Content": "After nearly a week in Rome (third time in Italy, first in Rome), I give the Il Cuore di Napoli on Via Cernaia a top recommendation for their excellent food and service. For the price (very reasonable), you can't go wrong with the food. We've eaten there twice and will go again tonight. We've tried several places and even more expensive was not better. While their wine wasn't worth drinking, it wasn't as bad as some places and our palates are used to good California wines. There are some decent wines here and if you want them, you'd better find them yourself in an enoteca or be willing to go to a significantly more expensive restaurant known for their wines. Eye Witness Italy reviews wines for each region and they look reasonable for not specializing in this area. Our hotel, Hotel Sonya and Hotel Opera Roma (their new section half a block away where we are staying) has been tops also. Everything was renovated in this new section and this has been the best bed I've ever had in many trips to Europe. Excellent air conditioning, cleanliness, service, everything you could want including free hotel-wide WiFi. Reasonable when you reserve some months in advance but almost 3 times the price at the last minute due to popularity, 315 euros for a double (not what we are paying!). I would come here again in a minute. Neither the Rome Eye Witness book or the Rick Steve's Rome book we had told us to reserve in advance for the Vatican Museums, but our hotel clerk suggested it (and offered to do it and the Borghese for us), and we found out the hard way that he was right. We've been fortunate in having no problems, although one guy was a bit too 'helpful' when we started to use a train ticket machine for purchase, but having had experience in Italy (Florence) in the past and reading up on all the possible scams in our guidebooks, we have been pretty careful and had no trouble at all. Best source for info on things like how to find out if there will be train or plane strikes while here -- see http://www.slowtrav.com/italy/planning/strikes.htm I've experienced 3 train strikes in 2 previous trips here and it was almost enough to make me not come again. That was before the Internet made info much easier to get. Big difference, along with becoming 'educated'. Come to Italy and enjoy!", "Date": "September 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Italy", "Title": "“Wonderful experience”", "Author": "zambamamba", "ReviewID": "UR41093695", "Content": "The rooms are very clean and they have every comfort. The staff is very friendly and helpful, and the breakfast is fantastic. I belive it is great value to your money. I would racommend it for shorter stays due to the room size. My finace and I thought thast it was the perfect getaway.", "Date": "September 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Norway", "Title": "“Very good hotel if you stay away from room 102”", "Author": "Pippi2", "ReviewID": "UR39772966", "Content": "Our review of this hotel is split in a negative and positive experience. When we checked in for our 3 nights stay, they gave us room 102. This is a room that is smaller than a shoe box. It is not possible to have your suitecase open and at the same time open the door to your room. This room is on the ground floor and have no windows and is next to the breakfast room. The breakfast room is noisy from approx 6:30 hrs and will clearly wake you up even if you are using earplugs (I did). Looking more closely at the reviews at tripadvisor I found a bad rating that was based on room 102. The next morning we made a polite complaint about the noise that woke us up and asked kindly if they could move us to another room. The resepsjonist behaved like he was waiting for our complaint and gave us a much better room on the 2nd floor. Our new room was nice and very quiet, and based on this room the overall rating is very good. We enjoyed the breakfast in the hotel. The location is also perfect as the distance to Termini train station is walkable even with a bit of luggage. The hotel is also very close to the Repubblica metro station. When it comes to the staff I must say that we are a bit disappointed that they gave us room 102 to begin with. For the room rates this hotel charges room 102 is not value for money. A week later we stayed in SuiteDreams currently rated as #1 of the hotels in Rome. This hotel is in the same neighbourhood as Hotel Opera. SuiteDreams was a much more pleasant experience than Hotel Opera.", "Date": "September 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Limassol", "Title": "“An ideal location, close to metro and a 12 min walk from rail station”", "Author": "Sparkey58", "ReviewID": "UR39312873", "Content": "We enjoyed our stay at Hotel Opera Rome very much, we preferred the second room that we were allocated upon our return - we had a split booking 2 days and 3 days. The second room had more space and a larger bathroom too. Nice breakfast, excellent coffee and very friendly staff. The only thing we noticed was the noise level in the breakfast room by the staff clearing away crockery. Other than this, it is an ideally located hotel and very good value for money. I was impressed by the internet service available and the loan of a notebook for our use in the room. I would recommend this hotel and would use it again when we next visit the very beautiful city of Rome.", "Date": "August 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "USA", "Title": "“Great location, price & service”", "Author": "lloydchirstmas", "ReviewID": "UR38585208", "Content": "This hotel is centrally located with easy access to all of the marquee monuments as well as the train station. The service is effective and they are reasonably flexible when it comes to check-in times. Reza and his staff do a great job of accommodating their guests and are very helpful with tips for first time visitors. The breakfast is also delicious and is served for a relatively long period of time in the morning. Overall, a highly recommended hotel.", "Date": "August 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Scotland", "Title": "“Excellent location for exploring Rome”", "Author": "MoonScotland", "ReviewID": "UR38525068", "Content": "This hotel is ideal located for exploring rome. The rooms were clean and of a good size, the bathroom was a little compact but had a large shower cubicle. The staff were very friendly and helpful and the hotel offers the little touches that make the difference - like free Wi-Fi and also the use of a laptop computer for your room. Would definitely use this hotel again if visiting Rome.", "Date": "August 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Orange County", "Title": "“We absolutely loved this hotel...”", "Author": "VictoriaOrangeCounty", "ReviewID": "UR38268535", "Content": "We stayed at Hotel Opera Roma six nights, August 11-16, during the heat (90 degree +) of summer. At the end of our busy days of sightseeing we were grateful to return to this cool, tranquil oasis. The quiet, efficient air conditioning was a life saver. Our room (Number 106) was spacious, clean, and comfortable with pleasing contemporary decor and elegant marble accents. Equipped with minibar, safe, complimentary wi-fi, kettle, hairdryer, excellent water pressure, fluffy towels, soaps, and comfortably firm beds and pillows, the room provided all the creature comforts one could hope for. We particularly enjoyed the beautiful breakfast room and made-to-order coffee. The continental breakfast buffet was always well stocked with a lovely variety of breads, cakes, cereal, yogurt, cheese, and meat. The hotel is conveniently located, just around the corner from the Repubblica Metro station and a short walk (five minutes) to the Termini where the two metro lines intersect. We absolutely loved this hotel and very much appreciated the helpful, friendly, and attentive staff.", "Date": "August 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "rehovot", "Title": "“very friendly staff in a surprising nice hotel”", "Author": "plantar", "ReviewID": "UR37823738", "Content": "The hotel is situated near via nationale 200 meters from metro and bus stations.The staff extremly friendly and helpful.The room clean and contains all the needed amenities.The street very quiet.Great A .C.All these for 99 eu per night,it`s an excelent value.", "Date": "August 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Great little hotel in heart of Rome”", "Author": "Mariontem", "ReviewID": "UR37671978", "Content": "After searching the internet for somewhere reasonable to stay in Rome that did not cost an arm and a leg I came across some reviews for Hotel Opera Roma, and have to say that it was great. Good service, nice rooms, good location and very helpful staff. I stayed for just one night but was impressed with everything from the first email contact, to the rooms which were just as described, to the breakfast, but the best thing was the service. A real find!", "Date": "August 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Pennsylvania", "Title": "“Need a Hotel in Rome? Look No Further -- Superb Serivce-Driven Staff, Superb Facility, Superb Location!!”", "Author": "BRGSmith", "ReviewID": "UR37452973", "Content": "Considering a stay in Rome? Don't waste any more time. HOTEL OPERA ROMA IS THE PLACE TO STAY. My wife, daughter, and I stayed at the Hotel Opera Roma from 8-10 August 2009 (Room 106) during the last leg of our 2.5 week backpacking tour through Europe. Hotel Opera Roma is located on the very quiet Via Firenze at Number 11, just east of Via Nazionale, and two blocks from the Repubblica Metro station. It is within 15 mins walking of the Colleseum, Palatine Hill, Roman Forums, Pantheon, Trevi Fountain, and Spanish Steps. This newly renovated high-quality facility has a staff that is entirely dedicated to the best customer service possible. When we checked on on Saturday afternoon, the gentleman at the reception desk was professional, friendly and curteous, and took pains to show us to our room and explain the features -- keycard locks to the main hotel door, the hall door to the wing in which our room was located, lighting and A/C controls, etc. Two nights later, the gentleman was very helpful in assisting us with printing our boarding passes for the flight home. Breakfast is included with the room, and is served in a nook on the first floor, with customer-service focused waitstaff. There is a wonderful selection for breakfast, in the typically delicious and filling European style. Especially good were the large pie-like baked pastries cut into small sections, and the black coffee is without a doubt the best black coffee that I have ever had. The gentleman tending to drinks always brought a second cup automatically, and the woman that bussed the tables and set them up was equally friendly, courteous, and efficient, and did an equally efficient job cleaning the rooms. Our room was SPOTLESS and completely sqared away and picture-perfect each day. Hotel Opera Roma is a wonderful value and worth every Euro cent; we were still talking about how much we enjoyed our stay there and the Hotel's exceptional service-driven staff while driving home from the airport last night. B R Smith", "Date": "August 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“Great service, great location, great choice!”", "Author": "UkTravelCan", "ReviewID": "UR36739477", "Content": "Stayed with my sister in Hotel Opera in May 09, the location is great, and worth paying the extra, most sites are within walking distance, and also close to the metro. The service was friendly and courteous, and I have recommended this hotel to family and friends. Mr Samra", "Date": "August 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Munich, Germany", "Title": "“A very beautiful place to stay in Rome”", "Author": "alfred54", "ReviewID": "UR36486122", "Content": "a small hotel, close to all attractions, at metro station Repubblica. Clean room, clean suite-room with whirlpool for a very reasonable price. The staff is very friendly.", "Date": "August 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "seattle", "Title": "“Hotel Opera Roma is the only place to stay in Rome”", "Author": "maleika24", "ReviewID": "UR36264773", "Content": "My husband and I spent 5 nights at the Hotel Opera Roma in July. We had a fabulous stay!! The room was spacious (#209) and the air conditioning was fabulous as we were there during a bit of a heat wave. Try to avoid room #211 it's a bit small. Breakfast is delicious as is the made to order coffee. All in all one of the best hotel stays of our travels. Reza does a great job of answering questions and making you feel at home. We would stay at Opera Roma on any future travels to Rome!!", "Date": "July 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "D/FW", "Title": "“Hotel Opera Roma: a Cool Oasis in Rome's Historical Center”", "Author": "librarymedia21st", "ReviewID": "UR36244022", "Content": "Gracious hospitality greeted my husband and me at the Hotel Opera Roma in July 2009. Our room, with the cool marble floors, air conditioning, double bed, desk, and free internet service was all we were expecting and more! I plan to stay at the Hotel Opera Roma on a return trip to Rome.", "Date": "July 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "paris france", "Title": "“Great Hotel”", "Author": "blueprl22", "ReviewID": "UR36151761", "Content": "We were originally booked at the Hotel Sonya, but they said it was full and we were going to stay at the Hotel Opera. What a nice hotel. We had a huge room (by European standards) and the bathroom was huge too. The room was always immaculate and the a/c worked well. There was always someone at the front desk no matter how late we came in. Breakfast was nice and convenient. The neighborhood felt very safe. There is a grocery store down the street and its a great area for shopping, but the restaurants werent very good and were very touristy. Be sure to go to the opera. I\"m not a huge fan but it was a lot of fun!!", "Date": "July 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Australia", "Title": "“Great hotel and a reasonable price”", "Author": "MyriamBrisbane", "ReviewID": "UR35301704", "Content": "We had a great stay at the Hotel Opera in June /July 2009. We hadn't been to Italy for many years and found Hotel Opera to be a very pleasant surprise. The room was recently (and quite lavishly) refurbished and quite spacious (even with an additional bed for our 14 year old son). The bathroom was huge. There was free wireless internet access from the room, The hotel seems to be a smaller off shoot from a nearby hotel and so there aren't a lot of staff. But those that there are, were friendly and very helpful. The manager Reza seemed to be everywhere and very willing to help. When my wife enquired about a coffee shop when we first arrived after a long flight - Reza was back with a cappuccino almost immediately. Breakfast was basic but more than adequate. The hotel is centrally located near to the main railway station - but off a quiet street. And the cost was very reasonable compared with other places we stayed in Italy. We would definitely stay there again.", "Date": "July 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "belfast", "Title": "“I'd recommend it”", "Author": "ciaraneoneill", "ReviewID": "UR34892625", "Content": "We stayed in the hotel in July 2009. It was located convenient to shops, bars and all the main tourist attractions. The rooms were bright and airy and the staff polite, and helpful. The facilities were modern and the rooms kept clean and tidy. The cost was reasonable. I'd certainly consider staying there again. Some of the shops around the hotel offer very good value for money in terms of food and drink - worth bearing in mind if you are travelling on a budget. I dont speak Italian so I'm not sure what all I've ticked in terms of boxes here!", "Date": "July 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“Excellent hotel - Great price, location, rooms etc....”", "Author": "2710jade", "ReviewID": "UR34558272", "Content": "I booked this direct with the hotel, it was the best price around (425 Euros) for 4 nights in July, which was excellent value for the centre of Rome. Great location - near metro (2 mins), buses etc if you want them. All major sites within walking distance (10/15 min Trevi Fountain, Colosseum etc). Rooms - Good size with TV, Laptop, Kettle, Fridge, Safe, A/C etc. Bathroom - Large shower which was powerful and plenty of hot water. Great mirror with a smaller one for makeup with a good hairdryer. Breakfast - Typical continental - bread rolls, ham, salami, cheese spread, jams etc. Cakes, fruit, yoghurt. Tea, coffee, orange juice etc. Staff - Reception staff were excellent, really helpful, pleasant and polite with everything you asked. Always gave us great directions to places, good restaurant recommendations.", "Date": "July 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Stellenbosch, South Africa", "Title": "“Great hotel”", "Author": "Diplos", "ReviewID": "UR34527156", "Content": "This is small hotel (sister hotel of Hotel Sonya nearby) but the rooms were clean and the air conditioning was excellent. Via Firenze is not a busy street, so the hotel is quiet at night - besides the double-glazed windows would keep it quiet even if on a busy street. The location, near the train station, makes it ideal for trains and buses. The hotel has free internet and you can request a laptop (netbook) for the room too which I thought was a nice touch. Easy to walk to Trevi Fountain, Spanish Steps, Piazza Navona, etc. We walked everywhere in Rome. Hotel has a small elevator. Rooms have flat screen TV and SKY. Staff were very friendly and helpful and I would definitely recommend this hotel to friends and I would stay there again.", "Date": "July 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "belgium", "Title": "“clean and friendly”", "Author": "anousckaB", "ReviewID": "UR34516083", "Content": "The hotel and rooms were very clean. The staff was very helpfull and friendly. The room was not a triple room, what we ordered, but a double with a third bed, so very small. The breakfastroom was to small for all the guests, so you had to wait. But, I would go back! There was no streetnoise ans the location was perfect.", "Date": "July 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Puget Sound WA - USA", "Title": "“Perfect Hotel for the Price”", "Author": "Live4Travel_Now", "ReviewID": "UR34424612", "Content": "I pre-paid my room about 45 days before I left and felt like I got a great deal. The room was updated and the perfect size for my teenage daughter and myself. The shower was also nice, not too small, and was cleaned every day. The only thing was that the room was a little on the dark side, very small window for sunlight. But that was very minute and we loved the hotel. We would return again!", "Date": "July 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Poznan", "Title": "“Better then we expected”", "Author": "Marek_Poz", "ReviewID": "UR34372534", "Content": "Very well located, comfortable hotel with very friendly service. The room was big, the bathroom to. For English tourists - yes, they have an electric kettle in the room, tea and coffee included. Strongly recommended!", "Date": "July 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Best experience of Rome”", "Author": "angelescua", "ReviewID": "UR34207987", "Content": "The hotel has one of the best locations: close to the Termini station and all the major attraction points in Rome and lots of small restaurants and pubs with good food at affordable prices. The staff were amazingly friendly and helpful. Rooms are clean and spacious enough and when I checked in I was handed in a notebook for free wireless Internet (which was very helpful). Breakfast is very good and one can make his/her own tea/coffee in the room with no extra charge. Overall, a very pleasant experience, recommended to anyone traveling to the beautiful Rome.", "Date": "July 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "seattle", "Title": "“Wonderful and Comfortable Stay”", "Author": "riteshdesai", "ReviewID": "UR34171210", "Content": "Top Notch service by all the hosts at the reception. Litu was the best. The rooms very larger than any that we had seen in Europe and very modern and trendy. The breakfast was good too. We had problems with the laptop that they provided as it was in Italian and i screwed up by trying and losing all my songs on the Ipod (but I got them all as soon as I came back home to Seattle). It was nothing in compared to the comfortable 3 night stay at the hotel. I would go back there again and would recommend it to anyone with a family.", "Date": "July 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "west midlands", "Title": "“great hotel in a great city”", "Author": "Sopp", "ReviewID": "UR33887055", "Content": "stopped at opera roma in june (22nd for 4 nights). booked direct via website - fast return on e-mail, they also arranged taxi pick up from airport. flowers and wine in room on arrival, offered own computer in room etc - nothing was too much trouble. they had a problem on the first night so we stopped in a small double rather than the larger double we had booked. however they offered a full suite if we wanted it for the last two nights. they advised on sites, how to get there, good restaurants etc. breakfast was typical continental fayre - again pleasantly and efficiently served. rooms were well cleaned, good air conditioning etc. would go back without a doubt - not only is it great but well located for station and within easy walking distance of all the city centre sites. they also lent umbrellas to guests!", "Date": "July 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "sydney", "Title": "“Unexpected find”", "Author": "sydneygray", "ReviewID": "UR33826817", "Content": "We found this hotel a very pleasant place to stay. We stayed for 5 nights and each time we entered the hotel there was always a smiling face to greet us. The selection at breakfast was fulfilling. There was no traffic noise in the room we were in. The staff were very helpful and friendly and advised us on possible sightseeing locations when asked. The only downside was the bathroom and lift were a bit small. But overall we had a excellent stay and would return again.", "Date": "July 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Rome", "Title": "“Friendly and helpful service in a great location!”", "Author": "lugequeen", "ReviewID": "UR33531150", "Content": "The Hotel Opera Roma was a comfortable gem right in the center of Rome. The staff are incredibly helpful and friendly and the rooms are comfortable and impeccably clean. It is located in the heart of the city close to bus stops, the subway and just a few blocks from the train station. I would highly recommend it to anyone.", "Date": "June 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Lima", "Title": "“Great small hotel with excellent service”", "Author": "psc27", "ReviewID": "UR33461087", "Content": "Service: The service is excellent (both at the front desk and breakfast area). Rooms: although a bit small and quite dark, they are newly renovated and impecable. The bathroom was also very clean and brand new. Complimentary breakfast: all the basics as well as just baked cakes included. Very good overall. Internet access: Internet speed is okay, but the best of all is that we got for free a laptop to use during all of our stay. Never seen this service offered in any other hotel. Location: walking distance from main attractions (20 mins) and very convenient if taking the metro (5 minute walk) or train from termini station (5 minute walk as well). Easy access to all Rome attractions. In general excellent price/ value.", "Date": "June 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Dongen", "Title": "“Great hotel”", "Author": "mdingenouts", "ReviewID": "UR33451199", "Content": "This was e great hotel with a very good service as well. The people who work there where very very polied. Good breakfast, simple but very good. Nearby a lot of restaurants and bars. Central in Rome to walk to your sites. All together. Good!!!", "Date": "June 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Boston, MA", "Title": "“Best Hotel for the Price”", "Author": "bbellinger", "ReviewID": "UR32911188", "Content": "My wife and I stayed at Hotel Opera for four nights in April 2009 and loved our stay. We were looking for a hotel that was safe, clean, close to everything, and within our budget, and this hotel covered all those areas. First, the staff was incredibly friendly and helpful. The location was perfect- just off Via Nazionale where you can catch a bus, 5 minutes to Piazza della Repubblica and the subway, and 10 minutes to Termini. The room was very clean and comfortable and everything in it was fairly new. The breakfast was outstanding, tasted as good as it looks in the pictures on their website. And the laptop computer they lend you for your entire stay was extremely beneficial in keeping contact with our families at home and researching things to do. We hope to get back to Rome again some day and would have no reservation staying here again.", "Date": "June 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Wellsville, NY", "Title": "“Wonderful, accommodating, convenient, modern hotel”", "Author": "TravelerCarol", "ReviewID": "UR31995238", "Content": "Going with Rick Steves' recommendation, always right on, we found this hotel to be exactly as expected - new, modern, helpful staff, excellent breakfast, internet access in room, all the conveniences with the most pleasant of rooms. Definitely recommend this place and would stay there again when in Rome.", "Date": "June 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "California", "Title": "“Their service can't be beat!”", "Author": "travelswithdiane", "ReviewID": "UR30979820", "Content": "I took a single room, about 6’ x 8’ with a private bathroom. I needed an inexpensive place to stay for one night before catching my flight home and I had trouble finding something in my price range. I’ve had closet-sized rooms before and I knew about this when I made the reservation, so there were no surprises. They did the best they could with that tiny space (they even had a make-up mirror in the bathroom), and offered to loan me a computer with free internet access for the evening in my room--how special is that! The air conditioning in my room worked extremely well. I mention this because some hotels mention air conditioning on their websites, but will not have it available except June-August, and I was here in April. I found the service at this hotel to be excellent. Tripadvisor should look into this hotel carefully for next year's awards for service. I was impressed. I didn't see any other rooms, but the corridors looked freshly painted. This was the only hotel that provided a magnetic room key that I was able to keep with me. The bed was comfortable and the linen was fine. My only complaint would be the lack of a soundproof window. Should I return to Rome I would stay here again and ask for a quiet location. I reserved here to be near Termini, but I saw a sign they had at the counter about car service. The night before my flight they arranged a private car for me to go to the airport. A gentleman neatly dressed in a suit arrived in a rather plush Mercedes. This was a great deal at 40 euros, and much better than trekking to Termini for the Leonardo Express. A great way to end a great vacation. If you need a break from the Italian cuisine, I found a Chinese restaurant very close to the hotel, Wang Xiang Lou. It's between the Opera House and Termini. Not fancy, but filled with locals, and the food is good.", "Date": "May 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "scotland", "Title": "“SERVICE WAS EXCELLENT”", "Author": "ScotlandSjs", "ReviewID": "UR30874469", "Content": "Had a wonderful time at this hotel, its one of the quietest rooms I been in in a major city no outside noise. The staff were fantastic the girl who cleaned our room deserved a medal as it was alwas very untidy. We were round the corner from the tour bus which did a tour of all the major sites in Rome. This was a birthday celebration and the hotel were great in letting us use the breakfast room to have a celebration before we went out for dinner. We used taxis a lot from the hotel but found them to be inexpensive as there were 4 sharing. Good location, easy to find,good value for money, great breakfast, fantastic staff", "Date": "May 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Dumbarton, Scotland", "Title": "“Absolutely fantastic little hotel”", "Author": "valj58", "ReviewID": "UR30697792", "Content": "We were a group of 11 ladies celebrating a 40th and two 50th birthdays. Had originally booked Hotel Sonia but were moved to Hotel Opera. I cannot comment on how good the Sonia would have been but we certainly don't think we lost out with the Opera. It was everything we could have wanted. The service was second to none. Breakfast is simple continental style but an excellent range and fresh. You are served immediately on arrival with fresh orange juice and the best cappuccino. The breakfast room is pretty compact and bijoux so you may have to wait a few minutes for a table. There is no bar in the hotel for us not aproblem as we were there to see Rome and not the inside of our hotel. Excellent location only 5-10 minutes walk from Trevi fountain and many other historical sites round about. The staff assisted us in decorating the breakfast room for a small birthday celebration with banners and ballons etc before we went out for a birthday dinner. They were very enthusiatic about our celebrations and could not do enough to help. The rooms are very clean with a mini bar, good showers and the most comfortable hotel bed I have slept in in years. Special thanks to Michael and Rigos for all their help. I would not choose to stay anywhere else if in Rome.", "Date": "May 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Vicenza, Italy", "Title": "“Perfect place at perfect price. Within walking distance to everything!”", "Author": "Quicker", "ReviewID": "UR29633301", "Content": "What a great stay! Hotel is super friendly. The service was top notch. Rooms are small, but have everything you need...fridge, waters, TV, wifi, clean bathrooms (very important in Italy as some bathrooms leave much to be desired). If you are looking for a room with tons of space and expect to spend leisure time in the room, then this may not be great for you, BUT if you are looking for a clean room, authentically friendly service in an area within walking distance to everything (Borghese gardens, Coliseum, Trevi area) then this is the place. Oh, and did I mention the staff and the great service? LOCATION: You will need a taxi or bus to the Vatican, but everything else is within walking distance. There are many good shops and coffee bars around the block, and the hotel is situated right off of Nazionale which is a main strip for shops, food, etc. Literally, it was a 5 min walk to the Coliseum located to the south. 5 min to the Trevi area with tons of gift shops and some great little wine bars and restaurants, but be sure to wander off the beaten path as that is where we found some of the best places where the locals gather. Train station is only about 5 blocks. Don't bother with a taxi because the taxis are more hassle than it is worth. If you don't have too much luggage, then just break out a map and walk the 5 min walk. AMENITIES: During our travels, we spent very little time in the hotel, however we wanted a good hotel, clean, good price, friendly service, great breakfast and this was the place. If you want 5 star service (room service, spa, restaurant, etc) then you will have to spend substantially more, but these services seem redundant when you consider that great any Italian trattoria or cafe is only a block away. Ask the people at the front desk about good coffee shops, wine bars and trattorias. They will give you recommendations for good local spots that you would otherwise never find and trust me, you will enjoy. This is so much more authentic than sitting at the hotel bar, right? NOISE: We stayed on the front side of the hotel, and the rooms were fairly quiet. I have seen other reviews with complaints of noise, and if you are a very light sleeper, then you should expect problems at pretty much any hotel in Rome because let's face it. Rome is a bustling city and is noisy, but during night hours at Opera Roma, I felt that the noise level was more than reasonable. Some cars can be heard on the street, but for the most part, the street was quiet, and the noise did not penetrate the rooms. ROOMS: The rooms are small, but most European accommodations are not spacious unless you are willing to pay the extra price. All in all, the rooms were perfect for my husband and I. The bed was large, there was a closet and safe. The bathrooms were very clean. Rooms had a TV, wifi and closets. The shower was very small (no bathtub in my room) but it was clean and functional. Water pressure was awesome! If you want a spacious room, then buyer beware because you will pay the additional price. We stayed at two hotels in Rome and the second we paid more and did have more room, but the cleanliness and service was lacking. I would definitely choose Opera Roma over the other. Probably not great for kids but I didn't see the larger rooms, and there were couples there with children of various ages, so obviously it is feasible. BOOKING & PAYMENT: I recommend using the hotel website directly for booking or calling. They all speak perfect English and various other languages. Knowing Italian always helps when getting around Roma, however Opera Roma accommodated Asian, German and French travelers while I was there as well. Ask to pay cash for a discount. You will save about 10 or 20 euro per night. LOCATION & AVAILABILITY: The sign out front is small, but if you find Via Firenze, then you cant miss it because the street is only about 2 blocks long and is situated on the left side of the Opera house. The owners also have Hotel Sonya a block away. Opera Roma only has a few rooms, so if Opera Roma is full, ask about Sonya as the staff and ownership are wonderful and Sonya has recently been renovated.", "Date": "May 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Milano", "Title": "“Fantastic Stay in Rome”", "Author": "Bruno1971", "ReviewID": "UR28476419", "Content": "I had a fantastic experience in this Hotel in Rome I was in the suite..........free wi-fi - clean hotel - people very nice and helpfull - good breakfast but the suite is incredible...fantastic my wife did not want to leave Rome because of that!!!!", "Date": "April 21, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "BRU", "Title": "“comfortable, reliable hotel”", "Author": "anonymousBRU", "ReviewID": "UR28127451", "Content": "The hotel is located in a quiet street. There is a bank nearby. The hotel unfortunately has no bar. Staff is friendly and helpful.", "Date": "April 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Preston England", "Title": "“Couldn't do more”", "Author": "t00n3r", "ReviewID": "UR27117357", "Content": "We arrived shattered from organising my mothers funeral and were quite dissapointed to learn that we were to be transferred from Hotel Sonya to hotel Opera. We were fully assisted the short walk and then given a map of the city with a comprehensive suggested tour. We were given a small laptop with free internet access, superb to keep up with the preceeding weeks events. The room was clean comfortable with memory foam matress and a well presented bathroom, sadly no bath but high pressure shower. Breakfast was plentiful with superb Capuccino. Staff could not do enough to help. We were so pleased to have been moved but still don't know what Hotel Sonya had to offer, perhaps we will try it anothet time.", "Date": "March 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "IRELAND", "Title": "“Trip to Rome”", "Author": "TYPE14", "ReviewID": "UR25572219", "Content": "Lovely hotel, friendly staff,would recommend it to anyone.", "Date": "March 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bucharest", "Title": "“Very nice hotel”", "Author": "speedylaur", "ReviewID": "UR24398836", "Content": "I loved staying at Opera Roma Hotel. Great services, great staff and very nice rooms everything included !", "Date": "February 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Portugal", "Title": "“Good location, overall comfortable”", "Author": "Traveladdictportugal", "ReviewID": "UR23007640", "Content": "The hotel is near the centre of the city, the rooms have recently been remodelled and look very modern and above all very clean! The breakfast is well served, the staff is friendly and the hotel suits the purposes of a cultural get-away to the eternal city. It is near the main underground lines and there are bus-stops, restaurants, cafés and shops within a 200m walking distance. We used the underground much less than we expected.", "Date": "December 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Haifa, ISRAEL", "Title": "“Above and Beyond all Expectations”", "Author": "Orikio", "ReviewID": "UR22980933", "Content": "My girlfriend and I stayed at Hotel Opera Rome for 7 nights in December, while visiting and enjoying the beauty and charm of Rome for the first time. The hotel staff and amenities were absolutely incredible, and we would highly recommend this hotel for travelers on a budget, since it's simply a hidden jam in Rome, which gives you much more than you'll expect for the price you pay. It all started with a very good communication via emails and Skype, with a very fast booking conformation, without and advanced deposits or credit card charge, and with full cooperation with our requests (such as early check-in or luggage safe keeping since our flight arrived at Rome early in the morning). The Hotel is within very convenient 5-6 min. walk from Termini, and even with heavy luggage on a rainy day, it wasn't that bad... We checked-in at around 11:00 AM and received our lovely room (no. 207) immediately. The rooms are very modern and squeaky clean. Everything was working properly and the house keeping staff did a marvelous job every day. The windows and wall are all sound proof and very isolating, and you can hardly notice the weather outside even when it's stormy. The bathroom features a full sized tub with a Jacuzzi, which was a real delight every night, after a very long day of walking and sight seeing all over Rome. Breakfast was a treat as well, with the hotel's wonderful staff that comes to know all your 'breakfast habits' and tries to accommodate your every wish, with a smile. Breakfast included everything that is featured in the hotel's web site. With home made cakes and great Italian coffee. Also, in case you are wondering, I can verify that all the pictures in the hotel's web site represent the exact reality that you'll encounter upon arriving to the hotel. The rooms, the entrance, the lobby and the breakfast hall, are just as pictured. But above and beyond the facilities and the breakfast, I have to commend the wonderful staff! In all the shifts and during our entire 8 day stay at the 'Opera', we always encountered the most helpful, kind and polite staff, which went above and beyond in order to help us out. Just for example: in one of the mornings, we had an early train to catch to Napoli, which was booked and paid for in advance. Our money for that day was locked in the safe (the private one, in the room), and from some reason, it just wouldn't open. At 6:30 AM, the reception staff, tried to help us open the safe, with no luck, and with the departure time for our train getting closer and closer. After a few minutes, my girlfriend (Which on that Rome trip, also became my fiancée), asked him whether we could get some cash and deal with the safe when we return. Without any doubts and immediately, we got the amount that we requested (200 euro) in cash, and not once until our check-out, 5 days later, we were asked to settle the bill. There are more examples like that one, but I guess you got the idea. To summarize, Rome is unbelievably charming and romantic, and for us, Hotel Opera Roma, was a great experience which helped our vacation to be more that we could dreamed of. We will definitely go back. After sending our families to enjoy as well! Thank you Reza and all the wonderful staff. Ori Rivash and Sarit Helmreich Haifa, ISRAEL", "Date": "December 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Madrid", "Title": "“Hotel Opera Roma is irreproachable.”", "Author": "lulom", "ReviewID": "UR22511004", "Content": "My wife and I have been very pleased by our stay in Hotel Opera Roma. It is very quiet and close to practically all the main touristic sites of Roma. The room was clean, modern and very functional. Breakfasts were simple but abundant and assorted (may be an Italian cheese would be included in the buffet). The free Internet connection is very valued and useful. Finally we were delighted by the personal response; they were available and they did their best to solve any kind of incidence to at any moment. Congratulations!", "Date": "December 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "County Wicklow", "Title": "“location , service, value”", "Author": "WicklowKiwi", "ReviewID": "UR22248346", "Content": "Just back from 3 nights at this hotel having met friends with a 1 yr old. It exceeded our expectations for under 100euro in the centre of Rome within 5 mins walk from termini station. The hotel was quiet, very clean, centrally located to attractions and had good restaurants within a few mins walk. We found all the staff very helpful , informative and friendly. Every request was met willingly and there was a very good breakfast. All in all it was a very positive experience that made us feel like it was a home away from home and it had excellent pillows to boot which is a rare find in europe. Well done Litu, Reza and staff.", "Date": "November 27, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great Find In Rome!!”", "Author": "RPPMP", "ReviewID": "UR21093879", "Content": "We have stayed in a few hotels in Rome, this one is the best by far. We loved our stay, this hotel is very modern with large comfy double bed, flatscreen TV, sky TV, in room safe, balcony (overlooking via firenza looking up towards via nazionale). The bathroom is awesome with double shower. Location is great within walking distance to everything, we walked to Trevi, Spanish steps etc. If you want to go to the Vatican or Travestere (Travestere is good for dinner reasonable prices) very easy catch the bus on Via Nazionale. The reception staff are very helpfull they will tell you what bus to catch and any information you require. Free internet was a bonus. Breakfast is Italian style. When you check out reception will hold your luggage so you can continue your sight seeing, if you have an afternoon departure. We booked direct with the hotel, communcation was very good and prompt. Close to Termini a 10 minute walk. We highly recommend this hotel, if we are ever in Rome again we would stay here again.", "Date": "October 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mpumalanga", "Title": "“Everything we expected”", "Author": "PiperMpumalanga", "ReviewID": "UR20187479", "Content": "We needed a hotel that was close to the station and yet central to the city sights. It was an easy walk from the station to the hotel. We walked from the hotel to the Trevi Fountain area for an evening meal. The hotel was everything that we hoped it would be. Clean, well equipped room, excellent internet access, friendly service, delightful breakfast room with a delicious spread. The hotel stored our luggage for the day while we went sight seeing as we left Rome on an evening flight. Thank you Hotel Opera Roma for a very pleasant stay. Reviewer: John and Margo, South Africa", "Date": "September 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Nice little hotel”", "Author": "CiaoClaudia", "ReviewID": "UR19182346", "Content": "We really enjoyed our stay here! Nice rooms, clean, good sized. Friendly and courteous staff. Free internet (even offered us a free mini-computer to use in our room). Nice breakfast. Quiet street, short walk to Termini Station. Close to shopping and very well situated to see the sights of the historic centre. Offered a shuttle for 14 euros/per person, a deal when the direct train to Fiumicino is 11 euros/per person. Would definately go back.", "Date": "August 20, 2008"}], "HotelInfo": {"Name": "Hotel Opera Roma", "HotelURL": "/ShowUserReviews-g187791-d1017574-Reviews-Hotel_Opera_Roma-Rome_Lazio.html", "Price": "$94 - $468*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Firenze 11</span>, <span class=\"locality\"><span property=\"v:postal-code\">00184</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "1017574", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/4e/40/4e406f137d4611fd82cebfe3395b18e21large.jpg"}}