{"Reviews": [{"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Location”", "Author": "Eriadna B", "ReviewID": "UR119721769", "Content": "The location is excellent but no way that you can sleep with all the noise going on outside all night and early hours in the morning. The personnel is very nice. Accommodations, well, you get what you pay. I was suppose to spend 6 nights but after 2 nights sleepless I checked out. If you are going to stay one night, FINE! But, there is no way that you will sleep.", "Date": "October 25, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Barcelona, Spain", "Title": "“absolutely terrible except for the location”", "Author": "burneyman", "ReviewID": "UR117888728", "Content": "The guy at the desk was ok. The room is sweltering, the sink spews water all over the floor from a leak around the waste pipe. The shower room is wet wall to wall because the door to the shower can't be shut and the floot covered in black dirt. It stinks of cigarets in the hall and there are people shouting drunkenly all night. The slab that you sleep on sort of looks like a bed. The location is excellent. Basically, stay here if you just can't find anywhere else but otherwise, you can probably do a lot better.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Saint Paul, Minnesota", "Title": "“Terrible staff, bad accodomdations..but good location”", "Author": "amy l", "ReviewID": "UR117501249", "Content": "I honestly would have been better off staying at a hostel like my friend and I initially wanted to. When we checked in the room was not what we reserved, but the location was great so we over looked it. On and off through our stay the toilet stopped working, the shower was broken and our fan broke. When we asked if they would fix it..they blamed the broken fan on us and said it was fine, it's cold out side and you are leaving tomorrow so you don't need a fan. Two of the men behind the desk were decent, but one of them was just horrible!", "Date": "August 31, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Washington, DC", "Title": "“won't recommend it to anyone”", "Author": "banbor", "ReviewID": "UR43069139", "Content": "This is worse than a basic no frills hostel. I booked a room with a shared bathroom and got stuck in a room converted from a hallway that wasn't even marked on the fire escape. I could touch both walls with my hands and the rooms had a \"moldy\" smell every time I entered. The shower head was broken and sprayed all over when I was holding it, so the walls, ceiling and floor of the bathroom were soaked every time I was in there. The shower hook was broken the entire time I was there, so you had to hold it in your hands. To be fair, the pension was safe and was very close to La Ramble. But if you're looking, don't forget that the area is full of hostals, so look around for a better option.", "Date": "September 20, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "4", "Value": "4", "Location": "4"}, "AuthorLocation": "Wales", "Title": "“Basic, clean, central and safe”", "Author": "yvonnewarren", "ReviewID": "UR26004873", "Content": "Basic, clean,safe, central. Ideal if you don't expect any frills at all. Bit noisy at night until window is closed. Book a double room if you want en suite.", "Date": "March 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Washington, DC", "Title": "“Great location, very nice staff”", "Author": "WanderlustyCamille", "ReviewID": "UR24917343", "Content": "I stayed here for 6 days and it was perfect - a stone's throw from the water and the Ramblas, wireless internet, really nice staff. I'll definitely stay again.", "Date": "February 21, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Nanjing, China", "Title": "“Great hostel, centrally located”", "Author": "Simpv21", "ReviewID": "UR14289415", "Content": "I stayed here for three nights when I went to Barcelona for a long weekend. It is a great property that is fairly centrally located in the old town very close to the ferry terminal. The entire place was immaculate and provided towels/sheets/etc. It was in a very safe neighborhood and about 5-10 mins from the Drassanes metro stop and the Ramblas. It is only about a 15 min walk from Barceloneta beach, and about 10 mins from the cathedral. There is good shopping for boutique-type stores as well. The location is definitely its best quality! Additionally, the rooms were fairly spacious. However, at night the rooms got fairly hot, and the windows were small. Overall, the management was good and present 24hrs/day to let you in, it was clean, great location, and they had free cookies! Would definitely recommend and stay here again.", "Date": "March 14, 2008"}], "HotelInfo": {"Name": "Pension Segre", "HotelURL": "/ShowUserReviews-g187497-d1020431-Reviews-Pension_Segre-Barcelona_Catalonia.html", "Price": "$73 - $132*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">C/ Simon Oller, 1 Principal</span>, <span class=\"locality\"><span property=\"v:postal-code\">08001 </span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "1020431", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/70/88/708865e48229d84c728962c201008c781large.jpg"}}