{"Reviews": [{"Content": "A Paradise in Bali After having done some research how to spice up our stay in Bali, we found the Puri Mangga over the internet, - thanks god!We were a bit sceptical, if the reviews were kind of faked, since none of them showed the slightest negative point, but one has to admit: it is just perfect.Sure - if you are looking for a large resort, with 3 different restaurants and shows in the evening, this might not be your place. But if you look for quietness, individualism and discreet luxury in its purest, friendliest and most personal way, then you will more than just enjoy it.The other reviews mentioned already the sweet little houses with its awesome outside showers (taking a shower whilst the moon and stars are shining is just an incredible feeling), daybeds, which allow you to watch over the landscape down to the sea and its typical interior, so I will not describe all of that again.The garden is very well maintained with a lot of attention to detail and wonderful flowers, which are daily picked and can be found on your bed when you return to your room after breakfast (cleaning is very well timed - the staff goes to your room whilst you sit on the terrace, enjoying the yummy breakfast (a la carte - you can choose whatever you want: pancakes, bread, jam, fruit salad, eggs in all variations - any special wishes, just let the cook know, he is happy to prepare whatever you want). During the day you hang out around the overflow pool, with a great view over the landscape down to the sea. I personally am always too stressed to read books, but the chilling atmosphere there lets you calm down immediately and I read during our 5 days there around 1200 pages. In a hotel close by (Melka - but do not even think of staying there...) you can swim with dolphins (c. EUR 30 for c. 25 min), diving and snorkeling spots are relatively close by and it is not far to the beauties of the western part of Bali. But in general - the north is not very touristy, so it is difficult to find western style bars and clubs... but if you go to Puri Mangga, you are not really looking for those.The evenings are spent with eating delicious food on the terrace, drinking a nice glas of wine (affordable prices.. rare in Bali!), whilst listening to the nature (cocks, geckos, etc.) and chilling music, reading one of the c. 120 books or watching a dvd (c. 100-150 films, if not more). Purin Mangga has not the slightest to do with mass tourism (which you will not find in the north anyway) and the incredible true friendliness of the staff lets you feel like part of the familiy within hours. The resort is a true pearl, one can only hope that it stays how it is. Thanks again to all of the staff for a great stay!", "Date": "Nov 7, 2008", "ReviewID": "UR636304833", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "Londonflo44"}, {"Content": "Puri Mangga - Absolutely Fantastic After months of researching and planning for our first trip to Bali I can tell you that staying at Puri Mangga was an excellent choice. From the very begining when dealing with Hans  Angie (Resort Owners) I felt the decision for choosing Puri Mangga was right and true to their words it was fanstastic. Puri Mangga has been set in the Mountains with breathtaking view of the sea from every villa in the resort and from the pool area. Each villa has been layed out thoughtfully and surrounded with beautiful gardens. What makes it even more magical is the service from all the staff, from the cleaners, drivers, chefs, restuarant staff, and spa ladies. Always waiting on you hand and foot and aiming to please. They make you feel so comfortable and at home which is a very rare these days. The food from the chefs is superb with different items on the menu every day tantalising your taste buds. The Spa area is set with fantastic views, and the the soothing music, water fountains and incredible aromatherapy smells coupled with the massages from the spa ladies make all your stress melt away. Ganesha the Hotel Manager is at your service 24 hours to arrange all your needs. Drivers available to take you a short drive aways to bars and restuarants whenever you want. Shopping trips and even long excursion day trips arranged when it suites you which was fantastic. I went with group of 2 other families and had the whole resort to ourselves. We thoroughly enjoyed our first trip to Bali and cannot wait to visit again!! If your looking for a resort that accommodates a few people, with peace tranquility, fantastic food, great service this is the place for you!", "Date": "Aug 12, 2008", "ReviewID": "UR869240336", "Ratings": {"Service": "5", "Business service": "2", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Kaisim"}, {"Content": "klein aber fein   showReview(22407118, 'full');", "Date": "Dec 3, 2008", "ReviewID": "UR440980339", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "bali-schwaermer"}, {"Content": "涓樸伄涓娿伄闅犮倢瀹躲儶銈俱兗銉堬紒       澶╄搵浠樸亶銉欍儍銉?/a>", "Date": "Oct 18, 2008", "ReviewID": "UR411056034", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "3"}, "Author": "銉撱兂銇°們銈?> 銉撱兂銇°們銈?</a> </div>"}, {"Content": "Privates Paradies       Bungalow von aussen", "Date": "Oct 1, 2008", "ReviewID": "UR747510513", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "na_ka_to"}, {"Content": "Der Platz der G枚tter auf der Insel der G枚tter       Openair Bad", "Date": "Sep 25, 2008", "ReviewID": "UR799623254", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "ralfneier"}, {"Content": "Traumresort Puri Mangga       Pool mit oferflow Kante", "Date": "Sep 12, 2008", "ReviewID": "UR115916925", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "Ferrytrude"}, {"Content": "Einen unserer sch枚nsten Urlaube haben wir in Puri Mangga erlebt   showReview(19454564, 'full');", "Date": "Aug 28, 2008", "ReviewID": "UR576406812", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "papaya21"}, {"Content": "Ein gelebter Traum!!!   showReview(19067632, 'full');", "Date": "Aug 18, 2008", "ReviewID": "UR599490669", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "bernie954"}, {"Content": "Tollster Urlaub seit Jahren       Die Diningarea", "Date": "Aug 15, 2008", "ReviewID": "UR786786807", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "4"}, "Author": "bandit01"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g469403-d1024238-r21621028-Puri_Mangga_Sea_View_Resort_Spa-Lovina_Bali.html", "HotelID": "1024238", "Price": "$73"}}