{"Reviews": [{"Content": "Read between the lines..... Now I know 2 is a little harsh considering we didn't actually stay the night but...(2 rather than 1 due to friendly staff)I booked this room based on the rating here and on the appearance of their web site. A few alarms bells should have rang, as the room is $60 sing which is very cheap for Singapore. Also the email stated cash only. The taxi driver at Changi looked perplexed when we asked for the hotel, Have you stayed here before?, The Cameron he confirmed, and drove with a grin. The hotel is historic and stays true to this with its appearance. Now the check in counter was very friendly but as we were checking in the stares from the cleaners kinda indicated a few things. (a Western tourist straight from the airport isn't the everyday clientele I imagine). The room could be described as a cupboard with the bed on a concrete enclave and we were a little surprised. The cleaners where cleaning all the rooms nearby (which was weird at 9pm), we also saw many couples checking out at 9pm. The pillows on the bed in the room were all love heart shaped. Now can you read between the lines?The front office man whom I said was very friendly was kinda waiting for us to ask for a refund. He did so no questions asked and we got in a taxi and headed for the Crowne Plaza at the airport for a little splurge. The taxi driver back to the Crowne laughed/grinned when we said the Cameron was no good.", "Date": "Sep 7, 2008", "ReviewID": "UR911725702", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "2", "Value": "3", "Rooms": "1", "Location": "3"}, "Author": "ahallnz"}, {"Content": "Nostalgia Plus Move over the Raffles! This one is a gem! Who needs Disney style historic hotels when this one actually evolved over the years organically from the days of the Royal Air Force into a little boutique hotel run lovinginly by the proprietor, Nicholas Ong who is the son of its founder. Nicholas is more than happy to reminise with history buffs and incurable nostalgics about those glorious days of white starched table cloths, cucumber sandwiches and afternoon teas; and performances by Indian snake charmers and fortune tellers. There is still a semblence of those days gone by to be found at the Cameron. HIP Hotels please take note!!", "Date": "Aug 4, 2008", "ReviewID": "UR183995422", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "1629"}, {"Content": "Good Value for Money The Cameron Hotel is exactly what is advertised 鈥?an inexpensive option located very close to the airport. I stayed in the Cameron and found it very simple (almost Spartan) and extremely clean. I was not looking for amenities 鈥?I was looking for a convenient alternative to the airport transit hotel (which was fully booked). I checked in very late and departed very early, so all I required was a bed, a shower, and an air conditioner. The Cameron Hotel provided just that at a very affordable rate. The hotel is very close to the airport 鈥?one stop on the MRT, then a seven minute walk, or a five minute taxi ride from the airport. The high point of the Cameron was, unlike the hotels competing in the same price range in many neighborhoods of Singapore, Upper Changi Road is not overrun with streetwalking prostitutes and the rooms at the Cameron Hotel are not filled with Johns and their screaming tricks. (those contemplating a stay in a Fragrance or 81 Hotel be forewarned and take ear plugs). I stayed alone, but would have been completely comfortable taking my family. There are no attractions near the hotel, and nothing to do within the establishment but sleep鈥?/p>", "Date": "Mar 25, 2008", "ReviewID": "UR377490366", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "3", "Location": "5"}, "Author": "X13"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g294265-d1024563-r19865711-Cameron_Hotel-Singapore.html", "HotelID": "1024563", "Price": "\" id=\"hotel_1024563\">"}}