{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "1.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "phila", "Title": "“Horrible stay!”", "Author": "leslie t", "ReviewID": "UR126446688", "Content": "As you all may know the fairfield inn at the airport has an indoor pool great prices and free breakfast. Which in all honesty sounds like Great Bang for your Buck but I had the wworst weekend get away! i went to relax instead after my first of two nights there i beamce very ill after eatting the free breakfast (vomiting, dizziness, headache) you name it I had it. The pool area smelled like if you were walking into a bottle of bleach zero ventilation. So technically all the Great values that this hotel offers were defective. Horrible Stay!", "Date": "March 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Tigard, OR", "Title": "“More basic than most”", "Author": "EricL97332", "ReviewID": "UR126068588", "Content": "The room was quiet but more basic than other Fairfield Inns that I have stayed at. Very good service. Same breakfast as others. Convenient to hotel and highway. I would probably stay here again if I arrived late or had an early morning flight.", "Date": "March 13, 2012"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Kinston, North Carolina", "Title": "“Nice Building, Bad Hotel Guests”", "Author": "KorbinDallas", "ReviewID": "UR125676023", "Content": "\"Noise and mayhem in the hotel rooms at all hours.\" That sums up my experience. I give the facility 4 stars, housekeeping 4 stars, but hotel management 0 stars. I was here for a long weekend. I thought the airport travelers were well-behaved and mostly transparent. Some couples and large families though, staying here to attend functions or protests or youth sports tournaments were like crazy people. I was awakened all three nights of my stay by noise from an adjoining room. The location is a hidden gem if you are comfortable using the train to get to and from the central city inexpensively. I researched this long row of airport hotels ahead of time. Prices are great at all of them, this being one of the lowest. I will stay at a different one next time. The Eastwick station for the SEPTA train (it also services the airport) is a short four-block walk from here. And when it is time to leave, you don't have to worry about bad overnight weather because you are so close to the airport.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "United States", "Title": "“Airport hotel”", "Author": "Traveler1966_MI", "ReviewID": "UR125472516", "Content": "Great location near PHL, Ruby Tuesday across parking lot VERY convenient for business traveler without car. Breakfast in AM very basic...wouldn't mind seeing another hot item (i.e. biscuits & gravy). Basic hotel room, but fit my needs as business traveler, print boarding pass in lobby area. Shuttle service but did not utilize. Would stay again on next visit to PHL.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Basic airport hotel”", "Author": "plightfo", "ReviewID": "UR124457086", "Content": "Arrived late, left early for my flight. The hotel was fine, but pretty basic. Good location near the airport. Included breakfast was ok.", "Date": "February 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ocean City, New Jersey", "Title": "“Fairfield inn by the Phila. Airport”", "Author": "akw1980", "ReviewID": "UR122619165", "Content": "I like this hotel. I stay here when I have a morning flight. It's just easier for my family. The rooms are nice, clean and quiet. There's a Ruby Tuesday right in front of the hotel. You can eat there or take it out. Staff was very nice and you get shuttle service to the airport. I will stay here in the future.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Warrington, United Kingdom", "Title": "“Good Location, Friendly Staff”", "Author": "CJS1962", "ReviewID": "UR122244700", "Content": "We have stayed here a few times now, after long-haul flights into Philly, before continuing our journey the following day. The hotel is pretty unremarkable, but is located close to the airport (with free shuttle bus service) and staff are very friendly and helpful. In our experience, the prices aren't particularly cheap but breakfast is included, There's a Ruby Tuesday restaurant over the road from the hotel, which is very convenient if you have not yet picked up your rental car (which we tend to do the following morning). There's also an ATM/cash-point within walking distance.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "CA", "Title": "“Good place to be stuck!”", "Author": "BicoastalCa", "ReviewID": "UR121156586", "Content": "Was stuck here in January during an ice storm. Friendly staff who carefully handled getting all the stranded passengers to the airport in the morning. Good breakfast that thankfully was available early. Comfortable, clean room. Would definitely stay here again.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Clean, convenient, great service”", "Author": "greyheaded", "ReviewID": "UR120193806", "Content": "Stayed here both landing at, and returning to, the airport on a vacation. Clean, quiet, rooms with the amenities. Helpful staff. Good, complimentary breakfast with waffle machine, boiled eggs, cereals, pastries, juice/coffee, etc. Couple computers in the breakfast room for boarding pass printing (or whatever else--standing so nobody hogs them too long playing). Talked to staff about their shuttle on landing, then ditched the rental car early on return to take advantage of it--hotel sent the shuttle to the airport promptly on calling, had us basically checked in by the time we arrived. Took the 4:00am shuttle to the airport the next morning--they even had fresh coffee and basic bagles/pastries available for you at 3:00 in the morning so you could get something before the shuttle--an unexpected nicety. Ruby Tuesday a few steps away (good food, good staff) for other meals.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Denver. CO", "Title": "“Not worth staying here.”", "Author": "Tripmeister", "ReviewID": "UR119693283", "Content": "The staff was nice. This place, however, is a dump.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“Good Price and location”", "Author": "purple12", "ReviewID": "UR119549253", "Content": "Until my last stay I would rate this hotel overall very good. Excellent for front desk friendless and helpfulness,very good for location, price, free breakfast, free parking, wireless internet and cleanliness. I will have to down grade the hotel to average because of my last stay. Breakfast was average,(the staff lady in the breakfast room was very attentive), front desk was indifferent ( the staff on our previous stays were fantastic), the carpet in the elevator needed a deep cleaning. I just didn't get the good feeling that I had on previous stays. I am tempted to try another airport location on my next stay.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Avila Beach, CA", "Title": "“Stay again= YES”", "Author": "slogeo", "ReviewID": "UR119371917", "Content": "Top-notch desk staff= very helpful. Good overall service. Comfortable beds & good breakfast.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Northern California", "Title": "“Great airport area hotel”", "Author": "cl1811", "ReviewID": "UR118718272", "Content": "Convenient to airport and I-95. Clean, modern, comfortable room. Friendly staff. Internet stations w/printers in the breakfast area--nice for printing boarding passes. Large breakfast room. I would definitely stay here again.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Atlanta", "Title": "“Not worth it”", "Author": "jaime w", "ReviewID": "UR117796903", "Content": "It was convenient for an early morning flight but I'd rather stay at any of the other airport hotels next time I go. The tv didn't work and they didn't have anyone around to fix it. Then in the morning, I was showering and a huge centipede ran down the shower curtain! They told us a manager would follow up with us and one never did.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Annapolis, Maryland", "Title": "“Won't Be Back”", "Author": "Ellen S", "ReviewID": "UR117477502", "Content": "At the Front Desk during check-in, the desk clerk and another Marriott official were discussing the wet carpet, musty smell,and \"sub-standard\" condition in the room. He said that it was due to hurricaine Irene. The desk clerk said that the room we were to receive had a leaky air conditioning unit. Next we were told they did not have the complimentary 7 days of parking that was advertised on the web site, but that we had to pay to leave our car. Funny, I saw these same complaints on other reviews (except that the wet carpet was due to recent shampooing).", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Average hotel room near the airport”", "Author": "cope2945", "ReviewID": "UR117324508", "Content": "We stayed at this hotel the night before an early flight from Philadelphia Airport. The room was clean and basic, but the hotel does serve a free breakfast from 6 a.m. to 9 a.m. (too early for us) and 24/7 shuttle service to the airport. There is also a Ruby Tuesday's restaurant within walking distance from the hotel. Warning: The free parking advertised on their website actually cost us $40.00 for the week. The front desk explained that this was because we used a discount (AAA) to book the room.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "5"}, "AuthorLocation": "Columbia, Maryland", "Title": "“less than expected”", "Author": "TrailBiker_MD", "ReviewID": "UR116750750", "Content": "Having used the Mariott brand for most of my business trips, the price I paid for this hotel was not worth what you get. It felt very old and run down. The service however was wonderful, I cant complain there, but the room itself made me uncomfortable. They had just steam cleaned the carpet so that may have accounted for the musty feel. I also found a bug crawling around on the floor which really freaked me out. And the location was very noisy. All night long I could hear the traffic on the streets. Next time I am in Philly on business, I will definitly look for a different hotel.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Houston, Texas", "Title": "“Worst hotel experience ever!”", "Author": "Bayhatbor", "ReviewID": "UR116377397", "Content": "Old, run down & dirty. We had to wear shoes in the room because the carpet was wet. They told us that they had just shampooed the carpets. The room smelled like a wet dog.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "new england", "Title": "“Great Service!!!”", "Author": "staceyrogers2", "ReviewID": "UR116085227", "Content": "We came here for a 3 day trip to see the Red Sox play the Phillies. I cannot say enough about the staff at this hotel. everyone was so nice to us and our children! I would stay here again just to hang out with them! (and do some sightseeing).", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4"}, "AuthorLocation": "Tarrytown, NY", "Title": "“Got the job done”", "Author": "murrayhill", "ReviewID": "UR115911823", "Content": "This was my first time at a Fairfield Inn. I've stayed in comparable properties from other chains, such as Hampton Inn and Holiday Inn Express, and the experience was similar--nothing flashy or fancy. But there was a pool, free Wi-Fi, the beds were comfortable, the room was clean and the breakfast in the morning was fine for what it was. The staff we encountered was also friendly. While we were not flying in or out of PHL, the location was still good as it's only seven miles or so from downtown. Bear in mind, the nearby eating options are limited pretty much to the Ruby Tuesday across the street. Plan accordingly. Philadelphia gives you lots of choices, of course, all within an easy driving distance. Overall, a good value, especially if you're there on a weekend when business travelers are not.", "Date": "July 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Southern Pines, North Carolina", "Title": "“Excellent customer service”", "Author": "nehamiah1jones", "ReviewID": "UR115366658", "Content": "The staff was friendly, and the management was attentive to my concerns.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Toronto", "Title": "“STAY AWAY!!!!!!!!!!!!!!!!!!!! FAR AWAY”", "Author": "lovetotravel0202", "ReviewID": "UR114955701", "Content": "Let me tell you this the worst area in the hotel!! First of the they have the worst Customer Service reps at the front desk. They are rude and inpersonal. When i walked into the hotel, I was surprised to see that this was a Fairfield Inn, the place seemed run down and old. My husband and I do a fair bit of travelling and let me tell you, I have never seen anything like this before. When I got upstairs to my room, the room was filthy, carpet was moldy, bathroom had mold and when we checked under the bed, there was bed bugs......YES YOU READ CORRECT BED BUGS!!!!! At that point my husband and I decided to leave. There are 3 other hotels in the area, The Hampton Inn, Microtell and Staybridge. From our research the Hampton Inn's scored the best! So we went across the street and reserved there. The Hampton Inn's provided us with such a warm experience of Philadelphia. The Manager Chris is outstanding and truly values the Customer Experience! It might be a few dollars more but for your health and sanity, trust me stay at the Hampton's. DO NOT GO TO THE Fairfield Inn. The Manager Paulette -- should not be in business!", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Hayden, Idaho", "Title": "“Ok hotel close to airport”", "Author": "1_Metallica_1", "ReviewID": "UR113526335", "Content": "This hotel is your typical 2-3 star hotel that is only useful if you need to be right near the airport. There is nothing within walking distance except a Ruby Tuesday's. The hotel itself is average. Our first room was stinky and the air conditioner didn't work. We were immediately moved to a room that was clean and acceptable for 1 night. The customer service at this hotel is exceptional. It is the only reason I gave this review a 3 star. Everyone was very helpful, and they moved our room in less than 5 minutes. To be honest though, I would not stay here again. I just got a really good deal for 1 night and couldn't pass up the rate.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Houston, TX", "Title": "“Convenient to airport and comfortable.”", "Author": "dcrossfromtx", "ReviewID": "UR113108533", "Content": "This is an okay place to stay convenient to the airport. The room is clean but the bed isn't very comfortable.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Georgetown, Delaware", "Title": "“A Great Choice for an Overnight Stay”", "Author": "Roxygurl761", "ReviewID": "UR106231373", "Content": "My boyfriend and I spent one night at the Fairfield Inn because I had an appointment in Philadelphia the next morning. It was a very nice hotel, nothing above and beyond, but very simple and met all of our needs. It was clean, well kept, and very convenient. There are two restaurants within walking or driving distance. We did go to The Ruby Tuesday next to Fairfield for a relaxing drink and appetizer. Continental Breakfast was very simple, not a lot of variety. There is a fitness center...but it is tiny consisting of two recumbent bikes, a treadmilll, and some free weights. It did have an indoor pool, which was a decent size, but we didn't use it. This hotel is perfect for travelers only planning to stay for one night, but I wouldn't want to stay more than one night as if it were my vacation hotel. It definately is a great choice for travelers on the go!", "Date": "April 30, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "San Fran Bay Area", "Title": "“Dive overnight stay.....dirty and felt unsafe”", "Author": "Hawaiitroller", "ReviewID": "UR105076068", "Content": "Would NOT stay here again. Filthy rooms...carpet was dirty and had not been vaccuumed for quite a while. Nasties clung to my feet after I took a shower and walked across the carpet and got in bed. The room smelled an awful funk when we arrived, nauseatingly so; very noisy throughout the night from both upstairs and in the same hall. The bathroom tile floor had not been mopped upon arrival...dirty spots on floor. Disgusting. Cleaning lady was a grouch and would not move her cart for us to go around in hallway. The only pluses were continental breakfast in the a.m., an airport shuttle, and Ruby Tuesday restaurant across the parking lot. Did not feel safe here AT ALL. Would never stay in this dump again!", "Date": "April 22, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Long Island, New York", "Title": "“Nice”", "Author": "BILLG3505", "ReviewID": "UR95756414", "Content": "Sometimes you don't get much from airport hotels but this was clean, the staff very nice and the room was fine. I was there to pick up my daugther from a very late flight into PHL and used the shuttle both ways from the hotel to the terminal. Aside from breakfast, which was fine I didn't really use much else at the hotel.", "Date": "February 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hampton, Virginia", "Title": "“Good stay. Covered all the basics and a little more.”", "Author": "mikevac11", "ReviewID": "UR95000999", "Content": "Good rooms. Free Internet . Pool. Great location. Restaraunt nearby.", "Date": "January 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Nice for a night or two”", "Author": "dsdr54217", "ReviewID": "UR90049691", "Content": "We needed a hotel close to Lincoln Financial Field and weren't concerned with amenities that we'd have no time to use, so we chose this hotel. The location was a good one, a short drive from the stadium. The room was clean, the mattress was clean and comfortable, although the pillows were a little too soft. It took a lot of maneuvering to get the curtains to close all the way without having a gap where someone could peek in (we had a first floor room) and I noticed that the sheers were extremely wrinkled (I noticed the sheers in the breakfast room were wrinkled as well). The hotel was almost at capacity but was not noisy. The free breakfast was nice, typical continental breakfast fare as well as a waffle-maker. The breakfast room was very clean and everything was well stocked. Every staff member we encountered was very friendly and helpful. There's a Ruby Tuesday's restaurant directly across the way, very easy to walk to. Room service is available from an outside delivery company. The price was great, the room was clean and comfortable, and the staff was excellent.", "Date": "December 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "florida", "Title": "“Choose Another Hotel!”", "Author": "cstarlight991", "ReviewID": "UR86307054", "Content": "My husband and I generally stay at Marriotts when we travel. We were visiting family after Thanksgiving and stayed at the Fairfield Inn as the other Marriotts near the Philly Airport were sold out. The entrance o the hotel seems a little like going into a prison but the front desk staff were nice enough.We rode the elevator up to our room on the third floor. The elevator was not well maintained. When we exited our floor and walked into our room I was very displeased. The navy carpeting was incredibly worn and totally filthy. We had two queen beds and the bedding did not fit properly. The room was incredibly bare bones and it gave me a lot of anxiety tosleep on the beds, however it was late and night and we were tired. This hotel is not up to Marriott standards. Well over a year later I'm still angry we stayed here. What a dump! There aren't a lot of good choices at the Philly airport but this is one of the worst. On a positive note the clerks etc. were all very pleasant but that does not make up for the awful hotel. Beware!", "Date": "November 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Wethersfield, CT", "Title": "“Good value; pleasantly surprised; very friendly personal service”", "Author": "Attyc", "ReviewID": "UR85755432", "Content": "Clean, plain room. Comfortable bed. Some road noise and tempermental climate controls. Oddly sloped tub floor made it slippery. Asked for a wake up call: got a personal, wake-up song sung to me. Good service at the complimentary breakfast (waffle, egg sandwich, fruit, cereal, toast, coffee, juice available). A Saturday night stay but no noise from parties or airport travelers.", "Date": "November 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mays Landing, NJ 08330", "Title": "“Nice welcoming & courteous staff - great for the airport”", "Author": "neglia", "ReviewID": "UR84752472", "Content": "Stayed overnight before an early morning flight - at check-in the desk staff asked if we needed to reserve the shuttle (it only goes if there are reservations) and if we wanted a wake-up call. That was a nice touch. Since only my huband was flying, I rode over with him, waited while he checked in and we were sure the flight was departing, then I called the hotel and they came back over and picked me up - the shuttle driver was very pleasant and told me exactly what to say when I called back for the return so that she was sure to know where to find me. Breakfast was very nice - cereal, oatmeal, muffins, toaster sandwiches, waffles, hardboiled eggs, fruit, yogurt, etc and \"Ty\" who is the breakfast hostess greeted us when we came in, asked if we needed anything special, etc. The pool area was clean and the water WARM which was so nice since most hotel pools are on the chilly side. It's nice to have an indoor pool (which the Hampton across the street does not have). Because the weather was cool, we decided to open the window for the fresh air - if you plan to do this also, please be sure to request a room to the rear because our room was right over the entrance portico and we could hear the very early shuttle passengers as well as the SEPTA (city) bus stop across the street, Altho it's not on the website we asked about a \"Stay, park, fly\" program since we have extended travel plans next May - they do have it, so be sure to ask if you're planing on staying at this location. All in all a very pleasant overnight.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "York, PA", "Title": "“Convenient”", "Author": "Gens328", "ReviewID": "UR79832786", "Content": "Stayed one night before flight out. Very close to airport, clean rooms and helpful staff.", "Date": "September 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Miami, FL", "Title": "“Pleased.”", "Author": "MiamiAL", "ReviewID": "UR77534782", "Content": "Stayed at the Fairfield Inn by the Philly Airport, and I was overall pleased with how everything was. Yes the rooms could use a little touch up, but they were clean, and spacious. The staff is very hospitable, especially the young woman that works the breakfast area. The breakfast is decent with something for everybody. And the hotel has a small indoor pool. The free wireless worked fine. There is a Ruby Tuesdays across the street if you get desperate. Overall, I would stay again.", "Date": "August 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tinley Park, Illinois", "Title": "“Average”", "Author": "weeniedog2000", "ReviewID": "UR75643990", "Content": "The good: Friendly front desk staff, free newspapers, average room, OK bed. Location fine, in area w/other hotels. Seems safe. Indoor pool. Breakfast average--continental breakfast items, waffles too. The bad: room needs some touch ups. A little paint here and there, tub needs glazing, A/C rattles.", "Date": "August 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Virginia", "Title": "“Fine, except for noisy travelers above us”", "Author": "JJJC_Family", "ReviewID": "UR75337941", "Content": "It's an ok hotel, as most Fairfield Inns are. The primary problem was people above us had their kids running amok. We called 3-4 times downstairs. First time we did clerk offered to move us. As we had already changed to pajamas and it was after 11PM and we were dead tired, I told her it was unreasonable to ask us to move, as we were not the ones causing the problem. She agreed and said she would call them. They did not want to do anything about it and she had to call the police to evict them. They made a huge amount of noise clearing out of their rooms and leaving the hotel a about 2AM in the morning. My son was told that they get a lot of folks from the city who use rooms to have fun on weekends. This problem is becoming more widespread, along with parents who refuse to have their children behave, even into wee hours of morning. This phenomenon is making us re-think taking trips. We need to be able to sleep when we go to a hotel. We asked that the room be comped and they agreed. Unfortunately, this may be only incentive for hotels to ensure rude guests don't ruin stay of other guests.", "Date": "August 15, 2010"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Gering", "Title": "“They cancelled our CONFIRMED RESERVATIONS at the last minute !!”", "Author": "FoxeeGering", "ReviewID": "UR72869055", "Content": "I made reservations in January for two nights/two rooms for an extended family vacation to PA and NJ so that we could stay our first and last nights near the airport. I used a credit card and had confirmation numbers for both rooms, both nights. The DAY BEFORE WE LEFT for our flight from Denver to Philadelphia, I got an email from the Fairfield saying that a \"situation beyond their control\" bumped us from their hotel and they were placing us in another one. I called them immediately and was told that a convention came to town taking more rooms than they had available and that they had to bump us so that they could give rooms to their \"platinum customers\". I was further told that this situation could happen at any time, regardless of having confirmation numbers for reservations. I will not go into the details of the problems with the hotel where they placed us, but suffice to say that we were lied to regarding the amenities, the distance and we nearly missed our flight as the \"new\" hotel did not own their own shuttle service and had no control over the shuttle to the airport. I would NEVER stay in a Fairfield (Marriott) owned hotel again, nor can I recommend it.", "Date": "July 29, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Service": "5"}, "AuthorLocation": "Lafayette, Indiana", "Title": "“Nice”", "Author": "cfplafayette", "ReviewID": "UR72450818", "Content": "We had reservations at Residence Inn in PA but our plane was late arriving. It was about 2:00 AM and we called and got a room at the Fairfield Inn. They sent a Shuttle at 2:00 AM to pick us up at the airport. That was really nice. They even let us stay an hour later then check out due to arriving so early in the morning. The rooms were clean and the employees were very nice and friendly. The continental breakfast was ok too. We would stay there again if ever we are in the area.", "Date": "July 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Location": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Very adequate stay for Airport travel”", "Author": "KCL81", "ReviewID": "UR72447352", "Content": "We stayed here Tuesday night for a slight early on Wednesday. We didn't get to the hotel until after 11 but check in was easy. I am a Marriott silver elite member and the woman who checked me in said they had a \"game\" and I could pick one of three envelopes. The one I picked had 10,000 Marriott bonus points which was great, though a week later I have yet to see them credited to my account. Hotel is definitley a little dated/shabby but seemed clean and the staff was friendly. The indoor pool looked decent. We got a fairly good rate $99 which is pretty good for an airport hotel in the summer time. You CAN leave your car in the hotel parking lot while you are traveling at no additional cost, though there is no security, we were gone 5 days and came back to our SUV just as we left it. We hit breakfast before we left for the airport, nothing special, cereal, thawed bagels, frozen Jimmy Dean breakfast sandwiches and a waffle maker. Not as good as Residence Inn breakfasts. Airport shuttle was super easy to use, it leaves every half hour. Upon returning from our trip we called the Inn from the hotel courtesey kiosk and waited just 15 mintues until the very friendly shuttle driver picked us up, offered us some water and dropped us off right outside our car. Decent hotel, for the rate and convenience I would stay there again.", "Date": "July 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Friendly Staff and great servie”", "Author": "asd831", "ReviewID": "UR67419805", "Content": "My family & I came into the area for a graduation and stayed at this hotel for 1 night. Best service I ever rec'd! Staff was very helpful, much more alert than I was since we checked in very late at night. Breakfast was perfect and the rooms were just what we needed. I manage a small Inn in my hometown therefore I know what good service and quality rooms travelers look for. This place was excellent! I will be staying here next time I'm in the area.", "Date": "June 13, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Did not feel like a Marriott Brand”", "Author": "Wanman_007", "ReviewID": "UR61860599", "Content": "COME ON! MARRIOTT CAN DO BETTER THAN THIS. Someone is asleep at the wheel and Iâ€™m sure they are collecting a nice paycheck in the process. Why upgrade? Why stay current? Why replace old towels? Why have better furniture? Why use nice materials in the bathroom and shower/? Why have the room smell nice when you walk into your room? Why have decent bed linens or curtains? Why have decent Internet connectivity speeds? Why have automatic doors as you enter/exit the hotel with all your stuff? Why have a mini-fridge or microwave? Why have decent modern office chairs? This 10 year old office chair is just fine. I mean the color is horrible, and there are no adjustments, but it still works as intended. Letâ€™s just run this place into the ground and watch our clients go to one of dozens of nicer/newer hotels close by. This place needs to be remodeled and updated. I can describe the room dÃ©cor in a single wordâ€¦â€�Blahâ€�. The room smelled like a cheap hotel. The TV was made in 1998 (not thereâ€™s anything wrong with that). Who says you canâ€™t go back in time? Just step in the hotel room I received, and you will sent back in time by 12 years. There is a Ruby Tuesday within walking distance. The staff was friendly. I received a phone call checking to see if everything was okay. What am I supposed to say to this person? Where do I start? The last thing I want to do is switch rooms because of someone elseâ€™s apathy. Just keep your expectations low and you will be fine. Iâ€™m just sayinâ€™â€¦ Internet speed test to Atlanta 10:37pm Download Speed: 176 kbps (22 KB/sec transfer rate) Upload Speed: 208 kbps (26 KB/sec transfer rate)", "Date": "April 18, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Alaska", "Title": "“Near disaster!”", "Author": "panickingmother", "ReviewID": "UR59253273", "Content": "Prior to sending my daughter from Alaska back to college in Philadelphia after spring break I learned that her dorm would not be open until noon 3/21 and she would be arriving in Philadelphia just after midnight 3/21 so I booked a room for her at Fairfield Inn Marriott in Philadelphia. She had a layover on the way to Philadelphia in Chicago where it was snowing so her flight was delayed 2 hrs which would put her into Philadelphia at 2am. I called Fairfield Inn to inform them she would be arriving late and the girl that answered the phone asked her age. When I told her she was nieteen she said she couldn't stay. She said the minimum age was 21. I explained to her no one mentioned that when I booked the reservation and I even mentioned her age at that time. I aksed her to speak to a supervisor and she said there were none there at that hour of night and I have to contact the Marriott offic e which of course no one would be there either at midnight on a Sat night. She said there was nothing she could do and that my daughter could not stay there. After almost pleading with her I explaned she will be landing in Philadelphia at 2am and have no where to go. She put me on hold for awhile and finally agreed to take her. My daughter arrived at 2am and tried to use the courtesy phone for the shuttle and it was not working. After traveling 17 hours she was exhausted and had to call the hotel 3 times and wait for an hour and fifteen minutes on the curb for the shuttle. She finally was taken to the hotel at 3:30 am.", "Date": "March 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“Clean spacious rooms; great location!”", "Author": "Stacy17", "ReviewID": "UR46650368", "Content": "Our room was clean, spacious and quiet, and the hotel staff was friendly and accomodating. Rather than deal with city traffic and parking, we rode the hotel shuttle to the airport and took the train into Philly - very convenient.", "Date": "October 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Best staff ever!”", "Author": "olliemar", "ReviewID": "UR44419613", "Content": "I would recommend this hotel to all. The staff were excellent. Nicole and Danielle went out of their way to help us find our way around. The integrity of their staff is wonderful. We stayed here twice...before and after taking a cruise out of Philly. My friend left his watch under the pillow... he called after we had sailed. When we returned, they had kept the watch safe and returned it. I booked this hotel because I wanted airport shuttle, internet, pool, and breakfast. This one had it all!", "Date": "September 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Long Island", "Title": "“Nice stay until the end”", "Author": "funtimefamily", "ReviewID": "UR37499483", "Content": "The room was clean. We had requested a refrigerator, which was brought to our room, but was filthy and smelly. The manager came to our room and apologize and had it removed from our room immediately and replaced. She also adjusted our bill, which was a nice bonus. Unfortunately, the pool was overcrowded with early twenty somethings horsing around, which didn't allow for other children to enter the pool for fear of being hurt. Management came and had them get out of the pool for a while so the other children could go in the pool. The morning breakfast was very nice with make your own waffles. We were told we would be able to get breakfast on Sunday morning when we checked out even though breakfast didn't start until 7 and we needed to get something by 6:45. That day the girl working the breakfast knew we needed to eat and get out and on the road, but she made sure nothing was out until 7 and as she was setting up she was talking and joking to her coworker, who advised us she wasn't on the clock yet. The girl setting up refused to refill the hot water for tea, unlock the refrigerater so we could get yogurt or put some fruit out. This is all we wanted. She was rude and lazy and should not be in the hospitality business.", "Date": "August 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Pennsylvania", "Title": "“very nice stay”", "Author": "traveler0001966", "ReviewID": "UR36713071", "Content": "This Fairfield Inn was very clean and comfortable and the staff was friendly and helpful. Much nicer than many higher priced options in the area. Stayed there 2 years ago when flying from the nearby airport and returned when in the area for a family event because we were so pleased before. Only downside is that there is not much in the way of restaurant options in the immediate area but a number of places will deliver.", "Date": "August 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Smithtown, New York", "Title": "“Good airport hotel - close to sports complex”", "Author": "traveler24NewYork", "ReviewID": "UR36680179", "Content": "We stayed here for one night to see a show at the sports complex area. It is very close to the arenas. The hotel was clean and breakfast good. Some of the carpeting needed to be redone. Not brand new. There is a Ruby Tuesday's Restaurant across from the parking lot for those that do not have a car. Very average hotel.", "Date": "August 4, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "upstate New York", "Title": "“Good value”", "Author": "writergeek313", "ReviewID": "UR36149591", "Content": "I stayed at the Fairfield Inn Philadelphia Airport with two friends for one night earlier this month. We were looking for a basic place to stay for the first night of a long weekend trip, and since we were headed to Wilmington the next day, we wanted a hotel close to 95. There's definitely nothing fancy about this place, but it was extremely clean, and even though we had a room on the first floor, it was also very quiet. Be warned, though, that there's pretty much nothing nearby except other hotels and a Ruby Tuesday's. The Eastwick stop for the SEPTA commuter rail line is a level 10 minute walk away, though, and for $5 apiece we were in center city within 20 minutes. Our cab back from center city late that night was the same flat rate as a trip to the airport was, $28. Overall, a good basic hotel room that was conveniently located. I wouldn't have wanted to stay there for the whole trip, but it worked for a night. My friend who paid for the room did somehow get double charged, but it was taken care of within a day.", "Date": "July 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Racine, Wisconsin", "Title": "“Just OK”", "Author": "HugFairy", "ReviewID": "UR32893529", "Content": "I stayed here for two nights over a weekend. Check in went smoothly, staff was very nice. Above and beyond, printing me mapquest directions to places to eat. Room was nice and clean upon check in. But Sunday, the maid knocked in the door around 8:00 am. I was still in bed so I told her to come back later. I was gone from about 10:00 am until well after midnight. When I returned, my room had not been touched by maid service. Monday morning, I woke up early to go for a swim. The hot tub was chilly, nearly the same temperature of the pool. I returned to my room around 7:00 am dripping just in time to see the maid letting herself into my room. Nope, sorry, just swam and I need to shower. After showering, I went down for breakfast. Was good for a free continental breakfast. Checked out about 11:00 am. All in all an ok stay. I will also note there was no do not disturb sign in my room. I donâ€™t know weather the last guest just stole it or if theyâ€™re not in any rooms. But that would be one way to prevent the maids from waking people up early in the morning. I sent these comments via the Marriott website, got the automated message that it was being forwarded to the hotel. Never got a direct response.", "Date": "June 22, 2009"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Rooms": "1", "Value": "2", "Location": "4"}, "AuthorLocation": "Atlanta, GA", "Title": "“Trucks Trucks Trucks”", "Author": "DavidATL1", "ReviewID": "UR31545716", "Content": "Stayed here for a short overnight after a late flight. The rooms are fine and the shuttle driver was nice. But steer clear unless you want to listen to a chorus of trucks all night long. Try to turn on the fan to create some white noise? Forget about it - the fan would come on for a minute or two and then shut down. No matter what settings I tried. Noise insulation? Forget about it - or rather, the hotel designer forgot about it. Bottom line: If you're not sensitive to frequent blasts of noise from downshifting ttrucks at all hours, then you're fine. For the rest, try another Philadelphia airport hotel.", "Date": "June 4, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Location": "1", "Rooms": "1"}, "AuthorLocation": "San Diego, CA", "Title": "“Terrible Traffic Noise”", "Author": "unicorn123", "ReviewID": "UR30061518", "Content": "The road noise was terrible here- I don't know if the windows are gto thin, or its the angel of the building in relation to the street, but I could hardly sleep during my three night stay. Also, there are thin white window shades but no curtains. This means that I had to put up with street lamp light coming into my romm all night. The wfi-fi was of better speed than most other hotels Ive stayed at. I would never stay here again.", "Date": "May 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Wyncote PA", "Title": "“Worth it!”", "Author": "bkb4605", "ReviewID": "UR30047205", "Content": "My family and I had an early flight out of Philadelphia, so we decided to stay at a hotel the night before. We decided to stay at the Fairfield Inn after reading the reviews. I spoke to Jason at the front desk, who couldn't have been nicer! The room was on the 4th floor, was very clean and the beds were fine with lots of pillows and extra blankets. My kids really enjoyed the indoor pool with hottub! Transportation runs every half hour, which we arranged at check-in. The driver was their exactly at 4:30 am as promised. We had dinner at Ruby Tuesday's that is next door , which was also very nice. If I have to take another early flight I would stay at the Fairfield again!", "Date": "May 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“The Fairfield Inn was fantastic!!”", "Author": "DonnaLynnMaryland", "ReviewID": "UR21895742", "Content": "I stayed at the Fairfield Inn, with my 3 friends, last week and it was fantastic. The staff there could not have been more helpful. Our rooms were ready for early check-in, as requested and we were able to check in before going into the city. The rooms were very clean and the bathroom was huge. We were given the ajoining rooms that we asked for. The beds were very comfortable. The pool and hot tub looked very nice and clean, although we did not use them - we wished we had brought bathing suits, after seeing them. The hotel is in a very safe area and we felt safe there. It was very quiet considering the location very near the airport. Breakfast was perfect, with lots of choices of cereals, bagels, yogurt, Jimmy Dean sausage and egg biscuits, etc. - something for everyone's taste. The price of the hotel was very good for being so close to the city. It is about a half hour drive to the city and worth it not to have to pay the high prices that the hotels there cost. There are not a lot of restaurants nearby, except for a Ruby Tuesdays, which is within walking distance of the hotel. We found a restaurant in Drexel Hill PA, about 12 miles north. It is called J.B. Dawsons and I highly recommend it. We had a wonderful dinner there and very resonably priced. We loved the Fairfield Inn and would definitely go back there again!!", "Date": "November 16, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "S Wales", "Title": "“Another good experience - on the whole!”", "Author": "drc225", "ReviewID": "UR21406606", "Content": "Become a big of a regular here. Its the 5th time I've stayed in the last few months. Lets face it - this a budget hotel and I don't expect anything other than a clean comfortable room and high speed internet access. It provides this and more. The hotel looks and feels clean and well maintained. The rooms are clean, comfortable and everything works. The free internet access (wifi) works perfectly. Generally I find the staff friendly and helpful. The courtesy bus to & from the airport is prompt and efficient - when they don't 'forget' you called that is. This last trip was the 1st time this has happened and apparently the lady behind the desk failed to inform the shuttle driver I was waiting (the shuttle doesn't just come round - you have to call) so after 20 mins I called again and eventually (after 35mins wait) the shuttle appeared. To be fair they did apologise (after I complained to anyone who would listen) and give me a 'goody' bag - I'd rather not have waited though. So, my advice, if the shuttle isn't with you in 10 mins, call again and keep calling. The free breakfast is limited to cereals, bagels, other bits & juice and coffee but is perfectly adequate. Small gym with a jogger, two bikes and some free weights. Pool and spa. The Ruby Tuesdays just across the road provides a bar and menu for evening meals. Sure its a bit isolated (your choices without a car are Ruby Tuesdays or a restaurant in the nearby Courtyard apparently - haven't tried that) and I wouldn't want to spend days there but for an overnight at the start or end of trip it is fine. I'll be happily staying there again.", "Date": "October 30, 2008"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Maryland", "Title": "“Adequate, Friendly but not Worth It”", "Author": "Camalot50", "ReviewID": "UR20724795", "Content": "Four college girlfriends wanted a hotel close to Chester, Pa(Casino) Philly and Atlantic City. Using the Marriott's weekend getaway promotion, I was directed to the Fairfield Inn because they have suites. Upon arrival, there was no suite available eventhough my reservation clearly stated it. We decided to tough it out and check-in to a 2 QB room. The front desk staff was VERY friendly and understanding. The room, upon entering had an odor. We thought, ok, Freebreeze. We sat on the beds and thought we were on water beds. We quickly decided the room cost too much for what we were getting. Called around and the Embassy Suites had a vacancy. Fairfield allowed us to check out, for which I am greatful. We checked into a SUITE, for $20 more, but hot breakfasts for four were included. The suite had a separate sitting area with pull-out bed, microwave and fridge. Wonderful bedding and room decorated nicely. I would only stay at the Fairfield as a last resort. They need to upgrade bedding, lower their prices. Keep the hotel's Front Desk staff.", "Date": "October 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Avondale, AZ", "Title": "“Clean and Comfortable. Great for Simple Business Trip”", "Author": "seantells", "ReviewID": "UR16973806", "Content": "Fast pick up from the airport at even a busy time of day and travel season. The offer of a cold bottle of water on the shuttle bus was my first tip that this would be a good stay. Excellent, friendly and conversant staff. Clean, simple room. Well-stocked breakfast and attentive staff at the breakfast. Hotel was much more quiet than I thought it would be. An excellent stay and I will be back during my next several Philly stays.", "Date": "June 16, 2008"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“As good as a budget hotel gets”", "Author": "Eventfool", "ReviewID": "UR14411370", "Content": "The hotel room looked exactly like the photos one reviewer posted here. It was both clean and comfortable. The staff were friendly and the location was fine. I was in town for an event at the Wachovia Center which is much closer to the hotel than any description you read will admit to you. It was about 4 turns and then a straight ride to the arena around 10 minutes away. I would not recommend this hotel if you want the place you're staying at to be part of your entertainment, however if you want a safe convenient place to sleep after your day out this is great. The Ruby Tuesday across the parking lot wasn't good to me at all but since I was out all day it didn't matter.", "Date": "March 20, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Reasonable stay for business travelers”", "Author": "traveler122126", "ReviewID": "UR12800343", "Content": "On two recent stays, I found the rooms at the Fairfield Inn near the Philadelphia Airport to be clean, if slightly in need of updating. The complimentary airport shuttle was a nice amenity, and the front desk staff were friendly and helpful. While the regional train stops about a 10-minute walk from the hotel, the sidewalk is discontinuous. The shuttle driver was willing to drop me off at the station on his way to the airport, which I appreciated. I walked back from the station to the hotel when finished in center city - it was a feasible walk, but the discontinuous sidewalk and possibility of heavy traffic makes it a little less convenient than one might imagine. During my second stay, I had a rental car - it was a quick drive to the University of Pennsylvania from the hotel. If I visit Philadelphia again on business, I'll be pretty likely to stay here again.", "Date": "January 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Rooms perfect but breakfast horrible”", "Author": "Londinium", "ReviewID": "UR10580091", "Content": "I stayed 4 nights there (139$/night). The rooms are excellent, clean and you don't hear anything. When arriving on Fridays or Saturdays, they ask you to sign a paper stating that there is a \"no-party\" policy so that the rooms are quiet, this was perfect! The staff is really nice and polite, the area is quiet even if you are near the airport. There is a rail station just 10 minutes away from the hotel where the R1 takes you to the city in 15 minutes (see the photo). The hotel has a free shuttle to the airport. The breakfast is really not at a level of a Marriott! You eat in plastic plates with plastic knives and forks and plastic cups. It closes early during the week so make sure you awake in time! They have donuts, toast bread, Philadelphia cheese, some marmelade, strange sandwiches in a freezer that you need to put in the microwave (horrible taste!), be careful if you take yoghurt since some are frozen (it's normal apparently!). And Americans eat waffles in the morning with whipped cream! (We have this for dessert normally, no?!) If you are European and look for bread and croissants, this is not he place to go. Also, the breakfast room is very busy on weekends so go early to get a table. Accross the street, there is a Ruby Tuesday restaurant: cheap and really good good, go there in the evening. (anyway, there is nothing else in the area ...)", "Date": "November 4, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Diego,CA", "Title": "“Fairfield Inn is a great place”", "Author": "TravelFolks", "ReviewID": "UR10355693", "Content": "Just returned from 3 nights while seeing sights in Philadelphia. The train station is just a short walk away. If you are a senior you can show id and pay $1.00. What a deal. Hotel was quiet, breakfast was more than adequate, especially the waffles.", "Date": "October 26, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "North Idaho", "Title": "“Enjoy the Ride”", "Author": "GoGoLady", "ReviewID": "UR8229234", "Content": "Stayed at this hotel for 2 nights while seeing the sights and waiting for other families to fly in for a 2 week trip on the east coast. We found the staff to be friendly & helpful. The rooms were very nice and quiet for being so close to the airport. It is only a 10-15 minute drive to downtown and had easy access to and from the freeway. Would recommend for a short trip to anyone.", "Date": "July 24, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Rochester,NY", "Title": "“disappointed”", "Author": "RobertoTrees", "ReviewID": "UR8085253", "Content": "I found this hotel through tripadvisor, so I was disappointed when so many little things went wrong...the hot tub was not working the first night we arrived, plus we had to get sheets for the pull out bed ourselves. The next morning found us frustrated when one woman made all the waffles she wanted, using up the waffle mix. Upon returning to out hotel room that night, no bath soap was left in the bathroom. The next day we found that our door had not been closing all the way...luckily nothing was taken. For the $159 a night I expected a lot more. Some of the employees were very nice, others just putting in their time, just doing their job...", "Date": "July 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Norther California", "Title": "“Good Stay - Fairfield Inn Philadelphia”", "Author": "asmittyinca", "ReviewID": "UR8063483", "Content": "We stayed for two nights (July 27 & 28 2007)and found it to be a very comfortable hotel. It is not fancy, but very comfortable. I thought the beds were some of the most comfortable hotel beds I've ever been in. The rooms were clean and quiet and the staff was friendly and very helpful. We initially had a problem with our Air Conditioner. They had someone there and a new unit installed in 30 minutes and it worked fine after that. The continental breakfast was very good too. My only complaint was the pool area. The pool was not very clean and had some extremely loud and rude people in it, to the point where people with young children felt like they needed to leave. Since I didn't really care if I used the pool or not, that didn't bother me too much However, if I'd had young children there, it would have bothered me ALOT. All in all, I would recommend this hotel. We had a very nice stay there.", "Date": "July 5, 2007"}, {"Ratings": {"Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Wished I was at the Hampton Inn”", "Author": "pali27", "ReviewID": "UR7936753", "Content": "Stayed there one night while on a college trip with my son. The lobby reminded me of a nursing home. The staff was friendly. For the other single night stays of our trip we stayed in Hampton Inns. Because I read some good reviews of this hotel, I thought I'd try a Fairfield Inn just for variety. Not a good idea. All the beds in the Hampton Inns we stayed at were very comfortable. Here, the bed was too soft and hurt my back, and the sheets were thin: the kind that don't stay put on the mattress very well and never feel clean. Also in the Fairfield Inn there was no place to hang anything. For a budget chain the Hampton Inns were always comfortable, and seemed consistent. I was not comfortable here and when I saw the Hampton Inn next door from our window, I wished I was there. Luckily we were only here one night.", "Date": "June 19, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "pittsburgh, pa", "Title": "“Super Anniversary Trip”", "Author": "rickFPP", "ReviewID": "UR7849614", "Content": "my wife and i stayed at the Philadelpha Airport Fairfield Inn for our anniversary in June. We stayed two nights - midweek. the price was the main attraction - $133/night compared to $299 at the Marriott Hotel at the airport. we were very pleasantly surprised. The room was great with the all-new Fairfield bedding with ten (10) pillows on two very nice queen beds. the room had a safe and coffee maker along with a nice desk and chair and free high speed wireless internet. we took the shuttle to and from the airport and the driver dropped us off at the Eastwick station so that we could take the train into the city. I am very glad that we did not rent a car - it is just not necessary at this location. Ruby Tuesday (very good) is just across the street and open until 11:00pm on weekdays. The Fairfield breakfast was outstanding and the ladies working in the morning are exceptionally well prepared. Check in and Check out was flawless. I do not know what i would change about the Philadelphia Airport Fairfield Inn. Great Stay!!", "Date": "June 14, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Huddersfield, United Kingdom", "Title": "“Not very nice at all.”", "Author": "Billy Bird", "ReviewID": "UR7829867", "Content": "This is the most shocking hotel I've ever stayed in. I telephoned from the airport to book a shuttle bus and the receptionist was fairly rude and unhelpful. The rooms were not great, fairly grubby, but sort of comfortable. Breakfast was very limited, and you had to ask for everything: milk, plates, cream cheese, hot water. I was quite glad to leave, to be honest! The only good thing about my experience of the Fairfield was the driver of the shuttle bus, who was a really nice, friendly guy! There are plenty of other hotels close to the airport, I suggest trying one of those instead.", "Date": "June 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Gaithersburg, MD", "Title": "“Friendly and Clean”", "Author": "GingerBread05", "ReviewID": "UR7803336", "Content": "We stayed 2 nights over graduation weekend in May, 2007. I was so pleased with our stay at the Fairfield Inn near the Philadelphia Airport that I signed up with TripAdvisor just so I could write a review. The first good thing was that it was a Smoke-Free hotel and did not smell of stale cigarettes. Next, the three rooms we reserved were spacious, extremely clean with lots of pillows, and had comfortable beds. I liked the fact that they didn't use dirty old bedspreads, but instead used sheets and blankets that are easily laundered after each use. The other thing I liked was that the staff was extremely friendly. They were pleasant at check-in and called me later in my room to make sure everything was OK. At breakfast the next morning, the woman working the dining room had a smile on her face, was friendly, and very helpful. She kept everything stocked and very clean. Everyone working there seemed happy. They made our stay very pleasant.", "Date": "June 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Pittsburgh", "Title": "“Not a bad choice”", "Author": "mws215", "ReviewID": "UR7364098", "Content": "Stayed here for one night while traveling the northeast. The hotel was clean, the beds comfy. The staff was very friendly and seemed genuinely eager to please. As is was a weekend night, they asked us to sign a 'no party' agreement, which I thought was interesting.. As others have noted, however, the walls are thin- I could hear snatches of conversation from next door, and the picture above my bed rattled when kids ran in the halls or doors slammed. About what to expect from a Fairfield..but I give extra points for the staff.", "Date": "April 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Ohio", "Title": "“Great stay and great beds.”", "Author": "lrich255", "ReviewID": "UR7280030", "Content": "We needed a place for one night and this fit the bill. The beds are new and big with nice sheets. The room was clean and the property was nice. The pool was also nice. Ruby Tuesday's next door was the only food nearby but worked for us. Felt safe in the neighborhood. Towels could have been softer. Would stay here again on next trip to Philly.", "Date": "April 4, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Manhattan Beach, CA", "Title": "“Good hotel, mediocre service”", "Author": "gcgirl30", "ReviewID": "UR7230478", "Content": "I recently stayed at the Fairfield PHL airport based upon the reviews I read on Tripadvisor. As far as Fairfield Inns go, they are all pretty standard, with clean rooms, comfortable beds and adequate breakfasts. This one was no exception. However, the service at this Fairfield was the worst compared to other Fairfield Inns I've stayed at, including the one at Newark Airport. I arrived on a redeye flight, early Friday morning, and called the hotel to have the shuttle pick me up. The hotel clerk who answered the phone rudely informed me that check in was not until 3 and seemed put out that I would actually want to store my luggage there until I could check in. Nonetheless, she reluctantly agreed to send the shuttle, which arrived about 40 minutes later as I waited at the airport. To be fair, when I got to the hotel, the clerk invited me to partake in the breakfast buffet; however, she didn't blink an eye or even acknowledge me as I sat in the lobby waiting for an empty room to open up. It was only at about 10:30am that she finally said a room wouldn't be available until noon, at which point I decided to check my luggage with them and head out into the city. I checked in later that evening when I returned. However, as I lay in bed the following night, around 11pm, two other guests entered my room! The clerk (different from the one who checked me in) had checked them into my room and given them the key! To top it off, the clerk then called me in my room and said she had a \"dilemma\" and then asked me what my last name was. When I told her, she simply said \"thanks\" and hung up w/o apologizing! Needless to say, I won't hold this against the Fairfield chain as a whole, but I definitely won't be going back to this one!", "Date": "March 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Virginia", "Title": "“Fantastic Hotel, GREAT value!!!!!!! Would definitely return!!!!!”", "Author": "Suz4Hoos", "ReviewID": "UR7216158", "Content": "We stayed at this hotel for three nights in March 2007. We had a party of 7 people and had 2 rooms. Both were great! This hotel is very inexpensive, given it's location, but is worth every cent!! We were greeted by a VERY friendly desk clerk (in fact, all clerks at the desk were great!). Check-in went smothly and we checked into our very clean and comfortable room. We were assisted with directions for our various sightseeing activities, as well. The breakfast staff was very friendly, adn the breakfast was certainly sufficient for us all days we were there. There is also a Ruby Tuesday's directly acoss the street that will deliver to the room. This hotel is only about 15 minutes from downtown Philadelphia, well worth the short drive!!", "Date": "March 24, 2007"}], "HotelInfo": {"Name": "Fairfield Inn Philadelphia Airport", "HotelURL": "/ShowUserReviews-g60795-d102537-Reviews-Fairfield_Inn_Philadelphia_Airport-Philadelphia_Pennsylvania.html", "Price": "$126 - $236*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">8800 Bartram Ave.</span>, <span class=\"locality\"><span property=\"v:locality\">Philadelphia</span>, <span property=\"v:region\">PA</span> <span property=\"v:postal-code\">19153</span></span> </span> </span> </address>", "HotelID": "102537", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/48/ae/48aeb3e78bcca6f42fc33784bb448e318large.jpg"}}