{"Reviews": [{"Content": "Fantastic value for Tokyo This is one of the least expensive business hotels in Tokyo, with a very good location for Ueno station, park and museums. Rooms are a decent enough size, are very clean and offer free LAN connection. Rates are even lower over the weekend, if you book through the company's website.", "Date": "Nov 1, 2008", "ReviewID": "UR352085820", "Ratings": {"Service": "3", "Business service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "4"}, "Author": "hohoagogo"}, {"Content": "Great value for money The hotel is very nice and very cheap too. As for Tokyo standard, this hotel chain offers great value for money. Out hotel was a bit off the center but few steps away from metro and the great Ueno market and park.Room are super small, modern and well equiped. If you are looking for a Western size room don't go there, but if you are looking for an affordable place, clean, nice, cozy this is perfect for you. Breakfast was included, not that much variety, cubbage salad and boiled egg, coffe and tea.If you like to book it go on their site and you will see the other location.", "Date": "Aug 5, 2008", "ReviewID": "UR700230975", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "3"}, "Author": "Teotato"}, {"Content": "Brand new, money value, bring your LAN cable for free internet       Kinda atrium", "Date": "Jun 8, 2008", "ReviewID": "UR208100973", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "BEEPfromPARIS"}, {"Content": "Great value We stayed here for a week in early March 2008. It seems to be quite a difficult chain to find as there were no listings for this hotel on Trip Advisor - so we thought it was time to start one.I knew about it because I previously arranged a friend to stay at the HVF Shiodome in 2004 when I was in Tokyo for 3 months - that seemed newer and more classy but was also more expensive.Overall, we were quite pleased with our stay. The hotel is slightly older (perhaps 15 years) but is well maintained and clean. The rooms, as expected, are small - we stayed in a double room and had just enough room to unpack our backpacks btut not much else. The ensuite is also very small (like you'd find on a ship cabin) but also clean and had the usual high-tech toilet. We weren't expecting too much for about JPY8500 per night, so we weren't disappointed.The location: it's about 2 minutes walk from Shin-Okachimachi station (Oedo line) and perhaps half an hour walk from JR Ueno station. Transfers to the Yamanote line were easy - this line takes you to the main areas, Shinjuku, Shibuya, Harajuku, Roppongi, etc. To get to most of these areas takes perhaps 20 minutes to half an hour on the train but there are also plenty of restaurants, shops and what not near JR Ueno station.The hotel appears to be a budget business hotel; most of the guests were Japanese businessmen. There was free in-room laptop internet access (cable provided by the front desk) and a laundromat on the ground floor. As with everywhere else in Tokyo, convenience stores were everywhere so getting food/snacks etc was a cinch.Depending where you want to spend most of your time in Tokyo, it may not be the best location - as I said earlier we found it took 20-30 mintues to get most places we were interested in - but it certainly is good value and I don't mind taking the subway around because it is so easy and efficient. I would stay there again, given staying in the heart of Shinjuku is usually at least double the price.Although I haven't stayed at the Shiodome branch myself, I would suggest looking there if you want somewhere newer and more stylish.", "Date": "Apr 4, 2008", "ReviewID": "UR199953719", "Ratings": {"Service": "-1", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "3"}, "Author": "Spin_king"}, {"Content": "Hotel correcto       Habitaci贸n", "Date": "Dec 7, 2008", "ReviewID": "UR856406264", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "3"}, "Author": "Toniton"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g1066461-d1028947-r21445428-Hotel_Villa_Fontaine_Ueno-Taito_Tokyo_Tokyo_Prefecture_Kanto.html", "HotelID": "1028947", "Price": "Unkonwn"}}