{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Portland, Oregon", "Title": "“BEDBUGS - stay away! Memphis Hampton Inn.”", "Author": "wegougo", "ReviewID": "UR124343546", "Content": "The Hampton Inn Southwind at Hacks Cross Road has bedbugs. A group of work buddies stayed there this week and found the bugs all over the room and themselves. They had to throw away everything - clothes, luggage, make up - all of it. They even took pictures of the bugs, they were huge! Management at the Hampton Inn did not seem surprised when informed of the bugs - they did comp the room but no way that will cover the cost of the infested items or the terrible experience. DO NOT STAY HERE. BEDBUGS EVERYWHERE!", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dallas, tx", "Title": "“It's OK for an overnight stay”", "Author": "busyDsweetness", "ReviewID": "UR121574826", "Content": "This facility could use a little updating. The carpets are worn and my heater did not work well. On the plus side, the breakfast was nice and the staff is very warm and welcoming. Thebed was nice and the towels were nice.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Cool,CA", "Title": "“Great customer service... But!”", "Author": "Travelimmersion", "ReviewID": "UR119966014", "Content": "Arrived for an extended 3 week stay and we were very pleased with the front desk and ease of check-in. However, had to change rooms 3 times for various reasons before settling into room 300. Last room, end of hall. The major problem we had was housekeeping, which was very very lacking. Management always responded quickly and apologized, but day after day of nothing but clean towels became a common event. The next problem we had was that almost every weekend the hotel is fully booked with kids soccer teams. The lack of control of these hundreds of kids running and screaming thru the halls and stair wells aggravated us for 3 days each week. Plus the location of our room, we had the ice machine directly outside our door. 6 A.M. Saturday and Sunday mornings, parents and coaches began filling their Ice chests for the day. It was very irritating to be woken up that early 2 days a week. Joey, the general manager, and all the front staff are amazing and willing to help in any way. However, if I was planning on stating thru a weekend and was not playing soccer.... I would ask if there was a tournament that weekend. It's mayhem... Honestly!", "Date": "October 31, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Tucson", "Title": "“Loved This Place”", "Author": "James12345Tucson", "ReviewID": "UR116868572", "Content": "We stayed one night traveling through and it was fantastic. The gentleman at the front desk was very welcoming and helpful (I think his name was Michael). He directed us to a very good BBQ restaurant called Neely's just down the street. He printed out directions for us and was very helpful. The continental breakfast was amazing. Excellent presentation...I was almost afraid to mess it up it looked so clean! I think the lady that stocked it was Dorothy...she was very nice! All of the breakfast items were laid out and there were a ton of choices. The Bagels with Eggs/Cheese/Bacon were amazing! We stayed at a half dozen hotels on our road trip, and this by far was our favorite! It was in a very nice location in Memphis. Area seemed very safe and was right across the street from FedEx headquarters.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Belton, Missouri", "Title": "“Nice hotel”", "Author": "wanderingwonders", "ReviewID": "UR112479321", "Content": "The staff was friendly, the hotel was clean and the location was great. Lots of resturaunts within a short walk. We stayed here twice once at the beginning of the trip and once as we were headed home almost a month later. The girl at the desk remembered us. That is always a pleasant happening.", "Date": "June 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Eleuthera", "Title": "“NO complaints; Very Satisfied!”", "Author": "LEOAviator", "ReviewID": "UR92379444", "Content": "Passing through Memphis, we stayed for one night. Very convenient location. Reservation was easily made, our king suite was well appointed, very clean (including all bed linens), and the bed was comfortable, providing a very good rest. Wonderful breakfast selections (hot and cold healthy selections), and staff was great! Thank you for a very nice experience!", "Date": "January 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Soccer Tournament in Memphis/Mike Rose Soccer Complex”", "Author": "elcid89tn", "ReviewID": "UR91293366", "Content": "Great location for a soccer tournament at the Mike Rose Soccer Complex. It is close to the complex, near a sporting goods store, supermarkets, and places to eat. The eating area is very open - easy to eat breakfast in or to share pizza with the team on a Friday or Saturday night.", "Date": "January 1, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Erroneously charged for movie and they would not remove the charge”", "Author": "KYCPA", "ReviewID": "UR89086336", "Content": "They charged us for a movie on our checkout bill so I went to the front desk and she would not take the charge off. We checked in at 10:08pm after a 6 hour drive and had to get up the next morning for a soccer tournament yet we supposedly ordered a movie at 11:28pm when we were asleep. Management was not available so I called a corporate number where they transferred me to guest services to file my complaint. This location has 72 hours to respond. I will keep you posted.", "Date": "December 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "St. Louis, MO", "Title": "“Great Customer Service!”", "Author": "STLLadee", "ReviewID": "UR26640405", "Content": "I took my daughter for a quick visit to Memphis and I chose this hotel b/c it was the cheapest with the best reviews. I was surprised how nice the staff was. The manager Sam was great. I loved the fact there are 3 restuarants within walking distance. Also there is a Marshall's about a block away and a Walgreens about a mile up the street. Very convience location next to the highway and 10 mins from downtown.", "Date": "March 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manitoba", "Title": "“Good Clean Hotel”", "Author": "AC_A340", "ReviewID": "UR24420396", "Content": "Company booked the hotel for me. Good hotel, lots of retaurants within walking distance. Rooms slightly small, but clean and comfy. Excellent breakfast every morning. The only think I would have liked to have seen would be a mini fridge in the room, would liked to have had cold drinks in room every day. That's the only downfall. Highly recommend if you need a hotel in this area.", "Date": "February 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Metro Atlanta", "Title": "“Very Pleased”", "Author": "Carla390", "ReviewID": "UR17640627", "Content": "We were in town for seven days for my son's AAU Basketball tournament. In an effort to save money we stayed at another hotel chain up the street for half of our weeklong visit and used our \"reward points\" at both locations. This hotel was great. I think since it is directly across the street from the main entrance for Fedex World Headquarters provides an incentive to stay at the top of their game. The decor was very nice in color and quality. Dark woods with a soft lime green. The sofa and chairs looked brand new and good quality for a hotel. It has a rather large lobby/breakfast area and good spacing of tables/sofa/chairs with a large plasma tv. We were a party of four and and were dying for some add'l space after being cramped with the kids in a standarded double room with one tv and no fridge at the previous hotel. We were allowed us to use our points, however they charged us $15 extra a night to get the suite with the pull out sofabed, fridge, microwave, ceiling fan and two tv's....perfect. It was worth it. We looked at a total of three rooms. First floor was right by the pool, uh, no. The second room had two chairs in the front room instead of the sofabed, again we passed on that. The third room was just right. Breakfast consisted of the 5 types of boxed cereals, various juices/coffee/tea, breads for toasting, 4 types of muffins, fresh fruit, grits/oatmeal, cut up fruit medley, hot biscuits, and hot food that changed daily like Belgian waffles & beef sauage one day, eggs w/ patty or linked sausage another. The staff was wonderful. Always a good morning and smiles. They allowed us to use the meeting room for a team meeting at no add'l cost. None of our other players even stayed at the hotel. They opened the room and asked if we wanted it rearranged and even got me a blanket since it was freezing in there. Internet connection is free in the room and their Business Center, which was great since my son was taking an online summer school class. We did see security in the evening in the parking lot. Right behind our hotel was their other property Homewood Suites. You can use their grill and basketball hoop. There are alot of resturants in the area...Outback, Logan's Roadhouse, TGI Friday's. Beware going too far south of Hwy 385 on Winchester, it is seedy down there. For your typical shopping/eating go over and south on, I think it's, Poplar Ave.", "Date": "July 8, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Not Really Sure”", "Author": "WI036", "ReviewID": "UR17122272", "Content": "Arrived at the Hampton on June 20th and was staying for 4 nights. I am a hilton baby so to speak, i always try and stay at hilton properties whenever possible. I am not too picky when it comes to room, so as long as it is clean, quiet and convenient. I was given room 114 (apparently, my profile at hilton.com which states my preferences and my diamond level did not play into their room selection this time around)... i was on the ground floor, by the back entrance, right by the outdoor pool - people walking by would see inside my room if i left my blinds open, hence they were closed the entire time, the heat in memphis (86 degrees farenheit) kept the a/c on and the compressor sounded like thunder whenever it kicked on. Needless to say, i did not get much sleep all four nights... between the poolside guest who never seem to sleep and the back door in constant use, not to mention the a/c noise, it was not a good experience rest-wise! Other than those inconveniences it seemed like a decent hotel, the lobby was clean, free breakfasts every morning, free internet service in my room, the grounds were kept clean, the room was clean and spacious (see pictures). When i went to checkout and was asked about my stay, i reluctantly told the hostess that it wasn't really a pleasant one, but i was there on business so whatever... but she apologized and proceeded to take a night off the bill ($150 in all). If i stay there again, which i doubt, i will not be staying in room 114 or on the ground floor for that matter!!!", "Date": "June 22, 2008"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Huntsville, Alabama", "Title": "“Great Stay - Great Deal”", "Author": "ragwag", "ReviewID": "UR4412492", "Content": "We stayed for 2 nights (Fri & Sat) at this very nice Hampton Inn. I'm the first to admit that I'm a hotel snob, and I sometimes avoid staying at Hampton Inns because of some past negative experiences. However, After hearing that this was a nice property, I booked five rooms, one for my family plus 4 other families (soccer friends). I found a great $79 per night deal on www.hilton.com (the 'hit the road' special). Each room had 2 queen beds plus a small table with 2 chairs. High speed internet was available in each room also. The rooms were tastefully decorated, and it appeared that everything was very clean! The tub area had white tile on the walls, and I did not see any mildew (a real turn-off for me). The breakfast is free with the room. Each day there was a good choice of breakfast food: sausage, eggs, biscuits, yogurt, cereals, bagels, pastries, and a variety of beverages. The property appears to be fairly new, and it is close to shopping and restaurants. All of the families for which I booked rooms were very pleased with the accomodations. At $79 per night it's the best deal I've seen for a hotel room in a while I would definitely recommend this property.", "Date": "February 3, 2006"}], "HotelInfo": {"Name": "Hampton Inn Memphis - Southwind", "HotelURL": "/ShowUserReviews-g55197-d105177-Reviews-Hampton_Inn_Memphis_Southwind-Memphis_Tennessee.html", "Price": "$78 - $126*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3579 Hacks Cross Road</span>, <span class=\"locality\"><span property=\"v:locality\">Memphis</span>, <span property=\"v:region\">TN</span> <span property=\"v:postal-code\">38125</span></span> </span> </span> </address>", "HotelID": "105177", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/27/d3/27d35c6dbc00e8cdd688bf9ebcefad8c4large.jpg"}}