{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Altoona, Pennsylvania", "Title": "“Stunned”", "Author": "Tiffany G", "ReviewID": "UR138700135", "Content": "I can not believe all the good ratings for this hotel. The hotel was nasty. The bathroom consist of a small standing shower, even for my father who is fairly skinny it was a tight squeeze. The toliet was right against the bathroom entrance door. Almost all of our towels was stained to a very gross degree. The sink was in the bedroom area, which was held up by two wooden boards. The bed sheets were stained, we ALL slept on top of the comforters. The room was run down and dirty. Not to mention I have never stayed in a hotel down in Ocean City where the seagulls were so loud. The stairs leading up to our room were dirty and there were dead bugs all over them. Honestly if all the other hotels in decent price range hadn't been booked solid, we would have left to another hotel. It was an okay hotel to grab a few z's and a quick shower that night, but I would never rent a room at this hotel again... You couldn't pay me enough to stay here again.The only positives I can list are I have worked at a hotel in my past, so I know what to look for when it comes to bed bugs, which I did once I saw how nasty our rooms were, I did NOT see any signs of bedbugs in the room we were in. Also, the front desk was polite.", "Date": "August 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Williamsport, Maryland, United States", "Title": "“Good room, great service”", "Author": "Becca R", "ReviewID": "UR138463863", "Content": "We ended up at this hotel after another \"lost our reservation\". We walked in off the street and were immediately greeted. The front desk told us exactly where the room was. We had a ocean front room. While the room was small it was very clean.", "Date": "August 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Great location, better than expected..”", "Author": "LuVx2xTravel", "ReviewID": "UR137316854", "Content": "I was looking for a last minute hotel for a mini week get away. I wanted to stay on the boardwalk, yet most places were either booked or much more than I was looking spend. A friend of mine suggested the Shoreham, said she knew of a few people that stay there every year. After reading the reviews, I was a little hesitant. I looked at several other hotels, motels, and condos, And finally just decided to take a chance and book at the Shoreham. I booked king oceanfront room. I prepared myself for the possibility of a complete dive, as many boardwalk hotels are. But I must say, I wasn't disappointed. The location could not have been better. We had arrived early and were able to check in by 10:30 am. The parking lot is small and secure, right behind the hotel. We had a 3rd floor, side front room, so there were two windows in the front, one on the side, and one in the bathroom. All from which you can see the boardwalk and the ocean. The room was clean and bright. There was a window AC unit, which worked very well, small refrigerator w/small freezer, TV , closet, just your basics. A simple room is all we needed. We are never ones to spend our vacation in the room for longer than we need to be. The staff were very friendly and helpful. The bar beneath the hotel has great food and drink. When heading out at night, we could hear the noise from the restaurant on the first floor, but the boardwalk is a busy place, it's part of the excitement of staying on the boardwalk. There were a few cons, the biggest one was the stairs.. I'm an active person, but carrying the luggage up was a task, otherwise stairs don't bother me much. Other cons, the comforters are definitely outdated, the floors are a little slanted, no coffee maker, and the power went out while using my hair dryer (called the front desk and they corrected the problem quickly). Overall, however, the pros outweigh the cons. Bottom line is, if you are looking for an affordable, clean, simple place on the boardwalk, the Shoreham is a great place to consider. If you are looking for frills and luxury, this is not for you.", "Date": "August 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Waynesboro, Pennsylvania", "Title": "“Great Room , Great Location”", "Author": "Ted Z", "ReviewID": "UR134201432", "Content": "Stayed here as a result of A/C problems at a friends condo. Last minute, could not have asked for a cleaner, nicer hotel to stay in. We don't need all the extras that other hotels charge you for that you don't use anyways. Clean quiet room, excellent A/C and right on the boardwalk. Only thing they could have provided was a small table to go with the two chairs they provide, but thats just nick picking, Will definetly look at staying here again.", "Date": "July 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bensalem, Pennsylvania", "Title": "“Great place to stay”", "Author": "Amy B", "ReviewID": "UR132442079", "Content": "I found the Shoreham Hotel on Tripadvisor. May other hotels I saw were charging upwards of $225 a night. We didn't plan on spending much time in our room and The Shoreham worked out great for our long weekend getaway. The Shoreham staff was friendly, especially the overnight guy and the afternoon woman. Our room was clean and comfortable. We had a queen bed on the second floor. Yes, the first floor could hear the music from the bar below but it was just us- no kids- so no big deal if we stayed there. The bathroom was clean and stocked with soaps and plenty of nicely arranged towels. If you are a larger person you may have some trouble feeling comfortable in the stall shower. We checked the room for uninvited pests before bringing or bags in and were very happy to find no evidence at all. Ice machine and Coke vending machine on the first floor. Small refrigerator in room quieted right down after it ran alittle while. AC unit in window and ceiling fan make for comfortable tempertures. You will be going up and down steps. Parking space provided around back. This is a no frills room. GREAT RATE and perfect boardwalk location. Coupon books in the lobby, nice coffee shop around the corner, cleaning ladies at 9am. We will definetly come back again. Sleep, shower, and go!", "Date": "June 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mechanicsburg, Pennsylvania", "Title": "“Coming back every year.”", "Author": "Eric1284", "ReviewID": "UR123026740", "Content": "My girlfriend and I went here in August 2011, and just fell in love with the place. We didn't have an alarm clock, but that's ok, because we had out phones instead. The room in which we stayed was perfect for us, and we are going to request that room every year. Just note that if you don't like hearing loud music, don't stay on the first floor, because Shenanigan's is right underneath. The people were all real friendly, and they all hold the door open for you while you're trying to get your luggage in or out. This was the first place we booked together, and the experience was real easy. And they accommodate for military discounts as well. It's right along the boardwalk, and everything you need, is with in walking distance.", "Date": "January 13, 2012"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Manassas, Virginia", "Title": "“Shoeham Hotel Ocean City MD”", "Author": "73cuda", "ReviewID": "UR118174351", "Content": "Went for two dayswith Grandma and grand kids. Had a good time. Rooms were okay but didnt like walking through the front desk as the only way in. Would go there again. Staff was friendly and rooms were clean.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Edgewood, Maryland", "Title": "“Right in the middle of the action”", "Author": "chickiebabie", "ReviewID": "UR117009899", "Content": "My boyfriend and I stayed here for the weekend and had a great time. We had an oceanfront room and the view was great. We stayed on the third floor which was perfect however, the stairs were a little annoying to climb so much. On the first night we turned off the a/c and just opened the window. The breeze was great but it was a bit noisy due to the restaurant Shennigan's and the boardwalk right below us. We decided to just keep the a/c on after that. Speaking of Shennigan's I would recommend going there the food is good. I really can't understand why there are any bad reviews of this place. You can't beat the price any where on the boardwalk. If you are looking for alot of ammenties this isn't the place for you, but if you are looking for a nice place to sleep on the boardwalk then this is the place to stay. Overall it was a great stay and we will definitely be back.", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Richmond, Virginia", "Title": "“Awful! Stay away!”", "Author": "ilovemeep", "ReviewID": "UR116326046", "Content": "Worst stay ever! Room smelled like smoke and the room's floor was slanted. Make sure you ask for the receipt after they swipe your card!! They charge it more than they say the do! The manager was rude when confronted about the situation.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Uniontown, Pennsylvania", "Title": "“Honeymoon”", "Author": "chriskelly73011", "ReviewID": "UR116235822", "Content": "My husband and I called on our way to the beach to see if they had any rooms.. they were very helpful and got us a room. Oceanfront.. Very clean and nice. The location was AWESOME ! Would love to stay their again.. The employees were very friendly.. Made you feel at home.. Thanks for a great stay.. The Huey's", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Arnold, Maryland", "Title": "“Location, location, location!”", "Author": "formersquidjar", "ReviewID": "UR115919414", "Content": "Pros: great location, the price was relatively cheap compared to other ocean front hotels; the attached restaurant was great; Ryan at the front desk was entertaining, the cleaning staff was very helpful Cons: it took at least 5 phone calls over a week to this hotel before they finally returned my call to book a room; although the bathroom was clean, it was very small; a friend also visiting Ocean City left 2 messages for me at the hotel which I never received (not surprising since they didn't returned my calls to book a room) In addition, don't complain that they don't have balconies after you get there because if you check out their website, it is obvious in the picture that they don't have balconies. This is a great hotel for the price. I will be returning there next year if they return my calls.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Laurel, Maryland", "Title": "“Love This Place”", "Author": "XiloQ", "ReviewID": "UR115504335", "Content": "I Stayed At This Hotel For A Weekend And I Have No Complaints. Truth Is This Is Not A 5 Star Hotel Or Super Luxurious But If You Trying To Have A Great Time On A Budget This Is The Place For You. The Hotel Staff Is Really Nice. House Keeping Excellent And The Location Unbeatable!! Right In The Middle Of The Boardwalk!!!!! The Room Was Big Enough For The 4 Of Us And The Beds Clean And Comfortable My Only Complaint (If You Want To Call It Like That) Will Be That The Shower Is Too Tiny And You Barely Have Space To Move. Also The Water Kept Changing Temperature By ItSelf. And We Couldnt Really Get Some Good Sleep Because We Were On The First Floor OnTop Of The Irish Pub/Bar And You Can Hear The Music And Drunk People Screaming And Everything... OVERALL Was A Great Experience That Didnt Really Hurt My Pocket Or Wallet , I Will Definetly Recomend This Hotel To All My Friends. TIP: If You Are Not A Good Friend Of Noisy Nights Stay As Far Away Of The 1st Floor As Possible! The Rooms Are On Top Of The Bar And You Can Actually Hear EVERYTHING And They Close Untill 2AM.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Point Marion, Pennsylvania", "Title": "“loved it,and going to stay this year”", "Author": "ritchie68", "ReviewID": "UR111512731", "Content": "the shoreham is a great place to stay if you have to vaction on a budget. i have stayed in other hotel's and payed alot more.this is a great way to vaction and still have money to spend.this will be my third time at the shoreham and i am looking forward to my stay.", "Date": "June 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Lancaster, Pennsylvania", "Title": "“Horrible customer service, HUGE RED FLAGS JUST IN TRYING TO BOOK”", "Author": "hippiehearts", "ReviewID": "UR103795546", "Content": "I called the hotel (same number each time) a total of THREE times over a WEEK AND A HALF period, leaving three separate messages. I have a public relations background so needless to say in each message I made very clear what I was looking to book and REPEATED MY PHONE NUMBER AND NAME AT LEAST TWO TIMES. Finally after the last message which made clear that I would at least appreciate a call back (always in a polite manner), someone finally called me back. By this time I had made other arrangements for our group of 8 (their loss) to stay at another hotel. The person calling me seemed perturbed, and said that she didn't have my phone number at all,,,,,upon her saying that I said well how did you call me back then? She seemed to quickly notice her mistake and correct herself saying well this is the only message I got. I told her of the three messages I left all including my contact information and even what we were looking for, although she said \"sorry,\" she basically insinuated more than once that I was lying and that she or the hotel had received no such messages. HUGEEEE RED FLAGS and BADDDD customer service!!! Take it from me, if a hotel CANNOT CALL BACK SOMEONE LOOKING TO ACTUALLY BOOK (not just inquire about pricing) A PARTY OF 8 that is not a good sign, especially after leaving multiple messages. In addition if the person from the hotel THEN ACCUSES THE POTENTIAL CUSTOMER OF LYING, that is again not at all a good sign and doesn't reflect the hotel or their customer service well at all. Those are HUGGGEEEE RED FLAGS and this is before even staying there so I can only imagine what the rest of the experience would have been like had we booked. Judging by that experience, I would recommend staying away, and I will definitely be passing the word around of my experienc.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Bethlehem, Pennsylvania", "Title": "“Ok rooms, Excellent location”", "Author": "bsslegel", "ReviewID": "UR86736895", "Content": "My wife and I have stayed at the Shoreham for years and, while the rooms might not be the best, you can't beat the location! Everytime we stay there, it's a running joke as far as what kind of room are we going to get this year! The hotel was built in 1922 and, due to the years of ocean weather, it has certainly seen better days. The floors are so unlevel that, if you set a ball on the floor, it would roll in all directions. Sometimes the bathrooms are a little worn and the beds aren't the best. If you're staying on the 3rd floor, the lack of an elevator makes it difficult to carry your luggage to your room. All this being said, the staff is friendly and you just can't find a better location to stay on the boardwalk. It's right in the middle of everything! How much time are you going to spend in the room anyway? The rooms are inexpensive, so why would you expect 5 star service? The restaurant, Shennanigan's, has great food, too!", "Date": "November 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Laurel, MD", "Title": "“Badly in need of an update: structure, cleaning, etc.”", "Author": "krismsulli", "ReviewID": "UR78916967", "Content": "My husband and I stayed at the Shoreham during our first trip to Ocean City and Assateague. I love older, locally-owned places and gave this place a try despite mixed reviews. Here are my own... Pros: The staff were all friendly, and the woman who booked my reservation by phone was really nice, answering a bunch of questions. There is a typical Irish pub below the hotel; I was afraid it would be noisy and it wasn't. The food and service there were pretty good. The location is great - right on the boardwalk near several restaurants/bars/stores/the beach, etc. Cons: This place is need of some serious renovation and upkeep! The decor is lacking, but that's nothing too major. The floors, however, are slanted enough that I was seriously concerned about the building's structure. The mini fridge didn't work and smelled awful. The bathroom was TINY! and the shower only trickled. The bathroom door didn't shut well. There were no curtains - only cheap slatted blinds - on the windows, so the east-facing room was incredibly bright in the morning. The walls are very thin so we could hear neighbors easily. Housekeeping never came (we were there for two nights). The remote control didn't work. There were stains on some of the furniture. And worst of all, we paid extra for an ocean-front room that was 1. obscured in part by a roof below us and 2. totally not worth it - I was picturing a balcony, or at least a window that opened up so I could feel the breeze. The window opened only a few inches, and we were so on top of the boardwalk people just stared in when the blinds were drawn anyway. Do NOT bother paying more for oceanfront!! The building's entrance is on the side, in a parking log. It's near the staff entrance of the Irish pub - so you walk in amid a parking lot, garbage, and people hanging out smoking. Also, I was told there's a public pool across the street. I'm not sure if it's technically public - it has a public entrance because it's adjacent to a bar that's open to the public - but it's part of another hotel! If this were a hostel I would think it was alright - but for a proper hotel, for the price, I will not stay there again and would not recommend it to friends/family.", "Date": "September 9, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "cumberland, md", "Title": "“not the worst but not the best”", "Author": "alison d", "ReviewID": "UR75662669", "Content": "hey there. i stayed here with just my husband last year during bike week. we were kinda doing a second short honeymoon before my second child was born..the hotel has a great location. and for the price we couldnt beat that...not during bike week at least. but if you are looking for a nice hotel with a view and elevator et cetera this isnt the place. the staff was very nice. they accomadated my husband since he is a smoker. they let him smoke in the room as long as the window was open.walking up all them stairs when you are pregnant not fun but its def. good exercise..would i stay there again??yeah but not with my kids. i have two young ones and carrying them up all the steps forget it. but if you are looking for a cheap stay for only two nights and then its your place. the only downfall was because it was bike week you could hear them revving their engines to almost 3am in the morning...the noise factor kinda sucked but minus that the rest of the hotel wasnt bad", "Date": "August 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“had an amazing vacation...”", "Author": "edithmeli", "ReviewID": "UR73740625", "Content": "to begin with the hotel was located on the boardwalk!! We had an oceanfront room so we could see everything! the rooms were very clean as was the whole hotel! not to mention how CHEAP it was! customer service was very nice! Like I said before we had an oceanfront room so it was pretty big! LOVED our stay at shoreham and definitely planning to stay again !", "Date": "August 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gettysburg, Pennsylvania", "Title": "“Pleased with our stay at Shoreham!”", "Author": "SandySt", "ReviewID": "UR73254120", "Content": "We have been staying here for several years now. I have had very good customer service. Angel, the manager is awesome! The rooms are clean. It is right where all the action is, and GREAT prices! Thanks to all for great customer service!!", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gettysburg, Pennsylvania", "Title": "“our stay at the shoreham”", "Author": "mommaw05", "ReviewID": "UR72794911", "Content": "it is right on the boardwalk where all the action is. everyone that works there is very kind and friendly.the rooms are clean.", "Date": "July 28, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Great place, service, and friendly staff”", "Author": "Bigfishdaddio", "ReviewID": "UR71377338", "Content": "I have read some of the other reviews and I have not witnessed any of the accused wrong doings. I have been staying at this hotel for my family vacations for three years in a row, the rooms are clean, the staff is exceptionally friendly, and the price is good for the location. Don't let the bad reviews discourage you from staying here. Take my word you will not be dissapointed with this place. I have and I will continue to recommend this hotel no matter what people post on these reviews", "Date": "July 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Pasadena, Maryland", "Title": "“Great Location and Affordable”", "Author": "dafisher72", "ReviewID": "UR68976671", "Content": "My husband and I searched for rooms for 4 teeneagers and ourselves. Shorham was the best price. The morning of our trip I read a couple of bad reviews and was very concerned about the cleaniless of the hotel. I had the kids pack their own pillows and blankets, and brought cleansers just in case. We had 3 rooms- two were combined, both with their own bathrroms and a third room next to the others. The hotel is old yes, but was very clean! The staff including housekeeping and the front desk were extremly nice and helpful to both the adults and the teenagers. I was pleasantly suprised that there was no sand anywhere in the hotel! Each room has it's own AC unit, and mini fridge. The soda's in the machines are only $1! I think the boys drank their weight in Mountain Dew! My only complanit is that the 3rd room we had was (1) queen bed and the shower was a bit small. Other than that I highly recommend this hotel for anyone with kids who want easy access to the boardwalk, beach and restaurants. They do have a NO VISITOR policy, which I actually liked. This prevents anyone from walking in the hotel and from packing 10 people in a small room to have a party. Oh, the parking was perfect as well!", "Date": "June 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Ocean City, Maryland", "Title": "“Horrible!”", "Author": "LAlyce", "ReviewID": "UR68021449", "Content": "Our stay at the Shoreham Hotel was HORRIBLE! This hotel may be cheap, yes. And it is on the boardwalk, yes. However, the rooms are dirty, the employees (including the manager) are rude and unhelpful, and their business practices are unfair. I would rather pay the extra money and get a nicer hotel, also on the boardwalk or close by, so that I may enjoy a clean, friendly hotel. There was food and sand on our carpet flooring in the room when we first checked in and our fire alarm was hanging out of the wall by its wires. The hotel \"didn't remember\" that we put down a deposit on our room (required) and the manager refused to help us. The employees surf Facebook all day and give you attitude if you ask for directions, help, have questions, etc. Again, I WOULD NOT recommend this hotel to even my greatest enemy. I will never stay here again.", "Date": "June 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Pasadena, Maryland", "Title": "“it was awful”", "Author": "freshcpl", "ReviewID": "UR67128223", "Content": "we had 2 couples and children we also met up with other friends and family first when we went to check in i noticed on our paper work it said you could not have any company in your room and when we went to go up to go get some rest myself and my friend went up first with the children our other halves tryed to come in 20 mins later and the gentalmen told them it was to many people in the room but we had already told the ladie that checked us in how many of us it was but my opinion is it was because they were black and we were white because we all had been in and out that hotel all day with no problems then when we went to pull the sheets back there were dirty underware sticking out between the boxspring and mattress not to mention the bathroom sink was being held up with a 2x4 this was my first ever ocean visit it turn out not so well because of this hotel", "Date": "June 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Pennsylvania", "Title": "“Great Hotel, Great Location”", "Author": "waltermdd", "ReviewID": "UR35026269", "Content": "We enjoyed our stay at the Shoreham and don't feel as though it deserves the poor reviews it has been given. It is at an excellent location and has a very friendly staff. We were happily suprised to find that each room had a small fridge. The room temperature was so comfortable (even though it was hot outside) that for two of the nights we were there, we turned off the air conditioner and just used the ceiling fan.", "Date": "July 17, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Maryland", "Title": "“Not the best but tolerable”", "Author": "ihatedopes", "ReviewID": "UR33801334", "Content": "No elevator, which is ok if you are staying on the 2nd floor, but not so good if you're staying on the 3rd or 4th. This hotel is on the boardwalk, but the outdoor bar and grill actually sits on the boardwalk so the actual rooms do not have a view of anything except the next building. Entrance in the rear, where the \"kitchen crew\" hangs out the back door, and that's feels a bit uncomfortable.", "Date": "July 3, 2009"}], "HotelInfo": {"Name": "Shoreham Hotel", "HotelURL": "/ShowUserReviews-g41298-d1056571-Reviews-Shoreham_Hotel-Ocean_City_Maryland.html", "Price": "0", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">309 N Atlantic Ave</span>, <span class=\"locality\"><span property=\"v:locality\">Ocean City</span>, <span property=\"v:region\">MD</span> <span property=\"v:postal-code\">21842</span></span> </span></span></address>", "HotelID": "1056571", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/b6/20/49/the-boardwalk-side-of.jpg"}}