{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Mississauga, Canada", "Title": "“Ok, for the price”", "Author": "RifatAtes", "ReviewID": "UR122078497", "Content": "This hotel is pretty old and low quality. For the price it is ok to stay here. The reception area is nice but the rooms are low standard. The receptionists are friendly, but one gave wrong information about the buses, which made me walk unnecessarily with a luggage. The hotel are is not pleasant, but it is 5 minutes walk from the lively Istiklal street. Rooms facing the street might be noisy, but I chose a room facing rear, so I had silence in the room. Shower is open, so the bathroom will mess after taking shower.", "Date": "December 25, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "4", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“Absolutely dreadful”", "Author": "viajante74", "ReviewID": "UR65010841", "Content": "I stayed at the Hotel Seref twice in a month, once for a week and a second time for a couple of days. In my first room the hot water was intermittent in the bathroom, but I figured I could live with cold showers for the low price of the room. I was woken up two nights in a row by people having loud sex in neighboring rooms. Other than that the stay was uneventful. The breakfast included in the room price is basic. The staff are young guys who are pleasant but don't seem to know much about running a hotel. Ask them a yes or no question and you will invariably get \"maybe\" for an answer. Against my better judgement I made a reservation to return to the Seref a week later. I told them I would be arriving late in the morning and they told me they would have a room ready for me. When I arrived the room was not ready. Several hours later when they gave me the key I went to the room and noticed a putrid smell as I stood at the door. I opened the door and found black mold on the bedroom ceiling and walls, and all over the bathroom. The ceiling was stained from water damage and appeared to sag in a corner of the bedroom. I alerted the desk clerk to the environmental and structural hazards in the room but they didn't seem to phase him. He said he knew my room and few others on my floor had \"problems,\" which begs the question why he gave me the room in the first place. He offered me another room, which of course was not ready, so I had to wait while they prepared it for me. The new room had traces of black mold in it, but the walls weren't coated with it like the last room and I was leaving early the following morning so I took it. But the bedroom flooded out when I took a shower. I discovered the threshold of the bathroom door was lower than the shower drain, essentially funneling water straight into the bedroom. The going rate for budget hotels in Beyoglu is currenly about 40 USD . The Seref charges 35 USD a night, but hassles you will endure staying there are not worth the small amount of money you save. Spend 5 USD more on another hotel. You will be glad you did.", "Date": "May 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Good budget hotel - Great location”", "Author": "cherrypie29", "ReviewID": "UR52393614", "Content": "The hotel was basic but that's what I would have expected for the price, the cheapest in the area. The hotel was very clean and the room was cleaned daily and the bed made. The staff were very friendly and helpful. The location of the hotel was great, just a couple of minutes walk from the main street through Beyoglu and its shops, bars and restaurants. It was also very quick and easy to get to Sultanamet and the historic sites by using the trams or on foot. If you like to go out for a drink in the evening I would definitely recommend staying in the Beyoglu area instead of Sultanamet as there are very few bars in the Sultanamet area. I would recommend this hotel to anyone who prefers to spend their money on enjoying the city rather than an expensive hotel, and just needs a clean comfortable bed to sleep in at the end of the day.", "Date": "January 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Marmaris, Turkey", "Title": "“value for money”", "Author": "bluepeter321", "ReviewID": "UR26569708", "Content": "i stayed at this hotel on 2 occassions and i found it good value for money .the staff were very good and were always helpful and all for the very cheap price of 20 euros each night this hotel is very basic but you pay a very basic price and i will most certainley stay there again and its in a great area", "Date": "March 21, 2009"}], "HotelInfo": {"Name": "Seref Hotel - Beyoglu", "HotelURL": "/ShowUserReviews-g293974-d1061802-Reviews-Seref_Hotel_Beyoglu-Istanbul.html", "Price": "$38 - $71*", "Address": "<div class=\"amenFloat\">", "HotelID": "1061802", "ImgURL": "http://www.venere.com/img/hotel/3/9/4/5/275493/275493.jpg"}}