{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“There for business; yet, what pleasure!”", "Author": "ACJ611", "ReviewID": "UR128352602", "Content": "Staying at the Rosewood Hotel Georgia was a phenomenal experience. The hotel is upscale and modern, yet, understated in a traditional sense. The staff is attentive and pleasant but, not obtrusive. The room was incredibly comfortable and housekeeping came twice per day. I had an amazing 80 minute hot stone massage at the spa. Sherri was very experienced and customized the massage to accommodate my requests. Another great feature was the salt water lap pool which was extremely relaxing. I am not a swimmer; yet, for some reason I was compelled to swim laps at Hotel Georgia. The therapeutic lights in the pool was a new experience for me and something I really enjoyed. I think light therapy really works! Another memorable moment was when I arrived one evening with a bottle of wine, cheese and a loaf of French bread to take up to my room. The concierge assessed my fare and kindly asked if I would like a plate and knife to enjoy my \"dinner\". Room service arrived less that 3 minutes later at my door with a sharp knife, plate and napkin. The service at the hotel was exceptional and it was an experience I will always remember.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leeds", "Title": "“Superb hotel. Great location”", "Author": "tdLeeds", "ReviewID": "UR128278203", "Content": "I arrived 24 hours later than planned (thanks BA) and expected the normal kind of hotel welcome experience.....but wow....completely different experience. Was treated like royalty!! The room was superb. As there on business, didn't get to experience the spa or the pool, but the room and bathroom were so comfortable and clean. Ok, so the room wasnt massive, but it was more than big enough for a business traveller. The hotel lobby bar did nice food, well presented, quickly delivered by friendly staff and was a decent price. The one time I did make breakfast I found it a little expensive. I suppose I'm more used to the buffet style. Maybe next time I'll avoid the fresh OJ. Room rate was sort of as expected for a city centre hotel, but could easily have been much,much more. Very friendly staff. I'd definitely use this place again.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Phenomenal service, beautiful hotel”", "Author": "emilyCO", "ReviewID": "UR128223070", "Content": "I highly recommend this hotel--from the time I made my reservation to when I checked out, the service was exceptional. I was heading to a conference in Vancouver and Diane in reservations worked with me to ensure we were able to stay in the hotel even though the conference organizers could not get us a room. Thank you, Diane! The hotel property was amazing but it was the service and attention to detail that blew me away. From the turn down service that came with a bottle of water and shortbread cookie, to the Nespresso machine in the room, to the beautiful gym-- it was all wonderful. The bathroom is incredible as well. Beautiful accents made me feel as if I was in a spa bathroom. When we asked for a sushi reservation that was close to the hotel, the concierge recommended a delicious and very reasonably priced place. The concierge made a reservation for us and then followed up to make sure it was up to our expectations. On our last day, we checked out and were heading straight to the airport. The concierge on duty recommended that we take the sky train to save a bunch of money and time. He even walked us part way over to the station. Overall, I am extremely pleased with this hotel. Service is exceptional. I will now go out of my way to see if there is a Rosewood hotel in any city that I am visiting.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Simply the best hotel!”", "Author": "mcdessureault", "ReviewID": "UR128222409", "Content": "Simply amazing service... Attention to the littlest detail, amazing room, the most comfortable bed ever!! From check-in to check-out, everyone is extremely professional, helpful and genuine. Handwritten personalized welcome note, turndown service, everything was perfect. They even sent me a custom declaration form to the room so that I could have an extra 2 minutes sleep for a very early flightbthe next morning! And the hotel is simply beautiful!! Best hotel stay ever!", "Date": "April 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent”", "Author": "Caymanss", "ReviewID": "UR127889773", "Content": "We stayed at the Hotel Georgia over the Easter holiday weekend. The location was excellent. It was easy walking distance to the Pacific Centre, Robson Street, and Gastown. The room was a nice size and bathroom was well laid out with heated floors. Many thanks to the concierge team as they were the most helpful we have ever encountered. We ate at the Hawksworth Restaurant and at Reflections and all meals were exceptional. Looking forward to returning.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Prince Rupert", "Title": "“Great pool but incredibly tiny room and arrogance”", "Author": "dan r", "ReviewID": "UR127831756", "Content": "My wife and I stayed one night at the Rosewood. It was supposed to be five nights as I was at a conference. We were really looking forward to it. The pool was wonderful on the first day. However, the room was very well appointed but very small for two people. We put up with it for the first night. It was a funny shaped room - very long and narrow. My wife kept saying that we wouldn't be spending any time in the room anyways..... The room overlooked the interior courtyard and on the second night a band was playing in the court yard. I phoned and complained about the noise and was told that the band would only be playing to 11:00 pm or so. . I said that my expectation was that when I rented a room, I expected it to be quiet. Further more that they knew that I was staying for five nights and that if they had a band going for a event, they should not have booked the rooms overlooking the court yard. There was no apology. Simply a reiteration that the band would shut down around 11:00 pm. I insisted on another room demanded to speak to the night manager. Got a phone call back about 15 minute later (9:30 pm or so) and more talk about the band shutting down. I got pretty angry and hung the phone. Phoned the Sutton Place (2 blocks away) and they had a room. Then I got another phone from the front desk of the Rosewood saying they would be giving me a 'complimentary upgrade'. Talk about arrogance! They were the ones that booked me into a room that they should never had let given that they had a band going. Said thanks but no thanks and that I would be downstair in five minutes to pay my bill. Which I did. My wife and I then caught cab over to the Sutton Place. Sutton Place was great. The rooms are good sized and it was really nice and quiet. Gym was okay.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“A hotel gem”", "Author": "Idmd", "ReviewID": "UR127709204", "Content": "A great location, with easy walking distance to the downtown sights. But even better than that: the wonderful rooms, with the comforts one would want; and the terrific service, with the staff that were friendly and extraordinarily helpful. Will definitely stay there again!", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Palo Alto, CA", "Title": "“Great experience”", "Author": "mdadPA", "ReviewID": "UR127632750", "Content": "Absolutely great hotel. I will stay again in Rosewood hotel for my next trip to Vancouver. I stayed three nights there and had a great experience. Every staff I met was very kind and helpful. The room was very clean, luxurious, and modern, not to mention the signature bathroom. In addition, indoor swimming pool was also very nice and convenient to use especially when you have a small child. There might be a better hotel, but this was the best hotel I have ever stayed so far, considering all the factors - staff, room, location, facilities, price, etc. My wife and daughter also liked the hotel very much.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“Better than my High Expectations”", "Author": "Tardawg", "ReviewID": "UR127553133", "Content": "On my recent trip to Vancouver British Columbia with my son to visit University of British Columbia we stayed at the Rosewood Hotel Georgia based on the reviews posted on Trip Advisor. The reviews ranked it as one of the top hotels in downtown Vancouver so I was expecting a superior experience. The hotel and particularly the staff far exceeded my expectations. First the location: Rode Sky-train from airport to City center station-30 minutes. Rosewood is 1 block from the station. Vancouver Art Gallery across the street,Waterfront a few blocks down the hill. A few blocks more Gas town's great restaurants. Speaking of restaurants the hotel restaurant \"Hawksworth\" is fantastic. We had breakfast & light dinner, both wonderful. Great wine list. Additionally \"Reflections Lounge\" an open air area is a great spot to sip a glass of wine outside by the fire in the crisp Vancouver evening. The pool, exercise and spa areas are also exceptional. Lovely facilities and super staff. Speaking of staff be sure to meet Jim. He drove us (in his Bentley) to catch the sunset at English Bay(recommended by the concierge (i am sorry I forgot your name). Later in the weekend he joined us @ Reflections. What a wonderful gentleman. The Rosewood group has created a fantastic oasis in downtown Vancouver not to be missed for a special visit to a beautiful city.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver", "Title": "“A 21st centrury oasis of grace and ellegance in the downtown core”", "Author": "GourmetTravel888", "ReviewID": "UR127374738", "Content": "Absolutely splendid. Old world charm. Totally updated. Very tastefully decorated. The rooms are spacious, richly appointed, with loads of smart and beautiful fine details. Very relaxing ambiance. Large bathrooms with an amazing soaker tub, separate rain shower stall, and wonderfully heated tiled floors. The staff is so welcoming, efficient, and engaging. Great pool and spa. Terrific cocktails at the bar, great food at Hawksworth. Definitely, worth every penny.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Wedding Anniversary Special”", "Author": "B K", "ReviewID": "UR127325160", "Content": "We saw on our local television station the re-opening of the Rosewood Hotel (2011) after it had undergone a 3 year renovation. My wife and I celebrated our anniversary there as it is just an amazed Hotel that is personable but professionally run. They are extremely fussing about quality and pay attention to the smallest detail. The hotel is the same vintage as the Millineum Biltmore in Los Angels and has a similar history with movie stars and famous people from around the world but it is far above the Biltmore's tired interior. The fitness facilities and dinning have been awarded one of the best in Canada. What makes the location special is that it is directly across from the Art Gallery and only minutes away from the famous Robson Street and Harbour Convention Centre. This is truly a winner and you will not go broke when it come to paying your bill when you depart.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "calgary", "Title": "“Beautiful Boutique Hotel”", "Author": "vicki3", "ReviewID": "UR127300805", "Content": "Lovely boutique hotel with nice rooms, but not my favourite Vancouver hotel. We stayed with our daughter, and I didn't find them very accomodating upon check in...charged us $30 extra when I asked for room with 2 beds, when it was the same room category and hotel wasn't busy, and we were first time guests, and asked for a children's robe and never did receive one (which is nice to have when going to the pool) I loved the pool but wish there would have been a hot tub or steam room...and there was no little extra treat like cookies or chocolates in room as complimentary welcome treat like many hotels do....again...very lovely hotel, liked the room, but in my opinion not deserving of the number spot on tripadvisor..we will go back to our favourite hotel with 5 star service next time....", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Langley, BC", "Title": "“The Rosewood Hotel Georgia is One Class Act!”", "Author": "ladydocBC", "ReviewID": "UR127096149", "Content": "Having been to some of the best hotels in Europe, Great Britain, and recently, Maui, I'm excited to report that one of the finest establishments I've ever stayed at is right here in my home province of British Columbia! The Rosewood Hotel exudes class and style everywhere - from the well-appointed, modern rooms to the dapper bellboys and the conceirge service. We enjoyed our stay on the 10th floor in a \"Junior Suite\". The ensuite was magnificent - loved the heated floors, huge, thirsty bath towels and robes and the soft, modern lighting that was controlled from multiple locations in the room. This was basically an appartment without the the kitchen. The bar is stocked with all your favorite items. It was my birthday and we arrived to a small chocolate mousse cake decorated in edible gold foil as a welcome. How thoughtful. Although we didn't get to try out the spa or the pool, we did have a glorious meal at Hawksworth Restaurant (which I will review separately.) I will be staying here whenever I'm in Vancouver for the weekend!", "Date": "April 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ridgeland, MS", "Title": "“Amazing hotel, best service, tiny closets”", "Author": "ms_momma_08", "ReviewID": "UR127034761", "Content": "My husband and I stayed at Rosewood Hotel Georgia while in town for a conference (USCAP). We have stayed at Rosewood resorts before and always had an amazing experience. This was no different. The room was amazing, with modern amenities including a nespresso machine (my husband loved this and used it every day) and convenient buttons on the wall to control lighting, including one right next to the bed to turn on the \"privacy\" sign, which was extremely convenient! I hate it when I get in bed then realize I forgot to put the privacy sign out on the door... The best part of the room is the bathroom. The floors are heated, the whole bathroom is covered with beautiful dark brown marble and the shower is amazing. It's huge and has 4 rain shower heads. The bathroom itself is also quite large and takes up about 1/3rd of the room or more. The only complaint I have about the room is that the closet is teeny and there's no way to stow your suitcases or unpack all of your clothes. I don't think this would be as big of a deal in the summer but when we went it was really cold so we had a lot of bulky clothes. Also there was some street noise that made it a little difficult to sleep some nights. We could have used a sound machine but it didn't bother us so much that we went out of our way to find some way to block the noise. The hotel is conveniently located and was an easy downhill 10 minute walk to the convention center every morning. It is also in easy walking distance of many great restaurants. As far as the hotel staff, they could not have been more friendly or helpful. Every concierge we talked to there gave us the best recommendations and was extremely helpful. Same for the front desk and staff at the hotel restaurant, which we went to for drinks and dessert. Drinks were good, dessert was OK. But like I said, best service ever. I couldn't have asked for anything more. We also sampled the spa. I got a relaxation massage and the cocoon treatment, both of which were heavenly. I also got a manicure and pedicure. My husband got a deep tissue massage that he wasn't too impressed with. He also got the shower tapas as well as the scalp tapas, both of which he really enjoyed. Again the staff was very professional, did a great job and really went the extra mile to make you feel relaxed. The spa itself was absolutely beautiful, with a great cozy relaxation room and really beautiful facilities. We didn't bring our swimsuits but wish we had after we saw the pool. It, too, was really beautiful with large dark brown marble pillars and a beautiful tile deck. The bottom of the pool has large panels of lights that slowly change colors. We did go to the gym, which has all state of the art equipment and a small room for doing non-machine related exercises, as well as a set of free weights. The gym is also really aesthetically pleasing and is surrounded by large floor to ceiling windows so you can watch the city below. The staff keeps the gym sparkly clean, coming in every 20 minutes or so to tidy up. They keep cool water and cool towels readily available. Some of the cardio machines even have games on them that you can play while you work out, which I thought was a pretty neat feature. I really enjoyed working out in it and wish I had been able to use it more. Overall a great experience. I would go back again.", "Date": "March 31, 2012"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“A truly amazing dining experience!”", "Author": "Susan L", "ReviewID": "UR127031904", "Content": "Last night we had the priviledge of dining at Hawksworth Restaurant, located in the Rosewood Hotel Georgia in Vancouver. From the moment of arrival through to the end of our dining experience the service was flawless, white glove service without the white gloves. The menu selection was exquisite and after some time we narrowed down our choices. I can honestly say that our dinner at Hawksworth Restaurant took dining to another level. Hats off to the chef who deserves an award for incredible creativity and taste. Hawksworth is at the top of my list of leading restaurants in Vancouver. A memorable evening and Hawksworth will be recommended by us over and over again. Susan Lerch Vancouver, B.C.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Service, style, and location are unbelievable!”", "Author": "Foodsnob1973", "ReviewID": "UR127023945", "Content": "Stayed here the 3rd weekend in March and was blown away. We always stay at 5 star hotels, but this one was special. From the second I arrived I felt like royalty as the lovely doorman from New Brunswick helped me from the taxi. This hotel is gorgeous, mixing sophisticated contemporary with traditional dark formality if that makes sense? The location is perfect; easy walk to Yaletown, Gastown, Chinatown, etc. Mathew and Connie, two of the concierges were sincerely sweet, eager, and helpful-they really made the trip. The beds were incredible, rooms were pleasing and comfortable, and the bathrooms with their heated floors, double sinks, enormous rain shower, and cool oval soaking tub was a real treat. You cannot go wrong staying here!", "Date": "March 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver", "Title": "“An attention to detail experience!”", "Author": "Gaylehr", "ReviewID": "UR126888370", "Content": "This recently reborn classic Vancouver hotel has an exquisite attention to detail and a focus on what matters to the traveler, either business, tourist or romantic getaway. The rooms are like little jewel boxes, very luxurious, but it's the bathroom that is spectacular. No bumping into one and other, heated marble floors, huge freestanding bath, large luxe shower. Service is charming, best looking staff I've seen anywhere! You don't have to leave the hotel: there's great European style outdoor lounge/bar, Reflections, and make reservations if you want to eat the hottest restaurant in Vancouver, Hawksworth, which says something in this city full of great restaurants.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "pensacola", "Title": "“Doesn't get any better”", "Author": "omakase", "ReviewID": "UR126839559", "Content": "My husband and I visit Vancouver twice a year for fun and relaxation. We have stayed in many of the lovely luxury hotels in the West End and downtown area. This past summer we had the opportunity to dine in Hawksworth, the highly ranked restaurant in the Hotel Georgia, Dinner was outstanding, but it also allowed us to see the beautiful lobby of the hotel and meet some of the friendly staff. Last week when it was time to choose an accommodation for our trip, we tried the Hotel Georgia. It just doesn't get any better! The hotel was built in the late 20's and recently renovated to bring back the decor and charm of that era but with the modern amenities expected today. The lobby is charming and warm with the hotel staff that make every guest feel welcome and special. The rooms are lush and beautiful with all the modern amenities including a beautiful marble bathroom with large walk-in shower with rain-shower head. The hotel also offers a full dining room, bakery and cafe, indoor salt water swimming pool, and new outdoor urban sitting area on the 4th floor to socialize with friends, have a drink and appetizers, and sit and look out over the roofs of the urban skyline. The space called \"Reflections\" had just opened while we were there, but it was already becoming a \"happening place.\" If the weather is inclement, there is the option of the cozy bar and lounge off the lobby or just sitting in front of the flickering fireplace in the lobby itself. However the most delightful surprise of the stay was Jim, the hotel driver who would whisk you away to your dinner reservation or float plane in the luxurious Bentley. His friendly attention just made you feel so special and a valued guest. We now have a new favorite hotel in Vancouver and can't wait to return.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Week end”", "Author": "buffetred", "ReviewID": "UR126806514", "Content": "What a nice Hotel, friendly staff, beautiful room, very nice swimming pool, had diner at their restaurant downstairs use their Bentley courtesy car to go for diner, over all a fantastic place to stay", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Gatos, California, United States", "Title": "“Excellent place”", "Author": "Juhls524", "ReviewID": "UR126785188", "Content": "You can't go wrong with Rosewood hotels- their service is always exceptional. The room was super big, yet cozy. And the bathroom...wow. I would definitely takes notes from them on design if I was remodeling a bathroom. Lighting, shower, bath- were all perfect. (Those are hard details to get perfect in a hotel.) Internet was flawless which should be an expectation in 2012, but I'm still surprised this isn't the case at some of the nicest hotels. Everyone who works here wants to help you so it really makes your travels effortless. The room service food was pretty good, but sometimes they forgot the little things such as sugar and milk with tea or water without ice. Very minor though and I'm sure if I called to let them know, they would have jumped to it quickly. I was here on business, but I would definitely bring my family here as a stop over to Whistler. It seemed there were a lot of travelers doing that.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "glassviolin", "Title": "“The Bathroom!”", "Author": "glassviolin", "ReviewID": "UR126441430", "Content": "Fantastic hotel! Two highlights -the amazing bathrooms & the service. We went for the deluxe room (one step above the basic superior room) because it came with a tub as well as a shower (superior is just a shower). And what a tub it was! It's a huge soaker. The shower is a beautiful walk-in with a rain-shower thing. Dual sinks, separate toilet room. The bathroom was the biggest I've seen in any hotel. And man, I do love a large bathroom :) The service was impressive. We came with a baby and two dogs -not your most desirable clientele. They didn't even bat an eye. In fact, they genuinely seemed pleased to have us all. We were heading to an appointment early the next day and the front desk folk went way out of their way to find us the shortest route. The room was beautiful (no signs of wear at all). Great bed, great sitting area. Lighting system (once figured out) was good. The location was ideal -right downtown. Although, we did have to circle the block a few times before finding the entrance (it is not a grand entrance). Overall, great experience. We felt like rockstars. We've recommended this hotel to many friends and we'll definitely stay here the next time we're in vancouver.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "British Columbia", "Title": "“Newly renovated, wonderful experience”", "Author": "DocBells", "ReviewID": "UR126424985", "Content": "This hotel has been beautifully and carefully renovated and there has been attention paid to every little detail. I was in a deluxe room which was glorious - mainly for the bathroom, with the deep tub and separate rainfall shower, as well as heated floors. The rooms are smaller than some hotels (due to the historic building) but they are still charming and comfortable. The water and shortbread by the bed when I came in from dinner was particularly welcome. I dined with friends at Hawksworth restaurant and this is an experience not to be missed - fantastic local BC food with some twists - probably the best restaurant in Vancouver currently (and the full English breakfast even included black pudding and a small pot of baked beans - the nearest facsimile I have had in Canada!). The front of house staff were extremely helpful in every way. I am already looking forward to my next visit and trying the outdoor bar in warmer weather.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“This is THE place to stay in Vancouver.”", "Author": "coyone", "ReviewID": "UR126422021", "Content": "My high expectations were exceeded on every level on every day of my stay. This hotel's facilities and staff were all excellent without being pretentious. The special rate the hotel offered for a junior suite made this an extraordinary deal and excellent value when a cot was set up in the living room for my teenage son. The location cannot be beat. The hotel's signature restaurant, Hawksworth, was not a highlight for us, but it was a good dining experience. (We did not love our meal at the highly-lauded restaurant West in Granville, either, but it was also good.) The fitness and pool facilities at the Hotel Georgia WERE highlights as they were very clean and new with attentive staff. I wish I had had the time to try the spa, Sense. Bel Cafe is worth a stop for any visitor downtown wanting a perfect cup of coffee. Don't miss the macaroons, including a bacon/maple flavor. Every staff member we met was cheerful and went beyond the norm to please. Even check-in and check-out were pleasant, thanks to Davi and others! We arrived at 10am to ask to check-in--hours before a room could be reasonably expected--and they apologized for the 15 minute wait to get the room ready (including setting up a comfy cot) and gave us macaroons! Unreal. While in Vancouver, I recommend: taking the Canada Line from the airport to the stop one block from the Hotel Georgia (buy a day pass from the 7-Eleven in the airport), renting bikes (Bayshore Bikes) for a 5+ mile, mostly level, ride around the perimeter of Stanley Park and along the sea wall, touring by seaplane with Harbour Air (we booked the Panorama Experience at the terminal which is near Canada Place), grazing on cheese and fruit at the Granville Public Market (take a mini-ferry for $3.50 one-way), schlepping out to the Museum of Anthropology ($30 taxi or easy bus ride), and shopping Alberni Street.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nanaimo, Canada", "Title": "“Great Atmosphere”", "Author": "Jill S", "ReviewID": "UR126306821", "Content": "We just returned from a stay at the Hotel Georgia. The atmosphere of the lobby and rooms was great. We were on the 11th floor and no complaint about noise from the street. Our room was smaller than expected, it was quite squishy once you get 3 people in plus luggage. My one big complaint would be that there were no hooks or towel bars in the bathrooms. I didn't have any where to hang my bathroom bag, or towels after we had used them. Also the heated floor was almost too hot, and you have to lie on the floor to adjust the temperature which is located under the bathroom counter. I know these seem like small things but at a hotel of this caliber you would expect attention to small details. The location is incredibly convenient and the customer service was super. We especially enjoyed our drink in the 1927 Lounge. I would stay here again, but look into getting a larger room.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "toronto", "Title": "“simply the best”", "Author": "jonToronto", "ReviewID": "UR126275653", "Content": "this is an old hotel that was perfectly renovated. The rooms are large and done wonderfully with great beds and TVs and lots of little extras. the service is great and the staff friendly and helpful. Not only is this my favorite in Vancouver but perhaps North America. wonderful", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, ca", "Title": "“simply amazing”", "Author": "davis121", "ReviewID": "UR126240275", "Content": "Hotel: Being a new hotel has its advantages. The decor is amazing with wood paneling almost everywhere but tastefully done. I couldnt fine a single flaw with the craftsmanship. Excellent carpenters. Room: A bit small but Im not complaining. Also wood paneling everywhere. Craftsmanship is excellent. Our room was at the end of the hall but still a short walk to the elevator. I never knew how much i would appreciate heated bathroom floors and ceiling rain showers until now. There isnt space for a DVD player but if you ask the concierge the engineer will gladly set one up for you. This helped when we utilized the DVD library for our daughter. Beds were comfortable as any hotel. We were on the 8th floor and couldnt hear any traffic from the street below. Location: Central and a short walking distance to almost anything. Across the street is Four Seasons and the mall and a block away is the Fairmont where we had afternoon tea. The convention center is less than 10 minute walk. London Drugs also a block away as well as Robson St. for shopping. Hawksworth Restaurant: Food was excellent but they seem to cater to the businees clientale more than families. We ate there twice but the next 3 days we ate at the Four Seasons Yew restaurant. Yew seemed to cater to our daughter and family more and the service of Four Seasons is seen in the restaurant. Fitness: Average size and there wasnt more than 3 other people whnever I was there. Pool is nice with changing lights. Jim the driver was excellent and our daughter loved him. Connie the concierge also excellent but they really all are excellent. What is most important to us when travelling to a foreign place (Canada not really foreign because we are from California) is a sense of security. We felt that if anything were to happen that every staff member would do more than necessary to solve the issue.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Centennial, Colorado", "Title": "“Renovation was well thought-out”", "Author": "rwg550", "ReviewID": "UR126239793", "Content": "This hotel and staff are terrific! Some of things I liked: 1. HVAC. Many restaurants and hotels have the H and the AC but stumble on the Ventilation. A place with inadequate ventilation gets stuffy. Your ventilation system, as well as temperature control, worked great. 2. Rain shower - this was great. 3. Heated tile in the bathroom floor - wonderful! 4. Marble in the bathroom - counter, floor and shower areas. This was amazing - it had the rich texture of a fine marble but was not cold to the touch, was not slippery in the shower and in fact felt soft on the feet. 5. Flashlight in the closet for emergencies is a great idea and I've never seen this before in a hotel. 6. Closet areas were small but so well arranged with drawers and hanging space that I had plenty of room. 7. Expresso machine was great and got used a lot! 8. TV on the wall saves space. 9. Bed and bedclothes were very comfortable. I liked the idea of the gooseneck reading lamps on the headboard, although mine were not functional (or I couldn't find the switches). 10. I liked the hidden electrical outlets in the desk and nightstand. Very neat and practical in that I always have a bunch of chargers to plug in and many hotels don't seem to have enough outlets. 11. Staff - super nice and outgoing but not overbearing. Everyone would say \"Hello\" as they passed in the halls. David, who checked me in during the evening shift, was particularly helpful after my credit card was blocked and we had to reverse some things the next night after I got it cleared. 12. Not that anything is far in downtown Vancouver, but the location of the Rosewood was across the street from most of my business meetings. 13. Although I did not have dinner at the Hawksworth restaurant, several people told me it is among the best in town. I did have breakfast there and it was great. 14. I did use the Internet in the room. There is a two-tiered system and you can choose the higher priced one if you have more than one device for internet access. I had my laptop and iPhone but you could connect just the laptop in the room and use the free WiFi in the lobby to update emails on the iPhone every now and then. I use WiFi only for iPhone internet when travelling to avoid high cell data charges. There were many other conveniences and I would certainly stay at a Rosewood hotel again. Thank you for putting such thought into your accommodations.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "Ottawa", "Title": "“Fantastic hotel -- glitz, glamour and spectacular service!”", "Author": "CanadianTraveller30", "ReviewID": "UR126207076", "Content": "This hotel was bar-none one of the best hotels that I have ever had the privilege of staying in. If you have read other reviews that I have written, you will know that I set a very high bar for service, quality and glamour if a hotel bills itself as a 4 or 5 star. The Rosewood did not disappoint -- if anything it far exceeded my expectations and has raised my bar for what is truly required in a hotel. Well done Rosewood! The Good: - The front desk staff were consummate professionals -- accommodating, friendly without being intrusive, incredibly knowledgeable, well-spoken and exuded class. I had the privilege of being served upon check-in by Cash. What a great individual and a true credit to the hotel. - Before I could even turn around from the front desk, there was a hotel staffer in a very nice suit who was there to put my bags on the cart and escort me to my room. He was just a friendly guy, again uber professional and a credit to the hotel. Upon arrival in my room, he asked if I needed anything and I said yes, that I would like some cigarettes (it's a nasty habit I have picked up whilst travelling... but I digress) and would he know where there was a store close by that I could pick some up at. He then informed me that part of the hotels service was to run errands for their guests. I gave him the money, he got my cigarettes for me -- all in about 10 minutes. Unreal. I was so impressed. - The rooms. Oh my gosh, the rooms. Beautiful BEAUTIFUL furnishings, a welcoming bed, a beautiful headboard, couches that looked like they were just bought, amazing armchairs, a desk that was high quality with not a scuff mark to be seen. The wardrobes lining the entry hallway were absolutely out of this world, ample room, quality hangers, an impressively stocked mini bar. - The service from the staff again was incredible - I needed my shoes polished and my suit pressed for a dinner I was attending. I called at 11pm. They picked up both and I had them back by 7am the next morning. Beautiful. - The food. Incredible. If you haven't been to Hawkesworth you simply must go. A fantastic experience in excellent food, beautiful wines and a classy atmosphere with - again - amazing staff. - The lounge just off the lobby is very \"old money\" and is absolutely a treat to be in. I can't say enough about it. It just makes you feel a cut above the rest. - The lobby, like the rest of the hotel, is absolutely stunning with well-appointed decor, attentive staff and exudes the 5-star experience that guests can/should expect from a hotel that bills itself as high quality. It is. In every respect. - The doormen. Again, unreal. From offering you water when you get in to a car, to calling your car service, to going out in the rain to flag down your car while you wait in the comfort of the lobby, these guys are second to none. I absolutely adored this hotel and can't wait until my next visit. Thank you Hotel Rosewood for setting the bar high -- and leaping over it! Well done!", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sidney BC", "Title": "“Spectacular Hotel, Terrific Location”", "Author": "gpstevens", "ReviewID": "UR126106263", "Content": "Our first stay at this beautiful hotel since its restoration. The location at Georgia and Howe is central to everything Downtown Vancouver has to offer. The rooms are modern, with high tech lighting, tv and internet, and with special touches on the night tables, coffee and refreshment bar, and the bathrooms are appointed to the highest standards. The Hawksworth Restaurant is trendy yet refined and the food and service excellent. Each staff member from the moment we met the door man, bellmen, valet parker, front desk and concierge was helpful and courteous and offered to assist us with anything we might need. We will be back. I cannot believe I am writing this but I place this hotel above any other hotel I have stayed in for service to its guests and responsiveness from its staff.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“A truly exceptional experience.”", "Author": "Tamtamarama", "ReviewID": "UR125997346", "Content": "From the moment I stepped out of my cab, the staff greeted me by name. I was fortunate to be able to stay for several nights, and had the opportunity to try Hawksworth Restaurant, Bel Cafe, 1927 Lounge, Reflections, and to attend an event in the Spanish Ballroom. Every interaction and experience exceeded my expectations. The attention to detail at Rosewood Hotel Georgia is incredible - each time I entered or left the hotel, again, the staff greeted me by name - that can't be easy to do in a busy hotel. I had friends and associates join me at the hotel for dinner, coffee or wine, and each of them also felt pampered and impressed with the level of service, quality of surroundings and experience. Even in the Bel Cafe, the server took the time to introduce himself and remembered me the next time I came in - and all I had was a cappuccino! The hotel room was sumptuous and extremely comfortable. Initially I had wished for a view out to the Art Gallery, but when I realized I was looking over the pool and Reflections, I was very pleased for the soothing sound of the water and the pretty courtyard below. Even as I was sadly leaving, the valet offered me a bottle of water for my drive. Sigh - I can't wait until I can visit again. The Rosewood Hotel Georgia is setting a new standard for service quality.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Redwood City, California", "Title": "“Rosewood Georgia Outstanding.”", "Author": "123holly456", "ReviewID": "UR125995009", "Content": "The Rosewood Hotel Georgia is the most beautiful hotel in Vancouver. The staff is outstanding and the hotel is kept in pristine condition. The rooms are a good size and very clean. This hotel is child friendly! There were many children in the hotel and they were treated very well in the adult environment. I would strongly recommend this hotel. Please find a few highlights from the hotel and team. Heather the concierge was exceptional. She was helpful and extremely kind. I should also note patient, because we had a few logistical issues and Heather handled them with a smile on her face the entire time! Connie was outstanding as well…she knew all of the good restaurants around town! Robert also was excellent; he helped us rent a car and find are way to important sites around Vancouver. I must make a HUGE shout-out to Jim the Bentley Driver and ‘goodwill ambassador’ of the Rosewood Georgia. What a beautiful person. He showed us the city and pointed out true gems of historical relevance. He could not have been nicer. I would suggest people stay at the Rosewood just to meet Jim! Hawksworth was absolutely delightful! We had the opportunity to meet Chad the GM, who came to our table and made sure our 12 year old daughter, was happy and enjoyed her meal. I expect that level of service for adults, but the time and care that Chad displayed for a younger patron was endearing. The Bel Café is a jewel in Vancouver! What a wonderful little café. First off the barista made a fantastic cup of coffee and he is a master of ‘foam decoration”. Parker was such a personable representative for the café and hotel. We stayed at the Rosewood for 6 days and Parker took the time to learn all of our names…and even remembered our order! In addition, Parker worked very hard to make sure that the tables and surrounding areas were exceptionally clean. A+", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Penticton, Canada", "Title": "“Exceptional in Every Way”", "Author": "travellinpaddler", "ReviewID": "UR125953408", "Content": "This is easily the best hotel I have had the pleasure of staying at. All of the modern conveniences, in a newly renovated property that has maintained all of the original architectural features. You never get tired of looking around at the beauty of the hotel including amazing original works of art. Probably the most amazing feature is the staff, however. They all seem to truly love being there too. They are professional and courteous but laid back at the same time. We felt so welcome. Beds are heavenly, the rainshowers were amazing! Cannot wait to go back.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Squamish, Canada", "Title": "“Best in Vancouver”", "Author": "chillyp", "ReviewID": "UR125716378", "Content": "The people that work at this hotel make you feel really special and the room itself is very luxurious. I've now stayed in almost every 5 star hotel in Vancouver and this is my new favourite ( Sorry Fairmont WF - It's me, not you. )", "Date": "March 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pennsylvania", "Title": "“What a treat!”", "Author": "appleorchard", "ReviewID": "UR125704510", "Content": "Our stay exceeded our expectations. We spent three lovely days at the hotel, and were delighted with hotel and the gorgeous restoration. The staff was outstanding, bar none. Our room was comfortable and cozy, and our stay was made more pleasant by the little details - the espresso machine in the room and a complimentary tea tray sent up every afternoon (upon our request). Kudos to the staff, especially Jim (the driver), Matthew, Connie & Heather (concierges), and John, the bartender at the lobby bar who graciously and creatively mixed me a cocktail based on my favorite ingredients, and shared his historical knowledge of cocktails. The heated floor in the bath was nice, as was the shower and the soaking tub. We have stayed at Rosewood properties before (Caneel & Little Dix) and this \"big city\" experience at the Hotel Georgia ranks right up there with them.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Loved that Opulent Feeling!”", "Author": "Angelita d", "ReviewID": "UR125685907", "Content": "I treated myself to one night at the Rosewood Hotel Georgia after a few days at another hotel in Vancouver. And a treat it surely was! Highly recommended if you want to feel like royalty! I took advantage of an opening special they were running, only 300/nite for a Jr. suite which I thought was grrreat value! The rooms are exactly as they look on the website pictures. Truly classy and opulent :) I just wished I'd had the time to treat myself to a bath in that romantic-looking bath-tub. I called in advance to inquire about parking, and lo-and-behold, when I arrived at the hotel the front men and other hotel staff were expecting me and were addressing me by my last name! I must admit, I haven't been privy to such royal service before! It kind of creeped me out a little bit. Even when waiting for the elevator, staff members were asking me: 'How are you enjoying your stay Ms.____ ?' I think if I had travelled with company that would've been alright but when travelling solo I don't like to draw so much attention to myself ;) Still a fabulous hotel and I will consider returning in the right company :)", "Date": "March 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“One of the worlds best”", "Author": "Steve B", "ReviewID": "UR125664013", "Content": "We recently spent two nights at the Rosewood Hotel Georgia and were beyond impressed. The accommodations, the hotel amenities and the unmatched service of the staff were first rate in every sense of the word. The front desk staff and the concierge all went above and beyond even what you would expect at a 5 star resort, and all with a warmth and genuine heart for service that made us marvel. The stellar service continued when we dined in their award winning Hawksworth restaurant for dinner and followed up with breakfast the next morning. We have stayed in luxury hotels around the world and would rate the Georgia in the top 2 along side the Crillon in Paris. The fitness center with their saltwater lap pool on the fourth floor was outstanding. It is located in the heart of Vancouver, with sites, shopping, great dining and art all within short walking distance. The staff directed us to some of the best sites to see in a two day visit and made our trip memorable. There is no better place to stay in Vancouver.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Hartford, Connecticut", "Title": "“When you visit Vancouver”", "Author": "travelgoddess53", "ReviewID": "UR125561092", "Content": "You MUST treat yourself to a stay at the Rosewood Hotel Georgia! Fabulous property and the service provided throughout the stay was impeccable! Terriific location in a wonderful city but be warned- you may never want to leave! The rooms themselves are so comfortable and the bathrooms were incredible! All other luxury hotels should take heed. Treat yourself to a visit to Senses-their spa- and you won't be disappointed. The time honored tradition of meeting for cocktails is alive and well and thriving at their Hawksworth Restaurant and Bar 1927. You must try the signature cocktail \"Georgia\" which has been dubbed \"hotel history in a glass\". Such fun! Their Bel Cafe seems to be the hot spot for the local crowd for breakfast and lunch. Great soups, artisnal sandwiches and to die for pastries. Try the new \"cookies and cream\" macaroon- worth every calorie. If you need to get around town, the hotel's own Bentley can take you there. Reservations are required and service is limited to within city limits. Cannot wait to return Vancouver and this wonderful hotel,", "Date": "March 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Wonderful boutique hotel!”", "Author": "TorontoTraveler_2008", "ReviewID": "UR125520470", "Content": "Conveniently located out of the main stream of traffic, Hotel Georgia offers a lovely environment to enjoy Vancouver on business or pleasure. I first found the hotel on one of my business trips and am returning for a casual weekend with my spouse. We'll let you know how the weekend romance rating goes but for business, it was a very enjoyable stay.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kamloops, Canada", "Title": "“Luxury meets sincere service”", "Author": "MWiebe01", "ReviewID": "UR125315769", "Content": "Stayed at the Rosewood Hotel Georgia for our 25th wedding anniversary. At 45 & 44 years of age respectively - we are old enough to appreciate the finer things in life & young enough to still enjoy a good, slightly rowdy night on the town. The staff at this hotel were extremely professional but managed to combine that trait with a sincere desire to do anything in their power to add enjoyment to their guests stay. The ambience of the entire hotel is fantastic, and in particular the staff of the 1927 Lobby Lounge & the front desk personnel - were a true pleasure to interact with. We are fairly well travelled, and have had the opportunity to stay at a number of 1st class hotel around the world. However, the Rosewood Hotel Georgia definitely rose to the top of the ranks for both luxurious surroundings & top notch customer service.", "Date": "February 27, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Edmonton", "Title": "“Absolutely the nicest hotel I have ever stayed at.”", "Author": "Nomad04", "ReviewID": "UR125305295", "Content": "5 Stars! The best of the best! I would highly recommend this hotel. I will return!", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Luxurious week away in Vancouver. Simply the best.”", "Author": "ElyseMikeB", "ReviewID": "UR125154596", "Content": "I would recommend this hotel to anyone visiting Vancouver. I stayed there on business, but would come back with friends or a romantic stay. It was the best hotel experience I have ever had. The service was incredible and very attentive, always addressed by name. The rooms were luxurious, large in size. My favourite part was the bathroom with the oversized tub, rain shower and heated marble floor (amazing). I took a dip in the pool at 9pm, which was lovely. Very clean, and felt like I was in a resort. Location was central. You must try the Coffee at Bel Cafe...I became addicted. Hawksworth lived up to it's name. Great atmosphere, and mouthwatering food. I wish I had more time to try the Spa! Until next time.......", "Date": "February 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“The best hotel in western North America.”", "Author": "JeffandRenee", "ReviewID": "UR125007429", "Content": "Upon arrival we pulled into the parking area and the valet greeted us warmly. He directed us to the very private and unassuming entrance off of the garage and into a beautifully adorned and well layed out lobby. No less than three friendly and helpful people attended to us as we checked Iin and we were shown to our room on the 10th floor. The room was perfect. A unique layout with modern decor inviting us to be comfortable and feel great. Amazing view of the art gallery and city. The heated floors in the marble tiled bathroom were a treat, and the deep soaker tub made for the ultimate in relaxation after a busy day of car travel. The big screen HD tv was a nice touch as was the lobby area of the room that allowed us to keep the rest of the room free of clutter. A small fridge, a fun espresso machine and wonderful linens highlighted the obvious depth of thought that went into room features. The spa, pool, and exercise room made for a comfortable experience and allowed us to enjoy the morning in privacy and style. Overall, the quality of the room, the service staff, and the amenities in the hotel are the best we have experienced in our travels!", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Delta, Canada", "Title": "“Weekend stayvacation”", "Author": "Boundary_Bay1967", "ReviewID": "UR124988218", "Content": "Simply the best - Exemplar service, exemplar attention to detail, exemplar accommodations and exemplar staff. Location could not be better. Unique in that the renovations spared no expenses in rescuing back all glamour, taste and experience of a bygone era without incorporating any of the negative common side-effects found in many of other glamour rescue attempts. Spotless clean and the food is marvelous independent of where you chose to eat. Location is fantastic. Valet parking is expensive @ 39% of the price of the room, especially for the non-Bentley weekender like me looking for an escape, but you can just park underground across the street and problem solved. This is a hotel that I will keep coming back and I will recommend to anyone who is interested in knowing how things should be done in the hospitality world.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "North Vancouver, Canada", "Title": "“A luxurious weekend”", "Author": "carrier_ca", "ReviewID": "UR124975531", "Content": "I highly recommend this hotel. The rooms are very comfortable and tastefully appointed. The bathrooms are exceptional, soaker tubs, rainfall showers, and heated tile floors. We enjoyed both dinner and breakfast in the restaurant (make sure you make reservations for dinner). The spa treatment was very personalized and the spa is really cozy and comfortable. The gym is beautiful, great equipment and a nice big stretching area. Only downside was the limited movie selection, but this was easily off-set by the streaming capabilities on our iPad. We had a great weekend getaway and would definitely do it again!", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Geneva", "Title": "“Vancouver's Finest”", "Author": "Oliver H", "ReviewID": "UR124860480", "Content": "I've been fortunate enough to have traveled to Vancouver many times over the past few years, and have stayed in some excellent hotels in this city including- The Four Seasons, The Opus, Loden, Shangri-La. The Rosewood Hotel Georgia is hands down my favorite hotel, not just in Vancouver, but probably in the world (and I have been to many cities). The rooms are amazing. Very good size, appointed to the highest standards, and with an amazingly comfortable bed. The staff cant do enough to help you, very attentive and always courteous. The hotel dining facilities are first class. The gym and salt water pool were sensational! Overall I really cant rate this hotel enough. Vancouver is lucky to have many wonderful hotels, but the Rosewood Hotel Georgia is in my opinion the best. I cant wait for my next trip to Vancouver where i'll certainly be staying here again.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“A real treat in the heart of Vancouver”", "Author": "rozinwa", "ReviewID": "UR124723523", "Content": "Came for a business meeting, will return for pleasure. Beautiful room, very quiet, great location, wonderful service by hotel staff.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Columbia Británica, Canadá", "Title": "“A Wonderful Hotel”", "Author": "Y0rkieAbr0ad", "ReviewID": "UR124704798", "Content": "From the point we arrived to the time we left, this Hotel displayed a professional and efficient service. The rooms were of a good size and presented a quality finish. The staff were friendly and knowledgeable. We visited the Hotel for our anniversary and the little extra touches made the whole experience unforgettable. The breakfast is a menu choice with a quality that speaks for itself. In short this place understands the finer points of running a Hotel, we shall be back.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Riverview, New Brunswick, Canada", "Title": "“Just a quick stay”", "Author": "Paul B", "ReviewID": "UR124662606", "Content": "This was my first time staying at the Georgia and it was an amazing experience. Our meetings were well looked after, the food provided was of excellent quality. The restaurant was very good as well. The reons of the hotel were nicely done with the charm of the original building kept, but all the modern convenience added. The staff is some of the best I have ever seen. I've stayed in a number of fine hotels/resorts because of my work, and this ranks at or very near the top of my list. I highly recommend this hotel to anyone visiting Vancouver", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Birmingham", "Title": "“Smelling of roses”", "Author": "Gofflet", "ReviewID": "UR124554076", "Content": "A perfect hotel... 3 nights (for the price of 2,so an absolute bargain) Hits -, huge comfortable beds with lovely sheets ,Jimmy the Bentley driver, lovely pool with excellent gym, biscuits at bedtime, fabulous artwork in the foyer Misses-none", "Date": "February 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“One of the Finest Hotels in North America”", "Author": "hank m", "ReviewID": "UR124490834", "Content": "Perfect on all accounts. We spent 4 nights at the Hotel Georgia in November 2011, and would recommend the hotel to anyone and everyone. Hotel is essentially brand new after a 4 year renovation. No expense was spared. Rooms are fantastic. And the bathrooms even better. Luxury everywhere. Hotel staff was some of the most helpful I have ever encountered. Imagine being driven to your evening dinner in the hotel's own Bentley! Hotel restaurant one of the best in the city too. Spa is great. Exercise facility top notch. Indoor Pool amazing! Perfect location for seeing Vancouver. 5 Star rating is not high enough! HM", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“A superb stay”", "Author": "Jody05", "ReviewID": "UR124489600", "Content": "I felt completely spoiled right from the start of my stay, through to the end. James was supremely attentive, showing me the lobby details while I waited at the check in counter, arranging for the hotel's Bentley to take me to my important interview the next day, and then showing me the details of my room. The room was beautiful, the heated bathroom floor, closets that lit up from within on opening, and the Nespresso machine were real treats. I had a small glitch with my TV turning on in the middle of the night waking me up, when I mentioned it to the staff they suspected a snag with the technology settings in the room and were going to look into it upon my departure. I'm confident they'd ensure it doesn't happen to future guests but in addition, it would have been nice if they'd just said they were sorry for my disrupted sleep just to show they cared. But truly, besides that, it was my best ever hotel experience with the service being the best I've ever had. A big thank you to James for making my stay such a delight.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Little Rock, Arkansas", "Title": "“The Rosewood Georgia is top notch, the very best stay we've ever had!”", "Author": "Bettysally", "ReviewID": "UR124368892", "Content": "From the moment we drove in we felt like VIP. Brian and Lane were awesome, they both went above and beyond what anyone would expect. The front desk staff and concierge was always polite and ready to assist. The building is gorgeous! The beds are the most comfortable I've ever slept in. Love the Nespresso machine in the room. We will definatly be back next year.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Beijing", "Title": "“Old School Elegance”", "Author": "SND72", "ReviewID": "UR124335890", "Content": "Not only was the room exquisite, the textures, colours and lighting beautiful, but it was so logically appointed! The bed is beautiful and comfortable. The bathtub was a dream, as was the shower(Of course, they have radiant heated floors.)! The toilet is separate, which, with the sliding glass doors closed, is blessedly very private. The recent move to all glass open concept bathrooms in many hotels, boutique and otherwise, often overlooks this most basic necessity. The staff went above and beyond the call of duty. The door man walked me to the sky train station, trolleyed my bag for me the whole way and refused a tip! The gals at the help desk made a hair appointment for me. We had an absolutely magnificent meal at the restaurant, and I enjoyed a gorgeous bowl of chicken broth soup at the little cafe, it had some fresh lemon and green beans (that were not overlooked) added just at the end. Delicious! I would travel half as often, so that I may afford the Georgia. It is totally worth it.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Amazing property”", "Author": "2surly", "ReviewID": "UR124310237", "Content": "I was only in Vancouver for 1 night for a tradeshow at the Rosewood Hotel Georgia, and because they were offering a special rate, I canceled my reservation at the Metropolitan and re-booked at the Hotel Georgia. The location is fantastic, just 1/2 block from the metro/Skytrain station from the airport. Room was very spacious, but the bathroom was the best: separate tub and shower (always a plus in my book), with heated floors. Didn't sleep well but that had more to do with my raging insomnia than the room, and staff was exceptional, very courteous and efficient. I'd definitely go back if they ever offer a rate that's within my company's travel policy.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "2", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Top hotel in Vancouver”", "Author": "Aces999", "ReviewID": "UR124163768", "Content": "The washrooms are huge and they have great technology in the room", "Date": "February 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, Ca", "Title": "“Incredible Staff, incredible experience.”", "Author": "gypsy71", "ReviewID": "UR123886198", "Content": "Went to Vancouver for a weekend getaway and stayed the the Rosewood Hotel Georgia based solely on Tripadvisor reviews. Our experience was incredible! I have traveled all over the world and have not experienced service of this caliber in quite a lone time. From the ease of the valet at check in, the warmth and professionalism of the front desk, the knowledge of the concierge, the friendliness of the bellman, and the absolutely wonderful hospitality of the hotel driver who took us all over. This hotel bar has superb bartenders and an incredible cocktail list with wonderful ambiance. The Hawthorne restaurant was an amazing treat for brunch and again with incredible service. The rooms were very classy and tastefully done with large heated marble floor tiles, and a sunken in bath. Everything was top of the line throughout the hotel. Worth every penny, and I wouldn't stay anywhere else in the city.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Simply Sublime...”", "Author": "BlackRock09", "ReviewID": "UR123672452", "Content": "Truly an amazing experience. As I turned each corner in the suite I was thoroughly impressed. I kept saying over and over again.. they have thought of everything. If you want to treat yourself to a wonderful Vancouver hotel experience - this is it! Elegant, modern and beautiful. I was equally impressed that the older structural elements were maintained on the property. They have been incorporated so gracefully with the modern decor and amenities. Thank you Rosewood... I can't wait to return.", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“A gem”", "Author": "TouristBee", "ReviewID": "UR123556296", "Content": "Spent a weekend here with my husband after a week of skiing in Whistler. Excellent friendly, attentive and personal service from the moment you pull up at the front door. James, who showed us to the room made sure to settle us in comfortably and brought us up a pot of tea right away. The staff greets you by name every time they see you and is always ready to help. The room was very comfortable and had luxe decor but a bit small and not much closet/storage space but this was well compensated by a lovely big bathroom with heated marble floors and a roomy bathtub, (great to soak the aching post skiing muscles in) and a fabulously comfortable bed. Location couldn't have been more convenient- all the shops, bars, restaurants are a stones throw away. Complimentary Bentley hotel car service within downtown with an extremely friendly and warm driver Jim was a nice touch. Valet service always had our rental car ready by the door and stocked with fresh bottled water before we stepped out The pool and spa looked great. Everything in this hotel is new, polished and clean but with just the right touch of old school glamour and luxury. Highly recommended. This hotel lives up to all its great reviews.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Superb service and ambience”", "Author": "Peter3801", "ReviewID": "UR123460406", "Content": "We stayed at the Hotel Georgia for one night to finish off our visit to Canada. The hotel is beautiful with old school decor in the foyer, and modern but incredibly comfortable and tasteful decor in our room. The room lighting and IT controls were great, and the bathroom had the most wonderful ceiling mounted \"rainfall\" shower head - pure bliss. Our bed had a pillow top mattress, something about which I am usually dubious as I find them too soft but as it was I slept very well. The pillows were perfect and not too soft. The hotel also honoured our request for the bed to be made up with a regular blanket and sheets (and not a duvet). The windows of the room could be opened and therefore we didn't need to keep the a/c on while sleeping to keep the room at a comforable (cooler) temperature for sleeping. We had pre-dinner drinks at 1927 and the barman was knowledgable and capable and mixed my martini exactly as I like it. We dined at Hawksworth restaurant and had a meal of brilliant quality with fresh local produce showcased perfectly - David Hawksworth's food is intelligent but not fussy and focuses on the quality of the produce and its flavour. It was easy to have three courses with wine and not feel over-full. Everything was delicious but a particular highlight was the short ribs first course. Beef short ribs cooked sous vide for 48 hours produced strongly flavoured and meltingly tender meat and the seasonings were Thai-inspired but without any sweet notes which worked perfectly with the rich meat. We paired this with the sweetbreads and this was the right combination as the glaze on the sweetbreads was quite sweet but was a perfect balance against the sour/salty/hot of the short ribs.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Great place to stay in downtown Vancouver!”", "Author": "auroranyc1", "ReviewID": "UR123412850", "Content": "I'll try to keep my review short and sweet. My husband and I stayed at this hotel for a week for our birthdays. As you may know, the Rosewood hotels email you a guest preference form to book special services; e.g Spa services, dinner reservations, reason for your stay/if you are celebrating any event.. etc. I had mentioned we will be visiting for our birthdays but didn't specify anything more or less. When we arrived we were greeted by Brian which was so nice (also helpful during our entire stay). Connie at the reception desk, wished us \"Happy Birthday\" and we thought it was such a nice gesture! Later on that day, we received a birthday cake with a card from the manager - which they didn't have too - but to go that extra step, what a great way to treat your guests. Also our last night in town, we had booked a reservation at the hotels' restaurant \"Hawksworth\" which again on our deserts, they wrote \"happy birthday\" on them once more. Very nice touch! Rooms: We stayed in room 911 - which gives a view of the Pacific Centre. Spacious room, comfortable bed and pillows, loved the heated bathroom floors! Nice size shower - all around great room for your getaway. Hotel staff: I don't know and remember everyone name but trust me when I say: everyone on staff is so cordial and nice - and go above and beyond to make sure everything is perfect! Everyone knew us by name by the first day. The staff is all so pleasant and sweet! Matthew the concierge was helpful when planning our day trip to Whistler. The hotel offers complimentary Bentley car service, to drive you around in the downtown area and Jim (the driver) was great to us as well. He gave us a mini tour of Gastown and surroundings areas which was great! Last but not least, we asked Celina who works at the bar if she recommends a good restaurant, she said she didn't remember the name of a particular restaurant, so she told us she would text her boyfriend and get back to us. Long story short: when we got back from dinner that night, we found an envelope at our door, with a note from her and directions to the restaurants she recommended. I'm telling you, everyone goes above and beyond to make sure your stay is perfect! And everyone really did make us feel at ease and welcomed. The hotel itself: Located downtown therefore walking distance to many great shops and the Pacific Centre Mall is footsteps from the hotel. The famous 'Caffe Artigiano' is right around the corner from the hotel (btw great coffee!). It is also walking distance to Canada Place, Gastown etc. I did not try the fitness center but my husband enjoyed it. Would of loved to try the spa, perhaps on our next visit! The bar has great cocktails. Beautiful and classy hotel. Overall, great location, great staff, beautiful rooms - a must if staying in downtown Vancouver!", "Date": "January 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gibsons", "Title": "“Luxury at its finest!!”", "Author": "gibsonsmolly", "ReviewID": "UR123318261", "Content": "Just got back from a glorious two night stay at the Hotel Georgia. This hotel is impeccable!! I used to live in Vancouver and was always sad to see them tear down the old buildings downtown to replace them with glass and steel. So to walk in to the lobby of this hotel and see the beautiful restoration was wonderful. Old world charm meets modern day luxury. The attention to detail is amazing. Everything has been planned with the comfort of the guest in mind. The rooms are spacious and soooooo soothing. The luxurious bathroom with its heated floors, stand alone tub and glass walled rainshower is bigger than some hotel rooms I have stayed in. The service absolutely exceeded my expectations. Warm and genuine from everyone I encountered. I cannot remember when I felt so valued as a customer. The bar off the restaurant and the coffee shop are both great places to have a drink and people watch. They both attract a lot of locals and have a great vibe. I didn't get to experience the restaurant but local friends tell me the food is very good. For me this is the best location in Vancouver. Close to absolutely everything. For a medium budget I still love the St Regis. It offers great value for the price. But if you are looking for luxury you will find nothing better in Vancouver than the Rosewood Hotel Georgia. Worth every single cent!!!", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ireland", "Title": "“fabulous hotel and staff”", "Author": "lotstoseeanddo", "ReviewID": "UR123260631", "Content": "we stayed for two nights on the 14th and 15th january. check in was really smooth and fast, our room was just gorgeous - a decent size with a wonderful, really luxurious bathroom. the bed was a king size and was extremely comfortable but the pillows were magnificent! we didnt eat at the hotel but asked the concierge for advice. Connie was extremely helpful and knowledgeable and sent us to the Cafe Medina for breakfast which was great. we each had a massage. the spa area is very good and our masseure, Chito, was the best we have ever come across. none of this stroking and poking but a properly trained, knew what she was about, masseure. make sure you use the complimentary stretch Bentley which will take you about the downtown area. Jim the driver was great. My only complaint is that they charged to use Wifi. with the sort of prices you pay for staying this was a bit mean. having said that i would make this our hotel of choice and wouldnt even try any of the others because i dont believe they could top the Georgia.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "CA", "Title": "“Excellent Stay!”", "Author": "gz2000", "ReviewID": "UR123140830", "Content": "We stayed at the newly renovated Rosewood Hotel Georgia from January 12-15th (today!) for a weekend get away. What an amazing experience! - Our check in was flawless. Even though we arrived at almost 1am, Navi (sp? at the front desk) and Steven (at the bell desk) were extremely helpful. Navi recommended that we upgrade to a junior suite (for $25 per night extra, what a steal!). Steven gave us a tour of the room (heated granite floors in the restroom, amazing!). - Every time we called the front desk or the concierge, they were more than happy to assist us. - We never once had an issue with noise - Upon check out and as we were about to request for a cab to be called for us, a nice gentleman (Jim the amazing Rosewood Georgia Hotel Bentley driver) told us to catch the sky train. He walked us to the train station which was a good 5 minutes away, waited till we purchased our transfers, walked us to the actual train station, AND waited until we boarded the train!!! Who does that?! We kept trying to tip him but he wouldn't accept. Not only does this hotel have amazing and luxurious rooms it also has phenomenal people that truly care about the hotel guests. We'll definitely be back! Thank you Rosewood Hotel Georgia!", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great value”", "Author": "Jan N", "ReviewID": "UR123140342", "Content": "A totally positive experience, the room was very comfortable, modern and functional. The staff at check in, and for services were exceptionally responsive and knowledgeable. The very pleasing ambiance was an utterly positive surprise, from the Lobby, the Bars and Restaurants to the Room. Probably the best hotel I have stayed in for 30 years of extensive business and recreational travel in North America.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Texas", "Title": "“The standard!”", "Author": "MusicManTexas", "ReviewID": "UR122832017", "Content": "Hotel Georgia is the standard by which I will judge all hotels. From the staff to the exquisite refurb, everything was amazing. If you are on the fence about where to stay, bite the bullet.....you'll thank me later.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver", "Title": "“exceeded expectations!”", "Author": "ming m", "ReviewID": "UR122775336", "Content": "This is a beautiful hotel exuding a charming and elegant old-world quality. The rooms are beautiful and just as depicted from the photos on the website. The service is outstanding - everyone we interacted with, from the bellhop to the the fitness centre staff were friendly and professional. The bartender (Derek) at the hotel lounge was attentive and friendly and clearly knows his mixology! They knew we were celebration a birthday and the manager had a beautiful chocolate cake sent up for us - a lovely gesture on behalf of the hotel. My only complaint would be about the limited range and choice of the room service menu, and the moderate quality of the food (too salty and arrived lukewarm). For in-room dining at an establishment like this, I would have expected nothing short of superior. Nevertheless, we would definitely stay here again.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“Fabulous make-over”", "Author": "Adrienne C", "ReviewID": "UR122740349", "Content": "We booked two adjoining rooms: wonderfully well appointed, generously stocked. All hotel staff fantastic. Room service prompt, courteous and caring. Bar staff very attentive. Excellent French Martinis! Service in restaurant somewhat tentative and food mediocre. However, on the whole, this small glitch was offset by a team of pro hoteliers who know how to treat their guests without missing a beat.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“An amazing stay...”", "Author": "likebeingatourist", "ReviewID": "UR122536912", "Content": "What a fantastic renovation of the old Hotel Georgia! We stayed in a Junior Suite and the room was beautiful. The layout of the room was very well thought out. The living/dining/bar area was not too big but large enough to entertain a small group(4-6) and this left room for a luxurious bed & bath area and even a small walk in closet. The bathroom was beautifully appointed - large walk-in shower with rain shower head, 2 sinks/vanities, a separate toilet and the piece de resistance - a gorgeous soaker tub. Guests are provided with full size shampoo/lotion/bath salts so no more running out of bath products from tiny bottles. The bed was exceedingly comfortable with great pillows and bedding. The photographs on the hotel website are an accurate depiction of the rooms. We were very impressed with the service from all levels of the staff. The Hotel Georgia offers a perfect location combined with beautiful rooms, excellent service and extras like a spa, an outdoor patio and car service. We will definitely be staying here again.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Rosewood - excellent refurbished hotel”", "Author": "BrianHoban", "ReviewID": "UR122440498", "Content": "Stayed there for one night only - excellent staff and location. Lovely room - obviously new - great nespresso coffee in the room - what a bonus - better than the 10c cent drip stuff we had in the next 5 star hotel we stayed in!", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Langley City, Canada", "Title": "“Luxurious and beautiful”", "Author": "Richard M", "ReviewID": "UR121986629", "Content": "Newly renovated hotel with beautiful rooms, very comfortable and spacious. Overall architecture and interior design is gorgeous. Great location at the heart of the City, close to a multitude of interesting places to visit and shop. Can't wait for the Patio area to reopen in the spring.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Gorgeous”", "Author": "Jane M", "ReviewID": "UR121930976", "Content": "They've done an amazing job of renovating this hotel. Everything is just gorgeous and very good quality. The bathrooms are great with a huge bathtub. The bed was the most amazing I've ever slept on. Service was also very good. I'd love to stay here again and would recommend it in a heartbeat.", "Date": "December 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dublin", "Title": "“Top marks in all categories”", "Author": "munster07", "ReviewID": "UR121921274", "Content": "We stayed for three nights last weekend, making use of the '3rd night free' deal which is great value for money. The service levels in at the Georgia are the best I have experienced. Our every need was attended to. The location is the best available in my opinion. Right at the heart of the city. Once you step out the door everything is right there. The rooms are also of the best quality. The bathrooms are the best I have seen. We stayed on the 10th floor facing the art gallery which I recommend as the best view. Overall, I hope I have the opportunity to stay here again in the future", "Date": "December 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Rosewood is Amazing”", "Author": "Cuthanks", "ReviewID": "UR121866234", "Content": "We stayed at the Rosewood last night as the sleep-over part of a Company Christmas dinner at La Terrazza in Vancouver. I had googled the Rosewood prior to getting to the hotel and was a little blown away by all of the amazing praise it was receiving. Could this hotel really be that nice?? Answer: ABSOLUTELY!!!!!! From the moment we arrived to the moment we departed, my wife and I have never been so well treated at a hotel and its staff. From Jordan helping us with bags to Jim giving us a ride home in the Bentley from our dinner. The room was luxurious, the bed was paradise, nice heated tile bathroom floors with a soothing rain-shower. Thick, fluffy white towels and robes. Beautiful flat screen TV - very cool lighting though I must admit that I was a little intimidated in the early hours of the morning with selecting the right button without my glasses. Lots of power, wireless. We finished off with a jaw-droppingly great breakfast at the Hawksworth restaurant - I'm still salivating. Earlier my wife and I wandered down to the lobby to get a coffee and were directed warmly to the lounge area where free coffee and newspapers were provided. We plunked ourselves down into the comfortables lounge chair/couch and got our day off in the nicest way. All staff were courteous and so very friendly - it really felt like the staff truly cared and really want to be nice. No fake stuff here - just really nice folks. The two other couples that joined us for the night here all agreed over breakfast that we didn't want to leave and have to find an excuse to come and stay again. Trust us, we will be looking hard. Thanks so much to everyone at the Rosewood. Folks, if you're reading this, it's ALL TRUE. Can't wait to get back here. Please, please don't change!! Congratulations and Merry Christmas.", "Date": "December 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Too High Teck”", "Author": "dollysadie", "ReviewID": "UR121556362", "Content": "My stay was ok considering they could not get my radio to work in my room. Such high teck equipment that it became work to figure it all out. The pool area was fabulous but no jaccuzzi. The non alcohol drinks they offered in the lounge were new and amazing. Freash squeezed blue-berry juice, soda and lavender. You died and went to heaven and God gave you a welcome drink! The menu for food and drinks at this hotel are more advanced and futuristic than anything I have experienced in LA 5 star hotels. The Bentley driver Jim was my fav as he drove us to dinner and other places. Nice touch with the hotel car. But then again it is supposed to be a 5 star. It is worth a stay and the staff were wonderful. Very friendly as apposed to the stuck up ( God only knows why) Canadians that were at the hotel, all New Yorking on everyone, with their noses in the air. Mostly women. Maybe they were uptight because there are never any good looking men in Vancouver. I was born and raised in vancouver so I know of what I speak. Any hoo, go and stay there if you get the chance, it's worth the experience, and if you are a nice looking gentleman you can probably have your pick of the beautiful stuck up Canadian women. Me included!", "Date": "December 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Amazing Weekend”", "Author": "Serge555", "ReviewID": "UR121526052", "Content": "For anyone visiting Vancouver this is the place to stay. We were there during the Grey Cup and I would have preferred to stay in my room the entire weekend! The room was fantastic, the bed was amazing (we are in the process of buying it). The hotel staff were courteous, friendly and professional. They were extremely helpfull when looking for dining options as well as providing us with the information to purchase the bed. Amazing hotel, amazing location, we look forward to staying here again!", "Date": "December 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Best we've stayed in in some time”", "Author": "gasmanincanada", "ReviewID": "UR121475630", "Content": "Just stayed this month. Beautiful renovation. The rooms are very comfortable, well thought out, and luxurious. The staff are simply the best that have ever looked after us. We plan on returning soon and at the moment I can't imagine staying anywhere else in downtown Vancouver.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria, British Columbia, Canada", "Title": "“Intuitive service and they live up to it.”", "Author": "Lori V", "ReviewID": "UR121376654", "Content": "I've stayed twice at the Hotel Georgia since its re-opening and can't imagine I've ever had better service, a friendlier reception, and been made to feel as pampered and appreciated anywhere else in my life. I generally sleep poorly while away from home, but the comfortable beds, quiet ambience, cleanliness and luxury appointments of the room and the attitude and attentive service of the staff made me feel safe, secure and well able to sleep soundly. The staff all deserve special recognition- they really were intuitive, reading my needs well and anticipating my desires often before I even had to ask. This hotel made my business trip a true pleasure and better than some of the vacations I've had.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Alberta", "Title": "“Beautiful Hotel”", "Author": "JKiefer", "ReviewID": "UR121322240", "Content": "Lovely historic hotel that has been beautifully renovated. Clean, comfortable, and centrally located. Free wi-fi and great in room coffee. Also, very soft beds (pillow top). Staff was pleasant and helpful when asked, but did not really anticipate your needs and learn your name as is the case with most higher end hotels. Some of the small details were missing – but perhaps that is just because it is under new ownership. Their current service level does not refelct the price. Pool and gym facilities were great – but no hot tub or sauna which would be nice on the chilly, wet Vancouver days.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Cannot recommend enough - puts 4 Seasons to shame”", "Author": "Brian T", "ReviewID": "UR121231209", "Content": "Just stayed at the Rosewood Hotel Georgia in downtown Vancouver, and was really bowled over by the customer service and overall luxuriousness of the hotel. My boyfriend and I were treated like celebrities, from the moment we arrived. The hotel offers a complimentary car (a Bentley) to take you around Vancouver; the driver could not have been nicer. The room was very elegant, and the true highlight was the bathroom - heated floors(!), amazing four spigot rain shower head (!) -- I could move into that bathroom! On the same trip, we traveled to Whistler and stayed at the 4 Seasons. While our room was bigger, it was not nearly as nice or special as our room in Rosewood, and the customer service couldn't compare. Would def recommend the Hotel Georgia to anyone travelling to Vancouver.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "british columbia", "Title": "“One of the best hotels in years”", "Author": "travell66", "ReviewID": "UR121228531", "Content": "I was so impressed from the minute we stepped in till we left. The building and staff were exceptional. NOT one problem during the whole stay. I will return again and again. The pool was perfect for relaxation, perfect ambient temperature, perfect pool temperature and the salt water was soothing.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Surpassed every expectation.”", "Author": "Tlingo", "ReviewID": "UR121185075", "Content": "I have never experienced a hotel like this before. Every detail is meticulously thought out. The hotel staff are the true shining stars of this exceptional hotel, but that doesn't mean the building itself disappoints either. Employees are genuinely proud of where they work and it shows. The roomwas perfect The bathroom with enormous tub and bath salts, was a special treat, as was nightly turn down with fresh shortbread. The technology in the room (Bose sound system, Sony tv, and nespresso coffee, as well as perfect lighting for every need with convenient labelled one touch switches where you need them. (I hate fumbling around trying to figure out how to turn on a lamp... This is what I mean by every detail. You an even review a paperless copy of your room statement on the hotel menu integrated into your tv. The pool and fitness facilities leave nothing lacking either. With full gym and a heated salt water pool out of architectural digest. Everyone goes the extra mile to make you feel welcome, not in an overbearing hotel service kind of way, though. It's hard to explain but you leave this hotel feeling replenished, pampered, and part of a special secret, now that you know you won't stay anywhere else when you visit this incredible city. My husband and I stayed for two nights on our honeymoon. We are so grateful to everyone that made our time at the Hotel Georgia so memorable. The only hesitation I have in recommending this special place is I don't want it to be sold out next time I get to return!", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Whitehorse, Canada", "Title": "“be pampered”", "Author": "mex2009", "ReviewID": "UR121038350", "Content": "This hotel was fabulous the staff made us feel like like we were royalty the bathroom in our room was perfect heated floors and a giant soaker tub. This hotel is certainly worth the money though it is more then we would normally spend it was a great value pamper yourself.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Rosewood Hotel on Georgia has it all!!!”", "Author": "edward p", "ReviewID": "UR121033809", "Content": "I had a lovely time at the Rosewood Hotel. It is a very beautiful and elegant hotel. The pool is amazing, the rooms are amazing and the location is perfect. The hotel staff was the nicest they could be. Very gracious and very accommodating. The service was outstanding. In fact, the Bentley driver was extraordinary. I think he made our trip. Dudley was his name, and he went out of his way to show us all the beautiful spots in Vancouver. He is the perfect chauffeur like you would imagine, in a movie. I don't know what they are paying him there but it's not enough. Me and my family have never felt more welcomed and special . . . Thank you Jim!!! Best part of our trip!", "Date": "November 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Spectacular hotel”", "Author": "LAS_50", "ReviewID": "UR120952550", "Content": "Beautiful hotel recently lovingly restored. Rooms are beautiful with every detail considered, staff are wonderfully attentive. Would highly recommend.might be the nicest hotel I have stayed at", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Abbotsford, British Columbia, Canada", "Title": "“business stay”", "Author": "Andy R", "ReviewID": "UR120878285", "Content": "In an age of almost expected mediocrity, I was floored by this hotel. I travel on business and I can say that this hotel is a cut above the rest. The staff are genuinely warm and pleasant, not drippingly patronizing as I often see. They care about your stay. The room, the food, the staff, the amenities, WOW", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cheltenham, United Kingdom", "Title": "“We came to Vancouver from England for a family wedding”", "Author": "Michael W", "ReviewID": "UR120660490", "Content": "The bridegroom chose this hotel. It was absolutely superb, from the decor, facilities and comfort levels to the friendliness and superb service from the staff. We have no hesitation in giving an unqualified recommendation for our stay", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Best Hotel Service Ever!”", "Author": "Fisch78", "ReviewID": "UR120635877", "Content": "I wish I could be pampered like this every day!!! The hotel is beautiful overall, the bathrooms in the rooms are fabulous, the bed was as comfy as they come, the drinks at the Hawksworth were delicious...and being driven around in a Bently isn't bad either!!! We went for a little getaway for my boyfriends birthday and after we arived back to our room our first night out they had left him a birthday cake. Connie, the concierge, happily took care of everything we ever needed including follow up phone calls and cards to make sure everything went ok. I can't say enough good things about this hotel...if we ever make it back to Vancouver this is DEFINITELY where we will stay!! Oh, and the location couldn't be better for access to all the areas of downtown Vancouver (and public transit)!", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“The Best Hotel In Vancouver”", "Author": "Kyle U", "ReviewID": "UR120627231", "Content": "If you are coming to visit Vancouver or just getting away for a night or two (which is what we have done), the Rosewood Hotel Georgia is unquestionable the best hotel in the City - you will not be disappointed!", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Seattle", "Title": "“Outstanding property and great service”", "Author": "CostaJohn", "ReviewID": "UR120586545", "Content": "I've stayed in many, many hotels around the world and this place compares favorably to all of them. The recent remodel was exceptional. Hotel with character but all of the benefits of a new, modern design. The service was truly exceptional and rates up there with the best of the hotels. Conceirge was extremely friendly and helpful. Nice having a Bentley to drive you to your dinner reservation and Jim, the driver, was great....... I would definitely stay there again.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Beautiful hotel with terrible soundproofing”", "Author": "Cocodela", "ReviewID": "UR120541631", "Content": "I stayed in this hotel as a weekend getaway. Wanted a great place to sleep in, that had a great bath and just do nothing for two days. Unfortunately that was not the case. The hotel is beautiful and the price is as I would expect for the this class of hotel, the lobby is grand and inviting although the floor lights at the check in desk are absolutely blinding and should have been done with a frosted glass instead of the clear lenses that they used. I had to place my luggage on them so that I could see across the desk. My room (deluxe) was stunning, great linens, and the the tub for two is a perfect way to spend a few hours on a cold Vancouver day. As far as the room itself there are only two things I would change, first the tv is a little small for a room his size so watching movies in bed is a little tough. And the reading lights on the bed don't work so you can't sty up and read without disturbing the person next to you. The teeny flaws in the room could easily be overlooked if it wasn't for how loud this hotel is. Even with the windows closed you could here all of the street noise which might not have been so bad if the Occupy Vancouver protest wasn't going on. I barely slept and when I did was woken up early to the sound of drums. I stay in Vancouver often and always like to try new hotels in the downtown but don't remember any of them being as loud as this one.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“More than a lucky break... fantastic hotel!”", "Author": "Dave67109", "ReviewID": "UR120515370", "Content": "I don't usually write hotel reviews but this was truly one of the best hotel experiences I have ever had. Stumbled onto this hotel when I needed to book last minute accommodations for a medical conference a few blocks away. The conference hotel was booked so I surfed around and read the great reviews of the Rosewood Hotel Georgia. The reviews did not do it justice... this place is fantastic! Was pleasantly surprised to arrive with a upgraded room with a soaker tub. Staff was over the top friendly and approachable, and extremely helpful with any inquiries. For a hotel of its size, it has maintained its warm boutique feel, and the staff seemed to always know your name each time you came and went. The rooms were simply spectacular, and I was so glad that I wasn't able to stay at the conference hotel down the street, as nice as that was. Even better since I found an online deal for $155/night with the 3rd night free, and I stayed three nights. Can't imagine anything of comparable quality that would even come close to that in all of Vancouver. Easy access directly to and from the airport with the Sky Train (~25 mins). Spectacular lobby, spotless, quiet hallways, and absolutely beautiful rooms. The espresso coffee machines in the rooms made for a wonderful way to start each day. I will certainly be back to the Rosewood Georgia the next time I am in Vancouver.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Absolutely beautiful!!”", "Author": "Marla62", "ReviewID": "UR120476693", "Content": "My husband and I just returned from a stay at the Rosewood Georgia Hotel in Vancouver, B.C. I don't think I have to tell anyone what an amazing city Vancouver is...but I just had to write about the Hotel. It is totally state of the art. It took my breath away. It oozes with the utmost of elegance. I have stayed in some beautiful hotels in Europe and New York...but they did not compare to the Rosewood Georgia in so many ways. Wish I could have stayed longer..... Marla", "Date": "November 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“The Best of the Best”", "Author": "A_regular_traveler57", "ReviewID": "UR120397381", "Content": "I travel extensively – for business and pleasure – and have stayed at hotels of the calibre of the Rosewood Hotel Georgia all over the world. My recent stay at this property was exemplary! From the moment I drove in, the doormen were welcoming, the Front Desk staff professional and hospitable and the Concierge went beyond his duty to secure me a table at Hawksworth at a time when the restaurant was over-subscribed already! The suite was inviting and the bed – quite honestly - I didn’t want to get out of it! Without exception, the staff were trained to the max. Congratulations! I look forward to staying at the Rosewood Hotel Georgia again soon (on a personal level) and recommending highly recommending property to my business clients as well.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "on the road", "Title": "“Five star at its best!”", "Author": "SagMoonTravels", "ReviewID": "UR120374111", "Content": "Absolutely stunning – five star at its best! The décor and attention to detail is superior and it is perfectly located in downtown Vancouver to maximize your experience. The quality of the staff is what I believe makes this hotel extra-special – they are friendly, vibrant and professional and each person goes out of their way to make you feel welcome. The rooms are spacious and beautifully decorated – one feels completely pampered. I especially loved the Nespresso machine in the bedroom and the luxurious bathroom with heated marble floors, top quality toweling and robes. Not to mention the his and hers vanity and the rain forest showerhead. The room has pretty much everything you could ask for. The art in the hotel is worth pausing for, especially the 3D painting in the foyer (amazing!). The dark wood and marble surrounds adds to the luxurious atmosphere and the salt water pool is incredible. The only negative in our experience was in the gym - the treadmills are poor quality (no cushioning and sticks when you run) so we could not use them. The rest of the gym, however, had good quality machines and weights so we could still have a good workout. If you are visiting Vancouver and you want to treat yourself, this hotel is a must – you will LOVE it! We will definitely be back!", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“The Absolute Apex of Hospitality”", "Author": "TurtleCreekTraveller", "ReviewID": "UR120212609", "Content": "As other reviewers have eloquently stated, the Rosewood Hotel Georgia is indeed special and its list of outstanding qualities quite long. The restoration of a heritage building has been gorgeously executed, both in public areas and the rooms themselves. At every turn one finds a fixture, texture, or material of interest or an appreciated touch of luxury. From Hawksworth restaurant to the salt-water pool, every touch is artfully presented, and the room, bed, and bath are truly top-drawer. As much as I love the property, service is the element that places the Hotel Georgia in a league of its own. Everyone is warm, caring, sophisticated, truly kind, and so very good at what they do, as evidenced by: *A U.S. customs and immigration form sent to my room the evening before departure by Connie from concierge services. First time any hotel has ever had that level of forethought and attention to detail and I travel internationally many times a year. *On the morning of checkout, my excellent housekeeper who kept the room spotless, calls me by name and shared that she hoped I had enjoyed my stay. *Jim will put you in the Bentley saloon and truly transport you to a different place. He is gifted and passionate and the moments whiling away with him are truly special. Obviously I'm smitten along with the majority and the property is virtually perfect. I'd only make a few small observations: *As others have stated, one does hear a bit of outside noise if facing the street, so it would be nice if the high setting on the room's fan system were a bit more effective in generating white noise. *A sauna and steam room would be a great addition to the tremendous amenities. *Some properties offer excellent views of the harbor and Stanley Park and Hotel Georgia isn't situated well for that. I'm anxiously awaiting next year's Conde Nast Gold List, expecting Hotel Georgia to quickly take a vaunted spot, and if you have been looking for service that will leave you smiling, I suspect you've found it!", "Date": "November 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cayman Islands", "Title": "“A great addition to the Rosewood brand.”", "Author": "Paul A", "ReviewID": "UR120132596", "Content": "I had previously stayed at the Rosewood Sand Hill in CA twice before on business and so my expectations for this visit were set high... and were greatly exceeded. I knew that this was a reno'd historical hotel, so was not 100% sure what to expect going in but chose this hotel for a 3-day family stay leading up to business meetings at the hotel the following week. The room we were in (a Deluxe room with two beds - we had a complimentary and very nice roll-away bed for our other child) was fantastic. My family and I were treated like royalty, from the teddy bears for the kids upon check-in, being addressed by name, the kids' bathrobes in the rooms, the complimentary Bentley rides to locations nearby, the very (but appropriately so) attentive and eager-to-please concierge, check-in, parking, door and bell staff. The driving instruction cards for nearby attractions were a valuable item provided by the concierge desk. I cannot say enough about the service provided by the entire staff and the way they made us feel so welcome and valued. Will definitely stay there again. Two small bits of feedback we provided the hotel were that (our room category, at least): 1) was short on drawer space to store our clothing, so we literally lived out of our suitcases for an extended stay, and 2) our room did not have a bathtub for our three year-old, so she got to experience a shower for the first time. Honestly, though, these two minor inconveniences were completely overshadowed by everything else we experienced during our stay. By the way, all the attendees of the business meetings which followed after my family left were equally impressed by this hotel and its staff. You can't beat the location of this hotel either.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“A modern Treasure”", "Author": "Jinna_11", "ReviewID": "UR120054153", "Content": "The new facelift was worth the wait. The interior brought back class and elegance to Vancouver. The Staff and congeriege were helpful and attentive. The rooms were very tasteful and welcoming, the beds I would compare to sleeping on a cloud. The 1972 lounge of the hotel is very quaint and cozy, the wait staff gave excellent service.Hawksworth restuarant is a vibrant and up beat lounge, great selection of drinks and snacks. Another great attribute to the hotel is the location is in the heart of Vancouver with everything within a few blocks away.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Absolutely the Best - and I've seen them all”", "Author": "theLuckiestGuy", "ReviewID": "UR119915397", "Content": "Absolutely incredible. This is the hotel Vancouver was missing. More like Toronto's Hazelton than the Loden. Attention to detail and decorating excellence like the Peninsula in Beverly Hills back when it was brand new. This is the new benchmark.. Toss the Fairmont Pac Rim (I've stayed in the Pacific Rim's Chaiman's suite for a week and liked this place head and shoulders better). Unfortunately the Loden and Opus are out - Poor Locations. Toss the Sutton.. (wayy in need of updates) Toss the Bayshore.. old and routine with just a few great rooms.. Toss the Four Seasons.. It's right across the street and this place pput's it to jawdropping shame. There is not another hotel in the city of Vancouver, not one that you want to hang your hat at after you've stayed here. I would come back to Vancouver JUST for this hotel. THAT's how you know when you've found the best - It just completely and unequivocally blows your hair back. I've stayed in more hotels in my life than I care to remember and I predict that this place will have waiting lists within a year. Note to management: Take the yoga room that nobody is using and put some freeweights and a bench in there.. The gym had no free weights.. That's the only fault.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jasper, Canada", "Title": "“Wonderful surprise!”", "Author": "Beth C", "ReviewID": "UR119846610", "Content": "We thoroughly enjoyed our 4 night stay at the Hotel Georgia. The building and finishes are beautiful. Every staff member we encountered from concierge to housekeeper had a genuine interest in making our stay an enjoyable one. We felt absolutely pampered. The bed was extraordinarily comfortable with luxurious linens. The bathroom felt like a spa with heated marble floors, fluffy towels and cozy robes. The espresso machine was sweet as were the shortbread cookies with the turn down service. We also took advantage of the stunning saltwater pool and the complimentary car service (nice Bentley!) We would not hesitate to recommend this hotel, based on the outstanding service alone.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Derbyshire, UK", "Title": "“Wow!”", "Author": "gubbs79", "ReviewID": "UR119841719", "Content": "Really can't describe how much we loved this hotel (but I'll try!) We've been back home for nearly a week now and we still can't stop talking about it. There were so many luxurious details, which - combined with the outstanding customer service - all added up to a feeling of having been totally pampered. It's one of the few hotels where I can honestly say the room looked as beautiful as the glossy official website photos. All the staff were excellent and the downtown location was central, yet we didn't notice any excessive street noise (we were on floor 7). The attention to detail that has obviously gone into recreating the ambience of the original hotel really works. The bed was so comfortable, the turn-down service included several thoughtful little touches, the heated floor in the bathroom was great and the rainforest shower was amazing. We decided to have breakfast in the Hawksworth restaurant one morning and it was delicious, again with impeccable service. All in all I would thoroughly recommend this hotel to anyone wanting to treat themselves to a luxurious hotel experience at a non-outlandish price.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Perfect, luxurious, wonderful staff”", "Author": "RazzTazz23", "ReviewID": "UR119710487", "Content": "Wow. This hotel is brand new and its location is great. We walked everywhere from the hotel on our mini vacation or took advantage of the house Bentley when we could. The hotels itself is gorgeous. Beautiful dark wood and marble everywhere. This was renovated to the highest standard. The pool is gorgeous and the gym is large with lots of machines. There is a business center with a printer and computer if you need it. The hotel’s bar is very nice with great service, good drinks and excellent food. The staff is great. Housekeeping kept out room clean and was very prompt with requests. They did little nice touches such as leaving out some glasses cleaner when they saw our glasses sitting on the counter in the bathroom. The concierge was superb and the house car driver, Jim, was a delight. Check in was painless. The rooms are great. Big comfy beds with top quality linens. Huge marble bathrooms with gorgeous rain showers. A big flat screen Sony tv. A nice espresso machine. Pretty much every amenity you could think of was in the room. I highly recommend this hotel. One of the best I have stayed in. A surprisingly good value too - we had a very reasonable rate.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chilliwack, British Columbia", "Title": "“VANCOUVER'S BEST HOTEL”", "Author": "Karenlovestotravel55", "ReviewID": "UR119694523", "Content": "We had the pleasure of staying for 3 nights at this stunning hotel. The furnishings are beautiful, the bathroom is gorgeous; however, what makes this hotel stand above and beyond the rest is the people who work here. Everyone seems to really, really enjoy their jobs. They made us feel like we were genuinely welcome at their hotel. They couldn't do enough for us. Everyone at the concierge desk was more than helpful and the driver of The Bentley was very professional and friendly. We will definitely be back and would recommend this hotel to anyone looking for some pampering. Did I mention the bed? - the most comfortable we have ever slept in!", "Date": "October 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "san francisco", "Title": "“Exceptional in every way !”", "Author": "tripgal1", "ReviewID": "UR119670843", "Content": "We stayed in both a Junior and 1 bedroom suite. The rooms were spacious and loaded with amenities! Enormous tub, heated bath floors and the largest shower ever. The Jr suite was an interior courtyard room and proved to be quieter than the corner suite. The one bedroom suite was situated on the corner of the intersection, offering plenty of light with large windows on both exterior walls. The separate bedroom with desk and sitting area, extra bath, pantry, dining area and living room all proved the 1 bedroom to be functional, comfortable and welcoming. Mesmerizing views of the city lights and historic architecture across the way. Service - warm and welcoming throughout! Always friendly, efficient and informative. Hotel car was uber-convenient and the driver = what a gem! The fine details everywhere on the property made this trip spectacular. Wish we were in Vancouver more often.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Fantastic Experience!”", "Author": "Christina L", "ReviewID": "UR119526432", "Content": "I had the pleasure to stay at Rosewood Hotel Georgia. What an amazing Hotel. The staff was so service minded, I stayed in a Deluxe Room and had the best bath ever! I was attending a meeting. Banquet staff was very attentive and the food was great. I loved the natural light in the meeting space. Thank you Rosewood Hotel Georiga for a great stay and for making our meeting a sucess.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Little piece of heaven right in Vancouver”", "Author": "LadyLuxe14", "ReviewID": "UR119314632", "Content": "Husband and I stayed at Georgia after an amazing wedding we've photographed in Yaletown. I've been to Georgia a few times before but not since the renovations and I was delighted to see that the old world charm is still there but amplified with lavish modern updates. The staff was absolutely incredible from the moment we walked in- bride and groom in tow- to the moment we checked out the next day. On Monday, I received an email from one of the reps making sure that our stay was nothing short of perfection. It really was. We were exhausted after a long day of shooting but we stayed up extra late to look around the hotel and our suite and enjoy the amenities...and late night snacks. Highly recommend the room service menu- it was so tasty! Cannot say enough about this place- we've stayed at many wonderful hotels but Georgia raises the bar. From the little things such as the privacy button right next to your bedside (no more annoying door knob hangers!) to the most comfortable beds, to gorgeous decor...I could live there. I have never experience such a smooth and pleasant check-in/check-out. The best part? Georgia is in Vancouver! All the luxury, beauty and sophistication without airfare. It is a \"must stay\" whether you live here or just visiting. I simply cannot wait- in fact working on an excuse ;) - to visit it again very soon.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kirkland, WA", "Title": "“Delighted!”", "Author": "Over_the_River", "ReviewID": "UR119241117", "Content": "The title describes how I felt at every turn during our stay at the Rosewood Georgia. From our warm and personal greeting when we arrived quite late in the evening to our super smooth checkout (shall we leave it on your card? would you like the receipt in email? can I call you a cab?) we found much to be delighted about. A surprise bottle of bubbly and chocolate covered strawberries courtesy of the manager to celebrate our anniversary. Excellent food and service in Hawksworth. Cookies and fresh ice each evening when we returned to our room. Luxurious bed and enormous bath with high quality amenities. Staff at every engagement determined to exceed whatever expecations we had about hotel service - and wildly succeeding. Beautifully decorated room, free bottled water, free wifi, internet access through the TV - where's a keyboard? exactly in the first place we looked for it. We did either have issues with getting in room movies on our TV, or there were none, which was odd, but we quickly moved on to other opportunities. Some noise from the road below, but much better than many city center hotels. The package with breakfast (restaurant or room service) and parking was a great deal. They helped make our anniversary wonderful and we will definately be back.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "fraser lake BC", "Title": "“Awesome!”", "Author": "maygen28", "ReviewID": "UR119230772", "Content": "I have been visiting the Hotel Georgia since I was a little girl and had my 19th birthday there long befor it was closed for renovations. I have been looking forward to the re-opening for a long time and was very excited to see that I could stay here this time I was passing through Vancouver. Seeing as you get you're 3rd night free right now it makes staying that much more awesome. Check in, is a breeze. The bellman was very friendly and helpful making sure to explain how all the lighting and tv works. About 10 minutes after checkin they will call to make sure you are satisfied with everything in your room. I was on the 7th floor facing the art gallery. For some people you may find it a bit noisy, however city noise doesnt bother me. The view was lovely. The room itself is lovely. The bathroom is FANTASTIC!! And in all honesty the bed is THE MOST comfortable bed I have ever had the pleasure to sleep on. Truly fantastic! The pool is beautiful and although I didnt use the fitness room it looked great as well. I had breakfast twice and dinner once from roomservice. Again it was fantastic. Great service and great food. Hawksworth's is definatly worth a visit. I went for dinner. My server was efficient, knowlegable, not pretentious, and didnt hover and wasnt overly flamboyant which is what I prefer. To say the food was fantastic is an understatment. The drinks were amazing! Wow! Try a mint julep! Also the lobby bar is a nice place to have a quick bite and a refreshing drink if you have been out enjoying the city. Last time I was in Vancouver I stayed at Shangrila. In my opinion the Hotel Georgia is the BEST place to stay in Vancouver. I will not stay anywhere else in future visits to the city. If you are thinking of booking for a special occasion. Dont hesitate! You wont be dissapointed :)", "Date": "October 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“We will be back! AMAZING!!! hotel and staff”", "Author": "lior m", "ReviewID": "UR119199436", "Content": "Walking into this hotel was just magical. A lovely gentleman named Brian greeted us at the door, and we have never felt so welcome in a hotel establishment. They have managed to create an oasis of quiet, beauty, cleanliness, aesthetic sophistication, and luxury. The rooms are beautifully appointed and the entire hotel smells fresh and sweet. The maids came by twice daily, and our lady even thoughtfully placed our books on the bed when she turned it down, leaving the lights dimmed and shortbread cookies and water by the bedside with our slippers. We felt like royalty returning to our palace at the end of each evening. The staff of this hotel is just AMAZING, and the staff at the Concierge (Heather, Connie and Rob to name a few) desk made our trip ever more delightful with helpful recommendations... Jim is such a lovely sweet guy - you will find out who he is when you stay at the Rosewood Hotel Georgia. We came for the second part of our honeymoon, and we hope to return OFTEN!!! I can't recommend this hotel enough.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Colorado", "Title": "“Dreamy hotel, attention to detail and staff top notch!”", "Author": "ASC92", "ReviewID": "UR119054553", "Content": "We were fortunate to stay at the Rosewood Hotel Georgia within the first 2 weeks of its opening. I travel a fair amount and have a very critical mind, but this hotel stay was nearly perfect in all ways. The extensive restoration retains the classic nature of the hotel, but incorporates almost any modern convenience one would want from a luxury hotel. From very first moment, making our reservation, the care and pride of the staff was clear. Dianne took personal care with our reservation, even though we were booking with the opening special rate. We arrived almost 2 hours before I had predicted and several hours before the official check in time. Grace checked us in and went to check the room to ensure it was ready for us (it had been cleaned but not signed off on yet). She came back down and informed us that it smelled like smoke (who smokes in a brand-new non-smoking hotel??). Even though we were early, they did not make us wait for another similar room to be available; they immediately upgraded us to a junior suite. Simply amazing service. Next great surprise, a knock at the door and the manager sent a bottle of sparkling wine and delicious chocolates, wishing us a happy anniversary (our 9th) (Dianne had asked when booking). The suite was unbelievable. Brand new so everything was perfect. But was also so tastefully decorated, conveniently laid out, and luxurious. We especially enjoyed the Nespresso machine (here's my one complaint, they offered only non-dairy creamer in the room, though the concierge kindly sent up half&half when I brought this up), the heated bathroom floor, the super comfortable bed, and the tv screens that acted as computer screens. Turn down and housekeeping fantastic. Bookmarks placed in books, cleaning wipes placed next to glasses cases, every thoughtful gesture made. The pool, spa and restaurant were great and as with the rest of the hotel, the staff were so genuinely excited about the hotel and eager to help, they made it all the better. We were poking around the conference rooms one night, and the conference manager saw us and gave us a full tour; again, his enthusiasm for the hotel was palpable. And don't miss a Manhattan in the hotel bar. A final quick mention of the wonderful concierge team. Everyone was ready and more than able to give great suggestions. Robert particularly took us under his wing with great charm, insight and just plain joy. Bottom line, only problem with this hotel is that you will never want to leave, which is a pity in such a great city. If you do, you're close to everything so wander from time to time!", "Date": "October 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“A superb hotel!”", "Author": "zitzapper", "ReviewID": "UR118984805", "Content": "The rooms were commodious. The staff was accommodating beyond belief. The Bentley sedan and driver (Jim) were a pleasant surprise and very much appreciated. I definitely would recommend this hotel to anyone.", "Date": "October 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "canada", "Title": "“Retro Hotel with modern touches”", "Author": "traveller3232", "ReviewID": "UR118972477", "Content": "This hotel just re-opened in July after a top to bottom reno. It is a gorgeous building in a great central downtown location. Everything has been done to give that vintage look with modern conveniences. Walking distance to the water and shopping. Room was amazing with quality everywhere. Service was top-notch. Cool 4th floor lounge for patio drinks. Pool is small and was on the cool side for temperature. I would put this place up there with other 5 star Vancouver hotels such as Shangra-La. You will not be disappointed", "Date": "October 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Alberta, Canada", "Title": "“Beautiful”", "Author": "MSV3534", "ReviewID": "UR118966756", "Content": "This is probably the nicest hotel I have ever stayed in. The hotel and rooms were just gorgeous. The hotel staff was wonderful and extremely helpful.", "Date": "October 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“We could not find any flaw”", "Author": "AradTraveler", "ReviewID": "UR118912813", "Content": "It is rare to visit a city and want to return for the hotel. The service at the Georgia was warm and exceptional in all areas, the room wonderful and every need was anticipated. Somehow our names were remembered even if we were only there for one night. They prepared a wonderful minicake at breakfast for my husband's birthday. A truly superior staff; the hotel excels in all areas. Also a new excellent restaurant just opened in the hotel, very much worth trying for both food and design and ambiance.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hope", "Title": "“Exceptional Service at the Rosewood”", "Author": "mfuson77", "ReviewID": "UR118904890", "Content": "I selected the Rosewood over all other hotels in Vancouver mostly because I do like that old world charm they have maintained coupled with recent modern technologies. I found the valet, bell and front desk staff extremely attentive from the moment I arrived. The staff was very apologetic that I was frustrated at how hard it was to get into the valet parking area. I had to circle the block 3 times (Friday afternoon rush hour) which took almost half an hour. I can't blame the hotel for the traffic but the construction next to the hotel does obstruct the valet driveway which made entry to the hotel confusing. Once I was inside the staff took care of everything! The front desk was fast and efficient, the bell service was at my room within two minutes of my entry into the room and they even had a hotel staff showed me to my room and introduced me to the features. The room itself was elegant and tastefully decorated. Truth be told I had hoped to get a room on a higher floor (quieter) and a room with a separate sitting area. I didn't complain at the time so I shouldn't complain now, having said that I did like my room. I really enjoyed the rain shower and toiletries and the bed was very comfortable. Channel selection on the TV seemed limited and I had no pay per-view movies - only porn movies which seemed odd. The complimentary internet also worked great! My only complaint with my room was the noise from outside - which I knew I higher floor would have helped with. Another feature I liked were the historical cards turn down left in the room. These cards had information about celebrities that had stayed in the hotel, when they were born and died. One was about Elvis which I had to point out to the staff had the wrong date of death - they had 1970 written in the card. I know the last 7 years of his life weren't remarkable but I don't think we should forget about them entirely! I also did a spa treatment at Sense which was fantastic. The staff was incredible and beckoned to any need that I may have had. The pool was also nice; it's rare to have a lap pool in a hotel which I do enjoy. The entry to the pool was awkward, through the spa - and I think they could use some more signage in this area to help guests. I also used the gym. I'm a gym rat by nature and hotels never come close to offering weights that I can lift. The Rosewood gym was well equipped with Cardio equipment and they offered a series of machines for weight training - no free weights though. They need some rubber grip mats under the weight machines - the machines slide around on the wood floor when you are lifting heavy weights. In all it was an excellent hotel gym. I ate at Hawksworth for breakfast one day. The food was awesome! I also ate in the 1927 lounge which I would have loved to have sat in for longer. The 1927 lounge had great ambiance and a terrific barkeep! I also took advantage of the complimentary Bentley for a ride to the symphony which made the evening that much more! All in all I would highly recommend the Rosewood. Every hotel has issues, and the few issues the Rosewood may have are minor. The largest asset this property has is the staff, which is second to none! Everyone always stopped to talk to me regardless of what they were doing. If I was waiting for the elevator the housekeeper would stop and chat. It was a very welcoming property!", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Palmerston North, New Zealand", "Title": "“Best hotel ever”", "Author": "Warren M", "ReviewID": "UR118898538", "Content": "Absolutely fantastic hotel. It had everything. We stayed 3 nights in a Premier Executive Room and got a great deal - book 3 nights and pay for only two. Hotel has undergone 4 years of renovation according to one of the staff where they halved the number of rooms and it really shows. Huge room with a lounge area. Huge bathroom - double vanity either side of the bathroom, huge designer bath and a shower you could fit half-a-dozen people in with ceiling rain shower. Fantastic flatscreen TV which also came with free Internet connection. Our iPad and laptop where also easily connected into the hotel's free wireless. Staff were fantastic and really know what service is - obviously a focus of the hotel and it shows. Everyone chats to you and are really helpful. Concierge desk was great with several great restaurant recommendations. This will be my Vancouver hotel!!!", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Living in the lap of luxury!”", "Author": "KBLB76", "ReviewID": "UR118893503", "Content": "An beautiful Victorian style boutique hotel recently remodeled has made my list of best places I have ever stayed. Our recent night at the Rosewood Hotel Georgia has convinced me I will never stay anywhere else in Vancouver. Amazing! There were so many things I loved about it, I could go on forever. But just to name a few...first off the employees at the hotel from the valets, to the front desk to the concierge and management are first class. I don't believe I have ever been treated more kindly and felt more valued as a guest as I did at this hotel. Next, the room...wow! What can I say, other than amazing! The bed was the most comfortable I have ever slept in at a hotel (Italian linens, big fluffy duvet, feather bed, etc). The room was spacious and the amenities amazing from the free standing tub, to the rainfall shower, dual vanities and two high tech switches for the all lighting, making it so easy to turn on all the lights, which lit up the room wonderfully. Not the usual strain to see across the room lighting which most hotels have. Finally, the little details of service like the turndown service where velvety soft towels and pillowy soft slippers are placed at the side of the bed, or the surprise birthday cake from management in our room and the wonderful espresso maker instead of the usual stale, bland coffee and cheap coffee makers usually found in hotel rooms...all of this made my one night at the Hotel Georgia the best night I have had in my many hotel stays, and just to give you a frame of reference, I do consider myself, a \"hotel snob.\" I am very picky about where I stay. Needless, to say, I cannot wait to return! And to top it off Sunday Brunch at Hawksworth restaurant was wonderful! Thanks to all at this hotel for making our stay so memorable!", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "dallas texas", "Title": "“Excellent staff that consistently exceeded expectations.”", "Author": "fcsoft", "ReviewID": "UR118816679", "Content": "The room had a great view of the Vancouver Art Gallery and was very comfortable. Every person at the hotel was upbeat and went out of their to make us happy. Our first night we requested a taxi. The next thing we know the staff arranges the hotel's Bentley to drop us off for dinner. What service", "Date": "October 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Fantastic experience”", "Author": "Jimmyunderwood", "ReviewID": "UR118674078", "Content": "My father and I have just returned from a fishing trip to Canada, during which we stayed at the Rosewood Hotel Georgia for 3 nights from 17th - 20th Sept and I have to say having stayed at many luxury hotels worldwide this is undoubtedly one of the best, the rooms are a decent size and the beds very comfortable. But what makes the difference at this hotel is the staff, we found every one of them extremely courteous and helpful and you get the feeling that they genuinely enjoy working there. A special mention goes to Michael the concierge who ensured we ate at the best restaurants and maximised our stay as much as possible. All in all I would say well done to the management at the hotel who have formed an excellent team coupled with a real luxury feel. Keep up the good work. James & Bob Nottingham, UK.", "Date": "September 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kelowna, Canada", "Title": "“Beautiful Hotel”", "Author": "lazigirl", "ReviewID": "UR118583395", "Content": "Beautiful hotel. Newly opened. Huge room with sitting area, best bathroom in a hotel I have stayed in. Great room service. Didn't eat in restaurant however. Staff very friendly, helpful. Few teething problems but nothing that interfered with our stay. Room quiet, bed so comfortable. Loved the small touches- the slippers, cookies at turn down, the products in the bathroom.Hard to be critical of anything! Will stay again", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arlon, Belgium", "Title": "“Excellent hotel...housekeeping might be improved”", "Author": "cricrides", "ReviewID": "UR118579853", "Content": "I spent 3 nights in this brand new hotel. Extremely warm welcome and the staff is very friendly. The spa is excellent, nice fitness room and for once, a swimming pool of a decent size. Rooms are big and the bathroom is extremly well fitted! I loved the shower! One negative point is the house keeping: - don't run your fingers on the plint, they are full of dust. - clock on the bed side tables was dusty when I arrived and remained dusty until I left... - Bathroom floor has not been cleaning during the entire stay... I would expect from a hotel in this category, to have a perfecly clean room and at least have a bathroom cleaned to perfection...every day.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Surrey, Canada", "Title": "“Not equal to the build-up, or price”", "Author": "Mary1930", "ReviewID": "UR118395258", "Content": "We were greeted promptly and efficiently by the valet and bellman but the front desk person was by himself with a line-up of people waiting to be helped. Lots of noise from outside streets. Eyeglass wipes at turn-down were a nice, different touch. I was disappointed to find the room small and with several items not working, such as the TV or the headboard lights. The headboard lights, we were told by the staff, did not work in any room. The TV was also not repaired before we left. We don't know what was the matter as no one followed-up with us after maintenance attended.", "Date": "September 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Long weekend trip to Vancouver, BC Canada”", "Author": "Robert M", "ReviewID": "UR118389997", "Content": "We stayed at the Rosewood Hotel Georgia in Vancouver for three nights in September,2011. The Hotel was originally built in 1927. The Rosewood group completed a four year construction project in July, 2011. It is a great hotel with quality staff from check-in, concierge, bell captain, valet parking and a Bentley car, with driver, for less than 5 Kms from hotel. Our room was good sized with a sitting area, large flat screen TV, ample closet space with a great bathroom with two sinks, great overhead shower as well as a bath tub. The electrical lighting system was great throughout the hotel room. The Hotel has a great restaurant called the Hawksworth, on site as well as two bars/cocktail areas in the hotel. We would without doubt stay at the Rosewood on our next trip to Vancouver.", "Date": "September 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Wow”", "Author": "spuzzum72", "ReviewID": "UR118346084", "Content": "I will not repeat what has already been said here except to note that I visit a lot of hotels and very few impress me as much as this one did. The rooms, service staff, overall experience are first class. No details are missed here, yet it remains unpretentious. I was impressed when I came in from errands very under dressed, just looking like another tourist and asked for directions to the washroom on the main floor. They did not know I was a hotel guest but nevertheless the front desk staff smiled and pointed me to the washrooms, then called over a concierge walked me there. Little things like this MATTER! Kudos to the HR people at Rosewood, they obviously know how to find the right people for the industry. The only things I could complain about are completely outside of the control of the hotel, such as sirens and other street noise ( which where very acceptable with the windows closed). The noise levels insdide the hotel were outstanding, I heard nothing from other rooms. when I return to Vancouver there is no question where I will stay.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Fantastic Hotel”", "Author": "Raeleanne", "ReviewID": "UR118218738", "Content": "I visited this hotel in September 2011 on a business trip to Vancouver. I was amazed with my good fortune to stay at the Rosewood Georgia Hotel. Upon arrival the staff were attentive and informative. Check in was smooth with no issues. The front desk attendant showed me to my room, explained the features and made me feel wholly welcome. The room was fantastic and comfortable. Room 706 overlooked the Vancouver Art Gallery. There was no noise from the street. The bed was very comfortable. The bathroom had a great bathtub, rain shower, and many extra amenities. I ordered room service both mornings. Both times I ordered blueberry pancakes and coffee. The first morning was outstanding. The second morning was good, but somewhat disappointing after the exceptional breakfast from the morning before.", "Date": "September 17, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Rhinebeck, New York", "Title": "“Great location; Superb service”", "Author": "Cecily F", "ReviewID": "UR118117908", "Content": "We just visited Vancouver for the first time, and stayed 4 nights at the Rosewood Hotel Georgia. We got a great price online and then were ofered an upgrade when our flight was cancelled due to the flooding in the NE. The hotel is a lovely old building completely updated and upgraded to include every kind of amenity. The location is perfect--right across from the art museum and in the center of Vancouver. We walked almost everywhere. In addition to the location, the Hotel Georgia offered the most amazing service we have every experienced. At every turn, the staff was friendly and helpful; I almost think they read minds, they were so quick to offer help. They provide water when you pick up your car as wll as printed directions; glasses cleaner was on the bed side table when I left my glasses case out; bottled water on the bedside table along with delicious cookies--all in all, we really felt pampered. The restaurant--Hawksworth--is amazing. It's not inexpensive, but worth the cost. All in all, it was a great trip and a great hotel.", "Date": "September 14, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Wonderful!”", "Author": "missLKPA", "ReviewID": "UR118086187", "Content": "Loved my stay here! They did a stellar job with excellent attention to detail and they really made me feel special!", "Date": "September 13, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Toronto, Ontario, Canada", "Title": "“Wonderful stay!”", "Author": "CAB71", "ReviewID": "UR118041134", "Content": "My wife and I recently returned from a short trip to Vancouver visiting with her parents and since it was our anniversary we opted to spend one night (Sept 2) in the City. I had read that the Hotel Georgia had been recently renovated and I was lucky to find a really excellent price online (probably 1/2 of what the room should've cost), so we figured what the heck and splurged on a 5 star luxury hotel. Location The location is pretty prime - right downtown, across from the Art Museum and the Pacific Centre, and also very close to the central business district, for business travellers. There's a Canada Line stop a block away and its a short walk to Gastown, and the seabus terminal. The Hotel All I can say is \"wow\". The hotel has been renovated, from top to bottom - I understand they even cut the number of rooms from 300 to 155. The Hotel Georgia has long been the tradition luxury hotel in Vancouver (along with the Hotel Vancouver, which is nearby), so it has that very \"classic\" look to it. Credit to Rosewood keeping the same look and feel of the old hotel while modernizing it with all of the amenities you would expect nowadays in 5 star accommodations. The hotel has a new courtyard bar, called Reflections, which is becoming an \"it\" spot in Vancouver. It's completely outdoors, though partially covered (makes sense in Vancouver, given the rain) and a nice infinity pool. A number of the rooms face the courtyard, which can make it tricky if you want to go to bed early, but to the hotel's credit, they do last call at 11 at the bar and shut it down by 12. We weren't able to get a table at the restaurant, Hawksworth, but I hear its quite good. The hotel also has a full service spa, but due to our short stay, we didn't get a chance to try it out. The Room We stayed in a Luxury King Room (which is one up from their standard room), thanks to the upgrade. The room was beautiful and large especially the bathroom, (which was almost as big as the rest of the room), which had a full-sized soaker tub, his and hers vanities on opposite sides, and a shower with a \"rainforest-style\" shower head. Of course, the room has the standard \"luxury hotel\" features, such as 42\" HD Flat screen TV, super comfortable bed, room safe, etc. The room is on par with hotels of this class, though the bathroom is one of the best I've seen. Unlike some of the newer hotels, none of the rooms have views of the water or mountains, but you can see the mountains from anywhere in downtown Vancouver, and the city surrounded on all sides by water, so its not that big a deal. The Service Every second of our experience with the hotel was fantastic. Even making the reservation - the reservation agent, Bethany was incredibly helpful and even called me after I made the reservation to let me know she had upgraded our room at no extra charge. Then when we arrived, the staff was excellent, from the valet parking (very stylish hats fellas) to check-in, to the bellhop who showed us around the newly renovated room, to the concierge who fixed our dinner reservations, to Jim \"Mr. Bentley\" who drove us to and from dinner in the hotel's brand new Bentley (a great service the hotel offers if you ask) - what a way to travel! I almost forgot to mention that the hotel had chocolate dipped strawberries and a bottle of champagne on ice, with a lovely welcome note from management waiting for us in the room when we arrived. All in all, the service is top-notch. Bottom line: I would stay there again in a heartbeat and have no hesitation is recommending it for someone visiting Vancouver. Nice job Rosewood!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Villars-sur-Ollon, Switzerland", "Title": "“Great place,....central,..and friendly staff”", "Author": "JC-Delage", "ReviewID": "UR117996860", "Content": "Had a 3 nights stay. Very good accommodations, and a very good bar and restaurant too.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "chicago", "Title": "“Best in Vancouver!”", "Author": "dandrew", "ReviewID": "UR117517548", "Content": "This was my first time in Vancouver and I must say I was thoroughly impressed with the Rosewood Hotel Georgia. It was also my first time staying at a Rosewood hotel and again I was thoroughly impressed. The hotel is in the center of the city across the street from the art museum and near the shopping district. It is on the fifth ave of Vancouver. When you enter the hotel you are greet by one of the numerous staff of the hotel. Check in was easy despite a hick up in the reservation which was easily fixed. The staff of the hotel was helpful but not overly intrusive. If you ever needed anything there was a employee to help you. Although that may have been because the hotel seem somewhat empty. Our room was not the largest but perfectly adequate for our needs and had numerous luxury features. From the small little touches like the control panel by the side of the bed to the heated floor in the bathroom. Oh not to mention the bathroom had an amazing shower! The hotel is not stingy with their services from free wifi to complementary use of the hotel bentley. Overall I would definitely recommend the hotel georgia. It was one of the best hotels I have ever stayed at and I have stayed at some of the best hotels in the world.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "dallas", "Title": "“Fabulous!”", "Author": "judyongena", "ReviewID": "UR117404404", "Content": "There is no comparison for staff and accomodations! Rosewood has by far the most courteous friendly staff of any hotel we've ever visited! What I truly loved is that they treat every guest as if they are a celebrity! Our room was luxurious! The hotel restaurant is superb!! I would truly recommend this hotel to business and vacation travelers alike. The location is 2 blocks from the harbor and centrally located downtown. If he's available -Jim will drive you to your destination in the Rosewood Bentley! Loved, loved, loved this hotel!", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Orange County, CA", "Title": "“Newly Opened”", "Author": "CAKarenOrangeCounty", "ReviewID": "UR117368763", "Content": "This hotel is in a great location. It opened summer of 2011 - so everything is new. Nice workout facility with top notch equipment - super indoor lap pool. The only problem is I am a frequent Four Seasons traveler and I am accustomed to having an executive suite that could accommodate 3-4 people, as the sofa is also a bed. We ended up with two connecting rooms - but everyone was very comfortable. Beds were super comfortable..my bathroom had a heated floor - really luxurious.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“A place to stay when you are in Vancouver”", "Author": "SFTraveler33", "ReviewID": "UR117232512", "Content": "We booked a room at the Shangri-la Vancouver first since it was one of the newest hotels in town. A couple weeks before our departure, we noticed the Rosewood Hotel Georgia opened. At first we reluctantly reserved our room there since it was so new. As most new hotels, the service could be a hit or miss and the amenities might not be readily available. However, we could resist the decor of the room, the central location, and beautiful indoor pool so we decided to give it a try. The services were simply wonderful. It was attentive yet not too intrusive. The staff were welcoming and friendly but not stuffy or stuck up as some of those from older luxury hotels. Everyone was helpful and polite from the valet parking attendant to the room service staff. The room was exactly as it is shown in the hotel's website photos. The pool was beautiful and spotless. We had room service and the food was very good. It was a bit on pricey side as it is a Rosewood hotel, but it is worth it if you are too lazy or tired to get dressed and go out. We also tried Hawksworth restaurant in the hotel. We were pleasantly surprised at how great the food was and the service was top notch. As for the negatives, there aren't a lot to discuss here. Just to be picky, they didn't have drink service at the pool area yet. We commented that on our survey and the general manager told us they are still waiting for alcohol license so that service should be available soon. The TV didn't work on the first night we were there. We didn't really care since we were not going to watch TV in Vancouver anyway, but it was fixed the next day as soon as we mentioned to the staff. This last issue is not the hotel but rather the restaurant. They didn't really have a proper dress code so you will see all kinds of people there. From couples in their suits and gown celebrating their special events to those \"lesser class\" who came in with shorts, t-shirts, flip-flops and expected immediate attention from the wait staff. If you ignore those around you, you would have an enjoyable meals as we did. Overall, we would definitely return and stay at the hotel when we are in town.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "florida", "Title": "“Best Hotel Ever Great Concierge”", "Author": "travel v", "ReviewID": "UR117003581", "Content": "This is the best hotel I have ever stayed at great for everyone luxurious comfortable beds would stay again!! The pool was beautiful!!", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "minneapolis", "Title": "“Classic Luxury - Definitely a Potential 5-Star Hotel”", "Author": "myluvoftravel", "ReviewID": "UR116867292", "Content": "Having stayed at the Rosewood Hotel Georgia 2.5 weeks after a grand opening from a massive gutting and renovation of this landmark Vancouver property, and a rebranding to the Rosewood name, I found this property to be pure classic luxury with the highest standards to offer their guests. The entire staff are outstanding, most welcoming, hospitable, and takes great interest in your stay at their property. The entire staff are very proud to be at the Rosewood Hotel Georgia and their enthusiasm definitely shines through. The hotel itself is absolutely beautiful while very relaxing. I did not get that stuffy feeling you can get staying at a top luxury hotel. The hotel exudes a welcoming, sit down and relax feeling. The furnishings in the lobby are gorgeous and fits the decor perfectly. The room I had was on the 6th floor overlooking Howe Street. The room windows do open wide - how refreshing it was to find this. I could hear no noise at all, street level or outside the room. The room itself is luxury. The furnishings, color coordination, bed and bedding (the best ever) (sorry Frette) and lighting are perfection. I might also add very, very, comfortable, beautiful, and of the best craftsmanship. Touch lighting is utilized throughout the room. A computer keyboard in the desk drawer is available for use anytime and set up through the television system - and free of charge. A very nice touch and was used. I also liked the Seiko alarm clock that was stylish yet very simple to set an alarm. We know how hotels have gotten with trying to set an alarm on a clock. The bathroom - possibly the best I have encountered, Huge is not the word. You could live in the bathroom it is so big and beautiful. Everything is well thought out even down to the heated floor. You could have a party in the rainforest shower it is that big or possibly a smaller gathering in the soaking tub. All the amenities are there that one would expect at a luxury hotel and of the very highest quality. The fitness center/spa/pool are amazing. The fitness center has all the newest and latest equipment available in a wonderful and airy room to work out in. Again, all the nice touches one would look for at a hotel of the caliber are available. The pool area in my opinion is the second best feature of this hotel. Stunning, breathtaking, unbelievable are just a few words to describe this indoor pool area. Chairs, chaise lounges, couches, towels - again no expense spared in having the absolute best for this hotel. I actually felt like I was in some kind of Roman bath. You must stay if for anything the pool area. I did have breakfast at Hawksworth Restaurant. Decor, service, and food were excellent and price point was what is expected of a dining establishment of this high caliber. Absolutely no complaints for breakfast at Hawksworth. I utilized the business center and was very surprised to see two brand new Mac computers, the top of the line Mac computers for complimentary use. Being Mac illiterate, the hotel staff was most helpful in getting me started. The 1927 lobby bar was very nice, the drink was excellent, service outstanding, and pleasant, and overall a very relaxing time spent. Definitely have a drink or two there. The staff of the Rosewood Hotel Georgia is the #1 best feature of this property. Of the staff, the concierge staff I had multiple dealings with, Heather and Rob are the shining stars of the Hotel Georgia. Both are Members, Les Clefs d'Or Canada as well as the other team member of the concierge staff and one will be attaining membership into this prestigious organization in November, making the Rosewood Hotel Georgia the only hotel in Canada to have four Members Les Clefs d'Or Canada. This staff, again, particularly Heather and Rob know the city of Vancouver nside and out, all recommendations were right on, and some unusual requests were handled professionally, timely, and always with the result I the guest was looking for. My many interactions with this team certainly made me feel like I was their only guest. Heather and Rob are very special people and take pride in their work and pride in their hotel. I cannot highly recommend enough using their knowledge and services offered. As I said at the beginning of this review, all staff members are enthusiastic, proud of their job, and proud to be of any service to their guests to make the stay a very memorable on. I was fortunate to be able to utilize the Bentley car and driver, Jim, to the Pacific Central Station. What can I say, I will never forget the ride, the car, nor Jim. Jim is a pleasure to talk to, always smiling, cheerful, and cares so much about the guest. He is such an asset to this organization and someone I shall not forget. Professional and caring at all times -- what more can you ask for in an employee or a person. I actually had wished he could have hopped on the train with me so we could continue our discussions on various topics. I apologize for this lengthy report, however, I really wanted to give future guests a clear picture of this property. Remember please, the Rosewood Hotel Georgia had only been open 2.5 weeks, so there were some issues and definite oversights I saw during my stay. I will say every staff member took their time to listen to my suggestions, ideas, and thoughts and I believe took them to heart. I did not hesitate to let them know too, in a nice way. To give you a good idea, the following was what I found. I was skipped one night for turn-down service. Was offered a very sincere apology from the Front Desk Manager regarding this oversight that should have never happened. My room was rather small. Not the huge rooms I have encountered at other luxury hotels. Very little space for clothing. This in my opinion was the weakest and most disappointing part of the hotel. Actually had to have housekeeping come and get the extra pillows and blanket just to give myself more space in the closet. The business center with its new computers,etc., had absolutely no supplies to utilize that is readily available unless it was all hiding. The spa/fitness center/pool area - as absolutely beautiful as it is, offered none of the touches you will find at a luxury property's spa/fitness center/pool, i.e., lockers, (there were only 2), places to sit and change, and all the toiletries that are offered that take it a step higher. No footwear to use while in this area nor were there robes to put on. Also, there was no place to put the wet swimsuit but this issue has been addressed and there will be a suit dryer installed as soon as the equipment gets in. I was very disappointed and surprised to see how lacking this area was in comparison to a Ritz Carlton, Four Seasons, Shangri-La, Pan-Pacific, and Fairmont properties fitness center/pool area. However, Lenny, Spa Receptionist was outstanding, proactive in tackling my dilemma, and solved my problem. She is definitely the kind of member you want on your team to take you to the top. Again, this was an outstanding stay, all the comforts one could want or ask for. The staff unsurpassed on their duties. The strongest asset of this hotel. However. to reach that pinnacle of being \"the best Vancouver hotel\" it is the small attention to details that separate properties as they are all in the general price range. This is where the Rosewood Hotel Georgia still needs improvement. It will be the little things that take it to the top and a 5-star rating. I will be back and cannot wait to see and notice the changes and the evolving nuances that take place to achieve this hospitality ranking as #1 place to stay in Vancouver. It can happen.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "vancouver", "Title": "“Perfect in every way”", "Author": "vancouver23", "ReviewID": "UR116733809", "Content": "We recently stayed at the Hotel Georgia, a family of four and a dachshund. We've stayed at several hotels in Vancouver, but none of them is this special. The location is perfect. The restaurant, Hawkesworth, was extraordinary. Everyone who works there is kind and friendly and helpful. The bed was the most comfortable I've ever slept on. I've been searching online to find something comparable. The pool is gorgeous and so much fun with 8 geometric windows in the floor that continually change colour. If you go, be kind to them. They deserve it.", "Date": "August 15, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Vancouver, BC", "Title": "“Outstanding Hotel with Top Notch Service”", "Author": "Vancana", "ReviewID": "UR116595146", "Content": "Living here in Vancouver, we thought we'd take one for the team, and spend a couple of nights at this newly renovated landmark hotel so we could report our findings on this forum, to assist visitors in their decision in selecting accommodation. I know, a tough job, but someone's gotta do it! The restoration is superb, marrying the historic with the modern. A classy lobby greets you, complete with rich mahogany, brass and a dazzling chandelier. Touches of the past are to be found with the original staircase, and pieces like the old wall mounted mailbox, period clock above the entrance, and even retro elevator dials! We had a room on the 8th floor overlooking the art gallery, the best choice if you can swing it. The room was more like a small apartment, well appointed, and a very comfortable bed. The bathroom was huge, with two vanities, soaker tub, and separate walk in shower. A quality turn down service occurred each evening. A superb lap pool and modern fitness centre are on the 4th floor, a popular restaurant and the lobby lounge are located on the ground floor. We ate breakfast in the restaurant and had cocktails in the lounge, and both were excellent. Also a Bentley is made available to guests for complimentary use around the city centre. Look for the subtle nods to the past, doormen wearing fedora's, lounge waitresses wearing 1920's outfits and even \"Sweet Georgia Brown\" being played at 11-08 twice a day in recognition of the time it reopened! But it's the service that commands the greatest recognition. From the check in desk, to the concierges, to the bellmen and doormen, bar staff and Jim the driver, they executed their duties with the highest degree of professionalism. Extremely courteous, yet friendly. Well done! The only disappointment was the Prohibition Bar was still under construction, and it sounds like it will be a cool place once it's up and running, so there's a good reason to return! Overall, a stylish and thoughtful renovation of a classic 1927 hotel that scores a bulls eye. Expensive, but highly recommended.", "Date": "August 12, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Vancouver, Canada", "Title": "“A wonderful stay at a Vancouver Landmark”", "Author": "Marcella0", "ReviewID": "UR116354286", "Content": "A most enjoyable stay at the Historic Georgia Hotel. This hotel has been totally refurbished to it's former glory!! My room was very well appointed, beautifully decorated and large. All conveniences are within the room. The bathroom was the highlight with its oval soaking tub!! Another important factor for me; all the windows opened. The staff were very courteous, efficient and seemed excited to be there. The hotel is centrally located and across the street from the Vancouver Art Gallery. I highly recommend this 'Boutique Style' hotel with all it's old world charm.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Service": "5"}, "AuthorLocation": "Toronto Ontario", "Title": "“This is a Beautiful Hotel”", "Author": "AdrianTorontoOntario", "ReviewID": "UR116234102", "Content": "This hotel has the most beautiful old world lobby, when they did the renovation, they preserved all of the old wood, fixtures, everything that was timeless. Then when you get to your room, you are in the modern age, and everything is beautifully designed and extremely comfortable. The beds and furniture are great, but the bathrooms are the best. I have stayed at the Four Seasons in Whistler, (which is gorgeous) and this hotel is equal in every measure. I actually liked the rooms in the Georgia better because I really liked the whole warm contemporary design they have. I only ate one meal there, but it was fantastic. They have \"savoury\" choices on the breakfast menu, so I tried one, it was their Rib Hash and it was really delicious. Not every kitchen could pull this off, but they did. I will return for sure", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Fabulous room and friendly attentive staff”", "Author": "trudeau2010", "ReviewID": "UR116083701", "Content": "My wife and I have just returned from our vacation to Vancouver and I just had to review the Hotel Georgia while the memory is still fresh in our minds. Wow! We really did good choosing the Hotel Georgia and will certainly consider staying there the next time we visit. There are so many fine Hotels in downtown Vancouver and we took a chance on Hotel Georgia because of it's proximately & price. I had a symposium to attend at another fine hotel but preferred not to stay in the same hotel for the sake of variety during our stay and Hotel Georgia was a good choice for us. The room was absolutely fabulous. The bathroom was OMG! The staff made us feel welcome upon our arrival and never let up making sure we had everything we needed or wanted. I highly recommend Hotel Georgia to the discerning traveler or anyone who appreciates great accommodations.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "vancouver", "Title": "“Home away from home”", "Author": "vantellcare", "ReviewID": "UR116066758", "Content": "I highly recommend this place for your visit to Vancouver Beautiful British Columbia, we took the special offer to stay for 50% off for the grand opening package, amazing staffs with caring greeting from every floor, amazing restaurant, beautiful ambience, lovely room equip with everything that you cannot imagine, I try this hotel for my business Trinity East Investment to provide the type of quality to house foreign students and seniors in Vancouver. This is a place like home away from home.. lovely and elegant.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Absolutely faultless”", "Author": "Sahara0meara", "ReviewID": "UR115997583", "Content": "My husband, son and I had the pleasure of spending 3 nights in sheer luxury in the Georgia. From the moment we arrived to our departure we were treated courteously by all the staff we encountered. Having stayed in several 5 star hotels in Europe, I can honestly say that the Georgia was by far the most luxurious we have had the fortune to stay in, with fantastic attention to detail. Our son is 10 months old and travelling with a baby can be a hassle, however upon arrival he was presented with a teddy. His crib came with a goody bag of baby necessities and a kettle and diaper genie were delivered to the room without request. The bed was ridiculously comfortable and the bathroom deserves a mention. We were very taken with the 'rainforest' shower. All in all, we had a faultless experience and the staff deserve a very special mention as they were so helpful and friendly. Well done!", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“wonderful!”", "Author": "TxTree", "ReviewID": "UR115960947", "Content": "I stayed at the Hotel Georgia for one night while in Vancouver on business. I think it had been open for just a week and I was very impressed with the quality of the facilities and the staff. Lovely modern renovation of a glamorous old hotel, well located in the heart of Vancouver. My room (a deluxe) was perfect - nice little sitting area, comfortable desk for working, plush bedding, excellent lighting, great view of the art gallery. The highlight, though, was the bathroom, which was enormous and beautifully designed. The staff were all highly professional, gracious and welcoming. Room service was excellent and prompt. I also really enjoyed my breakfast at the Hawksworth restaurant - I had the dungeness crab eggs benedict, a delicious concoction I will be dreaming about for months to come. (Also, I didn't get to experience the pool or the spa, but they also looked beautiful.)", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Vancouver, BC", "Title": "“1920's Elegance meets Modern Swagger!”", "Author": "bellabear026", "ReviewID": "UR115735196", "Content": "My husband I stayed in this hotel for our wedding anniversary and the hotel is absolutely gorgeous! The hotel contains the elegance of the early 1920's with the beautiful wood paneled walls, crystal chandeliers and elevators that look like they were taking out of the prohibition era. It is exceptionally clean and the staff takes care of every minute detail. When my husband and I arrived, we quickly checked our car in to valet ($30) and then a gentleman dressed in a a beautiful suit and fedora, took our luggage to the front desk where the ladies took great care of us, even arranging for the in house car service (Bentley) to take us to our dinner reservations. The drive Jim is fabulous by the way! Upon entering our room, gold leafed chocolate covered strawberries were served on a silver platter with a silver bucket filled with ice and champagne was waiting for us (complimentary). The bedrooms brilliantly displayed a touch of modern technology (heated bathroom floors, rainfall shower,sensored lights) and with the beautiful elegance of a time that has passed (time period like furniture, brass, silver and gold). The staff is amazing!!! They took of absolutely everything we asked in a professional and speedy manner. I forgot my cell phone in my car and they speedily retrieved it. This is by far THE BEST hotel in vancouver, if you can afford to stay, definitely do so. Be prepared to have some cash in your pocket though as you will want to tip the staff at this hotel for their genuine, speedy and great attention to detail service. We will be back next year to celebrate our second anniversary for sure!", "Date": "July 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Out of this world!”", "Author": "joeycarona", "ReviewID": "UR115556812", "Content": "Just got back from Vancouver and had the great joy of staying at the Rosewood Hotel Georgia during their opening week. The experience was perfection in every way. The hotel offers the perfect combination of new world features and and amenities encased within classic and timeless beauty. Words can't adequately descried how spot on everything in this hotel was. On a 1 to 10 scale, my experience was a 15.", "Date": "July 19, 2011"}], "HotelInfo": {"Name": "Rosewood Hotel Georgia", "HotelURL": "/ShowUserReviews-g154943-d1063797-Reviews-Rosewood_Hotel_Georgia-Vancouver_British_Columbia.html", "Price": "$302 - $456*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">801 West Georgia Street</span>, <span class=\"locality\"><span property=\"v:locality\">Vancouver</span>, <span property=\"v:region\">British Columbia</span> <span property=\"v:postal-code\">V6C 1P7</span></span>, <span class=\"country-name\" property=\"v:country-name\">Canada</span> </span></span></address>", "HotelID": "1063797", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/1b/27/ac/deluxe-guestroom-bathroom.jpg"}}