{"Reviews": [{"Content": "ok hotell Travelling is always an adventure, our taxicab had trouble finding the hotel, luckily I had the phonenumber with me so from that he could work it out. The lobby is three stories up which makes it even a little more difficult to find.The room is, of course small, but ok. One should think that an american hotel would have more than one english-speaking channel....The location is very good. Some of the staff speak hardly any english at all and some just yes and no. The none japanese part of the breakfast was below standard if you dont like cooked bacon(instead of fried).", "Date": "Dec 28, 2008", "ReviewID": "UR799932394", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "icca5"}, {"Content": "Great hotel WOW! What a gem of a hotel...I stayed here at the end of my trip for just one night. I had stayed at another hotel at the beginning - which was good too! But the room in THIS hotel was bigger - same rate as the other hotel. Although this hotel was a little harder to find - what a delight!!! Love the jammies they give you fresh each day! Complimentary water; free internet use in the lobby; breakfast buffet included; comfy beds; and most importantly.. very clean!!!! Close to Shinjuku station....use the KFC and the Mr. Donut as a landmark of knowing where to walk straight from -hotel is on the right side. I would stay here again!", "Date": "Oct 23, 2008", "ReviewID": "UR330372610", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "hawaiiboundToronto"}, {"Content": "Great 3.5 stars hotel in Shinjuku! We've just returned from Tokyo. We stayed in Best western Hotel Shinjuku Astina. We knew that it was a brand new hotel as we like to stay somewhere modern and new! We looked at this web and decided to choose this hotel based on;1) price which was not bad for Tokyo hotel and walking distance to tokyo underground AND JR station (shinjuku)2) Room ambience; as we both like somewhere modern with nice amenities and it looked great from the hotel website and on the previous review3) Most of the 3-4 stars hotel we looked at has shower over the bath tub which we find it quite difficult to get out or get into the shower. This hotel provides separate bath tub and shower area (even the bathroom is very small but they seem to use their space efficiently as we don't feel that the room is too small)4) Breakfast is included with the room as we like to relax in the morning so having a nice cup of coffee with a fruit bowl at the hotel in the morning is quite great!This hotel is best reached via Shinjuku station (either NEX or airport limo) then take a taxi from the station to go the hotel (make sure u have your Japanese language printout of the hotel)What's great about this hotel;1) Location; 3 min walk to Shinjuku 3 Chome tokyo Metro and around 6 min walk to Shinjuku JR station which makes it very convenient if u need to take JR train to go to either Hakone, Kamakura or Yokohama2) Service. Great service from the hotel staff especially the front desk. They are very helpful and can speak very good English. So if you are not sure about anything, ask them and they will find out for you.3)Room; nice and modern. Room is a bit small (but normal for Japanese hotel standard). Comfy bed. Nice shower separted from bathtub (all are in the box). They also give you plenty of amenity in the room4)Breakfast included with the room rate! and even if you cannot have the breakfast, the breakfast voucher can be redeemed to spend in Lawson (convenient store downstairs) for Y 1000, which is very considerate of them. We had to leave very early to get the flight back so have no time to have breakfast. With this voucher deal we can get something to eat on the bus on the way to the airport!What we don't like;1) Location itself. The hotel is situated in East Shinjuku in the girls bar area which is safe, of course. However, sometimes there will be someone trying to approach you to go to the bars when you walk near the area at night time which can be irritating if you just want to go back to the room and sleep!", "Date": "Aug 14, 2008", "ReviewID": "UR189236863", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "worrior33"}, {"Content": "Service, Location -- Rest assured when staying at the BW Astina This is the perfect hotel for those new to Tokyo. Great location, good base for touring the city. Convenient access to the subway system - which you'll spend a lot of time on. Outstanding staff, eager to meet your needs. Breakfast was included with our room, and consisted of a mix of Western and Japanese style cuisine. A great start to the day.High speed internet is free in the rooms -- a LAN cable is provided. CNN was available in English.There is a convenience store located below the hotel -- great for jet-lagged travellers up in the wee hours needing a snack.There are plenty of great restaurants nearby, and the front-desk staff will assist you with locating them.The room was clean, and lots of amenities were provided.", "Date": "Jul 8, 2008", "ReviewID": "UR301863543", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "hons0011"}, {"Content": "Comfortable hotel in good location This is a newly (early 2008) opened hotel in a convenient location. First impressions were good - of course, being brand new helped, but the general design and decor were very nice. The reception staff were efficient and helpful. There is a computer with free internet access near the reception. The restaurant is on the same floor.My room was very comfortable. The bed was excellent and pillows were good. The room was small, but space was used intelligently. At the back of the building, it was also very quiet; soundproofing between rooms seems to be quite good. The bathroom was better than average.My room rate included breakfast, with a reasonable range of Western and Asian food. I also liked that breakfast was served at a convenient time - 7am until 10am weekdays, 11am weekends. I did not eat other meals there - although prices were reasonable, I thought the lunch and dinner menus were uninspiring and did not represent local cuisine well.The location was quite good, although I disagree with the previous reviewer that it is 2 minutes from a subway station. Nevertheless, it is fairly easy to get to Roppongi, Shibuya and the Imperial Palace area.The only real negatives I noticed are all minor - limited range of English TV channels; no room service; and (as mentioned already) poor lunch and dinner menus.", "Date": "Jul 5, 2008", "ReviewID": "UR567735883", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "4"}, "Author": "focus_Seoul"}, {"Content": "Good value        BW Shinjuku Bathtub", "Date": "May 31, 2008", "ReviewID": "UR561792772", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "CorsaGal"}, {"Content": "銇婇儴灞嬨亴蹇仼锛?#x201d;   showReview(23154583, 'full');", "Date": "Jan 1, 2009", "ReviewID": "UR711316040", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "3"}, "Author": "锝嶏絽锝囷絹锝冿綀锝夛綊锝?> 锝嶏絽锝囷絹锝冿綀锝夛綊锝?</a> </div>"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g1066457-d1070779-r23048783-Best_Western_Shinjuku_ASTINA_Hotel_Tokyo-Shinjuku_Tokyo_Tokyo_Prefecture_Kanto.html", "HotelID": "1070779", "Price": "Unkonwn"}}