{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Location location!”", "Author": "Lashley88", "ReviewID": "UR127014174", "Content": "This hotel is great value for money, but really it's the proximity to Termini station which is great. Rome only has two subways running perpendicular to each other being close to the station means being close to everything else. The room was clean and the bathroom fantastic! The hotel offers breakfast tickets to a restaurant down the street. The staff were helpful, friendly and knowledgable about both tourist attractions and off the beat spots! Local market in the street below was a bit grimey but hey its part of the experience! Great stay!", "Date": "March 31, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“good located”", "Author": "NicKyCuckoo", "ReviewID": "UR126283602", "Content": "This hotel is good located, it's near Termini station, buses and underground, but street was full of strange people (especially staying men). Fortunately, inside was everythink OK. The rooms are small but it's so cheap it's fantastic and comfortable. Staff was very kind.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Canberra, Australia", "Title": "“Average stay”", "Author": "scottydz", "ReviewID": "UR124461890", "Content": "This hotel was conveniently located near the termini station however this is not an attractive area to stay. The rooms were clean and simple however the customer service lacked the charm and friendly helpfulness we found in other parts of Europe. Our room was also by the breakfast room which was a little noisy from 6:00am Would look else where is we were to return to Rome.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Nice hotel near Termini station, very good price/quality balance, with à few negative points”", "Author": "Mathieupeiffer", "ReviewID": "UR124111685", "Content": "This hotel is very good if you are planning to stay in Rome for a few days, but not for 2 weeks. The staff there is very nice and helpful. The rooms are quite small, but everything is very clean. Be careful, because you do not have Internet everywhere in the hotel, we were a bit far from the modem decoder. The breakfast was very good although not varied and always the same (excellent cofee btw). One morning the shower was cold, but it did not bother us. In brief: excellent for those who are looking for a hotel near Termini and low prices but good quality.", "Date": "February 4, 2012"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“very helpfull stuff”", "Author": "uri4769", "ReviewID": "UR114984657", "Content": "close to the Termini train station! very kind men in the desk! good value to money", "Date": "July 3, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Perugia, Italy", "Title": "“Impossible to recommend it”", "Author": "oparinamelosa", "ReviewID": "UR96697117", "Content": "I'm not the kind of person who writes bad reviews about hotels. Hotel Dama was cheap, had a very nice,spacious and relatively clean room - and that is certainly a thing to consider. However, the problem resides on their staff... I had two friends in Rome that were looking for a last-minute reservation and, at the beginning, the owner said that it wouldn't be any problem for them to share the room with me...When my two friends arrived he started to say rude things for them about their arrival, and it tuns out he started to complain that I was disturbing the place due to my nationality...Ridiculous and offensive to say the least!", "Date": "February 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Prague", "Title": "“Very satisfied”", "Author": "marketickaa", "ReviewID": "UR81760319", "Content": "Me (18), my sister (21) and our mother were staying in Rome for three nights. I guess we were very lucky to find Dama Hotel bcoz of its closeness to both Termini and the city center. It's really easy to walk to everywhere from this place (we only took subway on our way to Vatican). The hotel is on the first floor but there is an elevator. The room we stayed in wasn't very spacious though it was enough for three people. I have to emphasise that the room and bathroom were both very clean. The receptionists were nice and friendly. There are only two things I would complain about - there are markets every morning (except sunday) so it's a bit anoying - on the other hand the windows are quite sound-proof so if you close the window it's ok. Also these markets are almost everywhere in Rome center. The next thing is breakfast. One little coffee and croissante is not enough. Not for me. We found out that such breakfasts are in most of the hotels in Rome so it's not a reason for not staying in Dama Hotel. :) Last thing I would like to say is a recomandation: if you stay in Dama Hotel you should have a dinner in the Ristorante Mino - it's in the same street, 2 min walking. They cook really well, they got excellente house wine (we had white), the service and waitreses are very nice and polite and the prices are not high.", "Date": "October 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Turku, Finland", "Title": "“Great value for money!!!”", "Author": "Fintraveller65", "ReviewID": "UR68801970", "Content": "Excellent room, nice staff, nice to get breakfast in a nearby cafe, recently renowated rooms, free internet( problems thought, but a computer to use in the\"lobby\") Spacious, kids loved the nice guys in reception!", "Date": "June 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Oregon", "Title": "“Nice owner, but bait and switch...”", "Author": "K-ZOregon", "ReviewID": "UR41580915", "Content": "The owner of the Hotel Dama was very friendly and very helpful. He held our bags and in the morning he walked with us to the bar to help us with breakfast...pastry and coffee. BUT...he did not give us a room at the Hotel Dama. He walked us to the Penelope, and that is where our room was. The room there was very bare...cement floors and beds on wheels...it was not what we expected. And the reception was directly outside and was loud...you could hear the conversations. We were only there one night, so it worked out ok. And the location was great for us as we needed to take the bus to the airport the next day.", "Date": "September 14, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Ireland", "Title": "“Caution: trap reservation between Hotel Dama and Hotel Domus Preatoria”", "Author": "customerdefensor", "ReviewID": "UR36776211", "Content": "When you reserve online through lonelyplanet/hostelworld webpage to stay on Hotel Domus Preatoria, you only discover you have booked on Hotel Dama when you print your receipt. We assumed both hotels to be the same because they have the same address, they omit their floors- one is in the ground floor and the other in the 1st floor (or second floor, I can´t recall). Dama Hotel doesn`t even have a proper reception place. We refused to stay in the place we did not book and we were charged the same way, for we did not give the 24 hours advance cancelling - how could we?! We only discovered the mistake when arriving there. Online customers need to be better protected! They cannot mislead from one hotel to the other. Both Hotels don`t seem to take any action to stop this confusion, for they are profitting with it. CAUTION, be sure of your booking, be sure the HOTELS appear with the same name when printing your reservation!", "Date": "August 5, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Ireland", "Title": "“Caution: trap reservation between Hotel Dama and Hotel Domus Preatoria”", "Author": "customerdefensor", "ReviewID": "UR36775137", "Content": "When booking through lonelyplanet / Hotelworld webpage, you book on Hotel Domus Preatoria and when you print your booking it appears Hotel Dama (on the same address)! One is on the ground floor and the other is in the 5th floor. (but you only discover this when you arrive!) Both Hotels say they have nothing to do with this confusion, but they don`t do a thing to solve it. We refused to stay at Hotel Dama, which doesn't even have a proper reception place, and we were charged the night in our credit card, for not advising with 24 hours in advance. They mislead you, they book you where you didn't choose and they still charge you! Eyes open: I would definetly not stay in both hotels! If we do not denounce this attitudes, there is no way of stopping them, online customers need to be better protected!", "Date": "August 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York", "Title": "“If you know what to expect....”", "Author": "JenNYC76", "ReviewID": "UR20524799", "Content": "I was looking for a place to stay for one night after a long cruise and before we had a flight the next day. The location is awesome, just a few blocks from the Termini Station. There is no \"reception\" and we almost walked past the hotel, keep an eye on the numbers! Once you ring the bell the booking manager comes to you and takes to you to your room. He was very kind and helpful and arranged for our taxi the next AM to the airport. We than had to walk around the block to our rooms. We had help from Damus, another employee. Especially since we were on the 3 floor and no lift. He also left us his cell phone number and told us to call if we needed anything. We got a coupon to get breakfast the next AM and off we went. The triple room was tight but clean! The bathroom is clean and new as well. For one night it was just perfect. Small and clean and basic. There was a small TV in the room, no phone but we had a nice size window and an air ventilator. I wanted a place that was clean and safe for one night at a good price and that is what we got. Breakfast was a pastry and cappie at the local shop.", "Date": "October 1, 2008"}], "HotelInfo": {"Name": "Dama Hotel", "HotelURL": "/ShowUserReviews-g187791-d1073312-Reviews-Dama_Hotel-Rome_Lazio.html", "Price": "0", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Milazzo,42</span>, <span class=\"locality\"><span property=\"v:postal-code\">00185</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "1073312", "ImgURL": "http://www.orbitz.com//hotelimages/823/98823/687515901/TBNL0-20110608-015142-031.jpg"}}