{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "merseyside", "Title": "“Customer service non existant and usual room problems”", "Author": "toffeeladMerseyside", "ReviewID": "UR122812763", "Content": "The room when you arrive is not ready and the reception staff make you wait for 1/2 hour while trying to get you into the \"sister hotel.\" They seem to have no booking policy and overbook the hotel. There was an early check out (not suprising) and I had to wait for that room whilst it was \"Cleaned.\" I was told to go for a coffee and given brief direction through a car park to a \"restaurant\" (more like a cafe.) The coffee was tepid and breakfast inedible and cold. Service was also non-existant. After a day we checked out and went to the Habtoor which for not much more money made a more pleasant stay in Dubai.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Never again!”", "Author": "AuraJuusto", "ReviewID": "UR122272337", "Content": "The room had not been cleaned. The floor was dirty, levels had not been wiped . The cleaner only makes the bed and changes towels. Breakfast was a really lousy, same food every day, no vegetables at all. Pool area had 4 sunbeds and all of them was broken.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Chester, United Kingdom", "Title": "“Arabian Suite /Dubai”", "Author": "ruth_allman", "ReviewID": "UR121649496", "Content": "Well this was a bargain break for me and my mother we had always wanted to come to Dubai but it was always coming up quite pricey. When i saw this deal with Thomas Cook 399 pounds 5 nights BB flying from Manchester on a scheduled flight on KLM via Amsterdam thought it was a good deal - Hotel was what i would class as a business hotel 2/3 star ,we were upgraded to a suite and thank god as my mum snores so i was able to make use of the lounge area while she took the bedroom location was downtown Dubai right across from a mosc so thoughtout the day and early evening could hear the chanting , it was ramadan when we went so you can imagine it was quite intense times of prayer there is a handy little supermarket next to it that you can get bottled water, fruit and most snacks that you get back home to put you over between meals i would alway suggest that August is avoided to go to Dubai on arriving at the very luxurous airport the heat at 06.30am hit me as was 30c in the 90f and increased as the day went on but most hotels taxis and shopping centres are air conditioned so its not so bad Hotel wise there is a roof top pool , bit grotty but for a hardened sun worshipper was great and empty !there was a small restaurant that provided a small and basic breakfast and definatly not 4\" standard more like 2\" but in contex for us for the price. 1st visit couldnt beat it - getting around and about is done very easily by taxi and that can be provided from reception or just standing outside the hotel's front door and the large shopping malls -dubai and khalifa are always good places to head for both shopping but also to eat as the food malls such a wide selection of diffrent cuisines did 2 special things went on out last day to the 6\" burj al arab for a amazing afternoon tea booked via the internet about 50 pounds non alcoholic due to it being ramadan but it was amazing and i would recommend it to anyone to experience and be able to go and see the hotel also went to the tallest tower in the world booked on the internet again as works out cheaper and both worked out very interested and well worth the price want to go to dubai again but would like to try the beach area", "Date": "December 12, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "4", "Overall": "1.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Probably for backpacking students only”", "Author": "UlsterFryNo1", "ReviewID": "UR117036143", "Content": "I've read some of the positive reviews of this place - obviously I wasn't staying in the same hotel. Scrappy, ill-maintained in an anonymous area of the town, unknown to most taxi drivers. On the positive side it was cheap and the rooftop pool had a certain something, at least it was clean. I think the gym was a room with an exercise bike. Breakfast was grim. I know that growing up with the Ulster fry spoils you for everything else but this breakfast was hopeless. I like to be adventurous and tried something that turned out to be a sort of tepid stew. I was sick for the rest of the day.", "Date": "August 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kiev, Ukraine", "Title": "“The Best Place in town.Worth of money.Spacious Rooms.All in One.”", "Author": "Lana12397", "ReviewID": "UR109745103", "Content": "Me and my Family booked the hotel Arabian suites.It was more than we expected.YOu dont get all those facilities in a room in dubai.I have stayed in all the hotel in dubai but never seen such spacious apartments an all facilities.YOu can even imagine that washing machine was also there and i used it all my stay.lol. Staff is very friendly and supportive.They care for you. Restaurant is small but the quality of the food is excellent and rrom service is also very good. Also wanted to mention that the Manager of the hotel Mr.Junaid is very coutous and friendly and he listen and than makes your issues solve just like this.Really deserve to be there as he is doing the best job.The best place to stay.Worth of money.and classic rooms.very quite hotel where you can relax and have a peace of mind.I will for sure come back .", "Date": "May 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“great stay cheap and cheerful”", "Author": "cles22", "ReviewID": "UR100469764", "Content": "Stayed here for first night of stay in Dubai. Arrived early hours of the morning-Had no difficulty finding it from Airport. Rooms are very spacious and fully equipped. Very clean rooms and linen. Pool area was on the roof and very secure and clean-shame only 3 sunbeds! Service was ok and staff helpful. Didnt walk around area as transfered to Beach area for rest of holiday. Great value hotel and would recommend. Its basic but would stay again. Stayed with 3 year old child and friends. No problems.", "Date": "March 17, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“disgusting smell and no choice of breakfast, not at all a 4star hotel.”", "Author": "sham55", "ReviewID": "UR92875826", "Content": "I would not give it a 4 star rating.has a rather nasty smell in rooms, breakfast was not good and there was mould on the bread!!! The area is nice and local, everything is walking distance which was good. Television didnt have big choice of chanels, The steam room was not working, sauna was never turned on had to wait for ages if wanted to use it. There were no towels or shampoo and shower gel in changing rooms and no one ever there to help in the gym!! Not value for money can get much better service elsewhere at this rate.", "Date": "January 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "manchester uk", "Title": "“stuck in a time warp”", "Author": "aussiman", "ReviewID": "UR90492927", "Content": "arrived10.00 roomnot ready till 2.00 went to restaraunt for c0ffee while we waited for room had too walk thro carpark to restaraunt not a good start looked like a converted garage,we got to the room 1.00 wanting to shower after 7hr flight but their were no towels in bathroom rung reception useual response \"be there soon as\" . had to wait till 4.30 , had enough by then went up too the roof to go for a swim nothing like the picture on website,2 dirty sunbeds and a glass table at other end of roof space, disgusted, went back to room ,dressed, got in taxi, went to last htl we stayed,TOWERS ROTANA, which has a great restarant down stairs\" LONG BAR\" and also booked a room for our returned jouney from oz as we would definatly not go back to arabian suites", "Date": "December 22, 2010"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Rooms": "1", "Value": "3", "Location": "1"}, "AuthorLocation": "lancashire", "Title": "“awful!!”", "Author": "shafinaLancashire", "ReviewID": "UR68204666", "Content": "Me and sisters choose this hotel/apartment told that it was a 4* by ebookers. My word did we get a shock. We entered the building which was in a secluded area, the greeted with staff that looked and smelt disgusting!! Taken up to our room which was in an outbuilding to be greeted with two cockroaches, scurrying under the double bed. The bedding was clean but very worn out. The security men looked dody, the whole place just didn't feel right. Anyway at 11 o'clock, after a days flight we searched the main road for a hotel and came to the Four Points by Sheraton-and well we did enjoy Dubai after all. We all like to search for bargains-but i advise anyone, pay that bit extra for comfort and ease.", "Date": "June 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Wellington", "Title": "“Affordable and clean”", "Author": "caotik", "ReviewID": "UR65784028", "Content": "I travelled alone, and overall, found this place quite good. I arrived really late at night and was expecting someone to meet and pick me up at the airport, but no one did. So I hopped in a cab, and gave then the name of the hotel which I thought was the ABC hotel. Taxi driver had no idea where this was, and even though I gave him the address we / he could not find it. Be careful with this - I think it's only just recently changed names! Anyway, I paid for a studio unit for two nights, and when I got to the hotel, there were none left, so they upgraded me to a one bedroom suite on the roof of the building, with a huge lounge, kitchen with laundry, and two bathrooms. I felt bad for taking it, as I'm sure there were families who were slumming it in 1 bedroom apartments. Anyway, the pool was ok, a little dusty and in need of a clean up there. Ok location. There's nothing much around, but then again, Dubai is huge anyway, and you're going to have to catch a cab whereever you go. Staff are mixed. I found roomservice and bell boys terrific. But the behind the counter staff were a little rude. One morning, I asked to be woken up at 7am. I woke up myself at 11am, so wasted an entire morning of my holiday. Thank god I wan't catching a flight that day! If you are in the same room, just beware that its next to the pool, so you get the sound of the pool pump all night!", "Date": "May 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "India", "Title": "“Gr8 place in an awesome city”", "Author": "cvikas007", "ReviewID": "UR63197273", "Content": "Selecting this hotel to stay in DUbai when i planned a visit for 4 days with my wife was the 1st best thing i did. What better was I got a gr8 deal online. SO it made the stay even more great and memorable. Positives of this hotel is its loation in d heart of the city, Good room service, Silent atmosphere, Spa services, Gr8 kitchnette facilities in room and yeah good food. All this for a very good value for money. Trust worthy staff is a big plus as well.", "Date": "May 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "limnos greece", "Title": "“worth of money”", "Author": "rita-bibi", "ReviewID": "UR57298534", "Content": "if you travel to dubai and you dont want to spend a huge amount of money staying in luxury hotels zagy is the perfect place just bring earplugs with you.", "Date": "February 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“Expect a 3star and you wont be disappointed. Dont pay more than £50/night”", "Author": "Twix45", "ReviewID": "UR54986038", "Content": "This review has long been due. heres how this place is and what to expect. This is definitely not a 4 star. Its ambience is not.Facilities probably are. Room was clean and nicely furnished. Pots/utensils in kitchen were old and worn and didnt feel like using them. Breakfast just about ok.u get eggs/toast/jam/cereals/muffins etc. breakfast area has only 6 tables Room has a balcony. All in all was very good for the price we stayed there. again depends which room you get , and in which block A or B. The reception desk is in block A, rooms in this block are probably better maintained than the ones in B. Expect a 3 star and you wont be disappointed. Finding the hotel is pretty easy, all u have to tell the driver is near richmond hotel. Once there you wont miss it, its opposite a mosque. \"We were never disturbed by the noise as some people claim \" Our experience was spoiled by the hotel reception, who on our arrival said there was no room available so he would have to move us to Deira side of Dubai in a deluxe room. I refused because I knew in Dubai, most to see or to do was in Bur Dubai, not in Diera. He then kept us waiting for 30 mins and said a room (1bedroom) was now available. He sent us to block B. On entering the room, it turned out to be studio (not 1 bedroom) and I was really upset. Also the room didnt look very good. Went back to the reception and said we would in no way accept a studio when we had booked a 1 bed. He then said he would move us to a 2 bed room instead (NOTE THAT : from NO ROOM available, this guy now had a studio and 2 bedroom available , hah! ). He made us wait another 30 mins and finally said he had a 1 bedroom available so we would move there (NOTE: from no rooms to studio, 1 bed, 2 bed, everything was suddenly available) So almost after an hour, we finally moved to a 1 bedroom in block A, which was well kept and overall we enjoyed there. Again,for the price we paid, it was very very good. We booked via wwww.ebookers.com. This website and www.asiahotels.com had the same price. Moreover, award winning Indian restaurant \"Gazebo\" was just 5 min walk away. Excellent food. Anything more than 50-60 pounds per night, is not worth the stay.", "Date": "February 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chennai", "Title": "“Had a comfortable & pleasant stay”", "Author": "SureshTV", "ReviewID": "UR51881122", "Content": "Requested my travel agent to look for an apartment to stay for about 4 months for my Business visit to UAE. He suggested Zagy Arabian Suites instead of an apartment for the same budget. He advised that the hotel is fully furnished whereas the apartments are not. I realized later that I made a wise decision to stay in the hotel as I had a fully furnished and confortable stay during the entire tenure. I didn't face any change in the level of hospitality the staff provided. I would recommend this hotel for people looking for a fully furnished Hotel/Apertment for a short duration.", "Date": "December 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "2", "Rooms": "5"}, "AuthorLocation": "dublin", "Title": "“Fabulous, well equipped room”", "Author": "neesaDublin", "ReviewID": "UR51376708", "Content": "We stayed here for 9 nights in a 1 bedroom apartment. The room was large, spotlessly clean and well furnished. It had 2 bathrooms and a full modern kitchen including a washer/dryer and a large fridge. The 32\" LCD TV and Dvd player were also a big advantage. Our room faced the mosque but we were never woken by any noise. Breakfasts were basic but hearty although it was sometimes difficult to get a seat as the restaurant was quiet small. The location is quiet out of the way although taxi's were easy to find. We found the staff friendly, polite and helpful. There is also a small rooftop swimming pool with sun terrace.", "Date": "December 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "2", "Rooms": "5"}, "AuthorLocation": "london", "Title": "“Excellent apartment and facilities in secluded location...”", "Author": "kpdubai", "ReviewID": "UR49257877", "Content": "The arabian suites were located in Bur Dubai, but every taxi driver struggled with its location...but this didnt matter as the apartment and facilities (gym and pool) were ideal for short term vacations. The staff were very helpful and attentive.", "Date": "November 15, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Rauma, Finland", "Title": "“Dirty”", "Author": "sahlari", "ReviewID": "UR48056047", "Content": "Its not 4 star hotel, maybe 2 or 3 star. Worst thing was dirty floors and walls and cleaners didnt change dirty towels or sheets. Poolarea was dirty too (we was there only one time). Breakfast was ok, but Indian customers (families) was very noisy. Location of the hotel was quite bad, metrostations are far away (always have to take a taxi). It was still moneyworthy (9 nights/380€).", "Date": "October 29, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "3", "Location": "2", "Rooms": "2"}, "AuthorLocation": "antwerp", "Title": "“NZ Arabia you are so right!”", "Author": "facedancer145", "ReviewID": "UR47548126", "Content": "Stayed at this hotel in June this year,never again!Rooms so, so,Pool area disgusting,\"breakfast\" a joke.Only highlight were the staff.All very helpfull but overworked.The girl on the front desk told us she hadn't had a day off for a month.If looking for somewhere to stay that won't break the bank try The Golden Sands apartments,miles better.Oh and AZ Arabia you were well and truely stitched up with the phonecalls.All local calls in the UAE are free.", "Date": "October 23, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "NZ", "Title": "“Dont stay here”", "Author": "NzArabia", "ReviewID": "UR47345507", "Content": "Since this hotel got good reviews I decided to stay here. Firsty my room was so dirty, filthy cupboard doors, kitchen surface, oven, table tops, hair on the floor, dirty rugs, I wiped to surfaces with a white towel..it was black. I had to get housekeeping to come and clean the place..at 10pm at night, and vacumm the apartment myself. When I went to go to the airport at 5.15am, all the staff were asleep on the front desk and chairs in the lobby. Breakfast was terrible, dirty room, cockroach ran out from under the bread basket. Pool was closed. Corridor outside my room smelt like a toilet. Woman at the front desk rude and unapologetic. They charged me a horrendous price for 4 local calls and there was no sign or information saying that calls would be charged. My family arrived from NZ, and I had organised this hotel, I was embarrassed to have booked this place. I wouldn't recommend anyone stay here.", "Date": "October 20, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "1", "Rooms": "3"}, "AuthorLocation": "Abu Dhabi", "Title": "“Not Baad”", "Author": "comoros", "ReviewID": "UR38102505", "Content": "Nice hotel apartment, with kichnette. oven, fridge, washing machine, gas stove and lcd tv make our stay comfortable. but i dosnt like the smell inside room. i use a full bottle of my deodrent to get rid of smell. room and bathroom quite comfortable but location is not that good. remote area and u have to walk 400 mtr to get some nice resturants.", "Date": "August 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Ontario", "Title": "“Enjoyed my stay”", "Author": "Marg13", "ReviewID": "UR27490261", "Content": "I stayed at Zagy’s Arabian Suites in November 2008 for 9 days. I was in a one bedroom apartment, though I only paid for a studio. The apartment was massive, with 2 big bathrooms, fully equipped kitchen (washing machine!), and massive living room. The décor is modern chic. The hotel swimming pool is on the small side but perfectly adequate for refreshing dip, and there is a gym with dedicated hours for women only. The bed was extremely comfortable and room service was fine. Generally the hotel seemed very quiet, there is a masjid (mosque) across the street so I did hear the 5am call for prayer, but this is an Islamic country so you will hear that wherever you are. It only lasted for a short time though and then it was back to being quiet again. Breakfast was included in the rate and it was good. A choice of various hot items plus toast, fruit and pastries will keep most people happy and they change the selection daily. The staff were very friendly and helpful. One downside is that you have to pay for internet and local calls, but I have been told this is the case across Dubai. There are some internet cafes where it is cheaper that Zagy’s rate of 15 Dhs an hour. For example on Al-Mankhool road across from the wonderful Lebanese Village restaurant (I ate there most nights, reasonably priced, nice food and service) there is an internet cafe in the shopping centre across the street which is only 5Dhs an hour. The hotel is in Bur Dubai off the Mankhool road in a new subdivision. Buses run along Mankhool road, and once you figure out how to read the bus map (which is posted at most bus stops), they are a cheap way to get around for a flat fare of 2 Dirhams per bus ride. The other way to get around is by taxi, but they are frustratingly difficult to flag down on the street. If this is your preferred mode of travel either phone ahead or wait in places where people are likely be dropped off (hotels, shopping malls etc).", "Date": "April 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "cork, ireland", "Title": "“luxury but beware the noise of the mosque!”", "Author": "adomurph", "ReviewID": "UR26023815", "Content": "my fiance and i stayed at the zagy for a week's holiday recently and thoroughtly enjoyed our stay. the apartment we were given was at the side of the hotel not facing onto the quiet road but at 5am all that is shattered by the call of the mosque!! that would be the only disadvantage to staying here, and a pair of ear plugs sorted that out for us the second night! the apartments are luxurious, clean and very modern with every convenience. the staff are attentive and friendly. the breakfast is only ok but good enough to get you started in the morning - we went with the staples of toast, cereal and coffee! the swimming pool is clean and cool - very important in the heat and there were plenty of loungers on the sun deck. the hotel weren't great for calling taxis, but it was very easy to flag one down. however many taxi drivers didn't know where the hotel was, so tell them mankool road near the richmond hotel - once the mosque comes into view, you'll know where you are!! i'd definitely recommend this hotel and would have no hesitation in going back there and staying there again in dubai.", "Date": "March 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "blackpool", "Title": "“budget dubai at its best”", "Author": "frankBlackpool", "ReviewID": "UR25263484", "Content": "After reading other reviews i was very wary about my stay at the zagy, my fears were unfounded . I found the staff to be very helpful and anything we needed we got within min utes. Our one bedroom apartment was very airey and light, the beds were comfortable and over all clean, being opposite the mosque you can hear call to prayer but only for 10 minutes or so, i have recommended it to my friends and we are going back again it is budget accomodation at its best", "Date": "February 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“Highly Recommended!!!”", "Author": "luvtoflydubai", "ReviewID": "UR24055056", "Content": "Stayed at the Zagy in Jan09. Our usual preference is 5* beach resorts but we needed to be in the City and the Zagy came up on ebookers at an excellent rate including flights with Royal Brunei. Admittedly went with reservations with it being a 4* hotel (in Dubai there's a big difference between 3-4* and 5* hotels). We were very pleasantly surprised. The location is away from the hustle & bustle so it can be touch and go getting a taxi, but on one occasion we were able to get one just as we came out and we got the number of one taxi driver who we got on with so every time we needed to go somewhere we arranged a time with him to pick us up outside - so that solved taxi problems. We got in very late evening and asked about an upgrade and we managed to haggle a bit and get it reduced. Their policy is to ask for a AED100 deposit for mini-bar which is returnable if you don't use anything. The hotel reception isn't grand at all, but the staff were very, very welcoming. And yes we can agree with the other reviewer about the lady from Africa, she is very helpful and we found the cleaning ladies very cheerful on the whole. One small point is they don't wash up your dishes when they clean the room. The wi-fi is very quick, easy to get on to and a real bonus that you can access from the rooms as the 'business centre' is really only two terminals just past reception by the lifts. It's AED15/hr which is expensive compared to around AED5/hr at internet cafes, but hotels are always more expensive and you can log in and out as many times as you need to until your hour is used up. The hotel has two buildings A & B, both have got pools, but A's got the Gym and B's got the restaurant. We were in building A so going for breakfast meant going next door, but they're happy for you to call, place your order and will bring breakfast to your room for no extra charge (our rate also included breakfast daily). The restaurant is tiny but they have an acceptable range on offer for breakfast that can really set you up for the day. The 2-bed room suite was brilliant. Very spacious; modern; comfortable; good climate control, BIG kitchen - what they referred to as the mini-bar is a full sized fridge-freezer! The only negative points were that the room was short on some of the crockery/cutlery but we mostly ate out so didn't miss them but advised the hotel when we first got to the room to avoid problems later. There was also some advertised things missing - no in-room safe, bathrobes or shower curtain in one bathroom, but these things were all sorted out efficiently and quickly. We came across quite a few dust balls around the rooms, but generally the rooms were very clean. The morning call to prayer from the Mosque opposite is quite loud, so maybe ask for a room at the other side of the hotel. All in all we found very little fault with the accommodation and we found it a very acceptable alternative to our normal hotel choices, so much so that if we opt to stay in the city again, we would definitely go back there.", "Date": "January 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New Delhi", "Title": "“Value For Money”", "Author": "AkshaySharma", "ReviewID": "UR22369880", "Content": "Being a travel agent, we had got a fantastic deal of INR 5945/- per person including taxes for DEL-DXB-DEL ticket which I got booked or my wife and myself. Since my colleague's anniversary was on the same day 22nd Nov, he also booked it along with me. Now the next thing was sorting the hotel. I was told that Bur Dubai was a good area to stay. All the hotels that we looked at were kind of expensive as we did not want to spend too much. Then, we came across this hotel which had a 4 star rating and and their 2 bedroom suite was matching our budget. We booked it thru a website. The hotel is located on a quiet street right opposite to a mosque. The suite that we were given had 2 spacious bedroooms, a dining table, a sitting area, 2 attached bathrooms and a fully equipped kitchen. All in all, it was very good apartment. The swimimg pool, which is located on the rooftop, had very cold water. The breakfast was average or probably below average in my opinion. There is vegetarian restaurant about 5 mins walk and a supermarket about 3 mins walk from the hotel.Overall, it was a value for money deal and if I were to go back, I would like to stay there again.", "Date": "December 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Clean and safe - Was lucky to find this hotel.”", "Author": "ManifestStefany", "ReviewID": "UR21498162", "Content": "The hotel itself is lovely and in a safe area. There is a Mosque across the parking lot so be ready to wake up at 5am! There is also a grocery store behind the Mosque. Very convenient for quick trips. DO NOT USE the hotel cab. You will be charged triple the rate or more. They seem to make it up as they go along. Just go to the main street and get a cab. Not always easy but it's worth the saving. On my last day, they tried to charge me 100 dirhams for a 25 dirham trip to the airport. Also, their drivers are not always knowledgeable of Dubai. My last driver was so unsafe and new to Dubai and driving , I didn't think I was going to make it to my destination. In fact, I was very late - to the Burj Al Arab. One of the most famous hotel in the region and a cabbie can't find it? Give me a break! There are 2 gyms and 2 pools. One was working when I was there and the Gyms are a little frustrating in that you have to call to have them unlock the door even during gym hours. But it is very clean and the equipment is good. The free breakfast is pretty good. A mix of Middle eastern and Indian food. Also traditional eggs and toast options The staff in the coffee shop are very nice! As is the nice man who cleans the rooms and the lady who operates the gyms. If there is anything you need, be sure to ask the wonderful Kenyan lady on the day shift. Avaoind the male evening staff. She is the most knowledgeable and honest person there. Her prices were always fair and correct and you never felt she was cheating you. She was a pleasure! All in all, I enjoyed my stay. I loved the room ( has a washer dryer + full kitchen!!!!) and I would absolutely recommend it to others. Like anywhere, there are small annoyances to be aware of but the hotel over all is great.", "Date": "November 3, 2008"}], "HotelInfo": {"Name": "Zagy Arabian Suites", "HotelURL": "/ShowUserReviews-g295424-d1078457-Reviews-Zagy_Arabian_Suites-Dubai.html", "Price": "$68 - $299*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">PO Box 28120</span>, <span class=\"locality\"><span property=\"v:locality\">Dubai</span></span>, <span class=\"country-name\" property=\"v:country-name\">United Arab Emirates</span> </span> </span> </address>", "HotelID": "1078457", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/b0/47/b0471a6378f1d40d8e7bf1d2fb9291863large.jpg"}}