{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hove, UK", "Title": "“Great central hotel”", "Author": "doctorj42", "ReviewID": "UR139999967", "Content": "This hotel is great! It's centrally located on Hong Kong Island. If you're coming from the airport, you can get off at Hong Kong station and walk to it in 10-15 minutes, or simply change to Sheung Wan station. As you walk, you'll see that you're close to lots of shopping, luxury and bargain. Although you may have your doubts when you see the surrounding buildings, it's stylish both outside and inside. Your first stop will be the 2nd floor reception, where you are welcomed with a smile. This is a true skyscraper, albeit a narrow one with 24 floors and 3 rooms to a floor. The rooms are small, but they are clean, modern, and stylish - you'll have fun trying out all the lighting configurations. Once in your room, you'll find elegant shower supplies and slippers, plus a 'loot bag' with a few snacks and sweets. The mini-bar is free - although besides water and juice, it's just beer. However, there's a free happy hour from 6-8 pm with wines and other alcohol, and breakfast is free, too. Oh, wifi is free, too. I found breakfast impressive, in that while what was offered was limited, it was well-done and fresh: fruit cups, yogurt and compote, some breads, and ham and cheese. The happy hour snacks were less impressive; for example, the two nights I was there, the cut celery and carrots were not fresh and were turning brown, the cheese was hard, and the crackers all crushed. The wine was superb! The hotel also has a small gym, with 2 treadmills and 1 up-and-down machine (my brain is failing me now; you know what I mean). Noise was not a problem. The only thing keeping me from rating this as 5* is the price. My rate was about £105 a night. I know that HK hotels are not cheap and this cost is about average, bur for me it's still expensive. So, if you know you're going to pay around this rate, I highly recommend this hotel for its service and freebies.", "Date": "September 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Perfect Hong Kong base”", "Author": "bork3000", "ReviewID": "UR138707458", "Content": "Ovolo is a perfect base to explore Hong Kong. Rooms are small, as they tend to be in Hong Kong - but what they miss in size, they make up for in ingenious design, layout and some nifty technology. The result is very comfortable and cozy, and I enjoyed the stay quite a bit. The breakfast/common bar area on the second floor is comfortable, staff extremely helpful. Breakfast is basic but satisfying and there are snacks and even alcohol later in the day. The price is not terribly high for Hong Kong (though not cheap either). Metro station is about 5 minutes walk away.", "Date": "August 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Excellent Hotel and lovely staff!!”", "Author": "Jane L", "ReviewID": "UR137510131", "Content": "I stayed in Ovolo for 3 nights. The hotel has a great location, moderm design of the rooms. Also, provide free breakfast, free mini-bar, free laundry, complimentary for happy hours !! Reception staff are friendly and helpful, tried their best to fulfill my requests. Great !", "Date": "August 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“great value in HK”", "Author": "ABLJ", "ReviewID": "UR137491948", "Content": "Finally—a hotel that does not nickel-and-dime you on everything! upon arrival, I was offered a free beer and informed that the mini bar in the room (stocked with water, juice red-bull and Singha beer) would also be Free! The rooms are very small but very well designed and stylish. The staff are young, professional and attentive. The music in the elevator is great classic rock like the Rolling Stones and Led Zeppelin. There's a nice gym and really convenient laundry facilities (detergent provided!) on the 3rd floor. I stayed for HK$1000, an unbelievably low price for a hotel of this caliber in Hong Kong. perhaps because the price is low, most of the guests seemed to be Mainland Chinese, which made me consider some would not be as happy as I was here. The \"Western Chic\" style an largely Western staff do not quite 'jibe' with Chinese preferences. I felt this hotel has a lot in common with \"virgin\" from a branding perspective. downsides—very small. I stayed alone, 2 people in the room might be a bit too tight. even the elevators and entry hallway were very tight to move bags in and out of. While someone helped me up to the second floor on arrival, when leaving I needed to first go to the 2nd floor to check out then squeeze my gear back into the elevator to leave the hotel. There's also not a convenient place for pickup drop off in front of the hotel, because of a railing. but those are small grievances, If they keep the price like this, this is absolutely my new local in Hong Kong.", "Date": "August 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Sydney", "Title": "“Nice hotel (with a few issues)”", "Author": "ATW2012", "ReviewID": "UR137236279", "Content": "We stayed at the Ovolo for five nights. The hotel has lots of positives: great location; a gym; free laundry; nightly happy hours; filling breakfast; and a free mini bar. While the rooms are small, they are functional and a contain all you need if you are out sightseeing everyday. Reception staff and the manager are friendly and helpful. The biggest drawback is the quality of the housekeeping. On three ocassions we returned to our rooms at the end of the day to find they had not been cleaned. Twice we had to ask housekeeping for toiletries. The cleaning that was done was fairly superficial. We understand this hotel is fairly new, so hopefully this issue will be rectified shortly. Otherwise, it is a great place to stay and we would definitely stay here again.", "Date": "August 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stuttgart", "Title": "“Perfect Cityhotel”", "Author": "OliverZ87", "ReviewID": "UR137224940", "Content": "Spend here one night on my weekend trip to HK. Perfect place to start your city tours, 5 Min away from the MRT. Nice and a little bit crazy design of the rooms. A \"hip\" hotel in HK, which I can only recommend for people staying in HK with the aim for sightseeing", "Date": "August 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ambala, India", "Title": "“The Best Hotel”", "Author": "Vishalambala", "ReviewID": "UR137181456", "Content": "I Visited this hotel few days back. I just want to tell you guys;this is the best hotel equipped with best amenities and best staff... Its a great place to stay...Just stay once; and you will find to never leave this hotel...", "Date": "August 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Housekeeping Needs Improvement”", "Author": "caroline m", "ReviewID": "UR136863787", "Content": "Location is very good ! Some staff are really nice and some not so nice. The rooms are small but its well divided and the decor is very nice.. subtle and elegant. Our complain about this hotel is the housekeeping. The bed has curtains beside it and they did not clean that part since it cannot be seen its very dusty. We did not complain hoping they will clean it the next day... still they did not clean it and the day after it was the same. There was a day where housekeeping did not put any toilet tissue in our toilet. We requested from reception & the next there was tissue alright but the plastic wrapper of the tissues housekeeping left it in our sink... i think they must have forgotten huh ? They don't change the sheets everyday. One time i spilled a bit of drinks on the sheet we requested the sheets to be changed. Guess what when we got back housekeeping just wiped the white sheets with wet towels & probably dried it with a blower and never changed it ... the stains are still visible on the sheets but it was wiped down and to think we requested change of sheets. I also notice Ovolo housekeeping works really slow... by the time go back to your hotel at maybe 3pm or 4pm your room is still not cleaned!! we have to wait downstairs to have our room cleaned and this happened 3 times while staying in ovolo. This hotel is nice but i think management needs to change housekeeping or have them properly trained.", "Date": "August 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Warsaw", "Title": "“Very good!”", "Author": "michaelandro", "ReviewID": "UR136219880", "Content": "It is brand new so everything is modern, well designed and in very good condition- Very clean as well. It's location is just perfect- few minutes walk from MRT (take E exit). My room was small but enough- frankly speaking I don't see any reason to have bigger. And don't forget it is Hong Kong! Rate I paid was fair and minibar was included. What I would only change is the reception staff attitude. I had a feeling that they are just there to work- nothing else. When I asked for some advice about the Hong Kong the answer given was like- please do not disturb! I think that girls from receptrion desk should be changed by the guard who works on the ground flor- he was very helpfull!", "Date": "August 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "HK", "Title": "“Less is More”", "Author": "hotelholichk", "ReviewID": "UR136178938", "Content": "Nowadays, we always advocate the concept of \"Less is More\" and it can totally apply in the Ovolo hotel! When i first check-in in the counter, the staff welcomed me with a smiley face. They are not hurry in check me in the room but asking me if i would like to have a drink and snacks. I was quite surprised that the hotel provide me a wide range of tea bags and nespresso coffee which commonly seen in the chain hotels' executive lounge. The check-in process took me some time but it was acceptable with the companion of fine tea and brownies. The staff assisted me to the room and she was very helpful and knowledgable. My room is on the high floor with an urban view. The room is tiny but not surprising me because this was the norm in HK. I was quite delighted that the room equipped with Apple TV, quality english bathing amenities, a free minibar (yes, it is FREE!) and a welcoming loot bag filled up with snacks. In the evening, they had a happy hour in the Lo Lounge with a free flow of red and white wine, beer and soft drinks, they have some dippings and snacks as well. I spent a great night with my friend chit-chat in the lounge from 6pm-8pm :) After 10 pm, the street was quiet as shops were closed, but i can easily walk to Lan Kwai Fong (full of clubs and bars..:)) and Central to grab some nice food and wine. The bed in the room was so comfortable becuase there were 4 pillows and 2 cushions accompany me. I grab the breakfast in the early morning next day, the hotel served continental style breakfast (e.g. greek yogurt; fresh fruit; croissants; bagels; ham & cheese and so on) I was energized after having such a good morning! The all-above mentioned stuff are all inclusive in my room rate with no hidden costs, that is the reason why \"Less is More\"..I paid for around HKD1000+ and got the whole bunch of things, I defintely recommend this hotel to all of you.", "Date": "August 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manila", "Title": "“Simply Amazing!”", "Author": "brickello", "ReviewID": "UR136035841", "Content": "I stayed with my partner last week (end of July) and what a refreshing surprise Ovolo Queen's Road Central turned out to be. Amazing Location - The location is topnotch... 5-min cab ride to Airport Express Hong Kong Station, 5-min walk to Sheung Wan MTR Station, 10-min walk to SoHo, and for the pink crowd, 2-min walk to Volume and Zoo. Amazing Design - The hotel is very sleek, chic and modern, with a keen eye for design and details. The rooms are small but definitely not unusual for HK standards. The hotel makes up for it with intelligent space-saving design features i.e. high-ceilings, huge windows, built-in safe and mini bar, pull-down open closet, etc. The bed was extremely comfortable with soft sheets and we always managed to get a good night's rest. The nifty, techie features like AppleTV and electronic curtains also added to the room's wow factor. Amazing Freebies - The hotel throws in some wonderful bonuses... free Wifi that actually works (and is fast!), free breakfast (modest selection but adequate and yummy), free self-laundry, free local calls, free mini bar, free drinks and snacks at the stylish Lo Lounge on the 2nd floor! The folks at Ovolo sure know how to spoil their guests! Amazing Service - What we found most surprising though was the friendliness of the staff. HK generally can be quite a cold place with everything moving in fast forward. Ovolo is an exception. From the moment we stepped in to the moment we checked out, we felt the attentiveness and the warmth of the staff in attending to our needs. And every single bit felt genuine. Like what was mentioned in a previous review, there's a strange sense of calm inside the hotel, a stark contrast from the hustle and bustle outside. We had a quick chat with the manager Eugene during check-in and it seemed apparent that his personable nature trickled down to the rest of the generally young staff. A far cry from the standoffish and almost robotic service you get from more established and definitely pricier hotel chains. Amazing Value - We booked the hotel through a special 3-night Summer Bash Offer and all things considered, we definitely got more bang for our buck. I could not have picked a better oasis in Hong Kong. I will definitely be back!", "Date": "August 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Lovely Hotel”", "Author": "BC-Travel-Bugg", "ReviewID": "UR135886124", "Content": "New, clean and modern hotel. Very comfortable feel and staff very attentive. Great value for money as is all inclusive with no hidden costs. Stayed for just one night but would have loved to stay longer.", "Date": "July 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Wonderful in all aspects!!”", "Author": "Suntory65", "ReviewID": "UR135216339", "Content": "Beautiful new hotel with fantastic rooms and amenities. I recommend this hotel to anyone wanting a fair priced place to stay on HK Island, close to Soho and Lan Kwai Fong. It's a modern hotel, sleek in design, and very comfortable. I stayed here for 3 days and enjoyed it very much. Pros:- 1. Location Convenient location close to Soho and LKF 5-min walk to Sheung Wan MTR Station (1 stn away from Central) Queen's road which is a main road with lots of shops and restaurants 24-hour Mcdonald's across the street 2. Amenities Comfortable queen bed and soft sheets Stone tiled and hardwood floors Apple TV (Wow!) and DVD player Beautiful bathroom with rain shower head Free WIFI 3.Others Free minibar in the room Happy hour from 6-8pm everyday Wonderful manager and staff members Gym and self service laundry room Cons:- The only con I can think of is the rooms can be on the smaller side but it is so well designed with high ceiling that you don't feel like it's that small.", "Date": "July 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“New, clean, comfortable”", "Author": "CoffeeBird", "ReviewID": "UR135045376", "Content": "Room: The rooms are extremely well designed that all the features that are needed are there. It's new and clean. Even in the small space, there is a desk, a safe, a fridge, a TV, and a bathroom with rain shower. Nothing is missing at all. Staff/ service: Professional, service-minded, friendly and helpful. Breakfast: The breakfast bar provides the basics (cereals, yoghurt, bread, croissants, cold cuts/ cheese, Nespresso coffee, fruits) and is served in the same lounge that holds happy hour in the evening from 6-8 pm. Other little things: (1) Wi-fi works very well (2) A cafe is on the ground floor and McD's & Watson's are across the street (3) Walking distance to the Central station and the piers (4) Everything in the mini bar is free and you can take snacks and drinks from the lounge to add to the stock (5) Free Happy Hour! I would definitely recommend this place to friends and will stay here again on my next trip to Hong Kong.", "Date": "July 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“Great Little Gem”", "Author": "Kevin M", "ReviewID": "UR134623067", "Content": "Having previously stayed in other surrounding hotels such as the Bauhinia, Mercer, Hotel DeEdge, I was not to sure what to expect since I had never heard of this property before. It was nothing short of refreshingly wonderful for a traveler such as myself that has stayed in over 50+ hotel rooms in my time. From the first time you step foot in this place, you feel served and attended to with genuine care (genuine personality behind their smiles) and this is hard to find in Hong Kong. The Lounge is a great place to kick back and surf the web or grab a coffee and snack during check-in or anytime throughout the day, I even utilized it for a meeting with local clients and this was no problem with the staff to arrange. Breakfast and Happy Hour are additional touches that you usually only find in Club Lounges of hotels in Hong Kong, and if not then they are usually executed poorly - at this place they set it up well. The rooms (although yes, smaller than your average) are extremely functional, as long as you don't plan to spend 12-hours in the room, it's perfect. Top choice, I'll be back for sure.", "Date": "July 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Style and Comfort”", "Author": "john s", "ReviewID": "UR134349095", "Content": "I stayed at Ovolo 286 during their soft opening back at the end of May 2012 and had very little idea of what to expect from the stay. It turned out to be one of the more comfortable hotel experiences I've ever had. Don't expect the grandeur of the Ritz or perks of a Four Seasons - Ovolo is far more refined than that. The rooms are very small, so don't expect to sleep more than a close couple or a single person in a room, but whoever does occupy the space will be supremely impressed. Apple TV in every room, great bathrooms (showers!), extremely comfortable beds, cool design - coming back to the Ovolo each night felt like coming home. I really mean that - I'm not entirely sure what it was, but something about the room made it feel so warm that I could easily have lived there for a month. The staff was fun and accommodating - take the time to meet Eugene if you can! And the facilities are - like the rooms - small but very well designed. I highly recommend the Ovolo, and hope you have as great a stay as I did!", "Date": "July 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tokyo", "Title": "“Best value and great service in Hong Kong”", "Author": "RoppongiTokyo", "ReviewID": "UR134186788", "Content": "Check out their website http://www.ovologroup.com/hotels/286QRC/en/ and it’s exactly that way. I changed my plans last minute and booked this one on AGODA. Never heard of OVOLO hotel but the location and the price suited me so I booked it as my usual picks were full. Overall experience was wonderful. This is probably one of the smallest rooms I have ever stayed in but this is one of the best nights in 40 years of travel. Upon check in, they great you with a smile and offer you a glass of wine! Then they tell you to relax in a sofa while doing the registration. After all is done a nice lady take you to the room which is unbelievably small but surprisingly warm and cozy and explains you how to handle all the gimmicks. Everything is design, ultra-modern and functional. Free wifi and this one is definitely a first FREE MINI BAR still wonder how they managed to insert a mini bar in a mini room. The second floor reception/lounge has drinks, snacks and fruit and it’s all free. I felt like in the first class lounge at the airport. I am not a big believer in spiritual things like “feng shui “ but if this exist they definitely used it in the OVOLO I felt like a strange calm and relaxing atmosphere in addition to the staff being extremely friendly. I have met thousands of hotel staff these ladies were especially nice, Again “Feng Shui” maybe? If you are a couple with two suitcases you will have a problem with this room seems they are all identical in this property, but if you are a solo traveler that just needs the hotel for the shower and the bed this is the best value for money in Hong Kong I will definitely be back.", "Date": "July 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“TWO DAY ONE NIGHT STAY”", "Author": "colby n", "ReviewID": "UR134079258", "Content": "I stayed here for one day and one night thisi was sthe most relaxing feeling I have had for very long time. The staff are very friendly and helpfull, the room I stayed in was very comforting, I would definitely use this Hotel as first pick the next time I am in this area.", "Date": "July 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hong Kong, China", "Title": "“Short stay but worth it.”", "Author": "doncho52", "ReviewID": "UR134073532", "Content": "Much thanks to Eugene, Rachael, Niko, Winkey, Gigi and the rest of the staff. Me and my friend were able to have a nice stay and find good local resturants to eat. From the time we arrive to the service we receive made staying here worth. The price and location is just right for where we wnated to go. Friendly staff were wating to help out and give us hand with anything that came up. Definitely will be coming back and staying here.", "Date": "July 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Very small rooms, but well appointed”", "Author": "natspicer", "ReviewID": "UR133543967", "Content": "When I read that the rooms were small, I looked at the photos and I thought they dont look that small. However trust me, they are very small and very difficult for a couple to share comfortably (singles should be okay). Whilst the rooms are very small, they do a great job with the space - not wasting an inch with innovative ways to store clothes. However big suitcases would be a problem. The breakfast was good. However dont expect a big hotel buffet with hot food, it was just continental which suited us. The free bar at 6-8pm each evening was a great way to relax each night. The staff were very friendly. Good location, within walking distance to Soho. Overall very clean and stylish and good value considering the cost of hotels in HK.", "Date": "July 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Bangalore, India", "Title": "“Highly Recommended......”", "Author": "AshishPuri11", "ReviewID": "UR132578931", "Content": "We stayed here recently on our HongKong trip & I have very positive feedback for this place. Its a brand new hotel on Queen's road. They have neat, clean rooms, clean toilets, contemporary ambience & extremely helpful staff. To add further, WiFi, breakfast & drinks are complementary.......including the minibar. Rooms are small but that's the norm in HongKong.... Its a 5 minute walk away from Sheung Wan metro station & about 7 minute walk away from Lan Kwai Fong, most happening street in HK. The only thing which I did not like much is that street on which this hotel is located shuts down pretty early. Could suit people who like it quieter. Also, don't expect any great views. Important tip for people who like Indian food, well there is this small restaurant by the name Masala very close by.", "Date": "June 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Ovolo made my stay in HK much better”", "Author": "Martin R", "ReviewID": "UR131546117", "Content": "A business hotel with a focus on service and comfort. Staff were very helpful and clearly take pride in what they do. The in-room technology, ie tablet, AppleTV and complimentary hi speed wifi, were all very impressive. Free mini bar was a nice touch too. Overall good value. Happy to recommend.", "Date": "June 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "IRELAND", "Title": "“Good choice of stay - Ovolo 286”", "Author": "Tanya J", "ReviewID": "UR131422196", "Content": "Ovolo 286 at Queen's Road is brand new boutique hotel that I would highly recommend you all to stay in. Free breakfast, free wifi, free self-laundry, free cocktail, free drinks in mini-bar. The receptionists are cheerful and helpful!They helped sort out lots of problem of mine, such as giving me advice on foodie and stuff. One downside thing is that, you got to bear with the only lift operated in the hotel. I give my credit to this hotel, 5 stars.", "Date": "June 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bangkok", "Title": "“It's worth”", "Author": "Mimi T", "ReviewID": "UR131318225", "Content": "Ovolo at Queen road central is new hotel Location : Prime Location. Close to Central for shopping, Soho for restuarant, Hollywood for entertainment,... Close to Train Station. Design: Modern, Simple and Clean, Comfortable Bed Service: Helpful and friendly staffs. Extra: Free minibar, open bar from 6-8pm, good security.", "Date": "June 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Nothing was too much too make my 3 month stay more comfortable ...”", "Author": "Manadarin52", "ReviewID": "UR108260854", "Content": "Ovolo in Queens Road is situated conveniently near to Central .. with many useful shops around them and all the Antique Shops in Hollywood Road just a walk up Ladder Street ....Transport is very easy with Taxis and Buses and nothing is too far to walk to..All the staff are exceptionally helpful if you need anything at all .. My Stay was without any problems at all and I would definitely stay there again ..", "Date": "May 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Great staff, great location.”", "Author": "bigcitykid", "ReviewID": "UR104784093", "Content": "The staff here was wonderful -- they helped with everything and never hesitated to try to take care of unusual requests (change of pillows, extra towels, etc.). I cannot recommend them highly enough. I enjoyed my stay tremendously. Having the O Cafe next door was great, and the free paper and fruit in the morning was wonderful. Great free wireless. The only downside is that the windows do not open and that there is not a gym on site.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Great value, service and a perfect place to stay as a new HK Resident”", "Author": "007Arnie", "ReviewID": "UR101996599", "Content": "I stayed here for 6 weeks after moving to Hong Kong and thought it was the perfect place to stay. I had looked at probably all the serviced apartments available and this is definintely the best value option in this price bracket. The staff were very helpful helping me acquaint myself with Hong Kong, and when I left stored my luggage for me. I moved into one of their other properties (just because I wanted to live in a larger place) when I came back to Hong Kong a month later and they arranged for my luggage (4x 100 litre boxes) to be moved free of charge.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Hong Kong, China", "Title": "“The \"feel\" is great...”", "Author": "DoctrineofGabe", "ReviewID": "UR100330518", "Content": "For the price I paid, it was ok. The rooms are big (I took a 1 Bedroom, apparently all the studios were booked when I asked). The front-desk staff were nice. Don't expect free breakfast because this isn't a hotel, but expect a very clean room each day. This is an important thing after walking around that area! I like that they give a \"welcome tray\", after flying the fruit provided is quite nice. What they need more of is fruit, not chocolate. Jackie (I think that's her name) was quite nice, she had a few hints on where to go around the hotel. The only problem is taxis, they really need something to let taxis know that they are there. Suggest a taxi card or give the guests a proper map!", "Date": "March 16, 2011"}], "HotelInfo": {"Name": "Ovolo Hotel - 286 Queen's Road Central, Central", "HotelURL": "/ShowUserReviews-g294217-d1083482-Reviews-Ovolo_Hotel_286_Queen_s_Road_Central_Central-Hong_Kong.html", "Price": "$171 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">No.286 Queen's Road, Central</span>, <span class=\"locality\"><span property=\"v:locality\">Hong Kong</span></span>, <span class=\"country-name\" property=\"v:country-name\">China</span> </span></span></address>", "HotelID": "1083482", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/da/d5/66/ovolo-hotel-286-queen.jpg"}}