{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Really comfortable and feels like home”", "Author": "Greggyo", "ReviewID": "UR127070855", "Content": "I booked a room under the weekend escapade package and did not have any regrets. I feel that this place is even better than Fraser Suites. I chose Ascott over Fraser this time round so that I can have a basis for comparison and boy, I've found my favorite service apartment in Singapore. The reception was great, fast and hassle free. It took me less than 10 minutes and I'm already in the room allocated to me. The room smells really good, is really clean and has symphony music when you entered the room. The amenities in the room is good too. There's a washing machine with dryer (together with detergent), microwave oven, cooker and hood, dish washer. Basically, a well equipped kitchen. The kitchen was fully utilized by me because my partner has food allergy so we always eat in. One negative point was one of the cooker was faulty and I'm left with the smallest one. It's really inconvenient. You have the option of closing the door that separates the kitchen and the room so that the room won't smell. The room is huge as compared to normal hotels in Singapore. The room comes with a working desk too. I love the toilet the most. It's huge. There's rain shower, normal shower and a tub. There is a glass panel separating the bath tub area and the bed room, if you're worried about privacy, you can always pull the blinds. They have this awesome infinity pool on the 19th story and when I was there, I had the pool to myself and my partner had the whole gym to himself. He said the gym had really high end equipment. The view from the 19th floor was fantastic, especially at night. The Jacuzzi is on the 21st floor, you've got to climb up a stairway before reaching. The offices beside the hotel will be able to see you in the jaccuzi if you don't mind. It is near the famous food place called lao pat sat. Sells really good food. I skipped the buffet breakfast provided.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newcastle", "Title": "“Fantastic venue, friendly helpful staff”", "Author": "gaysaway", "ReviewID": "UR126679268", "Content": "I booked this for a week while on business - didn't know Singapore well but this was a good location for most things (it's near Marina Bay and directly next to an underground station). Serviced apartment surpassed my expectations - it was spacious, light, and extremely well equipped. It had the \"wow\" factor when I walked in! The gym and infinity pool were very pleasant to use (and very quiet - there was only one other person using them while I was there). Staff were very helpful and always called me by name. Great service on checkout (I had to get a taxi for an early flight and they arranged it all for me). I can't recommend this place highly enough and would definitely stay again.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Nice Hotel / Apartment”", "Author": "RSTE1234", "ReviewID": "UR126626882", "Content": "Stayed for 4 nights on business along with my wife who made the visit with me. Well located for the Marina Bay area with the serviced apartments being well maintained and a nice layout. Staff were friendly and helpful. Nice small gym but limited equipment and some strange settings on the weight machines when would expected actual weigh amounts it was resistance levels but nice and well kept", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Australind, Australia", "Title": "“Great for long stay”", "Author": "Hoony", "ReviewID": "UR126068194", "Content": "Stayed for 2 weeks at Ascott Place whilst in SG for business. Required a serviced apartment due to length of stay and was not disappointed with the choice. Good size studio room with balcony, galley kitchen with amenities sufficient for cooking any size of meals, washer\\dryer combo and good bathroom. Staff very helpful and location was great. Nice for walking around Marina Bay after work and close to shops. The pool looks fantastic, even better than the photos, and the roof top garden is a little oasis away from the noise of Singapore. Not a hotel so no room service, but perfect for long stays or if you want to go out to enjoy Singapore. Definitely stay there again and recommend it.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Top notch in the banking district”", "Author": "Brandon228", "ReviewID": "UR125501540", "Content": "highly recommended for the biz traveller who needs to scour the financial district. Besides location, the property is in great condition & offers lots of room & space . I liked the contemporary design & reasonable rates", "Date": "March 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Good apartment-hotel, excellent location”", "Author": "markw_bd", "ReviewID": "UR125487928", "Content": "I understand the Ascott Raffles Place used to be called Asia House, your taxi driver may well know it by this name. At the time of construction it was the tallest building in Singapore and is a fabulous example of colonial twenties / thirties architecture. Today it is rather dwarfed by the towers of the surrounding business district. It is down towards Marina Bay, in the central business district and opposite Raffles Place MTS, so it is well located. At the time of booking I hadn't realised it was an apartment-hotel. But this turned out to be a bit of good luck. The room was sizeable, great bedroom area, with a small but acceptable desk and seating area, huge bathroom and a small galley kitchen. All very well appointed, I wanted for nothing in the galley kitchen, even had a washer-dryer, and the fridge was enormous. The bathroom is a delight with a wet-room comprising shower and bath. Plenty of storage space. Breakfast is available and there is a small bar, but the expectation I think is you self-cater or go out. Breakfast was buffet in style but not hugely exciting and there aren't many tables. That said service was helpful and friendly. There is an 'on-roof' pool and gym. I used the pool which was great if slightly unnerving as it is a complete glass construction that looks out across the neighbouring towers. But a nice place to relax. My only reservation is I had significant problems with sending emails via the hotels internet system. Email was showing as sent but was never received. This is not a problem I have ever experienced before. That said the hotel's IT support did their best to resolve things. I've had correspondence with the hotel management and they have been helpful and responsive so I can't do anything other than praise their attitude. I didn't have any problems with Internet access and email seemed to arrive ok, so it may be I was just 'unlucky', but might be an idea to cc your self on email sends so you know they've been sent. Staff were very friendly and helpful, and there is excellent maintenance. I received a visit from the maintenance engineer to repair a light which I was completely unaware had failed. Demonstrates a great pro-active attitude by housekeeping staff. Email issues aside you'll find this a great hotel, well located.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "hong kong", "Title": "“Appartment hotel in the middle of Central business district”", "Author": "joycekwong", "ReviewID": "UR125014411", "Content": "Great location in the CBD area, comfortable and relatively large rooms with kitchenette facilities. Good business hotel at reasonable rates.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Spacious and comfortable”", "Author": "thealphabet", "ReviewID": "UR125008072", "Content": "I booked this place for three nights in February 2012, as it was close to where I would be working. The hotel is in the Singapore CBD, but about a 10 minute walk to the Marina Bay Sands and associated shops etc. Service was impeccable. Reception was happy to print a document for me free, which you won't always find. Free wifi was included with my package - it wasn't obvious at first what the tiny scraps of paper with random codes on them were for - which is always nice. The room, a studio premier twin, was spacious and quiet (well, the air conditioning made a bit of noise but nothing disturbing). It was well fitted out with quality appliances in the kitchenette (which I didn't really use), a clothes washer/drier, and even a Bose sound system (no iPod dock, though). The bed was very hard - I like that - and for a single, 4 foot wide is pretty big! The pool on the 19th floor was quite something - glass walls all round, and a good view through gaps in the buildings to the bay. Tall office building all round though so you can't help but feel you are on full view to all the adjoining office workers during the day! The building had a nice feel to it, it had a bit of character, unlike lots of concrete and glass towers. The train station entry just outside the door was very handy (trains every 3.5 minutes, wow...). Complaints? Nothing major. When I checked in about 10 pm, I asked if there was anywhere nearby where I could buy a local mobile SIM card. The reception desk directed me to \"the seven eleven next door\" but I was unable to find this. (Hint, later exploration reveals there is no seven eleven next door - there is one in the underpass on the way to the MRT station, though! Ended up buying a Singtel SIM from a Singtel shop though, as iPhone micro SIMs are harder to find. Taxi from the airport was $27 Singaporean, I think this varies widely with the type of taxi and whether you pay by card or not. It was a 18 minute trip. I am likely to be back in Singapore in coming months and will definitely angle to stay here again.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Very well appointed and away from the \"tourist\" area.”", "Author": "acl1", "ReviewID": "UR124952778", "Content": "I stayed at Ascott Rafles Place for three nights whilst on business trip. Hotel is very well situated and conveniently right next door to MRT station. No restaurant in hotel, apart for limited, but quite adequate, breakfast which is served in the lobby bar area. Numerous eating houses within close walking distance. Room comfortable and well appointed. Excellent bathroom with rain shower AND slide shower. Staff all professional, polite and and helpful. I got the impression that, if one were staying long-term, the staff would get to know you and become a little more friendly as well.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Quality serviced apartments in a good location”", "Author": "JMTrinidad", "ReviewID": "UR124391338", "Content": "I've been staying here since Jan. 2012 and will be here until April. I will amend my review if I thing it is warranted but so far we've been very pleased with our stay. Location It is very conveniently next to the Raflles Places MRT station (where you can take the East-West and North-South lines), Lau Pa Sat (one of the bigger hawker centre), and a short walk away from Merlion park. Amenities We got a 1-bedroom, 1.5 bath apartment, a fully equipped kitchen and washer/dryer on the 18th floor. It has executive style furnishings, two flat screen TVs and a very comfortable queen bed. The bathroom is very spacious, a large bathtub, rain shower, separated toilet, and a wide sink so you don't have to push each other when brushing your teeth. They have an awesome infinity pool and gym on the 19th floor, a small outside garden and jacuzzi on the rooftop. The only small issue I have is that the hot water is not consistent. Sometimes its really hot and sometimes not. But it wasn't enough to ruin my experience. Service The staff are very friendly and always quick to greet you when you leave and when you come back. The room is always kept clean and they take care of your requests. We once asked for more water since they usually just give us two bottles. Now theres always at least 8 bottles in the fridge. Concierge was also very helpful when we just checked in helping us find and mark on the map where the nearest bank, grocery store, and areas of interest.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Christchurch, New Zealand", "Title": "“Lovely rooms, good for business travellers”", "Author": "HHandley", "ReviewID": "UR123076307", "Content": "This hotel is located in the business district, although with the ease of travel in Singapore that is not an issue. The apartments are serviced daily and of a very good standard. There was a full kitchen with a stove, oven, washer and dryer. There were two tv's - one set up so you could watch it in the bath. The apartment was incredibly clean and staff were very polite and helpful. There is a small infinity pool on the roof and a garden to sit in too. Very close to Lau Pa Sat for cheap food and a few small grocery stores nearby too. Eating out is cheap though. Next to the subway station at Raffles Place makes travel very easy. Would stay again.", "Date": "January 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Good value Good location”", "Author": "eiying", "ReviewID": "UR123060079", "Content": "This is a studio apartment in a good location and at a good value. It has a studio lay out, huge bathroom, small kitchen including washer. Good facilities but the replenishment of coffee and personal care products is not consistent. The buffet breakfast is limited. Its a good value for a 5 star hotel.", "Date": "January 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Australia", "Title": "“Comfortable, good value hotel”", "Author": "oliverAustralia", "ReviewID": "UR122992280", "Content": "This apartment style hotel is in a good location. It has a comfortable bed - although I found the pillow too soft -and had everything needed. . I appreciated the washing machine in the little kitchen/ laundry area. The TV had lots of good documentary channels which I like and the bathroom was more than adequate. However, due to the 4 small windows and lack of natural light or view, the room was not one where I wanted to spend a lot of time. It was good value for a 5 star hotel and I would rate it as average for this class of hotel", "Date": "January 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New Delhi, India", "Title": "“Good business hotel”", "Author": "DKSen", "ReviewID": "UR122852202", "Content": "I stayed for a week at the Ascott and if I were to describe it in short, it would be that its a good place for a business traveller. The interiors are not flashy and super-impressive but at the same time not really dull. The room was like a studio apartment and quite well equipped, including a 3-2-1 Bose system. The wireless internet works flawlessly and it was not billed separately. The staff is very non-intrusive and the location is right in the heart of the CBD next to Lau Pa Sat. As a business traveller, all I was looking for was a comfortable and quiet hotel, and not too far from my office. I think Ascott fits all of this and at $212 it was well worth the money. If I'm back in Singapore for business, I would definitely stay here. However, on a leisure trip, I would choose a more fun place.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Excellent location for business travelers...”", "Author": "alanyeo76", "ReviewID": "UR121367222", "Content": "Stayed at the as ascott again after one year and I would say that the standard has remained. The location is excellent for business travelers as it's seated right in the middle of the central business district. The mass rapid transit station is also just a 5-10 minutes walk away. If you are into shopping, you can just take the train from raffles place to the orchard shopping and it's just about 10-15 minutes. However, for locals, the hotel does not have it's own parking facilities and thus, may pose a problem for those who are driving. The nearest car park; and also the cheapest is the golden show carpark which is about 10 minutes walk away. The rooms are clean and tidy. They come with a kitchenette and therefore, one may cooked inside the room. There is a door separating the kitchenette and the living area and so your room will not be filled with smoke even when you are cooking. Ample space inside the room where you can find a relax corner, a working desk and also a small guest area with sofa. There is a gym, a small swimming pool and coffee lounge on the 19th level and the coffee is served free-of-charge. Service attendants are very friendly and you are sure to be greeted every time you see one. Checking in was a breeze and reception staff are extremely polite and friendly too. The hotel lacks a proper restaurant but the famous lau pat sat, serving hawker food is just a stone throw away.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Excellent for the independent traveller”", "Author": "mikelovesutah", "ReviewID": "UR121307110", "Content": "We stayed at the Ascott for four nights and were completely and totally impressed by the rooms, the amenities, and the service. While it is not a full-service hotel, it has all the services that any reasonably low-maintenance traveller needs, including daily room cleaning and toiletries, free wi-fi internet, laundry service (which you'll never need because the room comes with a washer/dryer), a gym, and an amazing pool. It does not have room service or a dedicated concierge (though the front desk staff are very helpful). The best part is that despite missing only a few services and having superior rooms, the Ascott is usually cheaper than comparable hotels. The rooms are new and modern studio apartments, with full kitchenette, spacious bathrooms with rain shower room, washer/dryer, and an incredibly comfortable large platform bed, all decorated very tastefully in modern minimalist decor. You also get free bottled water and some soda! The gym is small but well equipped, and the pool is an amazing large rooftop glass-walled design that makes you feel like you're swimming in an aquarium. The only potential downside is the location, depending on your preferences. It's in the heart of the financial district, so if you're going for work in that area, it's perfect. If you're a tourist, it's slightly removed, but still within walking distance from core tourist areas like Boat Quay, the Esplanade, and the Marina Bay Sands. A decent hawker center can be found at Lau Pa Sat just a block away and there's a Din Tai Fung underground across the street. In any case, if you want to go elsewhere, the subway station is right across the street and there is a taxi stand right outside. Finally, the staff was very friendly and welcoming. We were pleased with everything about our stay.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Best value for your money”", "Author": "ShaifulKL", "ReviewID": "UR121114132", "Content": "We stayed at Ascott Raffles Place and later in Marina bay sands during our last trip to Singapore. Sure the later has all the glamour and fame but our family felt really at home at the Raffles. I find Raffles gives me the best value for money in SIngapore. We loves the huge room and the kitchenette. The pool is small, which we did not mind because we spent most of our time at the Marina bay mall and wondering around Singapore. It is about 500 meters to the Mariba bay mall, a nice walk by the water lagoon. If you are driving, you can park your car at the marina underground car park.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Yet another great Ascott Residence”", "Author": "FulfillingLife", "ReviewID": "UR121009676", "Content": "We opted to stay at the Ascott as we are big fans of the Ascott in Sathorn, Bangkok and knew we wouldn't be disappointed by the facilities. Rooms: If you're looking for five star, then you really do get it with the overall ambience and design of the rooms. The beds are super comfy. The room offers all the mod cons expected in a self contained 5 star unit and more - huge flat screen TV, espresso maker, Microwave, desk, lots of cupboard space and washing machine/dryer (note: it's a combo so give yourself a good 3 hour turnaround time). The bathrooms are very plush with wall to floor granite, separate bath, rain shower, lovely l'occitane products. Hotel: They have really managed to keep the old world charm when upgrading this place. The only thing to note is the musky smell of the corridors. It's not unusual, especially coming from Bangkok, but should note as I am a little touchy on the nose when it comes to smoking in hotels etc. But it didn't effect me that much. Staff: Always courteous and helpful. Nothing was ever a problem. They're very attentive, so if you're looking around, they'll make an effort to assist. Pool/Gym: Pool was pretty cool. But just a pool to cool off in. The Gym was nothing to rave about. We are gym goers so didn't find it adequate enough. But if you just want to do a couple of exercises or cardio, then it's fine. Nearby: La Pa Sat one block away which is open to late - great for a snack if you arrive back to the hotel hungry late evenings. MRT across the road made it very accessible to all the other locations. We only had one day so chose shopping at Bugis Junction - covered air-con and street complex with cineplex, fresh groceries, restaurants and lots of cool clothing bargains. Then Clarke Quay for dinner. That was more expensive than I thought it would be but the atmosphere was upbeat and fun with some outdoor bars and some indoor night clubs. The Marina Bay Sands and city flyer walking distance or short taxi ride. Cons: I wouldn't normally base my decision to stay at a hotel by what they offer for breakfast, but it was not 5 star. It wasn't the quality that was the problem, it was the variety. Basically they don't have a kitchen so it was a very small buffet of cold food. Of course a toaster, but just white bread. couple of cereals, some cold meat, boiled eggs, muffins and fruit. Coffee/Tea and Juice. The only reason I'm complaining about that is we spent more money on accommodation for final romantic weekend to end our holiday than we did for 4 days at other 5 star hotels in Thailand, where we travelled for 3 weeks. We wanted to be pampered and it was just disappointing. No views from the studio rooms, but we only ever sleep and rest so didn't miss it. Pros: Proximity to attractions and transport facilities, and hotel amenities.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“More than just a hotel”", "Author": "Krimie", "ReviewID": "UR120192450", "Content": "Amazing place! The room's huge, with lots of living space n furnished with amenities like a fully equipped kitchen, fridge/freezer, oven, dishwasher n even a washer/dryer machine! The bathroom is spacious with separate glass door panels to toilet, wash basin area n the bathtub. Complete with a standing showerhead n rainfall showers as well! There're two televisions; one facing the bed n the other facing the sofa lounge. The king sized bed is heavenly, ensuring u a good night sleep. Do check out their infinity swimming pool, overlooking the busy city area. Complimentary wifi provided n if u're bored late nights, check out their list of complimentary DVDs library although I feel that they need to improve on this as there's not a wide range of selection. Staffs are helpful, friendly n approachable. A great stay n definitely, i'll be back! =)", "Date": "November 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Adelaide", "Title": "“Offered more than a hotel room”", "Author": "philljan", "ReviewID": "UR120136647", "Content": "Only apartment in Singapore I could find that would do daily bookings. Stayed 3 nights. Apartment Booking and rate not correct on check in even tho made direct thru website. Booked on a special offer price which made it affordable. Room given was great, large and a view of river but twin beds! Reallocated a king bed room as booked, but at back of hotel, smaller & dark but still of high standard! But it had the washing machine / dryer needed after a couple weeks touring and was the main reason booking here! Location a bit out of the way but very convenient to the business area. Swimming pool unique. Would recommend if kitchen/washer high priority.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Hard to fault”", "Author": "TheTravellingGlutton", "ReviewID": "UR120098945", "Content": "We have just returned from a 4 night stay in a Premier Studio room at the Ascott. The room was absolutely huge, well furnished and clean. There was more than enough room to store luggage and lounge around (there is a couch and a desk in the room, as well as a table and chairs). Our room was on the road side of the building and even though there was a busy intersection outside we could not hear a thing - Very good double glazing! We had a nice view of the sculpture at the intersection. We had a twin room and the beds were king single sized and nice and firm. There was a well stocked kitchen and even a dishwasher and washing machine in the room! The bathroom was huge, with separate sections for the toilet, basin and shower/bath. You can screen off the bathroom from the main bedroom, but all doors within the bathroom are glass. In general the staff were very helpful. They let use their computers to check in for our flights as there was no business centre. Really the only downside was the lack of usual hotel amenities such as a business centre, but there is free wi-fi for those who move with the times! The hotel was well located with an entrance to the Raffles Place MRT station right outside the door. There is also a hawker's centre less than a block away. As the hotel is located in the business district there are not a lot of shops and cafes around, but it is no trouble to get anywhere with the MRT so close. It was also walking distance to the new Marina Bay complex. We would have no hesitation recommending the Ascott if you are looking for accomodation that is not in the heart of Orchard Road but is still fairly central. The Ascott would also be perfect for a longer trip as the rooms are far bigger than standard hotel rooms and you have the added benefit of kitchen and washing facilities", "Date": "November 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Convenience, luxurious & service”", "Author": "menad38", "ReviewID": "UR119242961", "Content": "Like everyone, we were blown away by our 'Studio Premier' room. Walking into the spacious room with music playing in the background, we wished we were staying more than one night! With all amenities that you would need including a stove, microwave, fridge and lots of closet space, you can definitely be there for long term. No views from the room as it's very close to the next building but that just means lots of privacy. The pool is stunning, some deck chairs to relax on (free apples & towels), 'rooftop' type garden with tables & chairs, gym was alright (lots of machines, not so much weights based) and nice living room area where you can browse through some books, magazines while snacking on some chocolate and having a cuppa. Conveniently located near the Raffles Place MRT ($1.90 from Changi airport + $1 deposit for card that is refunded on return) and the Lai Pa Sat Festival Market (home of hawker style food and satay street). Staff were super helpful and recommended stall #8 Best Satay for the best satays on Satay Street. Breakfast was included which was buffet style - selection of fresh fruits, cheeses, meats, pastries, hard boiled eggs, cupcakes, toast, cereal, tea, coffee, milk and juices.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, CA", "Title": "“Luxurious place for long term stays”", "Author": "sikefoo", "ReviewID": "UR118932898", "Content": "I was in Singapore for a week and enjoyed every luxurious minute of the Ascott. The room itself was spacious, immaculate and had all the amenities you could want for leisure or business travel. Location is great - you're within walking distance to many major sights, including Marina Bay Sands and Chinatown (I went to both while there). The staff is incredibly friendly and they make it feel like a home away from home. There's a great gym, but I would skip it and go for a swim in the amazing infinity pool that overlooks the city - one of a kind!", "Date": "October 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“As good as everyone says”", "Author": "jack r", "ReviewID": "UR118914031", "Content": "We stayed here for only one night but can not speak highly enough of the place, it rivals any of the hotels we have stayed in, in the big cities around the world for position, price, style and customer service. The only thing we would say is it is serviced apartments not a full service hotel so would not be for you if you want a hotel with bars, restaurants and a brilliant breakfast. However if you want style, location and comfort at a great price you cant beat it. We will be returning to Singapore just to stay here,", "Date": "October 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Stunning”", "Author": "Melbshuffler", "ReviewID": "UR118784342", "Content": "Stunning. Beautiful. Elegant. The pool must be seen to be believed. The rooms are huge and beautifully furnished. The location is fantastic. The staff are courteous, helpful, friendly and very nice to deal with. Ask them to tell you about the history of this heritage building. It's a great piece of Singapore history. I will definitely be back. Bravo!!!", "Date": "September 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Convenient for business travel”", "Author": "LizM26", "ReviewID": "UR118442556", "Content": "I stayed 1 night whilst on business travel. Spacious room, if you are comparing to a hotel room, although not so, if you compare to a serviced apartment. There is a nice deep bath. Galley style Kitchen facilities although no table, you would need to eat at the desk. A couple of complaints, the bath towels were worn & dirty, and there is no restaurant, except for a breakfast service, which I didn't try. I arrived around 9pm, and there was not a lot open if you wanted to get something to eat. The hotel is situated in the business district and eateries/shops were largely shut after hours.", "Date": "September 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Broadbeach, Australia", "Title": "“Great character, large rooms, convenient location”", "Author": "20clicks", "ReviewID": "UR116371930", "Content": "This is a hotel I often stay at for a night or two - although I think it is particularly well suited (in the right room) for a longer stay (a week or so). This is a relatively recently renovated building (colonial style, previously offices) with typically very large rooms having plenty of character. Facilities are excellent - I have been upgraded several times into suites with great kitchens, lounge-rooms and views, but all but one of the standard rooms I have stayed in have been great value and more than adequate. The restaurant (for lunch, room service and dinner) is fairly average and quite expensive - but there are plenty of great food options nearby. Staff are efficient and professional, but this does not come across as a 'home away from home' from a staff perspective (as some other Ascott Group properties do). I haven't stayed here with my family, but I would seriously consider it - not too heavily a business hotel, and very well located.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Townsville, Australia", "Title": "“Excellent accomodation and service”", "Author": "ange08", "ReviewID": "UR116294056", "Content": "We stayed only one night on a last minute deal. We had flown from Europe so needed to rest. It was perfect. Very quiet, comfortable and excellent service consistent with rating. Breakfast was very adequate and we were given a late check out with no fee. All in all, location, the price we paid, and the quality of service means I would look to return here without any doubt.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great hotel in a great location”", "Author": "-Ryan_A_33-", "ReviewID": "UR115942242", "Content": "My partner and I were most impressed by the hotel and will definitely stay there next time we are in Singapore. The staff were polite & helpful and the facilities were far better than expected. The hotel appeared to have been recently renovated which meant everything was nice, clean and modern. The rooms were much bigger and better equipped than what I am accustomed too when travelling in Asia. If for nothing else the hotel is worth staying at just for the rooftop glass wall pool and relax area. Away from the inside of the hotel, the location could not have been better with a large subway/train station close by and a well-known cab rank outside - meaning the cab drivers knew where it was when coming home. Plenty of restaurants/bars within walking distance also.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Ascott Raffles is a real treat!”", "Author": "LisaLou1970", "ReviewID": "UR115746975", "Content": "This is a beautiful hotel with great facilities. The rooms are in immaculate condition & the bathroom made me feel like a princess. This will be the only place I stay in Singapore!", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Enjoyed our stay and we'll keep on coming back that's for sure”", "Author": "micah65", "ReviewID": "UR115376833", "Content": "The building has historical story - tallest building in Singapore in 1950 Very nice swimming pool/infinity Jacuzzi is at the rooftop which is ideal for sun bathing ( for some) The room is so huge where you can cook your food etc as the room is fully furnished with cookery and cutlery Nice bed", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“great hotel”", "Author": "Doug528", "ReviewID": "UR115295830", "Content": "i stayed in this hotel for 3 weeks for work. the hotel was incredible. i stayed in a junior suite with 2 beds that was very large. the room i was in had a view of the marina which was nice. the rooms were nice and quiet. the bathrooms are incredibly large. all of the appliances were high end. great washer/dryer, dishwasher. i cant say enough about the hotel staff. i was always greeted warmly and they offered to carry anything i bought to the hotel. they were very helpful in catching cabs. catching cabs in singapore can be a little daunting. the staff was also helpful with anything and everything. i booked a weekend trip to thailand and they were so helpful with that. also they booked trips to all the amusements in singapore which saved a lot of time. my college aged son stayed with me for 2 weeks and they were very nice to him. since i had to work they helped him with booking excursions while i was out to work. the hotel is 2 blocks away from lon pat sat which you can find any food you want. try the spicy crab. like one of the posters said they dont have room service but that is my only complaint. the rooms were promptly cleaned. they even washed the few dishes that we had left in the sink. the one thing that i loved was the professionalism of the staff and their warmness. it made my 3 weeks there enjoyable. the mrt was right around the corner. special thanks to jv. he was incredible. i would recommend this hotel to anyone.", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "birmingham", "Title": "“Delightful”", "Author": "gazfarr", "ReviewID": "UR114963675", "Content": "Simply perfect- excellent comfortable room, polite attentive staff, central location. If you're in Singapore you simply should stay here. Perfect.", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“AWESOME STAY!”", "Author": "x3FanG", "ReviewID": "UR114780977", "Content": "The place is VERY VERY BIG and well Equipped! the facilities is awesome and the service is EXTREMELY GOod.! due to my Budget i have a weekend Escapade Package which cost me total of $280 for a Studio Premier Room inclusive of 2 Breakfast! The room is Bigger than shown on the picture! WILL DEFINITELY go back again! Though there is NO Free parking but u can parked at Lau pa Sat for onli $3!", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Mackay, Australia", "Title": "“Great option for the business traveller”", "Author": "boiaboiawaga", "ReviewID": "UR111364303", "Content": "Spent one night at the Ascott Raffles Place, and now wish that the remainder of my stay in Singapore was here as well. Check in was easy, and unlike another review that I have read, the doorman took my suitcase out of the taxi and carried it through to reception for me. The room was of an excellent size and well fitted out, the bed was comfortable and the quality of the fitout of the bathroom equalled that of the most luxurious hotels that I have stayed in. Only complaint was to do with the washer / dryer (which would wash, but would come up with an error message when I tried to use the drying function). Despite their best efforts, the maintenance staff weren't able to make it work, but they quite happily (and conveniently for me) had housekeeping take my damp clothes away to be dried and returned to me perfectly folded in around 2 hours. The pool at the Ascott is almost at the top of the buliding and I enjoyed a swim there on the morning of my checkout. The views from the pool and the pool deck are spectacular. The temperature of the water was perfect, unlike some other hotels I have stayed at in Singapore which must, seriously, run the pool water through a refrigeration system to cool it down. The breakfast offerings, while simple, are more than adequate. The front door of the hotel is, literally, 50 metres from the Raffles Place MRT entrance making it very convenient for those who want to use this mode of transport. It's about a 3 minute walk to the Lau Pa Sat hawker centre, and about a 10 minute walk to the Esplanade Theatres on the Bay area. I'd thoroughly recommend Ascott Raffles Place", "Date": "June 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Spatious Room, good location, excellent service”", "Author": "PokinAbout", "ReviewID": "UR110273466", "Content": "The staff really made the stay at this hotel memorable - every person that we had contact with was professional, friendly and went out of their way to be pleasant and helpful. A friend and I stayed at the hotel for five nights and would definitely stay there again. The room was very spatious, and had everything we needed, with the added bonus of an espresso coffee machine. Free Wifi internet is also handy when travelling and the king single beds were very comfortable. It is within easy walking distance for the riverside eateries and the Raffles Place MRT as well as the Marina Sands complex. The pool was a bit daunting - it's like a giant aquarium with all glass sides and my fear of heights put me off using it. We had the weekend breakfast package included for two days - I wouldn't bother with it again as the breakfast was the only disappointing part of the entire stay. That said though, there are numerous other places for breakfast in the immediate area.", "Date": "May 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St. Albans, United Kingdom", "Title": "“Superb location, room quality, services.”", "Author": "ivinghoe", "ReviewID": "UR108498264", "Content": "We were there for 1month and had the most comfortable and exclusive service amongst all the places we have been in the world. Rooms are spacious, well laid out and maintained with full amenities you'll need for long term stay.(Washer/Dryer, dishwasher, stove, oven, ..etc) Located right in the heart of CBD area with enough privacy and great view from the rooftop swimming pool, easy access to both end of the shopping area and food courts, Ascott Raffles place made our stay worthwhile.", "Date": "May 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aus and Japan", "Title": "“Excellent, Would Choose To Stay Here Again”", "Author": "hpsing", "ReviewID": "UR107094624", "Content": "Location was good next to Raffles Place MRT and usually was easy to get a cab. The nearby hawker centre was very good, serving a huge variety of food. Roti Prata and curry for breakfast FTW! The apartment was spacious and nicely designed. Great shower and bath. All amenities provided in kitchen, even a coffee machine. However you had to buy the coffee capsules at $1.50 a piece after you had used your small trial pack. At the rates being charged, we thought that to be unnecessarily mean! But apart from that everything was good. Dishwasher and washing machine in room, all cleverly concealed in design of hallway and kitchen. As a light sleeper I found the soundproofing from the road excellent and had the best nights' sleep. The staff were friendly and very helpful. We were early to arrive and due to short notice couldn't inform them. We fully expected to be turned away until check-in time, but no, we were given an apartment immediately. There is a gym, pool and garden area on the top floors. The pool is amazing, looking over the city - makes for great photos! We would book here again.", "Date": "May 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hong Kong", "Title": "“Loved it”", "Author": "jadey2000", "ReviewID": "UR98875092", "Content": "I stayed at the Ascott for business. These are service apartments – but you don’t have to rent an entire month. I recalled that I stayed for a fortnight, twice. Location There is entrance to train station right outside, however it is a long walk underground to get to the actual train concourse. I can’t say that it is very convenient – it is the CBD, there isn’t anything open at night, apart from the famous hawker center “lau pa sat”. A good 15 minute walk to the merlion. Room Love, love, loved the room. I don’t know how many types of rooms there are, both times I stayed I got the same type (studio). Entire room has wood paneling. Plenty of different lights throughout the room – I love a bright room! Entrance - When you open the door, there is a long corridor which looks a bit like an upper east side apartment. Built-in shoe cabinet. Kitchen - open kitchen equipped with anything you will need – toaster, coffee machine, utensils, cutlery, pots and pans, tea towels…. The list goes on. Washing machine is in the kitchen too – detergent provided. Living- comfortable L-shaped sofa with a small movable coffee table. There are 2 LCD TVs - 1 for viewing on the sofa and another for viewing on the bed! Shape is decent size with lamp. Free internet and wifi (obtain password from front desk). Bed is huge and very comfortable. Bed area – light switches beside the bed, bedside tables have drawers. Bathroom - has a glass wall so you can watch TV whilst showering/bathing! Bathroom is very clean and nicely renovated. Food Complimentary fruit upon arrival. Breakfast was not included for me. I believe the restaurant was actually renovating. Plentiful free apples in the lobby each day Facilities Great gym, but bring your own bottled water (from the room). Interesting fish tank like pool where people on the outside can look in. Other Service is not bad, staffed 24 hours a day. Overall, I loved the Ascott, however, probably will be over budget if I wasn't here on business!", "Date": "March 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bandar Seri Begawan", "Title": "“Great place for a longer stay”", "Author": "HadiShafie", "ReviewID": "UR95203769", "Content": "Unfortunately due to the impulsive nature of this particular trip I was on, I could only get one night's stay here. The next day I moved to another hotel (which I review separately.) In any case, it was a wonderful experience. The first thing I realized was how good the bathroom facilities were. Very spacious, with semi separate toilet and shower/bath area. I understand there was an Infinity pool but didn't get to check it out because it rained on that day. The downside was that food is a problem. Because of the apartment-istic nature of the residences, there wasn't any room service, but the hotel was located near to Lau Pa Sat, which is a decent food-stall-like place. However, if you get hungry at midnight, it can be quite a chore to find some place to eat. Do pack a few meals or get ready to order online from McDonalds. (very impressive delivery service in Singapore.) The 7-11 at the nearby underpass doesn't open 24-7, unfortunately, although there is a Cheers convenience store at the Lau Pa Sat area. I loved the apartment feel, and the overall room design was nice. There was multiple LCD TVs, meaning if I travelled with someone, they'd be able to watch a different channel. Will definitely come back to this place one day to explore the rest of the features.", "Date": "February 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Fantastic for a long stay in Singapore”", "Author": "switsdaniq", "ReviewID": "UR95094854", "Content": "Me and my friends booked this service apartment just for a venue for us to get together and chill out.It is amazing,fully equipped with sink,microwave,washing machine and etc... Very clean with modern furnishing.We booked the 'studio room' and it was perfect for us. The swimming pool was amazing with the gym nearby, and I remembered taking fresh apples(provided) from somewhere around the pool.As, you can see,I cant stop praising this apartment.Thumbs up! ;) So,for expats planning to stay Singapore for a month or more,this would be a goood choice.", "Date": "January 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“Fine, barring ankle breaking ramp”", "Author": "NW6_Traveller", "ReviewID": "UR94189435", "Content": "The Ascott is more a serviced apartment than a hotel, so rooms are larger, but on-site facilities in terms of restaurants, bars etc. non existent.. Being Singapore, this is not an issue though as countless places outside. Kitchen was unused by me (other than making Coffee), but had all appliances (high end Gaggenau), including a clothes washer / dryer. Would not term it a room with a view, but was easy access to most places I needed to go, so again not a problem. Good WiFi and also cabled internet (included in price!) Bathroom was excellent as were 2 TV's and Bose sound / DVD system. Only, and pretty major gripe, is that the bed was on a raised floor with a step down to living area (I guess intent was to differentiate the areas). At night if I wanted to get out of bed to go to living area / bathroom this resulted in a potentially stumble as the step was at head of bed.. They should mark it in some way when dark.", "Date": "January 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Singapore", "Title": "“Good stay”", "Author": "alanyeo76", "ReviewID": "UR89882939", "Content": "Stayed here during the weekend. Location is subjective as if you are looking for shopping, there is only the Marina Bay sands which is about 15 to 20 minutes walk away. But if you are staying at the hotel for business, its right i the centre of the business district. However, getting around is easy with the MRT just under the hotel. Service wise, there is not much to speak of as its a serviced apartment and not a full fledged hotel. The rooms are clean and huge. They have a mini kitchen for you to cook and wash your dishes. Oven and fridge can be found in the room as well. On level 2, there is actually a coffee machine and therefore, one can proceed there for a free cup of coffee anytime during the stay. The pools are pretty small and located very close to the next building which happens to be some offices. The Lau pat sat (singapore style food court) is only 5 minutes walk away and you can try the different hawker food here.", "Date": "December 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pulau Ubin, Singapore", "Title": "“Worst Service, what a shame”", "Author": "mini_House_wife", "ReviewID": "UR88182838", "Content": "From the moment you walk in, there is no one to help you out of the taxi with the bags. You have to drag them up the stairs and push the doors and shout for a help with the bags. I regret deeply for not choosing other competitor's with excellent services. I chose this place for its location--5 min walk to work. Hardwares of the hotel is far impressive. The soft side, people management is by far the worst I have ever seen. No one ever greets you \"welcome\" or \"Good Morning.\" They use the Concierge as a working office. They seem simply too busy to notice any complaints by customers. The staffs were ever so rude. Made me wonder why they would bother staying in the hospitality industry. I have made many suggestions and provided feedback during my stay for one month. I was trying to constructive. However, I was punished by the staff for complaining. They gave me a dirty look every time they saw me, standing behind the Concierge desk--hoping to threaten me?? I am quite impressed though about how strong the ties were amongst the staffs--clearly they are protecting one another. But this is not a spirit of the hospitality industry. The doorman/ bell boys were never to be seen outside of the door. They stay in a nice cool air-conditioned environment behind the Concierge with Concierge staff gossiping the customers. I was puzzled by how no one seems to manage this hotel at all. But then I realized this hotel is NOT owned by a hotelier, but owned by Capital Land--a property developer in Singapore. The cultures are different here. I said repeatedly to the management in writing, what is the point of spending so much money to impress the customers with the fine linens and impressive bathrooms, when they cannot even provide a simple services? When you need any service, no one is ever around. The only thing worked was the Housekeeping's cleaning services. Nothing ever works around there. The whole hotel makes more sense as a serviced apartments. If you are looking for a five star hotel services, this is NOT the place. My rating of the services were at 1 star only. The rooms, I would rate at 5 star. Nice design, expensive china, etc. But in the end, if you have to live there for a month, you just could not. I remember my stay being very unpleasant (leaving out the small details) and I also have heard from other friends who stayed for one month seeing the same problem. Obviously they never bother fixing any problem that I have written on the comments cards.", "Date": "November 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Albany, Australia", "Title": "“Great location, Close to Train Station”", "Author": "Belle82", "ReviewID": "UR82039471", "Content": "The rooms are huge with all the ammenities. We stayed here for the last 2 nights of our trip. The room had a washing machine so were able to catch up on all our washing ready for the flight home. The staff are friendly and attentative. Although there wasn't much for them to do because it was already done. It is a minutes walk to the train station and shops. Also a 2 minute walk to La Pa Sat. Excellent cheap food! I recommend you stop for dinner there. We went there both nights we were staying at the Ascott Raffles Place. Using the train in Singapore is so easy and the best way to get around so it was a bonus to be so close to the train station. China town is an easy walk away if you can handle walking in the heat. I purchased some open walking shoes while in singapore and wore them everywhere. Don't bother bringing any other shoes.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Kuala Lumpur", "Title": "“Excellent facilities!”", "Author": "gemstar1974", "ReviewID": "UR81301245", "Content": "We stayed at the Ascott during our brief trip to Singapore during the GSS (Great Singapore Sale). It was one of the few service apartments which not only accommodated our short stay in Singapore but met our family needs and requirements. The plus points about the apartment was that it was certainly luxurious beyond our expectations and especially comfortable. The hotel concierge was very helpful with our needs since we needed an extra cot and bed to accommodate our family and nanny. The apartment was very well-equiped. It has a very modern kitchen and a washing machine/dryer which were very well-used by us during our short stay as we had an infant and a young child with us on this trip. The apartment has a good view of the harbour and my son was delighted with the high rise buildings in the vicinity. The only downside is that it has no car park facilities unlike the other hotels in the city. Since we drove down from KL, we had to park in a public cark park adjacent to the building and this may be costly if you intent to keep you car there overnight. Additionally, the drop off and pick up point at the apartment very narrow and slightly unshaded. Hence, if it rains, you may find youself getting slightly drenched when getting out of the car from the left side.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Fantastic place to stay”", "Author": "Vesta5", "ReviewID": "UR69037200", "Content": "Great place to stay. Close to office centre, very close to MRT statio if want to go further. Extremely clean, rooms are fab, room service is great. Staff is very helpful and polite. The pool is very nice. Absolutely great place for an extended stay in business trip. Couple food courts nearby, and private kitchen in the room - we did cook a lot. The only negative experience we had - they didn;t subscribe to show world cup on TV, so we had to go to other places.", "Date": "June 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Great Location and”", "Author": "xinli29288", "ReviewID": "UR67896369", "Content": "Standing 21 storeys tall near the financial heart of Singapore, the Asia Insurance Building was once one of the tallest buildings in Southeast Asia. Completed in 10th December 1955 with an Art-Deco finish, the building was a prominent landmark of the Singapore skyline during the 1950s. Crowned with a stainless steel ‘wedding cake’ and clad in black marble, this historical structure still retains the grandeur of the Old Singapore. Although the Asia Insurance Company no longer resides in this building, the A.I Building remained as a significant landmark in Singapore’s Building History when it overtook Cathay Building upon completion. It was a sign of the rapid development that was to engulf Singapore. I had the opportunity to stay over in this urban getaway due to a friend’s birthday being held there. Being a fan of things nostalgic and historical, the Ascott Raffles Place is a place I would love to live in. The receptionists and security guards were very friendly and polite, marking a pleasant start to the Ascott Raffles Place experience. From the earlier enquires via email and face to face, I was satisfied with the service. The lobby area has a bar for the residents and guests alike to chill out and munch on light snacks as well as a lounge area to chat or just to spend some time in the classy environment. An attempt to instil some art into this building can be seen in modern sculpture and paintings decorating the walls around the hotel. Old photographs of Singapore link the historical significance of this building to Singapore’s heritage. The internet price of this 75 Square Meter Room is 430++ SGD, and Citibank card holders get to book it online for about 406++ SGD. The toilet was gorgeous too with toiletries complemented by L’Occitane products and a big bath tub to spend our time away with the soothing waters. Sound was contained within the room quite effectively only loud booming music or extremely loud crowds can be heard along the corridor. Beyond the suite, one can also do some work out in the Gym. The Swimming Pool, measuring 1.2m high is more of relaxation rather than serious swimming. Nonetheless the experience would be interesting as would be able to see the city in the pool through its transparent glass walls. After a nice work out at the gym or a good swim, you could chill out at the Residents’ Lounge area and sip on coffee as you read magazines or chat with your friends. If that is not enough, head upwards to the 21st storey and enjoy the Jacuzzi or vista the Ascott Raffles has to offer during the day and night with views of Raffles Place, partial views of Marina Bay and the harbour. Dining is being catered for by the in-house Julien Bompard Restaurant, you could choose to be lazy and just order via room service or make your way down to the restaurant, located on the second storey for a meal. However, be prepared to pay quite a bit for the meal. Here is a preview of what is on the Snack Menu that can be found in the rooms, you have the Beef Burger with Fries going for about 22++ SGD, Chicken Consommé with Herbs for 12++ SGD, Tiramisu for 16++ SGD or you could request for their Tapas, ala-carte items by calling them. We only tried the breakfast items, because it is not cheap. Throughout our one night stay at the Ascott Raffles Place, there are a few points that I thought might provide some valuable feedback. Firstly, the Lounge area was not maintained often enough, used coffee cups were everywhere in the later part of the day, resulting in an unpleasant environment. Secondly, we had problems with the bathroom facilities, the bathtub cold water tap wasn’t working and the dining area light wasn’t working (but they fixed it after calling them up). Lastly, some of the reception for the TV channels weren’t strong such as KBC and History Channel. Nonetheless, the overnight stay was a great one. The Night View was Beautiful The Room was Great. The people at Ascott Raffles Place were friendly even for the people at Julien Bompard. The Facilities and Amenities were decent. The place is highly accessible via Raffles Place MRT The Location is good. Lau Pa Sat, Market Street Food Centre and Boat Quay is just nearby. The Reservation is not limited to a 7-Day Minimum Outside Catering was allowed. Security is decent as only people with key cards can access the upper floors. Negative Points: the Lounge area was not maintained often enough, used coffee cups were everywhere in the later part of the day, resulting in an unpleasant environment. Secondly, we had problems with the bathroom facilities, the bathtub cold water tap wasn’t working and the dining area light wasn’t working (but they fixed it after calling them up). Lastly, some of the reception for the TV channels weren’t strong such as KBC and History Channel.", "Date": "June 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Nice apartment, good kitchen!”", "Author": "gaeul", "ReviewID": "UR66310630", "Content": "Checked into Ascott on the 29th May 2010. Stayed in a studio room and this are my feedbacks. Positive Points: 1. Apartment's safety is ensured as you need your room key to access any level in the building via the elevator. 2. Amazing room equipments and amenities. They have : Washing machine, crockeries for cooking, a good fridge, full set of cutleries (incl. of can openers, bottle openers, peeler), mini sofa, tv, computer table, large bed, wide stylish wash basin in the toilet, separate toilet and bath area, rain shower... Excellent room amenitites really. 3. Good TV channels (Starhub cable TV available. Has Korean channel , HBO and stuff.) 4. AMAZING ESPRESSO machine! I love that very much because I love a good cup of coffee and it's really very easy to make yourself a good cup of thick, authentic espresso! 5. A beautiful pool if it's not crowded with more than 4 people. 6. Well equipped gym. 7. Comfortable rooftop lounging area (no sale of food/drinks) 8. Nice towels provided by the pool for drying off. NEGATIVE POINTS: 1. Upon entering the lobby, there wasn't any security standing at the door or anyone who was willing to help us to carry our stuff. It will be nice if they have someone to offer their service for patrons. 2. The check in staff wasn't very friendly and she made me feel very uncomfortable with her looks when she said, \"1 night?\" Like, what the hell is wrong with that? Can't I stay over in an APARTMENT for JUST ONE NIGHT? She even forgot to return my identity card after filling up the details! I had to remind her. 3. The room is too dim. As my room 's windows are facing another building, we got NO SUNLIGHT at all. Basically, with the blinds down, we probably will never know what time of the day is it. 4. Instruction manual for washing machine will be good. 5. No supermart anywhere nearby. Closest eating area will be LAU PA SAT which is a good 10 min walk away. 6. Kitchen area too small. You can't even put a bottle of oil on the table, and cut something on the cutting board. It is extremely cramp. Basically, the whole stay was pleasant except for the 6 negative points I pointed out. Checking out was a breeze although the lady was also not really friendly and just said, \"ok, you can go now.\" Like, what the.... There was nothing like, \"thank you for staying with us.\" Nothing like that. Felt unwelcomed when I meet the staff. I would actually recommend friends to live in another hotel with the same price or lower. This apartment is way too expensive for such service and a dark room.", "Date": "June 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "2020", "Title": "“Great Hotel alternative in Singapore.”", "Author": "wallyQ", "ReviewID": "UR63028893", "Content": "Great Stay at the Ascott. Wonderful Modern Rooms. Big Studio, very well designed layout. Top Class Equipment: Frette Linens, Bisazza Tiles, Gaggenau Oven, even Hunter Douglas shades. Comfortable Bed, nice pillows. Good Sleep. Nice Bathroom, with enough space for all your things. Loccitane Amenities. Amazing Pool on the Top Floor. Great Security. Very Good Service. Location at the Center of the Business District. There's a food market 2 blocks away. Great for a 'local' meal. Wish there were more places to eat nearby. Must see places are still a subway or taxi ride away.", "Date": "May 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Perth,WA", "Title": "“Great hotel, much better than the price suggests”", "Author": "mollycat123", "ReviewID": "UR54160313", "Content": "The Ascott was excellent, large studio styled room with beautiful bathroom and quality fittings. having a kitchen & laundry was very good and made breakfast convenient. Location was good - so close to taxi stand, and train station made it easy to get to everywhere. Staff totally helpful we really enjoyed our stay!!", "Date": "January 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Sydney", "Title": "“Very good hotel”", "Author": "acadaSydney", "ReviewID": "UR42377450", "Content": "We were impressed with this hotel- good locvation for business travellers- nice staff great swimming pool on the roof", "Date": "September 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Good for CBD Business, not Leisure”", "Author": "Sportbilly121", "ReviewID": "UR40472329", "Content": "The rooms are actually small studios, well designed, sufficiently spacious and in our opinion about the only highlight of staying at this hotel. This said be careful which room you get as our room looked out on to a large building less than a small street's width away and consequently it was extremely dark with absolutely no view. Don't expect too much of the Bose sound system either. The hotel is ideal if you have business in the City / CBD but for a weekend break, we suggest not as it is particularly quiet in that area, the location requires you to walk quite some distance to find decent eateries that are either open / have clientele, probably be better when all the development in the immediate area is complete .. probably 2 years away.", "Date": "September 9, 2009"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "LA", "Title": "“Hate Ascott Raffles Place!”", "Author": "regina0301", "ReviewID": "UR39020808", "Content": "I needed to be in singapore for meetings I had to attend and the company booked a room for me in ascott raffles as they said it's new better try them. Everything will be shouldered by the company but while checking in the staff ruth told me the company is not paying for it and I have to pay in advance! that [--] me off (add that to a very long flight) i told them to contact the booker but since it's at 1900H then they are going to do that the next day BUT I HAVE TO PAY FOR THE TIME BEING,FOR THE WHOLE STAY! i wanted to walk out but was to tired to do so so did not argue anymore. hate the staff. Stayed for more than a week there but [--] I hate the service. The staff are im sorry but stupid cannot get what im trying to say. The name is marie? I only wanted the internet to be fixed but it took a long time for them to do that as in 5 hours! i needed to send some reports to my boss back in UK for a presentation a few hours before! Meetings after meetings naturally I get tired. guess what? i can't even have a nice sleep as I can hear the cars and buses from the street. I guess their windows aren't sound proof! few hours before checking out I told them to prepare the bill as I will be in a tight schedule before my flight. when i came to the reception they have not prepared my bill! and charged me for breakfasts that should be included with my room rate! when i told the staff about the breakfast, she even argued with me! so i asked for the manager, guess what no manager came! the supervisor corrected my bill but took so long add that to the fact that i will be late for my flight. it was a horrible experience in the ascott. i wont even talk to them or listen to them anymore for all the trouble they caused me. WORST HOTEL EVER BEEN TO.", "Date": "August 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Paris", "Title": "“Almost perfect !”", "Author": "Lucky-Smith", "ReviewID": "UR33891915", "Content": "The location is very good, in the business district and 1 min from a subway station. The room is one of the best I have ever had, better than what you usually get at the Ritz, and comparable to the Mandarin Oriental rooms in Hong Kong. However, some of the rooms that are located on the right side of the building have a bad view (on a very small street)... The bathroom was just the best I have had in a hotel. My room had an entry with a kitchen and a washing machine. It can be useful and it is well separated from the \"room\" part. Flat TV and Bose sound system. WiFi access was included. The staff did the config and activation for me so that I could use it on my iPhone. The price was really good considering the room quality (250 SGD). If you are in Singapore for business, this is one of the best choices. If you travel for leisure, the location is not the best. But it is near a subway station so you can get quickly to other places. You would not be disappointed anyway, Ascott is a top of the class hotel.", "Date": "July 4, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Bangalore", "Title": "“Very nice place but could have better utility”", "Author": "nitinsareen", "ReviewID": "UR29063251", "Content": "I traveled to Singapore for a mixture of reasons. My wife had to go for her office conference and I accompanied her with our son. Ended up at Ascott Singapore Raffles Place. Since it was my first trip to Singapore and I was not very familiar with the landscape, I did not know much about the location of this hotel. Took a taxi from the airport and it took us a while to explain which hotel we want to go to. We wanted to hold the taxi to finish the check in and for my wife to carry on to her office, and it was a tough one. Even though it is located at a corner, the entry is not convenient for cars to stop and wait. Taxi driver had some hassel in that. The check in time is very strange - 2 PM. For anyone who wants to get in for a meeting, it just does not work. The co-ordinator had asked for an early check in but it took us some time at the reception to work that out. The first thing staff told us was to wait! After a long haul flight, no one wants to hear that! That sorted, we went into the room. Once in the room, it was a very nice experience. Even after having stayed at many hotels (including Ritz), I was pleased with the room. It had all the items needed for a comfortable stay and most of it was state of the art. We stayed there for two days and spent most of the time outside, but was still able to use the pool for some time. The pool is situated on the 19th floor (and is visible even from Marina Bay) and made of glass. Looks extermely nice and flattering but has very low utility value. My son and I did take a dip but it was not one where we could splash around. The gym was nice, small but well equipped. The breakfast at the Julien Bompard restaurant was again very stylish, luxurious, but had a little less utility value. It was a set breakfast, with fixed quantity of fruits, cereal, ham and cheese and breads. Not the nice spread one would want to see and select from. The kitchenette in the room was well stocked with all the cutlery and utensils, but some stock of food options would have made it better. Overall, we had a nice and comfortable stay at Ascott, but found the utility value to be left wanting.", "Date": "April 30, 2009"}], "HotelInfo": {"Name": "Ascott Raffles Place Singapore", "HotelURL": "/ShowUserReviews-g294265-d1083872-Reviews-Ascott_Raffles_Place_Singapore-Singapore.html", "Price": "$261 - $349*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2 Finlayson Green</span>, <span class=\"locality\"><span property=\"v:locality\">Singapore</span> <span property=\"v:postal-code\">049247</span></span>, <span class=\"country-name\" property=\"v:country-name\">Singapore</span> </span></span></address>", "HotelID": "1083872", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/25/a4/25a4be5d0ca44a3d9659ba08680d31778large.jpg"}}