{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Location": "3"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Good Stay for us”", "Author": "Ready G", "ReviewID": "UR126211600", "Content": "My teenage son and I recently stayed at this comfort suites and we had a good stay. The front desk/housekeepers were nice. We stayed 4 nights, the rooms were comfy for the price. I thought about walking across the parking lot to the gas station, one front desk worker said it would be ok, but a 2nd one said no, he wouldn't recommend it. Glad we didn't we noticed people walking through the parking lot to get to the gas station, they didn't approach us at all. The pool was out of order on our last night there my son was a little disappointed about the pool. One thing I couldn't understand is why the breakfast was set up all on one side making it a little congested for people that only wanted fruit or cereal. They should restructure that little part, I don't liek congestion. Overall we had a good stay! Will stay again :)", "Date": "March 17, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "El Dorado, Arkansas, United States", "Title": "“Should have gone with my 1st mind”", "Author": "Veronique S", "ReviewID": "UR125946112", "Content": "Rooms were nice but housekeeping walked into my room, WITH A DO NOT DISTURB ON MY DOOR, twice...I asked to borrow a pair of scissors and was told that I would have to put up a 10-15 dollar deposit! My first night here I informed the desk that my remote turned the tv's on and worked the volume but would not change the channel so the next night I was then told that they had no batteries and I was pretty much SOL. My last day of staying at the hotel I received not one, not two, but four phone calls that they needed my credit card, EVEN THOUGH MY CARD WAS ON FILE, and then was made to return to my room and back to the desk so they could see my ID! I had already spent 2 nights at this hotel! I will NEVER stay at this hotel again! I'm sorry as an employee of the Choice Hotel chain I am happy that I work for one that takes pride!", "Date": "March 11, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Houston, Texas", "Title": "“Undergoing renovation = stay elsewhere”", "Author": "vsspam", "ReviewID": "UR118589167", "Content": "Stayed Labor Day Weekend. I would estimate more than half the rooms are being completely renovated. Hotel should advertise this on their website...desk attendant did not mention anything about this either upon checking in. We had 5 people and came in late and could not change. Stuck on the third floor. Breakfast was OK.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "New Boston, New Hampshire", "Title": "“Stay far, far away”", "Author": "jbfyipi", "ReviewID": "UR118456832", "Content": "I stayed in this hotel in October 2010. What a mistake. First off, the surrounding neighborhood is VERY sketchy. The GPS on my Droid phone brought me through some kind of low-income housing project which just about borders this hotel. I'm a retired police officer (having tangled with some pretty bad dudes in my day) and currently run a large security contract for the US Government and I did not feel safe whatsoever in the immediate area of this hotel. Some of the undesireables that live in this area cut through the parking lot and then through a small park that borders the hotel on one side. A few of them \"eyed\" me as I walked through the parking lot. I took every valuable I had in the car and kept it in my room at night, or with me during the day in the car. In fact, I'm surprised the car was even there in the morning. The particular second floor room that I was in had cigarette burns on the curtains. Overall, the entire hotel looked like it had not been updated in about 15 years. Even the lobby area was dark, dingy, and uninviting. Not only did I skip breakfast, but I cut my stay short by a day and got the heck out of there. You get what you pay for. Spend a little extra money and don't go anywhere remotely near this area or neighborhood of Dallas.", "Date": "September 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Colorado Springs, Colorado", "Title": "“Nice hotel for a great price!”", "Author": "jesuslovingchik", "ReviewID": "UR115987098", "Content": "It's just a simple, regular hotel. Didn't find anything wrong with it, but it's still not a luxury hotel or anything. For the price, it's great! The people were very nice and the rooms were clean. It's a good location, and close to anything you need (well, as close as things can get in Dallas). The free breakfast was great. The pool is small, but still fun. And most importantly, the air conditioner worked very well! haha", "Date": "July 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oklahoma", "Title": "“Nice hotel but got asked for money in parking lot”", "Author": "heajon", "ReviewID": "UR90394331", "Content": "The hotel was very nice. The staff was very friendly and helpful. Breakfast was good and they went out of their way to make sure everyone was finished and had all they needed before closing up the breakfast area. The room was clean and comfortable. There was a little wear showing in the bathroom but nothing unacceptable. The pool was warm but only 3 1/2 feet deep. They had a hot tub and a workout room. The location was good but a little bit hard to find if you didn't have a printed map with directions. With the directions we had no problems finding it. You had to wind through a residential area and appartment complexes. It was right near the Gallaria mall and close to the freeway. One evening my two children and I arrived back at the hotel probably about 11:30pm and we were approached in the parking lot by a nicely dressed man saying he and his wife were stranded back on the highway and his family was in Ohio and they needed money to stay in a neighboring hotel. They were short $16.00 and could I help them out. I gave him $20.00 and hurried into the hotel. Legitimate? who knows, well probably not but I figured 20.00 was worth there being no scene or other problems with my kids there. I didn't really feel unsafe and the parking lot was very well lit. This hotel is directly next to an Embassy Suites and a Motel 6 so there are other hotels in the area. We would probably stay here again but I would be ready to get inside the building right away after parking!", "Date": "December 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oklahoma City, OK", "Title": "“We Would Stay Here Again”", "Author": "JackieT", "ReviewID": "UR87537055", "Content": "We stayed at this motel for two nights checking in on Thursday, November 4th checking out Saturday, November 6th. Because of the previous reviews about vandalism, we chose to take our older vehicle (2003 Honda Odyssey). We had no problems while there. We also didn't leave anything in our car unattended. The place was clean with a decent breakfast. The front desk people were helpful and friendly. We stayed one night paying and one night with points. We had no problems with doing that and stayed in the same room both nights. It was hard to communicate with the cleaning ladies since they didn't have a grasp of the English language. I realize this is the case in many locations, but frustrating anyway. I left a tip (either $1 or $2 I can't remember) since the rooms were clean. I tip when they are clean since a few dollars add up if everyone leaves a little for them.", "Date": "November 18, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "1.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Muskogee, Oklahoma", "Title": "“Run!!! Don't stay here! Nice hotel in bad part of town, car got broken into.”", "Author": "thesuperchic327", "ReviewID": "UR86515567", "Content": "Although the Hotel itself is nice, the risk of staying here is not worth it. We arrived at the hotel after dark, we thought it looked nice and it also has a Country Inn & Suites across the parking lot. We were literally there for 45 minutes when our car got broken into. We had gone up to the room and started upacking, my son and his friend went back to the parking lot to get a drink from the cooler in our car. There was glass all over everywhere, car was completely ransacked and several electronic items including our video camera (which was hidden down in the console) were stolen. We had left nothing out in plain view. We called Dallas PD, they took an hour and half to respond. While waiting for the police, we observed the parking lots of both hotels crawling with thugs looking into people's cars, one would even change clothes once in a while from a strategically based bag of clothes sitting behind the dumpster. We stayed close to the front doors of the hotel while waiting. We called the PD back to say there were several people checkiing door handles and looking in cars, the still took forever. When they finally arrived, they informed us that this is not a safe side of town to stay on and that this happens all the time in this parking lot. The next day in daylight, we discovered there was a low-income apartment building right next door to the Country Inn & Suites (across parking lot from Comfort Suites Park Central). This is where all the low-life, degenerate, coackroach thugs were flowing out of. We also observed several obvious hookers (about 2:00 am by this time) flowing in and out the front doors of the Country Inn and Suites. We alerted the hotel clerk of what had happened. He didn't seem surprised. We lost half a day of vacation getting our window replaced and can't replace the electronics. These hotels do not care about their guests, because if they did, they would have better security. Either hire a security company or have fenced in parking. Until this is done, these hotels are showing they could care less about the trap they are setting up for their customers.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Bethalto, IL", "Title": "“Very good value for the money we spent”", "Author": "jrfoster", "ReviewID": "UR75649016", "Content": "Stayed 2 nights at this hotel in August 2010. we booked 2 rooms side by side, one for us and one for our 2 daughters, ages 22 and 19. They were able to have free wi-fi which we found helpful and it also kept them entertained in the evenings. These rooms were $65 per night, plus tax. The rooms were good sized, mini-suite rooms with the beds, and a couch and coffee table, a small desk, and the bathroom. Also we had a mini-fridge and a microwave, and an iron and ironing board in each room. A few small things with our room were loose tiles in the bathroom which wiggled if you stepped on them, and a very loud A/C unit- sort of like a freight train coming through- the fan was vibrating and hitting something, never could get it to quiet down below a dull roar. Also the shower head leaked- it shot up and into the side wall of the shower. The breakfast was included and was very good, the waffles came in the shape of Texas! Also were eggs, sausage and bacon, hash browns, cereal, donuts and muffins, bagels, milk, juices and coffee - we found it to be a very wide selection. Staff was not friendly in general, the lady tending to breakfast area talked on her cell phone the whole time each morning so no one was able to ask her any questions, if needed. We evidently booked this hotel during a massive mob of kids and teenagers- not sure what they were in town for but they ran up and down the halls-still heard them at 1am- but of course this is not the fault of the hotel. We were in a convenient area to pick from many places to eat- went to Pappadeaux Seafood Kitchen- AMAZING! I highly recommend if in the area to give this place a try!", "Date": "August 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wichita, Kansas", "Title": "“Have stayed here over 50 times, great hotel”", "Author": "LearnToTravelForFree", "ReviewID": "UR62769068", "Content": "I average 10+ trips per year to the Dallas area and this hotel is the one I have stayed at the most. The only complaint I have is that the AC is turned off when room service cleans the room, so when you check in, it can be a bit stuff. One other minor issue is that the TVs are a bit old. The staff is friendly, including the manager Nick. He recognizes me each time I stay and greats me by name. The breakfast is good for continental. The pool and hot tub are nice. The area is in an area where you can drive to hundreds of restaurants within 5 miles and there are a lot of shopping malls in the area. Some posts reflect that they do not feel safe staying here. I have always felt safe, the parking lot is well lit. The rooms are very large and basically are split into a living room and bedroom. I have walked down the street to Saltgrass (even at dark) many times and felt safe. Don't get me wrong, I would not want to walk a few blocks away from the main road.", "Date": "April 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Amarillo, Tx", "Title": "“Pretty Good”", "Author": "Printman2000", "ReviewID": "UR58907202", "Content": "Our family of four stayed in a suite with two queen beds and a sofa bed. Check in was quick and efficient. We were given a room on the third floor. The room looked nice and clean. The bathroom was spotless. Closer inspection showed the grout on the tile floor was not in great shape. A lot of cracks and a few floor tiles were loose. The toilet seemed to get clogged fairly easily so I am betting the floor was in rough shape from it overflowing multiple times. Just hope it got mopped some. The shower head was also in bad shape. It had multiple setting but is was falling apart. I finally got it set on just a normal spray, but it took a lot of fiddling to get that. The rest of the room looked good though one of the beds was pushed up right next to the A/C unit. Looking at the beds, they looked nice and clean. They even use fitted sheets which I really like. HOWEVER, the fitted sheet on my bed was coming off and as I was fixing it I noticed some bad stuff. The mattresses on the beds looked extremely old. My bed has a large brown stain that started on the top and went down the side. Seeing this would have normally led me straight back to the from desk, but there was a VERY clean, white pillowtop add on over the mattress held in place by elastic bands. While that made it tolerable for me, I still cannot give real high marks for this hotel because of this. I just tried to not think about it and what the stain might possibly be. The TV was a big tube TV. However, many channels would show up black. All the channels were mislabeled on the screen. Not sure if it was just our room or the whole place was like that. The breakfast was another downside. The selections where very slim and the person who was suppose to restock items was not very attentive or even around very much. SO really I was stuck eating cereal because all the bagels and pastries were gone. The only hot items I saw were eggs (weird, precooked individual serving eggs) and bacon (very flimsy and thin) or sausage. Not even any biscuits to go with it. The hotel is located next to a couple of apartment complexes. There is a gas station in the next parking lot where it looks like day laborers hang out all day. One evening as I was going to my car I was approached by a young man asking for food money. I would not let kids go outside by themselves day or night. While the price I paid was very good, I doubt I will stay at this hotel again. I would rather pay a bit more to avoid the bad things encountered at this hotel.", "Date": "March 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Santa Clara", "Title": "“Great value, lots of extras”", "Author": "JoshBlack", "ReviewID": "UR49000857", "Content": "I stayed at the Comfort Suites for 3 nights on business and was very suprised at the incredible value. As a small business owner I don't have an expence account so price was the determining factor in my hotel selection. I was very pleased however in the overall quality of the property. It was clean and the staff was friendly. My room was very large with a seperate living area which I actually used for a meeting while I was there. Also I saved money on the free breakfast and did not have to pay extra for wireless internet. I recoment the Comfort Suites to anyone who wants quality on a budget.", "Date": "November 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "San Jose, Ca", "Title": "“Great Service Hotel”", "Author": "Marty1010", "ReviewID": "UR42444413", "Content": "My family and I stayed at the Comfort Suite Park Central in Dallas,Tx, let me tell you it was very enjoyable and \"Comfort\"able stay. By judging the rooms, I belive it was recetenly updated with nice and comfortable beds and soft sheets. It is a very good hotel for family, since the pool and hottub was very well maintained.to keep the kids entertained. Hotel staff was excellent in customer service. I remember my family and I was late for breakfast in the morning, so we had thought we missed the breakfast, then heard a knock on the door and it was the manager of the hotel (Nick) who brought us some breakfast to our room. I personally do not know any manager of the hotel doing that. We had a great stay and they took care of our needs. I would stay again and again at this hotel.", "Date": "September 17, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Oregon", "Title": "“Why oh why dont I pay attention to reviews??”", "Author": "OregonBoobear", "ReviewID": "UR28874631", "Content": "I travel quite extensively and very seldom do I have such a negative experience. First night.. pulled back sheet and saw two little black bugs.. but hey its humid and TX and they weren't bedbugs or cockroaches. First morning we went down (on time) to breakfast.. the one lonely sausage (I think it was supposed to be sausage)was burnt black and the one half danish truly looked as if someone had taken a bite out of it and the milk pitchers were empty. Later a housekeeping trash bag was left next to the elevator for more than an hour and housekeeping wasn't even up on the floor. The plumbing was sluggish at best with showers being taken in ankle deep water. Later when the toilet continued to be sluggish and we asked to have something done we were handed a plunger!! We never got to talk to the Manager as apparently they were in California(??). Second to last day we went to breakfast and sausage was again burned black (there were three total) and no danishes and maybe one small spoonful of eggs. We went directly to the front desk who only made excuses saying well the power was out. In fact, the power had been out for about 5 minutes more then an hour previous. We gathered our stuff and checked out a day early. No discount no apologies were offered until we pushed a little bit more and they asked what we would like to have done. A guest shouldn't be asked to do their own maintenance and if you are offering breakfast it should at least be edible and enough to eat. They have ruined Comfort for me forever.", "Date": "April 27, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Brandon", "Title": "“Bug-infested”", "Author": "brandon1", "ReviewID": "UR23656135", "Content": "When we arrived at the hotel, our room was not ready, so they offered us another room, which was OK. Upon first entering our room, we were very pleased. It was all that we wanted. Large king-sz separate room, plenty of space in adjoining room, lots of cupboard space, etc. All seemed great. The pool was never packed, so the children had lots of privacy and space to play. Later that evening, we found a few ants crawling in the bathroom, which we killed and ignored. By next morning, the bathroom was full of ants. We went to the front desk and they said we could move into the room we were originally to stay in, which we did. No apologies offered, no discount offered - nothing. The morning we were checking out, we went to the main lobby for the continental breakfast, which by the way was wonderful - hot breakfast every morning - and on the way there, there was a huge bug in the hallway. When our son came down, he said that that was a cockroach (I had never seen one before). He had stepped on it to kill it. We were back and forth from our room to the main lobby and pool several times that morning; the cleaning lady had been down that hallway several times; but the dead bug remained. I also agree with some of the reviews regarding the location not seeming that safe. However, we did receive an excellent room rate and the room was what we wanted - just did not want the bug problem. I contacted Choice Hotels, who then forwarded my concerns directly to this hotel management, but have heard nothing to date.", "Date": "January 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "central Illinois", "Title": "“If only all hotels were this nice”", "Author": "farmergirl38", "ReviewID": "UR23237178", "Content": "Everything here was great, we had a very pleasant stay. We enjoyed everything. The room was spacious and quiet. The kids enjoyed the warm uncrowded pool, I enjoyed the workout room early in the morning, we all ejoyed the comfortable beds, my son even liked the fold-out sofa. The breakfast was good too. A bit of advice; make sure not to be late for breakfast, they are prompt at closing time and the tables fill up quickly. We would love to stay here again, and I wish all hotel stays could be this nice.", "Date": "January 3, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Colorado", "Title": "“We were robbed”", "Author": "Traveler112233", "ReviewID": "UR20682727", "Content": "We stayed in the Comfort Suites near the intersection of Hwy 75 (Central Expressway) and 635 (LBJ) for about a week in early September 2008. Toward the end of our stay, we returned to our locked room only to find my husband's briefcase with his computer, credit cards, medical insurance cards, etc. stolen. I lost a large backpack that was full of my genealogy research, several software programs, various books and other items. A police report was filed and an insurance form provided by the hotel was submitted to the manager. We have heard nothing from the hotel or the insurance company since. Later, after contacting the manager, the owner, and the parent company separately, we received no response or communication regarding the insurance or loss. It has been over a month ago, with no reponse at all. The hotel room itself was adequate, with a fairly comfortable bed, but a totally worn out couch and chair with broken springs. We will never stay there again! Beware!", "Date": "October 7, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "St. Petersburg, Florida", "Title": "“Disappointed!”", "Author": "Livelife2fullest", "ReviewID": "UR16952321", "Content": "My husband and I just spent 4 nights at this hotel and overall we were very disappointed. Mostly from two things - our air conditioner was SOOO loud, it sounded like an airplane engine. We were going to change rooms but figured they would probably all be that loud. Not only was it loud but also rattled - so annoying. But that wasn't the worst part, we got up on our second morning and walked to our car and see some people standing around their car and they asked if our car was ok because their truck's passenger window had been smashed out and items were stolen. Luckily our car was fine but we felt really bad for them. Then the hotel never cleaned up the glass, it was still there when we left this morning! The location of the hotel is not great. It is confusing to find, confusing to get on I-75N from, and there is a sketchy apartment complex right behind it with some creepy/sketchy people walking through the parking lot at all hours. No wonder you have to use your key card to access the front lobby after 9pm! The only good thing about the place, the price and the room layout. You have a separate living room area and separate bedroom area. Too bad the air conditioning is only in the bedroom area so that made it difficult for the living room to get cool enough. Oh, one last thing, you should bring an eye mask if you want to sleep in, the windows didn't have heavy curtains to keep the room dark. Only sheer curtains, I couldn't believe it. Anyway, I hope this helps you decide if you want to stay here or not. I would personally suggest staying a little more north - like at the Hampton Inn or Holiday Inn Select (along 75 in Richardson).", "Date": "June 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Houston, TX", "Title": "“One of the better Dallas places to stay”", "Author": "rdpintexas", "ReviewID": "UR14281081", "Content": "This is one of my favorite places to stay when I travel to Dallas. The rate is good, the rooms are clean and quiet, the couches are comfortable. The breakfast was good. The only trouble I had was the treadmill which I couldn't run on- I kept \"tripping on it\". But the exercise bike was fine.", "Date": "March 14, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ft. Smith, AR", "Title": "“Good hotel for price.”", "Author": "geoffg32", "ReviewID": "UR6544751", "Content": "We stayed here for 3 nights and had a nice stay, overall. There were a couple minor problem that were quickly addressed by the staff. Our King suite was clean and fairly large. The living room w/ sofa bed and bedroom were in separate rooms, entirely. What puts this hotel over the top was the rate. $70 a night!!! Great bargain. We will stay here again.", "Date": "January 3, 2007"}], "HotelInfo": {"Name": "Comfort Suites Park Central", "HotelURL": "/ShowUserReviews-g55711-d109325-Reviews-Comfort_Suites_Park_Central-Dallas_Texas.html", "Price": "$68 - $81*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">13165 Central Expressway</span>, <span class=\"locality\"><span property=\"v:locality\">Dallas</span>, <span property=\"v:region\">TX</span> <span property=\"v:postal-code\">75243</span></span> </span></span></address>", "HotelID": "109325", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/8c/e1/8ce1d20f4aaa1aeebf123bc63b76cf115large.jpg"}}