{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“A friendly smile goes a long way...”", "Author": "an0nymiss", "ReviewID": "UR127887052", "Content": "I stayed at this hotel April/2012 for about a month in a two bedroom suite while waiting for my newly purchased home to be ready for move in. I'm normally a Westin, Crowne Plaza type of gal but I wanted a more of an apartment living setting rather than a hotel so I chose this property, not judging the ratings. I must say, I really enjoyed my stayed. The location is nice, the rooms are clean and very suitable for living, and MAJORITY of the staff was polite and helpful. Except KALINA, the front desk agent that checked me in. She did not smile once and drilled the \"party\" rules to me like she was certain I was there to party. I am a young, attractive 24 year old but does that automatically qualify me as a \"party animal\" whenever I check into a hotel? And that's the way Kalina treated me which was very offensive especially since I was checking in with my husband and two kids. A couple of days of her being off was wonderful and relaxing. Every employee I saw smiled and spoke then I have to go down to the front desk one day and there she is with her frowning face...ugh so uninviting but I had to pay for my room so I couldn't avoid her. Anyway, after staying for 2 weeks and paying $120 a day I politely asked was there any way I could get a discounted weekly rate. Her answer was simple without eye contact, \"No, we don't give discounts anymore.\" I've NEVER heard of any hotels NOT giving some sort of discount, but anyway \"the clerk is ALWAYS right\" so I didn't argue, just said \"My husband will talk to the manager to see if hopefully we can get something good for the week.\" Her response in a sarcastic way, \"well, if he wants to talk to me have him come down.\" I then stated I didn't know she was a manager(since she wore the same uniform as the other clerks). She told me she just handles all front desk matters and told me the managers name, which I forgot. I told her that's who my husband would speak with and she told me the only one who would be able to give us a discount would be corporate and even then it would only be like $5. Ok, the discount wasn't an issue. Not something that would make or break us (we're extremely well off) but it's always good to get a savings, so why not ask. I'm not a rude person or even one to complain, but it's uncomfortable to check into an extended-stay hotel and not feel welcomed or appreciated since the GUEST are the reason they're in business and all of the staff gets paid. Besides my encounter with Kalina I would definitely recommend this hotel, especially for long term.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ennis, Texas", "Title": "“The Creme' De Le'Creme of Economical Extended Stay!”", "Author": "tinkerbtch", "ReviewID": "UR126522077", "Content": "What a beautiful property! I give this property the highest rating possible for an extended stay hotel (that doesn't cost more in a week than it would cost to buy a used car). Customer service is absolutely astounding. The room came with a queen size bed, two night stands, a dresser, a table, a stove top with two burners, kitchen sink, cabinets, dishes, pots, pans, eating utensils, cups, bowls, cooking utensils etc. It also features a full sized refrigerator/freezer (which in itself saves you a ton of money just on dining out alone). The bathroom was full sized as if it were an apartment and not a hotel room. It had a bath/shower combo and storage under the sink. It also came with a closet with plenty of room (Not walk in sized but big enough), and an ironing board and iron. Everything about this hotel makes you feel at home. The people at the front desk are very courteous and never fail to make sure that everything you need is taken care of. If you call them to ask them for something they always ask if you have any additional issues and follow up in a very prompt manner. They don't avoid you like most hotels staff do. They make you feel as if they want to make your life easier. Kind, calm, collected and always ready to assist. I will definitely be visiting this hotel again. Consider this a RAVE review..of the property AND the staff. (My stay will end March 28th 2012 and I can tell you, I'm going to miss it here) The only bad thing I could possibly say about this hotel is that the onsite laundry is way to expensive. It's $2 to wash one load and $2 to dry one load (and typically, at least in my case, I needed to dry them twice, so you're looking at a total cost for one load to be 4-6 dollars), but the good part is, you don't have to haul them to other locations..it's all right there on the property.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Plano, Texas", "Title": "“I'd stay again”", "Author": "VECooper", "ReviewID": "UR114125781", "Content": "As a low price providor, the conveniences and cleanliness are comparable to a 2 1/2 star although rated 2 star. The kitchen is a bonus. The pool, hot tub and excercise facilities are sufficient. This location is safe, rather new and the staff is lovely. I brought my own linens as I'm re-locating, which was useful the sheets and bedding are sub-par. No complaints, all the modern creature comforts and a nice breakfast. I was upgraded to a double queen, the room is far larger than I could have imagined. Within a very short walk to the grocery store and restaraunts was nice. An added convenience is the close-in proximity to West Plano and the tollway. I would stay here again and recommend to friends and family.", "Date": "June 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Absolutely a home away from home !”", "Author": "USAFretired1", "ReviewID": "UR87686504", "Content": "I have stayed at the Homestead Studio Suites for more than 2 weeks. The room was spotless upon move in and was throughly cleaned during my stay. The shower and bathroom look renovated and were clean as a whistle. The staff is professional and courteous at all times and could not have been be more helpful. As a business traveler, I can honestly say that I have stayed in hotels that cost 5 times as much that were not near as clean or accomodating as the Homestead Studio Suites in Plano. The grounds are appealing and the lobby, though not fancy, is inviting. If you are looking to stay at a fancy hotel with a 5-star restaurant that will empty your bank account, this is not the place for you. There is cozy dining area w/TV that can be used at any time, however, it is used primarily in the morning for a small, complementary continental breakfast. There is free coffee 24 hours per day. The internet WIFI system works very well from your room and the cost is only $4.95 for your entire stay. If you are in fact looking for a place like home, at a bargain price, then this is your gem in the rough.", "Date": "November 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Perfect Location”", "Author": "vrgrant02", "ReviewID": "UR69946264", "Content": "When I arrived, James was professional and personable and made my check-in a breeze. This hotel is very nice and clean and the amenities are great. Nice pool area and everyone there was friendly.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Panama City, FL", "Title": "“Terrible Beds”", "Author": "Nursechristi22", "ReviewID": "UR57279115", "Content": "I was traveling from Florida to Amarillo, Texas and stayed at the Homestead Studio Suites Dallas-Plano. I booked this hotel on priceline on Name your own price and got it for 20 dollars a night. I know, I know I shouldn't complain. However, the bed wich was a FULL not a queen was hard as the tile in the bathroom. It did, indeed have a full kitchen but no oven. The bathroom was nice and big. The housekeeping could hav been a little better. Dust in the corners of the room. The carpet looks like it needs a good cleaning. I was looking forward to having a good night sleep after driving for 14 hours. The bed had 2 pillows. When my husband went and asked for an extra he was told they didn't have any. The hotel looks like a new hotel, very clean and pretty on the outside, nice and close to everything. The breakfast is a joke. There were stale bagles, cream cheese and coffee. Thats it, no cereal or anything...The room served its purpose and for 20 dollars I can't complain...but the staff could have been more helful.", "Date": "February 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New Jersey", "Title": "“Wonderful experience”", "Author": "cmorpheus", "ReviewID": "UR52083594", "Content": "Great customer service. Staff went be-yond there duties to be helpful. Very friendly and knowledgeable", "Date": "December 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kissimmee, Florida", "Title": "“You'll Love This Homestead”", "Author": "Traveler1951_8", "ReviewID": "UR22396740", "Content": "This Homestead was another property that has become a Homestead. The room is a suite with a completely seperate bedroom. Nice big bathroom. Comfortable couch in the living room. Two TVs, one in the living room, the other in the bedroom. Full size fridge, two burner stove, microwave, 12 cup coffee maker, toaster, and even a dishwasher! Being on the North Dallas Tollway it is a bit tricky to get to and from. It is on the north bound access road so you need to go South on the other side of the Tollway and then U turn at Frankfort to get to the North bound access road if you are coming from the North. There is a Albertson's Grocery Store very close by and lots of eating places. Staff were all extremely friendly and helpful. We visited the area for four days during Thanksgiving to visit family and friends. It was like renting an apartment for the stay. We really enjoyed our stay at this facility.", "Date": "December 2, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Sayreville, NJ", "Title": "“Never Again”", "Author": "A TripAdvisor Member", "ReviewID": "UR1646121", "Content": "In my opinion, these people were trouble. I travel throughout the US and I have never experienced such poor service. \"Dirty linen\" was left in the middle of my room floor (for days), and garbage was left dumped over as well. Then they left linen with \"throw up\" in the middle of the hallway. No toilet paper -- the front desk told me to \"go find the cleaning lady [on one of the floors] and ask for toilet paper.\" VCR broke, lamp broke, TV did not have a battery. In front of me, the housekeeper threw the comforter on the floor, stepped on them with her sneakers, then placed the comforter back on the bed! Mold was growing on the seal and wall. Foreign hair was in my shower throughout the stay, even after they \"supposedly cleaned the bathroom.\" I was unable to connect to the internet for 3 days of my stay. The Manager does not manage the properly in a professional way -- it is more like a \"mom and popp\" shop, as opposed to a hotel for the corporate or leisurely traveler. I CHECKED OUT and found a much better place in Texas -- that is clean, with much nicer people. And now I have no complaints. After all you are spending, and you do deserve hospitality and good service. (Try the Crowne Plaza, Marriott, Best Western, Days Inn -- you are better off and the La Quintas if you are tight on money). And some of these places keep discount coupons -- so I would call them direct to knock a few $$ off. Paying the extra $10-$20 is worth not staying in a dump!! I spoke with their headquarters, and I have not even heard so much as a simple \"apology.\" or even an inquiry. NO CLASS.", "Date": "February 11, 2004"}], "HotelInfo": {"Name": "Homestead Studio Suites Dallas - Plano", "HotelURL": "/ShowUserReviews-g55711-d109339-Reviews-Homestead_Studio_Suites_Dallas_Plano-Dallas_Texas.html", "Price": "$67 - $87*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">18470 North Dallas Parkway</span>, <span class=\"locality\"><span property=\"v:locality\">Dallas</span>, <span property=\"v:region\">TX</span> <span property=\"v:postal-code\">75287</span></span> </span></span></address>", "HotelID": "109339", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/fa/98/fa98e753ab0397235b7d5d11f9ed3b2d6large.jpg"}}