{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Philippines", "Title": "“Near the train/bus station”", "Author": "Danz008", "ReviewID": "UR125376168", "Content": "Venice is an expensive place and to find a good place near the major sites and train station can be difficult. I was traveling solo last August and my number one goal was to not suffer from hauling my luggage from Stazione di Venezia Santa Lucia to my hotel and also save some money. Domus Civica offered me both! It was only 19euros per night and I didn't have any roomates with me (room was supposed to lodge 3) so it was great! I could just walk to the nearest vaporetto stops/stations (Piazzale Roma or Ferrovia). Or as what I did on my first day, I asked the lady at the reception on how to go to the Doge's Palace on foot. I didn't get lost and had a nice early morning excursion via the Rialto. The place is a bit far from the sites, I admit, but there are also palazzos's and restaurants you can visit nearby. It is also very near the Frari Church. It can be strict on curfew (12midnight to 7am you are not allowed to enter the building). So what I did, I asked the lady that I have a 7am train trip to Udine the following morning. So she opened especially for me at 6 :) All you have to do in these situations is be nice. There's no harm in asking. Perhaps there's no attached toilet to the room but who complains for something so cheap? I would recommend this place to my friends... People are nice. The place is quiet and nostalgic. A place where writers and poets to get a lot of inspiration from.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chandigarh, India", "Title": "“Good Hostel but not for mature couples”", "Author": "rkpuri", "ReviewID": "UR120216438", "Content": "We heard a lot about this hostel on web sites. But except for its easy to find location near St.Lucia station it had nothing more to offer to mature travelers like us. Mainly a girls hostel converted to hostel for others during vacations have no restaurant , no attached toilets or washrooms. One can find inner garments of inmates drying in the open all over.Internet is on payment ,one euro for 15 minutes. No professional reception. Its not cheap either. You miss morning tea, breakfast and have to find out thus plan in advance to leave this place.", "Date": "November 6, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Not recommended”", "Author": "swaraj1950", "ReviewID": "UR117822522", "Content": "The hotel closes at midnight and if you dont reach there before, you stay out. Can you imagine? A city that excels at night, the hotel forces you to be back and spend it in there rooms! We booked a double room and what we got was a bunker. They didnt mention any such thing on the website. The place is beside some cathedral, so the bell sound will never let you sleep. But the most annoying part remains the timing. Overall very dissatisfied with the stay.", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Canada", "Title": "“Could have been better”", "Author": "Wherenow3", "ReviewID": "UR117202520", "Content": "The good: good location (5min from train station), reasonable price for being in Venice, clean. Wifi works in the room but it costs extra and wasn't all that cheap. The bad: Your locked in from 1230am to 7am. That means no getting in or getting out. Especially not good if you have an early train. Bunk beds weren't all that comfortable. No fan or AC so either room gets stuffy or you have to leave window open (usually noisy on the street below until at least midnight). Shared bathrooms get quite busy. Also tended to be noisy in the halls. It seemed that everyone slammed their doors (probably just the design of the building though -tight doors.) In a pinch I would stay here again, but I would prefer another hotel next time.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Virginia", "Title": "“great find in venice”", "Author": "piglover217", "ReviewID": "UR115686024", "Content": "This was a convenient place to stay in Venice. It has a great location in a quiet part of Venice close to the train station and the Rialto area. The room was clean and comfortable, and the staff was friendly and helpful. Would definitely stay here again.", "Date": "July 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brasilia", "Title": "“Simple accommodation - great option”", "Author": "Ricardinho_Brasil", "ReviewID": "UR84676894", "Content": "I`ll try not to be repetitive since other user has already made a very nice review. I simply loved this place. Room is quit spartan (or better, Franciscan). very simple but clean and quiet. I took one of those electric mosquito repellent you plug in the wall and haven`t had any problem with mosquito or bugs. Worth mentioning is the great shower (good temperature and great pressure - which is normally rare in islands and specially in Venice). The was always a free bathroom when I needed (no lines). When I learned it was near the railway station I thought it would be in a \"not so nice neighborhood\", noisy etc. But not at all. The location is great at the nice San Polo district: lots of students, bakeries and options too eat without breaking the bank. extra advantages: for a reasonable price you get a room just for yourself. You don't have to share a dorm with a lot of people (snoring?). You can do your shopping , keep your things unpacked and not having to worry about stuffing everything a a locker every time you go out. They also accept families. On the downsize, although there are some bars in the region, the place doesn't help much in meeting new friends, since not so many people hang out in the common areas and there is no food / breakfast served. For my it's the best option in Venice if you want a clean budget accommodation but with the comfort of your own room. I didn`t miss the breakfast and thought one oh the nicest things to do in the morning was to pretend being Venetian and going out for a Latte and croissant.", "Date": "October 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Forlimpopoli, Italy", "Title": "“Good hostel in Venice”", "Author": "meryjune", "ReviewID": "UR74885204", "Content": "The hostel is located 5 minutes from Venice train station. Beware the map on the hostel website is wrong, but the written directions are perfect, make sure to print them out before to go because it's impossible to find it otherwise. Check in is from 7am to 11.30pm so I had no touble for checking in early, which is normally a problem in any hotel/hostel. The girls at receptions are ok, helpful for whatever needed. On the ground gloor there's a common room with vending machines, sofas and TV and another room for with tables, for luggage storage and with an internet terminal. There's free wifi for anyone taking his own laptop, for those who don't there's an internet terminal, free as well, but to allow everybody to use it, no more than 15 minutes are allowed per person, even more times per day. No breakfast is provided but there is not even reason to provide one, since there are two bars just out of the hostel and plenty others nearby. The room is reachable through stairs and elevator (I didn't try it, always climbed the stairs) and my room was on the 2nd floor. The room is ok for a short stay, clean, new mattress and new bed which is really a plus in venice. No bugs at all!! Wonderful! There's a sink and a mirror. A table and a chair and some kind of shelves. Cabinet, bedisde table and bed, moreover, to mention, the floor has a wonderful pattern of tiles, really cute. The hostel closes at 0.30 but it's not a problem as Venice isn't exactly a place famous for its nightlife so it's difficult to stay out that much. It opens at 7 am and there's a label in the entrance that it's not possible to go out earlier than 7am. I didn't have a trouble with it, but I don't feel like recommending if for people who have to leave on an early flight, make sure what time you need to check out!! There are 6 toilets per floor, 3 on each side of the bulding, they're shared among the rooms and cleaned twice per day (great!), I have always found them very clean and never had anything to complain. On the down side, Venice in summer is home to lots of mosquitoes and this hotel does not have mosquito nets on the windows so I have shared my nights there with some nasty mosquitoes. To be honest, natural repellants made of essential oils have made the trick so it wasn't too bad. Another down is guests tend to be noisy when walking through the corridors, talking loud and banging doors. For two days I had to go to bed early just to be woken up in an hour or two by people shouting loud in the corridor, it's silent after midnight, but not before. Overall the stay is pretty positive, rooms are cheap (â‚¬35 for a single room), clean and close to station, city center, bars, restaurants, shops...I'd stay again.", "Date": "August 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Portsmouth, United Kingdom", "Title": "“Quiet hostel in good location”", "Author": "BStone1989", "ReviewID": "UR72365107", "Content": "This hostel was the first of my trip and because of this has a worse review. The place itself was decent enough, fairly expensive considering there is no breakfast included. It is a University hall of residence which means you have to go to the corridor or downstairs for the toilets or breakfast and because I was alone in my room it meant locking up every time. My main issue with this hostel was that there was hardly anyone else around which made it a very unsociable place to stay! Had I not had a room to myself (which to many people is a good thing) I am sure I would have had a better experience but because of this I had a fairly lonely time here. Security and location were fine but no lockers and you have to leave your key with reception everytime you go out! Not bad but I would look around for others before returning.", "Date": "July 26, 2010"}], "HotelInfo": {"Name": "Domus Civica", "HotelURL": "/ShowUserReviews-g187870-d1097266-Reviews-Domus_Civica-Venice_Veneto.html", "Price": "$41 - $123*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">S.Polo n. 3082 C.A.P.</span>, <span class=\"locality\"><span property=\"v:postal-code\">30125</span> <span property=\"v:locality\">Venice</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "1097266", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/36/31/36313ce8928c86ce38c3541cc711ed281large.jpg"}}