{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dresden", "Title": "“A good choice for people who appreciate a clean place to stay”", "Author": "Sebastian Z Posted by an Easytobook.com traveler", "ReviewID": "UR125781066", "Content": "People who like to travel to London without spending a lot of money in accommodation find here a really good choice. Rooms are quite small, but very clean. So perfect for people who just go to hotels for sleeping. Staff is very kind and helpful. We liked to walk to city from here and needed one complete hour. But if you prefer using subway, there is a station quite close. I recommend this hotel.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Alton, United Kingdom", "Title": "“Very good for the price.”", "Author": "Christian J", "ReviewID": "UR121126906", "Content": "We stayed at this hotel for one night as we needed to be in London early the next day and for the price it was perfect. We paid just under £60 and I don’t think you could get more for less. When we booked we were filled with dread form other reviews on this site but I think it must have been refurbished since then. The room wasn’t massive and we had a shared bathroom but what do you expect for the price. There was a TV in the room, and this is the really good point it was spotlessly clean! If it’s just a bed you want for a night then you could get much worse than this.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“\"Staff who really Care\"”", "Author": "Muhammad S", "ReviewID": "UR121019922", "Content": "We stayed in this hotel for two nights on 23 and 24 of November. We specifically requested to a smiley face receptionist for a quiet room and that was exactly what we got. No one disturbed us. Our welcome was warm and helpful. The room was good. This is near to tube station that's why we got reservation here. i would like to suggest this hotel to every one. Thank you to the staff of London City Stay Hotel", "Date": "November 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Where do I begin?”", "Author": "BobDylan10", "ReviewID": "UR117936228", "Content": "Very well where do I begin? The room was pants, way too small. Satellite television my ars*, it was rubbish analogue. Wifi? What wifi? Sneakily trying to charge me an additional fee (after begging me to go and get cash out to not pay by card, surely nothing tax related there...\") Took 15 minutes to ask for simple additional items for the room. Rude staff that made me feel uncomfortable to stay. Come on I'm paying you're wages you can at least say \"hello\". Not worth the money. Stay away.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Silver Spring, Maryland", "Title": "“Very friendly and good location to Tube”", "Author": "Kirsy1", "ReviewID": "UR115294624", "Content": "We really enjoyed our stay. We would definitely stay again when visiting London. It is located about 2-3 blocks from the Underground. And we really liked the use of a kitchen and the deal: eat whatever you want but clean up after yourselves.", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“This place needs some sharpening up”", "Author": "LANDOFGREYANDPINK", "ReviewID": "UR110805654", "Content": "We needed to be near my daughter and stayed there as the hotel has had such good reviews and it seemed a good price based on what we were charged- £49 per night. Downstairs was very shabby- a definite turn off and the kitchen which was in the basement, was shared by guests. People can cook for themselves and can make complimentary use of eggs, bread and milk. It seems a generous and great idea, but the reality of cooking with other residents of all kinds wasn't practical or inviting. I can't imagine hygiene is great, so we gave that a very wide berth. Fortunately, the bedroom was clean and tidy, though sparsely furnished. The shower was efficient. We found the toilet wouldn't flush- we had to lift off the lid and push down on the 'controls' inside. Also the plug wouldn't work, but rather than have someone coming into our room, we reported both on departure. I accept that you probably get what you pay for, but why are the reviews on Trip Advisor so good? I stay in loads of hotels so I reckon I have a good handle on this.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“basic but clean and friendly”", "Author": "flaviast", "ReviewID": "UR110418145", "Content": "We have been there for 2 nights and probably we've been unlucky because we had the last room available, which was in front of the road......very busy road!!!!! The room was big, basic but clean, and so the bathroom, even if the shower had a strange plastic carpet floor..... breakfast was very basic, and self service but abundant. The personal was very friendly and helpful. The hotel itself is far from the city centre, but the tube station is 4 min walk!", "Date": "May 29, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Bucharest, Romania", "Title": "“If you are on a budget, nice choice. If not...avoid.”", "Author": "CatalinaC", "ReviewID": "UR95641670", "Content": "I stayed at Citystay Hotel in August 2010. First of all, the neighborhood was one of immigrants (Indians especially). The receptionists were from Pakistan. They were very friendly and helpful, except the fact that we had to pay the whole amount of money before even seeing our room. The room was a bit small for a triple, we didn't have enough space for our luggage and stuff. The walls need repainting and the whole room needs some changes since there was water coming from the ceiling and lending on the floor. The bathroom was clean, but very very small. At the basement, the hotel has a kitchen and a dining room, where you can serve breakfast. They offer tea, coffee, cookies, milk and fruits for free. If you wish to eat something different for breakfast, you can buy from Tesco or another supermarket,. both situated very close to this hotel and put it into the fridge. The Bow Church metro and train station are very close to this hotel, as well as Bus Number 8 which leads to the center of London.", "Date": "February 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "GOA", "Title": "“Real Value for Money”", "Author": "BLUEOCEANGoa", "ReviewID": "UR65885752", "Content": "My husband an myself booked to stay at this hotel.We are from Goa so were not very sure wht sort of hotel this would be. The entrance was not quite like a hotel as in Goa. But when we checked in we were glad we booked to stay in here. The room given to us was number 2 and was in the basement, i would say it was a clean n decent room just hoped the bed would b a bit bigger, the linen n the bath room were spotless.And since we were in the basement we had a easy excess to the kitchen n dinning area, the kitchen was well equipped and refrigerator was full too. I plan to vistit london back in nov and have already booked my room at the city stay hotel. They have also informed me that they are increasing the inventary of the rooms. The guys at the receptions were very helpful and friendly. I wish them all the best. Cu back in nov.", "Date": "May 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Bacau", "Title": "“Nice cozy hotel”", "Author": "alexneo", "ReviewID": "UR65631019", "Content": "I stayed at this hotel for four nights while visiting London. Although a bit far from the city center, the metro and bus stations were located conveniently close. The rooms are small, but clean, and the beds comfortable to sleep in. I liked the do-it-yourself style of breakfast. The kitchen is fully equipped and has lots of products to prepare a fast easy breakfast.", "Date": "May 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kaduna, Nigeria", "Title": "“Nice Hotel Really Nice Hotel”", "Author": "dryz", "ReviewID": "UR64551174", "Content": "I was in Hotel for Ten days, if you are looking for a place where you could get comfort, cleanliness all on a budget, this is your Hotel, nice friendly staff and they also have a great kitchen where you prepare your food with lots of things provided by the hotel itself. Really enjoyed my stay.", "Date": "May 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Weymouth, United Kingdom", "Title": "“Great, clean facilities at an affordable price”", "Author": "RachelDorset", "ReviewID": "UR50570524", "Content": "I stayed at this hotel both in 2008 and 2009. First time I was there was during a group NLP course in Hackney. The City stay provided friendly, perfect services and clean, up to date rooms with en suit bathrooms which appear to be very well kept. This time, I was there on an overnight stay so it was a whistle stop trip. The facilities were very similar to the previous year in terms of the service and quality of the room. All in all: highly recommended and with brilliant value!", "Date": "December 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "groningen, netherlands", "Title": "“Friendly hotel in East London, standard rooms”", "Author": "lombert", "ReviewID": "UR49035357", "Content": "The hotel is situated on a very busy road right next to the Bow Church DLR. I was a bit scared that would mean a lot of street noise, but the basement room I had was pretty quiet. Had a perfect complementary WIFI connection all through my stay. My only concern with this hotel -and many others for that matter-is the fact that they really should try and cleanup the stains and cracks on the walls and carpet. It was perfectly clean otherwise, a standard basic small sized room. Public transport is conveniently close by, as is a small supermarket. The breakfast/lounge area is somewhat peculiar.The staff is very friendly so all in all this has been a good stay in a cheap no frills hotel.", "Date": "November 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Perfect for an affordable stay in London”", "Author": "CharityK13", "ReviewID": "UR46988912", "Content": "We stayed at the City Stay Hotel near Bow Road for six nights in October and found it to be a perfect respite from our journeys in the London jungle. The room was small – but not stiflingly so. The bathroom was larger than some we’ve seen in our journeys throughout the UK and on the continent and the shower just missed winning the “best shower” award because it could have used a shower wand head rather than a fixed position nozzle – the water pressure and temperature was great though. The bed was very comfortable and we even had enough plugs for our electronic equipment in the room – no easy task and one that most rooms fail. The room was a bit hot even with the furnace off but we were happy to use the supplied fan to cool it down. We were gone from very early to very late in the evening and so we did not use the available kitchen very often but when we did we found it perfect – with everything necessary supplied and the free bananas, cereal, and toast in the mornings were fantastic. The kitchen had a stove, oven, toaster, and microwave along with all cookware and dishes needed – perfect! We also loved the fast and free wifi access that we easily reached from our room and were happy to find that the hotel actually set-up multiple routers to ensure connectivity. Our room was cleaned thoroughly every other day which was perfect for us because I don’t believe it is necessary more frequently and is just a waste of time, money, and energy. We also loved the location – on a major street in between the Bow Road underground stop (about two blocks away and accessible by the District Line and Hammersmith & City lines) and the Bow Church light rail station right next door. Our room was on the interior of the hotel and away from the street, so we had no street or light rail noise. Our only suggestion for improvement would be to check out the quality of the towels – some of them have really large gaping holes and this detracted from the overall experience, however, this is a really minor issue and we were very pleased with our time at City Stay.", "Date": "October 16, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Nottingham", "Title": "“Value for money”", "Author": "Boraxwoman", "ReviewID": "UR32015511", "Content": "We were a bit apprehensive coming here - a London hotel at £60 for a double room - would it be comfortable and clean? The staff greeted us and were friendly and helpful and showed us round. We had to pay upfront, but were able to look at the room first. The room was very small, but we have stayed in smaller, and it was not too cramped. The ensuite bathroom - toilet, washbasin, shower, wall cabinet, handwash and soap, one towel each, plenty of toilet rolls - was very clean. As well as the bed, we had a bedside table, a lamp, an alarm clock (old style), a small table, a flatscreen TV on the wall, one chair, and free wifi. Our room was on the ground floor. Our room was clean and had all the basics. Our only gripe is that the double bed was very narrow - too narrow for comfort and a good night's sleep. Only having one pillow each didn't help sleep arrive, either. In the basement is a kitchen where you can make hot drinks or eat breakfast cereals, bananas or swiss rolls (complimentary, do your own washing up) or cook and eat your own food. All this is free; you are charged £3 if you cook their eggs etc. The hotel has no parking, but there is free parking in the streets very nearby after 5.30 pm until about 8.00 am. It is also free at weekends. We stayed at a weekend so this was fine for us, but other times it's residents only, so I don't know where you'd put a car during weekdays. The hotel is next to a bank with a cash point. There is a small supermarket over the road, and a nice pub with food is nearby. When you think of usual London prices, this was good value for a room with ensuite bathroom and free wifi.", "Date": "June 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Wiesmoor", "Title": "“Clean and comfortable”", "Author": "nina89", "ReviewID": "UR31078496", "Content": "The Citystay Hotel has an extraordinary friendly staff, who helped me a lot, when I lost my purse in the tube. You can use the kitchen and the TV lounge. We booked a double room with a shower and it was very clean and comfortable. It was a very great stay there! I would go there again.", "Date": "May 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“Fantastic - Loved the Citystay Hotel”", "Author": "BrisbaneAnnie", "ReviewID": "UR19223970", "Content": "My husband, my niece and myself stayed at the the Citystay Hotel for 3 nights in June. We were a bit apprehensive having booked on the web but the hotel definately exceeded our expectations. Not only was the price the best we could find anywhere but it had clean, modern decor, an extremely convenient location and friendly staff. Located seconds away from train/bus, laundromat and groceries. Very comfortable and clean room and excellent facilities including kitchen and lounge room and wireless internet access at no charge. Do yourself a favour and book this hotel. An economical alternative to a backpackers.", "Date": "August 22, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Excellent”", "Author": "TravelObserve", "ReviewID": "UR18715233", "Content": "CityStay is excellent for both leisure and business travellers. Good transport links to the West End, Canary Wharf, Docklands and Victoria Park and easy access to local amenities. We stayed at the hotel for 4 nights and really enjoyed the hassle free comfortable atmosphere. Guests have access to the lobby and kitchen 24 hours to help themselves. Rooms are clean and nicely decorated. Real good value for money! We also hired a car from Enterprise, which is right across the road from the hotel. Will stay there again.", "Date": "August 7, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bradford, United Kingdom", "Title": "“Clean but conned.”", "Author": "ISSAT", "ReviewID": "UR18688826", "Content": "Hallo folks. I booked this accomodation, last minute as I drove down to London. Since I was travelling alone I didnt want to pay an arm or a leg at other premium hotels! And to compound my problems it was the first friday of the school holidays. So I managed to book and reserve a room here using my credit card by phone. The staff were friendly, check-in was easy but despite providing my credit card details to reserve my accomodation, I paid in cash and asked to scribble out my card details. The stay was fine although a bit small. Rooms were clean, linen fresh. Bathrooms were shared, so not entirely 100% clean. Well it was just for a night so I would cope! The stairways were narrow too, so managed to scrape my bag on the wall as I clambered up the stairs. Parking was a problem. Its all Permit holders and Pay and Display only! Several days later I realised my credit card was being misued around the globe. I cancelled that card and informed my bank immediately. I rang the hotel and asked to speak to the manager. He refused to provide me with his name and then became abusive and vulgour. I informed the bank again and the police. Stay here but pay in cash. Dont give credit card details.", "Date": "August 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Gold Coast", "Title": "“At last a clean friendly budget hotel”", "Author": "AusTraveller2008", "ReviewID": "UR17487015", "Content": "We are a middle ages couple from Australia and we were apprehensive regarding budget hotels in London after reading some of your reports. We booked into the City Stay Hotel 94 Bow Road Bromley and all our fears were put aside. This is a new hotel and therefore in peak condition - the common kitchen is fit for a chef. The staff were friendly and helpful, the rooms (a tad small) were clean, and the bed very comfortable. The bathroom was also clinically clean. The only negative side is that it is over 1 hour to city centre but the hotel is on a good bus and tube link. (Tip buy a Bus day pass) you can bus hop all day - and get a good feel of London. This hotel and staff exceeded our expectations and we would have no hesitation of booking in again. Good value with good clean service.", "Date": "July 3, 2008"}], "HotelInfo": {"Name": "CityStay Hotel", "HotelURL": "/ShowUserReviews-g186338-d1097114-Reviews-CityStay_Hotel-London_England.html", "Price": "$85 - $396*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">94 Bow Road</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">E3 3AA</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "1097114", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/7a/e3/7ae35cdb0cf979f16fd2688456db41d51large.jpg"}}