{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5"}, "AuthorLocation": "Salt Lake City", "Title": "“Wonderful!”", "Author": "Powda", "ReviewID": "UR120992194", "Content": "I stayed at the Hotel Pension Enzian for 4 nights in November. My room and bathroom were sparkling clean. My room and bathroom each had a large window which opened up so I could have fresh air which is important in a hotel so the room smells fresh and clean. My room faced out to a courtyard so was very quiet and I slept well. The S-bahn station is across the street which is very convenient and it is only about 15 minutes to the Brandenberg Tor stop. The neighborhood was cute with restaurants, cafes and pastry shops. The supermarket below was perfect for picking up a snack. For people that like to run/walk, there is a wonderful path alongside a river which was about 6 minutes from the Pension. I would highly recommend this place.", "Date": "November 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chapel Hill, North Carolina", "Title": "“Great value and convenience”", "Author": "Bob C", "ReviewID": "UR120756332", "Content": "We stayed three nights. Michael was very helpful and easy going. For e75 we had a large room, good access to the S-Bahn and all of Berlin, and nearby food. There is a grocery in the building, a bakery across the street (open on Sunday) and 3-4 restaurants nearby (Oma Brink's is a traditional German place - good food). Michael had set things up for our arrival in case he wasn't around. The remodeling continues, but the finished rooms are great. Big, high ceilings, modern bath. They have business travellers as well as tourists.", "Date": "November 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Hampton, Georgia", "Title": "“Convenient to Tegel, nice rooms, and great staff”", "Author": "Neal45", "ReviewID": "UR118013919", "Content": "Michael seems to be the manager; he handles the desk and breakfast in this small, 12 room hotel. No one could be nicer or more helpful. Hotel is old and three floors up but many of the rooms have been recently (nicely) renovated and ours was great. Certainly roomy enough, especially for a pension. Bed/mattress was new and a refrigerator was included. Completely new bath room, new paint, carpet, and electrical/lighting. There is a small desk. There are a few steps up to the first floor, then a small elevator is useful if you are older or need help with getting luggage upstairs. Breakfast is extra but we had it for 3 mornings. The usual German rolls with coffee or tea, jellies, and a tray of sliced meats and cheese. Good and plenty to eat. It is convenient to the public transit system; a train stop across the street ties into all of Berlin's train, bus lines, and underground system. If you want to get to Tegel by Taxi, it was $23 Euros for us. Also within a few steps is a grocery store (adjacent) and a pharmacy (across the street). There are a few good restaurants within easy walking distance. I highly recommend this hotel.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Perth", "Title": "“Excellent value in all respects”", "Author": "elmolincoln", "ReviewID": "UR115900758", "Content": "Our room was bright and spacious. The breakfast was delicious and worth the nominal charge. The host is very friendly and speaks fluent English. Easy to get to on S-Bahn, in a quiet and leafy neighborhood. Some good restuarants nearby.", "Date": "July 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Quiet, clean, friendly, traditional hotel in good location.”", "Author": "nigel_morriss", "ReviewID": "UR110246682", "Content": "The Enzian is a well organised, quiet, clean hotel. The room was spacious with large windows. It provides a comfortable stay based on traditional methods. Location is excellent, with easy access to the Botanical Gardens and local trains to the City Centre. General atmosphere was friendly. I'd certainly stay there again if returning to Berlin.", "Date": "May 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“best value”", "Author": "benjamin-zuck", "ReviewID": "UR109378749", "Content": "This hotel has a great location on a small calm street. Very close to a city train station (Botanical Garten). Nearby there are many amenities and great places to eat and drink. Despite its green and calm location, however, the hotel is not far away from city center (20 minutes by car, 15 by city train). It is primarily set up for tourist travelers I would say with good facilities and nice rooms to relax, nevertheless also convenient for business people with a desk and internet in the room. The hotel is within a very impressive old building. The reception is tiny with very open minded, friendly & helpful staff. The breakfast room is not the biggest either but the quality of the breakfast was superb. The room was very spacious and very clean with plentiful storage space, the bed was one of the best ever experienced. Bathroom, however, was rather small but also immaculately clean as the rest of the entire hotel. Close-by restaurants offer a huge choice of quality fresh foods.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“A wonderful place to stay with incredible hosts.”", "Author": "Kinga84", "ReviewID": "UR104772317", "Content": "Our stay at the ENZIAN was wonderful and we will definitely come back! We were welcomed at the door by a warm and very friendly host who made us feel at home the moment we set foot inside the newly renovated hotel. The rooms are very lovely - bright, clean and spacious. The location is excellent: The hotel is located in a quiet neighbourhood of Berlin - right across from the Botanical Garden and the city center can be reached within minutes - the train is literally right in front of the Hotel.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Istanbul", "Title": "“Quiet and comfy”", "Author": "GingerIstanbul", "ReviewID": "UR96546531", "Content": "My husband and I have been staying at the Enzian since 2006. We love it! It is quiet and comfortable, with the Old World charm that modern hotels lack. All the rooms are different but each is light and airy. Importantly, the Enzian is within easy walking distance of several great restaurants as well as Bus M48, and the S-Bahn stop is literally across the street. Best of all are the breakfasts, served in the hotel's breakfast room by friendly and personable manager Michael, who has native speaker fluency in German, French and English as well as Polish and Russian and no doubt other languages of which I'm unaware. The Enzian is also spotlessly clean. We wouldn't stay anywhere else. In fact, we go to Berlin frequently just to stay at the Enzian!", "Date": "February 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Innsbruck, Austria", "Title": "“I became a regular customer at Hotel Pension Enzian in Berlin”", "Author": "frankio76", "ReviewID": "UR82181885", "Content": "since my first visit in March 2009 due to a business trip and got a chance to sleep in most of the rooms of the hotel. I choose the hotel for its vicinity to a customer site, but would also recommend for a general tourist visit to Berlin. While not being located in the centre of Berlin, the center of Berlin is easily reachable using the S-Bahn. The station is within short walking distance accross the street. The hotel is very clean and the manager very friendly and helpful. During my regular visits to the hotel in the last two years many have been nicely refurbished. All the rooms are equipped with TVs and refrigerators and WLAN. I will definitely visit the Hotel again on my next trip to Berlin.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "USA", "Title": "“My Stay at Hotel Pension Enzian in Berlin”", "Author": "mjfussball", "ReviewID": "UR79668842", "Content": "My stay at Hotel Pension Enzian in Berlin was very enjoyable, comfortable, and exceeded my expectations for my visit. I found the staff to be extremely helpful and knowledgeable. For example, I stayed several days in Berlin and the staff went out of their way to assist me in getting around Berlin and giving me secret tips to experiencing the city and surroundign areas to the fullest! I highly RECOMMEND Hotel Pension Enzian without any reservations to anyone coming to visit Berlin.", "Date": "September 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Denmark", "Title": "“The genuine choise”", "Author": "AnnaSofie", "ReviewID": "UR35545938", "Content": "My two siblings and I stayed here for an extended weekend whilst visiting family in the area. We shared a large room with private bathroom, the room containing a king size bed, a sofabed, a furniture arrangement with another sofa and arm chairs, etc. etc. In fact, it was more like a cosy, old-fashioned living room with sleeping facitilities than a hotelroom. The place is situated on the 3rd floor and appears once to have been one or two private apartments changed into a sort of a granny style town house suites pension. Michael, the guy running the place, is not particularly granny-style, though; he was a very relaxed, friendly and helpful host, who served us nice breakfasts as well as helped us changing our return tickets. Neighborhood is nice and quiet. Supermarked and train station just around the corner. Would definitely stay again!", "Date": "July 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "South Bend, IN", "Title": "“Affordable and Friendly Berlin Hotel”", "Author": "SouthBendNot", "ReviewID": "UR17912736", "Content": "I stayed here on a recent group visit to Berlin and the Free University (walking distance) and was very happy with this quaint pension in a leafy district of Berlin. The hotel is located across the street from S-bahn station (Botanical Garden). Even though downtown Berlin is just a few minutes away by train, this university neighborhood near the botanical gardens was quiet after dark. The rates were cheap and for an additional $5 we enjoyed a traditional German breakfast with bottomless coffee or tea in the breakfast room (the patio table is the best). The manager spoke English, Polish, and German quite well and helped our group get taxis, train maps, and printed boarding passes for our group. Since there were refrigerators in some rooms the grocery on the first floor was a handy option for snacks. There are several restaurants, little shops, and bakeries within walking distance. They are a cash only hotel but helped some pay using other forms of payment like pay pal. I would stay here again without a doubt.", "Date": "July 15, 2008"}], "HotelInfo": {"Name": "Hotel Pension Enzian", "HotelURL": "/ShowUserReviews-g187323-d1104117-Reviews-Hotel_Pension_Enzian-Berlin.html", "Price": "0", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Hortensienstr. 28</span>, <span class=\"locality\"><span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "1104117", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/89/8c/cd/hotel-enzian-berlin.jpg"}}