{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Average hotel with extremely friendly staff”", "Author": "ruiza", "ReviewID": "UR126884677", "Content": "This hotel is located in the red light district but away from the main street so you don't actually hear the hustle and bustle. My husband and I had a pleasant, quiet stay in this hotel for 5 days. The staff are very friendly especially the one at the reception. He really made us feel very welcome and like old friends, not just guests. We stayed at the 8th floor and there was daily cleaning of the room if you request. They won't clean if you don't request which is not a problem because we just had to tell the reception to clean our room every time we go out in the morning. The room is old but clean and comfortable. So if you just want a cheap comfortable stay in Singapore with very welcoming staff, consider this hotel. The location is also excellent as it is near a bus stop and 2 train stations. There are lots of nearby eating places to choose from and there is a mini grocery across the road which is open 24 hrs.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Dont let Red Light District deter you”", "Author": "barbaraanne6", "ReviewID": "UR122894649", "Content": "I have been to Singapore many times and have paid lots of money for services not so good so thought a 2 star might be better picked Happy Hotel because of price and locality I was quite surprised, close to shops and transport. It wasn't until the fourth day that I found it was in the red light district. The cab driver said to me did I mind NO they did not bother me and I am sure I didn't bother them. I wanted many trips and the young lass behind the counter could not of been more helpful she persevered until she got all the trips I wanted. At the top of the street I had my main meal at night, helping of chicken, vegs and rice S$2. Bus stop also at top of street going all over Singapore, again cheap.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "derbyshire", "Title": "“Good stay!!”", "Author": "therams_1884", "ReviewID": "UR122799793", "Content": "Nice place to stay! All the reviews on here give it a bad name but if u wasn't told it was in the red light district we would not have known, very friendly and very helpful staff!!!", "Date": "January 9, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Cairns, Australia", "Title": "“DO NOT STAY”", "Author": "GMS8855", "ReviewID": "UR119276190", "Content": "I stayed in this monstrous hotel for 1 night in July 2011. The hotel is located in the red light district area. The hotel leases rooms in the hotel to local street prostitutes and clients (for 3 hrs) therefore making the place a revolving brothel. Whilst standing in the front reception area I personally witnessed the negotians between client , prostitute and management. The Rooms are very small and dingy, nil safe etc . The only highlight was the Sri Lankin cleaner who provided me with all the details or where to go into the City in order to vacate my presence from the Hotel. Do not stay here the room price is good but the whole experience is not worth it at all.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Manila", "Title": "“there's a reason why this is cheap”", "Author": "I_Am_Gretchen", "ReviewID": "UR101454177", "Content": "Free wifi. Speed is enough if you are using mobile where you can open 1 page at a time. There are 4 accessible bus stops that goes to different locations in Singapore. Nearest bus stop is 2mins away. Taxi is abundant because of its location, red light district. The lady receptionists are nice. The Indian staff/room boy is always ready with a smile on his face. Room looks like newly renovated. One male receptionist which I've seen only once when I have request like fresh towels and taking out the garbage slammed the phone down on me and was rude while taking my request. Rooms at the 7th floor are noisy. Last 2 days of our stay hot water run out. When we have it checked and also request for housekeeping before we go out, they didn't do anything about it. This hotel is good only for overnight booking they don't have enough storage. Bad cable reception. Less than 15 channels.", "Date": "March 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Cleanliness down compared with a year ago”", "Author": "KLF_Sydney", "ReviewID": "UR93675561", "Content": "This is a budget hotel in an otherwise expensive Asian city. Compared with a year ago, the standard of cleanliness has dropped quite a bit - toilets are not clean and bedlinen generally dusty or not pressed. Cleaners lack hygiene - they leave brooms on clean linen in the delivery trolley.", "Date": "January 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Manila", "Title": "“budget hotel with Quality Service”", "Author": "ara33", "ReviewID": "UR31158473", "Content": "i would highly recommend this hotel especially now that the economy is down. i've been to other budget hotel but this hotel is better than the other hotel in geylang. The room rates are affordable, rooms are very clean and what i liked most is the service. The receptionist are very friendly and they always attend to my needs. i would like to share my experience with one of the receptionist , there's one receptionist that GO EXTRA MILE in giving her service. I asked her about a certain place though she's not sure of the place but she tried all her best to deliver service..she called her friends and colleagues just to gather information. maybe for some this is just normal service,but for me this is excellent..this is QUALITY service. I suggest travellers to stay to this hotel..", "Date": "May 30, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Melbourne Australia", "Title": "“Bedbugs,Pubes,Poop - Three rooms of pain.”", "Author": "f4j", "ReviewID": "UR31119285", "Content": "We arrived at the hotel, checked in with wotif reservation, prepaid. $110 for two nights. Upon arriving we checked in at reception, and were given the key to 701. The hotel in general is pretty small, rundown, that's fine though, its just a place to sleep while exploring Singapore and the local markets are supposed to be good. So we take the lift, get to our room and put our bags down on the floor and look at the room. Small, poor repair, no blankets, just a sheet on the mattress. Fine. Whatever. I sit on the bed and we start to plan our day...then I notice the headboard above the bed is moving, the room is infested with either bedbugs or lice, transparent things about half the size of a pin. We quickly get out things and head back to reception to ask for a new room, we tell her about the bugs (I think she already knew from her reaction) and were given 702. This room had pubic hair on the bed. clearly had not been changed between guests.Back to reception. This time we were given 801, and the lady from reception came up with us, we looked around the room, no lice/bedbugs, no pubic hair, then with her asking if this room was ok I lifted the toilet seat, liquid feces spots across the seat. We asked for a refund. She started to tell us no until we told her we will call the bank (visa) and then she agreed. While processing the refund, she checked a couple into 701.", "Date": "May 29, 2009"}], "HotelInfo": {"Name": "Happy Hotel", "HotelURL": "/ShowUserReviews-g294265-d1109968-Reviews-Happy_Hotel-Singapore.html", "Price": "$48 - $58*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">9 Lorong 10 Geylang</span> | <span class=\"extended-address\">Central</span>, <span class=\"locality\"><span property=\"v:locality\">Singapore</span> <span property=\"v:postal-code\">399042</span></span>, <span class=\"country-name\" property=\"v:country-name\">Singapore</span> </span></span></address>", "HotelID": "1109968", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/bc/2f/96/happy-hotel-thumbnail.jpg"}}