{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lawrence, Kansas", "Title": "“Great hotel for a convention”", "Author": "Tim A", "ReviewID": "UR127026300", "Content": "This hotel is just a short walk to the convention center. The staff was very friendly and the room was clean and spacious. Recommend highly!", "Date": "March 31, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“Good location but a typical Marriott”", "Author": "gsahagun", "ReviewID": "UR126913622", "Content": "Stayed here for a meeting and location is perfect. Rooms are comfortable, and clean. Service okay. No free Wifi. Request higher floors because lower floors do not have any view. Pool present. Best part is that its location is near the convention center. Fine for business travel.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Angmering, United Kingdom", "Title": "“busy at times”", "Author": "HbsLittlehampton", "ReviewID": "UR126484427", "Content": "Standard Marriott hotel a few minutes walk off strip close to convention center. Stayed there 4 nights for a meeting. Meeting facilities were good and staff helpful. Rooms were typical Marriott. Only down side was the restuarant and bar. At times lack of staff led to slow service, when you want a quick drink before going out it could take some time. The staff were good and remembered your order but were oftern alone running the bar and restaurant.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ogden, Utah", "Title": "“Great Staff, Great Room, Minutes from the Strip”", "Author": "Ryan M", "ReviewID": "UR126342208", "Content": "The staff was very knowledgable about the area giving great recommendations for buffets, etc. My room was very spacious and very clean. I had a great time! Thank you!", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NC", "Title": "“Clean, great staff, walk to the convention center.”", "Author": "hodels", "ReviewID": "UR125661778", "Content": "Stayed here during a convention, and it is a very short walk (maybe 1-2 blocks max) over to the convention center......rest of our team was at the Wynn and I had the easiest time getting to & from the convention (plus had extra time to get in line for coffee at Starbucks inside the convention center - SUPER-fast staff, but beware of 45 min lines during conventions, get there early!). Beats having to graba taxi & brave the taxi line OR the traffic (even in a taxi). Location has the new renovation, and it is very clean. Staff is great, bell hops will get you a cab if you need one. Also, the food in the bar/restaurant was surprisingly great (a bit high, but not compared to the convention center!). LOVE the fact that there is no casino in this hotel - it makes getting in & out so much faster, riding the elevator faster, and just a lot less hassle - plus a shorter trip to the front door!", "Date": "March 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "LA", "Title": "“get some help with breakfast...”", "Author": "mtnmanlives", "ReviewID": "UR125512041", "Content": "everything was fine and met my normal Marriott expectations except the breakfast area... we came down to eat around 9AM and there was a line about 20 deep waiting to be seated, while half the restaurant was empty. Obviously, someone screwed up and had only 1 person working the entire place. We left and went down the street to McDonalds instead as we left town.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Rockville, Maryland", "Title": "“Very nice hotel close to strip”", "Author": "TheDrummerMan", "ReviewID": "UR125339625", "Content": "We stayed at the hotel recently. The staff is just wonderful and very helping. Specially Kathy at the front desk and Gonzales in the restaurant. As a gold member we got free breakfast, a big buffet for 2. It is a close walk to monorail and the strip. Be aware that depending on where you want to go on strip, it might be a long walk or require a taxi. Rooms are very nice. I will recommend this hotel.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Rzeszow, Poland", "Title": "“Close to the strip”", "Author": "Ciosu", "ReviewID": "UR124985461", "Content": "Stayed there one night with friends during first visit in Vegas. It is not one of the huge, famous Vegas hotels, but still ok. However for a Marriott hotel, I expected more. Nice view from high floors. Room was very clean and rather spacious. There was flat panel TV, sofa, mini refrigerator and also coffee maker. The free parking garage is security-gated with room key and is very close to the elevators. It has no casinos and no check-in or check-out lines, but is located walking distance to strip and monorail. I will stay there every chance I get it because is good located, quiet and friendly.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bellevue, Washington", "Title": "“Nice hotel not too far from the strip”", "Author": "Sean J", "ReviewID": "UR124811983", "Content": "This is my second review, and I am rating it higher this time. This is a nicely priced hotel (use your AAA card to get bout 10% off), and it's a great holel. Some of the things I like about the hotel 1. As a platinum member, you get free breakfast 2. A free business area with use of computers and printers 3. walking distance to the strip (It took me 15 minutes to talk to the Wynn. 4. Nice spacious rooms 5.as a platinum member, you often get upgraded to a suite 6. walking distance to the convention center 7. the coin operated laundry room is a nice touch Some of the negatives: 1. No concierge floor 2. The pool is tiny", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“I loved it!”", "Author": "johnhuhlee", "ReviewID": "UR124458403", "Content": "Normally when I'm in Vegas, I try to stay at a nice casino/resort. But I was here on business for a convention so I wanted to stay at a quiet, low key hotel. There are a few hotels near the convention center and I chose the Marriott cuz it had the best rate. What a great find. As soon as I walked in, I was greeted by the friendliest staff. Check in was a breeze which is rare among Vegas hotels. The rooms were awesome. They're all suites and the bedroom and living room is separated by french doors. Everything was clean. The rooms are equipped with modern furniture, a bar area, fridge, and flat screens in both the living room and bedroom. Parking is free and since the hotel is within walking distance to the convention center, I saved money on parking at the convention center which was $10 a day. Convention was 4 days! The only con, internet is $12.95 but not really a negative since all Vegas hotels charge for internet. I look forward to staying here again.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Santa Barbara, California", "Title": "“What a Surprise!”", "Author": "TravelingLaura", "ReviewID": "UR124226646", "Content": "I spent 4 days at this hotel around Thanksgiving for a soccer tournament. This was not the hotel recommended for the team but in the area. I try and stay a bit removed during these events in the attempt for a little peace, and this was an excellent choice! If you are looking for something off the strip, this is a nice place to stay. All of the people who worked here were friendly and helpful. The room was very nice. The bed was comfy. Unlike previous reviews, the TV was new so I believe everything has been updated. It is a nice quite hotel, a good place to get a good night's sleep. The workout room was excellent. I heard nothing but complaints from the rest of the soccer team that stayed at other hotels near this, but our stay here was wonderful. I would come back here in a heartbeat next year for the soccer tournament. No, it is not the Wynn; but it is a nice off the strip alternative at an affordable rate.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "San Ramon, CA", "Title": "“Stayed here using points”", "Author": "SusieJue", "ReviewID": "UR123581247", "Content": "Always love a three day weekend getaway to Vegas...so much to do and the shopping is incredible! Since I am a points and miles junkie, I was able to book one night at the Las Vegas Marriott using my points. I had stayed here before and it is an all suites property. For 25,000 Marriott points, it's an ok deal, although for the same amount of points, you can stay at Marriott Grand Chateau near City Center, but it was not available on my date of stay. I did stay there the following night. During non-convention time, the hotel is very quite and far from most attractions, but that might be a plus for some people. Parking is free and you self park in their gated garage. The check-in is smooth. Next to the reception is The Marketplace kiosk for drinks, snacks and toiletries. I had room 1204, which had a strip view. The suite had a separate small bedroom, king bed, small flat panel TV. The living area had sofa, flat panel TV with desk and wet bar and mini refrigerator was under the end table. There was a coffee maker, which I decided to make some hot water for tea and the water had brown scum in it...so gross. If I had made coffee, it would have been disguised and I would have ingested, really a turnoff. Bottled water for purchase in the room. Bathroom had tub/shower combo. No robe and the toiletries were terrible, such a negative. Free Wifi in the room, which was nice. The room was relatively clean as was the hotel common areas. Closet and in room safe. I had to heat up some food and they let me use the \"staff\" breakroom microwave. Pay for View movies in room, business center with printer, copier. Vending machines on the floor. Las Vegas monorail is one block away and runs 6 am to 2 am. The airport shuttle is $7.00 each way to the strip. Walgreens at the corner on the strip, although in the burning heat of summer, it wouldn't be a fun walk. Amenities include 24 hour Fitness Center with lifecycle, stair master, treadmill. There is a small pool and whirlpool, not much to write home about. The room service breakfast is $19 for American Breakfast with 20% service charge and sales tax. The lobby bar is off the reception and restaurant beyond that. They have free cold water and apples in the lobby. I was trying to use my Marriott points for this stay and would recommend the Marriott Grand Chateau over this property, for the same amount of points. This property was a vast improvement over the Courtyard Marriott though.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“An excellent retreat from the smoking and gambling”", "Author": "traveltime54", "ReviewID": "UR123473132", "Content": "This review is based on stays in October and December 2011, and January 2012. As a Marriott Platinum Lifetime elite member I have stayed at over 150 Marriott locations, and that includes those properties that are all suites. This Marriott is an excellent one. The hotel has just completed a full renovation of its lobby and restaurant area. It appears to be both a love or hate proposition, but is somewhat of an improvement despite the fact that the restaurant space has given way to more bar, and community tables. The rooms also need renovation, which I understand is slated for next year, but nonetheless the rooms are clean and well maintained by an excellent housekeeping staff. In fact, I can honestly say that the entire staff of the hotel, from the servers and restaurant managers like Manny, Scott, Winnie, Gloria and Justine, to the desk staff like Kathy, Kit and Junior and Manager Jonathan, and the housekeepers Camarina, Gloria, and Supervisor Nancy, are all some of the best group of Marriott employees we have encountered in 25 years. By the way, parking is also complimentary, and all parking spots are very accessible to the hotel lobby. When we return to Las Vegas this will be our home away from home. That is not only because of the above, but also it is a property that is detached from the smoke, gambling, and crowded atmosphere on the Strip. That entertainment is literally around the block, but its sure nice to be able to sit at a bar, in a smoke free atmosphere, and enjoy the peace and quiet of a real hotel atmosphere. If you try this hotel, I believe you will enjoy the experience.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Gurgaon, India", "Title": "“Las Vegas Marriott”", "Author": "RajeevUppal", "ReviewID": "UR122286377", "Content": "Las Vegas Marriott is very ideally located and one of the finest hotels in Las Vegas. i have stayed there a couple of times during my visits to NV. The Las Vegas Marriott Hotel combines extraordinary accommodations with the perfect location. Only two blocks from the Strip and across from the Convention Center, this 17-floor, smoke-free hotel is ideal for business or vacation. The 278 spacious guest rooms are enriched with plush, luxurious bedding and stylish décor. The latest technology makes the Las Vegas Marriott Hotel great for business meetings. After business, take a short stroll to the Strip or visit The Fashion Show and the Forum Shops. The alternatives do not end there, as our excellent outdoor pool and fitness center will keep you in great shape. For unbeatable luxury and location, the Las Vegas Marriott Hotel should be your destination of choice.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Spokane, Washington", "Title": "“Among a chain of high quality, this hotel had among the finest employees I've ever encountered”", "Author": "drfumblefinger", "ReviewID": "UR121719617", "Content": "I stayed at the hotel when there was a major remodel going on, including of the lobby and restaurant. This minor inconvenience more than made up for how helpful the staff were in trying to make sure that I had a good stay. Everyone was very friendly, very helpful and did everything they could to make me comfortable. I have a feather allergy, and they had an upgraded feather free room for me. The room was extremely quiet (for Vegas especially) and nicely appointed. Breakfast was excellent. Nice stay, thank you Las Vegas Marriott! By the way, if you have an event at the Convention Center and want to stay at a not massive resort hotel, this is your best bet.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Room nice, but the hotel is under renovation”", "Author": "OnTheRoadTucsonAZ", "ReviewID": "UR121592962", "Content": "We stayed one night at the Las Vegas Marriott. We are Platinum Marriott members so we got a very nice room on the 14th floor (1414) but the hotel is terrible other than the room. The checkin desk is on the second floor in a made-over regular room. You have to have a bellhop to bring your stuff to your room so you have to tip. No way to get a luggage carrier yourself. To get to your car on the second floor of the parking structure you have to take an elevator to the ground floor, walk outside to the parking elevator and go up one or two floors. No taxis hang out there so you have to get the hotel to send someone to the front to hail a cab. Unlike most Marriotts, there is no concierge area. Breakfast is on the 17th floor and is no better than a Residence Inn breakfast but they charge $14 (ours was comped). We should have stayed at the MGM where our daughter was staying. I wouldn't stay there again until the renovation is done.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "2"}, "AuthorLocation": "New York City, New York", "Title": "“Just fine”", "Author": "LizGreen_11", "ReviewID": "UR121575199", "Content": "I traveled to Las Vegas for business in late October with a colleague. Having never been to Vegas before, I didn't know the importance of staying on the strip. The hotel was just fine and served the purpose well. The room was a suite, and was clean, which is one of the most important things to me. However, the location was off the strip on a pretty desolate road (at least at night). There is a restaurant/bar that is average. We ate at Todd English's Olives for lunch which was good, and Botero in the Wynn which was good, but very expensive. My favorite restaurant of the trip was Table 10 at the Palazzo - it was excellent!", "Date": "December 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Very nice, non-casino, non-Strip hotel!”", "Author": "ChaunceyGardiner", "ReviewID": "UR120370288", "Content": "Had a one night stay here, as I was at a conference for a week, and conference rates at my other hotel were silly high. Got a great rate, and a pleasant stay. Good wifi speed. This is an all-suites hotel. (I think it had previously been branded as a Marriott Suites.) Very large rooms and baths, could easily get Mrs. Gardiner and Kiddo in here comfortably. Walking distance to Convention Center, although that might be unpleasant in July and August… Nice employees, very helpful. Food in restaurant was well prepared, and prices weren’t gouging. Getting a taxi to get out of there took a bit of work by the bellman, so take that into account with your check-out time…", "Date": "November 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "michigan", "Title": "“Great hotel, but bad hygiene”", "Author": "therealmike", "ReviewID": "UR120054098", "Content": "I really enjoyed this hotel. Nice room, no Las Vegas casino BS - convenient desk, parking, nice breakfast. But unfortunately I discovered that the maids washed my water glasses in the sink. I cannot stand this. It is disgusting to think that the same person who is cleaning your toilet and bathtub is washing your dishes in the sink - without dishwashing liquid or hot water. It is just gross. So I will not return here. Management was non-responsive to this issue.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Expect the best from Marriott, but...”", "Author": "Dc2011dc", "ReviewID": "UR119110835", "Content": "The good: Great location, good rates. The needs work: service not up to par with Marriott, wireless is worthless, espresso machine broken ALL WEEK! come on, get service in here to fix the wireless and fix your coffee. Basics neglected!", "Date": "October 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Westminster, CO", "Title": "“Good place to stay for business travel.”", "Author": "valor155", "ReviewID": "UR118984971", "Content": "Off the strip, but still pretty close to it. You are close to the action, but not overwhelmed by it. Nice outdoor pool and hot tub. Very good breakfast. Excellent food service in general. The food was good for breakfast and dinner, and the service was friendly and excellent. The room was a good size, but it was dated in decor, and smelled a bit. It did have a nice flat screen TV, but the HD channels were hit or miss, with the picture pixelating or lagging. I just watched the Standard Def channels instead . . . a bit disappointing. All in all, not bad and I'd stay here again for business travel. Great service, but the rooms need a little work.", "Date": "October 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Calgary", "Title": "“This will be the prefered hotel when we're in town”", "Author": "MissAK", "ReviewID": "UR117776762", "Content": "I was recently on a business trip to Vegas, and chose this hotel for it's close proximity to our meeting locations. When I read the reviews, it sounded promising, and I really hoped it stood up to the hype. I was not disappointed. The hotel is well situated a short walk from the Wynn Encore and Fashion Show Mall, and is definitely a business hotel. That's exactly what we had hoped for when we booked the rooms. We had chosen the Business Boost package that included breakfast, internet and phone. The staff were courteous and efficient checking us in, which is always a nice start to a trip. The rooms were actually suites, which weren't really needed for this trip, but the extra room was appreciated. I found the room very well appointed and well laid out. I appreciated that the creamer for the coffee was liquid, not the dry powder (a small thing I know, but nice to see). The internet was easy to access and the bed was comfortable. There is a self serve citrus water station by the elevators to help keep you hydrated. Definitely a plus in the high temperatures. We walked from the hotel to the Fashion Show Mall for dinner and found a nice Mexican restaurant, El Segundo Sol. The food was better Mexican than we can get at home, and the service was spot on. No complaints there at all. The breakfast was a pleasant surprise, we had expected that the breakfast would be the buffet, and the menu would not be included. The Business Boost package though, includes the menu items, and the buffet had lots of selection. This is the first time anyone at my company has stayed at this hotel, but it won't be the last.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Bellevue, Washington", "Title": "“good hotel, good price”", "Author": "Sean J", "ReviewID": "UR117504860", "Content": "This is a conveniently located hotel, with a very short drive to the strip and convention center. If you are a platinum member, there is not concierge lounge, but they provide you with free breakfast. It's a very difficult hotel to get a taxi, but parking is very convenient if you have your own rental car.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Beyond Expectations”", "Author": "Jerry M", "ReviewID": "UR117110991", "Content": "My wife and I decided last minute to go to Vegas and struggled to find an economical hotel near the center of the strip (we were going for a concert at the Cosmopolitan). We decided to stay at the Las Vegas Marriott due to the inexpensive price for a saturday night (in vegas terms) We didn't know what to expect when we arrived but when we did, WOW! We were blown away with the speedy check-in, pleasant greeting and the room was well beyond our expectation for the amount we paid for one night! We both looked at each other when we initially walked into the room and both had the same thought, \"we need to stay here from now on! forget the strip!\" Will stay here again soon!", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Hong Kong", "Title": "“Great off-strip hotel - only downside was the welcome”", "Author": "HardBedVeteran", "ReviewID": "UR116681180", "Content": "As we take continue our vacation we stayed at our 2nd of 3 Marriott properties - this time the Las Vegas Marriott hotel. An off-strip property, this was a suite-room hotel which was really very plush and exceeded our expectations given its price point and location (it's really not that far from the strip if you have a car, and is very convenient to get to pretty much all places around town using the Paradise Ave and Industry Ave respectively.) The hotel has a nice sized pool and great for cooling off in the hot sun with friends. Hotel has a nice-sized bathroom, very clean and well maintained. The staff were very friendly and helpful, and bell service to help with our overwhelming bags of shopping was quick and responsive. At the ground floor lift lobby there's always an iced water dispenser with lemon slices for guests' convenience - a welcome touch to a hot day in Vegas! Parking is ample both in front of the front door or in the back parking lot. Obviously the covered lot is great to keep your car in the shade. Taxi maybe hard to catch from hotel front door so may have to wait a bit for one - or you can walk to Paradise ave and take the monorail service to the middle of the strip! The only botch (which was why the rating was Average instead of Very Good) was the welcome we received the evening we arrived (almost midnight) after a long nights' drive from California via the old route 66 and State 95 via Searchlight. The front desk gentleman was not really friendly or particularly welcoming. Perhaps I caught him on a bad day but then again.... it is a Marriott property. Did not expect that. Apart from that - great value for money, nice a peaceful and off-strip. Oh, and one other thing - on Paradise Ave, one block north of the hotel, there's an ARCO gas station - tank up there as they have very low prices on the gas - that's also on your way to the freeway heading East or North!", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Akron", "Title": "“Surprisingly decent”", "Author": "Hank44224", "ReviewID": "UR115696195", "Content": "I visit LV a lot for both business and pleasure. This was my first time staying off strip. The Marriott rooms were clean, very spacious, well appointed. Location was easiy within walking distance of the conv. center. Restaurant was decent. Staff was extremey helpful. I'd go back!", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Santiago, Chile", "Title": "“A Tranquil Escape from the Strip”", "Author": "scl44", "ReviewID": "UR115027183", "Content": "In a city of opulence and extravagance the Las Vegas Marriott is a peaceful escape. There are no casino chimes, no smoky lounges, nor grandiose buffets. This Marriott delivers what you would expect from the brand – clean, comfortable rooms and efficient service. The rooms have separate living areas that feature a workstation and TV with full cable lineup. The breakfast buffet provides an ample array of pastries and fruit, and the omelets were made-to-order. In fact, the service was more attentive than at other Las Vegas dining experiences. Positives: Spacious suites with separate living area, complimentary garage parking, walking distance to the Convention Center and Strip, tranquil escape from the Strip Negatives: Not located on the Strip – 2 blocks off the Strip, consider distance if headed to the South end of the strip If not for the massive billboard on the side of the hotel, Marriott could place this hotel in another location. If you would like to go to Las Vegas and leave the sparkling lights, bustling lobbies, and labyrinth hotels, then this is the right place.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Rapid City, South Dakota", "Title": "“My kind of Vegas experience”", "Author": "envious", "ReviewID": "UR114578652", "Content": "This is a lovely, clean, quiet hotel oriented to business travelers. It is off the Strip but close enough to walk to the Strip or take the nearby monorail. We had a nice suite with a fridge and coffee-maker (unheard of at the Strip hotels). The small pool was nice and quiet. The staff was friendly and accommodating. We got an online weekend special -- $129 for three nights, with the third night comped at checkout. The rooms have wired Internet for a fee; free wireless in the lobby areas. I would definitely stay here again.", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "NJ, USA", "Title": "“Nice Clean Hotel for the Business Traveller”", "Author": "MissBirdy", "ReviewID": "UR114556436", "Content": "I stayed here for a week on business. This would not be my ideal hotelfor a pleasure trip to Vegas, as it is far off of the strip. PROS: Very, very clean. Spotless! The rooms featured comfortable beds, flat screen TVs, and an empty mini fridge for your own drinks/snacks. There is a small fitness center with several cardio machines, some free weights and one mat. The pool is small but spotless and the lounge chairs are very comfortable. There is complimentary fruit and water throughout the hotel. Their business set up was nice, with continental breakfast and coffee/juices in the AM and chips or cookies and snacks (and coffee!) in the PM. The staff is pleasant and professional and I found them to be helpful more than once. If you eat at the restaurant try the asian chicken salad it was delicious. CONS: Charging for wireless internet! Please! Also, the bathrooms in the suite would be improved with a shaving/makeup mirror and hairdryers that were newer than 20 years old.", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“amazing experience!”", "Author": "skm86", "ReviewID": "UR111936078", "Content": "Best Complimentary breakfast i've ever had that consisted of a very good variety of fresh, gourmet style food. Very nice and friendly helpful staff.", "Date": "June 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Edmonton", "Title": "“I valued the Marriot's \"normalness\" while working in Las Vegas”", "Author": "Katrina W", "ReviewID": "UR110179932", "Content": "If your trip to Vegas is more about business than sin-city style debauchery, you might like the straight forward approach of this small hotel. Well it's small for Vegas anyway. This means you don't have to walk through a smoky casino and you can make it from the entry to your room in under 2 minutes. The gym was open 24 hrs and was well appointed. Bed very comfortable with high quality linens. The room in general was spacious and well appointed. I found the staff to be extremely friendly and they started to recognize me by the second day. If you are after a real las Vegas strip experience with a lot of exotic features, uber luxury, glitz and glamour, this is not it. I was in Vegas for an event at the convention center (a 2 minute walk away) and was exhausted at the end of each day. I happily retreated to this quiet space. The restaurant was, again, not exotic but very good with more than decent selections and reasonably priced. When I had a bit more time to explore, Encore, Wynn and fashion show mall were easy walking distance. I found it to be a relief not to have to stay in a busy, noisy, huge hotel while working. Would definitely go again.", "Date": "May 28, 2011"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "San Diego", "Title": "“Marriott Turned Vacation to Nightmare”", "Author": "heart_trips", "ReviewID": "UR107539602", "Content": "Stay away from this hotel! Jonathan Davis, hotel manager, is qualified to be working at McDonalds at best. Guest services are rude, unprofessional, uncooperative. I was staying at the hotel with my husband but came back to the hotel early by myself one afternoon and didn't have the room key. Hotel manager was extremely rude and wouldn't let me up in the room becuase my husband's name was the only one on the reservation. A simple situation was turned into a huge issue. He wouldn't accept my drivers lisence, wouldn't speak on the phone with my husband. Other employees at the counter who saw my husband and I checking in and earlier that morning (even gave us directions) acted as if they didn't recognize me. What a shame on Marriott for letting unqualified people represent their brand and take managerial positions. Moved out to Hilton down the street immediately, will never stay there again!!", "Date": "May 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Miami, FL", "Title": "“Marriott Excellence”", "Author": "kchnman", "ReviewID": "UR106741627", "Content": "I'm a Marriott loyalist. I believe that they offer the most consistent quality in all of their properties of any of the major hoteliers. I have very high expectations when I stay at a Marriott property & that is what I usually get so it takes a lot to impress me. Well I'm impressed! This Marriott has a fabulous staff. From the person who first took my reservation (I called the hotel directly) to the housekeeper who made up my room, to the front desk people, to the restaurant staff, to the on site management. INCREDIBLE SERVICE!!!! They all made me feel that I was family not just a paying guest. Anthony, John, Justina & everyone else. Thanks. If you don't need a casino on site there is no better place to stay in Las Vegas!", "Date": "May 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Sequim, Washington", "Title": "“Great Beds and Close to Convention Center”", "Author": "tootsie24", "ReviewID": "UR103927825", "Content": "My husband and I found ourselves unexpectedly staying in Vegas due to a late flight. We found the Marriott through a last minute Priceline \"name your own price\" deal, and could not have been happier with the quality of the room for the low price we won. The room was spotless, well stocked with great bath supplies, had thick luxurious towels, and the bed was awesome! We were very thankful for a low key and quiet place to sleep. We saw other hotel guests, but once in our room we heard nothing! Front desk service was pleasant and helpful, and we were upgraded to a suite at no extra cost. The hotel is off the strip, and not where we would usually stay for a trip to Vegas. However, it is a short walk to the convention center and would be perfect for business travellers. There is a restaurant and bar on site, although it was closed when we arrived, and they provide room service during select hours. Only a couple little things kept it from getting the \"excellent\" rating. 1) Soda/snack machines not working so I had to buy a 4 dollar soda and 12 dollar snack mix at their gift shop.(We were starving!) 2) The housekeeper entered our room in the morning while we were showering/dressing, without knocking. (She thought we had checked out)", "Date": "April 13, 2011"}, {"Ratings": {"Overall": "1.0", "Rooms": "4", "Service": "1"}, "AuthorLocation": "San Diego, California", "Title": "“Subpar Customer Service”", "Author": "cmbg34", "ReviewID": "UR101555337", "Content": "I stayed here for a business trip in August 2010. My reservation had a special rate, but the front desk lady would not let me check-in because I didn't have the proper ID to secure the rate. I informed her my coworker who would be arriving, would have the proper ID and paperwork for both our rooms. She said there was nothing she could do. So I sat and waited in the lobby for 45 minutes for my coworker to arrive. As soon as my coworker arrived, another front desk associate was helping him and didn't ask for any ID or paperwork at all. My coworker is also a Marriott Rewards member, either silver or gold, so he was being treated very well. I come up behind my coworker and start talking to him and all of a sudden the lady who would not let me check in says she was looking for me and would've let me into the room and checked ID later. Well lady, I was sitting in the lobby the whole time and not once did you ever make an effort to look for me. YOU ARE A LIAR and full of BS. Not to mention, you never checked for ID or paperwork later. This experience made me appreciate Hilton Hotels so much more. They have never hassled me and not let me check-in with the special rate. The rooms themselves were very nice, but I would never come back here because of the way I was treated.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Roseville, California", "Title": "“Best Business Hotel in Central Las Vegas”", "Author": "drichrx", "ReviewID": "UR83746102", "Content": "The rooms are all suites and spacious. The room includes a coffee maker, mini-fridge but not a microwave. The rooms were very clean. The free parking garage is security-gated with room key and is very close to the elevators. As with all Marriott properties, it is totally smoke free. Not being a gaming hotel (no casino or slots), makes this ideal for business travelers and is very close to the convention center. Elite Marriott Reward members (Gold/Platinum) get a free local calls, internet, and a full buffet or cooked-to-order breakfast, that is one of the best hotel buffets I have been in outside of a casino, including plenty of fresh fruit, lox, and hotel-made corned beef hash. Only disadvantages include not close to anything walking (except convention center and Pieros). I have stayed at many hotels in the Vegas area, and this is one of the best. I highly recommend it.", "Date": "October 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Illinois", "Title": "“Amazing stay!”", "Author": "luv2teach02", "ReviewID": "UR83060215", "Content": "First time in Vegas..loved it. My husband has travel points with Marriott, so we stayed free at the Las Vegas Marriott. At first, I was a little disappointed not to be right on the strip, but we were maybe 3 blocks from...definitely walking distance and also walking distance to the monorail by the Convention Center. What was especially nice, was that it was quiet at night. The staff, from the restaurant, to the hotel desk, were so very nice and helpful. The suite was absolutely beautiful and very clean. Love all the night life and the excitement, but like my sleep and a nice hotel. So if that is what you are looking for, I highly recommend the Las Vegas Marriott for your stay.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Marietta, Georgia", "Title": "“Recommended for business travelers”", "Author": "terryjgardner", "ReviewID": "UR80414215", "Content": "The Las Vegas Marriott on Convention Center Drive is located 2 blocks east of Las Vegas Blvd and 1 block west of Paradise Road. The hotel is comfortable and has a restaurant with a bar. As of 9/12/2010, breakfast and internet connectivity are free for Marriott Rewards Platinum members. Parking is free. The restaurant is inexpensive (for a hotel in Las Vegas) and serves burgers, salads, clubs, in short, nothing very fancy. Breakfast buffet is good (much better than dinner). This hotel is excellent for business travelers, not so much for tourists to the Strip because of its location. Hotels right on the strip offer better locations at reasonable prices if one looks hard enough.", "Date": "September 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Washington, DC", "Title": "“Stayed here on 2 occasions recently for a...”", "Author": "yastreb", "ReviewID": "UR76117755", "Content": "Stayed here on 2 occasions recently for a conference. First the bad then the good: hotel is in need of a makeover, its a bit beat up. First room I stayed in had a rattling a/c unit and banged up furniture. Probably worst parts are no wireless! No Starbucks, and 12.95/day for wired Internet via Ethernet cable. I know the Vegas economy is hurting but come on. Now the good- great staff who bend over backwards for you. They easily accomodated my request for a feather free room on an upper floor. Also made change at front desk, quick check in, good service in cafe. On my 2nd stay there room was better w/ quiet a/c. Passes as a business hotel but not a 4 star Marriott. Still, if you want to stay away from the casinos and strip it'll do. Close to aerial rail and transport. Staff were great.", "Date": "August 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "The South", "Title": "“Average Hotel”", "Author": "atlantic2580", "ReviewID": "UR73073180", "Content": "Stayed here while on business and this is an average hotel. For a Marriott hotel, I expected more. The hotel was small with a rectangular shape. When I first entered my room, I could hear footsteps going all across the room above me. I could hear TV blaring from the room next to me. In the morning, I could hear the guy next to me coughing and hacking up a storm. The doors to others rooms would slam really hard, shaking my own room's door. There were only 2 bath towels availabe and a handful of wash and hand cloths. Since I was by myself, it wasn't a big deal. But if you have more than 1 person staying, it won't be enough. There was no WIFI and the wired internet ($13/day) was intermittent and slow. The fridge was small and there was no microwave. I noticed the staff seemed bored and seemed to not want to be there. I was supposed to stay there 6 nights, but checked after the 2nd night and stayed at the Springhill Suites across the street. I would not recommend this hotel.", "Date": "July 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Laie, Hawaii", "Title": "“Good, but no free internet”", "Author": "JordiLSLC", "ReviewID": "UR68197314", "Content": "My friends and I stayed here when we were in Vegas for a few days. We enjoyed the room it was very spacious. My biggest complaint was the fact that for internet you had to pay $13 for 24 hours and it wasn't even wi fi, only an internet cable. However the staff was very accomidating, we had an overflowing toilet thanks to some rather spicy Mexican food, and the clean up crew was in within 2 or 3 minutes. Overall a very nice place to stay", "Date": "June 21, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Tucson", "Title": "“Nice hotel, very low key.”", "Author": "rablab", "ReviewID": "UR63884631", "Content": "Stayed here w/ daughter fro soccer tournament. Quiet except for drunk knuckleheads Saturday night - almost got to the point of calling downstairs Banged around a little bit at 6:30 am as we had to go early haha. Big, nice rooms, clean, tv is very dated, frig. Step off elevator right into nice little bar. Close to convention center but not much else. Hilton nearby is a real dump but that's another story. Right next door to best restaurant in Vegas.", "Date": "May 11, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Cedar City, Utah", "Title": "“DO NOT STAY HERE”", "Author": "Buttercreamgirl", "ReviewID": "UR62686787", "Content": "The staff actually denied one of my companions entry into the elevators. They demanded her ID and when she said it was in the room they wouldn't go with her to get it. She slept on the lobby couch and the manager thought that it was funny. She was a registered guest. This was the single worst experience I have ever had and I stay at alot of hotels. Never the Marriott again.", "Date": "April 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Austin", "Title": "“Great Hotel next to Convention Center”", "Author": "ghostwriter6699", "ReviewID": "UR61771045", "Content": "I don't write long reviews but here are the salient points. Stayed there while attending the National Association of Broadcasters Convention 1. Rooms were large and clean. A little disappointed that they still used the older television sets and not the LCDs. But rooms were fresh and clean. 2. Breakfast Buffet in the morning was great. 3. For Gold/Platinum level guests we got free Breakfast buffet, free internet, free local/long distance phone calls. In fact they allowed me to have myself and three guests for free for breakfast for being Platinum. 4. Hotel was 5 minute walk from Convention Center 5. Had really nice bar (no slots which was a big plus) 6. On site restaurant is typical hotel food/prices 7. Work out room OK. Pool and Jacuzzi nice/clean but avg 8. Hotel was very clean 9. Wait staff was superb. Excellent service 10. NO concierge lounge 11. Walking distance to many good hotels and casinos I will stay there every chance i get. Perfect location if you don't require a hotel with a casino in it. Quiet, friendly, one block to the strip.", "Date": "April 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "NC", "Title": "“Not as nice as it use to be.......Many changes.”", "Author": "GardeniaNC", "ReviewID": "UR55283050", "Content": "Use to be my favorite hotel in Las Vegas but has been slipping dramatically for the last year. Don't get the rooms located over the kitchen. Your room will fill with the fragrance of breakfast being cooked around 6 AM and the aroma will engulf your room and spoil your sleep......Your clothing will smell like bacon. This would be on the 2nd floor at the end of the hall. Getting hot water for these rooms is also a challenge as I don't know if the kitchen sucks up the hot water or what the problem is exactly..........At times you will never get more than just barely warm water. So the hot water and the air intake into a couple of these rooms is a problem no one should have to endure at a hotel. The last few months........housekeeping now only leaves 2 full bath towels........2 hand towels.......2 face cloths. The bath towel quantity is workable.......but really........what woman can survive on 2 hand towels and 2 face cloths.......in Las Vegas with all of the going out for business and then pleasure..........more linens should be provided for guests........don't assume this is enough for your female guests. I've never been to a hotel that provides guests with these few amounts of linens..........so call the front desk in advance before you will need them or you'll have to wait a while. There use to be real coffee makers in the room. Gone. Some cheap plastic gizmo that brews 1 cup of coffee and taste like the plastic tubing and not coffee........possibly not healthy. No more Newsweek magazines or USA Todays by your door. This is no big deal........but another step down. Have noticed my vanities or bed tables or desks don't appear to be wiped down after the last guest. The menu prices have gone up and the bar is rarely open after 11pm. I've always had a good breakfast in their restaurant. Most daytime employees seem very friendly and happy to work there........a few late night employees leave alot to be desired with customer service.......not as professional in understanding a weary travelers needs or concerns. Staying at this hotel use to be a wonderful experience...........but the last year.........it has changed.....alot. At this point I would recommend.......... with reservations.......... would inform what to expect or not to expect.", "Date": "February 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Hammonton NJ", "Title": "“A loyal Marriott follower was not disappointed”", "Author": "BPInto24", "ReviewID": "UR49191566", "Content": "I decided to take my daughter to Vegas for her 21st birthday prior to a work trip to LA. I read a number of reviews and had very little surprises. Let me start with the thing that I would have changed with my trip. I would not take the Monorail. We choose the 3 day pass for 30.00 each and would have been better saving the money for cabs. Even if its .2 miles away it was not convenient, fine for the day and sneaks but if you are all dressed up with heels, and at night the street was a bit scary. We arrived early but our room was available in less than an hour. Gold membership allowed for breakfast (big reason I paid for my stay) figuring that a $20-30 saving on breakfast took the cost of the room down to $70-80. We were allowed to choose off the regular menu plus the buffet made it very nice. Didn't need a suite although it made it a bit roomier. Pool was satisfactory for me but my daughter needed a resort feel so we cabbed it the JW Resort about 15 minutes away...WOW what a beautiful place. When we explained why we were there one of the Marriott hosts actually bought us our first round of drinks. What a nice touch. Overall I was pleased with the Marriott Suites, The JW Marriott day trip and the whole Vegas experience. We loved the NewYork NewYork Casino.", "Date": "November 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Long Beach,CA", "Title": "“Nice hotel off the Vegas strip”", "Author": "LonnaLinda", "ReviewID": "UR46839923", "Content": "Hotel was very nice and clean. The pool is rather small and does not offer a view. If you want to be close to the convention center then this is a perfect option. It is about 3 blocks from the Vegas strip closest to the Wynn/Encore hotels. Close by (5 minutes) is a Wallmart if you need to purchase snacks/sodas. Marriott Gold and Platinum members get a free breakfast buffet at ths hotel - excellent buffet. Marriott Springfield Suites is opening up in mid October which we could see from our hotel and appears to be really nice with what I believe pool is located on the roof..", "Date": "October 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "california", "Title": "“BEST HOTEL IN LAS VEGAS!!!!”", "Author": "pestlie", "ReviewID": "UR46763474", "Content": "I just returned from staying at this hotel and continue to think this is the best hotel in all of Las Vegas. I stay here several times a year and love the fact that there is no casino, no smoking and the rooms are in fabulous condition, not to mention the service is awesome and genuine (unlike gaming hotels). If you are looking for a comfortable, quiet and safe hotel, this is it. I dislike the \"big box\" hotels because they are difficult to navigate, stink of smoke, are noisy (especially when the drunks return to their rooms at 3am) and are far too expensive. This is the best hotel!", "Date": "October 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Royal Oak", "Title": "“Great stay away from the casinos”", "Author": "Fivetotravel", "ReviewID": "UR46149428", "Content": "Stayed here for the convenience to the Las Vegas Convention Center. Easy trip from the airport (about 15 min). Liked the layout of the room, very spacious. Pool is very small, but clean. Rooms were spotless. Beds are the best (love Mariott beds). Right across the street from the monorail. Easy to get anywhere in Las Vegas. Internet was too expensive, so I used the business center, 3 computers, printers, and very secluded for conducting business. All in all a good stay.", "Date": "October 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "2", "Rooms": "5"}, "AuthorLocation": "Cooper City, fl", "Title": "“Excellent for the price...”", "Author": "kamaway13", "ReviewID": "UR37197786", "Content": "I stayed from May 28th through June 2nd, I visited Las Vegas for business, I wanted to stay away from the strip, I didn't want to be bothered with the crows nor the gambling, I was able to find it in this hotel, the room are spacious, very clean, staff was very courteous as well. If the above mentioned is what you are looking for this is the place for you, since the hotel is a little away from the strip, he rates are great.", "Date": "August 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Location": "1", "Rooms": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“Not so great”", "Author": "sush81", "ReviewID": "UR35948285", "Content": "It is off the Strip and is a little old. The restaurant has limited items and the waitress who served us was bordering on rude, but the food was very good. While most of the breakfast was good, when I reached for a doughnut I found fruit flies climbing in or out of it. While the layout of the room was great, the tile in the shower was cracked and broken in one place. As a platinum member, I was asked if I wanted the space of a lower floor suite or a suite with a view on a higher floor. I chose the view and ended up with a suite that faced away from the Strip. For what I paid, I was expecting much more. Just a little disappointed I guess. I think this would be a great place to stay in if you are visiting Vegas on business.", "Date": "July 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Asheville, North Carolina", "Title": "“Nice quiet hotel just off the strip - no gambling”", "Author": "Roaming_Fool", "ReviewID": "UR34581260", "Content": "Perfect business hotel for not being distracted by the gaming industry of Vegas. About a half mile off the North strip. Rooms are nice and clean, hotel is walking distance to the Wynn, Hilton and Riviera, convention center and monorail. Parking is free and you can walk to the Denny's in about 10 minutes if you don't want an overpriced hotel meal (only real complaint -why hotels, like movie theatres, feel the need to overprice the food). No gaming machines in the lobby and the pool was nice too.", "Date": "July 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Carpinteria", "Title": "“Best Event Staff Ever\"”", "Author": "Hard2please88", "ReviewID": "UR34029780", "Content": "We had our convention at the las vegas marriott suites. Unlike most hotels their convention center is on the top floor, so that you have a great view of all of las vegas from the meeting room. It is like having a convention in a penthouse suite. It is the perfect size for your under 100 people convention because everything you need is right there on the top floor, and it is small enough so that you take over the hotel and really make it your home. The best part of this hotel is the staff. Just the highest level of service I have ever seen... Rudy Robles is in charge of events and he went way beyond the call of duty to make sure everything went as smoothly as possible. Gary (i don't know his last name) did a great job with the catering, as did Blanca and the other staff. We were here for 10 days and I literally don't have a single complaint. I recommend this to hotel to everyone....", "Date": "July 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Best Choice for Convention Center Business”", "Author": "nyuszi", "ReviewID": "UR29262550", "Content": "This hotel is a great choice for any kind of convention center business. The rooms are enormous and quiet; there's no casino, bar or really restaurant; and you can walk to the convention center. All of the rooms are quite large, many with door separating the bed room and the living area. I found the bed very, very comfortable, with a good selection of pillows. The bathrooms are also spacious and quite nice. The internet is only $12/day (Though I think it should be an included utility like water or A/C, this is not as much of a rip off as many other hotels). Parking is free. The downside is that there's no real restaurant, casino or bar and it's way off strip, so it's a terrible choice for a wild time or even mild mannered tourists. The showers are also midget height, which a small annoyance that feels magnified when you are trying to get yourself going for a full day of work after a full night of Vegas.", "Date": "May 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Redondo Beach, California", "Title": "“Average location = Average Stay”", "Author": "Spillthemoment", "ReviewID": "UR27616222", "Content": "Stayed at this location for one night. Nothing fancy, your average \"airport\" type hotel. I wouldn't recommend staying here if you are looking to visit the strip, too far to walk... but it is close enough to the Convention Center that if that is the only reason you are there, well I guess it's not a bad place to stay.", "Date": "April 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "MA", "Title": "“Super clean,very nice staff”", "Author": "flightlady", "ReviewID": "UR26816004", "Content": "Very clean hotel, such a nice staff. Not only to me but to everyone who came ot the front desk or restaurant. Helpful with local touring. Renaissance, located one block away, could have cared less about my scheduled stay with them even though I am Platinum Level Marriott Rewards. Renaissance was quite rude. Marriott Suites were just super! Will stay again.", "Date": "March 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Quinton, Virginia", "Title": "“Great location for Convention Center; good hotel”", "Author": "EJPVA", "ReviewID": "UR25387083", "Content": "This hotel is not on \"the strip\" -- which is NOT a bad thing! It offers nice suites at a reasonable cost and is easily accessible to the LV convention center and transportation. The hotel is well maintained and the staff was exceptionally helpful. While not inexpensive, the breakfast buffet was one of the best I've seen anywhere...it was always fresh, clean, and well supported, and offered fresh cooked eggs to order. It does not offer a casino, which means it's quiet and business-friendly. Nice bar, and the suites are very comfortable with lots of room for a business person to spread out!", "Date": "March 1, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "2.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Beverly Hills, California", "Title": "“Ordinary”", "Author": "traveler4k", "ReviewID": "UR21990407", "Content": "Great for Priceline. There are many pluses and minuses of this property. PLUSES: 1. Location: Behind the Wynn and across the street from the Las Vegas Hilton makes it an easy walk towards the north end of the strip. 2. All suites: These are all suites and very comfortable but also tiny in size. They each have two televisions (not flat screen, so out-dated) and french doors that separate the living room from bedroom. The doors only have lace curtains, so if you are booking this to have privacy, forget that idea! Minuses: 1. Location is difficult to get to airport after stay (they do not have a shuttle to strip either). Cab fare is about $18.00 one way. If you are bidding on Priceline, you may want to spend a little more and try to get a hotel on the strip if you are looking into this property. Find out what hotels you may end up with at www.biddingfortravel.com. 2. The suites are a bit small and do not have flat-screen televisions. 3. Fitness Center is really limited 4. Lobby and all is small. It feels more like a 3 star hotel, rather than 3.5 star. Overall, I had a couple of problems with the stay but the staff was decet about it. I would recommend this property if you get a deal, otherwise, stay at the strip. If you are debating this over the Hilton across the street, I would go with this one. It is nicer and smaller (less hectic). I paid $62 + tax on Priceline for a 3.5 star hotel by the way. It was selling online for $199 + tax (which is rather crazy high I think for this type of hotel). Overall, it was fun though and the hotel was decent.", "Date": "November 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Newport, OR", "Title": "“oved the Suite Space”", "Author": "CaboSisters", "ReviewID": "UR21758153", "Content": "My husband and I stayed here for 4 nights spanning Halloween. I booked an attractive price for air and hotel @ Hotels.com. Staff were gracious; our room was as shown with superior bedding. It even offered a compact refrigerator beyond the cooler/ stocked bar. If you are motivated, it is only about 2 blocks from the newer monrail at the Convention Center stop so you can travel the Strip without a cab. We had a car. The hotel features sufficient parking, most behind a security bar. Next door, we had a quite good formal dinner at Piero's--much like the remnants of the Rat Pack days with a strong Italian vein and superior wait service. If you're looking for an oversized pool, book elsewhere. For us, it was more family and friends catch up time elsewhere, so fun in the sun was not an issue and the smaller, quiet pool was satisfactory for a couple hours. The hotel has an early check in link with our Alaska flight, complete with printed boarding passes. Ask about other air carriers if of interest. Also, there's a business center on site. I recommend that unless you know your way around well, that you bring printed directions from Mapquest or simlar source from the Rent a Car center which is not at the Airport. It added extra time relying on Hotels.com directions. Bottom line: If you are not a Party Hard type and want something of a break from that vibe, Marriott Suites will get you a very decent room and pleasant stay.", "Date": "November 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Florida", "Title": "“Nice quiet and spacious hotel”", "Author": "Florida_traveler000_", "ReviewID": "UR21198355", "Content": "The hotel is about three blocks from Las Vegas Blvd. (keep in mind one Vegas block is really more like 2). It's nicely decorated, clean and roomy. You have a separate living room space which is nice. I got a great rate because I was there with a convention. From the hotel, it's just a quick walk to the convention center. We ate breakfast in the hotel one morning - it was a bit pricey. The next morning we went to the L.V. Hilton across the street where the buffet was MUCH better and MUCH cheaper. If you stay here I highly recommend doing that.", "Date": "October 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "2"}, "AuthorLocation": "San Diego", "Title": "“Internet is a rip-off, but otherwise very nice”", "Author": "CyrusL", "ReviewID": "UR18135463", "Content": "I would rate them 5 stars (at the convention rate I received) if internet were free, but they wanted $10 per day (noon to noon) and the building is not within range of an open WAP. With business class Internet well under $200 / month, their cost per room night is probably under 5 cents. $10 is an annoying chisel which I refused to pay. I might concede a dollar or two per day, but would still be annoyed. The rooms are well appointed and have a circular flow pattern (living room, bedroom, sink, shower + toilet, and back) which is a welcome change from the usual shoebox configuration. The mattress was very comfortable and the pillows were pretty good, just slightly too firm for me. The combination of a thin sheet and heavy comforter left me feeling hot-cold; yes, I could have run the room temperature down to say 60 F with the very capable AC but that felt like a huge waste of energy. There are no slot machines in the hotel which I consider an advantage. The pool is a bit small for a serious swim but fine for cooling off or for kids.", "Date": "July 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bakersfield, CA", "Title": "“Another Great Stay!”", "Author": "btowndude", "ReviewID": "UR15694467", "Content": "I stayed here April 22-25 for my fourth stay. I was attending a multiple day sporting event at the nearby Las Vegas Convention Center. I was assigned to room 1406 - one of the room that does not have a wall separating the living room from the bedroom. As a result, there was only one television and very limited storage. Without the french doors, the sounds from the hallways were very apparent. I am a late sleeper and was very aware of all the early risers, who allowed their doors to slam shut at 6 am. The televisions have not been updated to the newer flat screen models, but everything else in the room was very satisfactory. Love those Marriott beds! I will stay here again.", "Date": "May 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Buena Park, California", "Title": "“Great Hotel and Location”", "Author": "cruisinkitkat", "ReviewID": "UR13720458", "Content": "We booked this hotel via Priceline bidding. I was very happy with this choice. I couldn't have picked it better. The room was great. It is big. It had a room with a bed and TV with french doors that closed. It had a small living room with a TV. The bathroom was in two parts, with the toilet and shower/bathroom in one room, then the next room had a vanity, so it was great for putting on makeup. The bed was one of the most comfortable beds I have ever slept on. We gave our maid a tip each day and the room was perfect every night, with little extra shampoos, lotions, etc....(it was from bath and body works, yeah). We didn't eat at the restaurant so I can't comment on that. The parking was easy, it was only a few steps to the elevators to the rooms. We did use the monorail at the Convention Center, we walked over there at night and it was not a long walk, maybe 5 minutes, the crosswalk is right up the block, cross over and walk up to station and hop on monorail. The area was safe, never felt uncomforatable walking around in the evening. I will stay here again. Loved it!", "Date": "February 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Worcester, MA", "Title": "“Marriott Suites - an island of sanity in Las Vegas”", "Author": "SiouxSue", "ReviewID": "UR12013227", "Content": "I'm not a big casino fan (not a gambler or smoker), so I wanted to avoid staying at one when I had to be in Las Vegas for a convention. I've almost always been happy with Marriotts, and this one was no exception - a typical business-like, clean, and comfortable Marriott. As a woman traveling alone, I usually find Marriotts are good hotels for me. The rooms are all compact suites, with separate very small living rooms. Small refrigerator, sink, coffee maker setup, and nice desk in the living room. Comfy bed with too many pillows and a big comforter (to use in the air conditioning?) - better than too few pillows, though. Good points: * Easy walk to the main convention center (although if that's why you're staying there, the Marriott Courtyard is much closer). * Easy walk to the Monorail so you can get to the casinos and other attractions easily. * Quiet, not smoky, no slot machines (etc.), and not really a \"Vegas, Baby!\" kind of place * ATM in the lobby when you need cash (small fee, of course) * Small bar and restaurant in the lobby. Small disappointments: * Extra charge for Internet connection * VERY short ethernet cable for the Internet connection (found hanging in a small bag in the closet), required that you stay seated at the desk. As long as I was paying anyway, wireless would have been preferable so I could have been sitting on the couch if I felt like it. * No in-room safe. * No airport shuttle. (the cab was $15 w/tip) * No concierge. * No cabs on site (the cabs work for the casinos i Vegas), but the door man didn't seem to have trouble flagging one down when a guest needed one (but the weather was good and none of the giant conventions was happening during my visit). * Bathroom towel bars not in logical locations for someone using the shower I met friends for breakfast at the MGM Grand every day, taking the Monorail to meet them at 7 a.m. NO ONE was in the Monorail stations or on the train itself as I traveled to the MGM Grand. Apparently no one in the city starts work that early. Boston, NYC, etc. would have been hopping at 7 a.m. A little weird... Not glitzy, not glamorous, etc. But, if I go to another convention at the Convention Center, I'll stay here if I can.", "Date": "December 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Porto, Portugal", "Title": "“We loved the Marriott”", "Author": "PortoExplorer", "ReviewID": "UR11250354", "Content": "We stayed 3 nights because we got married in Las Vegas. Great room, king size bed, clean. Shower problems at first (In Portugal, shower system is different). Staff very friendly. Loved Vegas, Loved the Hotel... of course... We married Vegas!", "Date": "December 4, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Pleasantly Suprised!”", "Author": "cactuspal", "ReviewID": "UR10235427", "Content": "This location, a short walk from the Las Vegas Convention Center and a Monorail stop, is not near the Strip. The suite rooms are all non-smoking and ours was quite comfortable and clean. A nice touch is the french doors between the bedroom and sitting room. We used the outdoor hot tub and pool; both were clean and towels were provided. We did not eat in the hotel, but at a very good Greek restaurant in the next door hotel for both dinner (because of a late evening arrival) and breakfast (because the evening meal was real Greek food and wanted to try the morning meal). We usually stay on the Strip, but this time was on business with a group, and were concerned, but this Marriott we can now recommend.", "Date": "October 22, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Colorado", "Title": "“Excellant hotel/great service”", "Author": "Broder", "ReviewID": "UR10041278", "Content": "We stayed for 2 nights in late September. The hotel is non-smoking with no gaming. The rooms were extremely clean, good amenities, great bathrooms, very comfortable. Great bed. The staff was excellant and tried to meet our every need. The front desk staff was friendly, outgoing and always smiling. No long lines at check in or check out. We enjoyed coming back at night to a quiet environment and being able to get away from the smoke filled casinos. The only problem was that the breakfast restauarnt on Saturday morning was very crowded and the hotel did not have sufficient staff to handle the customers. Our waitress was still pleasant and did her best. We have a child who just moved to this area. I would absolutely stay at this hotel again.", "Date": "October 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Orlando, FL", "Title": "“Good Value”", "Author": "TravisMT81", "ReviewID": "UR8841706", "Content": "This was our second hotel in our 4 day Vegas trip. It was a great value considering we used a buy one night get the second night free coupon. Check in was swift and we had a nice suite facing the strip. One thing I must say is that it was a small suite, it was like they were building the hotel and then they decided they would make it a suite hotel. The bed was great and it was nice to have a seperate sitting area. They had recently did a soft rehab with the new marriott colors. One thing I would suggest is that they get LCD tvs and take those tv armoirs out, it would give the room so much more space. WIth all that said the service was great, they comped our internet access and sent up our Platinum welcome amenity at the time we requested.", "Date": "September 22, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Los Alamos, New Mexico", "Title": "“Pleasent stay overall”", "Author": "lib88", "ReviewID": "UR8367856", "Content": "Stayed here for a 6 day conference in a different hotel and was pleased overall. There were a few negatives. If you are up late, the early risers will wake you up with just the closing of the doors, never-mind noise in the adjacent rooms. Room quality is different, even though the front desk staff claim that each room is the same, ours did not have a wall divider between the bed area and the living area, even though I had asked for that before arriving at the hotel and again at check in. The room a few doors down did have the wall divider. The pool was very small, but probably what should be expected for an off strip hotel. The positives are the house keeping was incredible. They cleaned the room every morning while we had breakfast, without appearing to be waiting for us to leave the room. Housekeeping did a great job in the quality of their cleaning as well. The rooms are big and the furniture is relatively new. The beds are the incredible Marriott standard, and the bathrooms is nicely appointed. Far better than many of the hotels on the strips at the same cost. The breakfast was top shelf. As an elite member, the buffet was free, but I would have paid for it at the cost of $12.99. The selection was great at the buffet and they would make food made to order like omelets, waffles, french toast, or pancakes. I will be staying here again.", "Date": "August 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbus", "Title": "“Very Very nice non-casino hotel”", "Author": "Girlfriend2u", "ReviewID": "UR8064286", "Content": "If you want a non-casino hotel, in a quiet, but convienient location, with an excellent friendly staff, and awesome rooms, then this is the hotel for you! This hotel is close to all the Las Vegas strip attractions, but worlds away! I have never been disappointed in a Marriott, and this was no exception. It was wonderful. And a nice added touch is when you go to the elevator, there is a huge water tank filled with water, ice, and lemon rings, with cups next to it. I couldn't help but get a cup of ice water with lemons each time I passed by. It was really refreshing. Also the monorail is steps outside, making it convienient to the strip.. I would highly recommend this hotel for those like myself who like non-casino hotels!", "Date": "July 5, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "4", "Location": "1"}, "AuthorLocation": "peru", "Title": "“never stay here”", "Author": "mlitvo", "ReviewID": "UR7753731", "Content": "We have just arrived from las Vegas. If you are travelling for visit never stay here. First it is really like 4 blocks from the strip. Street is lonely, near low category hotels and many solicitors. I have stayed in many marriotts (fort laud. aruba, cancun, miami, orlando etc.) This is the worth. We stayed for 7 nights and our room was not clean up three times. The first time I called they said the privacy card was outside, (not true) We went out about 11:30 am. The second time it was very late, I called the manager. He was so rude. So next day I called customer service at marriott and they talked with the manager who call us to talk with us. We explain this lady what happened. You wont believe it that night when we came back (our last night) the didnt clean the room. AMAZING!!!!! The pool is really smalll, we never use it. At night when the dinning room was close.It is near the elevators it really smells bad like food or grease. Only one person at reception,No bell man This hotel really was a disaster for us!!!!!", "Date": "June 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Glendale, California", "Title": "“Very good value”", "Author": "Wootie", "ReviewID": "UR7485575", "Content": "Stayed three nights at the Marriott Suites in Las Vegas. Clean, nice and very convenient. We had a lovely suite on a high floor. Parking was a breeze. The staff was really nice. The food isn't very good there, but the service was excellent. We didn't want to be on the strip and this served our purpose well. The little refrigerator (not the minibar) was nice to have. The sofa was comfy. No complaints. Very good value.", "Date": "April 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Clearwater, FL", "Title": "“Loved the Marriott suites but location could be better”", "Author": "DrCro", "ReviewID": "UR7414987", "Content": "Excellent quiet hotel near the vegas strip but must take taxi to any sites. Taxi rates aren't bad and they will flag the taxis for you. No slot machines in the hotel and it is near the convention center. If you like to escape the noise at night, this is the place for you. If you want to be constantly in the action choose a place on the strip. Check in and out is a breeze and the rooms are very nice.", "Date": "April 22, 2007"}], "HotelInfo": {"Name": "Las Vegas Marriott", "HotelURL": "/ShowUserReviews-g45963-d111712-Reviews-Las_Vegas_Marriott-Las_Vegas_Nevada.html", "Price": "$144 - $213*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">325 Convention Center Drive</span>, <span class=\"locality\"><span property=\"v:locality\">Las Vegas</span>, <span property=\"v:region\">NV</span> <span property=\"v:postal-code\">89109</span></span> </span> </span> </address>", "HotelID": "111712", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/bc/9d/bc9d5cf43b964c773b943f1a7bc90cdb1large.jpg"}}