{"Reviews": [{"Content": "Excellent Service; Friendly, Accomodating Staff; Great Value We took the bus from the main train station to the hotel. The hotel is located in the midst of a lovely olive grove, which is a wonderful setting, but that means the bus stop is not close to the hotel. If you have cumbersome luggage, be prepared for a tedious 10 min. hike. Aside from the jaunt from the bus stop (which they cannot be faulted for since their setting is delightful), we have absolutely no complaints about the hotel. The staff were accomodating and acquired reservations to the various museums for us upon request. We dined once in the evening at the hotel's restaurant and enjoyed the entire meal. They even let us sit by the fire place with our wine after the restaurant had closed down - they just asked that we turn out the lights when we left. The hotel rooms and living areas are furnished like a home - cozy and inviting. To top it off, the price is a steal. We highly recommend Villa Rondini (oh, and you can get great views of the city from the hotel gardens and grounds).", "Date": "Dec 31, 2008", "ReviewID": "UR983414049", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Peachymoz"}, {"Content": "Tuscan Friendliness       View from Villa (5 mins away from main hotel)", "Date": "Aug 4, 2008", "ReviewID": "UR700330056", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Bellavox"}, {"Content": "D茅cevant   showReview(18376150, 'full');", "Date": "Jul 29, 2008", "ReviewID": "UR917918835", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Aurea07"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d1119480-r23130170-Villa_Le_Rondini-Florence_Tuscany.html", "HotelID": "1119480", "Price": "$337"}}