{"Reviews": [{"Content": "Temple Lodge - Stunning Place. We stayed at the Temple Lodge for a week in September this year. What a beautiful place! The lodge is situated at the top of a cliff that provided us with the most magnificant views of Bali's west coast line and beyond. Each morning we would gaze out at the ocean and think about how lucky we were. There is a lovely family feel to this place. Christiana and Mario went out of their way to make us feel welcome and each morning and night we were treated to the most delicious and healthy food that had been prepared by them from the freshest ingredients. Having the family's pets onsite only added to the warm and homely atmosphere of the place. If you are looking for something that is ultra modern, super chic and possiby 5 star - then this isn't the place for you. This is an eclectic place - each room has it's own interesting and quirky architecture that is both rustic and charming. I never felt as though I was 'roughing it' - quite the opposite - I felt very spoilt and indulged - whilst also experiencing the sound of the sea and nature. This place is a little hard to find - but not impossible. The roads are a little rough - but again not impossible - more so they add to the seclusion of the place. Sometimes the monkeys can be a little pesky - as this place is situated on a cliff - the monkeys do like to come and visit. It's not a big deal - you just need to be a bit mindful. We loved this place and would go back in a heartbeat. It was very difficult to leave and after the serene nature of it - arriving back in Seminyak was a little difficult. Can't wait to go again.", "Date": "Oct 6, 2008", "ReviewID": "UR344620388", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "javodog"}, {"Content": "Loved the Temple Lodge -- Didn't Want to Leave! I stayed at Temple Lodge for six nights, as part of a yoga retreat group. Our group occupied the entire lodge for the week. Temple Lodge (also known as 鈥淢ario鈥檚鈥? is situated on the top of the cliffs overlooking the beautiful Indian Ocean, on the west coast of the Bukit Peninsula of Bali. The surf breaks of Impossibles, Bingin, and Dreamland are all visible from the Lodge. As Temple Lodge is on the west coast, we were treated to the most beautiful sunsets every single night. There were also whale and dolphin sightings on some days. It was easy to just gaze out at the ocean all day!The rooms of Temple Lodge appear in real life exactly as they do on the resort鈥檚 website. Each room is different, but they all share an interesting, rustic look and feel. Meals are cooked from fresh ingredients daily by the owner and staff, and were absolutely delicious.Here is a list of what I considered to be the positives of Temple Lodge:鈥?The gorgeous views of the ocean and proximity to the beach. If for nothing else, stay there for the views!鈥?Delicious healthy meals prepared by the owner.鈥?Friendly staff.鈥?Interesting architecture. Each room is different, yet all share the same unique style.鈥?Owners鈥?pets on site. I loved seeing the dogs and cats hanging around, as it promoted a homey atmosphere. 鈥?The pool was in an ideal location, also overlooking the ocean. It warmed up to a nice temperature during the day.鈥?Overall, the rustic, low-key nature of the place allowed me to truly relax.I must note that Temple Lodge is not a luxury 5-star resort. If this is what you are after, you should probably look elsewhere (Ritz-Carlton, etc). For completeness, I will list the items that you should be aware of if you are considering a stay at Temple Lodge. I did not think they were negatives per se, but someone expecting a more luxurious experience might.List of potential negatives (although I was not bothered by these):鈥?Plumbing: The Lodge is set on a cliff top in a remote area of Bali. Hence, the plumbing has its quirks. For example, the shower in my room had very low water pressure and would alternate from cold to hot to cold. Since it was 30 degrees Celsius most days, this didn鈥檛 really bother me. 鈥?Rooms are Open-Air , with No Doors: My room鈥檚 door was a bamboo shade that could be rolled down for privacy. I loved my 鈥淐liff Room鈥?because I could hear the ocean at night. However, since nothing locks shut, a few people had 鈥渧isits鈥?from the local troop of monkeys, and had items stolen (face cream, tooth paste, razor). It is a good idea to keep any items in a secure location if you think they are of potential interest to monkeys ! 鈥?Bumpy Roads: Again, the remote location means that access is sometimes bumpy.Overall, I loved my stay at Temple Lodge and I would definitely return. I was truly relaxed.", "Date": "Oct 2, 2008", "ReviewID": "UR599144072", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "amp88"}, {"Content": "Worst Experience Ever We had our stay at the Temple Lodge booked for us through Lorraine and Jon Nield at Bali Retreats. When it came time for us to visit Bali, we obviously contacted Bali Retreats directly for more information.To start, Bali Retreats was the most disorganized, unprofessional travel agency we had ever worked with. They were VERY slow to reply, unhelpful, and at times downright rude. This must be run out of a home in Australia by a couple that just had an interest in the field - they were usually unreachable, always unhelpful, and just plain peculiar. If you do choose to work with them, Lorraine is by far more courteous than Jon. I would go through 4-5 e-mails over a week before I heard back a curt reply from him (happened twice!).But, this review is mostly about the Temple Lodge. It is a beautiful hostel in a a beautiful setting. Now, here are the problems:1) We were told we would be picked up at the airport, but their driver had found a friend to pick us up and his friend was 2 hours late... while we waited at the airport being told by phone that he'd be right there.2) The rooms were dirty3) There was no way in or out of the hostel- taxi drivers didn't know it... and if you ask for a taxi to pick you up, you take your chances. We asked Mario, the owner, for a taxi at 9 PM and he said he didn't know whether it could be done.4) No water pressure, minimal hot water and none in the evening.5) Mites. Yes, we came back one night to a cat in our bed and about 200 ear mites scratched out onto our pillow and sheets (about a 3 foot area). No, there isn't a front desk or an evening maid. No, there wasn't anyone but us to try to take care of it. No, there wasn't clean linen available.6) Very scary owners. Mario got really angry when we suggested that our bed had been dirtied by the cat the night before and we wanted clean sheets. Really. He started yelling at my 5'1 wife. When we picked up our luggage to literally run out of the resort... yes, he chased her! He screamed expletives and physically threatened her. Maybe it's a cultural thing, but I've never seen anyone act like this!So, not a good experience all around from Bali Retreats or Temple Lodge in Bali. The view is great, but there are lots of views in that area for half the price that are *safe* and *clean*. The Temple Lodge is neither.", "Date": "Jul 30, 2008", "ReviewID": "UR472049799", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "2"}, "Author": "AdventureTravel1"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g294226-d1122064-r20678193-The_Temple_Lodge-Bali.html", "HotelID": "1122064", "Price": "Unkonwn"}}