{"Reviews": [{"Content": "home away from home I have stayed in Union Square, Nob Hill and now Jackson Court in Pacific Heights. This was the absolute best. This felt like a home away from home. The managers were unobtrusive, but were there if you needed them. The location was beautiful. We combined lots of walking with cabs. Union and Filmore Streets have wonderful boutiques..much more unique than Union Square. The views are amazing. I was there with my 2 daughters and we all loved it.can't wait to return!!!!", "Date": "Oct 21, 2008", "ReviewID": "UR505469504", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "janes1053"}, {"Content": "A wonderful place to stay! We stayed at Jackson Court for 7 nights in July 2008, in the Blue Room.We thought this was an excellent place to stay. The location was lovely - Pacific Heights is a quiet residential area and Jackson Court is only a 5-10 minute walk from some really lovely shops and restaurants on Filmore Street. It is not close to downtown or Union Square which is partly what makes it so lovely! It is easy to get to these areas by tram or bus. We are reasonably fit and pretty much walked everywhere from Jackson Court.The room was very clean and spacious, and the decor was lovely. We used the free internet connection okay and the bed was super comfortable. We arrived very late - after 1am - are were still given a very friendly greeting by the night staff.We particularly enjoyed the breakfasts - you help yourself in the kitchen and can either take it to your room on a tray or there is space for 4-6 people to eat in the kitchen. There was a fresh fruit salad, cereals, yoghurts, bagels, muffins and toast.Overall, I thought this was an excellent place to stay - the price is quite high but for a treat I thought it was worth it. I would definitely stay there again, and would definitely recommend it.", "Date": "Oct 17, 2008", "ReviewID": "UR155641127", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "HappyHappyH0lidays"}, {"Content": "Fantastic place!!!!       red room", "Date": "Nov 11, 2007", "ReviewID": "UR184137872", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "gepmo"}, {"Content": "Great Place A very special day , I proposed to my fiancee. Could not have choosen a perfect place,very private and quite. The staff were professional and helpful. The place is very classy and the decor tasteful.We stayed in the Garden Room and we loved it so much. Luckily the weather was great and we enjoyed the private deck.", "Date": "Mar 21, 2007", "ReviewID": "UR546529170", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "1", "Rooms": "-1", "Location": "-1"}, "Author": "jemaecj"}, {"Content": "Only so-so This BB is in a beautiful old mansion in a great part of town (Cow Hollow) with many shops, restaurants, and cafes within walking distance. The room was comfortable but the bed was too soft.However, there are a few problems. The place is looking a little shabby and needs new wall paper and a new coat of paint. Parking is very hard and once we found a spot, we didn't dare move the car. The breakfast was a joke: a carton of juice, some Philly cream cheese, and sliced bread out of a bag. No fresh based bread, no fancy cheeses or fresh squeezed juice.Overall, I expected a little more at this price.", "Date": "Aug 10, 2006", "ReviewID": "UR891719252", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2", "Value": "2", "Rooms": "4", "Location": "4"}, "Author": "Czernobog"}, {"Content": "Great Place We have never stayed in a Bed  Breakfast before. This was a very wholesome experience. Made us feel at home even better. The staff are great and very helpful. We enjoyed having breakfast with other guests, met new friends. This place is a keeper and we look forward to returning.", "Date": "May 26, 2006", "ReviewID": "UR759188099", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great Place The place was great. Made us feel right home. It truly is a home away from home. The decor was wonderful not overwhelming. The Staff are excellent ;very knowledgeable and helpful.We sure will be back.", "Date": "May 9, 2006", "ReviewID": "UR126176745", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "rooms need a facelift despite a fabulous location and a vintage building oozing w/charm, the rooms need a renovation. we've been staying here 1-3X annually for the past eight years, and our last two visits have been disappointing: mildew in the shower, old carpet on the bathroom floor, general musty feeling, thread-bare furniture. we hope they follow our advice, because we'd very much like to return.", "Date": "Aug 12, 2005", "ReviewID": "UR477063654", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great area I was unaware when I booked this hotel that is was a true bed and breakfast. When we were escorted to our 3rd floor room I was a bit worried as I really am not into antiques,etc but really it was a very nice hotel in an excellent location. The service was very good, the evening tea was nice and it was very quiet throughout the hotel. Breakfast was average but you don't get a meal included anywhere in SF and taking it up to our room on big trays was nice. They do need to update the televisions.The area is great for shopping and eating- Chez Nous is really good and it is a very pedestrian friendly area.", "Date": "Jun 26, 2005", "ReviewID": "UR805294235", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "larkoolaw"}, {"Content": "one of a kind Truly one of a kind, this wonderful mansion turned into a bed and breakfast is like no other. The wood panel parlor invites you to sit and have (complementary) tea with the other guests. We loved the morning breakfast with plenty of yummy options to choose from. The rooms are all diffrent and extreamly spacious. The staff was more than helpful in suggesting fun things to do in the city. We highly recommend this BB to anyone!", "Date": "Feb 26, 2004", "ReviewID": "UR852967895", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "what a great idea!! This was my first time at a BB, it was great! they treat you like you are a visitor in their own home. The house was decorated like people actually live there. the staff is helpfull and curtious without being in your face. They had a tea time and a large breakfast in the mornig. I love the Jackson Court. I'll never stay in a hotel ever again. I highly recomend this great treasure to everyone!", "Date": "Feb 17, 2004", "ReviewID": "UR889967925", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great stay, great staff A very quaint bed and breakfast. Gives you the feel of home. The vintage design of the building is reminiscent of the historic Victorian days of San Francisco. The staff was very courteous, and very helpful.", "Date": "Feb 13, 2004", "ReviewID": "UR582218518", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Wonderful, quiet getaway We just LOVE the Jackson Court! Its a neat old historical manision in the most pristigious neigborhood in San Francisco. We have visited every year since 1998, and stayed in 5 of the 10 rooms. They are all beautiful but if you want to really treat your self, the garden room is the most magnificent of all. The staff is really nice and make you feel like a V.I.P. They really extend them selfs to make you feel comfortable. The breakfast and afternoon tea makes it just perfect! We highly recomend Jackson court to anyone looking for a nice peaceful place to stay in San Francisco.", "Date": "Feb 5, 2004", "ReviewID": "UR402939289", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Home Away from Home Enjoyed our stay. It was truly home away from home. Charming BB in an upscale neighborhood. Excellent service and the staff are just gracious.", "Date": "Feb 5, 2004", "ReviewID": "UR283748597", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Loved the Jackson Court My husband and I had a wonderful long weekend at the Jackson Court. The service was impeccable. The innkeeper was fabulous and recommended wonderful restaurants nearby and great walks and activities for the days. I truly felt like royalty, staying in a friends mansion in Pacific Heights.", "Date": "Aug 12, 2003", "ReviewID": "UR454313061", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Pourquoi pas   showReview(19325371, 'full');", "Date": "Aug 25, 2008", "ReviewID": "UR690450852", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "5"}, "Author": "Nina075"}, {"Content": "Freundlich und famili盲r   showReview(15576281, 'full');", "Date": "Apr 5, 2008", "ReviewID": "UR100276274", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g60713-d112311-r21065344-Jackson_Court_San_Francisco-San_Francisco_California.html", "HotelID": "112311", "Price": "$220"}}