{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Do not Choose this hotel for your stay”", "Author": "V J", "ReviewID": "UR127524962", "Content": "I stayed in this hotel for easter weekend. The service is really bad. Nothing is near this location.You won't feel you are staying in Marriot. There is no breakfast buffet. The housekeeping will replace only few things in bathroom. The refrigerator in my room was n ot working, infact it was a refrigerator converted in to closet. when I complained, the staff told me that I am on wait list. Wait list to get a refrigerator and that too when its n one of my fault. Wow, that's Marriot, I can't belive. All tall buildings nearby and no city life to see. If you are planning your vacation for few days and want to visit Universal/disney and hollywood tour, I suggest you take hotel near hollywood. That will be much convenient and better for sure.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Lots of sorrys but bad service training”", "Author": "Alanverrell", "ReviewID": "UR127379541", "Content": "I write this review whilst still in the hotel half way through my visit. 1 first night after a long international flight we went to our room and we found we needed an extra blanket I sent my daughter down to reception to get one she was told there were some in the room there was not, we were to tired to go down again turned up heating. Next morning on the way out again asked for a blanket we're told that we would get one also told reception about bedroom doors sqeaking in room was told this would be fixed came back that day no blanket and still queaky doors. Next morning went for shower no shampoo replacement, wet I searched through suitcase and found some. Later that day I came back to the room (still queaky door) and decided to have a sleep I put do not disturb sign on the door about one hour later I was awoken by the phone it was receptionist to tell me engineer was at the door to fix squeaks (it goes on I kid you not ) I rang to speak to general manager to complain I got man named cris I asked if I could speak with him (he did not offer to come up to me) he said he was in reception so I told him I would be right down, when I got to reception I was told he was on the phone after waiting a few minutes he came out and introduced himself and got my name wrong ( I only talked to five minutes before and I got his name right) . Conclusion so far Staff need retraining by competent management . Now I feel better", "Date": "April 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Silicon Valley, CA", "Title": "“Nice Downtown Hotel, friendly staff”", "Author": "3ecrm", "ReviewID": "UR127340206", "Content": "The hotel is very nice, with good location in downtown, easily accessible by freeway on bus, without walking distance to Staple Center, many restaurants nearby. The room was large, comfortable bed. Couple of things wish that could be improved: - the work desk should be replaced: it has two level, neither was good for a laptop - couple of lamp plug should be replaced, you can see the wire and metal connector, kind of dangerous - wish there could be a night light in the bathroom, - more blanket: if you turn off A/C / heater, it could be chilling during night. - set the A/C temp reasonably: when I came in the A/C was set to 65F, freezing and not very environmental friendly. The staffs i met are super friendly, from the cleaning lady, front desk, to bell, all very nice.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Needs some spiffing up”", "Author": "JayW913", "ReviewID": "UR126111779", "Content": "I should be clear: I slept well, I didn't feel that the room was dirty and service was great. The hotel is dated, though. The lobby appeared to be more updated to Marriott's current standards. The rooms remain in early 1990s finishes. The bathroom finishes are an extreme example of this. I don't know if renovation is under way or not. Let's hope it is, because the location is great. Not to hard to walk to virtually anything downtown and freeway access is a snap. The gym will be an issue regardless of renovation unless some simple fixes are made. The gym faces generally west. If you like an evening workout... bring your sunglasses. The windows have no shades.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Good location and service, but dated”", "Author": "Alex L", "ReviewID": "UR125763626", "Content": "I was in town to watch a LA Kings game and also wanted to be near some friends living in Santa Monica so I found this property which ended up being cheaper than some of the Courtyard and Residence Inns in the Santa Monica area. But yet this Marriott is more central than the airport locations. The valet parking and check in staff were all very courteous and welcoming, and the lobby area is spacious and impressive as well. However, the rooms were not up to par for a four star property, as the rooms look like they have not been updated since the 80s. On the bright side, the rooms were still clean, and the concierge lounge provided excellent views of the downtown core. It's also close enough to the Staples Center so that you can walk to catch a game and go to the restaurants and bars in the area, as well as the Walt Disney concert hall.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Johns Creek, GA", "Title": "“Rooms a Motel 6 would be ashamed of”", "Author": "ValueTraveller09", "ReviewID": "UR125628779", "Content": "In serious need of renovation or halving the price. Threadbare filthy carpet with ancient furniture. No amount of lipstick will make this pig attractive.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“A grand hotel”", "Author": "Marrowboy", "ReviewID": "UR125468070", "Content": "On a coach trip and the standard of this hotel was certainly higher than others we stayed in. In a good location for the metro system in L/A which is very cheap. Had two breakfasts here, one a good quality English breakfast and the second an expensive but out of this world quality granola breakfast.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Hospitality done right!”", "Author": "amazing475", "ReviewID": "UR125351875", "Content": "Our family felt spoiled during our stay at this property. Wonderful hotel experience...from the informative agent that fielded my questions before our arrival to the follow up call from the front desk confirming we received our roll away bed, our family made the right choice booking this hotel. My sweetheart and I enjoyed a romantic dinner in their restaurant (the steak dish was incredible and the martini's delicious!)...our waiter's service standard was consistent with the quality experience we enjoyed from all the hotel staff. The sleeping room was spacious with comfortable beds and high thread count bedding (important for my lady). Location was perfect for access to all the beach areas and Hollywood/Sunset Blvd hot spots. Looking forward to our next stay at this hotel...it's clear these guys know what they're doing.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Madrid", "Title": "“One night stay in downtown LA”", "Author": "Gsemelas", "ReviewID": "UR125142777", "Content": "Overall the hotel was good. Still find it incredible that Marriott charge around 12USD for 24hr WiFi access...when you are paying about 200 usd for a room, the least they should do is include it in the rate. The breakfast was very good. Great service and freshly cooked omeletts. The gym was standard, but sufficient.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "north america", "Title": "“Way overdue for renovation”", "Author": "duckfisney", "ReviewID": "UR125062226", "Content": "Stayed here twice so far this year, looks like the place hasn't been touched since the 70's. Well they do have flat screen TV's but only analog SD and in the wrong aspect ratio. Also this place is at the top of the list for worst food in a full service marriott concierge lounge!", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bellevue, Washington", "Title": "“Adequate hotel, in need of an upgrade”", "Author": "Sean J", "ReviewID": "UR124979589", "Content": "This marriott is in a nice downtown location, and could be a great hotel with a major rennovation. The good things about the hotel 1. Nice concierge room, with PC and printer for elite members 2. Free internet for elite members 3. Nice fitness room 4. Nice pool bad things about the hotel 1. It's old and has not been rennovated for a long time", "Date": "February 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "West Pittston, Pennsylvania", "Title": "“Nasty Marriott”", "Author": "dad113056", "ReviewID": "UR124914139", "Content": "Below average liquor choices, food that is below average even for a Hampton Suites, in the consigers lounge. The bathroom had corrosion around the shower stall. The shower head placement forced me to hug the wall. Rooms also need a facelift, old smelly carpets everywhere. If the client was not paying for this room I would NOT stay there. Compared to other Marriotts in the area this facility is a loser.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Texas", "Title": "“Great Service and Well Maintained”", "Author": "Graygab1", "ReviewID": "UR124572357", "Content": "Stayed here during my trip to the 2012 Grammy Awards. The hotel has been well maintained and the service was optimal! People at the front desk were quite pleasant and very eager to assist you with your needs. The rooms are very spacious with wonderful views of downtown L.A. Linens are crisp and very fresh. The rooms were clean, free from odors, and everything was in working order. My room had ample pillows and the bed slept wonderfully. The showers are large with excellent water pressure and it gets hot! I took a 45 minute shower and the water temp stayed the same. Concierge service on 11th floor with good continental breakfast. Kinda pricey, unless you book on priceline or have rewards points. Awesome location!", "Date": "February 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "iowa", "Title": "“definitely needs a face lift in rooms”", "Author": "prs174", "ReviewID": "UR124362849", "Content": "cavernous hotel in downtownLA. very nice service experience. I was upgraded to a junior suite which i appreciated. suite faced the highway and highway noise was defeaning and could barely be muffled with a sleeping machine. the other was that the carpet had significant stains. room was old and needs an upgrade.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Durham, North Carolina", "Title": "“Rather Average Experience”", "Author": "charlierdu", "ReviewID": "UR124131310", "Content": "I spent a night at the Downtown Marriott this week. It was a thoroughly average experience. I might have thought a bit better of my stay if the first room I was assigned hadn't been used earlier in the day by someone else. As I was settling into the room it slowly became clear I was not the first one in the room that evening. A food wrapped in the wastebasket, two room keys on the bed, a breakfast coupon in another name on the desk. The highlight though was the half-drank Dr. Pepper on the bedside table. This prompted a call downstairs. While the desk clerk was apologetic, the manager who called me back simply moved me to the room next door. He \"knew that one was clean\" which was reassuring. But reminded me why I usually stay at a Hilton property. I would have expected something a bit more conciliatory than simply sending up a key for the adjacent room as a note of recognition they had checked me into a room already assigned earlier in the day. The room itself was typical Marriott -- you know when you are staying at one of their properties. The location is decent if you need to be in downtown LA. Not much going on around it at night, but you are in the middle of things. There was nothing remarkable about the hotel or the service. It was certainly adequate for my purpose, but I would not choose to stay there again anytime soon.", "Date": "February 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Nice Spot”", "Author": "BajaD716", "ReviewID": "UR124046801", "Content": "My husband and I had the pleasure to stay here the evening of a concert. We were not disappointed in the hotel. The rooms are large and well appointed. It is a nice weekend getaway. The LA Market is a great restaurant. Not much to do after concerts are over, but all in all a very nice spot.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Sleep Quality": "4", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Michigan", "Title": "“lacking security, unsafe”", "Author": "Lauren M", "ReviewID": "UR123769935", "Content": "My first stay was in 2010 and this was my second time staying here. They're still supposedly going through a renovation process although I haven't noticed any changes. Rooms are old, outdated and drab although my bed was comfortable. Breakfast buffet area is my favorite part about the hotel. They cater to both American and Chinese tastebuds and serve a large variety with a station serving fresh waffles, pancakes, omelettes, eggs. Also the servers are friendly and quick. And that's about all that is good with the hotel. The location sucks, not that I'm too fond of DT LA to begin with. My biggest gripe is the lack of security. They have ONE security personnel that oversees the entire property! This is downtown L.A. where the homeless are everywhere, and apparently including the inside of the hotel lobby. You would think people at the hotel would notice them walking in and say something. When I asked about the homeless woman walking around in her socks, they said they would not approach her because she might have been a guest. Well that woman ended up attacking me, and guess what, she was homeless. I guess one security officer would have been fine if they had cameras monitoring the property 24/7. But again, nope. They have cameras that only rotate around. Useless. Needless to say, I will not be staying here again.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“Love the Staff”", "Author": "GeraldR5", "ReviewID": "UR123757193", "Content": "Okay, it's not the most modern, luxurious hotel in the world. But the warm, friendly staff more than makes up for it. It is clean, comfortable and has every amenity I need. I have stayed there three years in a row and have been comfortable, relaxed and treated about as good as it gets. Many of the staff members have been there for years, and they remember returning guests. It's an amazing experience. Sure I hated the expensive parking. But that's downtown L.A.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Thousand Oaks, CA", "Title": "“Good staff/location.....refurbishing on the way”", "Author": "2008travel", "ReviewID": "UR123045137", "Content": "I stayed one night at this hotel while attending a conference. I arrived at 7am and asked the friendly staff at the front if early check-in was possible and they quickly arranged for a room without missing a beat. Throughout the stay I noticed the professional and warmness of the staff. The location is perfect for all things relating to downtown Los Angeles. It's a 10 minute walk to the Museum of Modern Art, Disney Hall and Music Center. Or you can walk 15 minutes the opposite direction to the Staples Center. A major weakness of the hotel is it's dated rooms. Although they were very clean and have nice views. The lobby area displayed panels showing the plans for a major restoration so improvements seem to be on the way", "Date": "January 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Not Marriott standards from anywhere”", "Author": "Creasians", "ReviewID": "UR123030913", "Content": "No problems checking in to checking out and the location fantastic too but the property does not measure up to be called a Marriott property from any angle. Starting from the elevators (prehistoric) to the worn out and faded carpets in the hallways and guest rooms, it gives a feeling this place needs an overhaul first to even qualify to be called a Marriott.", "Date": "January 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Great Location Downtown LA”", "Author": "65Sharon", "ReviewID": "UR122558578", "Content": "This was our first taste of hotels in USA after a long flight from Australia. Room was available on arrival around 8am and friendly/helpful porter delivered luggage to our room. Staff were very helpful. We had high floor room so no traffic noise and found beds really comfortable and room well decorated. Close proximity to Downtown LA so great for sightseeing. We had tickets to a college football game at LA Coliseum and hotel very handy for short taxi ride. Taxi rank straight outside hotel. We hired a car the next day and the Hertz desk was right beside the hotel reception. Hertz customer service officer was very helpful when he arrived, as we had to wait for simply ages for him to come back from wherever he was.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Big rooms, need to be refurbished NOW”", "Author": "mojo2012oovajay", "ReviewID": "UR121864115", "Content": "Stayed there only one night. The spacious lobby and friendly service was a great start. However the room, spacious as it was, was a BIG letdown. The furniture, carpet, curtains, etc. are all 40 years old and unfortunately confirm the grungy/dated/worn/incongruent decor which was used by a previous reviewer.", "Date": "December 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Carmichael, California", "Title": "“Nitpickers, stay elsewhere”", "Author": "perpendxular78", "ReviewID": "UR121679281", "Content": "I must say it was quite shocking (even though I was expecting it from reading reviews prior to departure) to see the condition of the rooms here. A complete room redo is obviously way overdue, no doubt about it. I would of expected to have seen such shaby fixtures say at an airport property somewhere off the beaten path, but in downtown Los Angeles? All this said though, I must acknowledge that the room was clean, the bed was comfortable, and the saving grace at this hotel was the great service. The limited F&B options were a bit disappointing ( only one lounge? .. no coffee kiosk ?? ). All in all, we had a nice stay and hope to return as the location for us was perfect. Hopefully our next visit will wow us with new rooms.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "San Francisco, California", "Title": "“Grungy, dated, worn, inconvenitent shower, and incongruent redecorating.”", "Author": "FoodWineSFBayArea", "ReviewID": "UR121307402", "Content": "I stayed here one night with a colleague. Both rooms had the same corner-style shower that was terrible, the showerhead is a quasi-rain shower and it is oriented such that the spray escapes when the shower door is open making a mess and a slip hazard. The oncongruous redecorating starts in the bathrooms - nice looking marble tiles, porcelain tubs, stone covered vanity contrasts with the showerhead height s-extender and poorly designed shower. The contrast continues in the room with odd louvered wooden doors to the closet (two doors operate and then a third is affixed to the wall), stained carpet that looks dirty, older style window coverings that were dirty, an eighties-style lamp (somebody confused Miami Vice with real art deco). The wooden furniture's styling is supposed to carry a theme from the lobby fails because it clashes with the carpet style, the usual Marriott bed linens (contemporary, not deco), and generic lamps. The lack of any furniture beside the beds (no nightstand) sharpens the incongruities. Beds seemed old in that the mattresses appeared to be cheaper than those usually in a Marriott and were on older-style metal frames - not comfortable. A few good things: room on the freeway side of the hotel but I did not hear the traffic, the staff was very helpful when it came to directions and finding out whehter our chosed eatery was still open, and the check-in and out were easy (the TV check-out worked), the sleep-timer on the TV worked, and the iron and ironing board appeared to be clean.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Phoenix", "Title": "“Nice hotel, expensive parking”", "Author": "Soniab13", "ReviewID": "UR121090227", "Content": "I stayed in my room for only a few hours - my travel plans had changed but I had pre-paid for the room so I went there while on an extended layover from LAX. The room was large, but it did face the freeway and was pretty loud. There wasn't anything \"stand out\" about it - fairly typical for a Marriott - but nothing bad either. There was in-room coffee - but only enough for one person. It was surprisingly cold that day but the room's heater worked fine. My only disappointment was with the parking. I explained to both the valet and the person who check me in that I'd only be there for a few hours, but they still charged me the full $35 (\"anything over 2 hours is $35\"). Then when I checked out, the person said, \"Oh if I had known you were only here for a few hours I would have suggested you park in the lot across the street - it would have been less expensive.\" Grrrr. And I'm pretty sure it was the same person that checked me in.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Diego, CA", "Title": "“Very comfortable in the middle of L.A.”", "Author": "Lakeside31", "ReviewID": "UR120818359", "Content": "We traveled to LA for an annual conference held once again at the Marriott. Were we surprised when some of the staff recognized us from last year, and said hello! All of the staff, from housekeepers to the front desk to the concierge, were very attentive and helpful. The king room was nice, and the bathroom was large but the lighting was mostly around the mirror. The hotel is about to go through a remodel, and the update will help. It's not shabby now, but a refresh helps everyone, right? Note: I no longer eat at the restaurants in the hotel. The food is expensive and mediocre. The lunch buffet is around $17 and consists of baked pasta, salad, rolls, veggies and not much else. I'd much rather eat in one of the nearby restaurants (the front desk can give you a list).", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mendocino, California", "Title": "“Downtown Los Angeles Marriot”", "Author": "DeirdreLamb", "ReviewID": "UR120787532", "Content": "The first room they gave me was right on the 110 freeway, and very loud and on the north side of the building so cold. Within minutes of looking at it, the front desk was very accomodating and moved me to a room on the southern side of the building that was very quiet. The sun streamed in the morning, and the bed was very comfortable. This hotel is very clean and well designed, and has a good restaurant downstairs called the 333 which is was a little pricey, but worth not having to go anywhere. They also have a cocktail lounge for a drink by the pool or in the bar. The bartenders are nice and knowledgable of the area.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bernardsville,NJ", "Title": "“Friendly Staff”", "Author": "LCW21", "ReviewID": "UR120776109", "Content": "We were here for 5 nights with a Road Scholar group. Did not find any traffic noise (6th floor) even though surrounded by busy roads. Yes the hotel is older - but think it offers good value for the money. Marriotts always offer decent size rooms in my experience. All the Staff friendly and welcoming - we especially commend all the Staff in the breakfast room with friendly and enthusiastic service.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Very good value, excellent service!”", "Author": "Jacqueline_Cambodia", "ReviewID": "UR120413391", "Content": "I stayed there for a few days in October. Yes, the decor is dated and the location on a busy intersection is not ideal (which means hearing traffic even from the 10th floor). But the service at every point of contact won me over, from the concierge, to the front desk to the restaurant. Cordial, helpful and warm. Cleanliness throughout was a plus. Our group rate was excellent making the overall value very good. .", "Date": "November 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Pune, India", "Title": "“Best one at Downtown LA”", "Author": "varunjain22", "ReviewID": "UR120411573", "Content": "Mariott group of hotels definitely do a great job for hospitality and service. This one located in the cross section of downtown LA and very close to the shopping areas make it a perfect choice for your stay. The metro rail is just across the street and one has easy connectivity to the other parts of the city. The breakfast spread was awesome and we had a huge variety to choose from. Considering I am a pure vegetarian, the hotel staff had some options available for me. Recommended for a holiday at LA for sure...!!", "Date": "November 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Colchester", "Title": "“In the heart of shops”", "Author": "Beaver25", "ReviewID": "UR120330609", "Content": "I stayed for a couple of nights the middle of October and found the hotel to be quiet although sited on a busy intersection. My only conmpalint is they do not cater for tea drinkers (the English, Australian & Asian peoples tastes) as there were no teabags in the rooms only coffee. Across the bridge on the 2nd floor of World Trade Centre there is a delhi that sells good cheap breakfast and lunch plus the hotel next door (glass building) they have a food mall where you have a selection of food from around the world that is cooked fresh and you can eat on site or take it away.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Nice hotel but on a very busy intersection.”", "Author": "Pebbles-Advisor", "ReviewID": "UR120083205", "Content": "A nice hotel but if you use the pool you will need to be aware it is next to a busy intersection so its rather noisy. The rest of the hotel is double glazed well so it does not affect your sleep. Location is ok for Hollywood and Universal studios about 5 miles. It is in the financial district so aimed at business people.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "fraser coast qld aust", "Title": "“nice place”", "Author": "jeanmac6", "ReviewID": "UR120006422", "Content": "we stayed there for 3 nights while on a Cosmos tour. The room was big, clean and the pillows to die for. The lobby had iced water available all day - very welcome as the heat was about 110 d in the city. Only complaint -NO teabags and for Aussies that was a no no. However a call to housekeeping provided enough to keep us going until we could find a market. We ate from the bar menu - plenty enough for two of us.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pontypridd", "Title": "“This Marriott is superb- don't believe the negative comments!”", "Author": "grouchob", "ReviewID": "UR119857370", "Content": "Don't believe the negative comments!!! Stayed here for total of 4 nights in August this year as part of an Archers Direct extended tour of California etc. The reception area is very impressive, vast, and stylish. The rooms were excellent- well furnished clean etc. Staff very friendly - front of desk man was hugely supportive and helpful when it emerged that our return flight to UK via New York was compromised by the impending hurricane. Only criticism is that there is not much of a bar culture in this hotel. (But this is common in Amercan hotels) - it tended to be very quiet around the bar after 10 'clock. The food was a little expensive but come on these are hotel prices and there were plenty of alternative eateries around e.g. in the nearby Bonaventure building. So highly recommended!!", "Date": "October 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Saratoga Springs, New York", "Title": "“Good with room for improvement!”", "Author": "Kim D", "ReviewID": "UR119792501", "Content": "Just recently stayed at this hotel with my husbnd who was on a business trip. The location was great for him since his convention was not far (still about .8 mile walk to the Convention Center and the Staples Center.) Since this was more of a vacation for me the location was not as good. In order to go to any \"touristy\" areas you need to get in a car a drive 15+ minutes. Very nice lobby with a nice bar. We only had breakfast at the hotel which was great. We had a suite which I am giving mixed reviews. I had no complaints with the bedroom - very nice. The living room was very dissapointing. It was very sapcious and was all windows so the views were great but the furniture was a disaster. The sectional sofa looked like it had been in someones basement and the fabric on the chairs looked like a cat had gotten to them. It was nice to have the room but did not feel comfortable sitting on the furniture in that room. I will say that the staff at the hotel were above and beyond friendly - especially the group of people taking care of the cars.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Berkshire", "Title": "“Good Location, but Tired”", "Author": "sleekpeek", "ReviewID": "UR119360888", "Content": "Location of this hotel is good as its nearby many restaurants and transport links. The main communal foyer area has the wow factor, but thats it. The rest of the place could do with a major refurbishment, its dated and tired. The lifts are slow, the furniture in the rooms are old fashioned, however the 4 piece bathroom was huge. One of the Cosmos/Archers Direct hotels on the Western Wonders tour.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Boston", "Title": "“Stay elsewhere!”", "Author": "ADCBoston", "ReviewID": "UR118764426", "Content": "This is a very disappointing Marriott! The entire hotel is long overdue for a refurbishment. Furniture and carpets are old and in poor repair. But, even worse, is the poor customer service. No real concierge. Front desk tried to help us with restaurants in the area but weren't personally familiar with any. We sat in the lobby lounge for 20 minutes for a cocktail and were never approached. And, as with previous poster, we were never offered help with luggage. Maybe a visit from Bill Marriott...", "Date": "September 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "mk", "Title": "“Comfortable Hotel”", "Author": "sasha011", "ReviewID": "UR118625418", "Content": "I stayed here with my husband for three nights when we were travelling around California. It had a nice large reception area where you can also check in for your flights online at the reception desk. They do room service although is quite expensive. There are plenty of eating places not far from the hotel so cheaper to eat out. Over the road in the hotel on 4th floor there is a food court where they are various take-away shops and restaurants anyone can eat in. Room was large enough with large TV and large windows so get a good view. Had a shower and seperate bath with iron/ironing board/hair dryer and coffee machine which can also be used to heat hot water for hot etc, although there were only herbal tea bags supplied in the room. If you want to use the wi-fi internet you have to pay and they do have a swimming pool outside though we never had time to use it! Overall a nice comfortable hotel", "Date": "September 26, 2011"}, {"Ratings": {"Location": "4", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Alexandria, Virginia", "Title": "“At the right rate, a decent downtown hotel”", "Author": "Allen W", "ReviewID": "UR118115783", "Content": "A busy hotel during the day with lots of meetings and conferences. Very quiet at night. Unlike the other posters, I was thrilled to not have to wrestle my bag away from a bellman, there were none to be found. Lobby is huge and clean. My Queen room was large, clean and reasonably well maintained. It took 10 minutes to figure out how to open the door of the in-room safe (pull the key straight up and a big steel plug will come with it permitting one to open the door). Breakfast buffet was typical and typically overpriced. The bar was small, but the food available was excellent and reasonably priced. For $123/night (government rate), a good deal for downtown LA.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Ok downtown hotel, nothing special”", "Author": "helsinki_finland2008", "ReviewID": "UR117859659", "Content": "+ Ok location in downtown (but not the best, you have to walk to get any where) + Clean + Pool side nice (exept the trafic noice) - Rooms average, nothing special - Car rental desk service slow", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "San Diego, California", "Title": "“I left early!”", "Author": "jacquie m", "ReviewID": "UR116825588", "Content": "Horrible service 1) no one EVER offered to help carry my bags to my room - the valet put them on a cart and just rolled it into the lobby (happend with 2 other people I went with too). And I had a lot to carry as I was there for a convention. 2) room service = lukewarm food 3) Valet lost my keys 4) upon checkout I told them the issues I encountered - the \"supervisor\" didn't even say sorry or thank you as I left. AWFUL", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Redlands, California", "Title": "“Nice hotel, VERY nice people!”", "Author": "Sophiemichaels", "ReviewID": "UR116432591", "Content": "I took my daughter here because we were going to see a play at the Ahmansen Theater. First of all - if you're looking for a place to stay because you're going to a show there or any other venue in the area, it's perfect. We had a nice safe, short walk to the theater. Good thing, too - with the high price of parking at the hotel! That's the thing about this Marriott: You will pay a pretty high price to stay there, and you'll pay a lot for everything else too! The internet, water, and the usual high room service and hotel restaurant prices. But it's easier to pay a lot when the people serving you are so nice and friendly. From check-in, to the gift shop to the people working the lobby food/drinks, everybody was warm and welcoming. I really like the big open-air lobby, and the burgers (we had the sliders in the lobby and a cheeseburger for room service) were TERRIFIC. The beds were way comfortable, lots of big fluffy pillows. Very quick and efficient valet service (It cost 30 bucks a day, though!) In short, this is a great business hotel, if the company's paying your expenses! It's a nice place to treat yourself for a quick overnighter for a show. But staying there for a week for leisure purposes - too much money for a stay in a financial sort of district.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "4"}, "AuthorLocation": "Durham", "Title": "“Fine hotel but overpriced for what it was.”", "Author": "Vislor_Turlough", "ReviewID": "UR116044245", "Content": "When I stayed at the hotel there was an anime convention in town. The hotel was full of people dressed as their favourite characters which was marvellous to see lots of young people enjoying themselves and revelling in it. As for the hotel it was fine for what it was but really was overpriced. The room was adequate if not spectacular for a hotel of this type. It was clean, tidy and presentable. The breakfasts were expensive for what they are and the meals in the hotel were pricey. No problem as I dined out and there are plenty of decent restaurants in the vicinity. There is a pool and a lounging area which is nice but it is adjacent to a main road so the noise is pretty much a nuiscance. It also did not help that on the Saturday night there was a rowdy party outside which went on til 4AM and in spite a call to reception requesting it to be toned down it was not. I guess the hotel was happy while they were spending and they already had my money. Service could be patchy, when good it was excellent, when poor it was painful but the staff still expected to be tipped. I only tip good service, I do not tip people for doing their job badly.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Buenos Aires", "Title": "“as expected”", "Author": "specklesparkle", "ReviewID": "UR116015032", "Content": "I stayed here when I was in LA on business. The conference was at the LACC so was a good location (walking distance) to that. As you expect at the Marriott, the service was very good, the bed was great, and the pool was nice. The decor could use a bit of a lift, but other than that can't fault the experience. If you are in LA for a holiday, I recommend staying on the beach, not in downtown.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Santa Maria, California", "Title": "“hotel is terrible”", "Author": "sarahruthc", "ReviewID": "UR115690185", "Content": "We were lied to about them having rooms with 2 beds. We were lied to about being able to reserve a adjoining rooms. The rooms are old and outdated. There in NO Jacuzzi and the pool is tiny. The rooms service is very expensive. The 30$ a day for parking is a joke. The lobby is nice but that is about it.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "San Diego, California", "Title": "“Average. Lobby Is Nice, But Rooms Are Dated”", "Author": "NatalieAnnGarcia", "ReviewID": "UR115591250", "Content": "We stayed here for the weekend as this was the hotel that was close to the venue of the wedding we were attending. It is a Marriot which has all the general luxuries of that franchise, but the individual rooms were a bit old, cramped, and all around dated. They rooms were clean and the staff was nice, but this location is no longer in its glory years. Towels aren't as fluffy and new, and they seemed to skimp on towels. I think 2 bath towels was in my room. I have a lot of hair, so I need lots of towels. Room service was quick and decent. They estimated a 45 minute turn around, but out food came in about 20 minutes. All in all, I wouldn't make the trip to stay here for the weekend. But for the price and the location downtown, it's worked for what we needed that weekend.", "Date": "July 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Aalter, Belgium", "Title": "“Not too bad but rather old looking for its price.”", "Author": "SabbeRubbish", "ReviewID": "UR115543105", "Content": "Been here on a business trip. Good bed, many amenities, friendly service but the room and especially its furniture has seen better days. Try to get a good price and you have a good downtown place to stay. The inevitable nightly noise can't be avoided downtown, but I got to sleep quickly.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Hotel deserve a B-”", "Author": "Robandwilson", "ReviewID": "UR115376345", "Content": "We stayed at Marriott Downtown LA at the end of a tour, After staying at numerous hotels along the west coast we were quite happy here, The room was great with a good view of downtown. The bed was comfy it was meant to be a queen but was only a double and the bathroom really nice had really nice toiletries Wifey loved the lights on the mirrors! it gave a little HOLLYWOOD glam to the hotel, Whilst the Hotel is a little bit dated the rooms were clean and tidy, and the location was great, so whilst not perfect it is still above average, would I recommend it to someone who wanted to stay downtown LA, YES", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "San Diego, California", "Title": "“Average, a bit dated but clean & comfortable”", "Author": "JenniferRose8", "ReviewID": "UR114984871", "Content": "Just stayed here one night, in town for a concert at Staples Center. Overall a nice, average hotel. Easy to get to, good location downtown just off the freeway. @ a mile away from Staples/LA Live, we took a cab, not the best area to walk around at night. Rooms were average size. Beds were comfortable. Strange bathroom setup, separate tub & shower...and the shower has weak water presure. Stopped in the lounge area for a nightcap...not the friendliest of bartenders, it was close to midnight and she was obviously ready to leave for the evening. Nice to have Starbucks coffee served in the morning, and the barternder then was much more pleasant. Valet & front desk staff were kind and ready to serve. Expensive parking. Overall, decent place, decor needs a bit updating. A bit overpriced for what it is, but it is downtown LA!", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "1"}, "AuthorLocation": "Moscow", "Title": "“Interesting - has its pluses and minuses”", "Author": "MoscowNick", "ReviewID": "UR114853897", "Content": "Even though it's obviously an old Marriott, it still has an aura and an impressive feel about it. Check-in was ok and the rooms were fine with everything except a mini-bar. We were on the Concierge Level (Club Level) which was really well-priced at about $220 a night, but the service in the Concierge Lounge was shocking. It was rarely staffed, the choice of alcoholic drinks was shocking (for example, they only had two bottles of each beer, except for Bud Light which is like drinking fizzy tap water) and the snacks were far too sparse as they were gone within minutes. We never made breakfast as it closed at 09.00am, I believe. We couldn't find anyone to serve us or ask for information, which makes a joke of the name \"Concierge Level\" - it was anything but that. Valet parking was a bit strange - I paid $30 per night for them just to leave my car baking in the heat all day! They said that it was too large to park in the underground car park, but I don't think that the GMC Yukon was THAT big! The hotel does have a bit of that \"wow\" effect, but it misses the small details that great hotels don't. I probably would go back, but only because the rates were actually very good for the area.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Sydney Australia", "Title": "“Clean and Pleasant”", "Author": "annabelle2904", "ReviewID": "UR114662119", "Content": "We stayed at this hotel for two nights prior to our tour around the west coast and one night on our return. The rooms are clean and quite large but it depends on where in the hotel your room is as to whether it is quiet or rather noisy. Our first room was over air-conditioning and the noise was quite disturbing but upon our return the room we got was very quiet and we got a good night sleep. The bathrooms are lovely, spacious and well equipped with nice toiletries. The king bed was very comfortable but our second room had what is called a 'queen' size in the USA but to Australians it is a double and really not very big at all. TV had free cable and that was good but was puzzled that a hotel of this size had the 'old' type of tv and not a lcd flat screen. The restaurants are acceptable but expensive but the wait staff are very friendly and helpful. Some of the staff at check in were fantastic while others seemed to be bothered that you asked for help and were not very knowledgable at all. My one major concern was that in our month in the USA we stayed in about 15 different hotels and although this rated highly in terms of cleanliness and comfort it was the ONLY hotel that charged for wifi acess!! All in all, the hotel is a pretty good standard but my tip is not to allow them to take an imprint of your credit card because a couple of our tour group had charges against their accounts even although nothing had been used. It took a lot of sorting out to rectify as well!!", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New Delhi, India", "Title": "“Nice hotel for a business trip to Los Angeles”", "Author": "karanvni", "ReviewID": "UR113876937", "Content": "If you are on a business trip, particularly when you have some work or exhibition to attend at the Los Angeles Convention Centre (LACC), this could be the best hotel to stay at. The hotel has beautiful interiors, and you won't mind clicking every corner and part of the hotel. The hotel has nice restaurant, with very good food. The breakfasts are amazing too, with a wide variety of cuisine and dishes. The rooms are beautiful and very well maintained. The hotel has all amenities and facilities. I would love to stay again here in my next trip this November.", "Date": "June 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Northern California", "Title": "“A good centrally located hotel for Los Angeles”", "Author": "charmking", "ReviewID": "UR113351661", "Content": "I selected the Marriott Los Angeles Downtown because of its location. It is right off the freeway however the off ramps, on ramps, and a crazy one way streets can make it a frustrating task to get to for the first time. A GPS unit can make life a lot easier in the downtown area especially at night. The hotel in general is showing its age but the management has made good attempts to keep the hotel looking clean and comfortable. The entire staff is very friendly and will go out of their way to help you. Our room was okay. I liked the bright Hollywood style lighting around the three sided sink mirror but the decor is just average. I must say the big shower head offers a pleasing shower but I felt the shampoo and soap quality to be lacking. Our full beds were comfortable but not at the level of the Sheraton mattresses. We tried the $19.95 breakfast buffet and we were pleased. Plenty to choose from with an omelet station, fruits, pancakes, waffles, french toast, of course the usual pork meats, smoked salmon, and tasty slow cooked oatmeal, etc. They were able to accommodate my milk intolerance by bringing me soy milk which I was impressed with. Internet was not free but I liked that I did have an option to buy 1 hour for $2.99 to check my email on the laptop. The valet parking was pricey at $30/day but is par for the course nowadays. Just an FYI that there is a parking garage across the busy street that is not affiliated but charges a lot less. Our room maid did a good job for us so she earned an appropriate tip from me.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "El Cerrito", "Title": "“Very Clean, more than adequate”", "Author": "mikeinelcerrito", "ReviewID": "UR112795453", "Content": "It is clean and very spacious hotel in downtown LA. It is not as chic as some of the newer properties but the room I got was massive, like it has a tub and a separate stand up shower and the bathroom is 80s California style in it's size and layout. The room has greenish carpet which was in very good condition and the windows were floor to ceiling. I would not stay here if you are looking for a chic place to stay but if you are looking to be in downtown LA (which is not chic to begin with) then this is a good bet for it's convenience.", "Date": "June 11, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "4", "Overall": "1.0", "Value": "1", "Service": "4"}, "AuthorLocation": "Folsom, California", "Title": "“Older hotel and don't believe the Mariott website!”", "Author": "KVPFolsom", "ReviewID": "UR112686156", "Content": "We booked a 2 room suite with concierge access from the Marriott website Their site indicated the access was Sunday through Saturday. We checked into the room and was informed that they have no 2 room suites. So, we received a double bed regular room. The access also closes at noon on Fridays and closed Saturdays. The room smell was masked with a strong lemon cleaner scent. The bathroom door creaked St each opening and the clothes hook behind the door was ready to fall off. Their Internet site still charges unless you are a Gold Rewards or higher ; however, it was an older, slow network that took minutes just to refresh their own website. Stay somewhere else! Oh ya, we found trash under the curtains.", "Date": "June 11, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Service": "5"}, "AuthorLocation": "Santa Cruz, CA", "Title": "“Older Marriott Property - Standard Rooms - Good Service”", "Author": "cruzca", "ReviewID": "UR111518185", "Content": "I stayed at the Marriott downtown in early June, 2011. I've stayed at the hotel before for business and am an elite member with Marriott. Overall, this hotel is in the average Marriott category. The main advantages are the price (it is lower than the brand new but superior JW Marriott about 3/4 mile away), and the service (everyone was friendly and helpful throughout). The cons? Well, it's an older Marriott so it simply doesn't have a luxury feel. ROOMS: The rooms are a good size (you don't feel cramped) but overall they are showing their age. The carpet looks older and the chairs are a little worn. The best features of the room are the floor-to-ceiling windows with a view of downtown (hint: request an even numbered room for a view of downtown rather than the freeway) and the marble bathroom. PARKING: All parking is valet - $30/day. This rate seemed pretty standard in the area. The valets were quick and efficient. LOCATION: The hotel is located right off of the 110 freeway and Highway 101. It is about 1 mile (can be walked during the day) to LA Live and the Staples Center. It's hard to say it's in a great location because you can't really walk or do anything immediately outside of the hotel. But it was easy to hop on the freeways to get to Hollywood and to LA Live. Given the location near the highways you can expect road noise in your room. I was on a high floor and not staying on the highway side but could hear traffic all evening.", "Date": "June 5, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Yorkshire", "Title": "“Worst hotel on our holiday”", "Author": "JK-HKR", "ReviewID": "UR109035894", "Content": "The Downtown Marriott in Los Angeles was our final destination on a three stop stay in America, from reviews it looked like it was going to be one of the best but proved to be the worst. The location is not ideal and being in the financial district we found there were limited restaurants or food outlets open over the weekend, the majority of hotel guests appeared to be business travellers and as holiday makers we felt quite out of place as men and women in suits looked down there noses at us - it also meant drink prices at the bar were quite expensive! The room was fairly nice although dated and its probably no surprise with another Marriott opening at the other end of the street that this one has not seen any TLC for a while. The fitness suite was small, limited and not very looked after and the staff also were not very friendly - cashing travellers cheques was a chore most days!", "Date": "May 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "San Francisco, California", "Title": "“Ick Ick Ick! Skip This Hotel!”", "Author": "moviechic8", "ReviewID": "UR107440804", "Content": "Ick! I blame myself for this miserable stay at the downtown Marriott. I ALWAYS check TripAdvisor before booking a hotel. However, I was in a rush booking this stay that I booked the place without first checking the reviews. The one time I make this mistake and ... oh the punishment! This hotel property is gross - dated, faded, smells and is just plain ugly to look at. The carpet in the room was faded and dingy - I felt dirty walking in the room. Binds were dirty, walls have markings, furniture was scratched and from the 70s, and the hallways and rooms smell gross! What really irks me is the price they charge per night! Stay at the Omni a couple of blocks away - I stayed there last year (the place is gorgeous and CLEAN!) and they charge the same price. I love staying at Marriotts ... just not this one! Needs MAJOR renovation!", "Date": "May 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“nice hotel, great people, a little dated”", "Author": "ItalyLover72", "ReviewID": "UR107055456", "Content": "I stayed here on business for several weeks. It was a great value, breakfast included and not just 'Continental' either - bacon and eggs available daily. the suites were huge, many with views although the decor had a bit of a 70's vibe. People were very nice & helpful, the restaurant was surprisingly fabulous ( except for the desserts, which tasted like they'd been in the refrigerator for quite a while) Would definitely recommend!", "Date": "May 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Monroeville, New Jersey", "Title": "“wonderful stay”", "Author": "njredroze", "ReviewID": "UR103087986", "Content": "Los Angeles Marriott Downtown is worth every dollar. The valet service and check in was easy. Stayed in the Junior suite on the concierge level. The room was on the corner of the building, giving us a magnificent city view because of the floor length windows.I think it could use updating but was well kept and clean (every day). The hotel had all the amenities we wanted. A boutique had a little of eveything.The 333 Restaurant was where my husband had one of the best steak dinners. Our compliments to the chef. The pool was open but it was too chilly for us.Eveyone was extremely polite and professional making for a great stay!", "Date": "April 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Winchester, Massachusetts", "Title": "“Very Tired, Needs a major refresh”", "Author": "Nyquist", "ReviewID": "UR101367097", "Content": "Very dissapointed with the stay here. Rooms haven't seen an upgrade in a long time, at least 10-15 years from the look of things. Early 90's vibe going on. Workers friendly but you can do much better in LA, particularly for the price I paid. Stay away.", "Date": "March 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sacramento, California", "Title": "“Great Hotel for Business Travelers”", "Author": "Newhiker1", "ReviewID": "UR100760306", "Content": "Great location, comfortable, clean, lots of amenities nearby. Comfortable nite of sleep.", "Date": "March 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Aliso Viejo, California", "Title": "“Clean & Comfortable, Great Service”", "Author": "marketing92656", "ReviewID": "UR98166688", "Content": "I just stayed at thishotel for a week and had a great stay. Definitely not the newest or trendiest hotel, but the room, lobby and fitness center were super clean, bed was comfy, and it was super quiet. The front desk was really nice and i ate dinner at the bar every night. GREAT service at the bar - super friendly employees and the Farmers Market Salad with Grilled Chicken was great!! Also had a Steak Quesadilla which was much more than I expected! I was happy too that they serve Starbuck's coffee & passion fruit iced tea even later in the evening. Parking is $30 for valet, but I stay in a lot of hotels and this seems pretty standard for downtown hotels. I was surprised actually how nice the valet guys were and even though the hotel was pretty busy, the service was very good. Fitness center was great too. Nice equipment, not crowded, and they have fresh fruit too. Location was good too - easy to get in and out of, to the freeway, and easy access to other restaurants & a CVS which I needed to get to one night. Overall, if you can look past some of the decor which does need to be updated, it's really a great place to stay. I'll definitely be staying here again!", "Date": "February 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "US", "Title": "“You know somethings up when locals call it the bankrupt Martiott!”", "Author": "Blairz", "ReviewID": "UR97089934", "Content": "I stayed at this hotel for 3 weeks and while it was better than a super 8 or motel 6, rooms are dated, tv's are old, and the carpeting dirty. Staff are friendly enough but the wait staff in the concierge lounge are barracudas with the payment form if you get a cocktail. I don't mind paying for a decent glass of wine but $8.50 for wine that sells for $4.99 just doesn't seem fair.", "Date": "February 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "hopefully", "Title": "“The old Marriott Downtown - still great!”", "Author": "rcordero", "ReviewID": "UR95308138", "Content": "The hotel was great, everything worked, linens and bed were awesome. Large bathrooms awesome views. Expensive parking: $30 for guests, $13 if you attend an event. The only negative in the room I found were the towels in the bathroom, they were very old and worn out not plush at all; I was very surprised by this. Bath & Body toiletries. Apparently there is another Marriott Downtown because the taxi drivers all asked, \"old or new one?\"", "Date": "February 2, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Choose another Hotel”", "Author": "tb1191", "ReviewID": "UR95082672", "Content": "I'm a long-time Marriott customer but this hotel was the biggest disappointment I've experienced with Marriott. There were so many issues I don't know where to start from having no power or water, getting sick after eating in the restaurant, to having to call security because of unruly guests on my floor screaming at each other all night long. I know it's not representative of all Marriott hotels but I would skip this one if you need lodging in downtown LA!", "Date": "January 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Dated, worn, overpriced, not for business”", "Author": "sandfly71", "ReviewID": "UR94312803", "Content": "Stayed for two nights. Odor/smell in room & hotel made me feel poorly (lungs). Pay for in-room wireless $10/day; no business phone in room, in-room desk/chair from 80's; no LCD tv or refrigerator. Safe broken. Bath, bed clean and decent. Hotel conference rooms dated and odoriferous.", "Date": "January 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Greensboro, North Carolina", "Title": "“Old, shabby, needs updating - not recommended”", "Author": "rtw123", "ReviewID": "UR92100018", "Content": "Stayed at Marriott LA Downtown in January 2011 for 4 nights. I never expect much from downtown hotels, and this Marriott is no exception - a rundown old downtown hotel. The hotel is old: the rooms have old bizarre-green carpet, ancient TV, no mini-bar, old safety deposit box with an actual key, which will cost $150 if you lose. Counter-intuitively, take a room facing the main Interstate. At least some of those rooms have newer double-pained windows and are quieter than the rooms that face Figueroa St. - they have old single-pained windows and you can hear all the traffic outside. The beds are old and soft, so if you need a firmer mattress, look elsewhere - we could not find a room that would nave newer and firmer mattresses - all seem to be pretty worn out. There are no outlets near the bed, so forget about comfortably working on the laptop. We stayed there at a $110 conference rate, which is tolerable, but I would never stay here for the regular $180+ price. In sum: If you are visiting LA for fun, don't stay in the downtown - there is nothing to do there. If you are on a business trip - go elsewhere to have a better value for your money.", "Date": "January 7, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "San Francisco, California", "Title": "“Average at best”", "Author": "Hc1hweds", "ReviewID": "UR91210896", "Content": "I guess they think people won't notice the old, outdated , analog TV sets in the room. Staff friendly. parking is valet only and $30 a day. Restaurant food ok but not really worth the price. Other than the Tv sets from the stone age, room is nice, clean. valet staff very friendly, helpful. Many eateries within walking distance. wireless in the room is $10 a day and somewhat slow. overall a comfortable experience although the hotel needs to upgrade the rooms to be on par with other hotels in the area.", "Date": "December 31, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "TubarÃ£o, SC", "Title": "“Below average, it's not a downtown hotel”", "Author": "hermes_br", "ReviewID": "UR89800580", "Content": "I usually appreciate Marriott hotels, but this is below average. It would be a regular/fair if it was an airport hotel but as a downtown hotel, it needs improvement. Even the staff remember flights: they are polite, of course, but they look like flight attendants with their fake smiles and simulated courtesy. The hotel and the room look old and they definitely need renewal. It was a disappointing experience.", "Date": "December 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Wedding Bliss”", "Author": "matthewsamuel", "ReviewID": "UR86309198", "Content": "Los Angeles Downtown Marriott hosted my wedding party and the service was impeccable. Ric Evans and Michael Taylor treated my wife and I to breakfast prior to the wedding. They were charming and extremely professional, and we immediately knew we were in good hands. From room service, to toothpaste delivered to our door, to complimentary fruit baskets and champagne, they catered to our every need. And the honeymoon suite was the STUFF OF LEGEND, a two story suite with an elegant staircase leading up to the bedroom. This hotel exceeded my expectations in every way imaginable. AND they gave us a incredible group rate!!!", "Date": "November 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Seminole, Florida", "Title": "“Marriott just OK...needs updates.”", "Author": "StevenFL33776", "ReviewID": "UR85958000", "Content": "Overall, Staff very friendly except we wanted to go to West Hollywood and the Bellman called a friend \"Pablos Limousine\" - he took us there at a reasonable rate and we cabbed back to hotel later. However, we called and made an appointment with them again on Sunday round trip and one minute before we were to be picked up, he texted me to say he would not be able to pick us up. No explanation, no notice...just a I'm sorry!! BAD BUSINESS!! Luckily, another bellman at the hotel called a service and they were very reliable and punctual for full round trip. I reccomend \"Andres Limousine\" for you sedan needs. Back to the Hhotel, the TV's are from the 80's and need to be updated to flat screen, bar needs to be open longer (especially when there is 12,000 conventioners in town), furnishings are old but decent, need a fridge in rooms or honor bar, room service needs to be 24hrs, and elevators need replacing (only 2 worked during visit). Staff all were friendly but will stay at the JW Marriott on next visit as it is in the Staples Center with lots of things top do around it.", "Date": "November 4, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sydney, Australia", "Title": "“good location”", "Author": "JayeffSydney", "ReviewID": "UR84491660", "Content": "My visit to LA on this occasion centered upon the LA Opera and LA Philharmonic Orchestra both of which play very near this hotel. The room was typically spacious and well appointed, view of the road below was a bit dull (and the weather was awful!) but I had no complaints. The WiFi at $10 a day seemed a bit dear.", "Date": "October 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Great service, but felt a little worn”", "Author": "MWBeachLover", "ReviewID": "UR83264433", "Content": "The service at this hotel was top notch. The rooms were adequate, average, at best. They felt like they could use some updating. The bathrooms were nice though. There were food options in the hotel, but there did not seem to be a lot of choices within walking distance at night.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "san diego, ca", "Title": "“Don't spend your money at this Marriott”", "Author": "LoFin", "ReviewID": "UR82902626", "Content": "The valet cost ($30 usd) is typical for any downtown hotel. My friend forgot a bag in the car, didn't notice until morning, so I called for the car. Collected the bag, then asked the valet if I could leave the car as my friend was in the shower. No problem! Car was in the same spot when we checked out 30mins later. The bar/lounge service is poor, and they were out of several premium liquors by11pm Sat night. The best thing about the room was the A/C. The 26 inch old school television is shameful, poor water pressure in the combo tub/shower, and the bath towels are skimpy.", "Date": "October 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Richmond, VA", "Title": "“Youâ€™re Average Downtown Hotel”", "Author": "bw0", "ReviewID": "UR82345446", "Content": "When you pull up to the hotel, your greeted by the valet only parking (it is not cheap either $30/day when I stayed there), very professional staff, you walk in and the lobby is huge and nice, you check in, with absolutely pleasant service. Now you make it up to your room and now your let down beginsâ€¦ old tired rooms, old carpet, old furniture, a good oleâ€™ fashion tube tv smacks of 1995 and the view, well letâ€™s just say you have real time traffic information of highway 110 at your finger tips. Beds are fair, nothing to rave about. No frig, no microwave, wireless for a fee, higher than average room service. However I will give them kudos on the bathroom; it is up to date and nice. The workout room is also up to date and has a good number of machines with digital TVs on the cardio machines, however the pool is pathetic. The bottom line: you will spend some good money at this place and will not get a big return, if youâ€™re in LA to be downtown this is an okay option.", "Date": "October 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Berkeley, CA", "Title": "“They do the same thing every day as if they were doing it for the first time”", "Author": "paulie47", "ReviewID": "UR82111811", "Content": "The good first: The room was adequate and quiet enough (even though I was on the freeway side). I was on one of the top floors. The bed was OK, not totally comfortable. The bad: I was there for a conference. When we left it took over one hour to ransom the car from the parking lot. I've read reviews complaining of this over a year earlier. Apparently nobody cares enough to do anything about it. It must have come as quite a shock to them that they were hosting a conference with 300+ attendees and that when it adjourned, many would want their cars. Some of us had planes to catch. Nobody on staff seemed to care. Over the time of the tripadvisor complaints, they've had the capability of fixing this. But they haven't. The food: Bad. One conference lunch was inedible. I had one ravioli and gave up. I also had bar food downstairs one night and it was awful. Service: at the restaurants it was as slow as at valet parking. We almost had to leave lunch in order not to miss a conference session. The room: Poorly laid out. When you open the shower door the towels are behind the door so you have to get completely out of the shower, close the door behind you and drip water on the floor just to get the towels. The towels are thin, and they only give you two bath towels. The air conditioning did work though and quietly for which I was grateful (it was during a recent heat wave.) The televisions were like a museum of the 1980s. Annoyances: They charge $10 per day for internet. That's like charging for the water you use. Worse actually, the water costs them. The internet does not cost them per your use. For attendees not staying at the hotel, it cost $70 per day. No excuse. Elevators were slow and usually crowded. The card key took repeated insertions to work. While this is not a one-star nightmare hotel, it is bad enough that you shouldn't stay here unless there isn't any choice.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "4", "Location": "2"}, "AuthorLocation": "merseyside", "Title": "“Bad customer service”", "Author": "fayexxx", "ReviewID": "UR81074754", "Content": "Stayed at this hotel for 5 nights at the beginning of the month. The major problem we had was the noise at night. 3 out of the 5 nights the smoke alarms went off and remained on for quite some time, they were incredibly loud and we nearly had a heart attack each time it went off. We were given no explanation for the reason as to why they repeatedly went off. There was a large group of guests on the floor we were on who decided to have a party from 11pm until 7am the next day, all night we heard girls screaming and people running down the hall, not something you want to hear when you are trying to sleep after walking all day long, due to our frustration we called the front desk several times to report this and they advised they would send somone up to check it out, nothing changed. We then pointlessly phoned again and were greeted by a woman who asked if we wanted to change rooms, not something we were willing to do at 4am, we just wanted the noise to stop. She said there was nothing more she could do so we just stayed up the rest of the night. On the plus side the restaurant was nice with good bar service. The location for a traveller is bad, we had to get the train down the road to get anywhere, there is nowhere good around the hotel to eat or shop.", "Date": "September 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Sacramento, California", "Title": "“The old grey mare, she ain't what she used to be.”", "Author": "fidelrobert", "ReviewID": "UR77746116", "Content": "This is an okay hotel with a good location, and I have stayed there a couple of times before on business, but this time, you could see a noticeable difference in the place. The rooms are showing significant signs of wear and tear. The lobby and entrance look good (a little dated), but having a nice entrance and lobby is like putting a $10,000 saddle on a $5.00 horse. The place is in need of some serious updating. I'd stay there again, but the rate would have to be pretty good.", "Date": "August 31, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Chicago, Illinois", "Title": "“marriott hotel”", "Author": "jesmarc", "ReviewID": "UR74277139", "Content": "the room is clean and cozy, clean shower room, i love the food they served on breakfast and the front desk people are nice.", "Date": "August 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Excellent!”", "Author": "sailgrl", "ReviewID": "UR71939332", "Content": "We stayed at the hotel for a week. Valet was expensive, but it was the only way to get the car in and out when necessary. Parking garages are close if you do not want to drive around. Next to expressways so easy to get around (use 3rd St to go directly to Hollywood area). Clean comfortable rooms, fitness areas and pool.", "Date": "July 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Sacramento", "Title": "“DISAPPOINTING”", "Author": "babystarzx", "ReviewID": "UR70109402", "Content": "I came here hoping for a nice place to stay in to explore Los Angeles. What disappointed me when I first arrived was the $30 parking fee per day. Also, the valets didn't even smile. Also, they charge you for internet. When I went in the hotel, it looked nice but the lobby was sprayed with so much perfume. The perfume didn't even smell nice either. The perfume smelled bad that I almost threw up. The people at the counter had good customer service, but the valets didn't. I went to enter my room and it took a couple of tries to swipe the key until you can go in. That disappointed me a lot because it took a while to get into a room. When I looked in the bathroom, I expected maybe a toothbrush or toothpaste but they didn't even have it. All they had was a tiny bottle of shampoo, conditioner, and lotion. Also, their towels stink. When I sleep at a hotel, I expected a peaceful sleep. But no. You could hear people outside talking while you sleep at 1 in the morning. and I couldn't have a good night sleep. I wanted to go the gym to exercise, but I was disappointed at how small it was. There was probably less than fifteen machines in the small fitness room. Also, they charge you 30 dollars for breakfast. Even a hotel with less stars than this one will have complimentary breakfast. How disappointing. To sum it up, this hotel is probably the worst hotel I have ever been to. Disappointing things: -30 dollar fee parking per day -No free internet -no free breakfast -no toothpaste or toothbrush -small fitness center -okay service -stinky lobby -Not so pretty view", "Date": "July 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Philadelphia, PA", "Title": "“Disappointing Marriott, Extremely Outdated Rooms”", "Author": "pabloetb", "ReviewID": "UR69387977", "Content": "I stayed here for one night along with 3 colleagues and booked all 4 rooms under my Marriott credit card as a Platinum Elite member. Upon pulling up to the valet in front of the hotel we were immediately approached by the stoic-faced valet. It was 10PM and I kindly asked him to wait a minute while we decide what we are doing with our vehicles. I had learned from other tripadvisor members that there is parking directly across the street in the World Trade Center. So one of us ran across and spoke with a parking garage employee and he confirmed that you can park overnight for $10. The garage is well light and secure. So we headed across the street and spent $10 each instead of $30 at the Marriott. Ha! When we approached the check in counter we were greeted by the robotic front desk manager. He was very matter of fact and had little personality. He informed me that he didn't have any king beds as requested because the hotel was near capacity, which seemed odd since we were one of the only few people in the hotel lobby area, which is very large, impressive, but smelled liked old fashioned air freshener. It was terrible. As a platinum member I am guaranteed my room type. He stated that he had king beds on a lower floor. I said that would be fine. We then found out that he issued me a king bed on the 5th floor and my other 3 colleagues 2 doubles on the 5th floor. They were too tired to complain. My room was spacious but I felt like I walked into a room that was decorated circa 1992. I was dumbfounded. I only stay in Marriott properties and I have not seen anything like this in years. The carpet was hunter green with pink designs and worn. I kept my flip flops on. The lamps that flanked the bed were pink with cheap dirty off-white shades. The tv was old-fashioned tube tv and small. It looked silly on the armoire. The drapes were just as old and unattractive. It felt plain awful and so did the mushy bed. I did not feel or look like a typical Marriott Jameson bed. I must say the bathroom was upgraded with marble-looking counters and floors and lots of lighting and mirrors. The decor in the hallways matched the rooms. The concierge lounge was fine for breakfast. This hotel should not be booking any more rooms until they upgrade them. Shame on you Marriott.", "Date": "July 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Clonmel", "Title": "“Smashing hotel, but staying in the Downtown can limit options”", "Author": "LeVisitant", "ReviewID": "UR69273097", "Content": "A very impressive hotel in Downtown L.A. Yes has that business convention feel as does the behemoth Westin Bonaventure across the road but there's enough frivolous touches to let the holiday-making guest feel right at home as well. Let me break it down into pros and cons: PROS No. 1 without a shadow of a doubt is the breakfast experience. It's a buffet served in a large sunny room looking out on the pool and run by mainly Hispanic staff who are among the most courteous, professional and friendly hotel staff you'll ever encounter. They offer bountiful fruit salads, cereal, cooked breakfasts and sensational omelettes. Next selling point is Moody's Bar and Grill off the lobby. Quintessential American sports bar with great variety of cocktails and beers and real down home USA cuisine Rooms are spacious with king size beds or doubles in the twin room category. Found the rooms very quiet, surprising given the busy road just off the hotel Finally the public areas are spacious and it's the type of hotel you can lounge about in, if you're too lazy to explore the sights of L.A. Location in the Downtown does limit dining/entertainment options at night but there's a cinema adjacent, the award-winning Ciudad restaurant is 3 mins walk, the Westin Bonaventure across the road has a rooftop bar and a ten min stroll to the 7th St intersection brings you to great restaurants such as Morton's, Engine 37 and Ciao. CONS Reception and evening restuarant staff are a little bit Santa-Monican L.A. if you'll allow me schematize/perjoratize (you pays your money and...). Aloof, tad unhelpful, tip-seeking, vainglorious. Enough, you get the picture Downtown location: can be dodgy walking around at night when the suits have taken their leave of the corridors of power and headed for the suburbs. I'd advise taxis when returning from some of the afore mentioned restaurants despite the walk time being a mere ten mins. Being in the Downtown means longer commutes to the main sites although Hollywood is accesible by Metro. Getting to Rodeo, Beverly Hills, Santa Monica etc is time consuming. That said L.A. is a vast sprawl and you'll never find a truly central location I recommend the hotel highly, just consider the location option", "Date": "June 30, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Rooms": "3", "Service": "4"}, "AuthorLocation": "Madison, Wisconsin", "Title": "“Good service. Good location for LA music center.”", "Author": "scoresmore", "ReviewID": "UR67931281", "Content": "It was clean and close to the opera, but it was very expensive and service wasn't perfect. Good health room though.", "Date": "June 18, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Irvine, CA", "Title": "“very disappointed”", "Author": "socaldl", "ReviewID": "UR67739626", "Content": "In my opinion it is the worst Marriott I've ever stayed. We stayed in the hotel for two nights over a weekend. The trip purpose was a nightlife, we stayed out until around 4 am hopping to sleep till at least 10 - 11 am. Each morning we were awaken at 7 or 8 am because someone in the neighboring room made some noises. I was able to hear entire conversation in the next room. When I complained to the front desk staff I was told they have full house. I see there are other reviews mentioned poor noise isolation in the hotel and I am pretty sure a hotel management aware of the situation. So, don't be greedy if you can't fix the issue don't sell the rooms with poor noise isolation or make customers aware of it. The staff in the hotel is very unfriendly. I also spoke with a front desk manager Mike, he has no customer service skills whatsoever. Rooms are poorly decorated and due for renovation long ago.", "Date": "June 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good value”", "Author": "Leesw8", "ReviewID": "UR66394833", "Content": "I stayed at the Marriott downtown twice during May 2010. Both times I booked through Priceline at a rate of around $65 per night. At Priceline's rates it is very good value! The downtown location is not for everyone - the hotel is right next to a freeway so make certain you ask for a \"city view\" room. I though like downtown LA with its good range of restaurants. On my first stay, the room could not be faulted. It was comfortable and on a high floor. My second stay was not so good though. The initial room I was offered smelt very musty and I asked to switch. Even though I am a Marriott Rewards card holder, the hotel could not fulfil my request for a king bed with a city view. I moved rooms to find two doubles with a city view, but the room seemed tired. No flat screen television in any of the three rooms I saw, and the bathrooms seemed tired. There was also no free internet service - not even in the lobby area. Parking is $30 per night - valet only. Whilst I have read complaints about this, it is fairly standard for an LA hotel whether in downtown, at the airport or in Beverly Hills. You can get a cheaper rate at an open car lot next to the Disney Concert Hall but without in/out privileges. I would stay here again if I got the hotel on Priceline.", "Date": "June 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Jose, California", "Title": "“Great Service”", "Author": "Jayjayel", "ReviewID": "UR63254818", "Content": "The Marriot Downtown LA has one of the best customer service I have experienced at my many hotel stays. They have one of the most responsive and excellent Bell Desk services ever. From receiving packages, calling and confirming, to bringing the packages throughout the hotel and storage, our company has called on them multiple times and have always had our needs met. Their Front Desk personnel are extremely professional, patient and kind, from when I was waiting in line watching them assist an elderly lady who couldn't speak English, to offering me beverage when I was feeling unwell upon my arrival at the hotel, from too much constant travel. The only downside I experienced was the air conditioning did not seem cold enough in the evening and made the room a bit hot to sleep comfortably in.", "Date": "May 4, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Do not recommend this Hotel”", "Author": "Gushkub", "ReviewID": "UR60149780", "Content": "The Downtown Los Angeles Marriott is one of the worst Marriott Hotels anywhere. The rooms are noisy even at the top floor, Aircondition did not work, Hotel is run down, and they use very cheaply decorated for the level of nightly rate they charge. I chose the hotel because I am a Marriott Rewards Member, I stay at Marriotts Worl Wide, and the location of this hotel was just what I needed. But I would never stay there again.", "Date": "April 2, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Los Angeles", "Title": "“poor service, don't give your car to valet parking”", "Author": "manger123", "ReviewID": "UR55601710", "Content": "The stay was terrible. Valet parking stole some very expensive items, and hotel nor valet parking would fully investigate or reimburse for stolen items....Would not stay here. Watch out for your belongings!!!", "Date": "February 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Alabama", "Title": "“Nice but a bit disappointed with this link of the chain.”", "Author": "shauste", "ReviewID": "UR55509471", "Content": "After staying at the Wilshire Grand for one night, I found this hotel to be outstanding in comparison. Very clean and comfortable rooms. Courteous staff and fast, easy check in and check out. I, however, find it odd that a hotel of this quality would charge for internet service. That should be a given at any hotel these days considering many people conduct business by the internet. The valet parkingâ€¦wellâ€¦its expensive. Seems like Marriott is taking advantage of the limited parking in downtown LA by being partnered with a parking company. Very expensive at $30 per day and the valets had the nerve to hover around looking for a tip. There are no coin wash facilities on site. The restaurant is expensive and the selection is minimal. There is a Concierge Room on the 11th floor but if you want anything stronger than Coke, it will cost you. Overall, I was comfortable in this hotel and know what to expect. Convenient location to where I had to conduct business and I just may stay here again on my next visit to LA.", "Date": "February 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Location": "1", "Rooms": "2"}, "AuthorLocation": "Rad Hills, CA", "Title": "“Bring your earplugs...and your wallet. Go to Marriott Pasadena instead!”", "Author": "RadHills_CABobTA", "ReviewID": "UR54058495", "Content": "HI, checked in to the Marriott on business, already armed with information regarding the $30.00 Valet parking and the $10 internet (What the heck, my company supposedly has a business agreement with these guys and they wouldn't budge on comping internet access in my room). The hotel is clean, beds were nice. Freeway noise was disturbing and couldn't sleep until I found my earplugs. Breakfast was overpriced (when was the last time you spent 18.00 for an omlette?) but the Concierge Lounge was a great perk with continental breakfast, juice, coffee, etc. Like previous reviewers, I parked across the street in the lot for 10.00 after 5 pm and had no problem. So all in all, I won't be staying there again even though my business dealings were just 3 miles away. Way not worth it. Staying at the Pasadena Marriott, very nice and clean and a much better deal. Free internet as well!", "Date": "January 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Austin", "Title": "“Good location”", "Author": "Austinmike28", "ReviewID": "UR53535088", "Content": "We stayed here for the BCS National Championship game. This is a pretty nice hotel with a good location, although for the price I think you can find better value out there. Check-in was a little bit of a hassel as they had inadvertantly let someone check-in already under our name. I'm not sure how that happens, cause I think it's pretty standard that you show ID, etc. Anyway, they got that mess cleared up and we were AOKAY. The rooms are pretty standard, with two queen beds in ours. The bathroom was HUGE, and had lights that made you feel like were in the movies!! They had a bunch of coffee and tea in the room that you could have free of charge. The worst thing about the room though was the TV, it was tiny and OLD. For the amount of money that they want for a room, they really need to update to some flat screen tv's. On our entire trip, this was the most expensive place and had the worst TV. Overall it's a nice hotel, probably would be great for a buisness traveler, but if we had to do it over again we would stay someplace else.", "Date": "January 15, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "1", "Rooms": "2"}, "AuthorLocation": "Englewood, NJ", "Title": "“Not for a leisure vacation stay”", "Author": "Ricky347", "ReviewID": "UR53391445", "Content": "This hotel was probably 3.5 stars 25 years ago. It has not been updated and the hotel was mostly empty while we were there. We wound up at this dump from Priceline, which claims it to be 3.5 stars. The small pool was not heated and cannot be used in the winter. The floral pattern on the floor screams 1981 cleanliness was an issue. Internet is not free. Parking is $30/night!! This is not disclosed when you get the room on priceline and added a full 60% to the cost for the room, which is unreasonable. My wife was working out in the fitness center and the leg of the elliptical machine came loose and she fell off. I called the front desk, which coldly told me, \"someone will be there soon.\" We waited 20 minutes and no one came. This hotel is located in downtown LA, far from everything except LA Live/Staples Center. If you are coming to LA for anything other than 1-2 nights for business/sports, go somewhere else.", "Date": "January 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "NYC", "Title": "“LA stopover”", "Author": "data08", "ReviewID": "UR53308990", "Content": "Decided to stay in LA for a couple of nights in between our trans-continental flight and very pleased with the price paid for a Marriott. Location was right across from the World Trade Center and would make a convenient convention hotel. Staff were helpful and hotel had nice spacious lobby. Pool was small but nice, though we did not have our swim suits with us. Ate at the hotel's restaurant and the food was fine. Room and hallway was clean, though appeared a bit dated. Have to positively commend the housekeeping staff for getting the rooms cleaned by 10am (without our request for them to do so... they are most timely and efficient when compared to other housekeeping services in my numerous stays at different hotels this year). Felt that the location was not as \"in\" to the downtown walking area compared to other downtown hotels.", "Date": "January 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "San Mateo", "Title": "“The Room Number is Important Here”", "Author": "Tipster2000", "ReviewID": "UR53292337", "Content": "The LA Downtown Marriott is located between the Harbor Freeway and Figueroa Street and between 3rd & 4th Streets. It's in the business and cultural center of downtown LA and at the center of the LA freeway system. The Harbor, Pasadena, Hollywood and Santa Ana freeways radiate out from here and the Santa Monica freeway is just a couple of miles to the south. By car, if you pay close attention to lane signing when you exit the hotel and continue to watch the signs as you turn left on 3rd, you can almost immediately be on the Harbor Freeway heading north or south with the ability to transition to the other main freeways. Because of lots of merging in this area you need to continue to closely watch directional signs. But this freeway-friendly location has a downside if you get in the wrong room. Rooms on each floor are numbered from 1 to 48. Higher odd numbers are on the freeway side with the higher the number the noisier the room. Room 47 is the worst. Conversely, the quietest room numbers are lower even numbers, so Room 2 is the quietest. No room is without freeway noise, it's just a matter of degree. If you want a minimum of freeway noise ask for a low even-numbered room. This is a nice Marriott with a spacious and attractive lobby. The breakfast buffet is above average and only $19.95--a bargain by hotel standards. There is a person to make omelets, waffles, eggs to order, etc. Only valet parking is available and it's $30 per night. Wireless internet access in your room is $9.95 per night and was easy to connect to and worked well. I had excellent dinners at Zagat-recommended restaurants: Drago Centro and Water Grill. Both are within walking distance of the hotel. If you really like to walk, you can make it to the Convention Center or Staples Center by heading south on Figueroa. The Pantry restaurant is on the way at 9th & Figueroa. Once i got the room-to-freeway relationship figured out and got moved to a quieter room I liked this hotel and would return here if I needed to be in downtown LA.", "Date": "January 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Irish_Nemesis", "Title": "“5* hotel with 5* priced extras and 3* quality”", "Author": "Irish_Nemesis", "ReviewID": "UR52906718", "Content": "Parking/Charges The main thing which really annoyed me about this hotel was that fact that I had to pay $30 per night to park the car when im staying at the hotel which I was not aware of when I made the booking and I would not have stayed here if I knew this. The Valet are a hassle looking for money every time you come and go. WIFI was $10 for 24 hours if I recall correctly. It always irritates me when a hotel wants a guest to pay for WIFI. I will actually stay at a hotel just because it has free WIFI and for the ones that charge I know I can walk down the street to a cafe which will provide it for free. The Room The bed was great, so soft and lots of pillows, just what myself and my partner needed after a long flight. The decor of the room was a bit dated and boring. Lighting I found this a bit strange. When I entered the room there was a switch on the wall which turned on a light bulb over the door/entry area which is fine. What was strange is that there were no lights in the ceiling over the main room area including the bed. Instead there were 4 or 5 lamps around the room which I had to turn on individually. Even just one bulb in the middle of the ceiling with a switch at the door would have so much more convenient. Food The food and drinks were over priced and there are plenty of nearby good quality restaurants serving great food at the right price. I did not have any food or drink from the hotel. Pool I think I would give the pool a good complement. It was a nice area to chill out, enjoy the weather and go for a swim. The pool is a bit small in comparison to other hotels I have stayed at and you know your in the middle of the city. Would I stay here again? Probably not. LA has such a great transport infrastructure that its easy to get in and out of downtown in minutes. A day pass on the metro is $3 which also allows you to use the bus if necessary. I still feel ill thinking about the $150 I paid in parking. I really did not feel like I had stayed at a 5* hotel when leaving this hotel. After this hotel I drove to the MGM Grand Las Vegas which is a 4* and was so much better than the Marriot Downtown LA. Just noticed something when I was filling out this review, it asks me if Pets were allowed. I would not have expected that they were but I remember a woman walking with a dog from the elevators through the lobby to the pool area.", "Date": "January 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ottawa, Ontario", "Title": "“Upscale hotel, but you'll pay for parking and Internet”", "Author": "smokedmeat", "ReviewID": "UR51824419", "Content": "Stayed for 2 nights, December 2-4. Reserved one room with Priceline at the nightly rate of $61 USD. This was the hotel I was hoping to get, so I was happy when it showed up. My friend and I arrived in the evening for check in. There were plenty of staff at the front desk at all times, and everyone I encountered was friendly and helpful. The bowl of salt water taffy and infused water in the lounge were nice touches as well. We got a double room (1219) with a view of the Harbor Freeway and downtown traffic. There were no issues with noise, however, and the room was quite spacious. One small drawback was that the television in the room was quite ancient. Also, there is no free Internet available in the hotel except with certain specific bookings. I needed to access the Internet to research the next stop on the trip, so I paid the $9.95 USD fee for 24 hours of wireless access. Also, I had been warned by other users about the valet parking, but the staff was courteous upon arrival and always had the car ready given a 15-minute call ahead of time to the front desk. The daily fee of $30 USD was quite expensive but in line with other parking garages I passed by in the downtown area. The main reason for choosing the hotel was its proximity to the Staples Center, about a 20-minute walk along South Figueroa Street. We attended a Clippers basketball game and a Kings hockey game there. The area can be a little shady at times, but I was never troubled on either night. I would stay again at the Marriott for the same price. Still, the area is not overly touristy so I would only stay there if attending an event at Staples Center.", "Date": "December 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Paris, France", "Title": "“Comfortable clean spacious rooms in large conference-center style hotel.”", "Author": "washbrol", "ReviewID": "UR51589939", "Content": "This large conference-center style Marriott in downtown L.A. is a fair bargain for the leisure traveller if you find a good price. While it is located in the downtown business district of Los Angeles, which has comparitively little interest to many other nooks and areas of the sprawling Los Angeles area, a certain amout of any tourist's time will be required in the car, driving around between these many areas of interest. And there are a few good options for dining, chic drinks and entertainment within walking distance of the hotel, as well. A big car port and valet service opens up into a soaring lobby, with wings of conference rooms in all directions. The rooms were big, spacious, comfortable, clean, modern. We had a view out onto 3 overlapping highways surrounded by palm trees, which is a very \"Los Angeles\" view, and I did not mind it at all, as the sound-proofed windows kept the noise out. (the highways are not TOO close to the hotel.) My top reccomendation: walk to the nearby Standard Hotel Downtown to their ultra-chic rooftop bar / adult playground. This outdoor venue, high amidst the glass skycrapers of downtown Los Angeles seen in every TV show and film depicting L.A., is complete with a bright green astroturf floor around a swimming pool, fireplace, bed-pods, well poured martinis and a uber fashionable crowd straight off the pages of Wallpaper magazine. A very \"L.A.\" experience for the out of towner. I will certainly go back for a third time.", "Date": "December 21, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "UK", "Title": "“Upscale Donwtown Marriott - Not!”", "Author": "Malim27", "ReviewID": "UR49391261", "Content": "Stayed a couple of nights with friends at the end of a long vacation. Whilst the hotel is in a good location, the property itself is nowhere near a well run downtown Marriott. I'm not going to waste too much time writing about this place, but as a warning to others... * Valet Parking took 40 minutes to return my car. Their excuse was 'there was an event the previous evening and were busy'. Charged me $30 for the priviledge which I refused to pay. * Concierge has NO idea of anything anywhere. They gave me a local map of restaurants etc. and when asked for information, were reading off the map they just gave me. I can do that. Plus a number of the staff are linguistically challenged. * Tatty Rooms * Non caring staff (none that I could find, anyways).. * Chaos at check in. Gave up calling reception in the end. * Poor restaurant. Small choice and no 'higher' end eatery. * Expensive bar * Upon checking out, my wife and I crossed the whole reception area and covered parking area in front of the hotel - laden with luggage- watched by no less than 8 bell boys (I counted them). It was only after me making a smar comment did somebody run up to 'help'. The luggage was at the car by this time and I told the guy where to go. Unbelievable!!! I won't go on. The irony is that we stayed at another Marriott property on the other side of town 10 days previously. Whilst in a less attractive location, the difference in quality and service was like night and day! Recommendation is to give this place a WIDE berth and stay elsewhere until the Management get their act together. Finally, I am a Marriot Elite member and stay at Marriotts all over the world so I am in a position to compare. As a previous reviewer wrote, JW Marriott would be less than impressed how this property is run in his name...", "Date": "November 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Los Angeles, CA", "Title": "“accessible, large room, nice toiletries”", "Author": "juststartedtraveling", "ReviewID": "UR46434652", "Content": "booked through priceline for a great price on this hotel. was pleasantly surprised by the size of the room. bath and body works toiletries were nice. metro rail and local bus lines are nearby as are sights (walt disney concert hall/music center, etc). parking is expensive. if i had to choose between the bonaventure and the marriott i would choose the marriott.", "Date": "October 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Lanarkshire,Scotland.", "Title": "“Great Location For Public Transport”", "Author": "E.Clements", "ReviewID": "UR41889981", "Content": "We have just returned from a six night stay at Downtown Marriott and were pleasantly surprised. We went to Disneyland by train. Hollywood and Universal Studios by Metro and 3rd St Promenade Santa Monica on the Big Blue Bus. Hotel is so convenient for public transport. I am a senior and travelled with my adult son and can honestly say walking was not a problem. Not a lot to do at night but after all the sightseeing it's not a major issue. Would definately recommend it.", "Date": "September 15, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Location": "1", "Rooms": "3"}, "AuthorLocation": "beirut", "Title": "“not bad,but will not stay here again”", "Author": "achif", "ReviewID": "UR38227736", "Content": "for my first time to stay in a mariott chain,i will probably not stay there again.very expensive for the value,staff not friendly at all,very small pool,miserable fitness room,unbelievable disgusting and poor breakfast.only the room was large enough(but at the price,you could have much,much better other place).overall,i think that all managers hotel in USA have so much to learn and practice from hotels in EUROPE and FAR EAST,in all fields.i was very disappointed in the USA standard of the hotels.i would like if some responsible of the tourism departement can read my review,so they can chek the standard of their hotels in USA,because i'm a big traveller,and i make many comparaisons,and believe me,hotels in USA have to do big efforts.i dont know if they became so bad because of the financial crisis,but they have to reamenage their staff,their service,their welcoming,their food,and their price(my god).", "Date": "August 20, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Downtown Orlando", "Title": "“I r all the things there is right around.”", "Author": "OBrianM", "ReviewID": "UR36483375", "Content": "I wish I had more time in hotel and for all the things right around the hotel. The pool area was very nice! I lucked out with priceline on this one. Very easy to stay here without a car because MetroRail is near by. Before I checked In hear I stayed a night at the Westin across the street and was just fun cause how big it is. The beds are super comfy!", "Date": "August 2, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Land of Oz", "Title": "“A Good Choice if You Can Afford the Luxuries...”", "Author": "suva55", "ReviewID": "UR33302637", "Content": "This stay was only possible because I got a bargain on Hotwire, $64 I think. Great hotel and room for the price. However, and this is a big however, if you are on business and rent a car, then the ONLY option for conveniently parking is the valet which is $30 a day, making it among the biggest hotel rip-offs in the country. But as another reviewer has reported, much cheaper parking is available if you hunt for it (hint-- the hotel staff will NOT help you find this parking, or even admit it exists...the concierge and desk help will tell you that the parking price is \"competitive\" and even \"low for downtown LA\"). I could not do such hunting because of my limited time away from my conference, and because there was almost always bumper to bumper street traffic, and because it was raining all weekend. Further, every time you drop off your car, or ask for it to be brought to the front of the hotel, you must tip the driver. $2 is the absolute bare minimum for this kind of service, and so if you need to come and go about five times during the day, this is another $20 daily added to the parking thing. And these valets are very serious. There is a whole army of them, and then there is a supervisor who actually manages the order in which the valets are assigned to cars, and interacts directly with the hotel guests, and expects his own tip. Internet service is $10 a day, no free router in the lobby either, so if you are even remotely interested in getting anything done, you must pay up. A martini at the bar, not name brand but a well drink, is $10 before tip, and don't even try to make it up by eating through several tumblers of bar snack mix, your stomach can't take it. So, bottom line, when do you find yourself stressing about all these add-ons? When you are sitting in your very comfortable and clean hotel room, with fluffy pillows and turndown service, watching a \"free\" premium channel while perusing the room service breakfast menu that you can't afford anyway. The NBA championship had just started at the Staples Center and so many guests were people with large disposable incomes, who seemed to command the greatest attention from staff. On the plus side, the view from my room was exquisite and made me feel right at the heart of downtown. So I would suggest this hotel only if you have the money to relax there and be taken care of, but if not, then beware of selecting any of Hotwire's unnamed four-star hotels in downtown LA for $60-65 because it's a trap--the hotel will get your money anyway...", "Date": "June 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "ny", "Title": "“great location & price & save the $30 on parking~”", "Author": "NyTraveler321", "ReviewID": "UR32422484", "Content": "got 2 rooms at this hotel from priceline.com for $60/night. the room was great with comfy beds and pillows. bathroom was fill with bath & body works stuff. one of the rooms had a separate bath and shower. we were on the 5th floor so we didnt get much of a view except for the freeway. we rented a car for travel in LA and yes the valet parking at the hotel was $30 a night and it was operated outside of the hotel. but there's actually ALOT of parking garages around the neighborhood for much cheaper. alot of meter parking after 11PM around the block. couple of nights, there were free meter parking right outside the hotel. we parked at an parking lot on 8th st (4 blocks down) for $6 flat rate all night. we only used the hotel for sleeping so this didnt bother us.otherwise parking is very expensive in LA. $4 meters/hr! location of hotel was nice on the week days, during the weekend it was really deserted. also very conveniently located 2 blocks away from the major freeways. went to most of the attractions nearby in under 30 mins.", "Date": "June 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Very safe and clean.”", "Author": "blr5004", "ReviewID": "UR31396367", "Content": "My friends and I went here during the Rose Bowl. We did not have a car so the location was very easy to walk to subway and the bus. Staff was very helpful and rooms were clean. The area seems very safe although on the weekends it is dead, not good if you want nightlife. The only thing we did not like were the pillows. There are good restaurants within walking distance. Overall, great hotel, I am so glad we stayed here.", "Date": "June 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Manila", "Title": "“Just okay.”", "Author": "Seahorsee", "ReviewID": "UR30263480", "Content": "We found this hotel just okay. There was nothing extremely spectacular about it. But we have no major complaints either. One thing we appreciated was that we were allowed early check-in. The rooms were what you would expect of a 4 star hotel. The beds and pillows were very comfortable. There didn't seem to be many guests when we were here. The hotel seemed very quiet. We found the DASH bus, right outside the hotel to be a very convenient and cheap (25 cents) way of getting around.", "Date": "May 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bangalore", "Title": "“Loved the view around”", "Author": "rnraghavan", "ReviewID": "UR28944519", "Content": "We were 10 friends and wanted to visit the Universal Studios. We decided to stay at LA for 2 nights and do a day trip to the studios. We had originally booked some unknown hotel but last minute those guys ditched us by not confirming our booking. We were lucky enough to figure out that Marriot Downtown LA was offerring a very good price (If I remember right it was $129 per night). We had a train station closeby which we used to get to the studios and we had a few stores nearby where we could pick up stuff back home. Overall great stay.", "Date": "April 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Eugene, Oregon", "Title": "“Nice hotel; Spendy parking”", "Author": "UScardinal", "ReviewID": "UR28658141", "Content": "We bid $60 on Priceline.com and got this very nice hotel in downtown Los Angeles. What we didn't plan on was this hotel was valet parking exclusively, at a rate of $30 a night, so there went my savings. The hotel is beautiful, and situated among the tall buildings of the downtown area. We had a 10th floor downtown view, in a beautiful King Bed room. Very nice bathroom, and comfortable bed. Our problem was we were out of our element staying at this hotel, because it is pricey. The coffee shop cost us $54 for the two of us to eat at the breakfast buffet, and that was not including tip. We are more used to a Denny's breakfast. We went on Priceline to save money, but ended up spending more on parking and breakfast, but that doesn't take away the fact that the Marriott downtown is a beautiful hotel.", "Date": "April 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Chicago", "Title": "“Satisfactory for the price in downtown L.A. but needs updating”", "Author": "bellaalma", "ReviewID": "UR27726793", "Content": "My sister and I were in L.A. for an extended weekend (Friday-Monday) during the last week of March 2009 because we were going to the 3 Prince concerts at L.A. Live. We were looking for an inexpensive, convenient and CLEAN hotel in downtown L.A. for our stay. The Marriott was inexpensive compared to other downtown L.A. hotels, and it was convenient enough (walking distance) from the places we planned to see in downtown L.A. The positives: The hotel is clean. There were never any dirty towels or bedding. The staff was very nice, professional and helpful. It also felt safe. Our room was clean; it was a nice size and had floor to ceiling windows with a nice view of Figueroa Street and downtown L.A. from the 7th floor. The beds were comfortable as well. The negatives: This place could REALLY use some updating. The TVs are very outdated. They don't even have basic video/audio inputs. The furniture looks like it is from the 1980s. The carpet is outdated as well. It has to be at least 10 - 15 years old. All the light fixtures are outdated as well. Also, the lock on our door had several loose screws that I actually tightened myself with a pair of scissors. One thing that really bothered me was the lack of free Internet access in the business center. The hotel charges $10 for 20 minutes of Internet access. Neither of has had laptops so we ended up spending $30 on Internet access. Another issue was the refrigerator in our room. It did not work, so the hotel placed a note inside it stating that we could â€œrentâ€� a portable one for a daily fee. Also, the elevators were often slow due to maintenance, and we had to take the service elevators often. The hotel only has one restaurant, which we did not try. However, the Westin is a block away and has more restaurants. There are also other places to eat in walking distance. I would recommend this hotel for a short stay, but I really think that it is on its last legs. A new Marriott is being built in the L.A. Live complex about 7 blocks away, so I can't see them putting much money into updating this one.", "Date": "April 9, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Los Angeles", "Title": "“Horrible Customer Service!!! Dont Expect T Get Your Car Fromk Valet In A Timely Manner!!”", "Author": "rjm805", "ReviewID": "UR27264540", "Content": "I had a presentation to do for my business to. If all went as planned it would have been very lucrative for my business. I was the only one this presentation featured. In other words if I was late it would have made me and my professionalism look VERY BAD because no one would be there to cover me. I made sure I was going to arrive 1hr early to my event in order to set up and make sure everything was going to work as planned. Nobody informed me about a convention on Saturday morning, the morning of my presentation, where the valet would take 45min-1hr to get my truck out of the valet. I told the Valet staff and manager my predicament after about 10minutes of waiting, after 20minutes I realized I was being ignored, and reprioritized. After 1/2 hour I started DEMANDING someone bring my vehicle! I was told it was on its way. I let everyone on the staff there know my situation and NOBODY could get me my vehicle. I even saw them bring people their car that had arrived 20minutes after me. I was now beginning to wonder if my truck had been stolen and this was their way of stalling so I DEMANDED to be taken to my vehicle. As I was getting ready to step in to a ride to the structure my vehicle was at it came around the corner. This was about 50-55 minutes from my original time I gave them my ticket to pick up my vehicle. Needless to say I was late to my presentation, my business suffered because of the irresponsibility of your staff, and made me look completely unprofessional to prominent, professional, future clients. THANKS! This was the absolute worst experience I have EVER had at a hotel! I had many other options of places to stay that night. I chose to use your chain because the price and location were right. I would have paid in the thousands of dollars for a room at another hotel in order to make it to my presentation on time because the $ amount of business lost could be around $10,000 or more. I delt with everyone involved in this situation including Mr. Marriotts personal assistant. They ALL told me my situation was of no importance to them and they ALL said they would do nothing in the way of compensation! DO NOT STAY HERE OR ATG ANY OTHER MARIOTT HOTEL!!! THEY ABSOULTLLY DO NOT CARE ABOUT THEIR CUSTOMERS!!!", "Date": "April 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Boston, MA", "Title": "“Beautiful Public Spaces”", "Author": "boston02118", "ReviewID": "UR26146471", "Content": "Loved this hotel. Very beautiful and comfortable lobby. Cool and soothing. Mainly a business hotel with a downtown location and thoroughly enjoyed my stay given that my activities were focused in the downtown area. Rooms were larger than typical rooms you find at the large chains. Very well-appointed and clean. Nice pool and patio area. Didn't have extensive interaction with the staff, but overall very polite and accommodating staff. Valet parking with in and out privileges. Easy access the Santa Monica and Harbor freeway, and Interstate 5. Finally, the bar in the lobby was fantastic...relaxing place to have a drink and watch a game or chat. Would stay there again in a minute, for business or pleasure. Highly recommended.", "Date": "March 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Pleasant 2 Nights Stay”", "Author": "sillypie", "ReviewID": "UR25357560", "Content": "Stayed here for 2 nights in Oct 08, was part of UA super value deal. My colleagues and I decided to come earlier for some leisure time before transferring to Hollywood area to attend a business conference. I was given a single room with a double bed (the only lady in the group). The room was clean and spacious and I loved the interior decoration, cozy! But being a Marriott hotel, I would expect better provision of room amenities like fridge, sewing kits, toothpaste/toothbrush etc. Only shampoo, shower foam and lotion were provided..Mmm, wonder was it due to the value package... so certain stuffs were not given.. We tried the buffet breakfast on the last morning, limited variety for US$25. Location wise, nothing much to see with tall business buildings. There was a Macy department store down the street, within walking distances. Got a map from the reception which was useful. The nearest Metro station 7th Street/Metro Center was 15 min away. We took the metro on the second day to visit the Ontario Mills(outlet mall) with some train transfer. Overall, our stay here was pleasant and the hotels staff were friendly and helpful.", "Date": "March 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California, Central Valley", "Title": "“Two words \"Loved it\"”", "Author": "erac87", "ReviewID": "UR24222701", "Content": "We stayed at a suite at This Hotel and it was Great!! Everything from the arrival to the departure it was all good!!!", "Date": "February 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "manchester, uk", "Title": "“Great hotel shame about the area”", "Author": "adelenicola", "ReviewID": "UR24085338", "Content": "I stayed at the Marriot for 3 nights and the hotel I couldnt fault. It had a great pool, good choice of restaurants and spacious high quality rooms. The hotel is much grander than most Marriot's I have stayed in within the UK. I would recommend this hotel to anyone who hires a car in LA but even though Downtown has meant to have shifted its negative image I would not stay here if you have not got transport.The neighbourhood is not safe to walk about at night and nobody walks in LA anyway! I would recommend anyone who wants a great location to wander on foot rather than drive to stay in the Santa Monica area-more expensive but well worth it.", "Date": "February 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, CA", "Title": "“Everything you could want”", "Author": "gracek312", "ReviewID": "UR21278623", "Content": "While I can't give this hotel 5-stars, it secures a very, very strong 4 stars in my book. We have been at this hotel many times - basically each time we visit LA from San Francisco. This last time, we were there for a full week, and I remain thoroughly impressed. For Platinum members, their upgrade policy is very generous. Each time we have been there, we have been upgraded to a great suite. One of the times was a junior suite of sorts - which was an enormous room with a bilevel sleeping/living area with nonstop views out the window. This last time, we spent the week in the Vista Suite on the 5th floor (room 501) and it was an outstanding room with floor to ceiling windows on 3/4 walls, huge living room with dining area, a lot of space, a large bedroom with a really comfortable bed, and terrific room service for morning coffee. They were speedy, too. Also - their front desk service is phenomenal. Though we were originally booked for a certain number of days, when we called to change, it was all taken care of without any problems at all, no matter that they were booking a Vista Suite for the standard room price or anything. They accomodated us in every way. I should note, though, that for such a high-class room, their TVs really need some upgrading. They had 24\" tubes... and while this is just a minor details, it's details like this that prevent this hotel from getting 5 stars. Their hotel lobby is large - sprawling, actually, and while the layout is a bit weird (you have to go all the way to one corner to go up to your room), the lobby is always bustling with activity and makes for a good location for people to come and visit you, if you don't intend to head out to eat or drink. There always seems to be something going on, be it a party or convention, upstairs on the 2nd floor. Valet service was fast and efficient, and location is central to wherever you need to go in LA. It's right around the corner from the 110 freeway, and only minutes to K-town, 15 minutes to Beverly Hills (if LA had no traffic, which I should add, never happens), and merely 25 minutes to LAX - by distance, anyhow. I would not hesitate to stay here time and again - and would highly recommend anyone who plans to stay in LA to consider this particular Marriott. Given that I am not a Marriott fan at all (it's my boyfriend who is a loyal member while I am a SPG girl) I have to say that this particular hotel rates up there with Westins.", "Date": "October 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paradise Valley, AZ", "Title": "“Worth it”", "Author": "Papaleadfoot", "ReviewID": "UR21136268", "Content": "Well located downtown and easy to get to this large hotel is well staffed. Had a Vista Suite provided by the Company for business meetings at the hotel, The Vista suites are giant w/large bedroom; bathroom w/separate shower, and gargantuan living room w/dining table. Clean & comfortable. Meeting rooms were set well. Valet parking. Small and busy lobby bar. OK restaurant.", "Date": "October 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Marriott at its best!”", "Author": "Canada_1987", "ReviewID": "UR19935607", "Content": "Booked the same day as arrival and only paid 140$ a night for 2 queens. Check-in was easy, lots of staff on hand. If you bring your car you have to valet check your car. You can go in and out as many times as you want per day but you must phone 10 minutes before if you want your car. 16$ a day for parking. The room itself was great. 2 queens and a large bathroom. We had a great view from a room on downtown LA. The beds were nice and comfy. We ate at the hotel restaurant the Back Porch. Service was good as well as the food. The prices were moderate. You can have a nice meal for under 15 dollars. There is also a gift shop where you can buy snacks. There are some nice reastaurants within walking distance. We went to the California Pizza Kitchen which is about a 5-10 minute walk from the hotel and sat out on the patio. For breakfast during the week, go to the second floor and exit the hotel and walk over the pedestrian bridge that connects to the World Trade Center. Right after you walk in there is on your left a little restaurant that serves breakfast and lunch. We went there for breakfast and it only cost us 4$ and it was great! The swimming pool at the hotel is great. Just missing a hot tub and it would have been perfect.", "Date": "September 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sacramento", "Title": "“The best night sleep since a long time”", "Author": "Melcsike", "ReviewID": "UR19679005", "Content": "I had the best night sleep since a long time. The room was spaces and very nice with a nice big bathroom. Our room was on the 9th floor, overlooking the city, the view was amazing. Very good value for the price.", "Date": "September 2, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Seattle,Wa", "Title": "“decent hotel especially for a business stay”", "Author": "Nabaaty", "ReviewID": "UR18558918", "Content": "Me and my husband found a great \" last minuet deal \" for LA including flight + hotel + car so in this case we did not picked this Marriott. However, we liked the hotel. It was clean and nice and if you are in LA for business, God ,this location is amazing it is just right in front of World Trade Center and many other banks and institutes. We did not like the restaurant and bar much it was pricey for what they offer and you have to use Valet Parking $17 pn, which is not too bad for downtown LA. Over all it was good but if I want to go to LA again for vacation I would not stay there, I perhaps book a room in Hollywood district or Santa Monica beach area.", "Date": "August 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jacksonville, FL", "Title": "“Clean and spacious”", "Author": "nhumbc", "ReviewID": "UR17234880", "Content": "This hotel was very convenient to CA-110 and had no problems finding it. When we drove in, we were greeted right away and opening our car doors and asked us if we needed help with our luggage or wanted to park our car. Check-in was very quick and the staff was friendly. The room was clean and roomy, especially the bathroom. It had a separate bath and a shower. The bedspread was a little out dated, but clean. There were connecting rooms available, which we were in. There was also a cabinet that looks like it is suppose to be a mini bar, but it was not stock or working. The only thing negative about the hotel was the parking. They only offer valet parking for $16.50. I chose not to use the valet parking and park it myself across the street at the world trade center. The parking was only $9.90 with no in/out privileges if you arrive before 10 AM or after 4:30 PM and you could park for 24 hours until the regular rates kick in. This was fine with us since we only use the garage for over night parking. The hotel even has a walkway that connects the world trade center parking garage. Just take elevator to the 1st floor and follow sign to the Marriott hotel.", "Date": "June 25, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Nipomo", "Title": "“Going downhill”", "Author": "GHB2", "ReviewID": "UR17193910", "Content": "I've stayed many times at the L.A. downtown Marriott. Only because it is so convenient to Dodger stadium. I may re-think it after this past stay. The place needs work to put it in simple terms. The elevators were a bit scary sounding and quite shaky. And not all of them were working. The air condition in the rooms and in the hallways wasnâ€™t good enough to keep anything cool. The sports bar only played half of the TV's while we were there. If I didnâ€™t know any better I would say that they are trying to cut costs by not using so much electricity. The concierge barely spoke English and didnâ€™t really understand it too well either. The beds were not the quality Marriott beds that most have already upgraded to. Like I said in the beginning I have stayed here many times and every time I do it seems to be a little more run down or just not up to where it should be. All that said the hotel is still an okay place. It is not a category 5 hotel as Marriott has labeled it though. Hopefully they will put some money back into the hotel otherwise it will be time to look elsewhere.", "Date": "June 24, 2008"}, {"Ratings": {"Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New York", "Title": "“No Security - Hotel will do nothing to stop wild tennage party”", "Author": "theinfluencer", "ReviewID": "UR17064763", "Content": "I arrived at the hotel on 6/14 and actually found the hotel lobby and pool area to be nice. The staff was friendly and the check in process went rather quickly. My room was average and could have been nicer but far from being terrible. The trouble began starting at 1:00am that night when a party for teenagers was being held that night started which may have been related to a group who were at the banquet hall in the hotel. I immediately called the front desk to complain that there were multiple teenagers walking the hallways being loud and slamming doors. I spoke to Mary Grace at the front desk and provide her with the offending room number but the noise and door slamming continued. I called back and asked her what was done and she just said sorry and called security again. I called the office on the Â½ hour repeatedly but again the countless guests and the noise continued until 3:00 where I basically gave up. In the morning I spoke the weekend Manger Jon Carlo and basically he had agreed that the was a situation that was out of control and suggested I speak to the manager Ken on Monday. I told Ken that I expected some kind of response that the hotel owed it to me as a customer to provide me with a secure hotel and quite night of sleep. He asked me what I expected the hotel to do with the situation and I told him that the hotel should have at least walked up to the room and told them guest to stop making noise. The hotel has not compensated me although it was stated that it would consider sending me a voucher.", "Date": "June 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“2nd Stay at the Marriott”", "Author": "life_is_my_vacation", "ReviewID": "UR16076239", "Content": "This was my second stay at this downtown Marriott. Our room was a little bit smaller this time than last, and the rooms are nothing special, but the beds are VERY comfortable and the bathrooms are really nice. The beds have wonderful mattresses with fitted mattress pads and bottom sheets (what a difference it makes compared to most hotels, where the mattress pad and bottom sheet slide into a ball ten minutes after you're in bed), plus the sheets and comforter are very soft. The bathroom is nice and big, with a separate tub and shower with large rain showerhead. We only had one problem - my dad found stains on his bottom sheet - but they sent up someone to replace the sheet and offered us free breakfast buffet vouchers ($20 value per voucher). Overall, this is a fine hotel if you need to stay in downtown LA, although not quite as nice as the Westin or Omni.", "Date": "May 15, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Ann Arbor, MI", "Title": "“Marriott OK for downtown”", "Author": "bagjag27", "ReviewID": "UR15518711", "Content": "Don't stay downtown if you're here on a weekend since it basically shuts down friday night through sunday, and if you don't have a car you're trapped in this urban island of skyscrapers with poor public transportation. If you have to be in this area, however, the Marriott is nice. Comfortable beds, nice bathrooms, good pool. Expensive drinks and food as expected - skip the bar and find the local brewpub 2 blocks away. Parking is $20 per day (and so is the breakfast buffet - skip this too).", "Date": "April 30, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "singapore", "Title": "“It's true, dated and ugly rooms - and tha's the good news!”", "Author": "disneyfan8", "ReviewID": "UR15069190", "Content": "I sure wish I did NOT book a hotel from Priceline (especially using their name-your-own-price option), the few dollars we saved were just not worth itâ€¦ 9 nights of nightmare, April 1 - 10! (Nope, Priceline won't entertain any complaints or hotel replacement.) 1. The first thing that greeted us when we entered the room was a big cigarette burn hole on the curtain. After informing Priceline and the hotel about that glaring hole, they did not replaced the curtain - not even till the day we left â€“ 9 nights later. And this is a smoke-free hotel! That's just the beginning of more lousy things to come from this 4-star hotel! 2. The mini-bar (fridge) looks as ugly as the cabinet that housed it - and it does not work. I was informed by their staff that ALL the mini-fridges in ALL their rooms do NOT work! (Mind you, this is supposed to be a 4-star, world-famous hotel chain with a rack rate of US$169 and up + tax per night !) 3. Everything in the room looks dated because they are very old. The furniture and doors are full of scratches! And if you are expecting Westin-type of beds, you would be extremely disappointed. To be fair, the beds are fine - if it is a Motel 6. Their pillows must be the smallest pillows available in the hotel industry! 4. The TV is at least 15 years old! I know this for a fact as I bought my first flat-screen Sony Wega TV when it was introduced around the mid-90s - yes, the TV in my room is of a much older generation with curved screen! (But at their lobby, they have 2 new-looking, huge plasma TVs. Talk about misleading ads.) 5. No free wireless Net access. Not even in the lobby. 6. Worst of all? The DO not always tell you when your packages arrive! You'll have to check with them daily. They actually told me that I have NO packages when I had 2. Yes, it happened to me â€“ twice in my short stay! 7. To be fair, the ventilation fan in the bathroom works really well, ditto that for their rain shower. 8. The following won't apply to you if you don't mind drinking tap water or paying US$4 per 500 ml bottle of water and if you don't mind taking a cab to almost everywhere as the closest subway station is about 5 to 6 blocks away. Nearest grocery store: 20 minutes walk or US$7 + tip cab fare away. Coming back will be uphill all the way. (The buses that stop near the hotel and run frequently stop running at 6.30 p.m.) The Westin, just opposite this hotel offers their guest free shuttle to many places. To add insult to injury, there are many other better hotels you can stay for less! And those hotels don't fool you by calling themselves a 4-star establishment.", "Date": "April 16, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Washington, DC", "Title": "“Business hotel, efficient with superior room service”", "Author": "urbanlm", "ReviewID": "UR14837409", "Content": "My guy was in LA for a conference and I happily tagged along since it had been a while since I visited L.A., and never really got to spend much time downtown. Turns out, I spent little time exploring downtown or L.A. for that matter. I got to see bits of the \"other side\" taking the subway/ metro from LAX -- super efficient, very easy (though sadly public transportation seems relegated to only those who can't afford a car) -- through some tough neighborhoods. In my 3/4 mile radius on foot, downtown L.A. seemed shiny, corporate, and sunny, but also abandoned after 6ish. The Marriott is well situated for biz visitors. The desk staff quick and efficient. The rooms spacious and acceptable, no particularly alluring details, but everything you'd expect in a decent hotel. What you really pay for I suppose at $300/night is location, location. However, since the conference was ALL IN THE HOTEL, why not pick one at the airport for half the rate? Maybe I'm too practical... Anyhoo, clean, neat. Stuff that stood out? - Room service was amazing -- LOVED their fresh fruit and smoothies, omlettes and hash browns especially. Excellent beef quesadilla, and grilled salmon. Stellar. Maybe that's a function of THIS Marriott. - Roy's restaurant and Takami nearby were both quite sub-par. Roy's wowed us in every other location -- Tampa, San Francisco, Honolulu, Las Vegas, except this one. Takami with it's views are great for happy hour, but little else. Pass on all three of their kitchens, see point #1, order room service instead. - A local friend took me to Korea town which has excellent, excellent Korean fare, and past a number of Mexican joints which we regrettably could not go to. This was within a 10 - 15 minute drive. - Short taxi ride to the Mayan nightclub which if you dance salsa, is an absolute MUST. They have parking at the Mayan, and car rentals were running $15 per day (never seen a more ridiculous deal), but we opted out. - Within a 5-7 minute walk to FedEx Kinkos if you wanted to sit on a computer for longer than 10 minutes (hotel has a biz center at $0.49/ minute), and approx 10 minute walk to a decent Mexican restaurant. All in all, a purely functional hotel. Can't rave about it, but a good stay nonetheless.", "Date": "April 6, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Tabasco", "Title": "“Do not stay here!”", "Author": "A_ViLo", "ReviewID": "UR13998908", "Content": "I stayed in this hotel with my family. The service was ok, and the staff seemed good at the beginning but then one day we left our camera in the room, when we return the camera wasnÂ´t there! We called the front desk personal and they told us that they were going to start a \"investigation\", the only person beside us who entered the room was the housekeeper. They asked her and she said that she didnÂ´t take it. AND THAT WAS ALL THEY DID! they didnÂ´t do anything else and the people from the front desk didnÂ´t even care. The worst experience IÂ´ve ever had. I expected much more considering what we pay. Follow my advise, do not stay here!", "Date": "March 2, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sacramento, California", "Title": "“Very Poor Staff at Marriott and Bad Bed”", "Author": "monarchtravel", "ReviewID": "UR13770478", "Content": "After paying $240 a night plus $15 a night for parking I expected more from the Marriott. We were very unimpressed with the staff at the Marriott. When arriving, the door men watched us as we struggled to get our luggage out of our trunk and into the hotel until my husband asked for some assisitance. In the bar and grill we told the waitress that we were in a hurry in order to get to a basketball game and she proceeded to ignore us throughout our dinner, and we in fact had to physically track her down to get our check. When we departed we called ahead for car to be brought up which it was, but it was parked way down the driveway and as we once again struggled to take our luggage to our car no help was offered. Besides the unfriendly and unhelpful service throughout our stay the bed was extremely uncomfortable - sloped towards the middle. The bedding was beautiful but that didn't make up for a difficult nights sleep in the old bed. I will not be coming back again to stay when they charge this kind of money for what they offer.", "Date": "February 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“needs renovation!”", "Author": "FunMom702", "ReviewID": "UR12923398", "Content": "Recently stayed at the Marriott for business travel, needed to be close to the convention center. I would not rate this hotel as a 4 star property at all. Maybe a 3 star. We changed rooms after the first jr. suite they gave us on a lower floor was in desperate need of renovation plus the heat did not work. (this room would not even qualify for 2 stars!) We were moved to a higher floor and although the room was better, it still was more like a 3 star hotel. Once again, the heating did not work well. On a positive note, the bed was comfortable and the service was great. They say they are renovating this year, so maybe after the completion, we would consider staying again.", "Date": "January 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Folsom, CA", "Title": "“Swanky Hotel”", "Author": "xmasaddict", "ReviewID": "UR12700595", "Content": "Beautiful hotel with nice rooms. Valet parking is the only type of parking that is available and they charge $16.00 per night (tip not included). The Marriott has a 4-screen movie theatre just outside the hotel and down some steep stairs. It cost us $9.50 per adult to see Will Smith in I Am Legend. Theatre has very shabby decor and unkept bathrooms but it gave us something to do that night. Ordered a drink from room service. They were very prompt and the drink was good. The two queen-sized beds were very comfortable. Nice view of the city from our window. Next to the freeway and busy streets but we were on the 14th floor (PH floor) so our sleep was not disturbed by traffic. We picked this hotel since it was close to all the sites we planned on seeing the following day. Chinatown (in bad shape, I recommend skipping it) parking was $4.00, Olvera Street (Lively and FUN!) parking was $6.00 and La Brea Tar Pits (Interesting and Informative) which cost $7.00 for each adult admission and $4.00 for parking but was well worth the price.", "Date": "January 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "las vegas", "Title": "“Nice hotel, bad restraunts”", "Author": "jenandcraig", "ReviewID": "UR11878068", "Content": "I stayed at this hotel December 14th thru December 17, 2007. It is a very pretty hotel with comfy beds, clean rooms, nice bathroom. Mine had a seperate tub and shower, phone near the comode, and granite thru-out. Very pretty.....You do have to valet park, like at most places you stay at downtown, and I found that is was on the cheap side for only $16.50 a day! The check-in was very easy and staff is helpful with printed directions for your traveling needs. The Marriott has 2 restraunts and 1 bar. So I decided 1 of the nights that I was going to try one of the 2 and see how good they were. To my surprise, both restraunts had the exact same menu, which I thought was kinda weird, but whatever. So my guest and I both order a salad apiece (mine a garden salad with ranch (which was sour and the lettuce was limp), his a nice chef salad with alot of ham and turkey! Then we ordered 2 different appetizers each, I had the Monty's Special which consisted of half a chicken quesadilla, chicken wings, a tasteless shrimp skewer and lobster ravoli with some stange sauce atop (yuck!). My guest had tempura like, itty-bitty shrimp and fried calamari (dry and again tasteless..). We only had soft drinks and after our boring and lack-luster dinner and $55 later, I'd say walk about 4 blocks down and you'll probably have a much better dining experiance and probably cheaper! Overall, this is a very nice place to stay.", "Date": "December 21, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Seattle, Washington", "Title": "“Typical Marriott”", "Author": "Maximr", "ReviewID": "UR11074200", "Content": "This hotel is a typical Marriott property. The rooms are well appointed and clean, and the service is as usual. I've stayed here several times, and it's convenient, the check in process is fast and checkout can be done over phone or TV. They offer the \"concierge level\" rooms at a premium rate. Stayed in one also. In addition to the usual room amenities it had a shoe polish machine and an additional clothing rack. Other than that, staying on this level gives you access to the concierge lounge, where they serve Hors d'Oeuvres in the evening and breakfast in the morning. The evening reception doesn't include drinks and is scheduled between 6 and 10 PM. In my opinion, the benefits of the concierge level aren't worth the rate premiums, but some people may find it a nice touch on their stay.", "Date": "November 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Middlesbrough,UK", "Title": "“Nice hotel”", "Author": "DavidAndPed", "ReviewID": "UR11014970", "Content": "We booked a deluxe room and got a penthouse suite. It is very nice. We were tourists however the hotel seemed to be geared up for business use. You need a car to get around but if you want to be on foot I think it is about 10 minutes walk to 7th street. There is a small Macy near there, most of restaurants around this area only open for lunch time. We walked to the Staple Center to see L A Kings Ice hockey, took about 20 minutes walk. Enjoyed our stay there...", "Date": "November 23, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "USA", "Title": "“Stay in hotels 20-30nights a year: Stayed here twice Nont Impressed”", "Author": "GQue", "ReviewID": "UR10353812", "Content": "Other options should be considered if staying downtown. Also in a dead part of town for food and theirs was nothing to write about. Stayed twice in past 12 months. Both times found rooms very outdated circa 1970's flashback and plain for the price. $200-280 per night. Going back to LA in a few weeks and looking elsewhere to stay. Also Marriott asking $289 when other 3-4stars are at less than $200. I would never pay $289 for this dump. Nice lobby and it ends there. Each time had to move because of noise, given a room facing highway. First time found out when I couldn't sleep, second immediately asked to be moved and told no other rooms. I would of checked out, but couldn't get another place for around the same price and only had one night left.", "Date": "October 26, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "California, USA", "Title": "“Great Time”", "Author": "tootyfancy", "ReviewID": "UR10074243", "Content": "I booked this hotel through Priceline (3-star), although I think it's a 3.5 star. Got a great deal, but didn't know what to expect. We skipped the valet parking and found a metered spot right outside on the street, which ended up costing us $5. The hotel was packed, but the room on the top floor was really quite. Great views of downtown and the 110 freeway, you can definately hear the traffic, but in a babbling brook kind of way. I'm a light sleeper and had no problems. The bed was clean and comfy. Walked to the Disney Hall for a symphony, which was a decent walk. There's a Laemmle theatre downstairs and Ciudad restaurant 1/2 block away. Happy hour from 4-7 weeknights, great mojitos/sangria. Room service was good.", "Date": "October 13, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hong Kong, China", "Title": "“Good business hotel in financial district”", "Author": "Woodai", "ReviewID": "UR10028147", "Content": "I stayed at this hotel for one night on a stopover from Costa Rica to Hong Kong. Compared to other hotels I've stayed in in the United States, I was pleasantly surprised about this hotel. It had good, speedy check-in service, a great big room, and for $121 my room rate was cheaper than most hotels near LAX. I ate at the cafe downstairs and had a really good Chinese Chicken Salad. The service was speedy and very efficient. The only downside about this hotel is it's in the financial district so if you need to go shopping in Beverly Hills you'll need a car. I would go back again.", "Date": "October 1, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "San Diego", "Title": "“Rooms Need A Face Lift!”", "Author": "AquaV", "ReviewID": "UR10026729", "Content": "We will probably not ever stay here again...or at least, not unless we hear that the rooms have been updated and remodeled. The rooms need to have the popcorn removed from the ceiling. All furniture is super old and outdated. Nothing impressive in the rooms at all. There was not even a light over the shower or toilet, very dark! The lobby is nice. It is NOT a good representation of what you will see once you step foot inside your room. This was the grossest Marriott I have ever stayed in. It was difficult to communicate with some of the staff and they were not very helpful.", "Date": "October 1, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "San Francisco, California", "Title": "“skip the Marriott, stay at the Omni”", "Author": "akimi", "ReviewID": "UR8839724", "Content": "If you have to stay downtown, stay at the Omni. Cons: On all my arrivals, the doormen just stood around while I carried my own suitcase, opened my own doors Room service food - grilled chicken, who knows when it was ever grilled, it was barely thawed, when I bit into my supposed grilled chicken it was icy cold (although it did arrive quickly)Shabby, 50s style decor, stains on the bedding. lots of noise through adjoining doors. hardly any bathroom amenities, just the bare minimum, shampoo, soap, conditioner. they were too cheap to buy a TV stand, so left the old mini bar and frig which was empty and non functional, to put the TV on! Pros: the front desk service was very good, I never had to wait to check in or out. decent lighting", "Date": "September 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Good Location”", "Author": "teddylisa", "ReviewID": "UR8690637", "Content": "We stayed there from Sept 2-8. Pros: -Good location, quiet and clean. right next to the highway. -Beautiful hotel, high ceiling and great customer service Cons: -expensive: food (but good: breakfast buffet : 20.00), valet parking is $18.00 per day, plus tipping ofcourse.", "Date": "September 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Great Hotel - In need of new decor”", "Author": "FrequentTraveler1973", "ReviewID": "UR8689394", "Content": "We recently stayed two nights during a trip to L.A. This is a nice, clean hotel in a great location. Aside from the temperature in the room being hard to maintain, our stay was very enjoyable. The hotel could use an upgrade to its decor and getting your car from valet becomes a hassle if you like to stay on the go. Overall, it was a good stay. I would use this hotel again after testing out one or two other area hotels.", "Date": "September 10, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Minneapolis", "Title": "“Decent for short stay”", "Author": "bdouty", "ReviewID": "UR8665191", "Content": "I stayed here for four nights recently while taking my daughter to USC. Easy to get to from the airport , convenient to USC, and not too hard to get to attractions of Beverly Hills, Hollywood, Santa Monica as long as you have a car. Usual good Marriott service. It could use some updating - the carpet in the lobby is atrocious! Room was clean and the bathroom appeared to have been recently updated, surprisingly comfortable bed (and I sleep badly at most hotels). We had breakfast once in the hotel, very overpriced mediocre food. It was a good value overall for what I paid, but would not recommend it for LA tourists given its downtown location.", "Date": "September 6, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "SEA", "Title": "“Great Hotel except for one thing”", "Author": "dudevt", "ReviewID": "UR8655713", "Content": "This is a great location right in heart of downtown close to disney concert hall and central library. It has grandiose looking lounge with extremely large and spacious room. But the highlight is the bathroom - huge clean and plenty of granite. The only drawback is that hotel has valet parking only for $16.50/day. The valet service is very poor . We waited for about 30mins in lobby even after we had called in from our room to have the car fetched from garage well in advance. The valet ticket gives about 10mins max time. Overall I would recommend this hotel if you are not driving.", "Date": "September 4, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Bradford", "Title": "“Fantastic Hotel, bad location for tourists”", "Author": "TeeJay33", "ReviewID": "UR8283827", "Content": "The Marriott is a fantastic hotel with great amenities. It is clean friendly and very accommodating. The only problem is the location. This hotel is ideal for business travellers, but for tourists there is very little you can do in Downtown LA. The underground and taxis are very convenient, but we would suggest stay North Hollywood if your on holiday otherwise you will spend a great deal of time and money in cabs or on the tube. This is definately the best Marriott we have stayed in in any country. Thanks", "Date": "August 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Essex, UK", "Title": "“worth the stay”", "Author": "matjackson", "ReviewID": "UR8203377", "Content": "excellent service, rooms big enough and very clean, some noise from freeway, although we preferred this view and spent 8 nights overlooking it, so def no problem. pool ok, but tending to the shadey, so not muchgood after 5pm. weekends cheaper by a long way and included breakfast buffet which was awesome ( if free) but could be beaten for value in a million LA restaurants if not! valet parking excellent service and well worth it here, with the valets very knowledgeable about routes and distances to attractions/malls etc. Not too far from anywhere....theme parks (incl 6flags), hollywood, restaurants as its straight onto Wilshire blvd and also the i5. Go to the Ivy from here, superb night out. watch the traffic on the 5 and 110,101 esp in rush hour and tak an alt route thru the boulevards and save hours!", "Date": "July 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "CALIFORNIA", "Title": "“NICE & CLEAN”", "Author": "FRANK57", "ReviewID": "UR8184047", "Content": "Rooms are clean, and staff is polite. Beds are very very comfortable. Lobby is inviting for lounging and having a drink. As of 07 the whole hotel is non smoking. Hotel is centrally located in downtown, and accessible to all major freeways. Although mostly labeled as business hotel, itâ€™s also good for vacationers. The hotel is close to little Tokyo, which has some great cuisine. Try Sushi Ghen & Shabu Shabu. Jump on the freeway, and Dodger stadium, Pasadena, Hollywood, Santa Monica are close. Yes downtown is desolate at night, so do not go walking. However during the daytime itâ€™s ok. For the more curious, walk through the historic core on Broadway Blvd. This is the historic theater row district. Also try Spring Street, the historic financial district. If your stay is strictly business, you will find the hotel meets all you needs. Parking is valet only, $16.5 per day.", "Date": "July 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Oasis LA”", "Author": "Spinoff55", "ReviewID": "UR8132230", "Content": "Great place to stay, even for a local. Attended a two-day seminar â€“ so I got to see quite a lot of this hotel. Great service, excellent amenities, terrific location, fantastic room. Even the food from the little patio place was very nice â€“ especially given that it was from a hotel. The breakfast buffet is a great deal! And I absolutely fell in love with the onion soup â€“ not many places make a great onion soup. Cool lobby painting too! I highly recommend this hotel for business stay-overs. Felt very safe there too.", "Date": "July 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Geelong", "Title": "“Loved it for one night stay”", "Author": "maryr1", "ReviewID": "UR7668940", "Content": "I stayed here for one night before beginning a tour. It was an absolute joy. Desk staff were more than helpful with suggesting dining and shopping options, the store in the foyer was well stocked, restraurants looked busy and the hotel felt classy and homey. I had a room on the 9th floor that looked over the freeway, pool and city, and found that was quite pleasant to look at surprisingly. The room had floor to ceiling windows, a very comfortable king bed, fantastic bathroom and fluffly robes. I stayed in watching TV in bed and fell asleep very comfortable and happy. Check out was easy, quick and friendly - would stay there again on return to LA very happily.", "Date": "May 21, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Sydney, Australia", "Title": "“LA is just one big freeway...”", "Author": "FrequentFrier", "ReviewID": "UR7402173", "Content": "The Harbor Freeway goes right by this hotel - and if you have an odd-numbered room you will hear it, all night. For some unknown reason, the hotel is not soundproofed properly. If you need to stay here, ask for an even-numbered room away from the Freeway. Otherwise, the hotel is clean and the staff seemed efficient. I ate elsewhere, so cannot comment on the food etc. There were some panhandlers in surrounding streets, but also plenty of cops on bikes and in cars. The convention center is a fairly long walk, but straight down the street.", "Date": "April 20, 2007"}], "HotelInfo": {"Name": "Marriott Los Angeles Downtown", "HotelURL": "/ShowUserReviews-g32655-d113221-Reviews-Marriott_Los_Angeles_Downtown-Los_Angeles_California.html", "Price": "$194 - $343*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">333 S Figueroa St</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">90071</span></span> </span></span></address>", "HotelID": "113221", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/79/2c/792c904fa134cb8942e9dfb49bf397658large.jpg"}}