{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Amarillo, Texas, United States", "Title": "“better than expected”", "Author": "Brandon T", "ReviewID": "UR135805724", "Content": "Short and Simple: Talk to Elizabeth. Most friendly host/front desk Staff ever. (where to go, what to do, etc etc. Answered all questions and made sure the stay was excellent) Price was exceptional for the service. Rooms were clean, though not immaculate. A/C worked just splendidly. Construction wasn't that bad in term so noise. Room: Agree with one reviewer that hotel was not as lovely as the photos on the website, but it wasn't moldy or disgusting like the other reviewer said. The room was better than the price paid ($95/night). Bad: No service for Valet when coming in on Friday. (Although this is probably due to excessive amount of people checking in and UPS coming. Thus no room and had to drive around and park in the middle of the street in order to get in. )", "Date": "July 30, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "", "Title": "“BAD Experience”", "Author": "Kemoschwabby", "ReviewID": "UR135745816", "Content": "When we arrived at the hotel, there were upset guests ahead of us in line, They had been given a room that was already occupied. The situation was resolved but it left me wondering if the front desk staff would be handing out keys to other guests for our room also. We were in New Orleans for three days and I have to say the hotel's location and price were pleasant surprises. Unfortunately, not all of our surprises were so pleasant. On our second night there, as we prepared for bed, we found a large wad of chewing gum between the top and bottom sheets. It somehow got there when the room was cleaned that day. The front desk staff was very quick to respond but did not seem surprised at all. No apologies were offered---just a smile and a shoulder shrug. Later that evening, the bathroom was FLOODED when the toilet overflowed. Again, the front desk staff was quick to respond and, this time, was apologetic about the situation. The gentleman who showed up with a plunger shared that \"this happens quite a bit\". The safe in the room worked at times but was not consistent. Usually that would not concern us but we felt the need to lock up valuables since the front desk appeared to be handing out room keys randomly. It was just difficult to ever feel comfortable with all these negatives taking place. Spend a little more and save yourself the trouble.", "Date": "July 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Richardson, Texas", "Title": "“Affordable hotel”", "Author": "florida_girl1206", "ReviewID": "UR135620477", "Content": "I stayed at the hotel in July 2012 for a business trip. It is convenient to restaurants, stores and attractions. It is 2-3 blocks from Canal Street. The hotel is going through a huge transformation in the lobby so wonder if the rooms will also be updated. The sleeping rooms are simple and fairly small. But it served it's purpose - I have a desk to work and a bed to sleep in. I do have to complain about the bathroom. There is really no place to place your toiletries. The hotel does have a restaurant but cannot comment on it because all I ever got in there was coffee. I would consider staying here again.", "Date": "July 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Best and Most Beautiful in the City!! Great guest services too!”", "Author": "KSKennedy", "ReviewID": "UR135555428", "Content": "I had to be in New Orleans for an event and was concerned about the high costs of all the well known places I was finding when booking my flight about 45 days before.. I used Hotels.com and came across a 4 night deal that seemed too good to be true..I grabbed it fast and saw that the location of the hotel was right in the middle of all the action AND the event I needed to attend..!! I pulled up to the hotel and was AMAZED at how beautiful and brand new the entire lobby was! It was clear there was construction going on but only to make the place even more beautiful than it was already is.. ! Of course I was VERY much earlier than check in time and the desk gal was more than willing to help me out and get me into a room that had been cleaned and readied so I could relax before I started my event..Huge PLUS ..! The room was clean and sparkling and every extra touch was right there waiting for me..including an iron and a wonderful new flat screen tv..Our room was even equipped with a frig and microwave tucked neatly away in an cabinet. I could make my coffee in the AM and there is a wonderful cafe attached to the place as well if you want to take time for a nice breakfast! Each and every employee of the hotel was gracious and over the top accommodating and I truly looked forward to getting back to the property at the end of some very grueling days! Beautiful parks all around and loads of great cafes and shops all along the short walk to any of the attractions all nearby.. And..the airport shuttle knows them well and gets you right to the door from the airport for a mere 19 dollars each way ..!! I only wish I could have spent more time there but can tell you as a first time visitor to the New Orleans area, that this will be my ALL THE TIME HOTEL if I am ever here again..In fact, I might even plan a trip that isn't work so I can spend a few days and know I have a great place to hang my hat!! As a business owner I can tell you first hand..ignore ANY bad reviews of this wonderful jewel... They will go above and beyond to make your stay a pleasant one and when the final construction is done, I know it will be even more enchanting!! Thanks to the entire crew for making my first time in the Big Easy such a wonderful stay!! KS Kennedy , Pittsburgh PA", "Date": "July 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Dallas, Texas", "Title": "“Good deal for the money”", "Author": "Lynn J", "ReviewID": "UR134839369", "Content": "My husband and I stayed at Parc St. Charles for 3 nights in June 2012. The location was good , a little far from the action for my taste. When we registered they were doing construction in the lobby. It was crazy loud, we could hardly hear the front desk staff. Truth be told, if we had known about all the construction, we would have booked another hotel. Hallways and elevators were very hot. Room was very hot when we entered, set at 85 degrees. After we turned down air it was ok. Room itself was very nice and clean. Great big beautiful window that overlooked a park. The bathroom was another story. Looked very old, needed updating. Mold was in corners of tub, and on floor near tub. Wallpaper was peeling. Just felt rundown and not clean. Wished I had brought shower shoes. Yuck! No pool. Overall , it was ok for our money. It's not a pretty hotel from the outside. It's just a steel building. So , if you're looking for history this is not the hotel for you. When we go back we will probably stay at another hotel with a courtyard and pool.", "Date": "July 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“End of a two week road trip with husband and brother”", "Author": "Alene M", "ReviewID": "UR134781782", "Content": "We had been on a two week road trip from Dallas,Texas to Atlanta to Myrtle Beach to Daytona, back to Atlanta an then to New Orleans and from there back to Dallas. My brother had made reservations and when we arrived at Parc St. Charless and saw all of the renovations/remodeling going on, I was devastated. It was so noisy that I knew I would not get a good nite's rest. Well to my surprise, everything was excellent. The workers could not be heard from my room and everyone at the front desk went out of their way to make our stay was as pleasant as possible.From the sales ladies to their general manager Manny, everyone was there to please and I have never felt so welcome and treated so nicely. Every time we passed a staff member, we were asked how was our stay. If everyone keeps up this positive attitude and atmosphere once renovations are done, this place will probably stay book. Think I will try and leave a lasting impression so I can come back too:) Alene Mathis-Smith", "Date": "July 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Great People/Excellent Experience”", "Author": "Michael H", "ReviewID": "UR134289838", "Content": "Even with the hotel lobby under construction my stay at the Parc St. Charles in New Orleans was in every way comfortable and wonderful. Ryan White was working at the front desk when i walked in and he did everything one could hope for to get me set up comfortably. He took his time and carefully listened and communicated so clearly about what the hotel offered. After that very kind introduction to the hotel, guess i was less surprised that all the people working there were interested in making sure this experience was an excellent one. All of the folks at the front desk were eager to accommodate and assist. Funny, i met the Chief Engineer in the elevator and even he showed sincere concern. (can't remember his name) The room was comfortable, clean, quiet, and light. The walls were almost all window. The decor both homey and ergonomic. The Housekeepers are quiet and not overly interested in rushing you out so they can get their work done. There was a quiet patience that permeated this entire building that i was unaccustomed to. In the end the the most important component of hospitality and comfort has to do with the way people make you feel. This hotel is full of pleasant, intelligent, kind people that understand what it is to be on the other side of the counter. The rooms are great and the people are extraordinary. Though i tried to meet him while i was there, understand the staff was mostly hired by or at least report to the general manager Manny Singh. This guy knows what to look for it seems. i don't care about points and diamond status - i care about people. I will return to the Parc St. Charles in New Orleans. These people made me eager to return to the city. Ultimately that is how it works. One returns to a place because they remember the way they felt there. Thanks to the Parc St Charles for doing this for New Orleans. i had never been before and had not planned on returning...but now i know i will...i took a stack of business cards to hand out here at home. Stay at this hotel because you always hope the good guys should win. Theses are good people...they should win. Michael Hill Miami Florida", "Date": "July 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New Orleans", "Title": "“Renovation but Great Service”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR134095048", "Content": "My friend and I came in town during the holiday weekend. We were checked-in early (around noon opposed to 4pm stated time) without any issues or extra charges. We had hoped to book a double, but with the deal it was first available. The receptionist found a king for us. She was very helpful and pleasant. They were doing renovation construction during our stay there. There wasn't any noise that disturbed us it was just a little tough getting around the hotel with all the workers in the small space. The restaurant was also closed due to construction. I just wish we would have been given a heads up about this.", "Date": "July 11, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Albia, Iowa", "Title": "“nice clean downtown hotel”", "Author": "Ourfamilyof4travels", "ReviewID": "UR133281919", "Content": "We recently stayed in New Orleans for 2 days and were looking for a hotel in the downtown area to stay. The room was priced very good ($75/night). We had a very nice corner room with a nice view of downtown. There is valet parking for anyone who is driving. We would definitely stay here again.", "Date": "July 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Salt Lake City", "Title": "“Inexpensive, Needs Work”", "Author": "KeldiKlutz", "ReviewID": "UR132838960", "Content": "I stayed here three nights on a trip to New Orleans. The price was excellent (about $85/night), particularly given the great location, but the hotel really needs some work. The main lobby is currently under construction, which is a good sign. However, the rooms (a friend is here in a different room) are in pretty bad shape. My room had a big hole in one wall, several peeling wallpaper patches, and 10 or 12 screw holes in the walls above the beds where art used to hang. My friend confirms similar problems in his room. Other problems include a shower that is lukewarm at best, and peeling wallpaper in the bathroom. Oh, and the controls in the elevator have displays that don't work, so every time the elevator gets to a floor, everyone waits for the door to open to see what floor it is at. Finally, the rooms don't have amenities such as a fridge or microwave. On the other hand, the place seems quite clean, and the beds are decent, plus a nice, large flat-screen TV. If the rooms will be renovated, in addition to the lobby, this could be a really nice place to stay.", "Date": "June 26, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Schulenburg, Texas", "Title": "“wait until the renovation is finished”", "Author": "michael c", "ReviewID": "UR132779094", "Content": "Our experience started out disappointing from the start. We paid for valet parking and when we got to the hotel there were no luggage racks to put our bags in. We had to carry all of our bags and then help my girlfriends family who was also staying at the hotel without an offer to help from the hotel staff. After a long 7 hr drive to get there, I just wanted to take a shower before we went out but there was ZERO hot water. The staff was apolegetic and sent maintenance right away. For some reason the maintenance man replaced the faucet which had no affect on the hot water but we couldn't wait any longer and just went out without showering with the promise that it would be fixed. The next morning when I went to take a shower it was still cold. After they unsuccessfully attempted to fix it again they gave us another room and comped our first night. The next morning we were awoken at 7:30 in the morning to the sound of a small jack hammer busting out granite tile directly beneath us. Needless to say it was very loud and annoying for the next couple of hours until we got fed up and went out for the day. I paid $2 for a small coke from the hotel vending machine in the afternoon. The machine never gave me my soda and when I informed the front desk I was told the manager wouldn't be in until tomorrow to refund my money. All in all our stay has been disappointing. The staff tried to be accommodating but the hotel was in disarray. I wish they would have said something about the renovation when we were checking out hotels and we would have gone somewhere else.", "Date": "June 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando", "Title": "“Very convenient location and decent rates.”", "Author": "Ogusch", "ReviewID": "UR132195349", "Content": "The hotel is located within walking -and safe- distance from the French Quarter. The staff is friendly and the property, although at present (June 2012) undergoing some renovation, is quiet and clean. The rooms are comfortable. The rates, for hotels in that location and level of comfort, are adequate. For those arriving by car, as we did, it also offers valet parking", "Date": "June 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "McConnelsville, Ohio", "Title": "“Ok for a few days”", "Author": "Trevtra", "ReviewID": "UR131490361", "Content": "New Owners so remodeling going on. Bathrooms have issues. Need better vents, tp to close to shower which gets wet, no stopper to take bath just plain small. Cafe is pricey. Totally smoke free hotel now. Would be nice to have 1 floor for us smokers. Will look for other hotels next trip.", "Date": "June 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Solid, clean”", "Author": "umich_fan1", "ReviewID": "UR131107387", "Content": "Me and 3 buddies stayed there in late April. We were in N.O. for a bachelor party and picked Parc cause of its reasonable price and proximity to Bourbon St. Construction was going on outside of the lobby, but it didn't interfere with us in anyway. The elevators were really slow and it seems like they could used another one. The room and bathroom was a little small, but met the standard for cleanliness. We didn't have any issues with guests in neighboring rooms or problems with noise. The hotel was like 2 blocks away from Bourbon St, a 10 min walk. Any decent hotel closer to the action would have been +$35 more a night. The employees were helpful when we asked questions. The hotel is in very close walking distance to various restaurants. They had a little restaurant on the 1st floor. We never ate there but it looked to always be at least half full. It was about 30 minutes or so to the airport, which isn't horrible. Good value overall.", "Date": "June 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“A lovely time there”", "Author": "Robsigns62", "ReviewID": "UR130718354", "Content": "I was there with a travel group mostly from the Chicago area. I love travel, and always appreciate my accommodations. This hotel was no different. Yes, the elevator tends to be slow, and yes, there was renovation taking place when we checked in. These things happen, and did not directly affect my paid-for space in the building....not negatively, at least. The bed was really wonderful, as were the TV, shower, and AC!! Much appreciation to the staff of the hotel, and to the folks working to make it a nice looking/functioning hotel for the business district. Thank you for everything!", "Date": "May 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tampa, Florida", "Title": "“Pleasant experience”", "Author": "Ronda R", "ReviewID": "UR130221209", "Content": "We checked in on May 16 and the front desk staff was very pleasant. The room for 3 was a little small but for sleeping and changing - it was sufficent. DIdn't like having to go to another floor for snacks and a drink since elevator was so slow. The room was clean except for some ketchup on the wall by the desk and a hamburger wrapper under the desk. Only major complaint was checking out on May 18. The front desk clerk was very unfriendly, he never smiled and didn't thank us for staying with them. No personality whatsoever. Glad he wasn't the one that checked us in or would have made a first bad impression. Renovations going on but didn't bother us - would definetely stay there again.", "Date": "May 19, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Redondo Beach, California", "Title": "“never again”", "Author": "Lida J", "ReviewID": "UR129620645", "Content": "while the location was great, both for walking to different areas and accessing trolleys and buses, i can't recommend this hotel. the room was actually ok, but the bathroom and everything to do with the bathroom, was very disappointing. a cracked shower, a showerhead that sent water everywhere, a shower curtain that didn't keep water in (even when draped inside the tub), and quite possibly the lowest quality towels ever. the front desk staff, while nice, really struggled to manage and maintain the billing processes. there is a ton of construction going on, so there is very little room to move around on the ground floor. and a very very slow elevator. i hope after the construction ends, they will recover a bit. but for now, i would not recommend the hotel.", "Date": "May 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Thibodaux, LA", "Title": "“LOVED OUR STAY !”", "Author": "ytheLouisiana", "ReviewID": "UR129544456", "Content": "Planned a long weekend stay in New Orleans for Fr. Qtr Festival. Stayed April 14-16 and had a great time. I was very leary about the hotel - after reading some of the negative reviews - but the hotel was very comfortable. We had a corner room with two full walls of windows - overlooked the park and streetscape down Poydras. The room was large, bed was comfortable. Could not ask for more. Hotel staff was extremely helpful and we got a great price $113 per night with a two night minimum. The hotel cafe downstairs for breakfast was great! Also walked down a few blocks to Grand Isle Restaurant near Fulton Street - cute little area. Great food!! Hotel was in walking distance to everything we wanted to see. Highly recommend this hotel - can't wait to see it with construction completed.", "Date": "May 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“Jeremy & Lizzy!!”", "Author": "SDgal1", "ReviewID": "UR128995973", "Content": "I went to Parc St. Charles on a recommendation from a friend. I was originally staying at the Intercontinental (across the street) and had a horrific experience! I went to Parc St. Charles and approached the front desk to see if they had any availability. Immediately I was greeted with the utmost Southern Hospitality by Jeremy, who was darling! He upgraded me at no charge to a rooftop suite and I had the best experience EVER! The wi-fi was better than at the intercontinental and the room was luxurious and gigantic and way cleaner! I had a view of the Mississippi River and bridge and had a kitchen, living room, and bedroom with wall to wall ceiling to floor bay windows. It was an amazing 360 view of NO!!!Anytime I called or had a question for front desk, I usually talked to Lizzy or Jeremy who were SUPERB!! Friendly and went out of their way literally to make sure I was comfortable. Room Service was amazing! Seriously have never had a better experience. Only 2 gripes: The elevator is pretty slow and could use repair and there was one front desk girl (African American girl) who was not friendly to me and pretty rude to other guests in front of me. Her and a security guard were rolling their eyes and laughing at another guests for needing help with using the shower. My Advice: Just go with Jeremy... he is the BEST (and needs a raise for all he does!) Lizzy was a doll too! I am a student and was on a serious budget and the price was excellent!!! (79$/a night!) I expected it would be a motel-like setting for that price but boy was I surprised!!! I am recommending my room #1102 and the hotel to ALL of my friends and family! Absolutely great introduction to my first time in New Orleans! I will be back for sure!!! :)", "Date": "April 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Athens, Ga", "Title": "“Awesome staff”", "Author": "lauren s", "ReviewID": "UR128591082", "Content": "Right when I got to the Parc St. Charles, I knew my trip was going to be great. I stayed there for French Quarter Fest with a few of my friends and had a wonderful experience. Jeremy and Lizzie were working when I checked in, and they made sure that everything about my experience there was nothing below superb. Jeremy referred me to some great places to eat and different bars to go to. I have to say, I have never had an experience at a hotel with someone so friendly and helpful as I did at the Parc St. Charles. I would definitely recommend this hotel to anyone visiting New Orleans.", "Date": "April 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Escondido, CA", "Title": "“Location is good, nothing fancy”", "Author": "SoCalSonian", "ReviewID": "UR128494988", "Content": "I stayed during Final 4. Prices were absurd, but still way cheaper than other places the same weekend. This is a 2.5 star place but the location is great. Could easily walk to French quarter, Bourbon St, St. Charles Cathedrial, Superdome, Convention Center all in about 10 minutes. Note: They are all in opposite directions if you are a 1st time visitor to N.O. Elevator is horribly slow. Had great service from Sade at front desk on night shift. Was satisfied by room quality (again, don't expect fancy but fine for 3 star place). If you need a good central home base and aren't too picky this place is great.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Seminole, Florida", "Title": "“Not worth the money”", "Author": "Sternsl", "ReviewID": "UR128429585", "Content": "The hotel was ok but not worth the price. I was there for the French Quarter Festival, and it was quite a trek to the stage by the Aquarium. There were no refrigerators in the room as stated, but there was an empty space where they should have been. The room was quite dark, and there was no exhaust fan in the bathroom. There was only one elevator, and it was quite slow. The staff were helpful, in general. We were sleeping in after a late night, and they were doing construction at 9:30. When I called the front desk, they offered to change our rooms. We had laready unpacked so we didn't mmove.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Orleans", "Title": "“Location and Staff make this hotel!”", "Author": "tangeron", "ReviewID": "UR128406284", "Content": "Had the occasion to stay at this hotel two weeks ago. Upon arrival, we were greeted by a very accommodating staff that was friendly and thoughful. From the valet attendant to the front desk clerk, everyone was so nice. The hotel shows signs of being under renovation, but the staff made sure that we were never disturbed or experienced any inconvenience regarding renovation. There was color board up in the lobby that indicates the changes are going to be fabulous. Can't wait to come back and see the improvements. The room was clean and well appointed. The bed was so comfortable - one of the best night's sleep I have had in quite a while. Love this hotel!", "Date": "April 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Oak Creek, Wisconsin, United States", "Title": "“Good value and great location”", "Author": "Carla F", "ReviewID": "UR128357387", "Content": "We stayed at the Parc St. Charles for our first visit to New Orleans, (3 nights). The location of this hotel is fantastic, it is located just a few block from canal street and Bourbon Street etc. Customer services was good. The room was too small for a family of 4 adults, and had no windows, so we can open and have a little air to make the room less congested. However, the room was clean in general, but we had to ask for an extra set of towel every day. The hotel is still under renovation, and every morning starting at 6:00am we could heard the construction noise. In general our stay was good considering also that we got a good deal in price booking after Mardi Gras was over.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“Great Value”", "Author": "KatherineMM", "ReviewID": "UR127560850", "Content": "I was in New Orleans for a conference and stayed here for three nights. I had read some reviews and was worried about the noise from the renovations works currently being undertaken at the hotel. However, the hotel was very nice and I didn't notice any extra noise. The only minor problem was that my room was beside the elevator and the walls were not thick enough to prevent me from hearing people in the hallways. The room was clean, the staff were very helpful and friendly and the location was perfect. As I was travelling alone, I was a little concerned about walking to the hotel at night time from the French Quarter, but it was fine and I felt safe. Would recommend and would gladly stay here again in the future.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Indianapolis", "Title": "“Nice hotel (during Final Four)”", "Author": "bowdenj", "ReviewID": "UR127494910", "Content": "Stayed at the Parc St. Charles for 5 nights during NCAA Final Four. Was upgraded to room 1113 (top floor) since I booked two double beds and they need those rooms so upgraded to top floor room (King bed). Only one elevator goes to the 11th floor so at times its advantageous to take stairs one floor down and catch the elevator. Breakfast is at a great cafe attached to hotel - fantastic French toast. Valet parking was extremely quick (considering it was Final Four weekend) and the hotel is conveniently located to the CBD plus a few blocks from the French Quarter. Construction is going ongoing on the first floor (never asked what they were working on so I'm not sure of the schedule).", "Date": "April 8, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "MO", "Title": "“We won't be back...”", "Author": "Be_as_you_are", "ReviewID": "UR127265382", "Content": "We were \"forced\" to stay here for The Final Four because there were no other hotels available. The ONLY bright spot was the bellhop, Ray. He was great and very friendly! The people at the front desk hardly said a word to us when we arrived. They seemed awfully smug and acted like we were bothering them when we came in each time. The hotel room was OK - just OK - but the bathroom had serious issues. Our toilet leaked the whole time, so we had a constant pool of water on the floor. gross. The wallpaper in the bathroom was curling up and there was a weird mold patch on the ceiling that had a hole in the middle of the patch. It seriously looked like there was a hidden camera in there or something. I don't normally have allergies but I had 2 different allergy attacks while showering because of the mold. They also gave us fewer towels each day, so by the last night, we didn't have hand towels. I asked for more and they assured me they'd send more. They never did. We were using a few towels each day to soak up the water from the toilet, so we needed more and we didn't get more. The shower curtain was too short for the tub and even more water leaked onto the floor during every shower. We got TWO tiny pillows for our bed - which was only a queen sized bed. I thought I reserved a King. The room was small and humid and the only way to sleep and not hear neighbors next door was to leave our A/C fan running the whole night. We read another review that said to take a different elevator that was to the left when you leave the lobby. Glad we did. The other one was horribly slow. I would not return here again when there are so many other choices of hotels in NOLA. The Sheraton has had my business in the past and will again next time. I would say, \"You get what you pay for\" but the rate was 4 times the regular rate, so I expected at least more than 2 pillows and enough towels for just the two of us. Totally disappointed. :(", "Date": "April 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Springfield, Missouri", "Title": "“Wonderful hotel!”", "Author": "J J", "ReviewID": "UR127044362", "Content": "We got to the hotel about 8 pm after driving all day. We were just going to find a place to park ourselves, but we were so tired we chose the valet service. They were a little slow getting it off of the street, but that wasn't a big deal. Our room was nice, had a great view, and was very clean. We called the front desk for some extra towels the second day and housekeeping had them up to our room very quickly. The hotel was in walking distance of many things we wanted to see. I'm not really understanding some of the reviews I've read about the small rooms. We had a deluxe queen room and it was just fine. The only thing that I wished was different was it would be nice to have another mirror in the room. There was just one in the bathroom over the sink and when two women share a room, that's just not enough. :) I would recommend this hotel and would stay there again.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Cleveland", "Title": "“Location is the only reason”", "Author": "BellaVendetta", "ReviewID": "UR126982181", "Content": "I'll be honest and say that whoever the manager is at this property should be ashamed. Things that have been let go or tolerated, no good property would allow. When a place is under this much construction and has this many mechanical issues -- just shut the doors. If you can ignore many factors going on here, it is a great location that is walking or street car distance to everything -- and yes -- maybe this property will improve once the renovations are done, but until then, I wouldn't bother except for the price. The rooms are fine except for torn wallpaper, paint peeling, the ironing board was falling apart, and a nice little drilled peep hole the was right above my shower! I had to stuff tissue in it. The exhaust fan didn't work, and I could hear construction and the cleaning staff chatting away in the early morning hours very loudly. There was also any number of tools, carts, and pieces of furniture left in the hallways. All of this I can ignore to a point. What I can't ignore is getting stuck in the elevator TWICE. Besides the fact it takes forever because you are sharing it with staff, it is just the scariest elevator to set foot in. I am handicapped so stairs were not an option for me. When I informed the staff of getting stuck twice, they really could have cared less. They said the manager would be calling me when I asked to speak to someone, and I never got the call. After the elevator being fixed once (supposedly) I came in asking if it had been resolved because there was no way I could take stairs. The man at the front desk said, \"um, I believe so\". It is either fixed, or it isn't! And guess what? It wasn't because it got stuck on it's way down. There is one tiny elevator that we were told we could use, and it fits about 5 people and is no less frightening. I'm usually pretty forgiving, and have worked in hospitality, but this place just kept getting worse as the days went on. The staff are not properly trained even if they might be nice about getting you a cab or directions, but that's about all. I won't be coming back.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "The Woodlands, Texas", "Title": "“Good location for walking to French Quarter”", "Author": "SwissHammy", "ReviewID": "UR126878713", "Content": "Very good location to walk to the French Quarter in 15 minutes, hotel is currently being renovated in the foyer area so never the best picture when this is happening. However, very handy to be able to park around the corner for free if you arrive Saturday after 6pm and you do not have to pay for parking until 8am Monday morning. The room had good clean and big beds. The bathroom was sufficient although the shower was a tad confusing to suss out how to work without instructions. The air conditioning was good but it was very noisy so best to turn it off during the sleeping hours. Staff were friendly and accomodating. We were out lots exploring the French Quarter during our stay so we only really used the hotel for sleeping and for this it was very functional.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Nice hotel under renovation”", "Author": "Melmill68", "ReviewID": "UR126763711", "Content": "Great staff, small room with double bed, one elevator for 11 floors, nice location, very clean, no pool or hot tub, under renovation", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Great Service”", "Author": "Zach A", "ReviewID": "UR126757446", "Content": "Wanted to recommend this hotel to anyone heading down to NOLA for the weekend. The location is central to anywhere you want to go. We were there for 3 days and didnt take 1 taxi to get anywhere. The service staff at the front desk is extremely helpful with directions and food suggestions. The pricing was very fair for the location it provides. Have fun and enjoy the food.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Tallahassee, Florida", "Title": "“Modifications On-going”", "Author": "sunnyredd", "ReviewID": "UR125643229", "Content": "I was not impressed with this hotel, but to be fair, it appears they are trying to make improvements or repairs right now. They need to work on the individual rooms as well. We got a reduced price, and I would have been outraged if I had paid more. Our room was upgraded because it was Mardi Gras week, but there was barely enough room to walk past each other. Wall paper was coming loose from the wall and there was a creepy hole in the ceiling of the shower. The thermostat didn't work and they immediately sent the a maintenance man up to look at it. He worked on it a little and it was some better, but the room was never really warm. I'll try to find another hotel next trip, but would return there if nothing is available in my price range. The staff was extremely polite and the front desk helpful. The cafe is only open for breakfast and lunch, but the breakfast we had there was tasty.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Bad customer service”", "Author": "pinklesbian", "ReviewID": "UR125308451", "Content": "When we arrived they lost our reservations then when asked to speak to a manager she was very rude and didnt try to work with us at all. We reserved a double bed with 2 queens for 4 ppl, when our reservation got lost we ended up with a one bedroom and a roll out bed paying the same price for that cramped up small room. The manager was so rude, i will never stay there again", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“Mardi Gras 2012”", "Author": "PosyAtlanta", "ReviewID": "UR125126061", "Content": "I booked this hotel for 23 year old son and two friends. The staff was very friendly. The room was nice and just how it was described. Kate, Amanda, and Jeremy were very helpful when I called inquiring about the reservation and the off-site parking. My son and his friends had a great time.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Houston, Texas", "Title": "“Horrible Experience”", "Author": "Tamela K", "ReviewID": "UR124908355", "Content": "I stayed at this hotel during Mardi Gras weekend and my experience was not good at all. First the hotel does not have a parking garage. I was told on the phone that they offered valet parking. However, upon arrival to the hotel I was told that during Mardi Gras weekend the hotel does not offer valet parking. So I said ok where is the parking garage, they said we do not have a parking garage but we recommend you parking at Howard Ave. parking garage and pay $25 a day - and mind you the garage is about ten to fifteen blocks away from the hotel and did not offer shuttle service 24/7. We had to call a taxi to take us back to the hotel because it was raining and cold. When we first arrived they gave us a room by the stairwell - the hallway was wet from the ice machine - the room smelled like mildew - and the all the towels were still wet and damp. We requested another room and was moved to another floor. This room was more acceptable - but for the price we paid for the room - we were very disappointed. I would not recommend this hotel to anyone during Mardi Gras or any other occasion. The hotel is old and does not have any updated features. The TV was plasma however the picture was not clear at all and showed fussiness. Checking out the hotel was the same issue we had to walk all the way to the parking garage with our luggage - we could not get a taxi because all the streets were blocked off and taxi's that did come by would not assist us. Just imagine four women walking ten to fifteen blocks with suitcases, clothes and bags in hand. This was a horrible experience and this was my first time to New Orleans. I will forever stick with the hotels I know such as the Hilton and Crown Plaza. I wish I would have known we could attach photos to this site i would have taken pictures but I was to embarrassed to even show the pictures to anyone. Lesson learned!!!", "Date": "February 20, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Woodville, Mississippi", "Title": "“It's been great for my last ten visits . . .”", "Author": "Ernesto C", "ReviewID": "UR124671826", "Content": "The location is perfect if you are there for business and maybe even better if its for pleasure. It;s so close to the Quarter. It is a basic no frills hotel with nicely done rooms and it's clean and fresh. The staff is wonderful and the rates are the very best. Cafe on the Square is one of the best hotel restaurants in town. I won't stay anywhere else now.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Woodville, Alabama", "Title": "“Great staff”", "Author": "d c", "ReviewID": "UR124598194", "Content": "Had a few issues but excellent staff was wonderful in handling any problem. Amanda Kris went out of her way to make our stay as pleasant as possible. Excellent location!!! Excellent staff!! Comfortable rooms. Older hotel but they are obviously working on that and the friendly, courteous, professional staff makes up for that.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "new orleans", "Title": "“Great business stay”", "Author": "davidnola", "ReviewID": "UR124549993", "Content": "I have been staying at the Parc St. Charles on business for the last two months...usually one night a week. The rooms have been updated and are very clean, the new bedding, matress, fixtures really have added stars to the hotel. The staff has been most helpful and always have a smile! Most of all---the hotel is clean clean clean!", "Date": "February 13, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Wash, DC", "Title": "“Rather be homeless...................”", "Author": "hbrubaker", "ReviewID": "UR124549837", "Content": "This was probably the worst hotel I have ever stayed in. I ignored the reveiws but was rudely mistaken the minute I stepped into the lobby. I only lasted one night and was seriously concerned for my health upon my exit. My mistake was not knowing they rented by the hour.", "Date": "February 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“My Trip was perfect!”", "Author": "Rhonda J", "ReviewID": "UR124068240", "Content": "I was reading all the reviews and was very skeptical of staying at this hotel, but you cannot go by those because they are old. This hotel is under new ownership and all of the rooms have been newly renovated, there is new carpet on the floors, my room appeared to have new beds and linens. I was pleasantly surprised!! Everyone was very nice at the front desk, and the cafe...the food was absolutely delicious! I only wish that it was opened for dinner too. The hotel is centrally located I was only a couple of blocks from the Super Dome to my left, and only a couple of blocks from the River walk shopping to my right! I was in a happy place because I love to shop and the event was at the Super Dome, so I did not have to rent a car and pay those incredibly high parking fees. $25-28 a day, nooooo way! If you have not recently tried Parc St. Charles you should, prices are right, and in a good location.", "Date": "February 3, 2012"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Amazing Service!”", "Author": "rlrl6", "ReviewID": "UR123372071", "Content": "Last month I was there on a very hectic business trip. While I was there Jeremy and the rest of the staff were absolutely amazing. They even discounted my final day for something that was of no fault of their own. Service was irreproachable.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Santa Rosa, California", "Title": "“Best service at a busy time!”", "Author": "Lara M", "ReviewID": "UR122726245", "Content": "Katie and the rest of the front desk staff at the Parc St Charles were amazing during a week when New Orleans dealt with New Years, two end of season Saints games, the Sugar Bowl, and the BCS championship game between local LSU and nearby rival Alabama! Busy busy busy! Not only did the welcome us and say hi every time we walked past the desk, but they helped us switch to a room that suited us better (number of beds) and even honored a lower price we saw on Hotels.com. Not only that, but when Hotels.com and the nearby Ambassador Hotel would not let us out of a reservation that we made in error, Parc St Charles graciously let us out of our reservation there so that we were not double-booked, saving us from wasting over $500!!! Unfortunately for us, this meant we had to move to the Ambassador Hotel, which after staying for four days and having to buy earplugs the first morning, I wouldn't recommend to my worst enemy!", "Date": "January 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Good location & service”", "Author": "kkalb", "ReviewID": "UR122585274", "Content": "The Parc St Charles is located just about 4 blocks west of the French Quarter, so is great walking distance to the bars, restaurants, and shopping located there. It's also convenient to the Arts District, plus the trolley to the Garden District and Uptown runs right out front of the hotel. The service was kind and helpful at all times. Having four people in the room, they were always accommodating for requests such as extra towels. There's also free WiFi internet in the hotel, which is a nice service for all travelers alike. The rooms were quiet and pretty comfortable, albeit a little tight with four people in the room. The bed was a comfortable sleep for two. A nice flat screen TV was enjoyable. The bathroom was my main annoyance. The shower worked well for both pressure and hot water, but the towels were cheap and old. There was also not good ventilation. Overall, the hotel was worth the price paid, especially since this was over New Year's and hotel pricing in the city was quite high.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Wow the best service I've had in new orleans ever!!”", "Author": "David605", "ReviewID": "UR121733501", "Content": "The place was very clean, and the staff is awesome. I will definitely return over and over.", "Date": "December 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good location, comfy bed, everything else lacking”", "Author": "Judith B", "ReviewID": "UR121600370", "Content": "Easy access to CBD area and only a five minute walk into the French Quarter so location was great. The hotel is currently under refurbishment so it should get better and hence why it is priced much lower than the surrounding chain hotels. I had a deluxe room which was nice and the staff helped when things needed fixing etc. Didn't understand why my room key kept stopping working each day and I had to reactivate it. Also, no dinner available onsite which is hard when you arrive late. Would really recommend offering bar snacks as the bar space is well wasted. Think this is also separate to the hotel as is the cafe which serves great breakfast but only 8am-10am. Generally a bit hard work if you are on a business trip.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manvel, Texas", "Title": "“Don't believe every review, make up your own mind”", "Author": "Kathy C", "ReviewID": "UR120632338", "Content": "We went on a spur of the moment trip, booked this hotel online, had questionable reviews and we were concerned. Got there, had a room with two queen beds, we asked if we could have one king, Kelsey and Jeremy researched and even went to check the room and put us in this room. We were very appreciative. Hotel was clean and very convenient to all the activities the city has to offer.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Dacula, Georgia", "Title": "“The hotel is doing some renovating and it needs it!!!!”", "Author": "Ron_and_JulieC", "ReviewID": "UR120095520", "Content": "stayed for a couple of nights for a business trip. The hallway carpet is trashed!!!! The room i stayed in was OK, the air conditioning had issues but kept it somewhat cool. As for the lobby staff, not professional but are very friendly. Restaurant downstairs had good food but, they dont open until 8am....Those of us on business need to eat well before that. The shower didnt drain very well and the TV didnt work too well either. All in all, its ok but, i would not go out of my way to stay here out of my own wallet. The hotel is pretty close to the antics of Bourbon St, the casino etc. As for the bed...terrible. The pillows - a sponge i use for washing my car would have been better......", "Date": "November 2, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Honestly not the worst, but...”", "Author": "Reliableguy", "ReviewID": "UR119432792", "Content": "The wifi didn't work, the bathroom sink leaked, the tv was unusably distorted and had no remote. This stuff wouldn't be that big of a deal for the value, except there is no parking. The have a $30 valet service that made me wish we stayed at Hilton instead. After that, the car set on the block for over 2 hours at least. Found out when I went to grab something at the front desk! Overall, not for me and pretty lenient on hotels, usually just need a bed. I'll stay at best western over this any day!", "Date": "October 18, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Slidell, LA", "Title": "“Great location/Indifferent Staff”", "Author": "djpalumbo", "ReviewID": "UR119393818", "Content": "I booked this hotel at the last minute on a festival weekend in New Orleans. The price was very good at $92. However, when we checked in the attendant at the front counter never said a word until we spoke up ourselves. She seemed very indifferent towards us and her position. We stayed on the top floor and had a really nice view of the city. The floor was under some renovation and smelled off paint. Better than some other odors I guess. A/C in the room worked well but was noisy. The location is awesome. You can walk to the Superdome or the other way to Harrahs. It is directly on the streetcar line. In the other direction on St Charles you can walk about 5 blocks to the Quarter. There is a lounge in the hotel but the bartender was lacking customer service. It was very hard to get her attention and her attitude was pretty crappy. If you put up with some minor stuff it's not bad.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "New Orleans", "Title": "“eeewww”", "Author": "Kelly A", "ReviewID": "UR118670208", "Content": "I had a reservation at another hotel and they \"transferred\" our reservation to this hotel without notifying us at all. We were sad and angry to have to check into this beast. Tiny, stinky, paint peeling off the walls, stains on the carpet, broken tiles, burned out lightbulbs, need I say more? If all you're looking for is a place to crash after a night on Bourbon, this may be fine. If you have any sort of standards whatsoever, it will not meet them.", "Date": "September 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Covington, Louisiana", "Title": "“They should give out Tetanus shots after you stay!”", "Author": "Tess O", "ReviewID": "UR118635785", "Content": "Disgusting! Sent by another hotel b/c they had problems. 10th floor stunk so bad, the carpet all down the hallway looked liked it had been bleached out on the sides, paint was coming off the walls. Our room had big stain spots everywhere, bed sheets had rust and when we pulled off the fitted sheet it looked like big pee spots were everywhere. We slept in our clothes! When I asked the employee how much the room was she said 235.00. What a joke! Wouldn't even eat the free breakfast. To scared!! Would have been better off sleeping under the bridge!", "Date": "September 26, 2011"}, {"Ratings": {"Location": "4", "Overall": "1.0", "Value": "4", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Jonesboro Arkansas", "Title": "“HORRIBLE!!!!”", "Author": "wandan2004", "ReviewID": "UR118223645", "Content": "I recently stayed here and I will never stay there again. It smelled horrible! There was no microwaves or fridges in the room. My curtain was torn down from my window. My air conditioner did not work. The water did not get hot at all. The front desk clerks were not helpful at all. The room was moldy and had a wet feeling. It was disgusting!", "Date": "September 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Not a good stay”", "Author": "neworleanszombie", "ReviewID": "UR117010893", "Content": "Air conditioner in and out all night. Toiled ran loudly EVERY 20 min. Maids in hallway yelling in Spanish to one another at 8 am! Manager of hotel did not seem to care at all. Desk staff was very friendly & helpful.", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "NY", "Title": "“Great place to stay”", "Author": "comeonrichie", "ReviewID": "UR116993012", "Content": "Excellent all around esp the staff. Valet parking service has a lot to be desired -very slow at getting your vehicle but the hotel is very helpful in this situation. Very close to everything you'd want to do and very much worth the money", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Fort Worth, Texas", "Title": "“Better than advertised”", "Author": "Greenfield914", "ReviewID": "UR116480711", "Content": "I was unsure about this hotel due to some poor reviews I read online, however they are now under new ownership. Having stayed at the Parc for several weeks while working in NOLA, I found the hotel a great place. The rooms are a little dated but some have a great view. It is what you pay for as it is not as nice as the Hilton or other higher end hotels close by. The staff was great. Everyone I dealt with was friendly, helpful and all around nice people to talk with. The location was nice as it is on the street car line so it is easy access anywhere and walking distance to some great restaurants but not in the middle of the French Quarter hustle and bustle.", "Date": "August 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Louisiana", "Title": "“Pleasantly surprised!”", "Author": "fisherofmen04", "ReviewID": "UR115997324", "Content": "I was really worried about our stay here after reading the reviews nut my family and I were pleasantly surprised! The decor is a little outdated, but the things that matter are very nice. The bed is comfortable, the staff is very helpful and friendly, the pillows are great and over all the rooms are really comfortable! The tv is a tube tv, so if your lpoking for top of the line you will be disappointed, but for a descent price this hotel is very nice and well located!", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "metairie", "Title": "“Wonderful Hotel- Highly Recommended”", "Author": "gztracy", "ReviewID": "UR114883880", "Content": "We had a marvelous stay. Wonderful interiors and very good service. The front desk staff was friendly and welcoming. The assistant general manager was very polite and efficient. He had no issue letting us check in a bit early. Housekeeping staff were very pleasant. Our room was spacious with two of those comfortable beds. The location is great and an exemplary example of a luxurious hotel for business travelers, tourists and locals alike.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Metairie, Louisiana", "Title": "“great service, great rooms, loved my stay”", "Author": "chesse331", "ReviewID": "UR114848501", "Content": "Parc St Charles is in the perfect location for a New Orleans vacation! It is walking distance from Bourbon Street, Harrah's Casino, the Superdome and on the street car route for easy access to the Uptown area. I hosted a Bachlorette Party downtown and booked two rooms at Parc St Charles. The customer service was great, from taking our picture, to letting me decorate the room, to easy check in and check out, they were willingly helpful. The rooms where very nice and clean. Beds were comfortable. I also had a beautiful view of Lafayette Square. I defiantly plan on returning to Parc St Charles!", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "New Iberia, Louisiana", "Title": "“Believe all Reviews...I would not recommend Parc St. Charles”", "Author": "pyalexand", "ReviewID": "UR114799384", "Content": "We stayed @ Parc St. Charles June 2011... It was horrible!!! The only reason i stayed after seeing the rooms was because i couldn't find another room near by. The carpet was Disqusting!!! The smell of the room was moldy... I went to the store and purchased sheets along w/cleaning supplies for the bathroom. While checking out i asked the clerk to please tell upper management to update the pictures on the website because that is False advertising...maybe the rooms looked like that 10 + years ago... The room was disqusting... Please read other reviews before booking this or any rooms....", "Date": "June 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Would NOT recommend....”", "Author": "Lsugrad2009", "ReviewID": "UR112855473", "Content": "I forgot To mention....the ac in the room doesn't work...it runs for a few mins then shuts off. It was uncomfortably hot. We also had to wait an unreasonable amount of time for our car to come the next morning. very disappointed in this hotel. It was nasty.", "Date": "June 12, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Would NOT recommend!!!”", "Author": "Lsugrad2009", "ReviewID": "UR112853675", "Content": "I would never recommend this hotel to anyone. It is horribly maintained. The rooms are small and filthy. The beds are made of fabricated steel that any little movement creates the most annoying squeak. The carpet has holes all in it. The walls have stains all over them. We called for extra towels and we had to go down and get them. Do not waste your time and money here.", "Date": "June 12, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Peoria, Illinois", "Title": "“HORRIBLE!!!!!!!”", "Author": "gbat1stop", "ReviewID": "UR110742211", "Content": "My son is at Keesler AFB in Mississippi and we decided that he wanted to spend his first weekend off base in New Orleans. The front desk staff are RUDE, the maid service does not speak a bit of English, we were placed in a room with a queen bed when I reserved a room with 2 beds. I was overcharged for my stay, valet takes forever to get your vehicle to you no matter how far in advance you request it. The place was roach infested and they didn't seem to care when I brought it to their attention. I was charged a $150 fee because they claimed we smoked in our room when in fact we DO NOT smoke. They said there was evidence of smoking in the room (prior to check-out) but the fact is, no one should have even been in our room before our check-out because of the DO NOT DISTURB sign on our door. When I asked to speak with the person who was in our room without my permission, they could not produce anyone who spoke English. The elevator is extremely slow and the AC is set at about 80 degrees in the lobby. The AC in the room could not be set below 75. There is ice available on floors 3 5 and 9 but you have to know how to find it yourself. Vending is only on the 5th floor. The rooms are the size of a large walk-in closet. The only upside to this hotel is convenience of walking to anywhere in the French Quarter. I would NEVER stay at this hotel again.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Parsons, Kansas", "Title": "“LOCATION LOCATION LOCATION!”", "Author": "JayG620", "ReviewID": "UR108398518", "Content": "We stayed here for a week. The hotle was old and run down the elevator took forever. The rooms were not dirty but definitely old there is only one ice machine for the entire hotel. We did not get the rooms that we booked and one person ended up sleeping on the floor the entire time we asked repeatedly for a roll away bed since the double bed room we requested was never available. The best thing was its location the st. Charles street car runs right in front of the hotel. A few blocks from canal and bourbon street and in the other direction the ww2 museum which was awesome by the way! We walked everywhere that we wanted to go. The hotel wasnt the best but it was near where we wanted to be. Also the park next to the hotel was pretty nice to walk around in has some unique sculptures.", "Date": "May 15, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Lake Charles, Louisiana", "Title": "“WORST HOTEL EVER!”", "Author": "ammay485", "ReviewID": "UR106130906", "Content": "The staff was absolutely horrible and unfriendly. The valet service blew two of my friends tires and refused to pay for it. The valet service also broke my blinker off of my steering column. The air conditioning only worked half of the time. The elevator was broken. ABSOLUTELY DISGUSTING!!! DO NOT STAY HERE.", "Date": "April 29, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Williamsburg, Virginia", "Title": "“Called to order amenity for my daughter's room.”", "Author": "Concierge191", "ReviewID": "UR105622224", "Content": "I asked for a simple Fruit & Cheese plate to be placed in my daughter's room prior to her arrival. The front desk agent said, \"We don't have that service here.\"", "Date": "April 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Talladega, Alabama", "Title": "“Really enjoyed stay!!!”", "Author": "StephaniB69", "ReviewID": "UR105490537", "Content": "My best friend and I made a quick trip to New Orleans this past weekend. The Parc St Charles was the best bargain for just one night of stay. We got there really early (9am) and the lady at the front desk put us in a room right away! No wait which was wonderful. Stayed in Room 905 and I have no complaints! Quiet, bed very comfortable, great hot water!!! Great view. Never heard the street car that so many others complain about. And never heard our neighbors! Will be staying here again. Only one issue- the elevator- Very small and slow and there is only one. Taxi cab ride to middle of French Quarter was only $6.00.", "Date": "April 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Bryn Mawr, Pennsylvania", "Title": "“Front desk staff very rude and unfriendly”", "Author": "Lucy52277", "ReviewID": "UR105075153", "Content": "The rug in the room was very dirty, front desk staff were very rude, they gave us a single room instead of a double which we requested. Rugs in the hallway also very dirty. I've stayed at many hotels over the years, one or two may have been just as bad, but at least the front desk staff were kind and curtious, and made you feel welcomed. Will not stay there again or recommend it to anyone!", "Date": "April 22, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Newark, Delaware", "Title": "“Do not stay here, if you do not have to...”", "Author": "KadirOzden", "ReviewID": "UR103795258", "Content": "The only positive comment could be the closeness to the downtown. Dirty room, no Internet, horrible shower equipment, careless staff, etc. I read all about this hotel before I stay there (I had no choice) and I agree with all of them.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Buzzqards Bay", "Title": "“Avoid this place”", "Author": "buzbay1", "ReviewID": "UR103774483", "Content": "I got my reservation through Hotels.com. I paid $86.00. Upon resgistering, they told me I had to pay a $50.00 security deposit that I would get back several days after I left. I also had to pay $27.00 EACH DAY for parking. I charged the amount. The hotel staff was being rained and we did not get much information from them. Although we are a mature couple, we were excited to b in New Orleans and foolishly trusting. The room was very tiny with a bed you pull down from the wall. It had a mattress only about 4 inches thick upon springs much like the bed of a pull out sofa, The location of the hotel was pretty good and we made the best of it. When we left, we asked for our car and had to wait about 20 minutes. We make sure there were no dents, scratches etc and were pleased that there were not. Again I asked about our $50.00 deposit. I was assured it would be credited to our account. Three weeks later, I am still trying to get the managment at the Parc St Charles to remove $55.88 from my Discover card. Again, we are a mature couple and did not thing to warrant this charge. No room service, nothing.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Tucson", "Title": "“This hotel was nowhere near worth the money we spent, Ive stayed at hotel 6 and payed 39.99 and was happier!”", "Author": "heatherbranch", "ReviewID": "UR103528408", "Content": "We were disgusted with our stay, the lobby looked great when we walked in but when we got to our room it stunk like mold, the carpet was soaked near the bathroom and was torn across the entire entry way you would think they money we were charged would cover some new carpet, the headboards were not attached to the bed and every time we rolled over we would wake up from the banging the headboard would make on the wall, the hallways were very hot like they had no air conditioning, the room was dirty from the people before us there was trash on the floor and trash can in the bathroom was not clean. We had ridden the train to New Orleans and when we made the train reservations they put us through to the hotel to make a reservation, we didn't want to pay the high price that they gave us but we didn't want to have to pay more for a cab to take us further so we went ahead and got the room, after we payed the $134.00 dollars for the room I went to google to see the room I read the comments that were left and already knew we were going to have problems but was hoping that the people that had made the comments had just had a bad experience well we found out different when we got there we knew that all there comments were not false. We were most disgusted because we were not traveling alone we had our four very young children with us and even they were disgusted with the smell of the room, they complained of headaches in the morning which I have never had them complain of there head hurting I didn't even know that they knew what a headache was. We travel a lot and stay at many hotels and never have I gone back and had to make a complaint just because I don't want anyone one else to have to stay in such a horrible place we have payed 39.99 for a room at the hotel 6 and been happier we have even payed 24.99 for the best value inn and have had better experiences.", "Date": "April 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "frederick", "Title": "“Worst hotel ever!!”", "Author": "erin_lynn85", "ReviewID": "UR101023746", "Content": "Three friends and I stayed 2 nights in the Parc St Charles and it was awful. Totally ruined our time in New Orleans. We were not warned about the 30 dollars a day for valet parking so we basically spent 60 dollars just for them to store our car since we walked everywhere. The rooms were okay looking but a little on the cheap side for the amount of money we were paying. They had the rudest staff I have ever come into contact with. We were not greeted when we came in and we were not thanked when we left. At check out the woman behind the counter handed me my car keys without even looking at me or even stopping her conversation with her coworker. Just tossed my keys on the counter. What a great way to say thanks for spending 300 hundred dollars at our hotel uh? If you plan a trip to New Orleans please do not let the Parc St Charles ruin your trip like it did ours.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "", "Title": "“I cant believe someone would give this place more than one star!”", "Author": "TBIZZLE5", "ReviewID": "UR97977637", "Content": "I had spent 3 nights in this hotel with my daughter (2) and husband, and boy was that just about the worst mistake ever. I have stayed in a motel 6 before that was cleaner than this place. Don't let the price fool you. Def. Not worth the money, not to mention don't forget about the valet parking you will end up having to pay for which will run you another 22 dollars a night, you might as well just go down to the holiday inn for the amount of money. Our first night there, the carpets were sooo disguisting it turned our feet black just walking on them, so we wore our shoes the whole time in the room, the coverlets for the beds were stained and gross, who knows what they were stained from, the shower water backed up and filled up the tub in our room so I had to shower in knee deep dirty water, and the heat in our room was not working properly and we froze our buns off most of our stay. Needless to say, we constantly dreaded going back to our hotel every evening. Maybe if I was just in new orleans to party and get drunk this hotel would have been key because I would have been too intoxicated to really care. If you have a family vacay or small children, DO NOT STAY HERE! I GUARANTEE YOU WILL REGRET EVERY MINUTE OF YOUR STAY.", "Date": "February 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baton Rouge, Louisiana", "Title": "“Not at all like the reviews I've read from other websites!”", "Author": "CJ032", "ReviewID": "UR96125029", "Content": "My friends and I are the type of people who aren't high maintenance. We wanted a place that had a reasonable price and wasn't too far from all of the attractions so I picked Parc St. Charles. Now, at first, I was a little bit apprehensive about this hotel because I've read some of the reviews on the Internet and some of them didn't hold this hotel in high regard but I shrugged it off. We were only going to need a place to sleep and shower because we'd be off sightseeing and partying. When we arrived, we were pleasantly surprised by how nice the staff were to us and how clean the room was. At first it took us a while to find our room because it was hidden behind another door at the end of the hall but we actually considered that a plus because we had that \"isolated\" feeling. We walked in and I loved it. We had a double bed room. The only minor thing that sort of bothered my friends, not me as much, was the street car but I could basically sleep through anything. One of my friends had a family emergency so we ended up checking out in the middle of the night and they completely understood and didn't give us the \"eye roll\" like other hotels.", "Date": "February 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Pineville, Louisiana", "Title": "“AWFUL - DO NOT STAY HERE FOR YOUR STAY AWAY”", "Author": "rdb223", "ReviewID": "UR95892880", "Content": "There is no way to describe how AWFUL this hotel is. Everything about the places is out dated. The furniture was was so stained, I do not want to imagine what was stained all over the chairs. The fitted sheets did not fit and would slip down when trying to sleep in the \"very uncomfortable bed\". After the sheets slip down an reveal the mattress, you will find where past guest have written messages all over the mattress. You will hear other guest either entering or leaving their rooms, talking in the halls and rooms, televisions playing all through the night. And the trolly is never ending. I advise you bring ear plugs - and even those will not block out all the noise you hear. The price of the rooms may look good - do yourself a favor and book at another location even if the rate is a little higher. If you book at the Parc St. Charles you will get what you paid for - a CHEAP place to stay.", "Date": "February 8, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Baton Rouge, Louisiana", "Title": "“WORST NEW ORLEANS HOTEL!”", "Author": "eaucoin", "ReviewID": "UR95494592", "Content": "HORRIBLE HORRIBLE HORRIBLE!!!! DO NOT BOOK!! I had a reservation for a Friday night and unfortunately roads were closed because of extreme weather conditions. This hotel REFUSED to refund or change my date. To top it off they were extremely rude! The price may look appealing, but they are only out to get your money! I called to speak with them about the situation and they CANCELED my reservation (while charging me full price) to place others in my reservation. Very hard people to work with.", "Date": "February 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“The Internet access and local phone calls were not complimentary.”", "Author": "jxctraveler", "ReviewID": "UR84252502", "Content": "The staff were fairly helpful and friendly. The rooms were very clean, cleaner then some of the reviews that I had read. Couldn't beat the location. My main compliment is that the price wasn't as good as advertized. We were led to believe that the rooms were $45 a night but we ended up paying $100 a night. As the title suggests we had to pay for the internet access and local phone calls by paying a $3.00 fee per day.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Don't let the name of the place fool you!”", "Author": "Debo1959", "ReviewID": "UR83834870", "Content": "We stayed here,because of the location. The crescent city Blues and Bbq was happening at Layfette Square. The toilet overflowed! The vent above the toilet leaked down on my head. The t.v. had to be turned on manually ( big deal ). The furnishings were old and dirty.The elevators, very slow! But they did check us in before 3.00.", "Date": "October 17, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Rooms were nice, service could have been better, value was great.”", "Author": "kvincent718", "ReviewID": "UR83394916", "Content": "Location: The location of this hotel is it's best feature. It's on the corner of Poydras and St. Charles which puts you within in 5 blocks (and walking distance) of the French Quarter. St. Charles Avenue turns in Rue Royale once you're on the other side of Canal Street (in the FQ). Caddy-corner from the hotel is a street car stop for the St. Charles Line, which takes you into the Garden District (which is also not far, though not within walking distance). Parking: The parking situation around the hotel is not-so-good, so it is easier to valet (which was around $20 per night). However, the hotel outsources their valet to a private company that owns/leases(?) a parking garage near the hotel. We only requested our vehicle twice during our stay, once to get something out of it and the second time when we were leaving. The first time we had them pull the car around, it took about 5 minutes and was very simple. However, when we were leaving, it was at check-out time, which meant that 20-30 other people needed their cars at the same time. We waited nearly an hour and a half; there were plenty of valets, but there was a miscommunication between the hotel front desk and the valet and no one was dispatched for our car (until we asked about it again an hour later). Rooms: The first room they gave us was on the 8th floor and had an amazing view looking toward the Garden District. While the view was awesome, the room was tiny. There was barely enough room for luggage for two people. We had booked a smoking room and this one with the great view was not one, so they moved us to an interior room on the 4th floor. The view for this room looked down a narrow alley, and across Poydras Street at the Hotel Intercontinental. But what this room lacked as far as the view, it made up for it with space. Our second (and ultimately final) room, seemed to be 3 times the size of the first room we were given. Everything else to do with the room was very nice. The room and bathroom looked as though they had been remodeled within the last few years. A condensate line dripped into the shower, but whatever, everything else was nice. Elevator: Aside from the valet debacle after check-out, only one aspect wins the prize for Incredibly Inconvenient and that would have to be the lone elevator. The hotel is large enough to need at least two, and they could probably work on getting the one they have to move a little faster. Unfortunately, this is a difficult problem to solve for such an old building. General: One last inconvenience that would be much easier to solve is the bell cart situation. When we stayed there, they had one cart; which had been appropriated prior to our departure by some cranky lady who seemed to need it for quite some time. Overall, these small inconveniences I've mentioned did not detract from our stay so much that I would not stay again or recommend this hotel to a friend. Just make sure you get the room without a view.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“Great Time...”", "Author": "isbmr300", "ReviewID": "UR82362541", "Content": "I had my doubts because the prices were so low, but to my surprise i had a great time. The front desk was very helpful and i had an amazing view out of my room. I reccommend this hotel to others.", "Date": "October 6, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Rooms": "5", "Service": "4"}, "AuthorLocation": "", "Title": "“Good hotel”", "Author": "Horus69", "ReviewID": "UR70833076", "Content": "Parc st charles is a good hotel. I expected less for the price. Location is great just a few blocks from The french quarter. The rooms are clean and big enough. However I didn't expected to pay $22 extra dollars for the valet parking. That meant an extra $66 for my three day stay", "Date": "July 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Better than expected”", "Author": "Ellebell94", "ReviewID": "UR69456545", "Content": "Given the reviews that have already been posted I was nervous about what to expect, but I had a truly enjoyable stay at the Parc St. Charles. The front desk staff were pleasant and helpful. My room was spacious, quiet (surprising since I was right off of the elevator), clean, the a/c worked like a charm, there were no problems with the elevator. The cafe in the lobby was a great place for a quick lunch and the waitstaff there was quite pleasant. Given the price and location of the hotel I would definitely stay here again.", "Date": "July 2, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Seattle, Washington", "Title": "“3 DAYS OF A DIP IN THE MATTRESS AT PARC SAINT CHARLES”", "Author": "unhappyladynw", "ReviewID": "UR67733074", "Content": "I didn't mind the location at first...I was trying to be forgiving because I didn't mind the staff...atleast the one's that looked happy. My first silent complaint was of course no air conditioning in the lobby and the halls...the non smoking king room I occupied was ok...until I slept on the bed and noticed the dip on the one side....then the cigarette burns on carpet and bedspread, I lifted up the bed skirt...box spring was from atleast 1950 broken......the wood part, and was replaced by plywood....I verbally complained..no one did anything...talked to Giselda...gen manager....was no impressed by my story and looked at me as if I was an alien....she did not bother to look in room 812 plants are dead in the lobby and bar area....it almost could of been an outdated convalesant home......the price, location and some staff......it was what I paid for.........", "Date": "June 16, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Jackson, Mississippi", "Title": "“Find an Alternative”", "Author": "trippadvizor", "ReviewID": "UR67723697", "Content": "It was unfortunate enough that we had to take our children with us while celebrating our 17th wedding anniversary, but the rooms (especially the chairs) could and should have been shampooed, deep cleaned - along with the carpeting inside and the hallways to say \"please come in - I'm glad to have you\". But no. The \"kids\" room did have a couple of holes in the wall - one in the bathroom and one behind the door. THe \"sitting\" chairs were not cleaned!! I begged the kids specifically not to sit in the chairs & keep their socks on their feet!!!! Our room was about the same. And the bathroom shower heads were NASTY!!!! I refused to take a shower and told spouse and children - DO NOT TAKE A SHOWER! Both showerheads were full of GUNK!!! A special showerhead cleaner should have been used by the staff/management. We took baths instead. The tub was clean enough to at least do that. It was a muggy 95+ degrees and a shower would have eased some of the heat and made getting cooler/clean quicker. The beds/pillows were comfortable, but it seemed as though the comforters in both rooms had a fairly large noticeable hole right on top of both of them either from a cigarette burn or something. But the bed itself slept comfortably. So some of the pictures that were placed in reviews by others that showed the holes etc. were true. I would usually think some reviewers just had a personal \"pet peeve\", but after being there for myself for this particular hotel, I found it to be true. HOWEVER, on the plus side -this hotel was a comfortable walking distance from the River Walk, Audubon Aquarium/Insecterium and other cool places. Saks Fifth Avenue- Mall etc. etc. There was a beautiful, elegant restaurant called the Palace Cafe - simply scrumptulicious! you could see the chefs cooking thru the glass windows near the bar area, the waiters had bow ties, and there were beautiful stairs where you could be seated on the 2nd floor - where we were next to the windows where you could see the activity going on ouside. Beautiful paintings were on the wall of \"old\" and \"young\" jazz and other muscians/singers. Highly recommend you try this at least once. Other than the exhaustive heat it was a nice little outing. I do not plan to use this hotel again. Hopefully I won't have to take the children again either!!!", "Date": "June 16, 2010"}], "HotelInfo": {"Name": "Parc St. Charles", "HotelURL": "/ShowUserReviews-g60864-d115248-Reviews-Parc_St_Charles-New_Orleans_Louisiana.html", "Price": "$123 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">500 St. Charles Avenue</span>, <span class=\"locality\"><span property=\"v:locality\">New Orleans</span>, <span property=\"v:region\">LA</span> <span property=\"v:postal-code\">70130</span></span> (Formerly &quot;Best Western&quot;)</span></span></address>", "HotelID": "115248", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/08/d1/08d139fa07e0fbfc79810a1c257768cb5large.jpg"}}