{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Richmond, Virginia", "Title": "“No Sea View”", "Author": "LRS876", "ReviewID": "UR127663616", "Content": "We paid to upgrade our room to \"Sea\"view. We checked into a room on the 9th floor and our view was of the adjacent buildings that were under construction. There was no view of the beach from our room. The front desk did not refund us for the upgrade we paid nor did they change our room to a higher floor. We spent 6 days looking at buildings under construction. We found one of the receptionist to be very rude. The rooms were not 5 star quality, very basic. The location was far from the inner Las Ramblas.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "UK", "Title": "“Cool, chic, funky in Poblenou”", "Author": "PandoraSkies", "ReviewID": "UR126982956", "Content": "I chose this hotel to be close to business colleagues, not typically where I stay in Barcelona. However, just a 5 mins walk direct to the beach front, and a leisurely 20 mins stroll along to the port. ME is cool, from rop to bottom. Uber design, this has every modernity you can imagine, although rooms are fairly small (but then again, you dont visit barcelona to be cooped in a room!) - neon lights, mood lighting, power monsoon showers and sounddocks. Added fun comes in a ritter-sport stocked mini bar, with a special Love Me Tender late night bag, for those that dont wnat to sleep (feather and massage gel included!). Free wifi from room and lobby, and chic lounge bar with slump sofas and chess boards, and DJ at weekend. The pool is great, as is the outside cocktail bar. Club was under refurb during my stay, but the lobby restaurant is spectacular for food (tip: order the Solomillo!)", "Date": "March 30, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“No way is this a 5 star hotel”", "Author": "atime4pleasure", "ReviewID": "UR126813684", "Content": "The people working at the reception are pretentious. They think they are above their own guests. Even after informing them of an issue they say they will take care of it. But it never is. They make promises they cannot keep. When I asked at check-in if it was possible to have a room with a view of the sea I was told the hotel was fully booked. I then asked another receptionist and they said the hotel had rooms available. When I arrived in my room and went to the mini bar for some water. I found that the previous guests had opened and left the 2 bottles half empty. In any hotel, the mini bar should be re-stocked and changed immediately when the room is prepared for the next guest. The hallways seem to have a musty or mold smell to them despite this being a relatively new hotel. The conference rooms are located in the dark floors of -1. They have mold issues down there as one person who has a mold allergy had to be taken to hospital. The food in the restaurant is nothing near 5 star. The food is closer to 2 star. Even I could cook better than their main chef. The only thing that is 5 star in the restaurant are the prices. The staff in the restaurant are very nice. The hotel itself is 5KMs outside of the centre of Barcelona. If you are looking for a real 5 star hotel consider the W. It is right on the waterfront. The ME is about 7 blocks away or a 20 minute walk to the beach.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Upper Marlboro", "Title": "“Absolutely Awesome”", "Author": "regjr13", "ReviewID": "UR126145256", "Content": "We stayed here pre-cruise. The hotel was amazing. We enjoyed the view, the dining, the live music playing in the lobby. All-in-all, we had a great time.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Complete Luxury in modern and trendy hotel”", "Author": "Oakely52", "ReviewID": "UR126084198", "Content": "As you'll see from the photos that other travellers have uploaded on here, the rooms are beautifully designed, I loved the novelty of being able to see my bedroom whilst brushing my teeth in the bathroom- plus it made the room feel so much bigger! I think they've used the space very cleverly with both the wardrobe and shower behind a sliding door. The bed was extremely comfortable, it was like laying on a cloud. The shower was large and very powerful, and the little complimentary toiletry bottles were welcomed- we we're even given mouthwash! We had a view looking onto the Avenue Diagonal, and due to being so high up we had some beautiful views accross Barcelona. Sky bar is within the hotel in the lobby and the staff made me a couple of delicious cocktails, complete with a decorational strawberry. The hotel was a 5 minute walk from the Poblenou metro (yellow line) which goes straight to the harbour area where most of the restaurants and bars are. It's also round the corner from the Pere IV tram stop which links to other mainline metro routes. Though it's not walking distance to the beach, you'll find yourself getting public transport anyway as the metro is so quick and handy to get from a to b. I would recommend getting a 3 day travelcard, or for however many days your there to use all types of transport, including trains. I would love to return to Barcelona and stay here again, or maybe another Melia hotel somewhere accross the globe to compare it too.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Guildford, Surrey", "Title": "“Trendy Hotel”", "Author": "Simon J", "ReviewID": "UR126011007", "Content": "A very different but trendy hotel on Av Diagonal. The staff are the best, very friendly and helpful, It is a 10 min walk to the beach and you can reach 2 shopping malls in about 10 mins. The pool area is quite small and the spa was closed for refubishment when I visited.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tehran", "Title": "“Very good hotel for business”", "Author": "Cyrusdgreat", "ReviewID": "UR125972133", "Content": "I stay in this hotel for three nights and come back again and again when in Barcellona. The staff were so nice and hotel was new. The breakfast buffet is till 12:00 which was excellent. The business center was accessible for 24 hours and people working there were as responsible as your own secretary. Hotel is near to subway station. I've no hesitation to recommand this hotel to any business man.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sheffield, England, United Kingdom", "Title": "“Very nice modern hotel”", "Author": "Leila B", "ReviewID": "UR124692645", "Content": "Me and my boyfriend went to the ME Barcelona. The hotel was very nice and the room was beautifully decorated. Lovely views of the city, our room had a full wall of window. The room was very clean had nice bathroom with a huge walk in shower. The bed was very big and comfortable. All the staff we dealt with were very nice. The pool decking area on the 6th floor looked amazing however we didn't use it as the weather was very cold (although were tempted after a few drinks!). Downsides to this hotel were that it is quite far from the city centre however not too far from a main metro line and some nice cafes/shops. The price was very high for extras eg mini bar, hotel drinks and meals, spa services, there were no tea or coffee facilities in the room. On the Saturday there was a night club in the hotel, we were told of this on arrival and invited to it, we went to the club for a drink however it was very expensive (16euro for a rum and coke and a small coke!), we left the club in the early hours 1-2am and could still slightly hear it in our room, although it didn't keep us awake (we were on the 18th floor and the club was on the 6th) and the club went on for several hours after we left. Overall a wonderful hotel, staff made a real effort to make us feel very welcome (gave us complimentary chocolates and bottled water) Perfect hotel for young trendy couples looking for a nice quality hotel in Barcelona.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Brighouse, United Kingdom", "Title": "“Not what you would expect from a 5 star”", "Author": "MrsSazzleH", "ReviewID": "UR124167269", "Content": "My husband and I stayed here for our wedding anniversary for 5 nights. The first impression of the hotel was very modern and had high expectations. The hotel is a 5 minute walk from Poblenou Metro on the yellow line, which I would say is about 15 mins for the centre. If you are staying here, I would definitely recommend the metro card. When we were checking in we were railroaded into upgrading to a superior room which we were under the impression we already were however with it being our anniversary hubby wanted the best. Seemingly you pay extra from a sea view and a bath so in my opinion not worth it at all. There was no tea/coffee facilities in the room - this would need a further upgrade to 'the level'! The bed was very comfy! The pool area looked nice but you'd have to be crazy to swim in an outdoor pool in January. I was disappointed the you had to pay €20 to use the spa facilities - as a guest it wouldn't be unreasonable to expect at least one free visit when your paying the price you are! The bar prices are extortionate so we only had a few drinks here. The selection a breakfast was plentiful and the waiters were helpful. All in all, not bad but would expect better - we wouldn't go back though.", "Date": "February 5, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "psuirish2003", "Title": "“Nice Hotel, Weak on Service”", "Author": "psuirish2003", "ReviewID": "UR123798729", "Content": "The hotel was solid, but not spectacular. It's location was much farther from the city center than I anticipated, but an 8-min cab ride gets you there. It's a long walk from the city beaches, but doable. Our biggest disappointment was the service and staff. Just seemed like a pretentious group that we were never good enough for. We tried having drinks on the open-air bar halfway up the building, but the bartender was caught up with something else and didn't give us the time. We almost went back to the Hotel Gran la Florida for our last night in town (we spent a few nights at each) but had already paid for our full stay. Again, solid, not spectacular, and serive could be better. Also, definitely trends toward a younger crowd (of which we are as well).", "Date": "January 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ahmedabad, India", "Title": "“Excellent Service”", "Author": "Ashil18", "ReviewID": "UR123140776", "Content": "The Hotel has a very modern interiors. The rooms and the view is simply awesome. The Swimming pool and the lounges were simply the best. The staff is more than co-operative. A must stay when you visit Barcelona.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“A nice hotel, great staff but not at the center of the city”", "Author": "verypicky_11", "ReviewID": "UR122667808", "Content": "This hotel has a nice, chic lobby. It also has a decent breakfast buffet (included in your stay generally). The bar, restaurants, pool lounge area are nice. The gym is pretty nicely equipped. The staff here is great -- I dealt with the manager about a few issues, and she was very professional and competent. TIP: The rooms are small -- I would definitely recommend getting an upgrade as the standard room is only ok. The upgraded rooms are much better -- on higher floors, better views and a little more room to move around. The main drawback to this hotel is its location. It is NOT at the center of the Barcelona. Instead, it is about a 5 min. walk + 10 min. metro ride away from downtown. To take the metro is fairly simple but you have to learn how to use the different tickets, lines. Cabs are also nearby and don't cost too much. The hotel is not located near nice restaurants/shops, therefore there isn't much to do aside from go to downtown Barcelona everyday. You should be aware of this before booking. It is a reasonably priced hotel, but the (1) size of the rooms and (2) location of the hotel should be considered.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“D E S A S T E R !!!!!!!!!!!!!!!!!”", "Author": "D J", "ReviewID": "UR122407269", "Content": "The stay was a GREAT disappointment. On Saturday 31th December I stayed without electricity for 4 hrs and on Sunday (1st January!) again there were no electricity whereby in addition at 9:00 (NINE IN THE MORNING!) some “construction works” (heavy hammerings) lasted for 2 hours starting at aprox. 10:00 am!!!!!!!!!!!!!!!!!!!!!!! There were construction works on a 1st of january at 9:00 in the morning!!!! There were no single excuse message or similar form the hotel management, and when checking out, I had to face an extremely arrogant and unfriendly employee just saying that she doesn't care for the serious inconveniences that occurred. IT WAS A HUGE DISAPPOINTMENT! Unbelievable. I've never experience such a lack of interest and respect for a guest/client. ME? - never again!", "Date": "January 2, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“5 star hotel with 0 star service”", "Author": "OFranco11", "ReviewID": "UR122254724", "Content": "Booked a room at hotel ME Barcelona expecting to have a relaxing holiday only to find service below the standards of a 1 star hotel. On the first night we were not allowed to sit and dine at the hotel's restaurant even though there were plenty of free tables because according to the Manager the waiters were busy. We were told to come back in 15 minutes only to hear the same answer and ended up having to leave and dine elsewhere. Second night the air conditioning doesn't work, after calling several times, someone came and said that it was fixed but the room is still 26 degrees and the air conditioning still doesn't work. Only solution offered was to move to another room for a couple of hours to sleep and that will be called once the problem is fixed...but it is 1:20 am!!! Avoid if possible!!", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, UK", "Title": "“Great experience”", "Author": "NFUK", "ReviewID": "UR121663632", "Content": "The hotel was excellent - rooms were comfortable with spectacular views, the ground-floor restaurant was also good (I recommend the lamb shank) and eating amidst enormous coloured glass panels was quite an experience. Staff were always attentive, especially in helping to contact embassy etc when we were pickpocketed and lost a passport and €500 before even getting to the hotel. My companion had to spend a day flying to his consulate in Madrid and back to get an emergency passport. Subsequent web research showed such crime to be a serious problem in this town. Verdict: great hotel but avoid Barcelona until the police has acknowledged and acted on the crime problem.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“A 5 Star in Europe...different from the United States!”", "Author": "Timothy K", "ReviewID": "UR121535469", "Content": "I recently stayed in ME Barcelona purchased through a group-based business. We stayed on the ocean side and enjoyed the amenities that the hotel had to offer, while still having time to enjoy all the city had to offer, too. ME is listed as a five star hotel. Though I have never been in one in the United States, I felt like I got a service that was a little different than what a five star would be in the US. That is not to say that the service was bad... The people were excellent! Most of the staff was knowledgeable about the ways of the city, and the breakfast buffet had a diverse blend of foods, some comfortable American cuisine, others a little beyond my scope of knowledge. I recommend the shaved salt pork, or whatever the spanish cuisine was. Location was a tad inconvenient, not close to the real touristy areas, but in a nice enough neighborhood. A ten minute walk to the beach made it worth the while. Room service was good, the rooms themselves were small, but the design flowed well, and the motorized curtain that withdrew to show the wall to wall window made the cost of the room worth the while. Would I recommend it? Absolutely! But, if you are a budget traveler, be prepared to bone up on some Spanish, and maybe do a little research of your own at their 24 hour business center! Check out the front desk for awesome deals for a shopping bus to La Roca Villages...", "Date": "December 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Corby, United Kingdom", "Title": "“Excellent!!!”", "Author": "Caroline P", "ReviewID": "UR121513301", "Content": "The Hotel ME sets the pace from the moment you enter the lobby. The staff are very friendly, speak multiple languages and are happy to help. Our room was pretty much at the top of the building which had an amazing view of the city. The room itself was lovely, very spacious and really well appointed. The hotel was located slightly out of the centre but it is a no hassle 10 minute taxi ride, and there is a plentiful supply of taxis outside the hotel or the concierge will organise one for you. The beautiful Barcelona beach is a quiet and relaxing 10 minute walk through a residential area. However if you want to stay in the hotel don't worry because you can find everything you want in the hotel itself. The pool area is fantastic whether it be for a swim or to lie in the sun and chill. The bar by the pool is a very relazed affair and serves food during the day. On the day we checked out of the hotel we spent the whole afternoon there which, with the DJ adding to the atmosphere, was a perfect environment for some perfect ME time for anyone couples, families or singles. At night time the pool area becomes a club which is very busy even at 4am, although if this is not for you, you can be assured that the room provides all the silence you need for a good nights sleep. The main bar in the lobby is gorgeous and great for a drink before you venture out. Whilst we didn't try the restaurant it did look fantastic and was always busy with non residents which has to be a good sign. In summary if you are lucky enough to go to Barcelona the Hotel ME provides everything you could want. It matches what Barcelona is all about.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New York", "Title": "“am i the only one that didn't mind the location?”", "Author": "missi96", "ReviewID": "UR121154024", "Content": "as a new yorker, i didn't mind the walk to get back \"home\" each night where it was much quieter than staying in the city center - and the hotel rates were much more reasonable as well. however, if you need a siesta in the middle of the day, the location will be an inconvenience.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Shanghai, China", "Title": "“Modern hotel in the edge of the city”", "Author": "Luca_Luo", "ReviewID": "UR120965262", "Content": "I get this hotel from the bidding in priceline, so the price is quite low for a 5* hotel. We're on the 19th floor. The room is modern with flat TV, wifi, fancy light control system, automatic curtain and IPOD dock. The bathroom is nicely designed but there's no tube in the room. I like the big window in the room but our room is just beside the construction site and we didn't have a nice view. We can see neither the sea nor the Sagrada familia, which is a pity. Also the sound proof is not that satisfy. We can clearly hear the house keeping noises at 9 A.M. in our neighbour room. (maybe you can say that I'm getting up too late...) The hotel is in the edge of the city. The nearest metro station is Poblenou which is about 10 minutes walk. Taxi will cost 6 - 8 EUR to the center of the city. We booked the shuttle bus service to / from the airport from the hotel's website. It's 20 EUR for 2 people in a shared shuttle bus. I highly recommend this service if you come to this hotel from the airport with luggage. The driver is punctual and friendly. There's a petro station beside the hotel with a small convenient shop where you can buy water or snacks. Don't miss the Rambla of Poblenou which is 10 minutes walk from the hotel. It's a nice walking street with a lot of restaurants and bars. Food is nice there.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Location not great”", "Author": "E Y", "ReviewID": "UR120798496", "Content": "The hotel is situated 10mins (taxi ride) from the city centre and although there is a metro nearby but it takes longer on the metro... we booked the hotel because it had a special promotion, but if we had known it is quiet outside of the centre, we wouldn't have stayed here. The room is rather small and the heating doesn't work. And the lighting in the room poor as very dark even switching on all the lights in the bedroom! However, the staff are friendly and helpful.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "1", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Hotel is located way out and the hotel rooms are not 5* !!”", "Author": "amma1234", "ReviewID": "UR120781574", "Content": "Be prepared to either catch taxis everyday or the local metro! The bedrooms were very small,there was no bath tub, dressing gowns and just didn't feel like a 5 star hotel. Prices on the room service were ridiculous so didn't even bother. Was looking to use the swimming pool and spa services but there were out of service for the full four days we were there! Not happy at all. Staff were nice n friendly but not at all informative of the hotel facilities, tourist or local information. Very disappointed to say it was meant to be a 5 star hotel.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "california", "Title": "“fashion & trendy”", "Author": "andree p", "ReviewID": "UR120661907", "Content": "ME Barcelona has it all, from the moment you enter to the lobby you can feel a very special Aura, with modern music and bar in the lobby, this hotel is really worth it. the rooms have all kind of service starting from FREE WIFI to pay T.V., 24hrs Room service, Ipod dock and more. if you dont want to go out to of the hotel dont worry because you can find everything there, the have a club (Angels & Kings) with great parties, SPA, 24 hrs gym, 1 michelin star restaurant, I was there there with my friends and my girlfriend , and I actually booked a romance package. really good.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Hong Kong, China", "Title": "“Wonderful stay”", "Author": "cauliflowertikka", "ReviewID": "UR120559620", "Content": "Stayed here for a long weekend in April to celebrate a birthday. I got a great rate which I didn't think would get me any special treatment but put a comment in the registration that we would be coming to celebrate the birthday. When we arrived in the hotel, there was a kind note wishing us an enjoyable stay and wishing my spouse a happy birthday. Later that night, a bottle of Cava arrived! Very nice service. The hotel is a bit outside the city but it is a short tram or subway ride away to pretty much everything. The room was nice and the Aveda products were a great touch of luxury!", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bruxelles", "Title": "“Not disappointed !”", "Author": "Ompile", "ReviewID": "UR120293296", "Content": "We were a group of 10 people, stayed 3 nights in the hotel and liked it very much. The design is design but still very functional in the rooms (the only comment : I never saw a 5stars hotel worlwide without toilet brush...). Unlike other reviewers nothing to complain about the service (but we did not eat at the restaurant, there are so many other places in Barcelona to eat , and cheaper!). Cocktail prices at the bar are quite high (10Euro for a mojito) compared to other bars in Barcelona but this is normal price for this hotel standing. Breakfast was very good with spanish specialities like ham and cheese, delicious. Beach is at 10minutes walk, next metro station also, coming back from center at night with taxi will cost you around 20euro. Special big up to the nice receptionnists who were kind all the time and always ready to help.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Beijing", "Title": "“Very poor”", "Author": "Kamran Q", "ReviewID": "UR120292004", "Content": "We had a conference in hotel. The hotel is not ready to host an int conference. The room equipment is very poor. In many rooms the shower door was missing. Room is very small. Sleepers are missing. Food is compared too expensive. Area is like Berlin-neukoelln.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Georgetown, Malaysia", "Title": "“Unique place to chill”", "Author": "UnderBigHill", "ReviewID": "UR120258424", "Content": "Hotel ME located at a nice neighbourhood where it's within walking distance to beach and shopping area. I love my room as it comes with great sea view. I can even enjoy sunrise in my room :) The bathroom is not really spacious but I love the rain shower and bathtub. Oh, and I love the coffee maker too. I enjoy having a nice cup of coffee every morning to start my day, and to have a nice cup of coffee after a long day walk. The buffet breakfast is very good. A lot of variety to choose from, and you can eigher have your breakfast in the unique design restaurant, or at the outdoor.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Loved every moment of our stay there!”", "Author": "TravelingNut1972", "ReviewID": "UR119740515", "Content": "Yes, the hotel has a unique design and it was planned, designed and decorated excellently. It was a very comfortable stay. But I must agree with the other reviewers that the ME Barcelona can definitely do better at its service. One evening we ate the restaurant and it took for ever to order, to get the food and even to get the check! Great location.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Paris, France", "Title": "“Second and last time”", "Author": "Darya R", "ReviewID": "UR119220023", "Content": "We stayed twice at this hotel, first time in July and second time this week end and we won't come back. In July we noticed that the service was poor and not at the level of the 5 stars hotel. But the hotel was beautiful and well situated, so we decided to come back. Actually, we had several problems in July and even more this week end( October). In July we stayed at 13th floor and the water was awfully cold all the time, it was impossible to take a shower, I'm not even talking about the bath. The water in the swimming pool was cold too, but when it is hot, it's not such a big problem. The room service took 3 hours. Once we could not enter the swimming pool floor because of the so called private party, we just did not understand why we cannot use the amenities we pay for. As it wAs indicated by someone, there are a lot of strange girls in the lobbies ( we even thought they were prostitutes because of their outfit). But we lved the design of the hotel and it's situation not far from the sea and far from las ramblas. So, we come back in October. As for the first time we came with a little dog of two kilos. It is important to highlight that in July we did not have any problem because of the dog. At the same time they charge the dog's stay 50 euros a day, so, normally there should not be any problems. But this time, while having our breakfast the second day of our stay, we were aggressively told to go out to eat on the terrass with our dog (the first day nobody told us nothing). When I told the manager, that we are staying for the second time and the previous time we could eat with our dog, he said that it was a mistake (a mistake which lasted 4 days however). And he also told me in a very aggressive manner that I should be happy that they accept my dog. He probably forgot that it costed 50 euros (It's the first hotel where we were obliged to pay a supplement for the dog ). I would not bother you with details, I just want to conclude that this is not a dog friendly hotel, not a 5 star hotel and I certainly chose somewhere else to stay in Barcelona NeXT Time.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Charleston, South Carolina", "Title": "“Awesome hotel”", "Author": "Jane B", "ReviewID": "UR119086790", "Content": "Just got back from Barcelona and we LOVED this hotel. We stayed on the Level, and the service and rooms were great. Your on the higher floors with the Level, and we had sea views that were beautiful. Food and alcoholic drinks served all day, and the staff cannot do enough for you. Love how modern this hotel is, along with the motorized curtains, great lighting and modern rooms and bathrooms. Love that there is no carpet on the floors of the rooms as then there are no grimey, nasty carpet under your feet, just the clean white floors. We always stay in the more residential parts of town when we are on holiday, as we hate being slap bang in the middle of the touristy restaurants etc., This was a great decision in Barcelona. There is a street 2 blocks away full of local bars and restaurants....so much better than Las Ramblas. You will not be dissapointed.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Australia", "Title": "“Great staff, comfortable hotel”", "Author": "Aussietourist01", "ReviewID": "UR119084822", "Content": "We stayed here for one night pre-cruise on 24th September. We deliberately chose to stay out of the city centre as we had a 25 hr flight and wanted to stay somewhere quiet. We arrived at 9am with two exhausted teenagers and the staff could not have done more to assist us. They allowed the kids to stretch out and sleep on the sofas in the main reception area (very comfortable ones!) while they prepared rooms for us-which only took an hour and a half-exceptional given they were almost full and check out is not until 12.oopm. The concierge was extremely helpful in giving us general tourist information and directions. We ate dinner in the ground flooe reatuarant and it was delicious and reasonably priced and again the staff were very friendly and helpful. It's only a short-10 minute walk to the beach and numerous cafes at Pobleu Nou.Trams and buses run from outside the front of the hotel into the city centre and it takes around 15 mins on each. We were lucky to get a great rate for our night's stay -$165 Au and would definitely stay there again.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "whitby", "Title": "“Its just ok”", "Author": "vacati0nnati0n", "ReviewID": "UR118843695", "Content": "The hotel is modern, clean and offers many of the amenities found in a five star resort at a tremendous rate. They have a stunning patio, we sat in the patio alone in the evening paying $12 for a glass of wine. It falls short in a poor location outside the city center(Santi Marti area on some maps). The rooms are unique but small. Phone services are contracted out and a local call is the same rate as an international one. Rates can vary from 170-200+ euros/ night. There are much better finds out there closer to the city center. If you go, ask for a room away from the daily construction.", "Date": "October 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Stylish but poor value”", "Author": "JohnEric2", "ReviewID": "UR118652283", "Content": "A very stylish, chic designer hotel. Young friendly motivated staff who are over-trained and working to a formula. Location ok but not the best, food ok but expensive. Anyone who knows Barcelona will tell you the smaller restaurants down the myriad of alleys serve inexpensive but fantastic food. The smaller hotels around the Ramblas are not as chic but at least you’re in where the action is without a long trip in and out. Don't get me wrong from the motorised curtains to the designers styling of the bathroom this is a classy hotel. It just is too clinical, too cold for a fabulous city like Barcelona.", "Date": "September 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Brussels", "Title": "“Funky option, but parental guidance suggested!”", "Author": "americantravelgirl", "ReviewID": "UR118494141", "Content": "My company held a conference at this hotel. The rooms are interesting... White floors in the room that are scuffed - black would have been a better option as white shows ALL the dirt and marks. The bathroom has a window onto the bedroom, so if you are with a partner and shy this could be awkward (I was by myself). The bed was comfortable. The mini-bar item includes a bag of sex accessories - feather tickler, condoms, lubricant, and something called a \"vibrating ring\". There are lots of hard to see, complicated buttons on the wall to operate mood lighting and curtains. The room key features a sexy looking couple who look like they will be getting it on just now. The internet access home page features an even sexier couple, with a man I would be frightened to meet. The turn-down amenity is a heart-shaped lollipop. I think you get the picture. This is not a family hotel. I would say that it's not really a business hotel, except that all the sex toys, lollipops, dirty internet and room key people made for very lively dinner conversation after a few glasses of wine. If you are up for all this and the price is right, it's a nice enough choice.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lille, France", "Title": "“Real Five Star Feeling”", "Author": "Szenti", "ReviewID": "UR118487314", "Content": "Top Hotel, Nice design, clean rooms, very clean bathroom, acceptable fitness Also iPhone dock, full extra room, automated curtains", "Date": "September 23, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "", "Title": "“It's more like a three star”", "Author": "AdanaGlos", "ReviewID": "UR118449785", "Content": "Ok if your looking for a late night (it has a nightclub). Beds are comfy. Food is ok. The spa was smelly & cold. 20 mins - 30 mins away from anything e.g beach, shopping & sightseeing. View from the rooms aren't good.", "Date": "September 22, 2011"}, {"Ratings": {"Location": "3", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Chicago Suburbs", "Title": "“Alot of walking!”", "Author": "JJCChicagoSuburbs", "ReviewID": "UR118206049", "Content": "This was a very nice hotel, and unlike Madrid most folks spoke pretty good english. Great pool area! The draw back from the room was we had a crane right in front of our window view. Ask to see the room!!! The staff was very good and friendly. With the exeption of one gentleman at the desk who was helping us book an excursion and was to leave the booked info in our room and also leave info on another excursion we requested. We were there only 4 nights so each day we had to plan to the fullest. We got back to our room late the evening before we were to depart at 8:30 AM for our trip to Monseratt. To our dissappointment nothing was in our room and when my husband went down to the front desk they know nothing about this and he was not there. So we were unable to go and this ruined our last 2 days because we did not have time. The person, which I wish I could remember his name did not even apologize, he said oh I had the wrong room number. Even though he wrote it all down, did not say or do anything other than say well you can do something else. Also, cool neighborhood, but you have to train or bus to get to the popular sites.", "Date": "September 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Rayleigh, United Kingdom", "Title": "“Nice hotel with top service”", "Author": "M1DLD", "ReviewID": "UR118182141", "Content": "Stayed for three nights on business in September. The hotel is an impressive building inside and out. Very modern. I stayed on the 29th floor with a city view that was nothing short of stunning! The rooms are not big but are plenty big enough for two. Very modern and maybe a little to so, with buttons to operate everything so take time to figure them out. The one thing that makes this hotel stand out from the crowd is the staffs attitude to service. The tagline is 'anything is possible' and they certainly do anything to make this a reality. Just call them and within minutes they are there. Overall a nice place to stay with excellent service.", "Date": "September 16, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Me”", "Author": "Ekoi", "ReviewID": "UR118067909", "Content": "ME Barcelona by Melia is a wonderful 4 star hotel with exquisite service. I have rarely encountered such a welcoming staff. You feel right at home as you step into this modern hotel. The decoration and architecture reflects the new Barcelona. Do not expect plush rugs and carpet. Everything is sober and bright and clean. The airconditioning is so quiet, it is hard to believe it is on. By the night table one can control the whole room. We chose a room with a city view, just to see the lights at night. We were not disappointed. We opted for a Red Level room to enjoy the amenities without much expense: the food and all the drinks are included, all day long in the Level lounge which we enjoyed. This hotel has one of the best restaurants in Barcelona, Dos Cielos. Not to be missed! Although the hotel is not in the center of town, it is just a few euros away by taxi. And for those, like us, who can walk, it is just 20 minutes away. There are always the bus and the metro which are the best way to get around. The hotel staff will help you in this matter. I definitely recomand this hotel.", "Date": "September 13, 2011"}, {"Ratings": {"Location": "3", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Chicago", "Title": "“Hotel was beautiful! SERVICE ROCKED!!!!!!!!!!!!!!”", "Author": "CeCe30Chicago", "ReviewID": "UR118033284", "Content": "What a great location. We LOVED this neighborhood. We walked into a \"local\" restaurant row similar to Las Ramblas but full of locals. It was delish! We could walk to the beach, easy to public transportation. Graet great place! We were here for our honeymoon and really fell in love with Barcelona. I am very allergic to nuts. The hotel restaurant made me breakfast everyday and made sure there was no contamination. I am so lucky that they were that kind. Food variety was def very European; remember you are in Europe. I loved it. ould go back. Drink prices were on the expensive side however I am sure that the cost to run that hotel is high. I'd go back in a split second.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bickley, United Kingdom", "Title": "“We fell in love with ME and are hooked....”", "Author": "RajuWatts", "ReviewID": "UR118008059", "Content": "My wife and I went to the ME for our 10th Wedding Anniversary and from the moment we arrived until the moment we left , we were made to feel so special and made our weekend one to remember. We were allocated the fantastic Samara to look after us and she was amazing helpful, polite and just a really lovely person. The last time we were treated like this ironically was on our Honeymoon in the Rangali Hilton in 2001. They had arranged the room very specially for me, had our wedding song playing when we walked in, Champagne on ice , rose petals in the room, loads of candles and a message I asked them to put on a note but in fact wrote on the massive mirrored bathroom wall. We had the Loft Suite on the 27th floor and the view was spectacular to say the least, with the Segrada Familla to the left of the view and the gherkin to the right, wall to ceiling windows, a truly special view and room. We were on the levels so had access to the lounge on the 25th floor with free food and drinks all day and service beyond the call of duty, they all just couldn't do enough for us, the knew why we were staying, and basically pampered us for 3 days. A Special mention to Andree and Daniel (both from Mexico) who was really informative and helpful. Location wise it is an 8€ taxi ride to the Ramblas, Port, Barrie Gotic but far enough away to be able to relax. On the Sunday we stayed by the pool all afternoon listening to sun kissed anthems whilst drinking cocktails and eating the free chocolate strawberries! I have been bitten by the \"ME\" bug and will definately visit them again and would love for our children to enjoy ! What you'll notice is that the air-com pumps out a fruity berry smell and also every candle in the hotel has this smell and when you return home everything including the suitcase smelt of these berries, reminding us of what a great hotel it was and wonderful weekend. Another special mention to the Aura Manager Claire Jones who helped me arrange everything from the luxury of my desk at work, i never envisiged that ME would be this good and I cannot wait until we can come again... 10/10 from \"ME\"", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Style over substance!”", "Author": "KirstyandTom", "ReviewID": "UR117890175", "Content": "The hotel is in a great location, close to the Metro so it's easy to get around. But, the decor is VERY tired, the black paint may have looked great when it was done, but it is in serious need of a refresh. Combine this with the dusty surfaces and the overall effect is eugh rather than wow. The greeting when you check in is seriously lacking -, the staff seem to be totally bored with the whole experience and it shows. Beware that some rooms allow smokers - if you don't specifically specify non-smoking, you may end up in a room smelling like a stale ashtray with no window to open. If the hotel is full, you'll be stuck. It's also worth noting that the design of the hotel incorporates metalwork outside, from the inside this blocks the views from one of the windows. This is a real shame as the views from the higher floors are fabulous. The pool area is great, it's designed to be high impact \"hip an cool\" in design and delivers. Its also very small so you end up crammed in like sardines, so get there early and don't vacate your spot or you'll lose it! These things aren't deal breakers, but if you're expecting a 5* something special experience it's not to be found here. All in all, it's an acceptable place to stay if you manage to get a cheap deal. If you're having to pay full price and are looking for something a bit special, you may be disappointed. We were.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City", "Title": "“THE BEST EVER”", "Author": "ButterflyNYC", "ReviewID": "UR117884366", "Content": "I came back last night from an 8 day stay at the Me Barcelona. I had a fantastic experience. The room was lovely and the view of the city from the floor to ceiling windows was so good that I had the curtains pulled back even at night. I fell asleep looking at the lights of the city. The front desk staff were absolutely terrific. They were knowledgeable and friendly. When I asked for help to set up my net book, someone came up with me to my room and took care of everything immediately. The buffet breakfast was excellent. There was a huge variety of choices and everything was fresh and appetizing. I wish I took down the names of the people at the front desk to thank each of them individually. There were plenty of restaurants within a few blocks of the hotel and the one time I ordered room service, the food was excellent. It says I should write also about what I liked least and I cannot think of one thing. The Hotel Me Barcelona made my stay in Barcelona a 5 star experience. I have to add one thing--I travel alone and service is especially important to me. I read some of the other reviews and saw some of the criticisms. I find it interesting that none of those complaints were true for me. I am looking forward to staying at another Me Hotel.", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great hotel in a great city”", "Author": "Julia J", "ReviewID": "UR117717724", "Content": "My boyfriend and I travelled to barcelona in the fall of last yr and stayed at ME. Upon arrival, my impression of ME was that it was very modern (like the W) and very well presented. The staff was pleasant and very helpful (we arrived before the recommended check in time). We waited at the hotel lobby bar while the room was being prepared and was prompted to our room as soon as it was ready. The room was small but well designed and very clean. Another plus in my book for this hotel was that they had aveda products! which I love. The bathroom was super interested with a really big shower stall with a sliding door and the toilet in another corner with another sliding door and the bathroom sink situated just behind the bed separated by a big glass window. all in all this was probably one of the most interesting rooms I've stayed at. The breakfast buffet was great and delicious. The hotel lobby restaurant was also very good. The pool and the patio of the hotel was amazing. I was so sad I didn't bring a swimsuit because this patio was awesome! I also ate the best club sandwich at this hotel pool patio. the location of the hotel was not bad, we couldn't walk to anything we wanted to check out but it was a short cab ride to la ramblas, gaudi park and the gaudi church. there were many restaurants and bars in the hotel neighborhood and also there was a very nice large outdoor concept mall near the hotel (walking distance) All in all I enjoyed my stay at ME barcelona and I am a fan of ME hotels now!", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "amsterdam/netherlands", "Title": "“MELIA ANSWER TO W HOTELS...”", "Author": "bvansante", "ReviewID": "UR117590409", "Content": "Although being a Gold member in the mas rewards programm this was my first stay at a Me hotel. It seems to me like the Melia answer to the W hotels/Starwood. A trendy lobby nicely decorated but there it stopped with the pro's At check in at 1pm is was told in a very rude way to come back after 3pm as there was no room available, despite mas gold members can check in from 10 am (subject to availability). After waiting 15 minutes and seeing other people checking in i asked at the reception staff again and was offered a twin room iso the booked double/king. As we did not wanted to spend more time waiting we accepted this room. The room it self was small but nicely decorated with some nice touches. however the room was not very practical eg bathroom/toilet layout. The breakfsast included in our rate was ok but room lacked atmosphere and nothing really specatacular. on offer eg no fresh juice etc. staff worked very unorganised.the pool was very small and not really appealing. we ended up on the beach a 15 minute walk. the area is not very attractive either.all in all would not return to this hotel. offcourse late check out was denied and still did not get mas miles on my account. This hotel needs to get its acts together , especially the staff beecause just a trendy lobby with lounge music is not enough", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "2.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Antwerp, Belgium", "Title": "“Service of a 3-star hotel at best!”", "Author": "Lior111", "ReviewID": "UR117284426", "Content": "We arrived by taxi from the airport and there were no bellboys to help with the luggage. When we commented the receptionist answered, \"we are full sir, wait your turn\". I already got the feeling. I requested one of our 2 rooms to have a bath tub, the reply was \"fine come back at 3pm\". We were at the time 11am. When we came back we were told \"sorry its not possible\". After I insisted they said ok but it will cost moreand we had to wait 2 more hours. Needless to say, we wont be back.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Look no further tha ME Barcelona - Superb!”", "Author": "Ash and Gem B", "ReviewID": "UR117246071", "Content": "My Fiance and I went to Barcelona to celebrate her 30th Birthday. As usual there was much deliberation as to which hotel to book but if we can be of some assistance, look no further, this hotel will exceed all of your expectations. We arrived earlier than check-in and were greated with our first encounter of the staffs \"anything is possible attitude\" and shown shortly to our lovely room on the 20th floor with views over the lovely roof terrace swimming pool area on the 6th and the ocean in the distance. I had contacted the hotel prior to arriving advising them that this was a special occassion and there was a note written on the bathroom mirror both welcoming and congratulating us. This was the first of many a \"nice touch\". Others included fruit platters, chocolate dipped strawberries and fantastic music by the poolside. In terms of the hotels situation, in our opinion, it was the perfect distance between the midle of the city (Las Ramblas and Gothic Quarter etc) and the beach. Barcelona in August is an exceptionally busy place so it was nice to retire to the sanctitude of our ME. We will not spoil anymore of the surprise but will say that the lobby and pool bars make fantastic cocktails and the ambiance throughout the hotel spot on. We feel it absolutely necessary to commend the work and service standards of Joe-Lee and his anything is possible team....not only did you make two people very happy but secured the life custom of ourselves and hopefully friends too, thank you. Ash & Gem", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“We thought it was fantastic”", "Author": "mariatollbar", "ReviewID": "UR117127065", "Content": "We stayed at the ME last week. We entered the hotel and were pleasantly surprised the atmosphere was relaxing clean quiet friendly. The front desk staff were more than accomadating and the concierge was available with any questions or concerns. The room was Miami Beach south beach art deco spectac. We loved it clean bright nice lines and so comfortable. The pool was wonderful we did not get a chance to enjoy it but looked great again very comfortable. The area was close to great eateries, beaches, mall near by. City center close by cab or bus, we did both. I give it a 10 and will stay anytime I am in Barcelona really loved it.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "5", "Overall": "3.0", "Service": "4"}, "AuthorLocation": "Leuven, Belgium", "Title": "“Spectacular, trendy, very nice food, but lots of comments...”", "Author": "slowlyraoundtheworld", "ReviewID": "UR116938218", "Content": "Stayed here one night for work, host decided for me. Fancy, trendy, cool, great concept, excellent breakfast. But also: cigarette burn stains on the floor, lamps not working, furniture looking as if it was badly assembled, a mistake by room service, ... Maybe I was just unlucky and this room may have been an exception, but this could have been a truly fantastic experience if it wasn't for a few too many operational mistakes.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“Couldn't ask for more”", "Author": "Hilton954", "ReviewID": "UR116798781", "Content": "We loved the ME. The location was perfect - a short walk to the metro and tram, as well as the delightful Rambla del Poblenou where we ate most of our meals for a fraction of the price we would have paid downtown. I prefer staying in this neighborhood, which is mainly residential and quieter than in the city center. The hotel has a nice funky feel, the rooms are not as small as I expected and the pool deck is great. Free internet is always a plus. The iPod dock and remote control lights and curtains were all nice extras. Beautiful bathrooms. Staff were extremely friendly and obliging. Our only criticism is the fact that the rooms have very little closet space and drawers, so we had to keep some of our clothes in our suitcases. Would definitely go back!!", "Date": "August 16, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Windsor, United Kingdom", "Title": "“Great Hotel, loved Barcelona.”", "Author": "Dan V", "ReviewID": "UR116717766", "Content": "My girlfriend and I booked the hotel ME for short break in Barcelona, flights with ryanair flying into Giona airport. Firstly (although nothing to do with the hotel) Girona airport is not in Barcelona..! anyone expecting a short taxi to the city maybe shocked when the driver tells you its 120 euros ! Girona is actually around 100 km north of Barcelona ! Best bet is a taxi to Girona train station (15-20 euros), train to Barcelona-Passige de Gracia (20 euros), yellow metro from Passige de Gracia to Poblenou (1.45 euros each). All in all takes about an 1hr 20mins and the hotels about 10 mins walk north of Poblenou metro station. Anyway, the hotel is in a district called 22@ which is a nice area to the west of Barcelona city centre. This turned out to be a real plus as we felt we saw more of Barca than we would have had we stayed in the city centre. The area felt safe and clean and had a few good restaurants and cafes for lunch or breakfast. The best way into town from the hotel is via metro, Poblenou station has the yellow line which goes via all the best spots in barca. We particularly liked Port de Olympica and Barceloneta best at night, and all the touristy stuff in the day (la ramblas, passiege de gracia for shopping, parc guell and sagrada familia cathedral etc). The hotel is a 29 story high rise building and is quite striking from the ground. when we arrved the lady on reception was really friendly and helped us with directions and gave us some recomendations etc. we actually ended up agreeing with pretty much everything she said! The hotel It has a roof top pool on the 6th flr with a bar, sunbeds and little booths to sleep and relax in. word of warning, the cocktails will blow your head off and cost about 10 euros each!! we didnt use the restaurants although we heard they were supposed to be good. All in all this hotel is a really good choice, we had an amazing time and although its a little out of town we actually found this to be a real positive! Lastly - if you decide to use the \"love me tender\" pack they provide..FYI - ITS NOT COMPLIMENTRY, ITS ACTUALLY 30 euroes !!!!!!! total rip off for whats inside (trust me)..", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“OUTSTANDING HOTEL!!!”", "Author": "Kate V", "ReviewID": "UR116703924", "Content": "Last week we stayed at ME Barcelona and we spent some days in this beautiful city and we had a an amazing stay. The views from the rooms were beautiful overlooking the sea and the staff was superb and very attentive. The location is better than the W or the Arts. It is not right at the city center but it is 4 blocks away walking distance from the beach and you can go to La Sagrada Familia even walking, the metro is right behind the hotel. We discovered the area and it is beatiful, specially if you go to la Rambla del Poblenou with amazing tapas bars and beautiful architecture. The atmosphere, the pool, the restaurants and bars were all excellent. We will definetely come back!!", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“amazing hotel ... brilliant attention to detail”", "Author": "blondie3000", "ReviewID": "UR116519658", "Content": "i have just got back from my hotel stay for my 30th Birthday - the hotel was amazing the staff superb and the dinner at Dos Cielos was the best i have ever had in reference to some other comments i have stayed in 5 start hotels all around the world and definatly class this as one - the level lounge was a great lil extra and my room was fantatstic - the location was good as i wanted to be away from the rable of the Rambals - we were a 5 min walk to the metro 5 stops from the tourist center and a 15-20 min walk to the beach and the clubs there - the aura team are fab could not do more for us and i can not recomend more highly excited to see the London version soon", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“This is a very good hotel, but not perfect.”", "Author": "Philip_Rogers", "ReviewID": "UR116317631", "Content": "I booked this hotel for a week as a 50th birthday treat for my wife. We got a very good deal on an Easyjet flight and a room on \"The Level\" with lastminute.com. My overall impression is that Me Barcelona ranks as a good 4*, but not a 5*, hotel. However, the price we paid was extrremely fair so this should not be seen as a complaint. The location is about 3 miles NE of the city centre, but there are very good bus routes (7, 40, 42) which take you to the centre in about 15-20 mins depending on traffic. The 40 is particularly useful as it goes to the Port Vell harbour as well as the back of El Corte Ingles in the centre which is great for shopping plus a stroll down the Ramblas. The T4 tram stops right outside the hotel which works well for the Olympic harbour / Estacio de Franca in one direction, and St Adria Renfe rail station in the other which connects to Costa Maresme beaches. Barcelona's public transport is possibly the best in Europe. There is a useful shopping centre at Glories 10 minutes walk up Diagonal Mar which includes Spanish chain stores and a Carrefour hypermarket. The local city beaches are 15-20 minutes walk away down the Rambla de Poble Nou which is a really nice walk along a local tree-lined shopping street with locals out for coffee/lunch/dinner at numerous street cafes with few tourists about. There is a Mercadona supermarket along this street about 5 mins from the hotel which is useful for mineral water, picnic items etc. The hotel itself had a good atmosphere with lots of young intelligent student intern staff only too pleased to help, and to practise their English! The balance between this group and more experienced staff felt not quite right, but should not be viewed as a problem unless you are really particular about a certain type of service. Our room was small but intimate. Room servicing was below the standard expected. We had to request a toilet clean on arrival, replacement of coffee / soap / shower gel several times, and our requested daily newspaper was a bit \"hit & miss\". Minbar items should be avoided as prices are extortionate. Don't even think about opening the surprise box on top of the fridge! I would recommend a room on \"The Level\". The Level lounge was another place aside from the room for comfort & privacy. Drinks and snacks were included and saved a lot of money if we had to pay for everything in the bar.Sometimes there was enough to replace lunch / dinner but not always We had two dinners in the Sky Restaurant on the ground floor (not the more expensive Dos Cielos restaurant|). Service was excellent, especially from the wine waiter, and prices were very reasonable for the quality, even given the poor Pound : Euro exchange rate. Overall, I'd recommend this hotel. Don't expect it to be 5* perfection, but get a good price and you'll have a great stay at a value for money deal.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Oslo, Norway", "Title": "“Trying hard”", "Author": "ANicolai", "ReviewID": "UR116296186", "Content": "The architecture is very interesting with this new hotel by Melia. It is trying very hard to be a 5 star hotel, with all the works, but im not sure they are good enough on the details to give them that. Things are \"falling apart\" a bit here and there, and they have set a high standard on service for themselves which they are not always able to live up to. We had a jr suite, whc is is very nice and large, and comes with a series of perks; use of a Mini cooper for 3 hours a day (but only 3 hours so we did not take the chance), ipod for the room (did not work), and the minibar was out of order. The executive floor drinks and snacks/breakfast worked indeed, and they where very good at offering help with any questions up there. Our bathroom had a window into the room (all the rooms we saw had this) which you could not blind off, again an example on a designer going off the rails if you ask me. They have two restaurants at the ME: The restaurant on the ground floor was a disappointment; the waiter we had was a complete disaster, and the Crema Catalana dessert, which should be the pride of any Catalan chef, was nothing short of a natural disaster! After exchanging it i think we got something he had bought on the next door gas station! Horriffic. The Dos Cielos on the 24th floor was however FANTASTIC! the Torres bros. where there in person and we had the best al fresco dinner in a long time there. Try the baby goat! Price vs quality is great! Nothing more to say. Its just strange how big difference there are between the 24th and the ground floor! Location wise its best for the beach, 5 - 10 min walk away, straight down. It is also not difficult with the Metro only a few mins walk away.", "Date": "August 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Amazing super cool amd relaxing hotel.”", "Author": "CaptainP", "ReviewID": "UR116015022", "Content": "I was very impressed when I got to the hotel as we were welcomed like a celebrity couple. I decided to celebrate our wedding engagement after hearing so many good reviews of this super cool and trendy hotel. We were delighted with the room which was decorated with rose petals and had a bottle of cava waiting for us. The view over the city of Barcelona was amazing and the hotel had many great places to relax including in a lounge which was so cosy and felt like someone's living room.   I am sure that the welcome and hospitaliy with have been just as good had I not informed the hotel of the fact we were celebrating our engagement. Having stayed at the W hotel before I think the ME concept and experience is far superior and more personal.   I highly recommend this hotel for a casual visit or to celebrate a special occasion.", "Date": "July 30, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Manchester", "Title": "“Not the 5* I was expecting”", "Author": "Rhi101", "ReviewID": "UR115863476", "Content": "Although I had a great time in Barcelona I'm not sure I would stay at ME again.  The location is out of the hustle & bustle in a nice quite area, which felt safe & friendly. Plus it's only a 10 -15 minute walk to the beach. I liked the room and thought it was neatly designed.  However a few (there were more) of the gripes I had included  - The reception staff not being overly helpful, they just said what needed to be said & that was about it. In their defence they did seem busy, so it may be a different story at quieter times. - Our room not being ready when they said it would be & not much of an idea when it might be ready. - The room itself looked like it had been cleaned in a rush. - They didn't clean our room again throughout our stay (but did knock on at 7.30am on our last day to see if it needed cleaning!)  - When we ordered glasses of wine at the roof top pool bar the glass my wine arrived in was not clean. When I pointed this out to the lady serving us (astonished that she had even given me it in the first place) she said it was because they were plastic glasses & had been washed in a dishwasher! She seemed annoyed that I'd asked for a clean glass, which in turn annoyed me.  If this was a 3* or possibly a 4* I might have been less critical, but for me this stay was not 5*", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "4"}, "AuthorLocation": "Hingham, Massachusetts", "Title": "“Not a five star hotel; No in room internet business travelers beware”", "Author": "debecet", "ReviewID": "UR115853584", "Content": "First I will start off with the bad. This does not sound terribly important but in a five star hotel it is UNACCEPTABLE! This hotel does not truly offer in room internet. Because during the day it is so slow it is impossible to get work done without going to the business center. When I asked the front desk about this, they boldface lied (which I initially believed) and blamed it on the internet company. We kept being promised that it should be fixed by the \"end of the day\". It was not until our third day there that one front desk person FINALLY ADMITTED that their internet is ALWAYS LIKE THAT and that the internet is better at nite because less people use it. i do not appreciate being lied to particularly in a PURPORTED FIVE STAR HOTEL! I booked this hotel for my HONEYMOON through an online booking site. First, when I called to confirm, the front desk staff (after being transfered to two people first) told me although they did not find it on their computer, there should be no problem at check in. Now I was a little concerned that a five star hotel was having trouble access our reservation but ok.... We arrived at 11pm. Reservation still not showing up at the computer. Front desk tells me they need to contact the internet site which they say is not responding. Well after flying from Sevilla to Barcelona after experiencing a two hour delay, i was getting very annoyed at this process. Sensing my annoyance, this pleasant young front desk person said with my confirmation page they will gladly put me in a room although I should check with the front desk in the morning to make sure the hotel finds my prepaid reservation and I don't get charged. Well twice I had to go to the front desk over the next two days to confirm our prepaid reservation, until someone finally admitted that there internet is awful so they cannot confirm with the booking site online (which is the only way they tried up until then) but they finally did over the phone. why in a five star hotel, did they put us through that? I also need to mention the three person line every time we had to go to the front desk! As a previous reviewer mentioned this hotel has potential but has issues with execution. eg-bartender taking literally 10 minutes to prepare each coctail (not good when there's a full bar of people), front desk staff well trained to be smiling but not necessarily knowledgeable about different types of restaurants (high end versus local; spanish vs. other types of cuisine); i should mention the absolute professionalism and courtesy of Luis Miguel (sorry not sure of Miguel); He was honest. apologized profusely because I kept having to confirm our reservation and gave very knowledgeable recommemdations about restaurants and travel tips to outside areas. How he is not working at the W Barcelona I do not know.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Beautiful hotel in new area 22@ close to convention center”", "Author": "ElaBizz", "ReviewID": "UR115837363", "Content": "Stayed There for 4 nights. Got an incredible price on priceline ( name your price) of 125$. It was well worth it! From entering the room you can only feel like a princess: all white and fushia decor, blue bathrrom, beautiful view with amazing electric curtains,soft and comfortable bed...I love it! Aveda product in the bathroom a plus. The location is far from the city center (8 euros taxi to plaza Catalunya) but if you don't mind walking there is a metro station at 15 min walk with a huge shopping complex also at the other end a big shopping center ( diagonal center) which connect to the green line of the hop-on-and-off bus. You can then connect to the red line for all tourist attractions. The green line also takes you to port Olympico which has all the clubs and restaurants. You have taxis parked on the side of the building constantly. When leaving make sure you take a business card of the hotel cause most of the taxis did not know this hotel ( new area and confused with the other melia) I did not try the breakfast but instead went to the Pere street to some small cafes. Excellent croissants around the area. Beautiful restaurant on the upper floor with an amazing view of the city.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“One of the kindest and most helpful staff I've ever met”", "Author": "SD4000", "ReviewID": "UR115792380", "Content": "The service and kindness of the ME hotel staff is extraordinary. From reservations to the front desk, everybody is more then happy to help you with your requests. It was a delight to stay at ME Barcelona and I could recommend it to everybody. The room (Seaview) was nice and bright because of the featured from ceiling to bottom windows. The beds were amazing, although I stayed in a room with 2 double beds, (no problem since I was alone) I wouldn't personally choose that when I would be staying there with my partner.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Dallas, Texas", "Title": "“Could not figure out why this is 5 stars”", "Author": "kadels_s", "ReviewID": "UR115332587", "Content": "A nice and clean modern hotel - that gives it 3 stars. Restaurants and a spa takes it to 4 stars. But there were no special amenities and no outstanding service. The spa was nothing special and the massages were jokes. Finally, the hotel is in the middle of NOWHERE. There is a nice Italian restaurant down the street, but nothing else. Would not stay here again - the price was too high and the location worthless. The dental floss stuck to the shower when we arrived was a nice little bonus.", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "London", "Title": "“Ok hotel”", "Author": "dreamer_ukLondon", "ReviewID": "UR115314612", "Content": "Originally we had a standard double room. It was ok, although a bit shabby, fairly small, and the a/c kept switching itself off. We then upgraded to a room with The Level and a sea view (city view rooms just get a view of a building site, and are a bit smaller). This room was much nicer - bigger, airier, not shabby (except the toilet seat which was not attached properly despite us asking for it to be fixed), and The Level gives you access to a Lounge with free drinks, snacks & breakfast. Drinks at the pool bar (Angels & Kings) are ridiculously expensive, but the water melon cocktails from the downstairs bar are lovely. It's a 5 minute walk to the nearest Metro which takes you right into the middle of town quickly. Taxi from the airport is approx 25-35Euros.", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Melbourne", "Title": "“Awesome hotel! So Modern & trendy”", "Author": "SimieMelbourne", "ReviewID": "UR114948978", "Content": "Such an awesome & trendy hotel! As my husband says : 'Off it's head' Wish we got to stay longer. A surpise or two in our room each day, from lolliops to water to chocolates. Cant wait to get back there", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Antwerp, Belgium", "Title": "“Absolutely wonderful hotel”", "Author": "Michaeldm188636", "ReviewID": "UR114881829", "Content": "Just back from a four night stay and loved every minute of it. Friendly staff, lovely interior, great room and located in a quiet neighbourhood, this hotel has everything you expect from a 5* hotel. Highly recommendable..", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lexington, Kentucky", "Title": "“Great hotel for a pre-cruise stay”", "Author": "Provencelover84", "ReviewID": "UR113620096", "Content": "We stayed at the ME in Barcelona the night before going on a cruise. We booked it on Hotwire, 5 Stars, close to the beaches. Well, it was not close to the beaches, but that is more Hotwire's fault than the hotel's. The location was ok; we used the metro to get around, the metro stop was just a few minutes walking. We had been in Barcelona previously and were happy to be outside the overrun tourist area. The staff was more than friendly - the porter basically ran after us to make sure we had a map, sent us to a small 'Ramblas' area close to the hotel with lots of restaurants and shops. This 'Ramblas' ended at the beach with wonderfull walking paths, clean bathrooms and exercise equipment on the beach. Unfortunately it was a cloudy and windy day. The water in the outside pool was really cold. I would have loved to lounge on the sun-beds and enjoy the atmosphere. The pool is on the 6th floor and they have big curtained red loungers where you can hang out and have a drink. Well, this will be for another time. The room was very small, but very stylish. If the desk would have fit into my suitcase, I would have tried to pack it. However, I found out, that we like the traditional rooms better - this one had the bathroom and the bedroom seperated by a glass wall. This means that the preson getting up in the night to go to the bathroom will light up the bedroom as well. Also, I travelled with my husband, so we did not have a privacy issue, but I would not like to stay there with anything but a very close friend. Breakfast is great, but costs over 30 Euros. If you join the Melia chain's loyalty club, you get one breakfast for free. And after having passed one night there, I know I will be staying in this chain again. What I did not like: the dark hallways with metal on the walls and black carpet. It felt creepy and not very clean (lots of white fluff from the towels on the black carpet) No slippers in the room: there is a carpet in one part of the room and I cannot step on a hotel carpet without slippers.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "miami, fl", "Title": "“Great Hotel!”", "Author": "evelynmonica30", "ReviewID": "UR112393375", "Content": "We stayed at ME during the holidays in December, It was fantastic hotel, We stayed at The Level rooms and it was a great value. It included free breakfast in the morning and free cocktails and appetizers in the evening. There was also a room for our 4 year old to play WII. It is a little out of the tourist path but there is always transportation near by. The restaurants in the hotel really do not cater to children, so on one of the nights we had the front desk find us chinese food, it was very hard as it was the on Christmas Eve when most of the businesses where closed, but they managed to find us an open restaurant that delivered, I would recommend staying at this trendy hotel specially if you can book at The Level.", "Date": "June 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Good hotel”", "Author": "marielouisegell", "ReviewID": "UR111090920", "Content": "Really good hotel in Barcelona. Fantastic quality and service", "Date": "June 2, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Sydney", "Title": "“A hotel which sets a high expectation yet fails to deliver”", "Author": "Trustingtraveller_8", "ReviewID": "UR108877488", "Content": "Unfortunately I cannot recommend a stay at ME Barcelona. The biggest flaw of this establishment is that the promise an aura experience but fail to deliver in many ways. The hotel is lacking: 1. Room service (beyond the hours of 8am to 11am). That is, basically no room service at all. 2. Privacy. The rooms are small and decorated in a modern fashion, but fail to allow enough space for 2 people to actually enjoy the room. It's enough for sleeping only. 3. Cleanliness. Our sliding shower door was faulty and after 4 days it had not been repaired. The room also had the words \"Happy Birthday\" on the mirror when we checked in which didn't mean anything to us (not OUR birthday). The words remained on the mirror for the entire week that we stayed there. Poor effort. 4. The spa was never attended in the week that we stayed at ME Barcelona. 5. The service was inconsistent. There was plenty of staff around to say hello when you walked through reception but no one around to take a drink order, seat you at breakfast etc. 6. The pool bar was open for one day of our weeks stay. After that, it was closed. The pool waiter (if you can call him that) failed to provide fresh towels or attend upon us frequently enough to order drinks. We ended up buying our own beers and drinking by the pool because the waiter would visit us once every 2 to 3 hours. Basically, ME Barcelona promises to be an experience so much more than accommodation - but how can it be when it fails to provide anything more than mere basic accomodation?", "Date": "May 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“Excellent service”", "Author": "mikeyc75", "ReviewID": "UR108704998", "Content": "Spent 4 days here and would highly recommend staying on The Level. The staff were friendly, helpful and knowledgeable. Location was the only slight downside but not a huge problem and it was good to eat outside of the usual tourist haunts. Thanks to the Aura team and in particular one of the doormen who was incredibly helpful in recommending two excellent restaurants. We will return!", "Date": "May 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Athens", "Title": "“Value for money hotel, great bar- breakfast, cleaning issue with toilet...”", "Author": "MariaTAthens", "ReviewID": "UR108701699", "Content": "This is a great hotel not in the heart of the town that has a great vibe and stylish interior. The breakfast is outstanding. The reception is kind of slow when checking in and could speak better english. The staff at the restaurant when having breakfast was very helpful and polite. BUT the toilet area was not properly cleaned as there was a sliding door that the cleaners did not clean properly and you could notice dirty urine spots and hair on the floor when the door slided that was not ours from the fist day...till the last we checked out. it was obvious that the did not care to clean that spot EVER!!! Other that that it had a great bar with coctails and parties on Friday and Saturday. If you are young and like a decent hotel to stay this is it. What you pay is what you get.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Stylish, inventive and comfortable”", "Author": "CBtravellerB430", "ReviewID": "UR107857654", "Content": "I'd never been to barcelona before and this hotel was a wonderfully stylish introduction. The staff were very friendly and gave some very useful recommendations of places to visit. Whilst the room wasn't huge there was an imaginative use of space. Only down side was that the pool wasn't heated.", "Date": "May 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Doral, Florida", "Title": "“Me Barcelona-a top experience in Spain”", "Author": "ManoTripAdv", "ReviewID": "UR107646361", "Content": "I like that hotel. Even though it is not in the most central location, it is much better than most other hotels in Barcelona. Fianlly a big room! And the A/C was working! The night club is one of the best I have been to. It starts at 1am - yes at 1. And it is happening there! Stay in The Level, it is awesome. They have the most attentive staff, and a very nice breakfast buffet set-up. even during the day, they have Tapas on the buffet, and always a cold beer!", "Date": "May 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“The Aura experience which does not live up to expectation”", "Author": "JasonFSydney", "ReviewID": "UR106873001", "Content": "As a current guest of ME Barcelona i regret to report i am absent of the following; 1) a clock in my room 2) 24 room service 3) decent lighting 4) an informed concierge 5) service by the pool bar is non existent 6) a clean room, had to call 2 times to get rooms made up after 4pm 7) hallways smell of bad odour 8) gym has no fresh water anywhere, new machines that dont work.... 9) a serviced spa, it seemed to be locked every day. Than i found out i need to pay extra for such facilities 10) a shower door that works, i am still waiting for this to be fixed after 3 days. Overall whilst not central the hotel does offer a poolside area to lounge and relax. Its location was not problematic as it close to a metro station. At check-in we were impressed with the check in experience but beyond that every other facility left a lot to be desired. As a frequent traveller who spends up to 100 nights per year in hotels this has to be the worst hotel i have stayed in the past 12 months. I feel the experience is best described as a well thought out concept which is poorly executed. If it not been for prepaying the entire stay i honestly would of checked out after day one and headed to the Le Meridien or another establishment. The only positive aspect of the hotel is DOS CIELOS, this is a wonderful restaurant which i would recommend to any individual wanting a world class experience. If only the Aura team were like the staff at DOS CIELOS.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "liverpool", "Title": "“Me Barcelona,the only place to stay”", "Author": "firefoxLiverpool", "ReviewID": "UR106845207", "Content": "Just returned from an extended weekend stay at the 'Me' hotel. This is our 2nd stay there and as before it was perfect. From the staff that make you so wellcome, to the quality of the rooms. This hotel brings service to a higher level. For my next stay I think I'll save up and sample the Michelin star restaurant. Although it could be nearer the centre of Barcelona there is always a taxi available, and the Metro is only 3 mins walk away. If at all possible try and book a room above the 20th floor as this will allow you access to the 'level' --a place where service and quality reach new peaks.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“ME Barcelona - Top of the league just like the football team !”", "Author": "unc-j", "ReviewID": "UR106650743", "Content": "We have just returned from a flying visit to Barcelona to visit family and friends. A great excuse to travel at any time but now having had the \"ME experience\" we are saving the pennies (or cents) at a furious rate so we can head back as soon as possible. The hotel is located just off Avenguda Diagonal, not so far from the \"Gherkin\" building and was easily reached by airport bus transfer and short taxi ride. First impressions at reception were very good indeed. It is a boutique style hotel and the mood is nicely understated - not pretentious but very welcoming. After a speedy check - in we were shown to our rooms on the 23 rd floor. We were very fortunate to be able to have booked a suite and nothing at all disappointed, from the spectacular views of the city to the high quality furnishings and extras provided. All the electronics are Sony, Philips etc. and the bathroom complimentaries are all high quality brands. The hotel provides just about everything in the room for your stay as standard and anything else is just a phone call to reception away. Our rooms also meant that we had access to the \"Level\". This is a lounge on the 25 th floor where guests can avail themselves of complimentary beer, wine, spirits and light snacks which are refreshed throughout the day. It's a great place to meet for breakfast or for drinks before you venture out into the city. The hotel restaurant has recently been awarded it's first Michelin star and we met the chef on a tour of the hotel. He took great pleasure in showing us his kitchens which were prepping up for that evenings sittings. And that also sums up the whole attitude of the staff at this hotel. They are all obviously proud of their hotel and the work that they do in there. If they can do anything for you, it is done well and with a lovely manner. Our stay in Barcelona was greatly enhanced by our stay in the ME hotel - I hope yours will be too", "Date": "May 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Stoke-on-Trent, United Kingdom", "Title": "“Amazing Experience”", "Author": "Maximus_107", "ReviewID": "UR106569605", "Content": "First of all, the check in was extremely friendly and quick. We asked for an early checkin prior to reaching Barcelona and the request was duly obliged. The room was excellent, amazing views of the sea and very spacious and well equipped. We had to ask for an iron and ironing board but that was provided. The location is very good, with a metro station 5-10 min walk away, althought the tram station is virtually outside the entrance. The customer service was second to none and the staff could not do enough to ensure you have a wonderful stay. One of the best hotels we have stayed in. Thoroughly recommend it.", "Date": "May 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Frome, United Kingdom", "Title": "“Excellent customer service !”", "Author": "Phillicj", "ReviewID": "UR105387081", "Content": "Having booked 'Me' we were pleasantly suprised to get an Email offering help to make our forthcoming stay more enjoyable.I replied with a request for a restaurant reservation to Moo(excellent) which was done for us.if we had prepared we would have made other requests(Segways,cycle tours etc) but hey ho! We stayed two nights and each morning as we exited the hotel we were met by Omar who recommended tapas bars and restaurantsy drawing them on a map for us.Excellent customer service from the team but especially Omar and Julie on the 2nd floor!!!", "Date": "April 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Middlesbrough, United Kingdom", "Title": "“missing that special touch”", "Author": "Michelle186340", "ReviewID": "UR104245652", "Content": "The hotel has a very modern and contempary look from the outside and in. It is located in an urban area primarily used for housing of locals and it is about a ten minute walk from the metro. The decor is new and nice in the lobby and terrace and the room was very modern with stylish features and the latest in lighting technology (a little confusing to use though). The hotel was very clean and comfortable with tv and docking station in room and a good view if your on a high floor. The mini bar is expensive and the breakfast cost €22 each however this can be halved by becoming a member.The staff have about an average attitude towards guests and this is the biggest down floor of this hotel. It is not the type of place that you are made to feel special. Our biggest complaint is that the Spa was out of use for the duration of our stay. We only booked the hotel two days before our stay however we were not informed of this. The Spa was one of the reasons that we booked the hotel so we were very dissapointed. This is where the hotel lacked the special touch.... when we made a complaint about this to the manager we were just offered an apology and told that the massage part was still open (priced at €177 each), we were never offered any sort of good will gesture for this disruption. I have never stayed at a hotel that doesnt offer a good will gesture when something disrupts your stay in this way. We made sure we let the hotel know during our stay so they had the opportunity to put this right however they never did, what more can we say on that matter......", "Date": "April 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "STAFFORD", "Title": "“Confused Hotel”", "Author": "BOB6198", "ReviewID": "UR103584756", "Content": "I’m not sure this hotel knows what it wants to be and I believe it ends up being a cool bar/club with some rooms attached. Just stayed over the weekend which we only booked 3 days before flying so where really struggling to get in any the hotels I liked or knew as there was a Rugby European Cup Quarter final being played on the Saturday. 80 thousand Frenchmen had booked the city up! Usually stay 5 star when travelling with girlfriends and for this break was looking for a hotel with a nice pool and within easy access to the beaches however took a punt on last minute.com secret room to avoid the high costs for the last room available in the city. Pros: Allowed us to check very early as turned up at 11:30am when first check in should have been 3pm. Very friendly and took us to the room on the 6th floor with view of building site but no big deal as wasn’t here to sit in the room but on the beach or in café bar. Area not anywhere near city centre or on the coast is actually in a nice quiet spot. 10-15 minute walk down one of the long streets to the beach (left hand bay) and on the back streets loads of local style shops and small cafes. Also you can connect to the metro or tourist bus close by. More of local feel and miles from the tourist trap of La Rambla. Note there is another Rambla near to the hotel which is lovely. Easy to find as it’s a very high tower. Cons: Very small room with too much in it. They appeared to have seen some of the good ideas in other hotels and just tried to chuck them all in to a very small space. No larger American would even fit in the toilet, there was a 4 foot long sun bed under the TV so you couldn’t lie on it or sit on. Joint taps in bathroom but no room to pass each other. But most importantly as there was no window or balcony and as neither the fan nor Air Con was working in this tiny room it was reached 27 degrees for most of the time we where in there. I called the reception 4 times about this and also had to call about hot water. It was noticed both worked in a fashion directly after call but never satisfactory. The pool area and sun terrace is a bit of a joke while a good idea in principle there are no good views here and the pool is freezing/tiny while the whole area around it is claustrophobic. Decor while okay downstairs in lobby bar area is pretty horrid on floor level (Bright metal everywhere and bar area looks like the set from a 70’s vampire film. Even after considering I may have got a dud room for booking on the cheap the question would always be would I stay here again? The answer would be I’m afraid be no and this hotel is not a 5 star. There are much better options in Barc still a great city I have visited maybe 6 times.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Bournemouth, United Kingdom", "Title": "“Very nice”", "Author": "foodieswallow", "ReviewID": "UR101759532", "Content": "Really nice hotel, not in the best neighbourhood but fairly close to the beach and if you are happy catching taxi's you wouldn't notice any problem. Staff were excellent and eager to attend to our needs, got a fantastic deal on the net and were unexpectedly upgraded when our air con wouldn't work properly. They have a lovely bar on the ground floor and very popular nightclub on the 5th, odd 80's music on Friday and still not sure it wasn't a student night! Saturday the club was very dark and playing great music, also have a swimming pool outside so I bet the parties are great in the summer, despite this I didn't find the noise noticeable anywhere in the hotel. Breakfast was exceptional, one of the best i've seen and I would definately stay here again, i didn't give the hotel the full 5* for everything as there were the odd signs of wear and tear in the rooms but really nothing to be too picky about particulalry if you stay on a special offer!", "Date": "March 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“An excellent hotel for those looking for something special”", "Author": "nadeemcrowe", "ReviewID": "UR98920082", "Content": "I stayed in this hotel for 4 nights in March - in fact i write this from the room on my final night. Firstly, the area: Contrary to what other reviewers write - this hotel is about 5 minutes walk from Metro Poblenou on the L4 line. It is perfectly connected to central Barcelona, the Barri Gotic and the beach is only 2 stops away. Poblenou (literally New Town); is a beautiful quiet suburb in the 22@ region - here old meets new; old Catalan soul with some amazing local architecture and parks; also the Glories shopping mall only 10 minuted walk. The rooms in this hotel are quality rather than quantity. I have seen bigger but everything is done well from the lovely cashmere bedding to the kitsch desk and wall print. Oh and when it comes to room service, the food is AMAZING :) I am a huge fan of Jamon Iberico and 22 euros got me a very generous portion (Jamon Iberico costs around 95 euros per kilo to buy from the market). The thing that sets this hotel aside from any 5 star hotel I have stayed in is the quality of staff. What amazing amazing people to start each day with. I had a problem with the heating in my room and the team could not do enough for me eventually changing my room all together. The girl on reception Elena showed me to a new room and made sure everything was to my satisfaction. The local knowledge of the staff is also invaluable with loads of advice on what to do and what not to do. Listen; if you want a beautiful hotel with amazing staff close to a metro, the beach and an area of Bacelona unexplored my most tourists. Stay here - I will be staying here again :) Thanks you Hotel ME", "Date": "March 4, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Egypt", "Title": "“I didn't like this style”", "Author": "samer_kz", "ReviewID": "UR95856781", "Content": "This was a very strange hotel, rooms built to be very economic in the interiors establishment from the walls to the floor, Once the left door was open in the 15th floor where my room was, I found myself in a metal corridor which is typically like a morgue and the rooms from outside like the shelves for dead bodies, inside the room it was very small and everything seemed to be plastic and artificial and made to be economic The bathroom is a real disaster, the toilet is almost in the room, the carpet smells very bad, the lights in the room was not good and the lightening system is complicated. I was not happy during my stay and won't certainly go there again", "Date": "February 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Luxembourg City, Luxembourg", "Title": "“Nothing to complain about”", "Author": "Xavier979", "ReviewID": "UR95173139", "Content": "I've been to Me Barcelona last November for a 3 days business trip. I booked the room via Internet and I got a very interesting offer. The room itself was tiny but with all the comforts I needed for a business trip. Bathroom facilities, lights, Tv, bed, pillows, computer desk , were all ok. The mini bar was filled with excellent drinks and delicious cookies. Room service was flawless at every time of the day and the night. I had breakfast and dinner in the room and the food was always very good. Service staff was always kind and efficient. I got a call after every delivery to ask me if every thing was ok. Room was cleand twice per day plus an evening check before dinner time. I used the Spa once, Jacuzzi and steam bath were ok, only another couple was there so I could enjoy relax. Position (Avenida Diagonal) it's good, not far from the Vila Olimpica. I didn't spend much time in the hotel since it was a business trip, but I really had nothing to complain about, I wasn't looking for luxury but for comfort and good and efficient service. Will definitely be back next time I will travel to Barcelona.", "Date": "February 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Could do better!”", "Author": "Koodoowarrior", "ReviewID": "UR95074436", "Content": "Stayed at the ME fir business meeting the for long weekend and found that yes hotel was located quite a but away from the main tourist area but despite bar and night club it was very quiet at night. I agree with the other reviewers that the lighting was poor and difficult to figure out. The furniture was chipped and the overall quality of finish was poor. On the business side the food served a lunchtime was dreadful... One chicken dish was left untouched by all the delegates! On the plus side all staff were very efficient, helpful and friendly.", "Date": "January 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Mechelen, Belgium", "Title": "“Good stay in designer hotel”", "Author": "WVE", "ReviewID": "UR94939951", "Content": "Me is a large hotel in a trendy style. Room 1611 has a distinct designer look. It combines high tech looks with cosy accents. The room is not so very large. There is a nice medium sized pool on an elevated terrace (not used as it was only 2°C) Breakfast was a nice buffet with wide choice and good quality. The reception desk staff was quite friendly and helpful, so don't hesitate to ask for help. The hotel is located along the Avenida Diagonal, with a tram running in front. Though the Avenida Diagonal is a big road, no noise was heard in my room on the 16th floor.", "Date": "January 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "London", "Title": "“The perfect New Year get away - peaceful, great service and vibey at night.”", "Author": "LaPage", "ReviewID": "UR92120312", "Content": "We stayed at this hotel for three nights over NYE and we had a spectacular stay. We had one of the rooms on the top floors and we were not disappointed. A larger room than we are used to in Spain and beautiful views - you can even see the sea in the distance. The hotel is very modern and cool and trendy. We are in our 30s so this suited us perfectly. As we had one of the better rooms in the hotel you also get access into a lounge in the day time where you can grab a coffee or even a glass of wine free of charge and relax with the panoramic views on the 25th floor. The Level team who look after you are fantastic - so friendly, they spoke excellent English and they really made our stay special. So thanks Alvaro and Fanny! You rock! We also went for lunch in their fabulous Michelin star restaurant with the amazing brothers who are the chefs. The food and wine was amazing - as was the service and the views. Cannot recommend it enough. Not cheap obviously but worth the money. You are lead in through the kitchen and you get to shake hands with the chefs which is very novel and makes you feel very special. The location for the hotel is maybe not ideal - but it is only 6-7 Euros in a cab into the Gothic area and it is only a ten minute walk to the beach or the Port Olympic. The upside of the location is that it is very peaceful at night! And to be honest there is hardly a reason to leave the hotel if you don't want to - as it has everything! I would certainly recommend this hotel to anyone who is looking for a vibrant hotel that offers excellent service, a peaceful sleep, but also the possibility of finding a party (as there is a club IN the hotel and a great bar also).", "Date": "January 7, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Pretoria", "Title": "“Not what you would expect from this star rating”", "Author": "JCHSA", "ReviewID": "UR91299758", "Content": "When you arrive after a day of sightseeing at 5:30pm and your room is not yet cleaned... I leave it up to you to decide whether this is your type of hotel. So now you have to wait out in the passage or the foyer for them to clean the room...! (NO we did NOT accidentally leave the \"Do not disturb\" signs on the door or anything else that could have prevented them from cleaning the room - we were out of the room at 9am) Also have the following comments on the hotel; 1. Rooms on the small side 2. No Tea/Coffee facilities in the room - Room service took 35min to deliver 4 coffees at a cost of around EUR 20 3. No bath - sure the hotel is funcky but a nice bath after a day out is really nice 4. Agree with previous reviewer regarding the light/curtain swithes that can be confusing. I'm in IT and it took me a while to work it out. The curtain slider in our room was out of order. 5. Lighting in the room not suitable for getting any work done. Some people are lucky to go on a work trip or vacation without having to work at night, well I had to and it was very taxing on the eyes. 6. Location is NOT close to La Rambla or Gothic Q as suggested by other reviewers. No quick return to the hotel. Nearest tube station about 3 blocks away. Must say it is nice and quiet. 7. Privacy in bathroom. Guess some guests may find it spectacular - not me. If price is your determining factor, you may enjoy this hotel. Please do not expect old world charm. This is all very modern steel and glass.", "Date": "January 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Milan, Italy", "Title": "“Very nice hotel in an amazing city”", "Author": "Ambrosiano", "ReviewID": "UR90538946", "Content": "The Hotel is located in a former working-class neighborhood very close to the Barrio Gotico. The neighborhood is undergoing transformations with a lot of skyscrapers and nice and modern building. The Me Barcellona is hosted in one of those skyscraper, more than 110m high. The hotel is very modern and pretty posh but feels good and not too pretentious. The tube is 5 min walk away and will take you Downtown in 10 minutes. Arrived there around 12, they upgraded to a better room - 18th floor - but asked us to wait at the Bar. Room was ready and there we go. Very nice seaview and a lot of light - room is very very nice, the bathroom has a glass wall that looks toward the bed and the windows. Staff was nice, breakfast was pretty good as well, maybe not up to a 5 Star hotel par but no complains. Visited the famous lounge bar on the sixth floor but was not impressed - maybe it was too early in the night. The only downside is that I had trouble with the wireless - works fine in the lobby, not so good in the rooms and moreover you are forced to login with a user/password each time on each device (at least on my Apple devices) But you're in Barcelona, so no time to spend Recommended!", "Date": "December 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Los Angeles, California", "Title": "“Not Worth The Cost”", "Author": "GRBean", "ReviewID": "UR88356842", "Content": "We were disappointed with the ME Barcelona Hotel for these reasons: 1. Small room (though perhaps not unusually small for a European hotel) 2. No coffee/tea machine 3. No ice bucket 4. Power outage/fluctuations 5. Could not figure out how room lighting works (special button panel with unclear icons/images next to each side of the bed was difficult to interpret) 6. Shower and sink doesn't drain (the basins are not angled enough to drain) 7. Out of city center (though, in its benefit, this does make it quiet and less expensive). The main problem with this is that, since Spaniards don’t eat dinner until 8:30 PM or later, occasionally you may want to return to your hotel to rest before dinner, which is difficult to do when the hotel is away from the attractions). 8. Small window does not take advantage of a nice view. The majority of the potential window space facing the view was wall, and then the wall was covered with curtain. 9. No in-room privacy: large window (without curtain) between bed area and bathroom prevents privacy and interferes with sleep (light in bathroom/shower/closet area is visible in bed area through large window) 10. No ESPN or American CNN (admittedly an “American” bias) On the plus side, the staff were very helpful.", "Date": "November 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“Very Modern, Superb service”", "Author": "Hdamiani", "ReviewID": "UR87716873", "Content": "I went to Barcelona to meet with my husband that was in Military Pass stationed in Kosovo and had a blast in Barcelona. The hotel is beautiful. The rooms are very nice, clean, had everything I needed. The rooms are not very spacious, but I stayed in 3 hotels in Barcelona and non of them had big rooms. Just wanted to tell everyone that Trip Advisor really helped me selecting the hotels to stayed and I made all the correct decisions.", "Date": "November 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Simply had a great time - lived up to all our expectations”", "Author": "chopette", "ReviewID": "UR87493643", "Content": "We found the staff incredibly accomodating and helpful (they recommend a fabulous seafood restaurant for our last night there). Rooms were great - we read in a review that you could hear the water in the pipes in your room, which granted you can, but it honestly was not disturbing in the least. If the bed was any more comfortable I would not have seen anything of the city. It is in a very easy location to get into the city - quick walk to the closest tram stop which is incredibly easy to navigate. About 10 - 15 minutes into the heart of the old town. We would stay there again without a problem. We ordered room service on 2 occassions and must admit that the food was not great, but then being room service we didn't expect it to be.", "Date": "November 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "MUC", "Title": "“Nice modern hotel, a little bit off the map”", "Author": "mucben", "ReviewID": "UR87109041", "Content": "I like this hotel! Breakfast was great. Very modern atmosphere. And a very nice gym and Wellness Spa! I treated my self with a very very relaxing massage. The gym offers modern equipment which I used before running on the beach. The beach is approx. 5-10min run/walk away. Rooms are very well equipped with modern equipment and Ipod docking stations are in room and bathroom as well. Size of the room was not too big, but in Barcelona you should spend your day outside anyways. Prices for Minibar, etc. are outrageous.", "Date": "November 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Fantastic Birthday celebration stay”", "Author": "Samiloupepperell", "ReviewID": "UR85930229", "Content": "I booked this hotel through Tesco Travelstore and got a really good deal. Prior to arrival I contacted the hotel to request a bottle of Cava to be waiting in our room on arrival, to celebrate my husband's 40th. I received a few replies and was basically told that a bottel would be waiting on arrival free of charge, a very nice touch! I also requested a price for a room upgrade, but decided against the extrra cost. I had several email conversations with Aura Experience Manager, Claire who I found to be extremely professional and knowledgable. We arrived at 11pm on a Friday night and found check-in to be very smooth, we were allocated a room on the 28th Floor which had stunning views and a lovely bottle of cava waiting for us!! The rooms are fairly compact but are extremely well formed, will exceptionally comfortable beds. The double shower is lovely. We had been upgraded and that meant we had use of the \"Level Lounge\", which to be honest would be totally worth paying for, I think that their website should maybe advertise the facilities in greater detail, as I'm sure more people would book if they realised that there were quality free drinks and food available there, and of course with it being located on the 25th floor it has stunning views! The hotel is located a fair distance from what would be considered as Barcelona main town, however there are excellent transport links and being as how Barcelona is so flat you can easily walk for miles each day, as we did. Sagrada Familia was less than 30 minutes on foot, La Ramblas maybe 1 hour, the seafront and Port Olimpic again only 15 to 30 minutes. We didn't end up eating at the hotel simply because we were elsewhere at mealtimes but did have a few drinks. We found the staff at the bar to be most welcoming and friendly. In fact we didn't encounter any staff members who weren't 100% polite, professional and helpful. This really is a gem of a hotel and I would recommend it to everyone. We are already thinking about a return visit to Spain, possibly Madrid this time and would most definately look to book the Me Hotel there. When we come back to Barcelona we wil have no hesitation in coming back to ME.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Going downhill now”", "Author": "Blue_Gussie", "ReviewID": "UR85036926", "Content": "This was our second visit to the ME. As we had already been through the 'blown away, 1st impressions' feeling the previous time we knew what to expect aesthetically. Because of that we were more able to focus on the service this time. Unfortunately it disappointed us. This was an anniversary trip for my wife and I and I had pre-booked a room on The Level to take advantage of the higher rooms and the Lounge area as somewhere to go as a haven during the early evenings. The extra cost was an issue but something I felt was worth it. The problem was that the Lounge was being renovated during August (summer high season no less - why not do it in Nov or Feb?) which would have normally been fine if we had of been told; however we weren't until we checked in. I wasn't particularly happy as I had told my wife we had Level access and we were looking forward to it. I just thought it was sloppy that we weren't told (I would have simply reserved a 'normal' room for less). The problem was that the service issues didn't end there. I had pre-ordered flowers (at a cost of EUR50) to be inside our room on arrival for my wife. I received an email confirmation the day prior to departure assuring me that this was organised. Upon arrival - no flowers. This annoyed me as I wanted it to be a surprise for my wife. Final issue was with the errors around the laundry. As part of The Level you are allowed three articles of clothing laundered on arrival. I had to request this service three separate times from the front desk before it was done - by then the dinner where I needed my shirt had passed. All of these issues were 'remedied' by a free drink or some chocolates, but I feel that a hotel of this quality should be able to get it right the first time. We didn't have these problems the previous years and I can't help but feel that this hotel is going downhill. Barca has a variety of 5-star hotels and I think we'll try somewhere else on our next trip there. As an aside, the food at Dos Cielos upstairs was great. The Sommelier was very friendly and knowledgeable and the view was outstanding. Go there whether you stay here or not. BG", "Date": "October 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“If I could give this hotel a sixth star, I would!”", "Author": "TrvlLuvr85", "ReviewID": "UR83962097", "Content": "Arriving at this hotel after a luxury cruise was the perfect ending to our summer vacation. We were greeted upon arrival (at our taxi, how impressive!) and the reception staff was incredibly helpful and friendly. It was very obvious that they were happy to have you there and, rightfully so, proud of their city. Every time I called room service or reception, I was greeted with \"Hello Mr. Davis, anything is possible! How can I help you?\" I thought at first it was just a greeting but the staff really stood by that statement - which included some really weird requests from me after partying long nights in Barcelona! The hotel's location is in walking distance of a lot of the sites we wanted to see - including La Sagrada Familia and the Torre Agbar (the bullet-shaped building). They actually come by to clean the room or see if you needed anything TWICE a day - cleanliness was definitely no issue here. As impressive as the hotel is, you'll be even more amazed by the staff. Everyone of them was engaging and pleasant to speak with. This hotel could definitely teach a lot of hotels about customer service. Standing outside waiting for our taxi, other guests were commenting on how nice the staff was - so it just wasn't our impression, others were equally impressed. This is certainly the only hotel we'll ever stay at in Barcelona!", "Date": "October 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Stockholm", "Title": "“Young and chic!”", "Author": "livadore", "ReviewID": "UR82916697", "Content": "I stayed at the ME with a friend of mine and overall we loved it! The pool deck was AMAZING, very chic and fab, the room was very modern and the hotel itself was very chic. There was a downside though - the service. I've stayed at several five star hotels and this hotel does not have a five-star service at all. At check-in we had to ask for our luggage to be brought up to the room, which is something that shocked me since I never had to ask for the hotel staff to take my luggage. Part of the staff was rude, had bad english while others, especially at the restaurant were amazing and very kind. The hotel location can be an advantage to some and a disadvantage to others. We were a bit afraid it would be too far from the beach but it wasnt! It was just a ten minute walk to the beach and the hotel was situated in the most beautiful area of barcelona - poble nou. It's such a soulful and beautiful area, we prefered it a hundred times over ramblas and the touristic areas of Barcelona. If you want to explore Barcelona, this would'nt really be the place for it since it's not in the touristic areas, but theres a bus that stops right outside the hotel (and metro) that takes you to Las Ramblas in like 15 minutes. Taxi's are fairly cheap - around 8 euro from the hotel to the more central areas. As you would expect from any five-star hotel everything at the hotel in terms of food and drinks is a bit pricey. Water is 5 euros and the club sandwhich (which is great btw) is around 20 euros. There's a gas station like 100 meters from the hotel where you can buy water and there's even a LIDL five minute walk from the hotel. I recommend you to take breakfast at the hotel since it's very yummy. It's not an enormous buffet, but it's fairly large, and there's even champagne at the breakfast! ;D Overall we loved this hotel because of it's chicness and the fact that there's music everywhere is perfect!", "Date": "October 10, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Guildford, United Kingdom", "Title": "“Impressive but lacks the finishing touches”", "Author": "KLHA", "ReviewID": "UR81581799", "Content": "For my first time in Barcelona, the ME hotel was a lovely place to stay. Asthetically, very cool and hip, with monochrome staff in their black or white attire. The lobby bar has a cool vibe in the evening, with the hotel also being a popular nightspot for it's Kings and Angels bar. Didn't get to experience the spa or pool but it does look lovely, so I'm sure it would be a great place to kick back and chill. The rooms were a good size, clean, with a funky interior. Great views over the city or to the sea if you are above the 7th floor. Our room unfortunately had a few problems, light wouldn't work in the bathroom, and ipod dock wouldn't function either. This should have been easily fixed, however even after asking, and the staff promising to have it fixed or send someone to the room, are constant requests seemed to be ignored. Also, as we arrived late on a friday evening around 11.30, we were hungry and wanted food. Unfortunately the hotel restaurant wasn't open so we had to order room service. The after midnight menu was very limited, and considering it's a 4* hotel, the food presentation left a lot to be desired, and was definitely overpriced. In terms of location, the hotel is in Poble Nou, which seemed to be a quiet area, though it was in walking distance (10 min) walk from the nearest metro station and the local Rambla del Poble Nou, which had a great buzz with shops and restaurants. It is also walking distance from the Sagrada Familia. All in all a great trip in an above average hotel. I just think it could be a superb hotel if a little more attention was paid to certain areas of quality and service. Would go back but it would not be my first choice.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Best hotel stay in Barcelona”", "Author": "LYNJU", "ReviewID": "UR81512607", "Content": "Very hip, very chic, very happening place to stay. Am from Miami and found the hotel and the decor to be very similar to that of a high end South Beach Hotel. Employess always had a smile and were more than accommodating to our every request and/or need. Highlight of our stay was dinner at the restaurant on top of the hotel, Dos Cielos. Unbelievably fantastic, incredible food and nouvelle cuisine chef. Open kitchen lent an opportunity to watch him and his staff create a meal that will surely be long revered by this foodie. Expensive but well worth the experience. Hotel is out of the hustle and bustle of the Las Ramblas but is only a short, inexpensive cab ride away or you can choose to walk a 15 minute walk. Tall, awesome, modern skyscrapper building, not for the traveller who wants to know they are in Spain while in their room. We thought it was a great chaNge of pace as we were travelling for two weeks and sometimes you need a break from your cultural differences to step back and appreciate both sides. This was the place to do it in complete luxury and attention. Would return in a heartbeat.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Piraeus, Greece", "Title": "“A Room With Suprme Problems”", "Author": "lottemar", "ReviewID": "UR80103145", "Content": "We (me and my husband ) have been to many hotels all over Europe but I really don't think we will visit this particular one in the future again.We stayed at ME Barcelona between 11/09 to 17/09 during a medical congress my husband had to attend .Our room was viewing the pool and part of the city (it was at the 7th floor) ,but it wasn't the location that mattered at all .The room had only a chair next to the desk and a sofa beside the bed itself . There was no lamp on the desk and the lamp over the sofa didn't work .Also my reading lamp (on my side of the bed ) didn't work .The lighting therefore was very poor for anyone who would like to work or write or read . The only bearable spot to do all that was just ONE SIDE OF THE BED .Beside all this , (and the most annoying ) every time the shower in the room just over our own was used , water was running inside our OWN shower from the ceiling . Shall I mention that TV didn't work ? ( we didn't care about this that much though) .We mentioned the lamps and the shower problem to the concierge ( all of them are very friendly and speak very good english ) and as a result somebody knocked our door once and mentioned the lamps but at that particular time I was resting and couldn't receive him .No second attempt was made after that apparently . To the positive side I will mention that due to a party that would have taken place during our last night at the hotel we were offered a level room (20th floor )to avoid the inconvenience of the noise, where all lamps were working at least and you wouldn't have to fret if your unknown upper level neighbor would think to take his/her shower at the same time as you. Beside that ,breakfast was decent and for all that are kin in modern cold design the hotel is a treat .The area is a disadvantage though , the stench from the sewers was at some points unbearable the minute you stepped outside the hotel gate.", "Date": "September 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "nyc", "Title": "“Almost perfect!”", "Author": "arg2day", "ReviewID": "UR79690608", "Content": "I had the chance to stay at the ME Barcelona in early Sept for work. The first impression was nice but I was really impressed once I got up to my suite on the 22nd floor. The room was tricked out with little details that make a difference , my highlight was certainly the Nespresso maker but also the heated towel rack and fully loaded ipod with a great selection of music, showed that great thought went into the ME EXPERIENCE. The highlight for me was the service..I am convinced that the staff was some of the sweetest I have encountered. They remembered my name and I was made to feel special. Thank you to all the staff from the front desk team to the experience managers to the girl at the breakfast who made my stay so memorable. Kind regards, H. Spinner", "Date": "September 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“Fantastic. We absolutely loved it.”", "Author": "FredLondonUK", "ReviewID": "UR76433080", "Content": "We were welcomed by charming and helpful Reception staff. Got to our room with an exquisite view over Sagrada Familia and Mount Tibidabo (for us rather this than sea view). Room was greatly designed. The hotel is very interesting indeed. Very design, over the top at times, but never tiring. Wonderful sun sets over Barcelona from our room. Romantic, wonderful. The clientele is an interesting mix, from a young clubbing crowd to older couples. Mainly French and English tourists, as well as Spanish. In terms of location, if you don't mind taking taxis (10-15mins) to city centre you should be fine. The hotel is also close to the beach (5 euros for a taxi). Breakfast is a very pleasant affair, and great staff. Staff is one of the strengths of this hotel, very friendly and pleasant, with only a few with a certain attitude: staff are obviously chosen for their youth and a certain look that matches the hotel ambience, and usually they have the spanish friendliness and charm. Again, only few exceptions to this. Room service quite overpriced and food choices at swimming pool bar quite limited. But for a weekend away they are quite enough. Swimming pool is a very nice area, pleasant and relaxing. Even when full, it is never noisy. Wonderful afternoons there. One thing I would eventually change: club music at breakfast felt a bit too much. But this seems to be the hotel policy, there is music all the time in all public spaces (NEVER loud though).", "Date": "August 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Top hotel !!!”", "Author": "LondonGreggy", "ReviewID": "UR76338378", "Content": "We've just returned from a 5 night stay at the ME, on our first visit to Barcelona. We chose it mainly because it had a pool area and was near to the beach, as we like to relax as well as go sightseeing. They both served us very well, and the 2 person sofa-beds at the pool were very comfy!. The room was very contemporary, and extremely comfortable. The city view was awesome (we were on the 19th floor) and actually looked better than the seaview as the coast is a 10 minute stroll away. We stayed on a bed & breakfast basis, so we though the breakfast was fine. However, at well over 20 euros a head it would seem expensive unless you use the card scheme mentioned in other reviews. The ME is located on the main Diagonal road, but at the end closest to the sea. Therefore it is a few km's from the city centre. We actually found this a bonus, as Poblenou metro station was only 5 mins walk, and you could be in the city centre within 20 mins. We really liked the Port Vell and Olympic Ports in the evenings, and these are even closer via the Metro. Having looked at hotels in the centre of the city, we are so glad that we chose to stay at the ME. The city has great public transport links to help you get around. We used two 10 trip metro tickets each, which at 7.85 euros are exceptional value. We usually take taxis on our city visits, but we only used them from and to the airport. I would recommend using this hotel, and we'll use it if we go back to Barcelona", "Date": "August 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Heavenly Honeymoon”", "Author": "AliBakes", "ReviewID": "UR76030139", "Content": "My design / architecture mad hubby and I honeymooned in Barcelona and stayed in ME for the frist part of our stay. What a fantastic hotel! Excellent service, especially from Carlos. The pool side was lovely and the cuisine superb. Definately try to stay in for a night and dine in the hotel's resturant. The breakfast is a bit dear if it's is not included but the staff didn't hesitate to sign us up for a MAS card which gives you 2 for 1 on breakies. LOVE IT. WE WILL BE BACK", "Date": "August 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Ultra modern cool contemporary architecture and design, a taxi ride away from the action.”", "Author": "liptonst", "ReviewID": "UR75096947", "Content": "Me Barcelona stands out as unique in Barcelona for me due to the attentive staff, ultra modern, clean and well thought out design of the confined suites and great lobby bar. Situated a taxi ride away from the heart of the city and a good walk away from the Sagrada Familia, Me Barcelona offers everything and more that you would expect from the Melia chain. The rooms are free of noise pollution, full of modern furniture and gadgets which could give the feel of clutter in the confined space but are well thought out in design and are very new and very clean. Room service, laundry and house keeping is excellent. I really recommend the trendy cool large lobby bar area to entertain guests or business associates. Management and Staff are always positive with a friendly presence and enough understanding to leave you to enjoy your experience on your own and confident to know when you need assistance, offering a great service from all the staff.", "Date": "August 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“Awesome hotel”", "Author": "glendowg", "ReviewID": "UR74842796", "Content": "The hotel is beautiful and the staff is awesome! The staff goes out of their way to get you whatever you need. Rooms are sound proof with sound systems and nice TVs.", "Date": "August 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "bishops stortford", "Title": "“Stylish hotel in an up and coming area of Barcelona”", "Author": "wardy14", "ReviewID": "UR74287869", "Content": "Stayed at the ME for two nights as first stop off travelling northern Spain. Rooms excellent, spacious and well equipped. Staff very helpful and friendly. Breakfast very good but expensive, however reception told us about a loyalty card which gives you 50% discount, so in the end good value. Pool area very stylish and relaxing, lots of comfy areas to lounge around. Location a bit off the beaten track but not a problem as taxis quite cheap and there is a very good shopping mall within walking distance. The smell mentioned in some reviews we found quite pleasant. All in all a wonderful stay.", "Date": "August 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great Service”", "Author": "BMGAL", "ReviewID": "UR73858646", "Content": "This is a place I would return to. The hotel is very stylish and the rooms confortable, however the most outstanding part for me was the staff. The friendliness and helpfullness was incredible. From check in, bar staff at the pool, room service, cleaning staff, all were very friendly, helpful and courteous. We partyed a bit (Barcelona is a party city!) so breakfast served til noon is very welcome. I would also recommend the pool area for relaxing and chilling out in the afternoon.", "Date": "August 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Barcelona", "Title": "“superb styling with personal service”", "Author": "H08H", "ReviewID": "UR73114100", "Content": "Was fortunate enough to stay in the Sky Suite which is another level in space, styling and service. Lift will take you up and down to 29th without stopping. Nice Spa (allthough missing a cold water dip or shower) with great pooldeck. Restaurant Dos Cielos deserves all the acclaim it is recieving. Service everywhere in the hotel is personal, patient and knowledgeble.", "Date": "July 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Chicago, Illinois", "Title": "“The ME would like to be ALL THAT...but it isn't”", "Author": "Michael/Steven", "ReviewID": "UR71522186", "Content": "Our recent stay at the ME Hotel was a big disappointment. The hotel was obviously built with BIG things in mind. Consider the supposed amenities: a lobby bar and high-end restaurant on a top floor, a luxury spa and a nightclub, a lush pool deck and a groovy, international vibe. Unfortunately, few of these amenities or vibes were present on our visit. The pool deck was just plain sad, with few lounging chairs, a tiny pool, and pathetic, abused palm trees wilting in the sun. The spa was closed (apparently for good). The nightclub, \"Angels and Kings\", was also closed. The lobby bar was barely staffed and the \"cool vibe\" of the hotel decor was sadly undone by a most unusual moldy or chemical smell emanating from seemingly everywhere at once. The moment you entered the lobby the smell hit you and stayed in your nostrils. So odd. And so disturbing. The location of the hotel is not very good for exploring the city on foot, seeing as it is out of the loop by a long shot. But the front desk staff did give us maps that gave the location of the nearest Metro stop, which is only a few blocks away. In fact, the front desk staff was the best thing about the hotel. They were very helpful with directions and restaurant reservations, etc. I almost felt like they deserved a better property to manage. The rooms were fine (and very groovy, indeed) but the rest of the property seemed to need some maintenance, even though the place isn't that old. The breakfast buffet was pretty good and the coffee good and strong. It's just unfortunate that the hotel couldn't be as good and strong as that morning coffee.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Trivandrum", "Title": "“A modern business class hotel that isnt too badly located for tourists too”", "Author": "GAGTVM", "ReviewID": "UR68740199", "Content": "I stayed at this hotel as part of a conference(that I was attending elsewhere) and the place is quite new(as of june 2010)... the interiors are quite swanky and they have an attempt to stand out from the crowd and this is evident even in the stacked structure that is the external facade. The rooms are quiet big and very comfortable. It has a good dressing area that is close to that bathroom and tactfully tucked away from the sleeping area. Breakfast is the usual continental spread and the staff are quite courteous and very helpful. The conceirge went out of his way to source a travel adaptor for my laptop and mobile... There are 2 big malls which are a tram ride away too from the hotel and oh yeah before i forget, theres free wifi too On the negatives, the metro station is about a 10 -15 minute walk away and there are no convenience stores/decent restaurants around. This can be quite a hassle especially if you are coming back late from the city , the streets can be a bit scary though the area is safe apparently... All in all, a good place and if you get a good rate, you wont be disappointed staying here", "Date": "June 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Cambridge, UK", "Title": "“This hotel is ok but I would give it 4* rating at best”", "Author": "CharlieFCambridge_UK", "ReviewID": "UR67880412", "Content": "We stayed here for 4 nights in June having just spent 3 nights in the W Barcelona. We booked on Last Minute.com so got a cheaper price than normal room rates however it was still more expensive than other hotels closer to the city centre. We were wanting a bit of luxury for a week and thought Barcelona was ideal for a part relaxing beach/sun holiday and part city break. We only booked this hotel because it had a pool and a 5* rating. We arrived at the hotel and the check-in queue was enormous so we had a relaxing drink in the comfortable bar area. To be fair check in was quick once we got the front of the queue but the entire foyer area smelt a bit wierd. The place is trying too hard to be cool with dubious colour choices for furnishings and steel walls??!!! Our room was ok the bed very comfortable and we got a good nights sleep (we were woken every morning by the maids at about 9am though). The bathroom had no extractor ran that we could find and after a shower the condensation ran down the glass panel separating the room from the bathroom and left dirty marks on the window ledge. I wouldn't say the room was spotless but it was adequate. This hotel was in quite a poor location - ok so fairly close to the nearest tube station (10 mins walk) and tram stop (5 mins) but a way out of the city. Cabs in barcelona are fairly cheap though so this isn't really a massive issue. The worst part about our stay was that on our last day we were enjoying the sun in the pool area when we were asked to leave due to there being a private party in the area. There was no pre warning or notification of this and we had to get up and tramp down to the beach via the tube to enjoy our last day of sun (I am 5 months pregnant with twins so was hoping for a relaxing day!!!!!!!!) I wouldn't recommend this hotel if you are expecting 5* luxury. If you are happy for 3-4* quality and service in a fairly poor location this hotel could just be for you!", "Date": "June 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“Good...but more form over function again”", "Author": "wipeout75", "ReviewID": "UR67447608", "Content": "This is a nice hotel. But you do get the fealing that they are trying a little too hard to be too cool for school. Good secure car parking imediately adjacent to the hotel - not too expensive at €25 for the 1 day / night that we were there. check in staff all very nice and helpful and rooms again were nice and bright. We were on the 12th floor looking out over the outdoor pool (on the 6th floor) and sea beyond (and I mean beyond.) Tiny gym - nice equipment but not much of it and also the air con in the gym wasnt working with predictable noxious results! Other comments re the noise from the nightclub are spot on. Make sure you are on as high a floor as possible away from the pool if you want to sleep. Its clearly a very popular nightclub right now and was heaing all night until 5am. We didnt go to the nightclub but we did have cocktails in the bar downstairs. One was very nice - one was hopelessly made. In summary its nice - but would I stay again? Probably not. If spending this much I'd spend a little more and stay at Mandarin Oriental or W Hotel. Check out Pla spanish restaurant though on Bellafila 5. Very nice and reasonably priced.", "Date": "June 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Nice hotel, what I'd expect from the ME, but with some drawbacks.”", "Author": "CS01", "ReviewID": "UR66463538", "Content": "It's kind of hard to write this review. The reason being is, what I liked, I really liked, but what I didn't like disappointed us quite a bit. First, the good. We had stayed in the ME Madrid and really enjoyed our time, so we figured we'd try the ME Barcelona. We were attending the Primavera Sound 2010 festival and this hotel was pretty close to the festival site, so it worked out. The hotel is very modern, what we expected. It's elegant, beautiful structure from the outside. Inside is just as impressive. Once in the room, we found it to be very nice and in terms of size, very good. Overall, it was what I'd expect; modern, stylish, sophisticated. Now, the bad. We stayed on a weekend. Be warned; this hotel is basically a club on the weekends and it is extremely noisy. We were staying on the 7th floor, facing the sea. Upon returning from the festival about about 2 in the morning, we found our room absolutely intolerable in terms of noise. I can't stress enough how loud the club on the 6th floor is. Honestly, anyone staying on the sea-view side of this hotel that is within a few floors of the 6th, good luck getting to sleep. It is obnoxiously loud. So, in our very tired states...again, it's 2 in the am...we had to drag ourselves down the the lobby, then move ourselves to a new room. We selected a non sea view room, even though that's what we had paid foor and booked. Upon checking out, we still ended up paying for a sea view room, which I'm pretty sure has a premium on it in terms of cost. No deduction was made for our room not being a sea view, nor for our having to change rooms in the middle of the night. Another minor gripe is that we had wifi in our rooms at the ME Madrid and assumed that would be the case in Barcelona. Not so. We had to go to the lobby to use our phones for email etc. A minor inconvenience though. So again, a very stylish hotel and overall a very nice place to stay, just know what you're getting in to; if you're there on a weekend, and you don't want to hear thumping house music until 4 in the morning, book a room on the city view side.", "Date": "June 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Dallas, Texas", "Title": "“OK hotel, poor location, poor service”", "Author": "travelsnob18", "ReviewID": "UR66440199", "Content": "It was a decently designed hotel, but lacked in many areas. I would not recommend it to others & I would not stay here again for the following reasons: - Bad location for exploring Barcelona. Not very close to any Metro stations and once you do find one, you need to make at least 1 train line change to get to the more popular destinations. It takes about 45 minutes to get anywhere worth seeing (Las Ramblas, Parc Guell, Gracia neighborhood, etc.) - very few decent dining destinations nearby - inconsistent housekeeping service (shampoo, soap, towels & drinking glasses were not refreshed) - very expensive food and drinks in the restaurants, mini bar and room service ($25 club sandwich) - no coffee maker & iron / ironing board - 2 twin beds in lieu of a queen or king - rooms were modern, but need some maintenance as the white walls and floors were pretty scuffed & artwork was dusty - hallways not air-conditioned - lobby bar was not staffed so we waited for service approx 15 minutes before asking and still not getting anyone to wait on us... We left and bought beer & wine at the gas station next door On a postive note: The beds were very comfortable & the view from the room was nice (albeit partially blocked by the exterior architectural elements of the building).", "Date": "June 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Fairfield, Connecticut", "Title": "“Give it 6 stars”", "Author": "joecron", "ReviewID": "UR65458602", "Content": "I rate this, on a scale of 1 to 5, a 6. This hotel was terrific is every sense. During our stay, we were notified of a death in the family, and we had to rearrange travel plans in a hurry. The staff could not have been more helpful. If you were to hold my feet over a fire, and force me to find something bad about this hotel, I could not do so. The staff, to a person, was friendly, caring, and extremely competent. Every request was met perfectly. They could not have been better. If I were to go to Barcelona, I would not consider any other place. It was wonderful in every sense of the word.", "Date": "May 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“One of the best I've stayed in”", "Author": "041212aa", "ReviewID": "UR63090333", "Content": "Me and my mother booked a weekend trip to Barcelona in april 2010. The hotel is very fresh and hip. The room was very clean and sound proof. I have never slept better in any hotel! The staff was very helpful, gave us map and answered all our silly questions about Barcelona :) It's not located in central Barcelona, like Las Ramblas, but hey, who wants to live there?! This hotel is located just a few minutes from the Metro station of Poble Nou, and from there its like 10 mins ride to central tourist location. Otherwise, you could just walk down Av Diagonal to the city, or take the tram that stops right outside the hotel. The hotel has gym and SPA facilities (like Sauna, pool, hamam), which we used everyday (free of charge, lovely!) You really have to try this hotel!", "Date": "May 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dresden", "Title": "“I have never experienced something better”", "Author": "AnjaZo", "ReviewID": "UR62362835", "Content": "I am working in the IT industrie and had to travel to Barcelona. One of my colleagues recomended the ME Barcelona. I never heard about it. I thought, might be nice to try. I really have to say that I am travelling a lot and I am tired of using classical, old fashion hotels. The ME Barcelona was amazing, a contemporary design, lovley music and I felt like at home.As explained, I am working for an IT company and I must say that the rooms are really well equipped. They also offer the wifi free of charge and a lovley view over barcelona. I visited the sky food bar restaurant and had dinner and I absolutely loved it, nice and smiling staff and a good food quality. I am already looking forward to stay again at the ME Barcelona. Best regards Anja ( Germany )", "Date": "April 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Netherlands", "Title": "“So so, but view is great”", "Author": "gaspargonzalez", "ReviewID": "UR62044848", "Content": "The ME likes to see itself as the ultimate in design, but fails in good customer service. Lay-out of the hotel rooms is a bit weird, with open bath space, strange electronic curtain system, and unclear light switches. The bed is absolutely comfortable, but nevertheless room and amenities are pretty average. Best part is the view, that is if you're located high enough. I was on the 22nd floor and had a great city view. At check-in the asked if I would like to have sea view. That would have cost me 25 euro more per night, while I think the city view was far better. As commented by many other reviewers, the service in the hotel is weak. Staff at breakfast look annoyed and send you away five minutes before closure. Staff at hotel bar is slow and ignorant. Most of the reception staff as well, with the exception of a very attentive lady from Alicante. After returning I noticed an unclear credit card charge for mini-bar. Didn't take anything, nor signed a bill. In an e-mail hotel responded they will correct it, without any apologies. In short: perfect view, average rooms, weak service. Not a true 5 star hotel.", "Date": "April 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "liverpool", "Title": "“simply the best”", "Author": "firefoxLiverpool", "ReviewID": "UR60839616", "Content": "Managed to stay at the 'level' at the 'Me', and could not recommend it enough! The staff were most attentive, my thanks esp to Claire who made our stay perfect. Rooms were spaciouse and clean, attention to detail esp impressive. Views overlooking the city with Sagrada Familla in the foreground what more could you ask.", "Date": "April 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Royal Tunbridge Wells, United Kingdom", "Title": "“Bit of a Mixture”", "Author": "AndrewCrown", "ReviewID": "UR59539679", "Content": "Yes this is a wonderful triumph of design... No question..... Bar staff indifferent, faffing around and taking too long..... took almost 15 minutes to get served in a very quiet bar. I actually had to ask the barman whether his bar was open... Receptionist, said I was so big my jacket must be like a house.... ok she was small and I am tall... still.... Restuarant on 24th let me sit in the bar and not serve me for 15 minutes... so I left. Prawn tempura took 45 minutes to prepare when I eventually sat down to dinner On requesting coffee with milk and sugar at room service, bit tricky, had coffee first milk and sugar followed 20 minutes later. Finally tried to get some documents printed in the business centre, it was deserted. So this could not happen,,,, and.... they don't even stock cigarettes.... Oh dear oh dear oh dear", "Date": "March 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Super Cool Hotel!!!”", "Author": "got2bfunky", "ReviewID": "UR57702788", "Content": "We actually stayed here as it was a potential venue for our wedding which is in Barcelona this June. Upon arrival we both knew instantly that it was the hotel that we would be staying in. Cool beyond belief, super friendly staff and excellent rates. True its not slap bang in the middle of town but has an overground tram stop 50m away and a metro station about 400m away. Rock and roll hotel at a great price!!", "Date": "March 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "west sussex", "Title": "“Great experience”", "Author": "baboon", "ReviewID": "UR57223013", "Content": "Could not agree more with most recent review. My husband and I stayed for 3 nights following promotion on Travelzoo. As it was his 40th birthday we booked the Level which seemed expensive when booking but proved to be worth every euro!! Pink champagne and canapes available in private lounge with fabulous view and a brilliant concierge called Letitia for whom nothing was too much trouble. We loved the whole concept of the hotel and the chilled out music playing everyehere was excellent. Staff are extremely friendly and hotel decor has been well thought out. Breakfast was amazing and the presentation made you want to try everything. Cannot wait to go back hopefully when it is warmer and can get to use swimming pool area.", "Date": "February 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Tries to hard and fails on too many points.”", "Author": "BackinthUK", "ReviewID": "UR57176724", "Content": "... all that glitters, is not gold and the Hotel Me really didn't hit a good note with me. We were here for a business convention and on first look, the hotel and the rooms look great - until you try to utilise them. The hotel is a taxi ride to any tourist areas of Barcelona or a 30 min walk. There is a decent area about 8 mins walk for restaurants but this is NOT a city centre hotel. The rooms are attempting to be model and minimalist but end up being unfunctional and uncomfortable. Here's my room issues: 1. No kettle/coffee maker in the room. Virtually unheard of in a hotel of it's \"class\". 2. Cement floor in room, slippery when wet and cold. Carpets, wood, whatever ... not this cheap alternative. 3. Chair at desk is not a work station chair but a cheap, \"trendy\" plastic design - not good. 4. Impossible to shower without getting the bathroom floor drenched. 5. The wrap around curtain on 2 walls ... whose idea was this? Only one wall is window but the curtain covers both and is VERY slow on it's automatic open/close. Furthermore, it didn't close all the way and left a 3 inch gap for the light to stream in at 6am. 6. There is a control panel for all the lights and AC. Each button pressed done something different, each time. Everybody I spoke to had this problem. 7 Outrageously priced mini-bar and room service (18Euro for a hamburger) and as your miles from anyway, it's a good weight loss hotel! Beds were good, TV was ok, other bathroom facilities good - and their maid service is some of the best I've seen. Other problems. Bar staff are worthless. People waiting to be served, while 2 of them stocked and cleaned, 1 served - very slowly. 5euro for a 330ml glass of tap beer is twice the price of anywhere we drank. Outside the elevators on every floor smelled of toilets - probably because the rooms toilets backed onto that area. Poor ventilation? Breakfast is a very generous 11am finish except at weekends when it's even better at 12noon. Arriving at 11.05 on a Saturday, we were told it was finished. Questioning why, \"because we have to set up for a lunch meeting in this room\". Even though we told her the note in the room said 12, when we checked in we were told 12 - she said there is nothing she could do, even though we could see a full buffet breakfast table and people eating. It was only after demanding a manager that another staff member made a call and let us in - it should not have came to this. Smokers - forget it if it rains, there is no area even remotely or partially covered outside! Overall, this hotel just failed. It has a few good points but it's not comfortable, doesn't provide you a feeling of luxury or a level of relaxation and just feels a bit like they don't know what they're doing.", "Date": "February 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "East Anglia", "Title": "“Stunning inside and out”", "Author": "bencarl", "ReviewID": "UR57159598", "Content": "Takes a bit of getting to, but worth it. Amazing views from higher rooms and great design.", "Date": "February 26, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Singapore", "Title": "“Trendy, chic, but not the most comfortable”", "Author": "earthjaunt", "ReviewID": "UR55938395", "Content": "For a city that doesn't sleep very much this hotel is fine. That's because the beds were not that comfortable, and I could not get the temperature in my room to go above 22 C' even after turning the thermostat up to 27/28! The hotel is nicely decorated, and the rooms are very hip. Other issues I had included spotty wireless internet access (a must for me) and it was slow. The food in the Sky Bar (lobby) was okay, as was the bar. It was a nice place to meet up before heading out on the town or when returning to the hotel at the end of the day. All that aside I probably won't stay here again. I would prefer a more traditional hotel like a Sheraton or something closer to the old section of Barcelona, even though the ME is just blocks from our office in BCN.", "Date": "February 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Hindhead", "Title": "“ME is the one for me!”", "Author": "burgoyne", "ReviewID": "UR50904485", "Content": "Fantastico! What a great hotel enjoyed every second of our 5 day stay. Could not fault staff in any way nothing was too much trouble. Rooms were brilliant and transport facilities were marvellous a tram stops on the road nearby. Poblenou Metro 5 minutes walk as is Poblenou Rambla with tapas bars, coffee shops, restaurants etc in the natural Spanish style. The Rambla leads down to the beasch which is wonderful it even includes a naturist area. Easy access to port olympico (4stops on Metro). Best price on Travelzoo 99E per night inc B/Fast and parking, ask for 16 floor and above and city view. You get floor to ceiling window and Barcelona in all its glory can be viewed from the comfort of your luxurios bed. Friday and Saturday night the ME is THE place to be seen the night club is buzzing up to 5am. If you want a great time in Barca the ME is the PLACE.", "Date": "December 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Israel", "Title": "“Enjoyed every minute and this great hotel”", "Author": "nad66", "ReviewID": "UR48094738", "Content": "Traveled to Barcelona with my wife for the Elton John show. Booked 4 nights at this hotel. The room with sea view was great. Clean, Tidy, comfortable and in general we fell in love with all the hotel decoration and new look. Breakfast was wonderful and it is served until 11. The fact that the staff was so nice, wellcoming and helpful made this vacation a big success. Will definitly go back and recommend to others as well. The hotel is not in the center of town but 5 minute walk to a metro station which makes it easy getting to every important plae in town. It's also not far from the beutifull beach.", "Date": "October 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "stp1602", "Title": "“fantastic value, lovely hotel, great staff”", "Author": "stp1602", "ReviewID": "UR45476898", "Content": "A group pf 9 ladies stayed here for a birthday celebration. Lovely hotel, smooth check in, great room - fab views if you have a head for heights. Most of us are well travelled and all agreed that the buffet breakfasts were the best we had ever had...even better that they were included in the price of the room! The range and quality of food offered was fantastic...smoked salmon, champagne, great selection of teas and coffees, cereals, hot food - and the most amazing array of muffins& cakes. Don't go to breakfast if you are on a diet!! Ten mins walk from the Metro, safe, residential area - very quiet. We were in barca for the festival weekend and it was heaving in town, so nice to go back to a nice quiet area. Would go back as we ddin't get time to use the Spa/Pool facilities.", "Date": "September 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "2", "Rooms": "5"}, "AuthorLocation": "Surrey", "Title": "“Nice clean modern hotel with friendly staff”", "Author": "Tim061", "ReviewID": "UR41602136", "Content": "I stayed at this hotel with my partner for 3 nights and would like to share my thoughts and experiences with you. Room The room was very modern and although small (standard city view) was kept Immaculate and was very clean. We had no problems and everything worked fine. The bed was very comfy and the pillows were nice and fluffy. The room was well lit apart from the main mirror area in the bath room which was dark preventing my girlfriend from doing her hair and make up properly. The shower was spacious and enclosed and very stylish. The rooms safe was easy to use and big enough for (laptop, camera, documents, DVD player and all valuables). The toilet area was sectioned off from the main bathroom and was clean well lit and had a heated towel rail and storage space. Our toilet in room 1007 did not flush that well but we had no other problems. The tv was nice although be careful when you check your room tab as it is misleading and you could end up ordering a movie channel at 25 euros. There was plenty of wardrobe space although no iron or ironing board in room which was one of the featurers which should have been included. There was also a mini bar available which was extortionate 7euros for a small water, 15 euros for condoms - you get the idea. Dining The sky bar restaurant was very good and had a reasonable selection of food available as with most hotels I have stayed in the quality of food is average and overpriced. We did not eat in the main restaurant as neither me or my partner could pick even one dish which we liked. I feel it was a shame as the view on the terrace at night would have been amazing. The average price for one dish was 40 euros so was very expensive. I would like to point out that drinks in the hotel are expensive and as there is no complimentary water included in your room a trip to the lidl 3 mins from the hotel is a good idea. I hate getting ripped off and refuse to pay 7 euros!!. Room service I would advise against it. Me and my partner both ordered the fettucine and sun dried tomato pasta and 45 mins later and 56 euros lighter our meal arrived stone cold and minus the tomato. A quick call to reception and 10 mins later the guy came to collect it as he did he took a call (from chef mayby??) to ask what the problem is. It was obvious he thought we were making it up and being funny but at those prices the food should have been checked before it left the restaurant. The hotel did apologise although when we received the pasta it was warm but still not great. We had no problems with dining at the sky restaurant and the breakfast although expensive at 22 euros did offer an excellent selection of fruit, cereal, bacon, eggs, sausages, ham, cheeses, tea & coffee, pastries and fruit juices. The only bad experiences we had were the room service and the refusal of an extended checkout. We could use the spas shower facilities though and they look after your suit cases in a room. I would reccommend this hotel though as the staff are very friendly and speak good English. They had a sense of humour giving us room 1007 as we were from England the porter called me James bond.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“4*- but good value for money”", "Author": "PrisUk", "ReviewID": "UR41416989", "Content": "Location- Getting to the hotel from the airport was a bit of a track... we took the Renfe (train) to Passig de Gracia for the connecting metro L4 to Poblenou, however it took us 20mins+ to find the actual metro station over ground! Signage was very confusing as we expected there would have been a connecting underpass without exiting the station! Anyway got there in the end with the help from the locals (extremely helpful) and the Poblenou area is not bad at all with local supermarkets and cafes dotted around. It’s great for those who intends to spend most of their time on the beach as its only 15mins away from the hotel. Service- The blonde girl at the check-in desk was very nice and we requested a room at a higher level which she gave us a room on the 13th floor! The view was OK apart from the construction site mentioned in previous reviews. The guy at the front of the hotel was very helpful and enthusiastic, always offered to help with directions and our luggages. Overall, staff were very friendly and nice, however one point I need to make ... 1 of the hotel staff (male in his mid-20's) gave us wrong info regarding travel to the airport. He told us to get the metro to Urquinaona and get the connecting train at Catalunya station (a much quicker way according to him) which was WRONG! We spent almost an hour looking for the correct Renfe station with our suitcase and everything, walking up and down a street full of people!! It was NOT a pleasant experience… Room- Our room was a standard city view room, smallish but had everything we needed. Shower was great, bed was very comfy but the toilet was a bit claustrophobic… Previous reviews mentioned about the noise from the night club on 6th floor that’s why we requested a room at a higher level so noise wasn’t a problem for us. The swimming pool was tiny but the atmosphere was quite nice with plenty of sunbeds around. Cleanliness/ Value- Hotel room itself is fairly clean but there is a strange smell in the corridors…. I think this hotel probably deserves to be a 4*rather than a 5* hotel but I would say its value for money for the amount we paid and the service/facilities they provide. Overall a good experience…. Recommend for business/ young couples/ group of friends", "Date": "September 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Atlanta", "Title": "“So far so Good!”", "Author": "EricAndLatrice", "ReviewID": "UR40001674", "Content": "This is our \"first day\" review of our stay here in Barcelona- many reviewers suggested the metro train from the airport, so that's what we did, however with the luggage we had, two carry-ons one laptop bag and a huge suitcase it became an endurance test as the rail systems is very un-modern, (very few escalators, lots of stairs and and confusing signage) the locals were helpful which was greatly appreciated since the electronic signs on the train(L2) from the airport did not correspond to the actual stops. Once we got off the L2 at Passeig de Gracia the ordeal to transfer to the L4 yellow line was a twenty minute nightmare, even the security guards gave us bad directions, we finally made to the yellow line through trial and error and many, many stairs. The yellow line ride was much better, air-conditioned with good signage. we exited the Poblenou staition and walked a quick ten minutes north to the hotel. THE HOTEL- Let me first start off by saying my wife is very particular about the hotels we stay-in she wants immaculate conditions especially when it comes to cleanliness and the ME delivered that and more. First the good, Check in was good young lady (I forget her name) with blond hair was friendly and helpful, the room, although smallest, was very clean, modern,and well appointed, the electronic curtain and different lighting selections were awesome and the view of the city was fantastic with the exception of the very near construction sites. The bed is very comfortable, the pillows extremely fluffy and soft and the overall design of the room with the see through bathroom vanity glass/partition over looking the bed very trendy and sleek.The shower area is very spacious with sensitive controls for water temp and toilet area was neat and partitioned off from the rest of the bathroom. Now the not so good, there was no concierge on duty when we arrived (7PM local Sunday) so we couldn't get a good idea where to eat or go to relax. We were told we had wireless in our room but we didn't (they gave us an ethernet cable so we plugged in instead).The hotel restaurant food was hit and miss, my chicken and vegetable dish was delectable however my wife's pasta and shrimp (recommended by waiter) was below par with only three small shrimp and not much pasta, my wife eats small portions but this was ridiculous. The bread which normally comes free was 2 euros and the water was 5. Overall like I titled this review, \"so far so goo\" . My wife is getting on me now for spending too much time writing this review so i must go. I' give another update for day 2 when we return tonight.", "Date": "September 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Pennsylvania", "Title": "“What a terrific find in Barcelona!”", "Author": "sjbk", "ReviewID": "UR39629676", "Content": "We stayed here three nights pre-cruise with my parents and friends. This hotel was everything we wanted and then some. Leticia and her team on \"The Level\" made us feel more than welcomed and took care of our every need. Great restaurant recommendations and off the beaten path gems. My parents, who are in their 70's loved the atmosphere, as it made them feel younger and enjoyed every minute of their stay at ME. Yes, it is not that close to the Barcelona attractions, but thankfully it is removed from the crowds. We took taxis everywhere and did not pay more than 10 Euros to get to where we wanted to go. We hired a private car to take the 6 of us to Montserrat, which was an incredible journey and even stopped at the Frexinet cava for a tour and tasting. The breakfast at ME is one of the best I have had in my recent travels. This hotel is worth it and gets my highest recommendation. By the way, my friends found some incredible bargains at the El Corte Ingles Department store at the beginning of the Ramblas, so they had some new clothes for the cruise. If you want something different and enjoy unique, ME is everything you are looking for. Enjoy Barcelona in the way it should be, wonderfully eclectic.", "Date": "September 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Scotland", "Title": "“Great”", "Author": "Scapa", "ReviewID": "UR38999215", "Content": "It seems you either love or hate this hotel. We really loved it and we are in 50s age group! Our rooms were spacious and very stylish. It is a bit out but only a few minutes walk to the metro which goes to Barcelonetta and the centre. We found the drinks expensive but we just went down to Lidl which was 3 minutes down the road. We really cannot recommend this hotel too much and our sons thought it was wonderful. We went to the beach this first day but the Pool area is so nice we just went there every day and our 19 year old who is beach obsessed even ended up here. Try to get a deal which includes breakfast as they are brilliant but I overheard that you can get the continental breakfast which is the best bit for 12 euros rather than the 22 for the whole lot. We also quite liked getting out to the local area from the busyness of the city and having a drink in the local Ramblas before bed. A bit of a treat, that was!", "Date": "August 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "California", "Title": "“Wonderful Time! Great Hotel! A+++++++++”", "Author": "Truevoice", "ReviewID": "UR38822569", "Content": "ME-Barcelona is wonderful! I’ve stayed at several hotels all over the world and this hotel has some amenities that I have never seen before. It has a vibe like the Standard in Los Angeles but provides some very modern technology. There is a panel on both sides of the bed that controls the bedroom lights, curtains, desk light, bathroom lights and nightlight. The wifi worked great. There is a very nice business center on the second floor. Although I would suggest getting a room with breakfast, I would not suggest upgrading to the “Level” unless you’re on business. There is some great food in Barcelona, and getting out to eat dinner is my suggestion. You MUST eat at Raco De La Villa (10 minute walk from the hotel). Get the T-bone steak! This restaurant is located on the corner of Ramon Turro and Ciutat De Granada. If you want a place a couple blocks from the hotel try Los Ballotas. (The front desk will give you directions.) The hotel is a 10-minute walk from the Metro and a 15-minute walk from the beach. It will cost approx. 45 Euros to get to the hotel by taxi. I would strongly suggest that you take the train. This is what you need to do: From terminal two you need to take follow the signs for the Renfe Train. You will need to walk across a bridge to the train station. Purchase a T-10 ticket. This is a little less than 8 Euros and can be used by more than one person. (If you’re traveling with more than one person you can run the T-10 ticket for one person in your party, let them go through and then run the ticket for you and then go through the glass door. MAKE SURE you enter your ticket into the correct turnstile, otherwise you may purchase a train trip for someone else.) There are machines to purchase the tickets at the train station. I would suggest that as soon as you get off the plane to get money from the ATM. You will get the best rate using the ATM machine. Take out as much money as you think you will need for the time you will be in Spain. My bank only charges me one fee for the one transaction. If you use the ATM several times you back will charge you each time you pull out money. The exchange rates at the hotel and at the money exchange businesses are expensive. There is no ATM at the train station, therefore make sure you have at least 10 Euros to buy your T-10 ticket. Get the Renfe Train Schedule. The security guard will have a copy or you can ask for one from a Renfe attendant. The train runs every 30 minutes. I would suggest that you walk al the way down the platform to avoid the congestion of people. Take the train to the Passeig de Garcia station. Once you get to Passeig de Garcia, take the metro Yellow Line (L4) in the direction of La Pau. Your stop for the hotel will be Poble Nou. Please note that there are several flights of stairs in the Metro – and no elevators, and very few escalators – so I would recommend you pack light. Once you exit Poble Nou and come out to the street you will need walk straight and then make left on Lope de Vega. Once you walk for about 5 minutes you will see the hotel. Right before you get to the hotel you will see a gas station. You may want to buy a gallon of water there. Water in the hotel is expensive. Note: If you head the other way Lope de Vega you will end up at the beach. (FYI: Once you get to the beach, go to the beach on the right. If you go to the beach to left you will be on a nudist beach.) On the way back to Airport the Renfe Train will say Airport on the front of the train. Do not take any other train. Tipping – I talked to several of the locals and every one of them said that tipping is not necessary in Spain. They told me that the most that they do is round up. As an example we had a dinner check in the amount 118 Euros and the locals suggested that I leave 120 or 125 Euros. They stated that locals do not tip at all for a drink. I stopped leaving tips after being in Barcelona for two days and I did not feel as if I was treated any differently. I would strongly suggest that you get on the Barcelona Bus Turistic. This is a bus tour that takes you to different sights around Barcelona. It costs 21 Euros for a one-day pass and 27 Euros for a two-day pass. I would suggest that you buy the two-day pass because there is a lot to see and you will need to get off the bus to see all of them. You can purchase one of these bus passes in Paca de Catalunya. You can get here by going back to the Metro and taking the L4 (yellow line) to Urqinaona. The last thing I that I would strongly suggest that you do is to take the 30 minute train ride to Sitges. You will need to take the L4 (yellow line) to Passeig de Garcia. (Note that you can also catch the train at Estacio de Sants, but I would not suggest it. Sants is a very busy station. If you get on the train at Passeig de Garcia you will be on the train one stop before Sants and this will insure that you will get the seats you need before the mad rush of people get on the train at Sants.) The final destination of the train is either Vilanova i la Geltru or St. Vincenç de Calders – these are the names that you should be searching for on departure boards and on the front of the train rather than Sitges. There are a lot of gay men in Stiges, but the beaches are great and the village has tons of shops and restaurants. All the beaches have toppless women. Approx. 1 out of 6 women don’t wear a top. This includes grandmothers. The metro/train is a great way to save money while visiting Spain. Take a few minutes to review the maps of the subway, and if you can read a map and follow signs you’ll be just fine. Magic Fountains – a must. I have seen the fountains at the Bellagio in Las Vegas. I prefer the fountains in Barcelona. At 9 p.m. each night you view a spectacular show of water, lights and music. Finally, a couple blocks from the hotel is a street called Ramba del Poble Nou. The locals walk up and down this street and eat dinner at the sidewalk cafes. Note that most restaurants open at 7:30 p.m. and close at midnight. Before you leave for Barcelona make sure that you take a look at www.barcelona-tourist-guide.com You will find a lot of good information on this website.", "Date": "August 25, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "ireland", "Title": "“Awfull hotel”", "Author": "IrelandPenney", "ReviewID": "UR38510455", "Content": "We were booked into the ME for 9 nights, we checked out after 3, staff were very unfriendly and unhelpfull. the rooms are among the smallest Ive ever stayed in. Cannot understand how this hotel got rated with 5 star, no way, 3 star at best..The walls in room were marked, the corridors looked as if thay had never been hoovered. The sockets were loose. On the 2nd day, no one cleaned our room or made bed, we had to ring twice for toilet rolls and towels, The air con did not go down past 23. We couldnt wait to check out, we moved to the arts hotel where we found a real 5 star hotel", "Date": "August 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "surrey", "Title": "“AMAZING”", "Author": "haines01", "ReviewID": "UR38058204", "Content": "I just stayed here for 3 full days and could not have had a better holiday. The hotel is ultra swish and actually found the location to be about right. It will cost you 35 Euros from the airport, and will take approx 25 mins. (Cabbies are nutters) We stayed on the 13th floor and had a sea view which also looked over the pool. Room was beautiful and very spacious. All mod cons and everything you will need (No Iron) There is so much to do in the hotel like (Spa, Pool, Restaurant, Gym, Night Club on Saturday) We walked to the beach on the first day and did not realise how long the becahs was so settled in a nice spot which was busy but really nice. Food can be expensive but generally it is the drinks. Nice though. the one thing I would be wary of is the cost of drinks in the hotel A coke 5 Euros and vodka and Tonica 10 Euro's in the end I walked to the petrol station (1 minute walk) and bought water and cokes etc from there. Breakfast is 22 Euro's each. Very steap for what it is. More positives is the pool area. Lovely chilled pool enough beds as long as you get down about 9am and put your bag or one of their towels down. Food by the pool is lovely Service is lovely (always with a smile) Manged to get a check out at 2pm We went to two amazing restaurants: Ciutat Comtal (Rambla de Cantalunya 18) amazing tapas food. CDCL near the marina (prob the best restaurant I have ever been to) £50 per head roughly. (look on their website) I would also recommend the tour bus. Hop on hop off all day.. great to get around if you want to see everything. will definately be coming back here but will learn some more Spanish", "Date": "August 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "wales", "Title": "“Fantastic Hotel”", "Author": "truthwales", "ReviewID": "UR37539458", "Content": "Went to Barcelona for a weekend city break and after examining the hotel website was very excited as to what was in store and upon arrival it didn't disappoint. Getting to the hotel from the airport was a bit pricey as we weren't sure of its location we decided to take a cab which cost about 35 euros so best to plan your journey from the airport in advance (one shuttle and metro ride is all it took as we later found out). We were welcomed by a friendly face who informed us that they had automatically upgraded our room for free and that we had a sea view. The lobby and bar areas were just as trendy as in the pictures and the room also. Great view overlooking the sea and below us a clear view of the pool area. After a hot journey took a shower and the bathroom facilities were excellent with luxury aveda products. The room was well air-conditioned which you could control and with electric curtains and mood-lighting it was easy to adjust to how you wanted it. No sign of any smell throughout the hotel as mentioned in previous reviews so they have obviously addressed that problem. As we were there for a couple of days we didn't really use much of the hotel facilities other than the bar which was very trendy and reasonably priced depending on what you were drinking. On the satursay night there was a big party going on but it didn't exclude us from going anywhere and although it went on until the early hours no noise travelled to our room so was obviously well soundproofed. Good advice on where to go for a nice meal was provided by the lady on the desk she also explained how and where to use the transport system. Metro was just a 5 - 10 min walk and the tram was situated just outside the hotel. Both ran frequently and you could obtain a card for just 7 euros which lasted both my partner and i the whole trip. Breakfast in the hotel was excellent i could have happily just sat there and eat it all day. Good selection from pastries to fresh fruits, smoked salmon to cheeses. There was something for everyone and plenty of it too. All in all we had a wonderful stay and would definatley go back perhaps for longer and use more of the hotel services the spa and gym looked inviting. Its so hard to sum up our wonderful stay in just a few small paragraphs. Would definatley recommend visiting the hotel for either business or pleasure as from overhearing a few conversations in the lobby they offer great conference facilities also.", "Date": "August 13, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Location": "2", "Rooms": "3"}, "AuthorLocation": "west mids", "Title": "“chavtastic”", "Author": "bheth", "ReviewID": "UR37296315", "Content": "if you are over 25 do not stay here. It's a nightclub and walking past 'door staff' security guards did not feel pleasant at night. noise from on site night club vibrated through my pillow. staff were not helpful at all apart from the daytime doorman. Felt like a travel lodge with posher furniture. Stayed in better 3 stars.", "Date": "August 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Brooklyn, New York", "Title": "“A Bit Trendy, but Good Value”", "Author": "robotmuppet", "ReviewID": "UR37181512", "Content": "We stayed here on our honeymoon. It is very beautiful and the staff is very professional and helpful. The breakfast buffet was the best we've ever had. The location is a bit far out, but only a 20-minute metro ride the main areas of interest in downtown Barcelona. The hotel is probably best for a younger crowd, as it prides itself on its club and its flash appeal. But still, if a good value is desired, this is a great choice.", "Date": "August 9, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Berlin, Germany", "Title": "“Well ...”", "Author": "holidaylover13", "ReviewID": "UR36107357", "Content": "Where do I start. The hotel itself is very nice. Very stylish with great rooms - everthing is quite new. You have great view. The hotel has a nice pool area and also the breakfast was quite good - only the fruits and the cheese did not look fresh all the days. Usually for a hotel like this I would rate 5 points, but ... the service and the management of this hotel is way below 5 stars. First we arrived we had to wait a while to check in because there was only on person working at the front desk - with this size of hotel it can take a while. So after checking in we went to \"our\" room to find out that someone had this room already. This is worst case in a hotel I think. The guy in \"our\" room was not amused as well. Then we came with our car and had a rate where parking was included, but all the time you wanted to leave you had to explain that because the always wanted to charge for parking. So they always called someone to ask if this is possible to have parking included - very annoying. Also the reception staff was not very friendly. All the people working there - esp. the younger men - look very stylish - but none of them is very professional with guest service. Very sad, because this hotel could be one of the best in Barcelona, but they have to improve many things. Next visit I would not stay there again.", "Date": "July 29, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Portland, OR", "Title": "“Very nice modern hotel, more for younger crowd”", "Author": "PDXvoyager", "ReviewID": "UR32848231", "Content": "Very nice and modern. Clean large rooms. Large, lat-panel TV. The location is a bit out of the central area. but would not be a problem with a car. Closest Metro is about 4 blocks away and is not one of the most convenient lines. (A beach is only about 10 blocks away by foot.) The staff was very professional and helpful - extremely attentive. The noise from the club on the main floor was so loud we could hear it on the 13th floor, though it did not keep us awake. If you are 20-35, plan to party and have a car or plan to take taxis, this is a perfect hotel for you. Note, we had an ocean view, but in Barcelona I would actually recommend the city view instead.", "Date": "June 22, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Ibiza", "Title": "“SLEAPING IN A NIGHTCLUB”", "Author": "CanTruy", "ReviewID": "UR32732332", "Content": "I have just returned from a very hot Barcelona The hotel ME Barcelona run by Melia was like walking into a nightclub very loud music and the rooms over the pool were very noisy.The beds were comfy but music until 5am was difficult to sleep.The breakfast was good but the dinning room was full and not able to eat dinner at our hotel was very annoying.The pool was closed for a private function.Very dissapointing", "Date": "June 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Paris, France", "Title": "“Strange hotel”", "Author": "ShurikFrance", "ReviewID": "UR32532027", "Content": "It is a bit spooky, the TV goes on by itself during the night, on the other hand, if you want just to watch news you can spend a good deal of time trying to get out of the front page of the TV. The shower is going by itself from time to time, spooky, remember? You also will have fun with learning which button turns on which light. The window in the room is really dirty, water in the tap is yellow. It is resisting you. Looks a bit like 0.5 stars hotel rather than 5 stars one.", "Date": "June 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "amsterdam", "Title": "“Better location than one would expect”", "Author": "piddyman", "ReviewID": "UR30838642", "Content": "My wife and I recently had a very pleasant stay here. The hotel was booked by a friend The friend was nice enough to upgrade our stay so we had access to The Lounge. Very good food and drinks included all day. I think this made a big difference between it being a decent hotel and a very good one. At first we were disappointed about the location of the hotel being far from the action. After venturing around the city on bikes rented from the hotel we realized that the location was actually a plus. The rambla by the hotel is full of locals, free of the tourist, packed vibe of the larger one in the heart of the city. Surprisingly good restaurants for a good price. A nice, quiet section of the beach is about a 10 minute walk from the hotel but the pool on the 6th floor is worth staying close for. The service was excellent. The concierge gave us a very good plan for our bike tour. The rooms were a bit small but well appointed and the Aveda products are always nice.", "Date": "May 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "wigan", "Title": "“Luxury at the Level”", "Author": "benjchach", "ReviewID": "UR30033261", "Content": "We stayed here for a few days in April 09, we upgraded to the Level and it was well worth it. You get your own lounge bar with free drinks, appetisers, internet, games consoles. The extra we paid for the upgrade to the level was well worth and covered by the drinks we had in there. The restaurant was very expensive though and did not cater vor veggies. A bit out of the centre but if you dont mind using the metro its fine. Would deffinately stay there again", "Date": "May 15, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Prague", "Title": "“Great breakfast, but bit out of town...”", "Author": "Eliska_1", "ReviewID": "UR29698156", "Content": "I've stayed there with my boyfriend for 4 nights. I was looking forward going as it looked fab. When we arrived we've discovered the hotel was not so close to the centre of Barcelona. But once we figured out where the metro was it wasn't so bad. Our room was on the 17th floor and we had nice view of the town. The room was quite small but clean and loved the bathroom. Bed was very comfy. The breakfast was great, inc. champagne and wine (!!!). We booked our holidays as a package, so the price wasn't so bad, but when I checked the prices directly with the hotel I thought it was bit to much. I think it's trying to be more then it is. If you like super-modern style and don't mind it's not so close to the centre, then go for it :). We booked via www.lastminute.com I wouldn't stay there again as I'd like to be more central next time.", "Date": "May 10, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“A real shame.....”", "Author": "markyrSE1", "ReviewID": "UR24792908", "Content": "A visually stunning hotel. The rooms were compact but very well designed. No hint of problems with smells, music and drains that have been mentioned on previous reviews. BUT - two big problems: 1. After being told that I was entitled to one item of clothing to be ironed per day - complimentary, I gave my shirt to the very charming lady who showed me my room. The shirt didn't turn up until 45 minutes after I was supposed to leave the following morning making me late for a meeting. I also had to make several calls to get the shirt back. 2. The 22 Euro club sandwich and fries was inedible. A disgrace. It doesn't matter how beautiful and stylish a hotel is, if it can't get the basics right - it should and will fail. I would have whole heartedly recommended this hotel at 9pm on my day of arrival - now, I wouldn't. That's why it's a shame.", "Date": "February 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Style and design a little out of town”", "Author": "Paulyg123", "ReviewID": "UR23262020", "Content": "Hotel building looks great and the staff were friendly and professional. Room was great with a floor to ceiling window with views out over the city, a copy of Wallpaper is included as reading material and its very appropriate given the slick interior. Breakfast was a little chaotic, the room is small and the staff struggled to cope with the number of people but the food and coffee was great. The hotel is a little out of the centre of town but there is a metro station close by and you'll be there in about 10 minutes. The area around the hotel has many construction sites at the moment.", "Date": "January 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Dublin", "Title": "“Not up to 5 star yet”", "Author": "whatsittoya", "ReviewID": "UR23176907", "Content": "Stayed here in early december for four nights for a work function. Initially impressed with the service and rooms and full kit out of the hotel. For the suite we had for the conference it was a terribly laid out room in the basement with over heating problems, poor smells and the staff did not seem to know how the lighting worked. It was done from the floor above! To cap it off there was an issue on the final day when 2 laptops bags with other equipment & passports were stolen from the conference room when it was left vacant for an hour. Security were slow to respond but the hotel assisted well. Not sure though how secure the venue is as this kind of thing should NEVER happen in a 5 star. Overall on a leisure stay I would recommend the hotel, funky rooms, Level 25 is cool, Service good etc if you are happy with the relatively short trip to town. For a business conference I would ensure you know what you are getting for your money.", "Date": "January 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lima", "Title": "“Exellent”", "Author": "Fordbank", "ReviewID": "UR23104268", "Content": "An excellent, modern hotel with highly stylish decoration. Service was first class as were the restaurants. Parking facilities were available. Beautiful views of Barcelona from the room. A very enjoyable stay.", "Date": "December 30, 2008"}], "HotelInfo": {"Name": "ME Barcelona", "HotelURL": "/ShowUserReviews-g187497-d1153245-Reviews-ME_Barcelona-Barcelona_Catalonia.html", "Price": "$164 - $511*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Pere IV, 272 286</span>, <span class=\"locality\"><span property=\"v:postal-code\">08005</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "1153245", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/50/73/5073cafa75bb5d86f8363043f3e603d23large.jpg"}}