{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bratislava, Slovakia", "Title": "“Great accomodation, but poor communication prior to our visit”", "Author": "RichiSK", "ReviewID": "UR122271366", "Content": "Spacious and good located apartment building, with helpful staff. During my 12 days stays everything from checkin, room cleaning, concierge services to checkout run smoothly. Good (and free) parking options, nice lake and Dubai Marina View, close to Emirates and The Montgomerie golf clubs (10min by car). Some compliances - we need a visa prior to our visit to UAE. I tried to contact hotel by email and by phone (each day), but no answer or swithching phone calls to \"responsible\" but missing person. It tooks 2 weeks to send me an answer with absolutely overpriced offer for visa application. Second (but only small| compliance is about towels - room cleaning service changed them each day, but we receive normal towels only on some days.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A great bussiness trip”", "Author": "Lithium411", "ReviewID": "UR121374647", "Content": "Great little apartment to spread out in. Concierge was helpful. Would happily stay there again", "Date": "December 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Manama, Bahrain", "Title": "“Value over Service ....”", "Author": "AAZH", "ReviewID": "UR120561660", "Content": "This is simply an apartment building being managed as a hotel and the management/staff are doing a poor job at it. Although the units are spacious and have good views, yet the staff and the management are not professional and need a lot of training. THREE days with no towels being placed in the room because they are fully booked is an unacceptable excuse for any accommodation service provider regardless of the reason. When the staff was informed, they would simply smile, inform you that there is nothing they can do and promise to find some towels within a couple of hours. Needless to say once you start shouting, the ball rolls and you get the towels. In short, if you prefer value over service, then you may want to consider this hotel yet note that in Dubai, there are a lot of better options at great deals.", "Date": "November 14, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Far from City ,Slow Service ,dirty towel in my room,no room service”", "Author": "Farshad74", "ReviewID": "UR116914648", "Content": "i was in this apartment ( not hotel ) during july Positive : 1- Every thing is new 2- large room for a long stay 3- Good A/C 4- Good Bed and Bedroom 5- 2 WC In rooms 6- Normal Price 7- A big kitchen with all necessary items for a long stay and cocking 8- A good balcony 9- A good view to sheikh zayed road 10- A good space for your baggage 11- calm and quite room and good soundproof Negative : 1- Very Bad House keeping 2- Very Bad Service 3- Angry Team and Not educated for Hotel in a city like dubai ( 4- The room is not clean and the house keeping didn’t make my room untile the time that I called them 2 times 5- The Material in the Toilet like Shampoo and …. Are really Bad quality !! 6- The location is Far from Every thing . far from city ,far from Malls ,far from resto …… so everyday you have to spend your time in taxi and metro 7- The hotel management didn’t answer to me when I complained about a dirty towel in my room when I checked in !!! 8- The Elevators are very Slow and you have to wait and wait and wait . 9- The resto food is poor and it is closed during weekend and there is no room service ! when I checked in it was Mid night and they don’t have retso or Room service and there were not any resto open near the hotel , as the hotel located out of center and far from normal life 10- They arrange for you a taxi in 30 minutes !!! 11- They don’t know how to respect the guests 12- Bad smell inside the hotel as some rooms are making food ( diffrent nationalty food and you svereal smells) 13- Poor and slow service 14- Very expensive internet for your room Finally I don’t recommend this hotel for a short stay or touristic visit in dubai ,as you are far from city and attractions . The hotel is good for families who wants to stay here more than month and long stay Bring your shampoo and towel ,in case that you want to stay in this hotel And bring food if you arrive in midnight as there is nothing to eat ,only mineral water for the welcome !!!! When I told to the front desk that there is blood in my towel and I want to see the manager ,she was looking at me like a person who is watching her bell boy or ……so forget about respect to client I gave the bloody towel to her to show to her boss ,but when I cheked out nobody didn’t apologise and nobody didn’t call or send email to say sorry for the bad welcome !!! It is better to choose other hotel in dubai as dubai is famous for its hotels and high class level of life .", "Date": "August 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Luxury at budget prices !!!!”", "Author": "NostalgicDream", "ReviewID": "UR108086000", "Content": "Just Wow ..... Booked in advance for a 2 night stopover in Dubai for my young girls birthday, and tell you what, can't ask for anything more. Room, staff, food, service ... Excellent. Only problem is location.... will remember to hire car next time... we forked out a lot for taxi to go round. Don't worry about looking for taxi outside, just let the reception know when you want one and it will be there. Don't be fooled by Dubai marina metro station just nearby, you have to figure out how to get there. Which you want be able to as it’s a long walk, you have to get there by taxi and some of them won't like the short fare. It was out of question for us with little one to walk that far. Only complaint I have had was they didn't let us check in an hour early but no problem, the guy gave us a very good room instead and we asked for lower floors as we had children and there it was the on the third floor. Overall, just get the transport sorted and this the hotel you won't regret going for.", "Date": "May 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "france", "Title": "“Great appartment hotel”", "Author": "taisha1971", "ReviewID": "UR98624077", "Content": "We enjoyed out stay there, it is well services and prices are very reasonable for a two bedroom apartment...", "Date": "March 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Lyon, France", "Title": "“geat place for a business trip”", "Author": "Nikko63", "ReviewID": "UR90030167", "Content": "Amazing apart hotel, very convenient for business travelers. You have space to work, dine and sleep. A living room very spacious, 2 lavatories. It is not an hotel, you don't have a valet parking or things like that. It's far from the main leisure places but it's a good place to go if you want to be in Dubai as if you were living in. You have your own flat and you live like a rich expat. The housekeeping did the washing up every day. There is a washing machine. Unfortunatly, the wifi was expensive but you can catch one for free in front of the lifts !!! It is quite noisy every morning for the prayer", "Date": "December 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Really relaxing after whole day trips in Dubai”", "Author": "Zelkalite", "ReviewID": "UR87996498", "Content": "It is a great place to choose if you are tripping to Dubai, Air conditioning in the rooms is perfect also the lighting system was great inside the room. I stayed there for 4 days and everynight after Dubai tour I felt really relax inside the Liwa heights, Balcony, well equipped kitchen, always on time room cleaning, no city voice, also relaxing sitting room even for 4 people. It is really very easy to reach the taxi there and 15 minutes to Burj Khalifa by taxi, The staff knows English well and helps all your needs on time. I offer for an economic and upperclass pleasure...", "Date": "November 23, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "malate", "Title": "“Amazing apartments in building site”", "Author": "kevinwatson", "ReviewID": "UR82413672", "Content": "Great value apartments in unfinished development area. Construction abounds all around it. Really spacious and superior accom in an area that is unfinished. Pool is fantastic. Getting a taxi is a pain.", "Date": "October 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Manama, Bahrain", "Title": "“Fab accommodation, good value for money, recommended if you know your way around Dubai”", "Author": "PADK", "ReviewID": "UR46344404", "Content": "Oaks Liwa Heights is definite value for money in terms of room space and comfort. It is in a middle of construction site for now but I foresse that in the next 3 years, perhaps this location (JLT) will have more to offer to visitors. When the Dubai Marina Metro Station opens, this hotel is a great base which will offer a safe and short walk distance to the Metro. It is also a very short taxi ride away from the very fashionable, trendy and interesting combination of shops and accommodations at The Walk at Jumeirah Beach Residence. As for now, it remains quiet and good for peeople who know their way around Dubai. If you are arriving in Dubai via Emirates Airlines. The best and cheapest way to ge to hotel is take the Metro (from terminal 3 only; dedicated to Emirates Airlines). It will cost you 4.5 Dirhams (about $1.30) and 2 Dirhams to buy your Visitor's Metro card which is re-chargeable. At the moment, you can only get off at Mall of the Emirates and then from there take a taxi to Oaks Liwa Height in Jumeirah Lakes Towers. This is a large area of many buildings and is heavily under construction, hence, some taxis do not know wehre it is. Tell them it is in fornt of Damas (gold factory). It costs about 20 Dirhams (less than $7) from Mall of Emirates to the hotel. If you can't be bothered, taxi from airport to the hotel will cost about 100 Dirhams (about $27) in good traffic. Soon, the hotel can be serviced by Dubai Marina Metro. It is a short walk from the soon to open Metro stop. Places of interests close by are Dubai marina (The Walk), a splendid, Mediterranean styled shops and accommodations by Juneirah beach. It took me 2 1/2 hours to walk the whole strtech from beginning to end including my stops at interesting shops and lunch. Weekend (Fri & Sat) features an outdoor market from 9am to 9 pm. Many interesting finds from here. You can also bring some folding chairs and park yourself along the beach which is situated between the hotels. The best stretch is just after teh Hilton Hotel. Choices of Restaurants- unlimited! Another day, go malling and visit Dubai Marina Mall- nice cosy and quiet-ish. This si literally across Sheikh Zayed from the hotel but you'd need a taxi to take you there. Not far ar Ibn Battuta and Mall of the Emirates. I sugegst to explore the city via Metro and make Mall of the Emirates station your springboard. It is cheaper to travle this way and will give you a good perspective of the city. The hotel only has a coffee shop and Restaurant open for breakfast and lunch. Make sure you buy provisions if you tend to get peckish at night. The rooms have well equipped spacious kitchen and housekeeping will do the washing up for you the following morning. If you have the time, try their gym; a proper one with all modern and working equipments. The pool is indoors and good for family. There is also a covered kiddie's pool. However, you wlll be overlooked by construction wokers in building all around you so think Modesty! Taxi can be ordered by reception, however, they tend to forget (not that there are many guests requeting for them to remember, ha.ha). I suggest going down the hotel ramp entry and flag a taxi from there. Should not take more than 5 minutes. Order taxi only if you are going out very late at night as the road are has not many street lights and could be unsafe in darkness ( in term of motor accident, I feel). Night trips are very good at Madinat Jumeirah by the Abra Lagoon. Try Dubai Marina, particularly Meridien Mina Seyahi's Bartista. Dubai is an amazing transforming city by the minute. My next stop is to explore Old Town.", "Date": "October 9, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "2"}, "AuthorLocation": "Dubai", "Title": "“Are you serious?!”", "Author": "Traveller2628", "ReviewID": "UR38113364", "Content": "Stayed in the place for 1month and I must say I have never met so many incompetent hotelier. Staff doesnt speak proper English. You can only speak basic English and pray to Allah that they got it right! Peopl kept on entering the apartment and doing \"maintenance works\" (or hell knows what) whenever I left the place. My clothes went missing, my food got eaten from the fridge and no matter how many maintenance work they do the place stinks, household machines kept on breaking down, windows so dirty I can not even see clearly... the contstruction that is 24/7 around the building. The noise of generators and workers around at 2-3AM is unbearable. I havent had 1 good night sleep... and I am missing my things! :( Oh yeah...swimming pool has unidentifiable floating things on top and way too cold! Hotel assosciation should close this place or remark it 2star.", "Date": "August 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "philippines", "Title": "“Away from home a great place to be”", "Author": "myloPhilippines", "ReviewID": "UR37450473", "Content": "Stayed in a Two Bedroom over the weekend with my husband and 2 kids overlooking patrially finished lake on the side and the Montgomery golf course. Amazing view from the 22nd floor. The size of the apartments are just WOW. Rarely you get a walk-in shower and a full bath. The beds are so comfy you dont feel like getting out of it. Kids just loved the pool and refused to come out. Great gym, could do my routine treadmill. Husband had a round of squash which is unusual in an apartment building. Staff very caring and helpful. Coffe shop....space for improvement is there. Kid's loved the burger and the nuggets. The Jumeirah Walk is at a short driving distance and we loved the atmosphere there so had dinner in one of the restaurants. Construction is all over in Dubai but the apartments were just so quite. Surely its a Quality hotel at affordable price. Request for higher floor so you can get good view and less noise for sensitive sleepers.", "Date": "August 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“room for improvement..”", "Author": "BrigidE", "ReviewID": "UR25311671", "Content": "We stayed here on a great introductory rate of 500 durums a night so we were expecting a few teething problems but we thought that this would be better than spending a fortune on a room we would be doing very little except sleeping in and prefer to be in something new than old and run down... and we find it handy to just have cereal and coffee in our room in the mornings while checking the internet rather than have to go out so having a kitchen is very convenient. The foyer and apartment rooms are quite satisfactory and serve their purpose - nothing particularly super glamorous or fabulous about them.. typical style and standard of this type of accom it was quite comfortable and we slept well.. although be aware construction goes until midnight and starts at 6am (and they do quieter things like concreting through the night..) Be aware also the 'lakes' are not filled yet they are just big concrete holes right now.. We did have a few issues .. Firstly you have to switch on the hot water in the bathroom before you can have a shower or a bath.. this takes over 40 mins to heat up! - very inconvenient if you want to have a bath or shower after a long flight and your business associate is coming to pick you up in 1/2 an hour! - the porter had neglected to tell us this when we were shown to our room and I only found out about the switch by ringing down to reception about the hot water.. wasn't a good start for me as I was exhausted after flying overnight for 11 hours and being taken straight out all day .. so looking forward to a hot bath before dinner - I had a cold shower instead : ( But by far the worst occurrence of our stay was the next day when our business associate was tied up in a meeting and asked us to take a taxi to his office... well we went down to reception and asked them to ring us a meter taxi - they informed us that a meter taxi would take a very long time to come and asked would we like to take their hotel taxi.. well we gave them the full address of where we were going and the lady disappeared for over 15 mins - I eventually asked someone else what had happened to her and he went and fetched her - she said it would cost 30 durums to take us to where we wanted to go so we agreed... (it was about 10 durums more than what it would be in a meter cab.. ) anyway we went out to the 'taxi' which was a (not very clean) station wagon - and we drove off in what I was pretty sure was the wrong direction about 3 blocks away to some subdivision! Obviously he was lost so after driving around a bit aimlessly we got him to ring the office of where we were going.. well then he told us that it would be 100 durums to go to our destination ! I said that was a ridiculous amount to pay for what should be an 8 - 10 min journey! anyway he rang the woman at the hotel and I spoke to her and I suggested that I pay 50 durums as I didn't think it fair that I should have to pay such a higher price than agreed since the mistake was on their part certainly not mine! I after all wanted a meter cab! Anyhow the driver had absolutely no idea where he was going even when given directions and managed to drive 1/2 way across Dubai in the wrong direction - very frustrating and made us incredibly late for our appointment with someone who was just about to catch a plane so we ended up having a 10 - 15 minute meeting in the end!! Anyway the office is in an area under development that hasn't really opened fully yet so we needed him to wait for us.. we thought we would make amends with him at this point by giving him another fare (we hadn't realized what a jerk he was at this point!) anyway we have our 10 - 15 minute meeting then go back and get into the cab.. we asked how much it would be to be dropped off at one of the malls - 100 durums he said - how about ANYWHERE 100 durums he said - well how ridiculous - 100 durums would basically get you to Abu Dhabi in a regular meter cab! So we said to him just drop us at the closest place for 50 durums - he refused and stopped on the middle of the highway in the desert and tried to make us get out of the taxi!!! I have never been treated in such a way in my whole life!! and we are hotel guests!! he told me at this point that it was his second day at the job and that he wasn't from Dubai so didn't know where anything was!! Anyway he had to go back to the hotel anyway so I told him I wanted to speak to his boss - he rang him on my phone and he agreed to take us back to the hotel (which took 8 minutes from the office to the hotel BTW!) There I spoke to the manager.. I was incredibly upset about the whole thing.. fancy trying to leave guests in the middle of the desert! And what kind of logic is it to have a hotel taxi driver who doesn't know Dubai driving around visitors to Dubai who probably don't know it either!!! doh!! We then asked for the hotel to ring us a meter taxi - it took ooh about 6- 10 minutes to come..(so it was just a story about having to wait..) the taxi driver told us that the security would not let him come to the entrance - the poor guy had to park on the street and walk up to the hotel!! - well he took us to the old town (to the spice and gold Souks which is right on the other side of Dubai for 40 durums! We found the meter taxis to be excellent in Dubai and very good value.. just a few tips if you are staying here - most will know the Jumeirah Lakes Towers but wont know the Oaks as it is new.. just tell them to go to the gold factory which is just across the rd - most knew this place and just a little further along the rd to the right is the Oaks.. I might stay here again if it was the cheap price I paid but I think it is definitely not worth it for the rack rates they are advertising these days.. personally I preferred the old town where I stayed on my return from NY (Dubai was a work stop over) it isnt really handy to anything.. the other side of the Rd is an interesting area but it is almost impossible to get across! - this might change when the skytrain is up and running later this year as I think they are putting walkways over the rds also..", "Date": "February 28, 2009"}], "HotelInfo": {"Name": "Oaks Liwa Heights", "HotelURL": "/ShowUserReviews-g295424-d1158696-Reviews-Oaks_Liwa_Heights-Dubai.html", "Price": "$131 - $608*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Jumeirah Lakes Towers</span>, <span class=\"locality\"><span property=\"v:locality\">Dubai</span> <span property=\"v:postal-code\">4443</span></span>, <span class=\"country-name\" property=\"v:country-name\">United Arab Emirates</span> </span> </span> </address>", "HotelID": "1158696", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/ba/67/ba67e1765b1c13b1d7730d3ce9345c704large.jpg"}}