{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bath UK", "Title": "“Cheap & Cheerful”", "Author": "Bathlady", "ReviewID": "UR127020285", "Content": "This hotel is just off the main tourist area 'The Rambles' in a relatively quiet square. Next door is a great cocktail bar and a friendly cafe that sells good coffee (and tea!) The hotel is basic but clean. The staff are kind and helpful. The only bad thing about the hotel are its pillows which are small & hard.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“Great Location, OK Hotel”", "Author": "jMacL", "ReviewID": "UR124180784", "Content": "My impressions were consistant with the other reviewers. We loved being close to Las Ramblas but being set back one block made things more quiet. When we checked in, we had a problem with our room and the two guys on the front desk were just great taking us to see a few rooms and letting us pick the one that worked best. On our second night, the curmudgeonly grumpy desk clerk wasn’t interested in answering questions, giving directions, or generally being bothered with guests. This is unfortunate because the guys the first night were so great. The rooms were small and quite dark but were clean. Bed was as hard as a rock, but since I’d just flown in from the west coast of the US after a 4 hour weather delay, I could have slept on the stairs. The biggest negative was the bathroom which was basic but cramped and had black mold on the ceiling. Breakfast wasn’t bad for ‘continental’ and there was even a sausage of sorts—if you count chunks of hot dogs as a sausage. It was handy having an few computer and workstations right off the lobby, but there is no printer attached, so one couldn’t print boarding passes and the grumpy desk clerk wasn’t interested in helping us find a place where we could.", "Date": "February 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chelmsford", "Title": "“Nice hotel, great location”", "Author": "ParkerPies", "ReviewID": "UR118649497", "Content": "We stayed at the San Agustin over the weekend of the Festival of Merce, which was a great experience and added a great carnival atmosphere to the city. The hotel is in a great location, just 50 metres set back from the Ramblas which means it is very central but also just a little set back to avoid the noise. The reception is clean and welcoming and the reception staff were extremely helpful, not only with the rooms but also in providing maps, advice on travel and sightseeing and booking tickets. The rooms were nice, we had a top floor attic-style room. The room was clean, roomy and fairly well equipped, it had all we neeed as somewhere to sleep, shower and dress. Breakfast was fine, it was the usual mix of breads, pastries, cold meats and cheeses plus scrambled eggs and sausages, plus drinks, toast etc, all on a self service buffet basis. We didn't eat in the hotel restaurant so we can't comment on this, as you'd expect there are hundreds of places to eat all around the city We loved Barcelona and if we go back there again we would definitely book the San Agustin again. Top sightseeing - the harbour, the fenicular railway and cable car in Montjuic, La Sagrada Familia, the Ramblas. The open top bus ride is well worth doing.", "Date": "September 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Warrington, United Kingdom", "Title": "“Excellent Location”", "Author": "Wendy M", "ReviewID": "UR117312127", "Content": "Excellent location, clean, helpful, would stay here again.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“Ideal for a short break, definitely recommend!!”", "Author": "jakethecake2008", "ReviewID": "UR115799847", "Content": "The hotel from the front is modern and extremely clean. The main lobby is beautifully decorated with a prominent 'stone' theme with stone tiles, pillars and rendered walls.. THE GOOD! - The staff are extremely caring and always help you find the best deals! They think logically and can offer personal opinions on places to eat and visit. They spoke fluent English which is always handy when you're surrounded by a different language! - There are computers available with superfast internet connection which incurs no extra cost! - The 'continental' breakfast was amazing! I was extremely satisfied and surprised by the extensive choice and quality of the breakfas! I was expecting a piece of toast, cup of tea and a croissant if you were lucky! But I was greeted to various pastries, toast, a hot buffet consisting of sausages and scrambled egg and a wide variety of juices, yogurts and cereal! - The air conditioning worked amazingly well, and is definitely needed during the hot summer! The only downside is that it is rather noisy when you're trying to get to sleep, but hey, all air con systems are noisy! - The TV was perfect, but there were few english speaking channels, 2 out of 16! - The bathroom had everything you needed, including a bath, and was extremely clean! -The previous reviews about a smell of sewage around the hotel obviously haven't visited mediterranean cities before! I smelt no sewage, only a typical mediterranean city smell which from experience is a very faint tinge of rubbish, but seeming as the whole city is very densely populated, this was expected! -The rumours of homeless people outside the hotel were non-existent, i looked but could not find any! -The walls were not paper thin, I never heard a peep out of our neighbours! THE BAD - I would have preferred to sleep on bricks as oppose to those pillows and mattress, the pillow was hard and could uncomfortably bend your neck when sleeping, bring your own pillow! -The lights in the corridor of the rooms were on sensors, so the place looks dark as even during the day, the sensors were on! - I can't find any more, this place was amazing! Overall, I would recommend this hotel for people staying for short city breaks, its close proximity to La Rambla really helped!", "Date": "July 26, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Bratislava, Slovakia", "Title": "“Not worth such price! Even the location is great...”", "Author": "adricka", "ReviewID": "UR102522512", "Content": "Our trip was kind of a last minute decision and we tried to be as \"central\" as possible and didn`t want to spend time by traveling from-to in the city. As everything else was already booked, we decided to go to San Augustin, even if this had confusing and not very positive reviews here.. The location is PERFECT! If you want to stay close to La Ramla, but not right above the noisy street, just go here. It is 2 min walking from La Rambla, very close to the unique and charming food market. San Augustin plaza is quiet place next to the church and small shops, so location can be any better. But...the hotel has very small rooms, where we can hardly move. It was quiet claustrophobic. We had terrible room with only dormer window. Very dark and depressive. So if you book, ask for a room with the \"plaza view\". These room might be even bigger. The corridor floor is made of \"noisy material\" so every single time someone walks the corridor with the wheel luggage, it drives you nuts!! Poor breakfast and not such friendly staff. Definitely not worth such price!", "Date": "April 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“Excellent hotel, will be back!”", "Author": "brettnu", "ReviewID": "UR101760871", "Content": "Myself and my partner stayed in this hotel in August 2010, and we could not recommend it higher. Reception staff were very welcoming, and helped arrange for us to book tours of the Nou Camp, La Sagrada Familia and Park Guell, even contacting the company on our behalf. The rooms were clean, roomy and well air-conditioned. You couldn't ask for a better location - approximately 50 metres from La Ramblas, with easy links to the rest of the city. Breakfast was very nice, not hugely ambitious but tasty, your basic continental breakfast. Our room was based on the third floor overlooking the square, for those who are worried about noise we found that we were not disturbed by nightlife during our stay. Not a 5-star hotel by any means, but if you are interested in reasonably-priced hotels in an excellent location in Barcelona this one fits the bill. Highly recommended for weekend breaks.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Ahhh Barcelona”", "Author": "eberbach96", "ReviewID": "UR90689684", "Content": "We arrived very late in then evening or very early in the morning depending on your point of view. However our late arrival was met with kindness and understanding and we were soon shown to our room. This was a blessing as we had endured a very disjointed train trip from Lyon. The room was beautiful, very tastefully furnished and spotlessly clean as was the ensuite. I found the room stuffy, but all hotel rooms are this way when you first enter them. We tried to open the window top let in some cool air but all we got was the rather over-exuberant Barcelona nightlife that seems to go on all night. However the hotel is air-conditioned so we turned on the air-conditioning and closed the window for cooler air and a reasonably quiet night. Breakfast the next day was very beautifully presented if a little unadventurous but it was more than adequate for our needs. The location of the hotel is in a square which at night does have its fair share of activity but we never had any trouble. There are many and varied restaurants and tapas bars located nearby so having to travel a long way to eat is totally unnecessary as Las Ramblas is but fifty metres away. WIFI is available and free but does not work very well in the rooms and you really need to be down in the hotel lobby for it to be at its best. We had a lovely five night stay and would recommend this hotel to anyone.", "Date": "December 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Good location...but.........................!”", "Author": "Citytraveller38", "ReviewID": "UR37265175", "Content": "The hotel is situated in a very good location. Our room was lovely and very big...we had a double balcony. It was great to have air conditioning in the room. Breakfast was ok...continental, but then what do you expect. Now comes the bad bit - we were checking out to come home when someone came in and stole my bag - the staff didn't want to know and suddenly couldn't speak or understand a word of English. I would recommend this hotel - but PLEASE keep your eyes and your hands on your valuables!", "Date": "August 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Will definitely stay here again”", "Author": "Murghi", "ReviewID": "UR35956050", "Content": "Stayed here for the weekend. Very central, only yards away from the Las Ramblas. Metro just a hundred yards away, which connects to all mainline stations including the airport. Vey clean, polite staff. Good spread at breakfast. Didnt thave a room with a balcony but didnt mind as we were only there for the weekend. Quiet where we were. One of the reviews of this hotel mentioned that the walls were too thin, this is practically everywhere in almost every hotel in most places but one should never criticise the hotel, its the inconsiderate people that stay in these hotels (we had our share of noise early Sunday morning) who dont give a thought about other guests, Would recommend this hotel and will definitely stay here when we come back to visit Barcelona. Very pleased. Thank you. Mrs J Fernandes", "Date": "July 27, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Suffolk UK", "Title": "“Disappointing hotel in dodgy area”", "Author": "Otuama", "ReviewID": "UR32161665", "Content": "This is meant to be a three star hotel - it's more lik a two star. The rooms are tiny with none of the facilities I would expect from a three star hotel. One small upright chair, for instance in a double room set in a corner with no room to sit and no hotel info in the room. The breakfast was adequate and the staff mostly unsmiling and surly. Worst of all the area around the square is downright dangerous. Not so bad in the daytime when it is full of down and outs but a different story at night. Three out of four nights we were accosted on our way back to the hotel by up to three young men who harrassed and crowded us and attempted to steal our belongings. I would not recommend this hotel - rooms too small, no facilities, surly staff and dangerous area.", "Date": "June 12, 2009"}], "HotelInfo": {"Name": "San Agustin", "HotelURL": "/ShowUserReviews-g187497-d1159343-Reviews-San_Agustin-Barcelona_Catalonia.html", "Price": "$138 - $186*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Plaza San Agustin, 3</span> | <span class=\"extended-address\">Barcelona</span>, <span class=\"locality\"><span property=\"v:postal-code\">8001</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "1159343", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/fc/4e/fc4e1f7fc3a3ab142806a8170b6e648c2large.jpg"}}