{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Stylish but not very convenient”", "Author": "RhinelandAway", "ReviewID": "UR127417810", "Content": "Stayed there for one night during a business trip, found the room extremely small. One comfortable bed and just enough Space to walk around. The bathroom again was spacious. I came to have breakfast at 7.30am, the restaurant had just opened and not everything was available yet. Checkout inefficient because only one staff handling it. Probably good Hotel for a sightseeing trip but not recommended for Business travellers.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Seychelles", "Title": "“COOL HOTEL”", "Author": "mktgcove", "ReviewID": "UR126220363", "Content": "I've checked out this morning. Really cool hotel. Close to metro station (Repubblica) and not too far from Termini train station. The hotel is very modern and a bit chic! Rooms are not huge but well furbished (if you like this particular style). A bit too hot (i had to leave the window open at night). Very clean. Personnel polite and kind. Very helpful in giving directions and helping out. Breakfast is more than good. Conference center is fine.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "", "Title": "“Hip hotel near the termini”", "Author": "amatavivadhana", "ReviewID": "UR125668421", "Content": "Hip & convenience for a quick visit to Rome as it is near the train terminal but the WIFI service could be better.. Suitable for young travelers.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "PARIS", "Title": "“Great place to stay in Rome...”", "Author": "maffsf", "ReviewID": "UR125634710", "Content": "The Leon's Place Hotel in Rome was a great experience... Elegant, charming and very nice reception. The Hotel is quite central but don't forget that Rome is quite impossible to visit by foot and that because of it's major archeological history de underground Metro is quite inexistent so you have 2 solutions to visit all of Rome: Rent a Vespa (best way) or rent a small car... At the hotel breakfast is great and served from 7.30 to 10.00... The Bar is the only place I never used, but who needs it when you have Rome to visit? ... Don't hesitate in choosing Leon's Place! I was afraid of some note I saw here and I went anyway... and I really don't regret it a bit!!!", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Baden, Switzerland", "Title": "“Wonderful Hotel”", "Author": "Natluvskay", "ReviewID": "UR120829661", "Content": "Really nice staff, beautiful scene in the Hotel Lobby. All very shiny and clean. Very comfortable beds. The rooms are not too big but sufficient. Over all very cosy and also very clean. I couldn't find anything to complain. The only thing that gives a negative idea is. They only have WLAN in the Lobby and no Business Center where you can go online. Although they offered us to go in the back of their office to solve an issue we had. The Hotel is a bit far out of the Center if you don't like to walk. We loved walking so it wasn't a problem at all.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Devon, UK", "Title": "“Good hotel, a few minor drawbacks”", "Author": "pinkpidgin", "ReviewID": "UR120025269", "Content": "There are certainly more central hotels in Rome which are more convenient for a sightseeing trip but the location of Leon's Place is not too bad. The area is close to Termini station and has a good range of shops and restaurants nearby. It is about 20 minutes’ walk to the Trevi fountain and 15 minutes from the Villa Borghese. There are metro stops quite close for travel to the Colosseum and Vatican. The room was a good size and very clean. I enjoyed having a small terrace looking out onto the central courtyard. The bed was very firm (a mattress topper would be nice) but the pillows and duvet were good quality and comfy. The bathroom was clean and light but there was no window covering and, despite the middle of the floor-ceiling height window being frosted, I felt a little exposed. Fortunately I was able to hang a towel up for some extra modesty. The show was good but the bath did not drain very quickly leaving me standing in several inches of water. The toiletries were nice but I would have liked some hair conditioner. Breakfast was very good, a selection of fresh fruit, yoghurt, cereals, pastries, cake, bread, cheese, meat, eggs and bacon as well as juices, tea, coffee and water. Service was excellent, the staff were very friendly and helpful but the hotel website needs to provide more information such as what facilities are available in the rooms. I also would have preferred it if my towels were not changed if I had hung them up as I find this an unnecessary waste. Unfortunately the wifi was non-existent even in the lobby which was not practical for a business trip.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nicosia, Cyprus", "Title": "“Leon's staff best asset”", "Author": "zach006", "ReviewID": "UR119974657", "Content": "About 20 min walk from shopping and historic rome, location with many good restaurants within a few minutes walking radius in a safe neighbourhood. Superior room neither big nor small clean and well appointed with quality ammenities. Breakfast very descent. Above all polite professional but friendly staff at reception, breakfast, bar and housekeeping (4 nights stay experience). taxi fare to anywhere sites and shopping 5-10 euro.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Milan, Italy", "Title": "“Great design hotel in a good location”", "Author": "Viviana L.", "ReviewID": "UR119719811", "Content": "I'm just back from a great week end in Rome at Leon's Place. The hotel is well-located, at walking distance from Fontana di Trevi (about 10/15mins) and Trinità dei Monti. When entering the hotel, I was impressed by the enormous black velvet swing hanging from the central chandelier, made of elegant crystals. Crossing the hall, at the end of the common areas, you find the cocktail bar; the counter is fantastic, entirely decorated with silver mosaics that change colors, reflecting the lights. Our room was decorated in pearl-grey tone and had a private balcony. The morning breakfast was really very good, with excellent fresh fruits, yogurt, croissants and pastries. All the staff ad the people working at the hotel, were really friendly and did their best to make our staying as pleasant as possible. I really enjoyed my staying at Leon's Place and I recommend this hotel.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“5 nights at Leon's Place Rome”", "Author": "Kevlee2022", "ReviewID": "UR118582612", "Content": "A Lovely boutique Hotel. 56 rooms in all. The rooms are very clean and nicely decorated. The air conditioning was a God send, as we had 31 degrees celsius and after a day out sightseeing, it was lovely to come back to our comfortable cool room. Being a small hotel, sometimes we felt like the only people in the hotel! The staff were very welcoming and helpful. Our barman Alexandross was very entertaining and friendly. My only warning would be that although the hotel is situated in Rome, it is about 1.5 kms to Republic Square, which is more or less the start of all the sites you will be wanting to see. We managed to walk most places, but sometimes we would have like to been closer to the places we were wanting to see. But in saying that, it was lovely to be able to come away from the throng of people and noise. So you just have to decide what is more important to you. We do highly recommend this lovely hotel.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Beautiful boutique hotel - poor internet”", "Author": "jnsnsf", "ReviewID": "UR118545293", "Content": "Beautiful spaces - great rooms. Not for business travelers as internet is not great and as stated below, two people can't work at same time. But enjoyed the hotel and staff was great. Not in the middle of old town / heavy tourist areas but we liked that and walked everywhere. Close to train station and park. Would definitely recommend and go back. And again, the design was gorgeous. and great linens...:)", "Date": "September 24, 2011"}, {"Ratings": {"Location": "3", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“Great hotel, but a little too off beaten track”", "Author": "R_Kar", "ReviewID": "UR118122825", "Content": "If I return to Rome I will choose somewhere more central to stay. It was a bit of a trek in the evening to find a restaurant and after a hard days pavement pounding around all of the historic sites that Rome has to offer I really didn't need this. However, it was a lovely hotel with a great look, good breakfast and bar and helpful staff. The room was clean and stylish, although not much practical space to put clothes. If you want to be in a quiet area of Rome then this is a good spot, if you want to be in the heart of things in the evening where you can do some people watching, then you need to be more central.", "Date": "September 14, 2011"}, {"Ratings": {"Location": "5", "Overall": "3.0", "Value": "2", "Service": "2", "Rooms": "3"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Pity about the poor internet”", "Author": "wombat1", "ReviewID": "UR118066369", "Content": "We liked this hotel, great location, spacious room, comfortable bed, wonderful shower rose, even if above the bath, turndowns each night, friendly staff and a buffet breakfast included in the rate. Unfortunately the internet which is exceptionally slow and needs to be paid for each time it is used frustrated us. In addition, if there are two of you using internet in the same room, you cannot work simultaneously and each time you log out you need to request reception to generate another code and incur another charge. Disappointing for this quality of hotel. We also had no desk or worktable of any sort in our room. Sky and Sky Sport were also the only English speaking channels which is limiting for English speaking guests not from the United Kingdom. We had the opportunity of meeting other guests at the hotel who shared our frustration. I would be reluctant to recommend this hotel for guests on business.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Torquay, United Kingdom", "Title": "“Glamourous bedroom but where was the restaurant”", "Author": "Steve R", "ReviewID": "UR117242878", "Content": "Arrived about 17.00pm local time, upon entering the foyer my wife and myself were blown away by this chic, cool and ultra modern hotel. Asked reception if we could book a table in their 'fine restaurant' only to be told they 'don't have a restaurant but we could make a sandwich', we were shocked to say the least and assumed we had mistakenly thought the hotel had a restaurant when in fact it didn't. Room was stunning, mirrors everywhere and very quiet. Great bed for a great nights sleep. Only problem with the room was the bathroom window was broken and wouldn't open, not a big problem though. Upset about the restaurant as we didn't want to trek half the night looking for something to eat. Enquired about the fitness room but was informed it was out of service and could not be used and it stayed out of service for our full four day stay. Cold breakfast was good. Hotel was extraordinarily quiet, which was fine by us. The highlight of our stay was making the acquaintance of the fantastic Matteo, the bar manager. Nothing was too much trouble for this guy and made us feel so at home, waited on us hand and foot and recommended some great eateries. He should be the head of a five star hotel this guy. Overall, great hotel but I think it lacks some investment. However, imagine our disgust when we returned home to discover the brochure said that the hotel had a 'fine restaurant' and the Leon's Place website stated that 'in the restaurant you can enjoy a degustation dinner choosing between many refined cuisines'. Both very misleading as they don't have a functioning restaurant, only a breakfast room. Very disappointing.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Thetford, United Kingdom", "Title": "“Very stylish”", "Author": "jfwfish82", "ReviewID": "UR116306038", "Content": "Leon's place is a beautiful hotel, Everything has been designed to impress and it certainly did. I spent four days here with my new wife and they were very enjoyable and comfortable. We walked round the whole of Rome several times from our hotel so It's ideally placed to sight see if you like making your own way. Breakfast was very nice with plenty to choose from. The staff were helpful and informative. The negative points i have was things were a little bit pricey for me but if you want all the style and the atmosphere i suppose you have to pay for it. And the road outside our room was a little too noisy at rush hour.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Nice design, but not user friendly”", "Author": "IMNash", "ReviewID": "UR115818523", "Content": "Pros - breakfast is really delicious Cons - rooms in the basement have no windows (they have lots of mirrors that makes them look like night clubs) - some rooms look on a patio 2x2m that is dark - yes, it has a window, but you don't even realize it - they don't have an iron - the only international channel is SkyNews, all others are in Italian - no WiFi (even for a fee) - the shower head is right above the sink - you can't shower and let the water drain at the same time - carpeting was dirty", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Awesome Wonderful Rome Experience!”", "Author": "BrookMeakins", "ReviewID": "UR114917422", "Content": "I really loved Leon's Place Hotel- the staff was unbeatable, the decor was pretty, fashionable, and not worn down like some of the modern boutique hotels, the location was fantastic, and the price was right. And, I loved my balcony. This was a terrific hotel (I have plenty of pictures if you're interested), and I think that it is a wonderful alternative to the tacky, overdone, overly dramatic options in Rome. I will definitely be back!", "Date": "June 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Elegant hotel,fab bar”", "Author": "A TripAdvisor Member", "ReviewID": "UR105359079", "Content": "My hubby and I stayed at this hotel over Easter, the staff were all very helpful. Alessandro the barman made a fab Bellini and the bar nibbles were a nice touch. The room was nice maybe a bit on the small side, but hey we only slept in there. Breakfast was limited for something hot. Would def recommend.", "Date": "April 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Wondeful boutique hotel away from the bustle of the main tourist area”", "Author": "AC_globalnomad", "ReviewID": "UR104896715", "Content": "I am so glad I chose to stay at this hotel, despite having read certain negative reviews on this site. My room (incl bathroom) was clean, functional and trendy and the bed was of adequate size, very comfortable with high quality linens, all meeting the high standards I expect from Hotel Philosophy/Design Hotel group of boutique hotels. I enjoy walking and prefer to stay away from busy & loud tourisy areas, so this quiet & safe location was perfect for me and I found restaurants in this area more reasonably priced and less touristy. I also found the reception staff very friendly & helpful (I dont agree with negative reviews posted by others in the past). My least favorite was quality of buffet breakfast, although coffee was great. Overall, in my view this is a wonderful boutique hotel that offers great value, comfort & luxury in rather expensive Rome.", "Date": "April 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“A perfect choice”", "Author": "OCNB", "ReviewID": "UR101726263", "Content": "I spent also two months researching hotels in rome. Trying to find a hotel with the right balance between a boutique hotel, which is well located and reasonably priced is always a challenge. I have to admit that this hotel was worth every penny. I could be pernickety and find bits and bobs which were not perfect but all in all i would strongly recommend this hotel. The rooms are clean and spacious. The bed is very comfortable and very large! The style of the room is extremely relaxing and modern - everything you should expect from a design hotel/ boutique hotel. The rooms and bathroom is cleaned regularly and the products are replaced during every cleaning session. The hotel is well located - max 30 mins walk from the key sites. Breakfast is a little boring but let's be honest - you don't go to rome for breakfast! Great coffee though. Hotel staff was extremely helpful and friendly. All in all a great experience.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "HK", "Title": "“ok location, nice room if you don't book the cheapest”", "Author": "Skyline_88", "ReviewID": "UR96388203", "Content": "Stayed here for 3 nights en route to Florence. Location is slightly out of the way, but still acceptable to be considered \"convenient\" From comments on this site and elsewhere, I was cautious not to book the cheapest room, which appears to only have a ceiling lightbox, and no windows. The room we had was find, with large windows. The bed was one of the best. I am surprised by some of the comments by other contributors about the lack of service. On the contrary, I found the staff to be great, but in the usual Italian \"god I am so cool\" way. Once you know the only way to deal with Italian staff is to remind them they are just staff and that you can do the \"god I am so cool\" thing even better then them, then it will all be fine! Breakfast was fine though the purple upholstery is a bit strong with the morning cappucino. One annoying thing is that the hotel makes a point of emphasizing their nice bar. However, for 2 of the 3 nights we were there, there were private functions, so we could not actually use it. However, the manager recognised us from our first night, and we were ushered to a private corner of the bar, so all was well.", "Date": "February 12, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Qatar", "Title": "“Definitively not up to design hotels standards”", "Author": "Bugieinfuga", "ReviewID": "UR92845002", "Content": "I spent two nights at the Leon's Place and I was very disappointed: - unfriendly front desk and welcome - single room is so small you can not even open you luggage - wifi (not free) only in the lobby - the heating is not easy to control (either too hot or too cold) - the breakfast is poor given the hotel category - the bar served me a mojito prepared with salt instead of sugar - the gym and spa is not open 24/7, you must book it in advance to let them get ready On top of this, the location does not provide cafes, shops and restaurants at a walking distance.", "Date": "January 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Paris", "Title": "“Great hotel but could do with a friendlier front desk”", "Author": "FERU06", "ReviewID": "UR86342503", "Content": "We just stayed 3 nights at Leon s place. The taxi had no idea where it was so he left us a few numbers away from number 90 where the hotel is, only for us to realize that the few numbers were actually equivalent to quite a few hundred meters... Location is one of the downfall of the hotel. Though you can still get to the subway Republica or the main Termini station by foot, it takes easily 10 to 15 minutes to reach any of these stations. Moreover all the main attractions of Rome are quite far away from the hotel, meaning you either get a cab or have to walk back and from the subway station, which is fine when you are fresh in the morning but can easily become dreadful after a whole day walking within the center of Rome. The direct neighborhood of the hotel does have a few restaurants but it s still a very quite neighborhood with nothing much. The other downfall of the hotel is the front desk. While the staff is quite friendly when calling guests relations on the phone, somehow when you actually face the staff at the front desk, they are all very stiff without a smile and even close to being unfriendly. On check in for instance, while it is done quickly and efficiently, there is not a single welcome or smile or friendly chit chat which you would expect from a hotel of that standard. Same goes for check out, not a single thank you for staying with us, not even bye bye. They just ask you for the mini bar, give you the amount, take your card and give you back your receipt.....It just can t be worse. But well apart from location and front desk staff, the hotel itself is beautiful. The lobby is great and the design of the rooms is just gorgeous. The bed was great and as far as our room was concerned, we did not have much noise problems despite being right next to the elevator. The only strange thing was that there was no boiler with complimentary tea and coffee which has long become standard in hotels of that category. The bathroom was also great with a rain shower, perhaps efforts could be done on the amenities kit as you need to ask for a toothbrush or a comb, which is very unconvenient as you usually realize you need these early in the morning or late at night. Overall it is still a fine hotel. If the front desk was on par with its design, this hotel would really be superb. I guess they ll just need to work on this. As for location, well I guess for those whose purpose in Rome is to do as much sightseeing as they can, then this hotel might not be the best choice.", "Date": "November 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Great Hotel”", "Author": "grabcsma", "ReviewID": "UR82942641", "Content": "The hotel was great and not as far out as we expected given other reviews. Our taxi driver didn't know the hotel as its so new. Lots of mirrors and marble very chic. Accommodation was great and very quiet so we were not disturbed by road noise The breakfast is fine 4 meats 4 cerals 3 juices cheeses yogurts etc and a choice of freshly cooked boiled eggs or scambled eggs and bacon. It is typical of most Italian hotel breakfasts. There is a lovely restuarant just round the corner 75 metres from the front door Cafe Vicenza full of locals eating there and service was good and food very local. Used the 110 open top bus service 20euros for 48 hours great way to find your way round if on a short visit like us but the comentary was dull and relied on who had built what when. There companies who offer a personal service and I think if we went back we wouldtry that next time. You do get overdosed on old buildings but that is the point of going to Rome. Don't miss the Trevi Fountain my personal favourate spot but it was very busy both time we went Food and Drinks very expensive everywhere but again its a major tourist city so pay up and look big!", "Date": "October 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Romantic, sylish hotel - within easy reach of central Rome!”", "Author": "Ali_23h", "ReviewID": "UR81171584", "Content": "We stayed 5 nights at this hotel and really enjoyed the whole stay, we were looked after well and had no complaints at all. The hotel is located about a 15 minute walk from Central Rome. It’s a good base from which to explore the sights of amazing Rome. Our room was lovely and comfy and there was a turndown service each night. The bar was good for a quick drink before venturing out for the evening, with good attentive staff. Breakfast was great, a very wide selection of almost everything you could imagine; fresh fruit, pastries, cold meat, cheese etc. There are a few very nice local restaurants, close to the hotel, so you don’t have to go into Rome each night to eat if you don’t feel like the walk. We hired a car and parking was easy around the hotel. Recommend highly for a romantic trip to Rome!", "Date": "September 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Preston, United Kingdom", "Title": "“Beautiful Hotel, highly recommended”", "Author": "MrsJonesManchester", "ReviewID": "UR65714401", "Content": "We stated here for 4 nights at the end of May. The hotel is beautifully designed, just as it is portrayed in the marketing photographs. The staff were all very helpful and friendly providing advise for eating out, sightseeing and travel arrangements. Our room was great and had a very comfy bed. Breakfast was plentyful and stays open until 10:30, so was great for the leisure traveler. The hotel bar was particularly gorgeous and the barman could not do enough for us. Loved it and loved Rome - would go back tomorrow!", "Date": "May 29, 2010"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Milan, Italy", "Title": "“TERRIBLE EXPERIENCE”", "Author": "nihaomahenhao", "ReviewID": "UR64832573", "Content": "Staff is unfriendly, breakfast very poor. Don't ask for the alarm clock in the morning because it is manual and they forget to call you all the time.. I had an embarrassing experience after having lived in the hotel for one month. My agency made a mistake and booked one day less than I should stay. I told them that I had to stay one more night, but they came up with my suitcase in one hand and all my clothes picked from the closet in the other one. As I obviously could not go out in Rome with 5 shirts and a suit pending from my hand, I told them that I needed to put my clothes inside the suitcase. They didn't even bothered, and I had to fold my shirts and put them in the suitcase just in the reception bar. It was a very embarrassing experience having to that in front of all the guests. After having been living in that hotel for a month, I was expecting a better service. THEY HAVE THE WORST CUSTOMER SERVICE EVER", "Date": "May 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Great Hotel, Trendy Design and helpful Staff - for good value!”", "Author": "bububub", "ReviewID": "UR62730070", "Content": "My partner and I visited Rome for the first time last summer - I have traveled extensively in Italy (and globally) and must say that we had a really great stay at this hotel! The hotel's interior - esp the rooms, is dark, trendy and elegant, and we were upgraded to a better room with a small balcony free of charge. I didn't try the breakfast, but we thought the staff was a bit busy (and sometimes over-stretched) but generally very helpful. Compared to the prices to some of the other stiffer hotels this was definitely value for money!", "Date": "April 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Milton Keynes, England", "Title": "“Design over function”", "Author": "robski_korsikoff", "ReviewID": "UR60188737", "Content": "I have travelled on business to Rome many times in the last 4 years, mostly being lucky enough to stay in one of the top 5 star hotels (Westin, Baglioni, St Regis Grand etc). However, recent pressures on expense budgets (no surprise) has led to my company travel team looking to find 'bargains'. So, at the end of March 2010 I had my first stay at Leon's Place. This is a hotel where 'design over function' seems to be the key theme. There are mirrors everywhere....from reception (where the huge mirror is also a flat screen TV), to the bar, to the lift, to the bathrooms, to the bedrooms (including the doors of the wardrobe and its entire interior!). The seats in reception and the bar look fabulous but are not particularly comfortable. The sink in the bathroom is very shallow and I almost had a flooded bathroom when I was brushing my teeth as there is no overflow in the sink! But, I suppose if you are into that sort of thing, then maybe it is for you....(the mirrors, not the sink....) Check-in and check-out were both smooth and quick. I did have a couple of good night's sleep, although be warned the mattresses are on the firm side. Also, the room was a little warm, and although it did not bother me, a colleague could not activate the air con in his room and was told by reception everything was still on a winter setting so nothing could be done. Not particularly satisfactory. The room itself was small, with the double bed almost filling the floor space, however, there was a flat screen TV on the wall with a number of TV channels available. As many other reviewers have posted, breakfast is not great. There is a very limited choice of cereals and breads but it has to be said that the fresh fruit was VERY fresh and lovely. There was no hot buffet selection, although I was offered scrambled eggs on my second morning....although this had not been offered to me the morning before. Staff on reception were very helpful, reserving tables for us at restaturants and ordering cabs as and when required. Location is OK - about a 15 minute walk to the Trevi Fountain. And for those business travellers out there - there is no busines centre! But that;s not really a criticism, as business travellers are not this hotel's target audience. In a nutshell, I wouldn't go back for business and I wouldn't go back with my whole family. However, I would consider taking my wife on a romantic break here as the room rates are reasonable for central Rome. Nevertheless, I would see what rates i could get at the 5 star hotels mentioned at the top of this review before booking!", "Date": "April 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "luanda", "Title": "“Great Design but”", "Author": "rviegas", "ReviewID": "UR50936693", "Content": "Trendy hotel good ambience but very poor breakfast for the price and finally the heating system didn´t work very well Don´t know if next time at rome will stay at this hotel", "Date": "December 9, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Sexiest Hotel in Rome”", "Author": "AdrianneK", "ReviewID": "UR49705726", "Content": "We stayed at Leon's Place after checking out of a so-called 4 star hotel which was a dump. Leon's is uber trendy...one of the leading designer hotels of the world group...lots of black, shiny mirrors and chandeliers giving it a sexy nightclub feel. The staff were very friendly and helpful. The breakfast was more gourmet than standard hotel fare and included eggs made to order and freshly squeezed orange juice. Beautiful bed and pillows made us feel like we were sleeping on a cloud. Even the complimentary hotel slippers were of a good quality. The bathroom was quite spacious, including a bath tub and shower, toilet and bidet, although the bedroom is just big enough for the bed for 2. Overall, LOVED IT and would stay again.", "Date": "November 20, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "2", "Rooms": "4"}, "AuthorLocation": "Portugal", "Title": "“Good hotel but...”", "Author": "Kate2005", "ReviewID": "UR46568804", "Content": "We stayed 4 nights at this hotel and we must say that is good value for money. Great rooms (but small), funtastic bathroom and nice staff. The bad news: small and poor breakfast; Good location if you like to walk...", "Date": "October 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kiev, Ukraine", "Title": "“Perfect design”", "Author": "Afina79", "ReviewID": "UR23204576", "Content": "We've been to this hotel with my husband (me-29, he-37 years old). I looked for the small design hotel and design was one of the main criteria. So this criteria was perfectly matched, starting with the reception and up to the room. We booked standard double,but were kindly upgraded to the suite,as it seemed that we were the only guests in the hotel :) ,as it is brand new and just working on attracting the clients. The room was very nice with a comfortable bed, but a bit noisy at night due to bad noise isolation. There was no information in the room on how to call any hotel services from the room,so we had to go to the reception all the time we needed help instead of calling them . We also found out that they have wi-fi the last day just by chance, as there was no sign or info anywhere in the room as well. Also it was very hot in the room, but by my experience it looks like all the hotels in Italy have this problem in the winter, as they are not allowed to turn the conditioning on by law during this season, as we were explained. I also was surprised with a very scarse breakfast - just some bread, 1 type of cheese and salumi, cereals, joghurts, 1 type of juice, water and fruit salad. I got used to more substantial breakfasts, so had to pay additionally for my omlet or scrambled eggs. Honestly, I thought, that if you pay such a high price for the room, good breakfast should be a must... So that was a nuisance. The staff was very helpful and nice - helped us with restaurants (the hotel doesn't have its own so far), car rental, parkings, vine shop just around the corner (Trimani - highly recommended!), etc. So overall, we liked the stay (but for the breakfast), but the hotel should do something with the noise from the street heard in the room and also with the elevator, which was quite scary, as the noise, which it produced during the move, made me think, that it has to be repaired obviously, which is inappropriate for the luxury hotel.", "Date": "January 2, 2009"}], "HotelInfo": {"Name": "Leon's Place Hotel", "HotelURL": "/ShowUserReviews-g187791-d1160903-Reviews-Leon_s_Place_Hotel-Rome_Lazio.html", "Price": "$184 - $369*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via 20 Settembre 90/94</span>, <span class=\"locality\"><span property=\"v:postal-code\">00187</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "1160903", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/cd/fe/d2/hall.jpg"}}