{"Reviews": [{"Content": "Cute and gorgeous! Jati Homestay was reccomended by The Lonely Planet so my hubby and i decided to give it a go. We had been staying at the stunning Sofitel in Seminyak and wanted to try some cheaper accomodation.I would reccomed this place to anyone. It is cheap, basic and very clean. It is run by a friendly man called Willie who speaks very good English. The homestay is off the main road and has a range of accomodation centered around a beautiful, peaceful garden courtyard. Our room had aircon, safe, hot water and a very clean cooking/kitchenette setting in the kitchen. We felt like we were in our own little Balinese hut with a cute little patio where we had breakfast and afternoon Bingtang looking out over the garden. It was very peaceful, we only saw a few other people there. There is a lovely little pool out the back too. We hired bikes and rode around Sanur, the people are friendly and it is a cruizey, laid back place. Not for heavy partying but there are alot of bars and eateries everywhere. The beach has white sand but you need to swim at high tide otherwise there is only 1 foot of water. No surf when we were there but i don't think it is much of a surfing destination. We ate at The Stars Bar and Bistro which was on the main road near Jati. The atmosphere was lovely, they gave us a welcome drink, the food was good and well priced. We negotiated with a green bemo driver to drive us to Nusa Dua for 100,000. A good experience all round.", "Date": "Nov 8, 2008", "ReviewID": "UR807455236", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "3"}, "Author": "EllyandChris"}, {"Content": "A Great Budget Place with a Super Location We ended up staying at Jati Homestay for a few weeks because the family and staff there are so friendly  the location is perfect for seeing all the sites that Ubud has to offer. For those on a budget this family run guest house on Hanoman Street is hard to beat - plus every room comes with a lovely rice paddy view - Highly recommended!", "Date": "Sep 12, 2008", "ReviewID": "UR505516202", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "obake"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g297701-d1161671-r21660877-Jati_Home_Stay-Ubud_Bali.html", "HotelID": "1161671", "Price": "Unkonwn"}}