{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Herning, Denmark", "Title": "“Good value”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR126889803", "Content": "It was very cheap, and therefore the little room without any windows was ok. Wall's er very thin, so you can hear everything, that is happening in the house. Also when the other guests next door arrives at 2.30 in the night, and celebrates the arrival with a bit of gymnastics for two. Service at the reception is good. I would stay here again.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Location": "3"}, "AuthorLocation": "Haifa, Israel", "Title": "“Basic room, budget price”", "Author": "Avi I", "ReviewID": "UR120864808", "Content": "For those who don’t care about fancy room and ‘first class’ set. Rooms & bathroom look renovated, though, they need to invest bit more in the room furniture. Hotel guests were couples (young and older), and families (no small kids) from France, Sweden, Spain, etc. Was out of the season, so, price was relatively low. Location is OK. 15 min. walk to the La Rambla. 3 min. walk to Parallel Metro station. Many restaurants and minimarket shops around, Bank & and ATM next door. At first I received inner room with inappropriate ventilation. Window turned to the service outlet, and air-condition was off (not needed in this season I was told). The stuff moved me the next day to same type of room but with window to the street, which was much better.", "Date": "November 21, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "2", "Service": "2"}, "AuthorLocation": "xoAveryox", "Title": "“TERRIBLE STAY”", "Author": "xoAveryox", "ReviewID": "UR115992474", "Content": "I stayed in Barcelona for two nights and thought I would give this place a try. Being a student, I was on a budget and thought this place would be ok. When I first arrived the staff was very friendly, the man working the desk provided me with a map and gave me my room key. The place seemed fairly clean and the lobby was ok, but when I got to my room I was not impressed. Although it was small (as I expected it to be), it smelled like raw sewage and it clearly had not been attended to as there were still clumps of hair in the shower (which also leaked water all over the floor). The bed was hard, and the hostel is located near a very noisy street. If you are a light sleeper, bring earplugs! I became sick after a day. On the plus side, the breakfast slection was half decent, lots of muffins, croissants, meats, cheese, juices, toast, yogurt etc. - just be sure to show up early or you will be disappointed. The staff is great and very helpful, except for one elderly man who made me feel EXTREMELY uncomfortable. At first, I thought he was very nice and just joking around, but then became very touchy-feely and even asked if he could kiss me and touch my arm. (Sexual harassment, anyone?) I was meant to leave to the airport at 3, but I became so fed up with the hostel and the location that I decided to leave at noon as I would much rather wait in the airport than stay there a minute longer. If you are looking for a cheap place to crash and don't care about cleanliness or noise, this will be an option for you. Otherwise avoid at all costs. I will NEVER stay here again.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "2.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Dallas, Texas", "Title": "“Average stay”", "Author": "mouni99", "ReviewID": "UR115856029", "Content": "The hostal has a fancy lobby and a fancy break area (with vending machines, a computer and sitting area). However, the room wasn't that fancy. We got a four-people room. The room was very small and we barely had any space for our luggage. The room was very gloomy, which explained how the mold on the blanket came from. The bathroom was small, but acceptable, but the bathtub was very small. The customer service was okay. The female staff in the morning didn't seem that friendly. We asked one of the staff to make a reservation for us and she seem reluctant. The male staff at night was very friendly and more willingly to help. The hostal located in a noisy neighborhood especially during the night. Nearby residence had some sort of gathering everyday and it was very noisy.", "Date": "July 27, 2011"}], "HotelInfo": {"Name": "Hostal Barcelona", "HotelURL": "/ShowUserReviews-g187497-d1170467-Reviews-Hostal_Barcelona-Barcelona_Catalonia.html", "Price": "$60 - $112*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Roser 40</span>, <span class=\"locality\"><span property=\"v:postal-code\">08004</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "1170467", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/b8/e1/b8e1e24da6ed7a5e29ad1c4c0a9bcf5c1large.jpg"}}