{"Reviews": [{"Content": "Wow this place is something special We intended to stay 3 nights but stayed an extra 2 even though our accomodation was prepaid. It was worth the money.The service is friendly with a professional edge, nothing was too much trouble. They booked us restaurants, reccommended activities and when available got the hotel driver to take us.The villas are just beautiful with great attention to detail a four poster bed, home entertainment with flat screen TV. The highlight was our own 15mtr swimming pool. As a couple I would not want to stay in a regular hotel again.Thank you for a truely relaxing fabulous 5 days", "Date": "Jan 6, 2009", "ReviewID": "UR684698346", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Winefan"}, {"Content": "Sweet dreams at SILQ Wish we extended our stay at the SILQ in Seminyak, an upscale area in Bali with quaint arts-and-crafts shops along the major road. We arrived at night, refreshed by a welcome drink at the SILQ open-air lobby and the excellent care of the staff. The buggy ride to our villa was candle lit, with carp swimming in long reflecting pools on either side of the path. It was such a dream. The place done in modern Bali design highlights the Zen aspect of the culture. We had personal butlers, a private lap pool spanning the length of the villa. The place is quiet luxury set amid the rice fields and close enough to the beach, too. It is the newest of the villas in Seminyak and well-worth the stay. Unobtrusive service, prime accommodations, generous breakfasts with fruit baskets replenished daily. With tidy gardens all around, the rooms have individual air-temperature control. Four-poster beds draped with light netting, a down comforter, comfy pillows and beds wrapped in lush linen. What a dream. Modern amenities, too, and the large flat-screen TV is great for viewing movie classics. SILQ is well worth another visit to Bali, a fine base for the island adventure.", "Date": "Nov 16, 2008", "ReviewID": "UR638986043", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "HolidayTraveler001"}, {"Content": "Smooth as SILQ Some friends had been to Bali recently and suggested I try the newly opened Silq in Kerobokan. Being that my friends have very discriminating taste, it was a no brainer for me to heed their advice. And thank God for it! Nothing is more refreshing than genuine sincerity and efficient service! I had the best 3 days ever. The staff was friendly and very profesional. I asked for a few requests like kite surfing, golf reservations, motor bike rental, surfing lessons, etc. There was nothing I could ask that they wouldn't deliver, and with that wonderful Balinese touch. The Villas are impressive, very spacious and tastefully furnished. I will absolutely come back. And I know they will remember I wanted to swim with dolphins in my next trip.", "Date": "Nov 15, 2008", "ReviewID": "UR924494621", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "vegasrealtor"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g608486-d1174271-r23324449-SILQ_Kerobokan_Hotel-Kerobokan_Bali.html", "HotelID": "1174271", "Price": "Unkonwn"}}