{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Troy, Michigan", "Title": "“Fun in the sun.”", "Author": "sailorjeff", "ReviewID": "UR127590997", "Content": "This is a nice property with a beautiful pool area. Nice rooms, and comfortable beds. The lighting is being updated in the bathrooms, and our first room was not well lit for makeup etc. A good value. Fuel right across the street, but a drive for food.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“once again excellent service!!”", "Author": "familyman08_11", "ReviewID": "UR126786995", "Content": "I have stayed here before and chose this hotel again because of how great and professional the front desk staff was throughout my stay, the breakfast still exceeds my expectations, the attendent always made sure everything was fully stocked and asked us if we needed anything one of the days the hotel manager was walking around in the breakfast area making sure everyone was well taken care of! This will always be the hotel i return to in Phoenix! Thanks", "Date": "March 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Could be much better!”", "Author": "RAD1955", "ReviewID": "UR126646899", "Content": "Unfortunately the condition of this hotel detracts from what could be a very nice place. The overwhelming deficiency evolves around the smell and condition of the carpets throughout the property. The entire place smells like too much deodorizer, or perhaps too much carpet cleaner. The carpets are worn, and clearly beyond any possibility of being effectively cleaned (hence the smell of too much carpet cleaner). The elevator smelled so badly that we avoided it and took the stairs instead. Otherwise, the staff was pleasant and accommodating. The computers were down when we checked in and the gentlemen at the desk did a nice job of dealing with a tough situation. The shower in the room had no non-skid on the bottom of the tub. This situation was corrected immediately. However, it's beyond me how a hotel shower could not have this in place! The hot breakfast was good, although I would like to have seen it begin earlier than 7am. With all the hotels in this area, I will probably stay somewhere else next time I'm in the area.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Ganado, Arizona", "Title": "“Not up to par with most Comfort Inns”", "Author": "haynes9", "ReviewID": "UR126524976", "Content": "The good - The staff did their best to be helpful in a tough situation. the beds were extremely comfortable and the room was spacious and clean. The Bad - the front desk staff was overwhelmed and not well trained. It took over 45 minutes for them to get all of our group that we had brought into rooms. The girl helping us even admitted that she did not know what to do. We had traveled for 4 1/2 hours and had a conference to get to that evening. We arrived early enough to get rested, but the check in process was pathetic. One of the rooms had water poring out of a light fixture in the bathroom. One of the ladies in our group was in her late 70's and they moved her from this room to a room upstairs and on the other side of the motel. It was ridiculous to have made this poor older woman have to walk so far to another room because of bad maintenance. The hot breakfast was supposed to start at 7:00 AM. Again, we had a deadline to get to the conference we were attending. They were not ready by 7:00 Am and instead of apologizing, they made excuses as to why they were late and told us to stay away until they were ready. The check out process was, amazingly enough, slower than the check in process. The poor girl checking us out said that her training was not sufficient to help her check our group out. I had to leave and they assured me that bill for the rooms would be as we had planned. Once we got back home, i called to complain and was assured that the person that made the group reservation for us would call me back the next day. that's been over a month ago and I have still not received a call. I will absolutely never bring a group here again. The negatives of this place FAR outweigh the good. I have rarely encountered such poor customer service.", "Date": "March 23, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Very Disappointing”", "Author": "BarryShu", "ReviewID": "UR126349734", "Content": "The Comfort Inn (I'm also a Choice Privilege member) at 2641 W. Union Hills Drive in Phoenix, Arizona 85027 is in deplorable condition. They are renovating yet remain open to capture the Spring Training business. Terrible experience. Toilet doesn't flush, and there is no exhaust fan. The space above the mirror in the bathroom is unpainted, awaiting new fixtures, so the only light is a heat lamp. Substandard all around.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Salem, New Hampshire", "Title": "“Would Love To Stay Here Again”", "Author": "Annelle L", "ReviewID": "UR126184945", "Content": "Check in was smooth and the hotel was very well located. It was clean and comfortable, internet access was good. We would love to stay here again!", "Date": "March 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“very posh and convenient”", "Author": "873laura873", "ReviewID": "UR125898453", "Content": "My Friend And I are traveling from Chicago for the spring training and we arrived late and were very tired from along trip and to our surprise the night attendant at the front desk was a breath of fresh air and very friendly! We slept very nice and had a great breakfast although it was very busy in the Restaraunt but the gentleman host was very nice and the whole staff that we encountered was very accommodating. We will be back Next year! Thank you Comfort Inn and Management for taking time to visit with us during breakfast. Tammy & Laura from Chicago", "Date": "March 10, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Pembroke, Canada", "Title": "“Dog poop!”", "Author": "Fridaythe13th", "ReviewID": "UR125827164", "Content": "The service was rude, hotel was not maintained, ripped carpet, dirty, stained. They did not fix my broken toilet, or loud heater. They made various billing errors. Internet was slow, and no TV channels. People were watching porn in the lobby. Dog poop all up and down the halls. Worse Comfort INN ever.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "South Jordan, Utah", "Title": "“Good Choice”", "Author": "AA H", "ReviewID": "UR124767085", "Content": "Hallways and entry/exit doors were a little worn, but interior of our room was very nicely remodeled and very satisfying.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“enjoyable stay”", "Author": "Karie k", "ReviewID": "UR123374494", "Content": "My family really enjoyed our stay here. It was comfortable and the staff was very friendly and accommodating.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Diego", "Title": "“Wonderful Place”", "Author": "Callie N", "ReviewID": "UR123030759", "Content": "Jane was so helpful, always pleasant and takes extra efforts to make sure your issues or questions are addressed. Courtney is awesome too. Johnny is so great and keeps the dining room immaculate and clean. Just wish I could have stayed a few extra days.", "Date": "January 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Benson, AZ", "Title": "“Great Value and Good hotel”", "Author": "DavidBryan", "ReviewID": "UR122340197", "Content": "Was going to stay at another Comfort Inn in Phoenix, but they lost reservation. Found this jewel!! For New Year's Eve, got a room with king bed & hot breakfast for $55, homemade dinner served buffet style for $6/person, live band with no cover charge, and nice hot tub & pool. So my wife and I spent about $100 TOTAL for a New Year Eve's party with hotel room.", "Date": "December 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Portland, Oregon", "Title": "“Staff and Rooms”", "Author": "familyman08_11", "ReviewID": "UR121666415", "Content": "The staff was very helpful with my accomodations. They helped with getting me info that i needed. Breakfast was awesome! The rooms were comfortable, and large, my bed was very nice. WIll be coming back to stay here!", "Date": "December 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Southern States", "Title": "“Under Reno-Bad Area-Just not Good”", "Author": "franklinmilford", "ReviewID": "UR119183415", "Content": "I arrived after a late flight, finding the place looking abandoned. The front desk clerk was friendly, but unfortunately, could not recommend a restaurant(none nearby), or even fast food. A convenience store across the strret was in the middle of a robbery when I arrived. This is not an area for the squemish. The hallways were papered and taped, in the middleof a reno. I got an old room. Antquated TV, remote did not work, debris in tub, no internet, no business center, not for business travel. Front desk clerk was still polite after being informed I would b leaving 6 days early, as I could not stay there and work. This place may be okay after construction, but for now,stay away", "Date": "October 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Erie, Colorado", "Title": "“Just say \"No\"”", "Author": "barlauco", "ReviewID": "UR115631429", "Content": "We had a reservation using points in a suite for the first 4 days of our stay. When we checked in we were told there was a $3.50/night charge. I was so tired I didn't question it. I thought it was because we were using points. When I went to the front desk to check out of our points reservation and check into our reservation for the other 5 days of our stay ( at $89/night), I was again told the fee applied. I asked what it was. I was told a tax. I said, \"It's not a tax. Taxes are percentages. What is this really?\" The clerk said, \"I don't know. I'm just told to charge it.\" I told her that was bait and switch because they quoted one rate on the internet and then added $3.50 upon arrival. Once you arrive it's generally past their cancel policy so you're stuck. I went back to my room and then called back to the desk. I asked what their early check-out policy was. She said they had none. When she realized we were going to leave, she checked with a manager and they waived the fee. Now about the stay. The heater didn't work properly. There were only about 5 channels on the TV. The free breakfast was sparse. I ended up buying a box of cereal and some yogurt to eat every morning. The hot tub was ice cold. One morning we went to our truck and the car next to us had it's window smashed and some of their belongings were thrown on the ground. We found ourselves searching for things to do so we wouldn't have to go back to the hotel because we didn't want to be there. Basically, the owners are cutting every conceivable thing they can thinking they're saving money. However, we did end up checking out early. They lost that revenue. When we went back to Phoenix 2 more times, we did not stay there. We will be going back to Phoenix in about 2 weeks. We won't stay there. Their \"savings\" have cost them a lot. I wrote to the corporate office to let them know that this hotel does not meet their standards. I was told the hotel would contact me. I've heard nothing. No surprise.", "Date": "July 21, 2011"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Protect your belongings and vehicles”", "Author": "Fredfam", "ReviewID": "UR105674324", "Content": "Our stay ended up being a nightmare. Our 2001 F250 Ford Pickup Truck was stolen right off their parking lot at 8:00 p.m. in the evening. The first question out of my mouth before checking in was \"have you had any problems with theft\" because we were hauling two motorcyles. The clerk told us they have had \"NO PROBLEMS WITH THEFT\". Well not only was our truck stolen that evening, so was another F250 Ford Truck stolen (I have police reports to prove it). Also, since July of 2010, there has been a total of 7 trucks stolen from this lot and a host of vehicles broken into. There are no cameras in the parking lot anywhere and all Management could do was tell us how sorry they were that this incident had happen.", "Date": "April 26, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Inadequate service in a run-down, poorly maintained hotel”", "Author": "vspohn", "ReviewID": "UR100199027", "Content": "Although I made my rerservation for 1 night, upon arri98val I was told that I was a no-show for the previous night and my booking was cancelled. After waiting 40 minutes, I finally got a room. When accessing the room through an outside stairwell we were met with a fould odor in the stairwell and large amounts of filth, gigarette butts and an ororour overflowing trash container. While our room was adequate, the bathroom tub was filthy, rist-stained and much of the porcelain was chipped and missing.", "Date": "March 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Canon City, CO", "Title": "“Worst Hotel I've ever stayed in!”", "Author": "jambini", "ReviewID": "UR98674371", "Content": "I am not one to be picky but this hotel was THE WORST! I specifically looked for a Comfort Inn on this trip - because normally they are fine - but this one was horrible! There was MOLD in the shower, the room was dirty, and the breakfast was a joke!! Woudl NOT recommend this hotel to ANYONE!!", "Date": "March 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vevey, Switzerland", "Title": "“a solid motel”", "Author": "mojave", "ReviewID": "UR96425899", "Content": "I spent 8 nights in this motel. It was a return visit after two years. The motel is not new but generally well maintained, even though the plumbing is overdue for replacement and the carpets - public areas and in my room - badly need an in-depth cleaning, or replacement. The room was spacious and very well laid out, with a clear cut between the bed area and the desk. What I appreciate is a real bathroom, as opposed to a sink iin the bedroom. Well appointed coffee machine, no refrigerator or microwave. Comfortable bed. A fair continental breakfast, included, or optionally a full breakfast menu. Good WiFi. Very pleasant and efficient staff. A very good value for the price. There is a limited menu restaurant, which I did not try.", "Date": "February 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "88001", "Title": "“DISGUSTING!!!!!”", "Author": "TravelRN2010", "ReviewID": "UR93455111", "Content": "If you want second hand smoke lung cancer this is the place to stay! The woman at the desk was HORRIBLE! She was cruel to our situation, which was my brother getting an organ transplant. The rooms were disgusting, smelled, filthy. I found products under the bed that should have been in a XXX store. I never took my shoes off to avoid items left behind on the carpet. The towels had yellow and black stains on them and I tried to avoid using them. I would AVOID this hotel at all costs. The pet allowance is fine, but beware of the feces located outside of every entrance. However, even that would probably smell better than the hallways!", "Date": "January 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "new jersey", "Title": "“slept better than at the hilton”", "Author": "pamf", "ReviewID": "UR88302893", "Content": "We stayed a few nights at a fancy hotel as part of my husband's business. The room smelt like carpet shampoo, the air conditioning barely worked., and they charged me for internet. Didn't sleep at all. Moved to the low cost Comfort Inn. The air conditioning worked great, bed was fine, pillows were fine, internet was slow. Location for us was perfect. Family style diner down the road worked great for us for breakfast. I wasn't expecting fancy just safe and comfortable. Got both.", "Date": "November 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Garden Grove, California", "Title": "“Worth the money”", "Author": "engsahs", "ReviewID": "UR87622835", "Content": "The Bad: system was down the day we came in. It took about 20 to be checked in. the front door in room 124 needs to be replace or fix. The Good: Great overall, room was big, ac i think was new, front desk was very helpfull, breakfast.. for what i paid and the 5 people we were it was good location was good very close to freeway.", "Date": "November 19, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Las Vegas", "Title": "“Not as good as the reviews lead me to believe”", "Author": "paynetraveler", "ReviewID": "UR85316700", "Content": "First the good: Room is large and desk is awesome. Airconditioner works. Breakfast: ? What is everyone talking about? There was no fruit, no oatmeal or hot cereal... only Rice Krispies, lots of breads and bagels and some pasteries (we don't eat that stuff). Hard boiled eggs and a waffle machine. I think there were a couple of juices. My husband and I went to Walmart and bought some milk and a box of whole grain cereal... Someone said you could order your breakfast... we didn't find that to be true at this time. Floors: Do they ever look down? The room's carpet looks great and each day the housekeeper asks if I want her to vaccumn. I say Yes! The hallway floors are hideous and dirty. The Workout room is spacious and has a lot of equipment but the floors have trash strewn about. We heard one of the worker complain that there is new management. I'm wondering if the new management was left with all this disrepair or if it happened with the new management. We read all the previous reviews and decided to stay here. Well, we got the great price but the property is not so great. Internet: Free wifi but don't expect to watch a youtube. Slow.", "Date": "October 29, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "glendale", "Title": "“very misleading advertising”", "Author": "libertas1776", "ReviewID": "UR83985680", "Content": "This hotel is NOT in the \"heart of Phoenix\" -- it is in the distant suburbs -- the heart of PHX is nearly 20 miles away!!", "Date": "October 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tyler, Texas", "Title": "“Onward to Page....but just got off work in Texas, so decided to stay .....”", "Author": "OneSoaringSpirit", "ReviewID": "UR69637019", "Content": "This is a fairly nice hotel to stay at. As indicated in other posts, it is a no frills stay. The room was large, we had a nice breakfast........which is a plus when you are geting up to travel a 7 hour road trip. There is a Fryes' store, and fuel in convienient locations around the hotel. Best of all, it was reasonable, and close to the interstate!", "Date": "July 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Dallas, Texas", "Title": "“NOT up to Choice Hotel Standard - AVOID”", "Author": "Topcat9", "ReviewID": "UR64600415", "Content": "Checked out of this hotel yesterday after a 4 night stay for a wedding. Physical look of the hotel is good and convenient to freeway but nothing else. Many items not in working order, while hotel is clean on the surface don't put your glasses on or walk on carpet without shoes. This hotel appears to either be absolutely the most minimal standards to pass with Choice Hotel brand of Comfort Inn or in some serious financial trouble. My job requires me to use Choice Brands about 70 days our of 90 and I was fooled by the pictures for this hotel which may exist in a \"special photo\" room. I did have a \"suite\" which did have the two sofa's shown in the pics. They are having trouble with the cable and only have a few channels - not including 3 major networks which I have Never seen before! There was NO Flat Screen TV unless it was in some \"photo room\". Sliding doors onto the patio by pool were very difficult to open and close and those were only in the \"Suites\". The beds were SO HARD - we went to the closest Walmart and bought egg crates for everyone and folded them over three times to get some sleep after the first miserable night. The beds haven't been replaced in years according to the manager on duty when we checked in. Don't expect any quality bedding from sheets, pillows and in particular the ugly old bedspread in both rooms. The only likeness to the photos is the color! As I stay with Choice so much I have come to expect certain things from the breakfast. Yogurt, a cereal I recognize rather than pre-assembled bowls of cereal of unknown brands. Usually there is a hot offering - yes there was waffles and grits. \"Grits\"! Very healthy. Usually there is Orange juice and fruit. They served an orange or an apple if you got there early. They did have a sit down table service which was ordered from a menu with a wait staff. The one offering which was part of the free breakfast was powdered dry eggs and mushy hash browns. I have no problem paying for breakfast but after tasting what they served as free items we were not about to eat there again. We bought breakfast foods and stocked the fridge with healthy foods. They need to get Will's Cafe out of the building and at least go with the most basic staples of the Choice Hotel Brand breakfast. The physical plant of this hotel could be so nice and is in a good location. I can see this as a lower class business travler hotel for an overnight. The reason the rooms are inexpensive is you getting what you pay for and I don't believe these rooms were worth the low price. We would have been much happier paying more and getting what we paid for. Additionally, the front desk staff at this hotel have such smart mouths and are so rude they only make a bad situation worse. Our family would never stay at ths Choice Hotel Comfort Inn again without new management and a complete room overhaul. Their advertised amenities are mostly non existant, however the pool looked nice.", "Date": "May 18, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Calgary", "Title": "“Find something else....no frills here!”", "Author": "sunscreen5", "ReviewID": "UR60586248", "Content": "I recently stayed at this hotel and was told over the phone that it was a three-star resort. When I arrived this staff at the front desk were very rude. The hot tub jets were not working, the pool heater was broken until the end of April. None of this was told when the reservation was made. I was in a room where the carpet was so soiled and dirty that I could not take off my shoes. There is one computer available for guests to use however, it is so slow that I was unable to use it. I decided to try out the complimentary breakfast. What I found was powdered eggs, powdered juice( Tang), frozen English muffins that tore apart and crumbled into pieces when you try to toast them and apples. Very poor quality, no herbal teas were offered and all of the cutlery and plates were Styrofoam and plastic. Hardly a three-star experience. I was originally booked for four nights and after staying two nights and having to drive about 20 minutes to find a restaurant, I decided to check out. I found out that as I booked a hotel on a selloff site that I wasn't able to get any money back. As it was $59 a night to stay there, I told them to keep their money and I would not be back. If you are looking to stay in Scottsdale, this hotel is a long drive from there. I will not stay here again.", "Date": "April 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kent, Washington", "Title": "“Pretty Nice Stay”", "Author": "shelbyjo", "ReviewID": "UR54995375", "Content": "I stayed here for 4 days while visiting my daughter for my grandson's 1st birthday. I stayed elsewhere close by the year before at double the price and found the Comfort Inn suite I had to be not just as nice, but better. The suite was very roomy, attractive, comfortable, included fridge and micro with a sink and accessories, was close to the pool, with a private patio. There was a very excellent complimentary hot breakfast every morning and the service was great. Even though close to the freeway, I heard no noise and slept like a log. While traveling alone, I felt completely secure. I will be coming back in March for the birth of my next grandson and will definately stay again. It was great!", "Date": "February 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Peebles, United Kingdom", "Title": "“Great hotel for an overnight stop”", "Author": "EcosseLass", "ReviewID": "UR47685554", "Content": "Easy to find, staff pleasant and rooms large. We were exhausted after travelling for 24 hours from Edinburgh so the big comfy bed was great! Breakfast was good too with a reasonable choice. We had a view of the pool from our room and it looked really nice although we didn't have time to use it. Would stay here again next time we fly into Phoenix.", "Date": "October 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "cambrown66", "Title": "“Everything you would expect”", "Author": "cambrown66", "ReviewID": "UR47498465", "Content": "We have just stayed 5 nights in the Comfort inn. We used a coupon, our rate was $49 for four of us. We had a big room. The hot breakfast was good, it had everything the 9am deadline is strictly enforced. The pool is big, the carpets where clean for a crawling baby ( no soot on his knees) The biggest problem was the TV not enough channels, no proper list of channels. Ultimately it was a problem we could deal with. It was worth every penny. Be warned the tax rates in Phoenix are expensive, they nickle and dime you for almost 15%", "Date": "October 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Butler, TN", "Title": "“Disappointed that we used our points for this hotel”", "Author": "Wataugagal", "ReviewID": "UR45924793", "Content": "Nice big room, but we had a bunch of noisy middle school/high school swim team members in the room next to us that partied until 2:30a or later. Staff did nothing to let them know that they disturbing other guests. Breakfast was late and not as advertised. The only thing warm on this full hot breakfast was an egg w/some cheese sprinkled on it. Did have a waffle machine so you could fix your own waffle. Carpet in hallways need cleaning. Really sorry we used our points at this hotel.", "Date": "October 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "NY", "Title": "“Solid Hotel”", "Author": "NY1124", "ReviewID": "UR41921969", "Content": "Stayed at this hotel for one night with my husband. Hotel is easy to find, and quite convenient, being about 20 min. from the Phoenix Airport. Parking was easy, and the neighborhood felt safe. The staff at check-in, even at 11 at night was friendly and helpful. I was quite surprised with the size of the rooms, as others have mentioned. It was large, with comfortable beds and a good-size bathroom. Bathroom was basic, but served its purpose. Free WiFi was convenient, and worked without any problems. Free breakfast is served each morning, with options including: waffles, bagels, pastries, sausages, eggs, cereal, muffins and juice. Although we did not use the pool, we decided to check it out just for fun, and it looked quite nice. It also had a separate jacuzzi area. Overall, we got a great rate for this place, and it was definitely a good value. If we ever return to the Phoenix area and need a place to stay, I would not hesitate to come here again.", "Date": "September 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Indio CA", "Title": "“great value--a cut above the usual”", "Author": "OceanBreezesSD", "ReviewID": "UR30065324", "Content": "I've stayed in a lot of Comfort Inns and this one is a real winner. The front desk clerk says it used to be the Park Plaza. It's a cut above the usual motel experience. The rooms are large. The bed was comfortable. The pool is large. And it was cheap! My husband and I had a king room for $54 plus tax through comfortinn.com. That includes internet, breakfast and parking. The breakfast area used to be a real restaurant, so it's much more pleasant than the usual motel free-breakfast room. The hot breakfast was a nice touch--little omelets, make your own waffles with strawberry sauce, gravy and biscuits, as well as cold cereal, toast, and some apples and oranges. Our room was quiet-we faced the interior. The other side faces the road, so there probably would be some road noise. We were just spending one night on our way to Sedona. I wish I had brought my swimsuit!", "Date": "May 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Tampa, FL", "Title": "“very nice motel”", "Author": "RonaldTampa_FL", "ReviewID": "UR28272059", "Content": "The room was large and it was very clean and well lit. It did not have a microwave or refrigerator but a nice, full breakfast was included in the morning in pleasant surroundings. The staff provided FREE fresh baked cookies to guests at the desk - a welcome treat.", "Date": "April 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Phoenix", "Title": "“Tmost comfortable bed I have ever slept in!!!”", "Author": "EMADUEN", "ReviewID": "UR26830967", "Content": "We stayed here for 3 days and 2 nights and the bed I have to say was the MOST COMFORTABLE bed I have ever slept in!!! Better then the sleep # bed I had slept in prior to staying here, YES THAT COMFORTABLE!! Curtains make the room really dark, of course when closed. I slept like a baby lol. The room was nice and spacious. Vanity in bathroom which is a PLUS for me. GREAT value and Conveniently located right next to freeway! Good b-fast includes; Juices (orange, apple, & cranberry) or Coffee, Water, Pastries (muffins, bagels, biscuits), Gravy, Omelets (plain), Sausage patties...so you can either make Biscuits and Gravy or a Biscuit and Egg sandwich. They also have shredded cheese so you can put inside your omelet, a microwave so you can heat up (if needed), a waffle maker so you can make your own waffles, fruit for your waffles, jelly, butter, cream cheese, Cereal (Raisin Bran & Froot Loops) can't remeber the others....fresh milk in a pitcher and fresh fruit (apples & oranges). Hot Tub is HUGE. The only thing was that there was no fridge in the rooms, some equipment in the gym weren't wrking, but other then that I would HIGHLY recommend this hotel to anyone! Hope this review helps to make your choice easier. I also have to add....the staff is honest, we accidentally left a GUESS sweater in the room-BRAND NEW! and the cleaning staff turned it in to the front desk so we were able to get it back! =)", "Date": "March 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Regina SK", "Title": "“One of the best we've ever visited”", "Author": "LadyDriver2009", "ReviewID": "UR26773871", "Content": "Found this hotel through friends, booked a room for $49/Night. Upon arrival, upgraded to suite for $69. Sitting room had desk & wet bar, bath was good sized, King bedroom had sliding doors to patio & central courtyard/pool area. Hot tub just steps away. Very quiet & comfortable. Hotel is a tiny bit shabby around the edges but location was good & value was tremendous. Just the basics for breakfast but lots of it & the room where we sat to eat was lovely. Very friendly staff. We'll definitely stay here again!", "Date": "March 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Arizona", "Title": "“Great location, good price, nice rooms”", "Author": "ZonaTraveler", "ReviewID": "UR25198743", "Content": "I booked my room online and got a great deal on a king room with desk for $56. We didn't spend a lot of time in the room, just one night. We enjoyed the pool and the hot tub. The location was in very close driving distance of many restaurants and fairly close to the even we were attending in North Phoenix. The full breakfast was also a nice touch. We really didn't need special service or have any special request, but for a very basic overnight hotel stay, this hotel was perfect for us.", "Date": "February 26, 2009"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Vevey, Switzerland", "Title": "“Good motel, good value”", "Author": "mojave", "ReviewID": "UR24404823", "Content": "I spent five nights in this motel. It is recent, not new, and very well kept. The public areas are nice, the room (one queen) was spacious with much desk space. Breakfast with self-made waffles, eggs, patties, donuts, bagels etc. (no yogurt) was excellent. Staff pleasant, friendly and efficient. No surcharge for receiving faxes, wake-up calls or local/800 calls. Nice pool and jacuzzi. The way all motels should be. I checked nearby comparable motels, this one offered the best price for value.", "Date": "February 9, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "4", "Check in / front desk": "1", "Overall": "1.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Minnesota", "Title": "“What a dump!”", "Author": "travelbugMN03", "ReviewID": "UR21111733", "Content": "My husband and I stayed for only one night during the Christmas Holiday Season last year! We arrived in the evening and the night attendant was more interested in watching what was on television, than checking us in. Walking to our room, we passed a blood stained mattress out in the hallway, propped up against the wall. It was so nasty and gross, and not a small stain (I might add!) We did stay the one night, but I had to phone Expedia the next day to make arrangements to get a refund, for the nights we wouldn't be staying. We couldn't check out of that hotel fast enough! I have nothing positive to say regarding this experience, and I will not forget the bloody mattress. Have the decency to cover it up, or turn the mattress so the guests aren't seeing it! We chose this hotel because it was located fairly close to Metro Center, but not an especially good choice for us when hotel staff have no taste or common decency!", "Date": "October 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Glendale, Arizona", "Title": "“Nicer Than Expected”", "Author": "kmsollom", "ReviewID": "UR15485308", "Content": "We booked a room at this hotel on a Friday night when our AC went out at our house. The price of our \"free wireless internet room\" was decent. The hotel was nicer than expected and a good value for the money. Check-in and check-out were very quick, no wait, and the staff were pleasant and gave us a map to show us where to park so we'd be close to our room. The room was extra spacious, very clean, with a huge desk area, nice big TV, and a chair. Would be an excellent choice for business travelers. The king bed was comfortable with lots of pillows and the room decor was attractive and modern. The only negative: The AC unit was VERY loud and did not run efficiently--the room was either very warm when it was off, and then would get too cold while the unit was running. We had to get up a few times during the night to adjust the temperature and we'd occasionally wake up when it would kick on because of the noise. Other than that, the room exceeded our expectations and we'd definitely stay here again in a pinch.", "Date": "April 30, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Had a great Super Bowl weekend!”", "Author": "SBXLIIChamp", "ReviewID": "UR13530161", "Content": "I stayed at this hotel over the Super Bowl weekend and I was a bit nervous after reading some of the reviews. However, I had a great time! I found the service to be excellent and the hotel very clean. I recommend staying here. And Go Giants!", "Date": "February 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "san leandro, ca", "Title": "“Once again, mystified by the bad reviews...”", "Author": "bizh", "ReviewID": "UR7429200", "Content": "Our room was nice, almost suite-like based on the set up (a desk divided the bed area from the balcony). Very nice pool, restaurant, lobby. The room was clean and pleasant. I can't see how it could be rated below a 3 though I'd be mad too if I had been put in a smoking room being a non-smoker. Another plus is it was located near a bunch of restaurants and shops (one more exit up 17). A warning though, use your \"do not disturb\" cards, the housekeeping staff was great, but energetic (i.e. ready to start early).", "Date": "April 24, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Bothell, WA", "Title": "“What a dump, I will never stay at one of their properties again”", "Author": "watravel", "ReviewID": "UR6841845", "Content": "Cigarette burns, put in a smoking room (we don't smoke) and we reserved two months ahead. They closed the bar over the weekend \"short staffed\", who does that? The entire property was a one star, how they got a 3 star rating is beyond me. People were rowdy, running up and down halls at 3:00 AM and they did nothing. The smoke smell was overwhelming, we could hardly breath at night. We will never stay there again.", "Date": "February 26, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Victorville", "Title": "“Never Stay here. Sleep in your car instead!”", "Author": "Victor42", "ReviewID": "UR5935320", "Content": "I will never stay there again. We upgraded from another hotel because we thought it would be safer and classier. We were wrong. The first night as my wife and I slept we were awoken by somebody trying to get in the room. Apparently, the front desk forgot that we were there. After that the next morning as we went out to our car we found that the rear window was busted out. When i called the front desk and reported it they apologized. I asked if they had cameras they said no. They said that they had A person walking around. Obviously, if they did the person would of saw all of the shattered glass that was on the pavement. They then questioned me, \"Why did you park in the back? I responded because that was where they told me to park. They offered no help no servicesetc. Not even breakfast (Since they do no provide a continental breakfast only a $9.95 per person breakfast. They advertise that they have room service, they don't. Very poor service. Although the room was nice, they should be dropped to a one star hotel.", "Date": "October 10, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Mexico City", "Title": "“Great value for money”", "Author": "MarioMexicoCity", "ReviewID": "UR4592087", "Content": "Park Plaza's rooms are quite big, some 20% bigger than your average hotel room. Separate work and sleep areas are nice. The lack of a table (i.e. for room service) is bad. The bathroom is ok for a hotel of this category. There is free wireless Internet. The hotel does not have any vending machines (the two they have are out of order) so if you need a coke or a snack after 10pm you'll have to go to the store across the street. Chack-in / check-out processes were good. Got it on Priceline for $46 during the weekend. At that rate is a great buy, at the prices of around $100 you get on other services, you could probably do better.", "Date": "March 8, 2006"}], "HotelInfo": {"Name": "Comfort Inn Phoenix", "HotelURL": "/ShowUserReviews-g31310-d1176612-Reviews-Comfort_Inn_Phoenix-Phoenix_Arizona.html", "Price": "$56 - $79*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2641 W Union Hills Dr</span>, <span class=\"locality\"><span property=\"v:locality\">Phoenix</span>, <span property=\"v:region\">AZ</span> <span property=\"v:postal-code\">85027</span></span> </span></span></address>", "HotelID": "1176612", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/dd/f1/ddf179c0b1aa8395ad2e27fc3023fb2d4large.jpg"}}