{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Whistler, Canada", "Title": "“Just an Asian company can care this much about you!”", "Author": "evazquezvela", "ReviewID": "UR128340403", "Content": "Top of the line service, make you feel like home. BEST SPA in Town with amazing installations and extraordinary therapists. Room service very good and on perfect timing. Reception and valet staff so kind and helpfull, my favorite hotel in Vancouver by far.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maple Ridge, BC", "Title": "“Fantastic Rooms and Service”", "Author": "Ron B", "ReviewID": "UR128179248", "Content": "This is a great hotel. The service was incredible and the staff was very friendly and welcoming. The room was fantastic, the bed comfortable, the bathroom huge with great walk-in shower, large soaker tub and double vanity. Even had a very large deck. Great location with restaurants and shopping nearby. Didn't try the restaurant but have heard very good things about it. Would definitely recommend this hotel.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Athens, GA", "Title": "“A Wonderful Experience!”", "Author": "Mae C", "ReviewID": "UR128003173", "Content": "My husband and I stayed here while attending a conference. It was lovely all around. Warm greetings by staff. Quiet, but in the middle of downtown. Very comfortable bed, great city view (we had a corner unit with a balcony). Simple, but well done decor. So much nicer than the \"big box\" hotels. No long elevator waits. Loved the complementary water each night...and bookmarks, too. My only complaint would be fixing coffee proved a challenge because using the key to power the coffeemaker had to be done numerous times to get two cups of coffee. It became my personal adventure each morning and we laughed at process. Gosh, we must have been really relaxed!!!", "Date": "April 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Alberta", "Title": "“Excellent 5 star hotel in all respects”", "Author": "eosinophil", "ReviewID": "UR127908908", "Content": "I loved this property. Excellent service with very fast check in. The rooms are spacious and beautifully decorated. The complimentary fruit is a nice tough. I quite enjoyed the breakfast in the hotel. Great location, very close to Robson street and lots of shopping. I would definately stay here again", "Date": "April 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "Surrey, British Columbia, Canada", "Title": "“Chi Spa...”", "Author": "Anika T", "ReviewID": "UR127525186", "Content": "From the moment I entered the parkade to the spa...it was an amazing experience! The Spa was incrediable. If anyone ever has the pleasure of going to Chi Spa please make sure you ask for Roya...she will ensure your experience is unfortgettable!", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Heaven in the heart of the city”", "Author": "tigerlilyCanada", "ReviewID": "UR127162931", "Content": "What a peaceful, clean, elegant hotel. The staff is eager to please, always kind and friendly. It is located in the heart of the downtown core. Shops and restaurants just steps away. A gourmet supermarket named Urban Fare is just beside the hotel. I frequently visit Vancouver for business and pleasure. I will definitely be staying at the Shangr-La in the future!", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Phenomenal hotel for a phenomenal stay”", "Author": "Lanica88", "ReviewID": "UR127150718", "Content": "The Shang is an amazing hotel, both esthetically and in service. The staff were so warm and welcoming, not to mention respectful and accommodating. The service offered here truly makes you feel like a celebrity. I have nothing but the highest praises for the Shangri-La!", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“Best of Vancouver”", "Author": "DBDowns", "ReviewID": "UR127150556", "Content": "We have stayed at the Shangri-La a number of times and each visit was superb. The serene surroundings are my favourite part of the stay and together with the excellent, discreet service provided by all staff and the fabulous meals prepared in The Market restaurant, it is by far the BEST place to stay in Downtown Vancouver", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Corona Del Mar, CA", "Title": "“Everything you would expect”", "Author": "CDMTraveller", "ReviewID": "UR126871311", "Content": "Stayed there with my family on the way back from the mountains. Room was smart, comfortable and cool. Staff was wonderful. Great stay.", "Date": "March 28, 2012"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Gateshead", "Title": "“Great stay in the heart of downtown”", "Author": "rmg95", "ReviewID": "UR126800835", "Content": "We have just stayed here for 2 nights whilst exploring Vancouver for the first time. The checkin was quick and simple our room was clean spacious and comfortable, the rooms were cleaned daily and had a personal touch for our arrival which was really nice and welcoming. The bed was extremly comfortable, it was warm throughout and the bathroom was very well equipped. The hotel staff helped looked after our cases after we checked out so we could visit victoria for the day. Excellent hotel thankyou.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Wonderful touches throughout”", "Author": "Julie U", "ReviewID": "UR126798468", "Content": "The hotel was wonderful with great touches everywhere. Everyone at the hotel was so hospitable and friendly. The rooms were very nice, although our room did not have a great view. The bathrooms were the highlight of the room, completely marble with a tv and separate bath and shower. There are bottled waters and candies left with the turned-down beds every night. It was the little touches that really made our stay wonderful in the end!", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Amazing hopitality”", "Author": "Michelle0630", "ReviewID": "UR126715450", "Content": "We stayed at the Shangri-La in Vancouver for our anniversary and from the moment we arrived we were treated like royalty. The staff went above and beyond for us. Shortly after we arrived, the staff sent up a very decadent \"Happy Anniversary\" chocolate cake. Staff at the lounge, front desk and concierge were all very polite, helpful and friendly. Upon checkout the valet provided complimentary water for our drive home. The room itseft was impeccably clean and the decor was beautiful. Although we were only on the 14th floor we had a wonderful view of Stanley Park.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Grande Prairie, Canada", "Title": "“Best Hotel Exprerience EVER”", "Author": "bmercant", "ReviewID": "UR126504723", "Content": "Beautiful Views, Excellent Personalized service, and incredible food. There are T'v's in the marble bathroom mirrors and you get chocolate on your pillow. We were celebrating our marriage and even received special personalized free dessert and specail spa package deals. Honestly the attention to detail, food and incredible service makes me compare every hotel experience to this.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Outstanding Hotel”", "Author": "60805Anonymous", "ReviewID": "UR126452132", "Content": "Excellent hotel and extremely good value. Only a 1 night stop over stay breaking up a return from Whistler to home, but well worth it and definitly a good decision on our part. Our daughter's favorite hotel ever in fact she spent 2 hours in the bathroom watching tv from the mirror, taking a bath and then a shower with all the wonderful products provided - perfect to relax her tired and sore muscles from skiing all week. Top notch service and extremely friendly, without pretenses sometimes found in hotels of this quality. Pool and hot tub were nice as well. We got 2 double beds and were worried we wouldn't sleep well as we are used to a king, but wanted our daughter to have a bed as well. We were tired, but the bed quality was extremely good and we slept like babies and quite comfortably.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southampton, United Kingdom", "Title": "“Quiet, Luxurious, relaxed haven from bustling city shopping”", "Author": "petewithleese", "ReviewID": "UR126335509", "Content": "If you are lucky enough to find yourself in the beautiful city of Vancouver BC and you want a well managed, friendly, relaxed, quiet, bespoke, classy & convenient Hotel experience then you should look no further. My wife and I have stayed many times at the Shangri-la in Bangkok and on a recent shopping trip to Vancouver decided to treat ourselves to the far from cheap experience that is the Shangri-la brand. The Hotel in Vancouver is very much in keeping with the world wide brand is really is the epitome of what a good city Hotel should be. The staff from check in to upgrade to valet parking to baggage valet service were so professional so friendly so relaxed yet discreet and formal enough to make you feel special and that you were staying in a Hotel away from the hum drum of inner city life. It is also in the perfect location to access the downtown of Vancouver whether your needs are retail based or foodie or culture based. Do yourselves a big favour, stop looking and book yourselves in, you will have a lovely stay.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Sleep Quality": "5", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“This is Shangri-La?”", "Author": "emcgoo", "ReviewID": "UR125963482", "Content": "Spent a Saturday night at Shangri-La for a little getaway. The Shangri-La gets A LOT of hype and so I wanted to see for myself. I offer the caveat that I had high expectations. So, while little was wrong per se, it just was NOT a good value. The good: Rooms were clean and the toiletries, linens, towels and robes were of good quality. The fitness facility, steam rooms, outdoor pool, outdoor hot tub and the spa are all beautiful. Perhaps the nicest I have seen in Vancouver. The mediocre: Some of the service was great and some was poor so overall, it was mediocre. Hallway noise was audible in our first room. The standard rooms (Superior King) are very small. The decor is not impressive. Honestly, it is hard to believe that hotel was professionally decorated. Cords, are clearly visible. Curtains and wall hangings clash. Bathroom while lovely, does not compare to other hotels of that caliber. The story: So we booked a Superior King room and I was very disappointed by how small it was for the price. I was also disturbed by how loud the street noise was with the windows closed. We asked if there was room we could move to but were told the only option was an upgrade. So, we upgraded. For a small increase in price we got a much larger room on the quiet side of the building and without noisy neighbours. The check-in is located in the parking garage and is small and unimpressive. The line was long and there are only two work stations at the front desk. Slow. I also waited five minutes for an elevator. It took close to 30 minutes to get to our room. Our small and unimpressive room. We decided to grab a drink in the lounge. The lounge was nearly empty yet after far too long, I finally had to ask the bartender to send someone over. When we finally did get help, their product knowledge was not up to par although their selection was good. Predictably, room service was extremely expensive, edible but not great and the portions were tiny. Really, I could go on and on about how mediocre it was. Nothing terribly wrong (other than the small noisy room), but for the price, nothing terribly right either (other than the fitness area). Unless your primary goal is to shop on Robson street, head down to the water and stay in one of the harbour front hotels. Stay at one of the Marriott's or the Hyatt for half the price or spend the big money at the Fairmont Pacific Rim. I have to say that the Pacific Rim is in an entirely different league.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“incredible attention to detail”", "Author": "1ababychicken", "ReviewID": "UR125245633", "Content": "Stayed here for a week while on business in Vancouver. I was impressed with the refined rooms...full marble bathrooms with soaking tub, valet tray in the safe, turndown service with treats. The location is great too...within walking distance of so many restaurants and shops on Robson street. Also there is a gourmet grocery store next door if you need to self-cater. The drinks in the bar were sublime as well. Defnitely a step above most hotels I have stayed with.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort St. John, Canada", "Title": "“Amazing rooms!”", "Author": "Paul M", "ReviewID": "UR125206648", "Content": "I normally stay at the Sheraton wall center but thought I would try this out and WOW! This is an amazing location - excellent staff and the rooms was just fabulous. Everything is touch control, including the curtains. I can not find any fault with the room - a 5 star for sure. my only comment is that i expected the hotel would be higher than 15 floors. I managed to get on the 15th floor but because of the other buildings had no view at all. The room and services more than made up for it. Room service and the lounge were also top notch! BOTTOM LINE - if view is not important you will be happy here.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“Just as James Hilton described it.....a utopian earthly paradise, isolated from the outside world.”", "Author": "LRJ13", "ReviewID": "UR125104678", "Content": "There are times when you get a chance to get away for a holiday or vacation and you get lit up, taken a back and amazed by your destination. Well Vancouver is a great, lively, Canadian city that my g/f and I love to visit, and living in Seattle we've been there quite a few times (just check my other reviews). This time though I'm not going to say the hotel or property became a destination in itself, but boy howdy does it come close...... We were there for our annual Leafs v. Canucks hockey game at Rogers arena (3 years in a row!!!) and found online that the Shangri-la was first; running a special, and second because of this \"Experience Shangri-la\" package made it less expensive than our usuals (Sheraton, Hyatt, Le Soleil, Sutton Place), we jumped on it right away. We arrived in Vancouver late in the evening, and since I didn't want to pay for the valet $39 Canadian (because we now have our own little secret parking place in downtown), and 39 dollars is not expensive, and not any more than other properties around the city. We found short term street parking so we could check-in, and I could go park my car later. In Lost Horizon by James Hilton, Shangri-la is tucked away in the mountains of tibet. Well the entrance to the main lobby, and check-in is follows that basic concept. The entrance is not on Georgia, but tucked away on Alberni with only a small sign leading the way; Shangri-la and an arrow pointing to the right and into a winding driveway down to the lower lobby where you check-in. However my girlfriend and I entered off of Georgia, next to the burberry shoppe, you are welcomed by two fu dog statues guarding the place (how very asian). Inside of the Lobby (off of Georgia street) is the concierge desk, some seating areas, Xi-Shi lounge and two sets of lifts (elevators). No lobby in sight!!!, as I mentioned there are two sets of lifts one for the residences called \"living Shangri-la\" and another set of elevators marked hotel lifts. We took it down to the lower lobby for the front desk (this is the driveway entrance off of Georgia). The lobby is small, very elegant, and decorated in an asian motiff (like the rest of the hotel). The key card is unlike most other key cards at most hotels (you also have to use key card in the elevator to get to your floor), you don't slide the card into a stupid slot until the light turns green and remove to gain access into your room, no this is a little different. The difference is you tap a sensor on the door to gain entry into your room. We're not finished with the key card just yet. You need to insert the key card into a slot by the door to activate the lights in the room. Ohh boy!!! and when the lights do come on, you have reached Shangri-la...the paradise on earth. We were staying through a Sunday and on sundays shoppes open late, and close early and my g/f and I for the first time couldn't wait to just relax in the room!! Ok so first everything is electronic from the light switches (complete with various settings; sconce, nightlight, reading light etc.etc.) to the controls for the shades and the blinds so you don't have to get up to close either, just the touch of a button. There was also a control panel for the do not disturb so when you pressed it a pad on the outside of the room lit up in red \"do not disturb\" and would turn off the doorbell if someone rang. There were also some goodies left in the room; on the coffee table a note from the manager welcoming guests personally (whether it was handwritten or not, a very nice gesture) thank you Richard. Next to the note was a plate of fruit, and on the bed each night laid a bookmark, and a small piece of candy wrapped in plastic (each night had a different morsel of candy from salted caramel, caramel, and a grape soft chew). The bed was a queen size bed and the best part about it was that the throw pillows, and throw blanket were tucked away in the drawer under the television. The only pillows and blankets was a very warm alternative down comforter and probably the most pillow selection types ever on a hotel bed (there is even a card in the night stand with different pillow choices that you could leave out and the staff would bring those pillows). The other treasure in the other night stand was a copy of not the bible, but James Hilton's Lost Horizon (some properties offer a complementary copy, Vancouver location does not!!! I asked, its 20 dollars) the novel in which Shangri-la originated from. The television had just a great selection of channels and movie selections, but the most unique part of the television amenities was that it had a a DVD player, and ability to hook-up an Xbox, or PS2/3 for video game console playing. Another great part of the room and it seems endless but the WIFI in the rooms are FREE!!! and quite fast (BEST THING) because we both had work to do on our laptops so that is great and more hotels should offer free WIFI in the room and not be a pay thing or free in the lobby bologna. The closet had ample space with drawers, umbrellas, shoe horn, and a safe. The mini-bar was quite extensive, and they also have those stupid, wasteful, hateful nespresso single serve coffee machines (which have become popular for reasons I don't understand). To make it up they have complimentary slippers and bathrobes for use. For me the piece du resistance.....the loo, the bathroom, the john. No!!! those terms do not do it justice. The bathroom is a cathedral of cleanliness and marble. Yes white marble floors and walls. There was a private toilet room with sliding glass doors, a little shelf, and a telephone (a very private and lovely feature). The shower was large and a little confusing at first to use, because there is one lever and the way you turn either activates the wall mounted shower head or the hand held shower head. The bathtub was large and deep great for soaking in a warm bath (downside no bath bubbles or bath gel), I still soaked in the tub many many times. The blinds are even controlled by switch on the wall. Next to the sink I had noticed a remote control and thought to myself what could this be?? I hit the power button and on came the mini-television in the mirror, let me repeat that a mini television built into the bathroom wall mirror, I kid you not. L'occitane is the supplier of their bath gels, soaps, shampoos and conditioners (great stuff), they also have two toothbrushes with mini-toothpaste supplied in the bathroom. Overall, a pretty sweet bathroom err....cathedral. We didn't use the pool, or the hot tub or the fitness centre, but the pool is on the 5th or 6th floor (i don't remember) I checked it out and it is heated so even on chilly days its nice to go swimming. They have a world class spa called, Chi which we didn't use, 24 hour room service (very nice) but didn't use. They have a company car for guests to reserve and get chauffeured in (i think a mercedes S-class) but didn't use. So all the world class service and amenities of a 1st rate hotel.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“Shangri La Vancouver”", "Author": "reviews255057", "ReviewID": "UR125054508", "Content": "What a beautiful hotel. I arrived at 0700, check in wasn't until 1500 but I was treated like a queen whilst I waited for my room. The staff were brilliant and pointed me in the right direction of the best coffee house and shops on Robson st. I was allows to sit by the open fireplace in the foyer and read until the room was available. My room was excellent, very large with an extremely comfortable King size bed as booked. the bathroom was sensational and very clean. TV over the bath if you wish to indulge. Room also has a balcony with table and chairs. Great view over the city and mountains. We received a complimentary fruit plate upon arrival. I would definitely recommend this hotel - outstanding.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“OUTSTANDING!”", "Author": "Karin L", "ReviewID": "UR124835684", "Content": "Came here for with my husband and two children (ages 5 and 6) to celebrate our son's birthday. This was our first time in Vancouver, so I'm going to mention distances and timelines in this for those who are like us - not sure exactly where things are located and how to get there. First, the entrance IS tough to find - it is on Alberni and NOT on Georgia - just look for the small sign that points to go down into what looks like a parking garage. We were greeted by a bellhop and a staff member who immediately checked us in - and upgraded us to an executive suite (incredible!). The room was amazing - king bed with a pull-out sofa - very roomy even with the sofabed out - and floor-to-ceiling windows overlooking downtown. Everything push-button and very high-tech, so the kids loved it. The only issue we had was that while we were unpacking, they sent up a tray of different kids of homemade cookies and fruit as a greeting with a hand-written note from the manager (thank you, Richard, very nice touch). After being assured by the staff person that the cookies did not have nuts in them as so many people are allergic these days (our kids are severely allergic), our kids dove at the cookies. My husband noticed one of the cookies looked like peanut butter and tasted it (and it seemed like peanuts). Grabbing our kids and having them spit out anything they had in their mouths (thank goodness the one they chose was chocolate chip), we called the service and they checked - turned out that although they normally NEVER put nuts in the cookies, today of all days they added peanut butter cookies to the tray. The apologized profusely and asked if we could wait 20 minutes and they would send us an entirely fresh-baked tray - which arrived exactly 20 minutes later with more fruit and more apologies from the staff, who were appalled that that had happened. We write this not to be critical of the hotel, but of how well they handled what was a pretty scary situation for our kids. The concierge (Jeffrey - he was fabulous!) gave us a great map, a handout (Kids Guide?) of all the kids activities around vancouver, and got us reservations at Al Porto, an incredible Italian restaurant in the Gastown district. A quick 20 minute walk (with lots of stops by the waterfront) and down a cobble-stone alley, we were at Al Porto - seated immediately (think busy Italian restaurant with cosy ambiance). Service was outstanding (the salad with walnut-encrusted goat cheese, gnocchi, fettucini alfredo and beef tenderloin were great, but the BEST was the sautéed mushrooms in tarragon and garlic - highly recommend it)! A bonus about this hotel is that there is a great market called Urban Fare that is right behind the hotel - made for a great place to get fruit, amazing croissants and coffee every morning. The cheese section is incredible, as well! Also, Robson street is truly 1 block away - this hotel is in an excellent location! Day 2, we decided to go to the aquarium - while it is a 30 min walk (for an adult), 2 kids and rain seemed to make the decision to do a cab easier. The concierge again was great - called us a cab and gave us discount vouchers for entrance. Aquarium was great - beluga show and dolphin show were close in location and distance so we could do both. We were pleasantly surprised to find that they have snakes and a whole amazon section, as well, so note that it is not just aquatic life! We lunched at The Market (at the hotel) - the market burger with brie and truffle sauce was outstanding. Grabbed coffee again at Urban Fare and walked Robson Street, then back to the hotel to swim. NOTE - the pool is outside, but \"heated\" - considering it was about 4 celsius, we decided to opt for the hot tub, which was a great temperature for the kids. I will say, I think the part of this hotel that has trumped all else for the kids is being able to watch 'Ice Age' on the TV in the mirror in the bathroom while showering after the hot tub. Our kids have determined that they are never leaving this hotel :) As a comment about what we read about having to call for ice - yes, you do. But the longest it ever took for ice to arrive for us was 2 minutes. We honestly can't enough about this hotel - the amenities, location and most of all - the STAFF - are absolutely incredible. Best hotel we have stayed in - hands down. We'll be back!", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Chi Spa at Shangri-La Vancouver”", "Author": "Jgirl007", "ReviewID": "UR124716285", "Content": "I live in Vancouver and my husband and I spa together on a regular basis. The Chi Spa at the Shangri-La hotel is our favorite in the city (apart from the Mirage on S. Granville). We prefer it to the newer Willow Stream Spa at the Fairmint Pacific Rim. No detail was left undone in the interior. The signature Chi Massage is more of an energy balance than deep tissue and totally worth experiencing if relaxation is your preference. the Japanese masseuses are consistently excellent.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tokyo, Japan", "Title": "“Good, better, Shangri-la!!!”", "Author": "Nis N", "ReviewID": "UR124600242", "Content": "Shangri-la exceeded my expectations for a hotel. I've traveled a lot in the world, Tokyo, Tel-Aviv, Prague and Berlin alone this year and have stayed at 5 star hotels HOWEVER: Shangri-la beats it all Everything is just a bit better. (or a lot) In addition, authentic and beautiful art on the walls Shangri-la Vancouver is perfectly Placed. Walking distance to everything. The staff are friendly, helpful and very welcoming. Just opposite the hotel there is a sushi restaurant; Ki which I also can recommend.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Luxurious Stay”", "Author": "TravelMamaCita_16", "ReviewID": "UR124486010", "Content": "Thoroughly enjoyed an overnight stay with my family, including our dog. The hotel and staff ensure all amenities are provided including a dog bed, bowls and water for the pooch. Dinner at XiShi Lounge was delicious with great live entertainment as well. For me, the highlight was the WestCoast Wave massage at Chi Spa. The therapist used the perfect amount of pressure and even worked on areas of stress I didn't realize I was carrying. The atmosphere in the spa and in the client room was so tranquil. The experience from start to finish was incredible. The Shangri-la is as its namesake describes: a paradise on earth.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Excellent Staff, Excellent Service, High Tech hotel”", "Author": "Egypt6", "ReviewID": "UR124298792", "Content": "I stayed here recently on a business trip and have to say this is one of the most state-of-the-art hotels where I have stayed. Everything is automated, and I was amazed by the presence of the tv screen in the bathroom mirror. The staff treated me like royalty, and everyone was more than willing to help with every request I had related to our board's group stay, including when I walked into the business center and found someone to help me print some documents on the fly. I cannot say enough about how polite and helpful everyone was, and what a nice element this is when you have a lot to accomplish in a short time with a large group. I wrote out the comment card and I know it was read, because they sent me a nice desk calendar to boot. VERY pleased and now I understand why my company loves this hotel. Best stay ever--I wish it could have been longer.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oslo", "Title": "“Great hotel”", "Author": "EL_Oslo", "ReviewID": "UR124235699", "Content": "Suberb service, a true Shangri La experience. The bed was probably the best hotel bed that I have ever slept in, even better than my own Hästens bed at home. Clean, stylish, quiet and sophisticated without being posh. Well worth the money, indeed. Recommended!", "Date": "February 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Canada", "Title": "“Wonderful, luxurious, so comfortable!”", "Author": "Sandy045Canada", "ReviewID": "UR124220198", "Content": "We have stayed here before and will stay again. It is so fun & wonderful to stay at a top notch hotel. The tv mirror in the bathroom is awesome! Fresh delicious coffee! Comfortable bed! And everything (lights, drapes open & close etc) is right at your fingertips!", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“An elegant home environment”", "Author": "MaryRingwald", "ReviewID": "UR124168640", "Content": "Our stay at the Shanri-La Hotel Vancouver exceeded my vision of a weekend get-a-way. It truly was my shangri-la. Thanks so much to everyone who made our stay a dream realized. Mary Ringwald", "Date": "February 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Best service I've ever had”", "Author": "Ergi13", "ReviewID": "UR124067086", "Content": "Everything is excellent about this hotel, but what puts it over the top is the staff and the amazing service they provide. The maid would even fold my t-shirts and lay them down properly. You find fruit in your room when you arrive accompanied by hand-written notes to welcome you. The rooms are spacious, modern and of course brand new. The location is excellent ad a walking distance to most places in downtown Vancouver. I was there for a business trip and the rate my company gets is excellent, which makes the overall value great.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baton Rouge, Louisiana", "Title": "“Amazing hotel and staff”", "Author": "Sarah C", "ReviewID": "UR123836871", "Content": "From the first hello to the final goodbye, this hotel never ceased to amaze me. The facilities are gorgeous, with automated adjustable lighting, automated drapes for the windows, bathrooms with large tubs, walk in showers, bathroom mirrors with TV's, and large flat screen TVs in the bedroom. The 6th floor conference facilities are beautiful as well, really offering a high level of sofistication and elegance. The room service menus and on-site restaurants offer a mix of typical fare as well as asian specialties such as chicken wonton soups. The food is excellent in room and in the lounge or restaurant. The staff makes you feel special, and like you are cared for away from home. Small touches like a newspaper every morning, an evening turn down service with a bottle of water and chocolate, a staff member organizing my makeup on a nice linen cloth when I'd left it disorganized, and similar made it feel kind and welcoming. The hotel is well located in downtown Vancouver, with a lot of food and shopping options very nearby. The hotel even has a flight check in kiosk just like the airports, that will print your boarding passes right on the spot.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Beautiful”", "Author": "Justindyer5", "ReviewID": "UR123762727", "Content": "My wife and I were staying over in Vancouver for the night and we had heard the shangri-la was nice so we thought we would try it out. From the moment we were greeted to the time we left we were treated like royalty. The entire hotel is spotless and the service is extraordinary. We walked from the hotel to hy's steakhouse for dinner and then back to the hotel for cocktails in the hotel bar. Great cocktail menu and even though the cocktails were a bit pricey, they were what you would expect in a hotel bar. Overall our stay was spectacular and I would definitely stay there again. Especially if it is a special occasion. It was our anniversary and they brought us chocolate covered strawberries.....on the house!", "Date": "January 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kunitachi, Japan", "Title": "“Best hotel in Vancouver”", "Author": "Ryogen T", "ReviewID": "UR123627177", "Content": "For many years, the Shangri-La Hotel chain has been the number one choice for our family for its quality. The Vancouver Shangri-La is the best of the best in my opinion. If you're looking for a conveniently located, new and a high quality hotel then this is it. Out of all the hotels I've stayed at, this one was truly the best, better than any other hotels in its chain. It's definitely the place of choice when visiting Vancouver as its location is close to everything, located near the Robson Street, Pacific Mall and a little walk down to the waterfront. The moment you walk into the hotel, the \"Shangri-La smell\" welcomes you and it's just a wonderful experience until the moment you leave the hotel. Will be visiting again in April.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "Dalian", "Title": "“Upscale Bliss”", "Author": "DalianEx-pat", "ReviewID": "UR123340706", "Content": "We discovered Shangri-La while living in Asia during the past four years. This chain was always our \"go to\" choice. Now that we are back in Canada we chose the Shangri-La as our Christmas retreat, and that it was. We spent six nights here and right from the get-go we were addressed by name wherever we went within the hotel, found that all services were discreetly handled with professionalism, and that staff seemed to appear and evaporate whenever needed or not. Unlike many of the chain's properties in Asia, this Vancouver hotel is small, intimate, not pretentious, and quietly elegant. Restaurant service was beyond expectations and Christmas dinner was the ultimate and at an extremely resonable cost of $65 for a four course meal. That, along with the wine pairing, was a perfect reason to spend Christmas in the Shangri-La. We will return for next Christmas! Of course, we will return before then, whenever we are in Vancouver. Do try the French Toast for breakfast - the most decadent thing imaginable!", "Date": "January 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“A Night of Bliss!”", "Author": "Corisa B", "ReviewID": "UR122896323", "Content": "My husband and I, along with our two friends spent the night to celebrate our anniversaries. This hotel feels like a luxury from the moment you enter. The staff was attentive from the moment of our arrival, so pleasant and personable. The room was chic and we mentally noted how equipped it was if we ever needed a place to stay for business purposes. A full desk was in each of our rooms with every kind of electronic plug-in you could need. The bathrooms were lovely with a full shower and a soaker tub. The bed was quite possibly the most comfortable bed we had ever slept in – it felt like a cloud. We would absolutely stay here again, and now I have a goal to travel to many of the Shang-ri La locations around the world and see what the other locations are like!", "Date": "January 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hong Kong", "Title": "“Top property in Vancouver”", "Author": "greg h", "ReviewID": "UR122798386", "Content": "Appreciated the privacy and the low intensity of the rooms. Very few rooms and you rarely see or hear staff or other guests. Rooms are perfect in Shangri-la style. had a great 4 days there in December 2011.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Luxury, but a few mis-steps”", "Author": "Pomonan", "ReviewID": "UR122683812", "Content": "We stayed for five nights in August 2011. We had a few niggles, but nothing severe enough to drop this review to a 4. Service was outstanding. We had a problem with our initial room, and were kindly moved to a one-bedroom suite with balcony, which inevitably colours our review. The room was genuinely a luxury experience - a step above similar accommodation we have had in Four Seasons and Ritz-Carlton properties in the US. The mis-steps were as follows: The hotel had arranged a driver from YVR, who duly met our flight as arranged, but had managed to lose his car keys. Fortunately he was still able to get into and start the car, but any amusement faded when we stopped not once but twice so he could tie down the trunk with his belt. This added significantly to our journey time, not ideal coming in at midnight from Las Vegas. Market at Jean-Georges was hit and miss, or to be more precise as breakfast was included in our rate: miss-hit-miss-miss (the fifth day we had a dawn train to Seattle; the hotel kindly provided pastries and fruit (which was then confiscated by Customs at the station)). As I think someone else pointed out, a lot depends on your server - maybe we were just unlucky 75% of the time. However, we experienced similar service issues at several restaurants; maybe it's a Vancouver thing. My final gripe is being charged $12 for an espresso by the pool. It was from a automatic machine and not even any good. Overall, however, an experience I would recommend, and would probably stay here again if in Vancouver. The pool was a bonus (though not exactly a sun-trap) and we used Chi Spa which was very relaxing.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Proposal Night”", "Author": "Vincent M", "ReviewID": "UR122343146", "Content": "The men and women at this hotel made our stay the most memorable night in our lives. They were the most accommodating, kind and understanding people we've ever met. The room that I got was the Deluxe One Bedroom Suite. As soon as I got in our room, my initial reaction was \"wow, this will truly be a luxury experience\" - and it was. My favorite part of the room is the bathroom, complete with jet soaker, rain shower and oh, a tv in the mirror. We will definitely be coming back and if possible, maybe get the same room number. Thank you Shangri-La for making Dec. 27th a very special night. You guys are the best in town!", "Date": "January 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Heaven on Earth.”", "Author": "StarSeekR", "ReviewID": "UR122342956", "Content": "The room was beautiful & well appointed. Beds (including Pull Out) were comfortable. Spacious bathroom with modern touches. Attentive service delivered with elegance. Chi Spa is worth a visit. It was completely booked during our stay, so it will have to wait until next time. Great downtown location, walkable distance to entertainment & dining. A great way to endulge while on business or for pleasure.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great hotel”", "Author": "silverblackf4i", "ReviewID": "UR122166328", "Content": "This was the third year in a row we stayed at the Shangri-La Hotel in Vancouver for Xmas. First year we got upgraded to an extremely nice corner suite, past two years we've been in the Deluxe rooms with king beds. The service is friendly, accommodating of requests, and very helpful overall. The room decor is relaxing and tranquil, the bathrooms are well designed, fast hot water and excellent plumbing, lights on dimmers, TV-in-mirror, frosted glass partition on commode. The beds (Stearns & Foster mattresses) and bedding materials are extremely comfortable - easily the best I've ever slept in. Heavy drapes and sheer curtains are independently controlled via electronic controls, bedroom lights are all on dimmers with controls located next to both sides of the bed. The rooms we stayed in had a safe in the closet large enough to hold a 15-inch laptop, also includes a jewelry tray. The location is basically at the center of downtown give or take a couple of blocks, with easy access to a variety of restaurants, shopping, lounges, and public transportation. Stanley Park is a 15 minute walk to the northwest. Convenience items - there is an Urban Fare (upscale deli/grocery store combo) next door, a Tim Horton's, Wendy's, and A&W across the street, a 7-11 adjacent, and a well stocked liquor store a block away. The hotel's parking lot is a bit tricky to find for first-timers, almost like a secret back entrance off of Alberni Street just past the Urban Fare.", "Date": "December 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver", "Title": "“Cool place to stay”", "Author": "tdh123", "ReviewID": "UR122015281", "Content": "We stayed here as we got a good deal since we were attending a Christmas Party. Fancy hotels are not really our thing, but this place was well worth the rate we paid. The rooms were very well designed, the beds were comfy and the location is excellent. If you are looking for a top notch experience in a hotel with a Zen environment, this is a good place to stay. One complaint I had was there were no ice machines that I could find so I ended up buying ice from 7-11 which was not a normal experience for me. I am sure I could have called down and asked for some, however it was easier to pick up on my way back to the hotel.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“The Best of the Best”", "Author": "mitchmac", "ReviewID": "UR121925069", "Content": "We have travelled the world and our stays at the Shangra-La in Vancouver rival any hotel in the world. we were fortunate enough to attend the Canadian Tenors package at the hotel. It was a great experience. from the minute you walk in to the time you leave, you are made to feel like you are their most important guest! A truly wonderful experience that we would recommend to anyone for the night away to that special date!", "Date": "December 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“One of the best hotels I've ever been.”", "Author": "Alexanderplatz1970", "ReviewID": "UR121901172", "Content": "I stayed at this hotel in September 2010 for a week. Beginning with a hotel car picking me up at YVR, following with a warm welcome and a fantastic room with balcony on the 15th floor (I think), I really felt at home. The staff at the restaurant were extremely polite and the concierge arranged a trip to Victoria for me. So thank you very much for such a good service. Even after I checked out the staff were there for you.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Ended up chaning Hotels”", "Author": "mr_and_mrs_nibbles", "ReviewID": "UR121784289", "Content": "Firstly, we have stayed at the Shangri La a few times before and my parents have too. Always been a great experience.... However, we booked our 'annual' night out in Vancouver this year. I'm sure I chose a King online, but maybe I didn't. Anyway, realized and phoned up to change. Said no problem, will get a confirmation email. Worked away for a week, then remembered no email, called and we had been wait-listed to a King, which was different to have previously been advised. Ended up in a Twin, not the end of the world though and possibly my mistake. However, when checking in my wife overheard someone else being told all the restaraunts and bars were booked up for private function and NO WHERE was available in this hotel to drink. Phoned reception, this was confirmed, no Apology until we phoned back and complained and then given different bars which they could book (we later found out 2 of the 3 dont take bar bookings anyway). Cut a long story short, they really didnt care that we wanted drinks in this ($350) expensive hotel before we went out with a meal with friends, so we changed Hotels. Ended up a block or two away at a Hotel we've stayed at before 60% of the drive, much bigger room and fantastic service who accommodated us at short notice. And with that, the Shangri-La has lost mine and my families business (which was 4 different occasions in the past 12 months)", "Date": "December 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Abbotsford, Canada", "Title": "“Excellent Hotel”", "Author": "Margo M", "ReviewID": "UR121707056", "Content": "I have and do travel and have stayed in many hotels but this is the first hotel that I can say I have enjoyed the most and there wasn't even one problem. The rooms are beautiful, airy, comfortable and come with everything you need. The beds and bedding are like sleeping in a cloud!! The bathrooms are surrounded in a white marble giving a feeling of spaciousness and relaxation. The staff are more than helpful to make your stay easy and comfortable and the service is impeccable. We thought we would be out dining on the Saturday night but decided to have room service and the food was amazing! I must add that the restaurant, bar/lounge are really good and the spa is fabulous as well. I left feeling happy, content and relaxed. I highly recommend this hotel to anyone!", "Date": "December 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Vancouver's top Hotel”", "Author": "Brianrg", "ReviewID": "UR121681865", "Content": "The Shangri La is simply Vancouver's best hotel. I stay there almost every trip to Vancouver and I couldn't imagine staying anywhere else. From the moment I walk in the door to the time that I check out the service is impeccable. There is a great restaurant (The Market), fantastic lounge with incredible cocktails (Xi Shi Lounge) and an amazing spa (Chi). The size of the hotel is really misleading, I thought the hotel was a lot larger than it actually is. I believe the hotel only has rooms on Floors 8 through 15. The other 50+ floors are private residence. If you haven't stayed there you really should.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Venice, California, United States", "Title": "“Guests don't count”", "Author": "Jeff T", "ReviewID": "UR121642518", "Content": "As I write this review I have had room service ringing in my ear for ten minutes with no answer. There is no lobby bar, they close their restaurants and two boring bars nightly for private functions with no regard for their guests. The room itself is quite nice, the maids are very sweet and flexible. Beyond that it is the worst experience I have ever had at an upscale hotel. If you are traveling to Vancouver on business I would recommend you choose any other hotel. Kind of a nightmare staying here.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "north america", "Title": "“best place in town”", "Author": "walNorthAmerica", "ReviewID": "UR121098487", "Content": "Wonderful in every way: great rooms, best service in the world, nice gym and steam/sauna, wonderful food. We had a one bedroom suite - big with nice balcony. It is the above and beyond service, and the high standard of excellence, that really stand out here.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Heavenly!!!”", "Author": "BforBoy", "ReviewID": "UR120840925", "Content": "This is my favorite hotel in Vancouver !! The design is beautiful and the rooms are fantastic. The location is great. The service of the staff is unbeatable. Try the market restaurant if you can. The spa is also wonderful-- the fees are little high but it's worth it. Highly recommended!", "Date": "November 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“nice hotel in a nice city”", "Author": "tmeizler", "ReviewID": "UR120458151", "Content": "nice and quiete, very well located, good service. we had a suite - alittle bit small but clean and nice.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NJ", "Title": "“One night in heaven”", "Author": "mike219jma", "ReviewID": "UR120138136", "Content": "Stayed one night with my fiancee and we completely loved it. Please check out my full review here - http://infamousdx.com/2011/11/03/shangri-la-vancouver-hotel/", "Date": "November 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Quick trip”", "Author": "32655Visitor", "ReviewID": "UR120090190", "Content": "We stayed at the Shangri-La Hotel in late August. Vancouver is a very beautiful city and this is a very nice place to stay. We would be happy to return in the future.", "Date": "November 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great support for business events”", "Author": "cfilmcat", "ReviewID": "UR119847048", "Content": "We held two separate events at this hotel. The planning crew were fabulous, and there was always a staff member present to assist. Everything was so smooth and unobtrusive. Did not stay in the hotel.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "DC-USA", "Title": "“Excellent Urban Hotel”", "Author": "Harrydog44", "ReviewID": "UR119057620", "Content": "The Shangri-la chain is one of the best collection of city hotels in the world. This one is no exception. The suite we had was beautifully appointed, stocked with first-rate amenities, and very comfortable bed and furniture. The Market Restaurant was a Michelin One Star, and was well worthy of that rating. The service was up to the usual impeccable standard of the chain. The only cavil is that the hotel is located on the lower floors of the tallest building in Vancouver, and is very difficult to access. The only vehicle entrance is through a parking garage that is accessed via a street that is perpendicular to the street of the hotel's address. Cab drivers consistently had difficulty finding it. The entrance to the hotel through the parking garage is, to put it mildly, less than dramatic. The Shangri-la is an excellent choice for a business hotel in Vancouver, but for truly personal service, I prefer the Wedgewood.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Alberta", "Title": "“Exceptional!”", "Author": "gal_businesstraveler", "ReviewID": "UR119048094", "Content": "This hotel was nothing short of perfection. In room technology, style, staff service and more. I loved this hotel and can't wait to be back. Those that don't travel often or don't truly appreciate this \"little\" details that mean all the world to a road warrior, might not appreciate the subtle nuances.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Oceanside, California", "Title": "“Not that great :(”", "Author": "Aprilp2412", "ReviewID": "UR118545857", "Content": "I have never stayed at a top notch hotel like the Shangri-La before. So I am not being snobby when I say I was disappointed. We wanted to stay at a great place for our honeymoon so paid the high price and booked this hotel. Yes, the rooms were nice but not very large. My issue is that for the price I expected more, I dont think the hotel was any better than any of the mid priced hotels. We did not have any issues, but nothing great to say either. But we loved our meal at MARKET!", "Date": "September 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Average all around, just paying for the NAME!”", "Author": "SGO007", "ReviewID": "UR118345585", "Content": "I was there for a wedding and decided to pay the big ticketed price for location. Having heard wonderful things about Shangri-La hotels, I was expecting great room with amazing service. The hotel is very nice and the rooms were very clean but for double the price of other five star hotels, I was not impressed. I think we are just paying for the brand. The Good: - Very Clean - Great location - Nice sized bathroom. The not so good: - Check in was slow (No in room check in) - Service was average. - For the price they did not go the extra mile to help. My friends and I have booked two rooms and they put one of us on separate floors and we asked if we can be moved to the same floor. I talked to the house keeper and they inform me that the room across from my room was free but upon inquiring at the front desk they wanted more money, considering we are paying close to $1000 for two rooms and we were there for a wedding (I am sure tens of thousands of income), they would not help us unless we pay additional fee ($30). They hotel value money over happy guest, it's just bad business for not offer a non-booked room to make guests happy. They lost a few repeat customer that day. With so many other hotels near by I woukld stay somewhere else and get a better view.", "Date": "September 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Wonderful, great city hotel”", "Author": "Sailaway1002", "ReviewID": "UR118127797", "Content": "This was our second time at this specific shangri la and once again it did not disappoint. Rooms are amazingly clean, large, modern asian decor and extremely cozy. Staff was super friendly and always a pleasure to look at as very elegantly dressed. Gym is a little small but still well equipped with some cardio and weights. Pool is very small. It is on the upper end $ wise but definitley worth the money.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Oklahoma City, Oklahoma", "Title": "“I would stay here everytime i visit vancouver”", "Author": "Cindy E", "ReviewID": "UR118010502", "Content": "Hotel was very nice, very secure and views were georgous. The room was awesome!!!!", "Date": "September 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Best of the best in vancouver”", "Author": "Lkm995", "ReviewID": "UR117913217", "Content": "We stayed 2 weeks here last year and re visit again. Rooms are wonderful but I don't think the ones with balconies make that much of a difference because of the surrounding building a are rather ugly, such a parking garage and some unsightly grey concrete and sign boards.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "clarksville tennessee", "Title": "“Great hotel, pimped out room!”", "Author": "lewis01utk", "ReviewID": "UR117885382", "Content": "We stayed a night at the Shangri-La hotel in transit to an Alaskan cruise my wife and i were taking. We booked the room through the American Express FHR program. To start with the hotel is more on the small size of the high rise hotels. The hotel rooms occupy the first 15 floors with luxury condos on the rest. The staff were very helpful and the front desk staff (on the lower level than the street level) were very nice and quick regarding checkin. They complementary upgraded our room to a balcony suite. This room was incredible! Very modern and luxurious with quite a few high tech ad ons such as push button drapes and dimming lights. The room was very clean and well kept as was the rest of the decor. The work out facilities where top of the line and very nice. The restaurant, Market, was great. We ate breakfast there the next morning. The apricot sausage was phenomenal! In the process of eating I managed to dump my coke all over myself. The restaurant manager, Gordon Hay, was near and came over to assist, switching chairs, picking up ice from everywhere and even had the chef retire some new food due to my original food having coke on it. We started talking to Mr Hay and he was a real wealth of knowledge regarding the local area and took the time to locate a map and answer our tourist questions as well as make some local recommendations as to what to do in the area. He was very personable and helpful and was a true crowning touch to the overall great experience of the hotel. We would definitely stay again and recommend the Shangri-La to anyone coming to vancouver!", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Madrid", "Title": "“Excellent hotel in a lovely city”", "Author": "mistralksk", "ReviewID": "UR117562182", "Content": "This is the kind of hotel in which you feel that you stay in a five starts. Every detail in the rooms and the bathrooms has been perfectly cared. Breakfast is not a buffet, and it could be improved, but waiters try to satisfy you in any thing you ask them.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Spectacular hotel”", "Author": "abott", "ReviewID": "UR117518727", "Content": "What a fantastic hotel, the service, the rooms, the downtown location! This has to be one of the best hotel experiences I have had in the world.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Michigan, USA", "Title": "“Great hotel, poor breakfast”", "Author": "Maximilan", "ReviewID": "UR117515854", "Content": "Gorgeous hotel, but very poor breakfast. Very limited menu, no buffet and extremely expensive!", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "TUCK1995", "Title": "“Terrific Experience”", "Author": "TUCK1995", "ReviewID": "UR117350539", "Content": "My family and I stayed here last week and were thoroughly impressed. Rooms are extremely well appointed, service excellent, the facilities are top notch and the location is super convenient. One particularly nice feature was that we had two adjoining rooms that were attached by closing off the end of a hallway, which provided a suite feeling, but with additional privacy and security. Also impressive that they don't try to nickel and dime you on every ancillary service (e.g., very high quality free internet, no hassle on late check out, complementary coffee in room). Most recent comparable experience was at the Peninsula in Tokyo. First time we've ever stayed in a Shangri-La, but probably not the last.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Great hotel in a perfect downtown location”", "Author": "ridgebackfan", "ReviewID": "UR117090233", "Content": "I've stayed at a number of Shangri-La Hotels all over the world in the past several years and this hotel met or exceeded every one of my expectations. This hotel occupies the first 14 floors of Vancouver's current tallest building. The thing that stands out the most about it is the service. Everyone, from the front desk to the concierge, housekeeping and in the restaurant, has been so kind, very efficient and very helpful. The rooms sparkle. I love the floor to ceiling windows. We've made great use of the balcony in our executive room. The bedding is very comfortable. The bath and bathroom are wonderful. The food in the restaurant is superb. The gym is well-equipped and user friendly. I would definitely return (with our without a Horizon Club...didn't impact my stay one bit). The location is great. A gourmet grocery is next door (Urban Fare), and the liquor store is just around the corner. It's an easy walk to the water on three sides of downtown, and a few blocks to the Canada Line Sky Tram.", "Date": "August 22, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Hong Kong", "Title": "“Very comfortable stay”", "Author": "doobeebaby", "ReviewID": "UR116592541", "Content": "The Asian hospitality was evident and we were treated very well by everyone at this small hotel hidden away in downtown Vancouver. The rooms are very well appointed with no expenses spares (TV in bathroom behind the vanity mirror, electric curtains, in-room Nespresso machine, complementary bottle water). This is a true 5-star property.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Switzerland", "Title": "“Best Hotel Ever!”", "Author": "Co-Pilotin", "ReviewID": "UR116260906", "Content": "On our four week around British Columbia and Alberta we stayed at the Shangri-La three times (two nights / three nights/ one night) and it was spectacular. The service is excellent. When we arrived the first time we were asked where our trip would take us next and 30 minutes later we had directions and a weather forecast sent to our room. The rooms were all immaculate and the view overlooking the city of Vancouver was great. (It is after all the tallest building in town). The hotel is easy to get to by car from the airport or the highway and as there's an underground garage with a second lobby you can check in easily. As the hotel is close to the city center, shops, museums, Stanley Park etc, you don't need the car while staying in Vancouver. Whenever we had a questions or an inquiry we were being helped at once. There would've been a very nice spa and there's a gym which is well equipped and open 24/7. The food is Asia meets the West and you can chose between different breakfast options. Many people staying and working at the Shangri-La are Asian and the furniture and art in rooms and the hotel make it feel as if you were in a luxury hotel in Shanghai. We've seen a few placed so far but this was by far the best!", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Pforzheim, Germany", "Title": "“The worst SL I´ve been to as a Diamond....”", "Author": "Bad-runner", "ReviewID": "UR116059558", "Content": "Those who praised this one must have´nt been to any other SL before. As a diamond member, I have been to at least three other SL. The worst part of this one is´nt really the missing of the in-room check-in, it´s the missing of the Horizon Club - without happy hour. They say it´s due to the certain ban on serving alcohol by th BC legistlation!? ..similar to the Saudi Arabia?? Will definitely no return..", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Madrid, Spain", "Title": "“Amazing luxury hotel”", "Author": "CanadianinMadrid", "ReviewID": "UR114903095", "Content": "I stayed in an executive suite room for a week while in Vancouver recently and was very impressed with the hotel overall. The room was amazing, modern and a touch oriental, with every amenity included. It even had a lighting system for every room and electric drapes and blinds. The room was huge as was the bathroom. Service was excellent in every way. The parking was a bit hard to find, you need to actually go onto the street behind the hotel and then half way down the block is an entrance that takes you under the hotel to where there is a lower lobby. There is another lobby at street level. The location of the hotel is perfect as well, right near Robson street with many great restaurants in easy walking distance. I have stayed in many hotels in Vancover and this has become my favorite.", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Excellent. Highly recommended”", "Author": "ScottishVoyageur", "ReviewID": "UR114824146", "Content": "Spent 5 nights here and enjoyed our stay. A high class establishment which deserves its reputation for quality. Modern decor, excellent helpful staff. Loved the piano bar. Vancouver is a great city and this is a great place to stay.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "new york", "Title": "“Excellent hotel - but Fairmont Pacific Rim is better”", "Author": "talula001", "ReviewID": "UR114318507", "Content": "I stayed in different hotels during my prolonged stay in Vancouver. The Shanri-La is a top hotel, no doubt about it, and it feels very luxurious, so I totally agree with all other reviews that give the Shangri La a very good to excellent score. The staff is very friendly, and the rooms are large and nicely decorated. I also recommend their restaurant for dinner : delicious !!! Unfortunately, it cannot beat the Pacific Rim because the latter scores better on some points : - location : the Shangri La occupies the lower 15 floors of the tallest skyscraper of Vancouver in the middle of the city, so the rooms offer some view on the streets below. However, the new Fairmont Pacific Rim is located at the water edge, with tremendous views on Burrard Inlet and the possibility of a nice stroll along the water. - swimming pool & hottube is larger and nicer at Fairmont Pacific Rim - the room felt more spacious and modern at Fairmont Pacific Rim All in all, you cannot go wrong with the Shangri La Vancouver, but if you have the choice, go for the Fairmont Pacific Rim instead, which must be one of the best city hotels I ever encountered in the world (see my seperate review on them)", "Date": "June 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Manchester", "Title": "“Exemplary service, luxury worth the price”", "Author": "Timbo_82", "ReviewID": "UR114241090", "Content": "We stayed in an executive balcony king suite on the 12th floor for 4 nights at the beginning of our honeymoon. The hotel is very central, walking distance from most of Vancouver's significant attractions and in an area where we felt safe and comfortable. First and foremost we found the service absolutely excellent. The staff were chomping at the bit to go the extra mile to make our stay perfect. On the first day my wife realised she had left her contact lenses at home. One word to the concierge and they had called around several opticians and found us one of the few that was open on a public holiday. We asked them to reserve us a place for dinner at the restaurant on our way out one day and on returning had a full confirmation letter on printed on hallmarked paper and a telephone message just to make sure! The lobby is very plush but also quite modern. The corridors around the room were all clad in beautiful dark mahogany. The fittings in the room oozed quality and the view was superb, especially at night. The attention to detail in cleaning and room service was again excellent, every day of our stay the room looked perfect. We will definitely be back, we felt this was a great place to start our honeymoon and would recommended it highly to anybody looking for a real luxury experience in Vancouver.", "Date": "June 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Memphis, Tennessee", "Title": "“service was mixed, would not come back”", "Author": "derck0", "ReviewID": "UR112644813", "Content": "We arrived at the Shangri La and were welcomed in a proffesional way that impressed us all. The servicein teh hotel is very good, however on the first afternoon our daughter stepped in a small piece of glass causing her foot to bleed. I called and the response was that they did sent up a safety person with a first aid kit. You woudl expect that they woudl clean and vacuum the room to prevent a repeat. This did not happen, we got however a piece of chocolate cake for our daughter. We had dinner in teh hotel restaurant, service was again good, food not too special, have been in hotels that offer a more special selection and preparation. We stayed three nights, the last mnonting we had too leave early, on the other two days we returned to our room at 15:30 and our room was still not cleaned, again not a service I woudl expect from a hotel with this reputation.", "Date": "June 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver", "Title": "“Exceptional Attention to Detail”", "Author": "SDG_Business", "ReviewID": "UR109673944", "Content": "We hosted a two national conference at the Shangri-La in May and I have to say I was extremely impressed by their attention to detail. Every little thing was taken care of, there was always someone close at hand to answer questions or tend to any needs we had. From signing the contract with Josh and Joyce to dealing with Tyler the Chef, I was impressed by every member of the staff. Each and every person went out of their way to ensure that our conference went off without a hitch. I definitely would recommend the Shangri-La a place for business travel and conferences. All the out of town guests were amazed by how beautiful the rooms were and again how there was such an attention to detail with everything. Overall, it was a wonderful experience!", "Date": "May 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, BC", "Title": "“Perfect!”", "Author": "navsterangel", "ReviewID": "UR107959458", "Content": "My husband and I have stayed twice at the Shangri-La. It is definitely pricey, but once you stay there, you know why. It is absolute luxury, the rooms are amazing, beautifully decorated and very spacious. The service at this hotel is above anything I ever have seen. My husband just happened to mention while booking that it was our anniversary, and when we arrived in our room there was a large bottle of champagne on ice and yummy desert waiting for us. They really go above and beyond and there's been a note from the manager welcoming us both times. The second time we went, we got a couples package which included a couples massage in their spa, that was amazing too, but probably wouldn't have done it if we had paid separately for it (VERY expensive). The location is great too, near Robson and lots of other restaurants. Had breakfast both times in the on-site restaurant, very delicious and great service.", "Date": "May 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Langley City, Canada", "Title": "“Excellence at its best...loved it!”", "Author": "mar06252", "ReviewID": "UR107750980", "Content": "Even one night experience in such a grand hotel makes you want to strive for all that is out there in life to enjoy. To be treated with such excellence makes one feel more than special. There was absolutely nothing to complain about this hotel, we'll be back!", "Date": "May 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“This is an outstanding hotel in a spectacular city.”", "Author": "ppanessa", "ReviewID": "UR107547651", "Content": "The hotel is first class in all aspects. It is located in the heart of the city, close to everything. The furnishings are state of the art and the service is exceptional in all areas. \"Market\" restaurant is one of the very finest with high end service, quality and outstanding food. The chef is reknouned, and with good reason. It's the perfect restaurant for the perfect hotel!", "Date": "May 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Luxury in the city”", "Author": "nicoleprodoffice", "ReviewID": "UR107054057", "Content": "Had a girls' getaway and stayed in a beautiful room. The bathrooms are spacious and GORGEOUS. Nice touch are the Nespresso machines to make coffee, and the location can't be beat. A block away from the best shopping in the city. Everything is stumbling distance and the staff are very knowledgeable and helpful.", "Date": "May 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Shangri-La Hotel, Vancouver AMAZING!!”", "Author": "fawnmc", "ReviewID": "UR106890780", "Content": "The new Shangri-La Hotel, Vancouver is just a fantastic property. The entire stay was an experience more than just a hotel room. The spa is especailly wonderful.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Lost Horizon has been found at Shangri-La Vancouver”", "Author": "Chanelno3", "ReviewID": "UR106862516", "Content": "I had the pleasure of staying in an Executive suite on the 8th floor (rm 811). Massive corner room with a sitting area, generous bathroom double sinks, huge bed, wet bar nespresso coffee machine, mini foyer, and walk-in closet. The swipe card is your key to everything electronic in the room. Nothing is on or off - everything gently opens (the sheers and drapes) or softly comes up (the lights in the bathroom or at the spacious desk). Coolest light: the nigh light at ground level under both bed sides tables. Very helpful. Massive marble bathroom, amazing tub, 3/4 floor to ceiling windows. A balcony that is protected from the wind and rain but yet offers some Vancouver / ocean fresh air. Stellar walk-in closet which conjures old Shanghai with a real clothes brush, extended wooden shoe horn, and a real garment bag made of cloth. Safe with a felt-lined jewelry tray. Pocket doors, magnetic door hardware that once touching will trigger the light to turn off. The main entrance way to the hotel is on Georgia which cannot be used if you're arriving by car - weird. If you have a car, the entrance way is mid-Alberni on the north side sort of hidden but obvious once you zip past it about three times :) I have to say even though the car drop-off area and check-in works, it's a little odd arriving at the beautiful Shangri-la via the basement in a crumby car park. Walking around: lots to do - Tiffany's, Chanel, Brooks Brothers, JJ Bean, sushi, liquor store, church, banks, all in the area. Staff: so exotic, polite, helpful, gracious, with a great combination of style and a sense of humour. Dog: (dog must be under 50lbs) I had my miniature poodle with me. No problems. The hotel welcomed him: dog bed, dog bowls, and dog-love. Word for your dog, there are no green spaces within 7 blocks. Closest official dog park is at Nelson and Thurlow otherwise it's tree wells on your way to JJ Bean for a mocha. Sorry pooch.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "White Rock, Canada", "Title": "“Lovely hotel, tranquil and relaxing stay.”", "Author": "ddly", "ReviewID": "UR106741124", "Content": "The Shangri-La Hotel is an oasis in downtown Vancouver. Elegant rooms, attentive service and a very tranquil atmosphere. The perfect get-away.", "Date": "May 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Regina, Canada", "Title": "“First class accommodations bested only by an attentive staff.”", "Author": "Josh_Franklin", "ReviewID": "UR106587190", "Content": "I had the pleasure of enjoying the excellent accommodations for an overnight business stay. The room was very well appointed, had excellent views out of floor to ceiling windows and was a very much appreciated respite from a long day. The room was bested only by the staff and their plesent demour and excellent suggestions to best enjoy the city. On a playoff hockey night in Vancouver the concierge was able to not only suggest an excellent restaurant but phoned ahead allowing me to walk directly in to a waiting table. I highly recommend the Shangr-La.", "Date": "May 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Understated, 5-star opulance in a perfect downtown location!”", "Author": "SF_FoodieFood", "ReviewID": "UR105498702", "Content": "I stayed here for 5 nights on a hybrid leisure & business trip, and we both thought the experience was wonderful. The hotel itself is typical Shangri-La in look & feel, meaning, it is a beautiful, unfussy, simply decorated, quiet and welcoming retreat with gracious staff members always aiming to please. The lobby is split into 2 floors, lower lobby for reception & transportation, the upper lobby on street level for concierge & meet-n-greet. It the perfect vibe for those that are looking for an understated, elegant, private getaway; for those that don't want that uber hip, trendy, club-like atmosphere; and for those that have no care about being in the center of a hustle-bustle, conspicious, see & be seen lobby (such as the Fairmont Pacific Place). No doubt celebs stay here, but you get the sense that the Shangri-La is all about discretion and focusing on nothing but an excellent guest experience. The hallways are this gorgeous, dark floor-to-ceiling wood (zebrawood or rosewood?), and the rooms themselves have lovely floor-to-ceiling marble in the bathroom, amazingly comfortable beds, and high-class but simple appointments throughout. We got a room with a huge balcony, which was too cold to use, but provided great city views onto Alberni street. Every staff member was A+, from Adrian (concierge) to Christine (housekeeping) to Jay (food & bev mgr). We are just regular John & Jane Doe, but they made us feel like VIPs all the way. Hope to find an affordable rate here the next time I'm up in Vancouver!", "Date": "April 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kathmandu, Nepal", "Title": "“This Shangri-La is Meh..”", "Author": "MGohol", "ReviewID": "UR103136883", "Content": "Was in town for a convention and they billet us at the Vancouver Shangri-la. Was not excepting a having to beg for toiletries/amenities at a 5 star hotel. Internet was super slow and I couldnt connect to our office VPN. No club lounge and breakfast at the cafe was slow and mediocre. Hotel was in a great location, I give them up and they do have comfortable beds it just some things are looking a little worn out and threadbare. The pool changing room was dirty and I tried the Chi Spa which I thought was grossly overpriced.", "Date": "April 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Elegant and classy with wonderful staff”", "Author": "robert123London", "ReviewID": "UR101781539", "Content": "We stayed here for a one day stop-over in Vancouver on the way back from Whistler. The decor is modern, elegant and stylish, as one would expect, and the service equally stylish and professional. Our room was superb, a large twin, roomy, beautifully decorated and appointed, with a fabulous bathroom. The beds were amazingly comfortable. For the price, I would describe it as good value for money. We had a serious health issue in the middle of the night (nothing to do with the hotel) and they assisted us in the most caring manner, ensuring throughout that we had everything we needed, and that we were not troubled with extending bookings, late check outs etc., making us feel we were truly in the hands of professionals. Sometimes when things go wrong, you find out how good people really are and the staff at the Shangri-La did not fail us. A top-class and beautiful hotel with great staff at a sensible price - can one ask for more?", "Date": "March 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Roberts Creek, Canada", "Title": "“Ultra-Luxury - but very expensive”", "Author": "Sarasingh", "ReviewID": "UR101462660", "Content": "I stayed here last year with my husband when they were having a $100 dining credit promotion. It was beautiful, everything is luxe luxe luxe, but it is VERY expensive as well. You are checked in in the room itself, which is a little strange but emblematic of the Shangri-La brand. If you travel often and are looking for something different - this is a fabulous choice. There is nothing quite like the Shangri-La. Just check out the front entrance!", "Date": "March 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great hotel, great location”", "Author": "Tooheyspete", "ReviewID": "UR99833792", "Content": "Stayed here for a couple of days pre Xmas and then again for a couple of days after New Years 2011. My wife and I like to do a lot of walking when holidaying in cities and the shangri la was so central it was easy to get back to no matter which direction you chose to go. Add to that Urban Fare a gourmet supermarket just out the back door and you had easy breakfast, lunch or dinner (we had a baby so sometimes this was a great option). Service was always friendly and sincere and the rooms were beautifully furnished. Would stay there again for sure.", "Date": "March 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Amazing Experience, highly recommened !”", "Author": "Wingnutfilly", "ReviewID": "UR98710968", "Content": "The service at this hotel is by far the best I have ever experienced. Our room was amazing; dinner at Market was fun, romantic and both our dinner and breakfast were incredible! We went and relaxed by the pool and the gentlemen working made us protein smoothies that were to die for ! I spilt on my white blazer at dinner and they dry cleaned it for me that evening and returned it to my room, that’s service! Overall this beautiful hotel is my fav in Vancouver!", "Date": "March 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“The Industry Standard”", "Author": "Travelers974", "ReviewID": "UR96725732", "Content": "The ambiance of the Shangri-La is luxurious and tranquil. The professionalism of the staff made us feel welcomed from beginning to end. We have stayed in many hotels all around the world and the Shangri-la has raised the bar for the industry. Our next Shangri-la experience cannot come soon enough!!", "Date": "February 15, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "western Canada", "Title": "“Heavy scent ruins a beautiful place”", "Author": "visitingprof", "ReviewID": "UR95426688", "Content": "There is nowhere to escape the heavy perfume piped into every corner of this otherwise beautiful hotel. It's not just that I'm allergic to some scents, and violently allergic to this one. It 's that customers should be informed, and have the right to choose. Though marketed as their 'signature', it's not even natural, but reeks of chemical fakery. A kindly member of cleaning staff showed me the hidden openable window and with the heat/air conditioning shut off, it was tolerable -- provided I didn't mind the freezing cold. To get to meetings, I held my breath and dashed through smelly elevators, hallways and lobbies, then retreated to my room for meals and (chilly) sleep. The beds, linens, amenities, room and bath are lovely. A major high-end hotel should have the courtesy to tell guests in advance about its perfume-permeated environment and give them a choice. Offer it on a particular floor, or in selected rooms. Don't ruin the entire hotel, and don't ruin my entire stay! Public places are now smoke-free; many are also scent-free. This is a wake-up call to management. You charged me a fortune for a room that was a misery and a hazard to my health!", "Date": "February 3, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Sad to say...I was disappointed”", "Author": "dragoneti", "ReviewID": "UR95147978", "Content": "We stayed at the Shangri-La Vancouver for 4 nights in January 2011. I had originally paid for a superior room with twin beds and without breakfast on the hotel website, but they were nice enough to change it to the Winter Wonderland package upon request. This included breakfast ($60 credit/day for 2 pax). The cost was CD$347/night inclusive of taxes. The location of the hotel is perfect. Right in downtown Vancouver with Robson street, the main shopping area, just behind the hotel. However, the layout is unusual as the main reception is one floor below ground level. Tell your taxi driver to enter the underground carpark which is where you will find the entrance to the reception. This is great for people who want privacy. The doorman was efficient in opening the car door and getting our bags. The reception area was small and thus gave the feeling of a private check-in for guests. The receptionist was very welcoming, friendly and ushered us to the lift. The hotel is the tallest building in British Columbia and occupies the first 15 floors. Our room was located on the 14th floor. The room was of adequate size for a Superior room. The interior design was zen-like with chinese paintings on the walls. There was a hand written card from the manager welcoming us to the hotel which I thought was nice. We had a great view of the city surrounded by office buildings. The flat screen TV was the largest I had seen in any hotel room. You could control the intensity of the room lighting (instead of just on/off) but I found the room to be very dim; great for those who want to get some sleep! You could draw and open the blinds and curtains with the touch of a switch. The beds were exceptionally comfortable. The minibar was adequate with a nespresso coffee machine. They also provided welcome fruits (only on the first night), complimentary daily newspapers and free mineral water bottles during turn down service. The bathroom was almost all marble and was beautifully designed with the usual L’occitane bath products. The TV in the mirror was certainly a pleasant surprise! However, I felt that the bathroom was quite small (maybe because it was a superior room). There is complimentary internet in the room. Alternatively you could use the business centre with internet, fax and printing services. The Concierge is located on the street level which is where the hotel’s main lobby is located. This place felt more like the entrance to a private luxurious living room with a warm fireplace, large chandeliers and plush sofas. It didn’t look like your usual hotel lobby and you would never find large group of tourists hanging around. You really have to get acquainted with which entrances lead to the hotel lobby as we walked into the residential entrance and had to walk through a “maze” before we found the lifts to the hotel rooms. The main lobby entrance was very understated with 2 chinese lion statues at the revolving door. There was no doorman to welcome you. They really should have more staff in this area to attend to the guests as I felt that the Concierge was always busy. Before I arrived at the hotel, the Concierge was extremely helpful in providing information on day tours and booking transportation to Whistler. Communication was done efficiently via email. During my stay, the Concierge was helpful in pointing out the local sights and recommending dining options. They even had the restaurant menus! However, I felt that they could have taken it to the next level and have been more personal rather than just telling me information which I could google from the Internet if I had time. We had breakfast at the Market restaurant everyday. The service was great and one of the waitresses (she seemed like eastern european) was exceptionally friendly and talked to us about the weather and places of interest in Vancouver. The food was good, not exceptional. Don’t order the chinese breakfast. I didn’t like the french toast as it seemed as if the toast was deep fried and too sweet for my liking. The banana pancakes were great! What I didn’t like. The layout of the hotel is unusual as tour buses cannot stop anywhere along the hotel to pick you up. We had to wait for our Whistler coach at the Hyatt hotel which was a 10-15 minute walk away. When we asked the hotel how we could get there, they suggested walking there. I’m sure they could have considered the fact that we could have many pieces of luggage and dragging it all the way to the Hyatt in the horrible Vancouver rain wasn’t such a good idea. It would have been nice if they offered hotel transport but we took a cab anyway. The hotel was certainly splendid like any other Shangri-La should be, but it lacked the hospitality, sincerity and personal touch which I have experienced at other Shangri-La hotels. They don’t really value their guests here. I had to call room service 4 times (over a span of 2 days) before I could get two pairs of bathroom slippers and the mineral water that I asked for never came. This is absolutely unacceptable especially when the person on the other line tells you “we will get it for you straight away”. I also question what benefits a Golden Circle member could enjoy at the hotel as I could see none being a member myself. So why bother having such a membership programme in the first place? If I were to return to Vancouver, I’d probably stay at another hotel such as the Four Seasons where I would most likely get better service.", "Date": "February 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newcastle, Australia", "Title": "“Christmas in Shangri-La”", "Author": "C0nstantlyOnTheG0", "ReviewID": "UR94722648", "Content": "After the rave reviews on Trip Advisor, we booked 4 rooms for the extended family, and were not disappointed. The hotel was sensational; very personal, which is often lacking in 5 star hotels; centrally located and within walking distance of all sites and shopping; located on West Georgia, probably the most central street in Vancouver; and located next to Urban Fare probably one of the best run deli/market stores we've seen anywhere in the world. The rooms were exceptional. Although we had a suite to accomodate 3 teenagers and 1 adult, we were very comfortably and luxuriously accommodated even to the point that a tv was located within the bathroom mirror. The kids loved that little inclusion. The beds were to die for and a pillow menu was available. The hotel gym located on the first floor was home to first class equipment and overlooked the streetscape of Vancouver with a heated pool in the vicinity. Wi-fi was free. Shangri-La gives true meaning to the 5 star experience. Service was superb at every level of the hotel and truly personifies an exceptionally managed hotel. Should we return to Vancouver we will definitely rebook.", "Date": "January 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“The Most Amazing Hotel in Vancouver, The BEST!”", "Author": "Simonsmiles", "ReviewID": "UR93877647", "Content": "This hotel is a five star, that truly rates a five star. It's location is amazing, perfect for both business and leisure, great shopping and restaurants all around the hotel. The views are stunning and the rooms are fantastic. The staff are so wonderful and helpful, going out of their way to exceed all of my requests. I recommend this hotel to everyone, live like a King when your in Vancouver, and sleep like a baby. This is truly one of the most amazing hotels in the city.", "Date": "January 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New Brunswick", "Title": "“Elegant and serene”", "Author": "keenvisitor", "ReviewID": "UR93871994", "Content": "First let me state that I did not stay at this hotel. I went there for lunch (review already posted) and was cheeky enough to ask if it was possible to see a room. I was shown 2 rooms, one standard, one executive, and the spa. (and no I did not tell them that I planned to write a review) Both rooms were spacious with top quality furnishings and linens. The style was understated elegance and every convenience was provided - even a walk-in closet in one room. The bathrooms were amazing - all marble with dual vessel sinks, large tub and powerful looking showers. Each of the rooms also had a balcony. The spa was tranquil with subdued lighting and the treatment room I saw was an oasis of calm with private shower and huge tub, fluffy robe and slippers. It was relaxing just to visit. The outside all year pool looked very inviting. The decor throuout the hotel was elegant and calm. lots of wood , a water wall, asian inspired hangings and a total feeling of quality. Naturally this quality is reflected in the price but one would expect that to be the case. The staff I spoke to were all extremely polite and helpful, especially the concierge who arranged for me to tour the rooms. The one slightly odd thing was that the main enterance is on the car park level - excellent privacy for the famous but hard to find when going for lunch. The street level eentrance brings you to the concierge desk where you will be courteously directed to your destination. I will deffinately consider this hotel for future stays.", "Date": "January 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Best hotel expereince in North America”", "Author": "SafaAlak", "ReviewID": "UR93435056", "Content": "I am frequent traveler in North America. I spent about 50% of my time in hotels. I am delighted by the quality of service at the Shangri-La at Vancouver. The room is excellent and the food was amazing. The price I paid for the hotel and food is so reasonable. This hotel will be my home in Vancouver.", "Date": "January 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“One Romantic New Years Eve at the Gorgeous Shangri-La”", "Author": "MortgageMike72", "ReviewID": "UR92784978", "Content": "My wife and I have lived in Vancouver all of our lives and when the opportunity came up to spend a night at the newly built Shangri-La Hotel for New Years Eve, we couldn't resist. We had heard so many wonderful things and were very excited. Our good friend Jeffrey Victor happens to be one f the concierges at the Hotel (although he was not working the night we stayed) and arranged to have a fabulous corner suite (the view rooms were all sold out by the time I booked) with a nice bottle of wine and fruit basket awaiting our arrival. It was one of those 550+/- SF units with a bar area and living room, and office with a flat screen TV (in both rooms) and even a TV in the bathroom MIRROR!!??!! The marble bathroom might have one questioning if there was any marble left in the world?! Flood to ceiling and heated floors! We didn't want to leave the room but I promised my wife some shopping on Robson before New Years dinner so off we went. When we came back, we just relaxed, watched some TV and enjoyed our bottle of wine until our late seating (9:30) at The Market restaurant down below. The restaurant was below our expectations due to the poor service. There were far too many people for such an intimate 6 course set-menu that we weren't eating our main until closer to midnight. However, the food was INCREDIBLE! My wife was not feeling like eating at that hour and was pretty full so we ended up taking our food back down to the room to eat the next day. All of our drinks were comped (all 6 of our 11.00 Martinis) for the inconvenience. It was hard to be angry as we didnt have far to go after dinner to get back to our room and the food was amazing after all. The next morning, I hit their state-of-the-art fitness facility for a workout (Damn, that was hard!) and enjoyed a delicious protein shake from their smoothie bar afterward. I went downstairs and next door to the Urban Fair market and grabbed us some delicious breakfast items to bring back to the room and called down for a late check-out (until 1PM). All in all, it was an incredible 24 hrs and we would not hesitate to stay again. It was an oasis in the city. I vacation in our own home town.", "Date": "January 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“absolutely brilliant!”", "Author": "subo-lover", "ReviewID": "UR90250494", "Content": "What a fantastic hotel! great service and very luxurious, comfortable rooms.", "Date": "December 19, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London", "Title": "“Top Class”", "Author": "Blankko", "ReviewID": "UR89431072", "Content": "I had a pretty good start to my Vancouver Shangri-La experience as upon arrival I was informed that my room had been upgraded to a suite. The suite itself was all I could have expected. High quality fittings, large super modern bathroom and very comfortable in every respect. All the staff I came into contact with were very polite and helpful. In addition, the hotel was in a great location close to all the main sites and areas of interest. Would I stay here again? Yes.", "Date": "December 9, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Awesome until money was stolen.”", "Author": "goldpanner99", "ReviewID": "UR88681376", "Content": "This is a great location, right downtown, and the staff for the most part was fantastic. Service was great, we had a business reception, and then dinner at the restaurant, both went very well and were highly praised by attendees. Then we got back to our room and found almost $300 missing, from an envelope (birthday money my wife had received that day) and from my wallet in my pants i had changed out of for the reception. Management was concerned, but \"this has never happened here before\" is not even close to a sufficient response. After a 2 week \"investigation\" they decided it was indeterminate, whatever that means. Well, you know what? It's not undecided, you have a problem at your hotel. I guess you can still say it has never happened because nothing was proved, but honestly how many \"investigations\" does it take before you wake up? We know how much money was missing, you know (from the key reader) who went in the room, it's not rocket science here.", "Date": "November 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great location, comfortable room, relatively quiet. I'll give it a \"4\".”", "Author": "david_k001", "ReviewID": "UR88673629", "Content": "Located within walking distance to Stanley Pk., Yaletown, Gastown and the Skytrain, I couldn't have been happier with the location. The room and common areas were clean, not much of a view from the room though, and, with the exception of the cleaning crew going in and out of the adjacent unit, the hotel was quiet and I was able to sleep well in a comfortable bed. Wifi is included in the rate, so that's always good. Decorated in a transitional motif, I was pleased with the surroundings. The bath is clad in marble with a separate soaking tub, shower and flat screen. The room has the obligatory large flat screen, subwoofer and iPod dock, so you have what you need to work, relax and sleep. There's also a small refrigerator filled with beverages, but there's room to add a few things of your own in the event that you don't want to pay about $8 for an Evian. I'm not certain whether the hotel considers itself a four star or a five star property, but I'd say it's a solid four. From a service standpoint, I was slightly amused that no one offered to help with our luggage even though we were escorted us to our rooms. The gentleman guiding us to the rooms was full of conversation, but didn't take notice that we were a bit jet lagged and, under the circumstance, would have appreciated a little assistance with the bags. It wasn't the end of the world by any means, but if you're marketing a property in a certain manner, I guess I have certain expectations. Aside from a couple of other glitches (room was being cleaned when we returned around 4:30 PM (admittedly we left the room around Noon, so perhaps we're slightly at fault? and running out of some supplies), I'd consider another visit.", "Date": "November 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Westwood, California", "Title": "“Has taken a few steps backwards, not what it once was...”", "Author": "WestwoodGlamGirl", "ReviewID": "UR87722922", "Content": "Seems this Shangri-la has taken a few steps back toward mediocrity. Still same great service but room amenities have either disappeared of gone down hill. Towels are looking a little worse for wear, linens and bed are still very comfortable. They are now skimping on the l'occitane toiletries, no more dental kits. Laundry bags are now plastic when once cotton. Breakfast at Market is so-so and when considering the price; just over priced. Location is great, valet parking attendant on the money. Considering they are charging more than the 4 Seasons, Loden and L'Hermitage; you can get better bang for your buck elsewhere. By no means a bad hotel, just not worth over $200 a night.", "Date": "November 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Sublime”", "Author": "AC-Elite", "ReviewID": "UR87078698", "Content": "I took a risk with this hotel - it wasn't the nominated conference hotel in Vancouver, but it had much better TripAdvisor reviews that the 'conference hotel'. And boy, did that risk pay off: the Shangri-La is a real haven of luxury and modernity, with everything carefully considered. The hotel is really well-located and has a fantastic supermarket with great fresh produce below - BC blackberries (the eating kind, not the crackberry kind) were a daily addiction. And for those less healthy moments, there's a Tim Horton's across the street. The rooms are amazing, with nifty little touches (tv screen located behind the bathroom mirror so you can watch the news while you're shaving). And when you close the curtains, the room is so dark (and perfect for sleeping) that you're in real sensory-deprivation territory. A real treat was the afternoon high tea service - the full traditional English style with some carefully-considered Asian inspirations. And the service was impeccable, flawless and warm. I cannot recommend this hotel highly enough.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Alexandria, Virginia", "Title": "“Awesome Hotel with great service”", "Author": "Natsfan24", "ReviewID": "UR87069916", "Content": "This might be the best hotel I have ever visited. The service from beginning to end was wonderful. Staff was quick to assist with any concern and to provide great ideas for what to do in Vancouver. The room was just perfect. Comfortable, with a great shower and bath, along with curtains you control from bedside. There was an Ipod deck next to the bed that played on the great sony flat screen in the room. It was a very quiet room and from the moment you walked in and saw a fresh fruit plate welcoming you, you knew it was a special place. The spa was beautiful and the pool area is outside and inviting. This is a great hotel.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NY", "Title": "“Excellent stay, excellent service”", "Author": "medicfx45", "ReviewID": "UR86287629", "Content": "I was a solo traveler, and had a, Executive King (free Internet) that was facing the city side, and has a balcony. I was there Oct/Nov 2010 and rate was ~ $280 a night with ALL taxes included (possibly a bit less) - to get an idea of rates/costs. Excellent service from the underground check in. Has to be designed that way to avoid a traffic jam at street level. Very minimalistic environment, but very efficient. I was assisted with luggage and exiting the taxi, and they already knew my name! Spooky! They must have looked at my luggage tags? There are 2 check-in stations and check-in was smooth. The hotel is high tech. The room was big! Plenty of room to walk around, separate sitting area with couch, armchair and a huge TV (DVD). A big desk was also in the room and all lights are controlled by electronic dimmer switches. All drapes and sheers are also electronic/automatic. Internet (high speed) was free. There was always free bottled water delivered every day. There is a Nespresso capuccino/lungo machine in the room for free use, pods included. Plenty of item in the fridge, wines, etc, if you choose to use those. Plenty of teas are also available. Good enough size of a closet, with ironing board, free shoe shining service, umbrella in there for your use, just in case. Bathroom was big with a little TV incorporated in the mirror. Big shower, and separate tub. I believe no jacuzzi. Bathroom was all white marble, floor and walls. Looked awesome. Balcony was decent size, with table and 2 chairs. But it does face a busy street, but it's always good to have. Rooms service was great. They service twice a day. Between 6:30-930 they come to make your bed and prepare for the night. Cleaning crew addressed me by my last name. The lobby is again low key, it serves as the lobby for the condos as well, separate elevators, so you won't see extra personnel there. 1-2 people at the concierge. I never had to ask for much so I cannot report on how efficient they may be. Business center - only used it once, free internet, to print something. Pool - did not use - too cold... Food- only used in-room service twice - great service. Did not use bar/restaurant. Convention center: 10-15 minute walk. Easy. Overall: very happy with location and service. only reason I would stay elsewhere would be to be on the water with water views, but I would likely not give up the good service and the good, downtown location.", "Date": "November 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Perfect way to mix business with pleasure”", "Author": "jmrmd", "ReviewID": "UR86223439", "Content": "I was in Vancouver for a conference. Shangri-La was able to make my trip a true mix of business with pleasure. It is a 5 minute walk to the convention center thus making it very convenient. However what made my trip great was that after a day of relentless information, once I got inside the hotel, I felt relaxed and away from the madness of the day. The hotel is as I want hotels to be, nonobtrusive and private. Though it appears quiet, the staff is readily available, courteous and friendly. There is none of the \"clubby scene\" encountered with most other hotels. The bed and the pillows are the most comfortable I've ever had.", "Date": "November 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“A sophisticated, stylized hotel that doesn't scream \"Hotel\"”", "Author": "amanwarren", "ReviewID": "UR86079353", "Content": "A great find and addition to the Vancouver hotel scene. The low-key nature of the hotel makes it even more inviting -- yet there is no sacrifice on the design, service and room quality. Also very conveniently located within walking distance to so much the city has to offer. Great recommendations from the Concierge staff. Great spa (a call out to the massage techniques of Gerald) and hotel gym. Would return in a heartbeat. Makes me want to check out other Shangri-La properties.", "Date": "November 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ashburn, Virginia", "Title": "“Lovely hotel in the hart of the city”", "Author": "VaTravel", "ReviewID": "UR85506609", "Content": "I was supposed to stay in Shangri-La for two nights on my recent trip to Vancouver, however, due to the mishap with the reservation system we only spent one night in this property, but here are my observations: Room: Really nice, clean and spacious. Originally I was booked to a Superior room, but I was upgraded to the Deluxe room. When we entered the room we found a fruit bowl and some nice chocolate-chip cookies waiting for us along with the handwritten note from the hotel's General Manager welcoming us and wishing us a nice stay. I thought it was a very nice personal touch. Room itself was spacious, had a nice \"office\" area and I loved the nice, clean bathroom. The toiletries were good and beds were very comfortable. The only drawback was the fact that the coffee machine in our room did not work, however, we had a great selection of teas and that made up for it. Service: The front desk staff and the manager on duty were exceptional. As I mentioned earlier, there was an issue with the reservation, and basically the property did not have a room for us on the first night. The manager on duty handled it with the outmost class and kindness. I must say that I was really impressed by her people's skills. We were offered a room in another hotel along with the breakfast (which was included in our stay in Shangri-La) and transportation. When we returned to Shangri-La the next day, both valet and the front desk staff greeted us by our names and the manager herself checked us in and showed us to our room. One of the concierges was very nice and helpful. We were lost on our day of arrival, since we could not see the entrance into hotel (it is under ground), and the concierge came out with me to show me where to enter the garage. Another concierge was not nearly as nice and certainly had an attitude and very cool and standoffish demeanor. Not sure why he was acting like that, but it was so apparent, that even my sister, who does not speak a word of English, asked me after i spoke with the concierge if he was not very pleasant, or helpful. It was that apparent even from the body language and his facial expression. Location: Location of the hotel is superb, close to all major attractions and to the Vancouver Tram bus. Lots of great restaurants are within walking distance, lots of shopping is close by. Restaurant: We ate breakfast at the Market, and were not impressed at all. Service was very impersonal and extremely slow. As a matter of fact, several tables that were seated after us, were served before even though we did ordered the same food as everyone else. Considering that we had a child at our table, it would have been nice to get at least her order a bit sooner. Overall Impression: I picked Shangri-La over other comparable hotels because I had a great stay in Shangri-La Sydney. While Vancouver property is not quite on the same level as the Sydney one, I must say that I still truly liked this hotel and enjoyed my visit. I think the genuine kindness and professionalism of the hotel manager and the front desk staff certainly made up for any other shortcomings that we experienced. Room was great (see pictures) and location was excellent. I would certainly recommend this hotel if you are considering a visit to Vancouver.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“A Perfect Hotel for a Perfect City”", "Author": "febryle", "ReviewID": "UR84974399", "Content": "What a delightful and beautiful hotel! I concur with the vast majority of the 5 star reviews. Our stay at the Shangri-La Hotel was fantastic, with wonderful service from the concierge, registration desk, and bell staff. The room was fantastic with a great view and by far the best hotel lighting. The hotel's in a great location with convenient access to most of downtown Vancouver, including walking distance to Stanley Park. Our only complaint was the service at the hotel restaurant (Market), which was below par for any restaurant, let alone a high end one like this.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Laguna Beach, California", "Title": "“Impeccable service in a beautiful hotel”", "Author": "welltravelled8888", "ReviewID": "UR84346236", "Content": "My husband and I stayed at the Shangri La for three nights the beginning of September to celebrate my birthday. I selected the Shangri La based on previous reviews on Trip Advisor. We booked our room on Expedia and got a package for a superior room in which we stayed for three nights and paid for two nights. I made several inquiries to the Concierge desk before our arrival regarding airport arrival, transportation from the airport and restaurant suggestions. All the concierges were extremely helpful and professional and this continued thru out our stay. From the moment we arrived, every staff member without exception went above and beyond to make our stay extemely enjoyable. My husband and I seek out 5 star hotels and have travelled extensively worldwide. We have found that while amenities are important, the truly exceptional hotels have impeccable service. Our experience at the Shangri La did not disappoint. Other reviewers have commented extensively on the hotel amenties. While our room was just a superior room (I think this is the lowest category) and it was somewhat small, it was beautifully furnished and maintained. Although our room was on George Street, traffic noise was not an issue. Knowing that the hotel is not a water view hotel, we actually had a nice small view of a nearby boat harbor.The bathroom was of generous size and comfort and beautifully appointed. When we requested an additional sitting chair (the room had only one) It was brought almost immediately. A request for all decaf pods for the expresso machine, done. Thoughtful handwritten notes left by management and staff. Lovely. The hotel is beautifully decorated thru out, the spa in particular. The gift shop is quite small and should be expanded. They have a limited amount of Shanghai Tang items (too bad), but if you like the fragrance in the hotel, you can purchase it there. The location is ideal for walking to various sites. One day we took one of the free (tips appreciated) walking tours of Vancouver neighborhoods (Two guys Vancouver) Great! Very informative. The Urban Market next door is great for any food items you might like. We had dinner at Market one evening; the food was delicious, the service superb. The ambience of the restaurant is very soothing and refined, without being stuffy. It was a delight to return to this calm oasis each day. Thank you Shangri La staff for making my birthday so special!", "Date": "October 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "avalon1025", "Title": "“Was expecting more....”", "Author": "avalon1025", "ReviewID": "UR84218923", "Content": "I originally had planned to stay at this hotel in May, but my reservation was not able to be honored as the hotel was full. Fast forward to October and I finally was able to stay at the hotel. Overall, I wished I had stayed at the Fairmont Pacific Rim. The room was nicely decorated and the beds comfortable, but my room was tiny for the price. More than one person and the room would have felt overcrowded. I left my roomat 9AM, returned around 2 to find my room had not been cleaned, when I enquired with guest services I was told they clean rooms through 4:00 (and what I would get turn down an hour later?). I was not able to use my room that afternoon as I did not want to be in the room with the maid. Cabs in Vancouver can never find the entrance and end up dropping you off at random spots around the hotel Overall, a nice quiet hotel, but not has 5 star as the reviews had lead to believe.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Romsey, United Kingdom", "Title": "“You'll never want to leave your room..”", "Author": "casmick", "ReviewID": "UR84000943", "Content": "..if it is as good as ours. From the moment we arrived, tired after the train from Jasper, we felt at home. The receptionist gave us some great advice about what to see in the city, gave us all the info on the room and led us to the lift. The room was spectacular, flat screen in main room and bathroom, a bath to swim in and soft fluffy gowns.Throughout our stay the staff could not do enough to help, the concierge told us the best way to everywhere, he knew everything about the city. The location is perfect accessible to all the city on foot. Overall an amazing stay which concluded a brilliant holiday in Canada.", "Date": "October 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dresden, Germany", "Title": "“great location, convincing restaurant”", "Author": "fritzrudolf", "ReviewID": "UR82769155", "Content": "clean and light shangri la like rooms, looked welcoming even if the hotel wasnt recently renovated, the location close to the new convention center, the harbour and Stanley park is nice, very friendly and efficient staff (reception as well as concierge), totally convincing restaurant offering tasty light food", "Date": "October 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Vancouver's premier hotel”", "Author": "Brianrg", "ReviewID": "UR82514980", "Content": "Wow, I don't know where to start. From the moment you walk in to the time you check out the Shangri La is 10 out of 10. The staff are incredible. The Market Restaurant is outstanding.", "Date": "October 7, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“The hotel has a keen interest in getting your money and not doing too much for it”", "Author": "duncan_kirk", "ReviewID": "UR81996489", "Content": "To be fair to this hotel, it is clean, in a good location, and the rooms are of a good standard. Little deatures like the Nespresson coffee machine are good, but it is undone by there being no millk to make coffee. That was fairly typical of this hotel. Finding the entrance, if you are arriving by car, is a challenge as it is on a different street to the hotel's address. Once you're there, you check in in the basement. We arrived at 3pm and had to wait 45 minutes for our room, which was unacceptable. Room service was expensive and of a very average quality, but the room itself was pleasant. The bathroom was large and whilst there was an in-built TV in the bathroom mirror, it was tiny and you couldn't see it from the bath. Again, fairly typical of this hotel - a good idea poorly executed. We also had issues with the TV in the room in that we couldn't turn the TV off. Two hotel engineers later and after being told by both engineers and the concierge to try pressing the off button on the remote, they eventually figured out that the remote control in the room didn't match the TV! An hour or lost sleep later and it was finally resolved, but by then, we had a pair of sleep-deprived kids. Location is good - 2 blocks to the main shopping area. It's a long walk to Stanley Park though. Overall, not a great experience for a hotel charging these prices and we would seek to stay in one of Vancouver's many other 5 star hotels next time before staying in the Shangri-La again. There are bound to be one or two that would appreciate the custom, which this one certainly didn't.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "richmond", "Title": "“Wonderful hotel”", "Author": "Rod62", "ReviewID": "UR81990886", "Content": "Wonderful hotel! Quiet, serene, luxurious without being gawdy. The room is lovely, the breakfast and service devine, and the location is perfectly located in beautiful downtown Vancouver. Having the Urban Faire grocery store next door for munchies and treats was a bonus. We would definitely recomment this property.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Luxurious hotel with exceptional, unobtrusive service and a great location”", "Author": "cswebb13", "ReviewID": "UR81411562", "Content": "My girlfriend and I stayed at the Shangri-La for a relaxing getaway, and everything was fantastic. Service was excellent and professional but not obtrusive or 'snobby'. The public areas are scented, which was really nice as the scent was very pleasant. The hotel itself is the tallest building in Vancouver, and very architecturally striking. The lobby is classy, and check-in was efficient and professional. Our room was large, furnished asian-style decor, with dark woods, and soft lighting. The bathroom was a great size, not ridiculously huge, but comfortable; all marble, with a separate enclosure for the toilet, and a TV in the bathroom for news while getting ready or having a bath or shower. The bath products were from L'Occitane, and were a very nice touch. All the amenities were provided. The bed was insanely comfortable, very soft, and they offered a choice of pillows, and a nicely weighted duvet. There was also a 42\" flat screen Sony TV and ipod dock, which was a nice touch. At night when we came back to the room, we found our room had been prepared for sleeping, and had a hand-written note and a plate of fresh fruit and bottled water provided for the evening. We spent the latter part of the evening at the outdoor pool and hot tub - and had the entire area to ourselves. The pool is quite small, so not suitable for many people and not a great destination for kids), but it had nice lighting and fountains, and the hot tub was nice. I noticed the pool area had a lot of tiling missing, and was dirty in some places around the pool edges. Cabanas were also provided for daytime relaxing. Being in a hot tub on the rooftop in downtown Vancouver is a nice way to spend an evening. Our hotel stay included a $76 ($38/person) breakfast credit in the hotel's restaurant (Market by Jean-Georges). Breakfast was exquisite. I'd heard many great reviews of the French toast, and it did not disappoint! perfectly cooked. My girlfriend had eggs benedict and granola with yogurt, both presented and prepared perfectly. Fresh-squeezed grapefruit juice not to be missed! Service in the restaurant was exceptional, as was the decor and atmosphere. We were pleased with the entire experience at the Shangri-La - from the moment the building takes your breath away, to the exceptional and unpretentious service, comfortable and well appointed room, and fantastic breakfast. All around, a highly recommended experience.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "3", "Location": "1"}, "AuthorLocation": "San Luis Obispo CA", "Title": "“Too noisy and the rooms aren't that special”", "Author": "scfphoto", "ReviewID": "UR80982994", "Content": "Located on the busiest street in the city with very poor construction, this is a noisy hotel and not the sanctuary you crave. Rooms are obviously newly done but they lack real style and even an executive suite is quite small. Linens and spa are exquisite. Staff is helpful. We tried moving rooms but it was still difficult to sleep, even with ear plugs. We changed to the Loden on our way back thru Vancouver and truly liked the rooms; it was significantly quieter and had a better view.", "Date": "September 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Impeccable service and luxury to the nth degree”", "Author": "cohenprof", "ReviewID": "UR80975942", "Content": "The concierge service at this hotel is the finest I have ever encountered!!! I emailed and spoke with Sureena on several occasions prior to the trip. She was extremely helpful and professional. It was such a pleasure to work with her. She arranged for a car/driver to pick up my parents from the train station and to take them on a guided tour of the city. She took care to address my questions about the Vancourver Art Gallery and various restaurants etc. Every detail requested was taken care of including what I wanted supplied in the hotel room, and ensuring that Tammy was available to carefully explain all the details of the room -- everything is automated -- lights, curtains etc. My parents had never seen such luxury -- the bathroom is the same size of a usual hotel room. The services in the hotel and the restaurants are superb. As my father had difficulty walking to the restaurant, Richard, the restaurant manager, and Virginia and David, helped to provide assistance and ensured my parents had a special evening. This is a place where they take care to serve your every need. This is amazing hospitality. The hotel is well located and is sumptious in its design. If you want to have a special experience and pamper yourself -- this is the place to be. They have a fabulous spa in this hotel -- perfect for a romantic holiday.", "Date": "September 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Little Rock, Arkansas", "Title": "“Because this hotel is totally awesome, you will have trouble checking out”", "Author": "user980401", "ReviewID": "UR80786297", "Content": "My room was so delightful, that I didn't want to leave it. The room was immaculate, very clean. The bathroom was my favorite, with a huge soaking tub, see thru shower, and a tv in the mirror. Everything in the bathroom felt and looked like white marble from the border around the tub to the tile on the floor. The bed was unbelievable, so comfortable that it made the Hilton and Marriott hotel bed feel like a Motel 6 bed. In general, the whole room was elegant with wood that looked like mahogany. As a single woman, I felt very secure because you have to have a room card to activate the elevator, your room control, and other facilities throughout the hotel. I loved the technology, just push a button and the drapes would open, lights dim to reading, evening, or night, even \"do not disturb\" under your room number lights up at the push of a button. At most hotels, you can hear everyone in the next room. I didn't hear anyone in the neighboring rooms. Very quiet and nice large room, equal in size to any hotel suite room. This hotel was awesome, and I would suggest it to anybody that wanted to stay in a nice hotel while visiting Vancouver. It's in a excellent location in downtown Vancouver. It's close to the pier for cruise ships visitors, like myself, Robson St., Stanley Park, Amtrak, and restaurants galore. I paid a little over $300 a night on Expedia and got an awesome room at the Shangri-La with an incredible view and breakfast. The service at breakfast was excellent. They had fresh squeezed orange juice! I had the pancakes with real Canadian maple syrup, bacon, and fresh fruit. My favorite special touch was that in my room each day was a complimentary bottle of Whistler water, and a fresh fruit plate (banana, apple, and plum) that had a very special note, with my name hand written on it, that welcomed me to my room, and the Shangri-La. I've stayed at a lot of hotels including the Waldorf Astoria in Orlando, and Royal Hawaiian in Honolulu, and this hotel was more awesome than any hotel that I've ever been blessed to encounter. My only regret is that I couldn't stay longer at the Shangri-La, I even begged for a late check out time, but it wasn't available because another guest was waiting on my room. The business center was even elelgant with big screen Sony computer, with free internet, and 5 print pages. The lady that helped me in the business center was great, and very nice. Even the people that greeted me at the door, and parked my car, bent over backwards to help me find locations in Vancouver. There were people needing to get by me in the parking garage, and the doormen stayed calm, and nicely gave me directions to the Amtrak, and post office. One of the doormen, even programmed my GPS! I guarantee that if you stay at the Shangri-La hotel, you will be pleasantly pleased and impressed with this hotel, and customer service. Every staff member seemed very concern about me having a good time and constantly asked me if I needed anything to enhance my visit. Shangri-La thanks for a wonderful visit in downtown Vancouver. Currently, I'm still dreaming about that huge soaking tub, tv in the mirror, and pancakes with maple syrup! I wish that room 1506 would have fitted into one of my bags. I would have loved to have taken a piece of the Shangri-La home!!!", "Date": "September 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "chicago, illinois", "Title": "“Exceptional Service!”", "Author": "ciaobella50", "ReviewID": "UR80767750", "Content": "During a recent Alaskan Cruise due to mechanical difficulties we were unable to visit Vancouver. So we decided to go on our own. After researching hotels we decided on the Shangri-La. Thank goodness we did!! What exceptional service. Jarren the concierge never and I mean never steared us wrong!! We enjoyed every minute of the 3 days we had, we had great food, drink and hit all the great spots. If he didn't take the time each day to help us out and point us in the right direction it may not have been so rewarding. He went above and beyond. The hotel is just glorious, amenities are superior and the spa also is top notch. If you have the opportunity go, don't pass this one up!!", "Date": "September 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Shangri-La Vancouver BC”", "Author": "RandolphJames", "ReviewID": "UR80611584", "Content": "This is the highest level of service I have ever experienced in a hotel. I have stayed at many 4-5 star places (including the other nice hotel \"L\" nearby) and I must say this was so far the best. There was something about the way the people who worked there had a genuine appreciation for you being there. Unlike many \"expensive\" hotels that can be snobby, these people treat you with respect and genuine kindness. When we arrived in their car reception area they were so nice and professional on how they handled everything. We were driving our hybrid and most of the cars there were very expensive including a Lambo parked up front. Again they treated us with the highest level of service regardless of what we were driving (you all know what I mean). The Girl at the front desk was extremely personal and professional and had told us that the hotel had \"complimentary upgraded\" us to the next level of room . Wow, were were surprised when we heard that. We had chosen the \"Autumn\" package which includes free parking and a breakfast each morning at their incredible restaurant MARKET by Jean-Georges. When we arrived at out room, it was so incredible; everything so clean we couldn't believe it!!! There was a personal \"hand written\" note from the general manager \"Mr Brea\" thanking us for choosing their hotel and wishing us a great stay. Where did they find this person? Its like out of a movie to see this kind of service from ANY hotel these days. The room was huge and well designed and included 2 balconies to see outside. The quality of the finishes, the lack of dust anywhere was awesome. The bed is one of the best I have ever slept on in a hotel and I wanted to take in home in my suitcase ( and we sleep on a dux!!):) The entire place must be appreciated by those wanting an experience that's unpretentious and yet of the highest class. We will be back. Randy", "Date": "September 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Jeddah, Saudi Arabia", "Title": "“Worst Hotel in My Life”", "Author": "mBahareth", "ReviewID": "UR79301668", "Content": "Shangri-La Hotel is nothing but an overrated Hotel and over Priced. i payed over 500 $ per night and i did not get a big room nor did i get the service from a well known 5 star Hotel , it's a descries for a city such as Vancouver to have a Racist Hotel. We Got Profiled Because of our Ethnic Background and treated so badly , there is no porter to help you with your shopping bags , No Security Personel What so Ever in the Hotel , No one at The Door , Concierge is a 1 person stand , Calls dont get answered till 6-7 min waiting . i have travled the world , been to Japan , New Zealand , Australia , USA , UK , Germany , France and all over but i have never seen such a treatment , and racial profiling such as i have seen in this hotel , we are guests of canada guest of the hotel and we should all be treated equally or not at all .", "Date": "September 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "SF Bay Area", "Title": "“Will go back in a heartbeat!”", "Author": "trhay", "ReviewID": "UR79157617", "Content": "Awesome room, central location, fantastic concierge staff, professional and efficient front desk and bell staff. All together enjoyable. Staff took lots of time with us... on everything from making restaurant reservations to making arrangements to park our oversized car (based on 2 seventeen -foot kayaks on top).", "Date": "September 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Very good, great amenities”", "Author": "Kanuckian", "ReviewID": "UR78616765", "Content": "This hotel was a choice for one night before our return to Toronto from being at Sonora Resort for 3 nights. I chose it because of reviews on TripAdvisor. When we arrived we asked for an upgrade from an executive suite to a 1-bedroom - we were given this for $40 extra. The room was really nice and had some very cool modern features such as a TV built right into the mirror in the bathroom. The only thing that I would complain about was the couch size in the suite area of the 1-bedroom - it is not made for a man or women taller than 5'6\" - it is short and uncomfortable. The restaurant has the signature of a Michelin 3 star chef - Jean-Georges, but the food and service were VERY average. The restaurant was very noise and out on the heated terrace (which is a nice touch) the dance/techno music was pounding - we switched tables. All in all, for one night it was comfortable and the amenities were what you would expect for $400/night.", "Date": "September 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Beirut", "Title": "“Very nice but...”", "Author": "toyBeirut", "ReviewID": "UR78430701", "Content": "No complaints here but one... no room service after 11PM!! They just offer a very brief menu passed this time... We called at 11:05, and there was no way we could get a plate of spaghetti! Come on! This is a shagri-la!", "Date": "September 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Lives up to its name \"Paradise\"”", "Author": "LondonTLeaves", "ReviewID": "UR77863322", "Content": "Amazing hotel, fantastic genuinely friendly and helpful staff, great location. We got the breakfast deal, it is not buffet, but the food was excellent. Gorgeous rooms, with great mattresses. Our only complaint was that we stayed 7 nights and asked for quiet room but were put near the lifts. However the doors are quite thick so it was relatively quiet, however l would have appreciated them putting us in a quieter room considering the length of stay. Overall a wonderful stay.", "Date": "September 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“No ocean view, but fantastic stay.”", "Author": "globetripper78", "ReviewID": "UR76573523", "Content": "We stayed at the Shangri La for 4 nights with our labradour retriever. Both we and our dog were warmly welcomed - in our room was a beautiful dog bed an bowl awaiting our canine family member. I was hesitant to bring him to such a sophisticated place, but I was delightfully surprised with his treatment. The rooms are incredibly modern and the beds were unbelievably comfortable. So much so, that I contacted management to find out how I could get one for myself. It's a foam top, in case you were wondering. Electronic black out blinds make the room a heavenly cove. Look into expedia.ca where we got a deal that included valet parking and breakfast (a real breakfast!). French toast is delicious breakfast-cake. Food at Jean Georges is FABULOUS. Outdoor patio has no view at all. All-in-all, a wonderful stay. Well worth it's price. To compare, we stayed at the Marriott Pinnacle with an ocean view, and felt cheated because we weren't at the Shangri La!", "Date": "August 23, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bangkok", "Title": "“Not so good”", "Author": "NickBkk", "ReviewID": "UR75383428", "Content": "We stayed 3 nights in August and first, the good things. The, location, in downtown is very good and close to Robson Street and not far from many places to visit in Vancouver. There is a Supermarket next door (Urban Fare) that is a good place to buy things or have an inexpensive meal. Second, the hotel is quite new, so most of the fittings are good and especially the Nespresso coffee machine in the room. Third, service mind is very good except in Market restaurant as it will depends on who is your server. Then, the not so good things. If you get a suite room, (as we were upgraded) then the A/C may not cool your bedroom properly, so it could be quite warm at the beginning of the night, so it will be better to stay in small room, so the temperature will be more consistent. I also must say that if you have balcony it may come with a poor view (as the hotel is in the lower floors of the building is not worth it to get a balcony). The servicing of the room was never done in the morning, but in the afternoon both days we stay there. Even they claim that they were doing turndown service in the evening this was not true, except the first and they just service the room once a day the second and third day. Then, the breakfast at Market restaurant was not good as already mentioned by other people as first, service was very slow. One day we have to wait for table 10 minutes and then 10 more minutes to ask for our order, then when requested the American breakfast (they called the Deluxe breakfast, quite a joke !!!), 2 eggs any style does not let you have an omelette and they said we have to pay 4 C$ extra. When we complain they said they will not charge us, but this was clearly very low class from such property that claims to offer excellent service. Besides that the staff was rude when we complain about the omelette surcharge and later on ther rest of the service was very bad and even though they waive the charges of that breakfast we decided not to come back the following day, even though they told us they will waive again. The TV selection is very poor, not a decent movie channel as they just offer movies on sale (very bad again) and not even a music channel. I can even get better TV sleection in a Comfort Inn or Best Western Inn. Having stayed in many other Shangri-la properties before, this experience was by far the most disappointing and it seems that the excellent standards they have in Asia cannot be kept in their property in Vancouver, so at the end of the day is not worth it to pay their room rates to get such lousy service when having your breakfast.", "Date": "August 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "trinidad and tobago", "Title": "“It's the Shangri-La with a Vancouver twist”", "Author": "rtybc", "ReviewID": "UR74107692", "Content": "Unlike the sprawling common spaces you expect to see in an Asian hotel the shangri la Vancouver is simple minimalistic but with all the right elements to say. Welcome to the shangri la. From e greeting of the doorman to the waiters at the restaurant. As usual a wonderful experience. Don't miss the chi spa.", "Date": "August 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Good Hotel but definitely not up to Shangri-La standards”", "Author": "Matt584099", "ReviewID": "UR73056814", "Content": "Arrived last night for the start of a 6 day stay in Vancouver. I was really looking forward to staying at the Shangri-La as my experiences in their hotels elsewhere were excellent. However it is a disappointment and just doesnt have the ambiance of what you would expect of a hotel of this supposed class, The primarily disappointment was the room. I booked an Executive King with Balcony, expecting as detailed in their website to be above to step outside and enjoy the city. Sadly this is definitely one for the trade descriptions act, as you quickly find out when you wonder on down to the reception to check if you have been given the wrong room, that this is an enclosed balcony (strangely not detailed as such in their website). By enclosed balancy they mean a part of the room which is partitioned by sliding doors and has a small opening in the window. Definitely a feature not to waste your money on. The rest of the room is great and the staff friendly and helpful (except when its comes to balconies). Several reviews on commented on the reception and lobby being a little strange. This is a fair assessment as neither have the wow factor you normally expect to experience. All in all, a okay hotel but not memorable.", "Date": "July 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Costa Mesa, California", "Title": "“Simply the best hotel in Vancouver”", "Author": "puretorico", "ReviewID": "UR72743989", "Content": "The Shangri-la Hotel in Vancouver is simply the best hotel in the city. This was our 2nd time to stay at the Shangri-La while vacationing in and around Vancouver. Each experience at the hotel has been a delight - the rooms are spacious and designed to give maximum comfort and a real sense of serenity. The staff take genuine pleasure in providing the highest level of service. We stayed for 4 nights and look forward to returning next year!", "Date": "July 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "norway", "Title": "“The most perfect hotel ever”", "Author": "norwaytravler", "ReviewID": "UR72464463", "Content": "This is the most wonderful hotel you could imagine!! From the chek in- to the LARGE room ameneties- to the breakfast! All is just WOW. The best yet! I forgott my postcards (7-8 )in my room- and rememberd it a day later, and they cindly posted them for me- without a fee. What other hotel do that??? For what you get - this hotel is NOT expencive! Go for it!", "Date": "July 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Would go there every night if I could!”", "Author": "Fischbowl", "ReviewID": "UR71654624", "Content": "Fantastic hotel. What struck me the most was the staff. Usually at such a high end hotel the staff can be snobish or cold at times. Every single person we ran into was super friendly and genuine. The rooms were beautiful. The lighting and controls made the room ambiance very warm. The food was exceptional. The french toast is so good it is beyond description. The rooms were so quite one would never know you were actually in the middle of down town.", "Date": "July 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Easily one of Canada's Premiere Hotel Experiences”", "Author": "Review1031", "ReviewID": "UR71552801", "Content": "My husband and I recently spent 5 days in Vancouver and decided to treat ourselves to a 5 star experience! MY husband found the Shangri-La on line and decided it looked like a beauitiful place with wonderful amenities and in a location that was perfect to get to shopping, the water front and of course, Vancouver's pearl....Stanley Park! From our first steps in the door, all the staff were amazingly kind and efficient in getting us settled into our room. The restaurant food was \"incredible\"...wow! We liked the food and staff so much at lunch our first day, we decided to eat there again two more times. It was amazing, the staff were again were really friendly and efficient, made the whole experience a fantastic one! Finally, my husband treated me to the Spa, wow!! To say I enjoyed it would be an understatement! I LOVED it!! The ambience in the Spa is exotic and relaxing with the soft earth tones that just make one melt into the furniture! There is an aire of splendour in this space, it would be difficult not to enjoy your time there. The treatment itself was fabulous, the care giver was very good, knew the art of her treatment very well. I was thrilled by the whole experience. If I lived in Vancouver,I would be there every week!!!", "Date": "July 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bellingham, Washington", "Title": "“Wonderful rooms, terrific staff, excellent restaurant”", "Author": "8travelbug", "ReviewID": "UR71278500", "Content": "This is a very special hotel. My husband and I spent 2 nights at the Shangri-La, visiting Vancouver with friends. We had a wonderful room overlooking Georgia Street. It was spacious, comfortable and well-appointed. Wonderful bedding, \"smart\" electronics. The bathroom was elegant and functional at the same time, white marble with very smart features to ensure comfort and utility. Staff were friendly, knowledgeable, and eager to be helpful. We had one dinner at the restaurant - very good, although service seemed very slow. We loved being on the terrace, enjoying the fresh air. We did not use the spa or exercise facilities, but we looked at them at thought they looked wonderful. My only negative comment is that I thought the room lighting was inadequate. We had a small couch, but poor lighting made it impossible to use it for reading.", "Date": "July 17, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“Wow!”", "Author": "LondonWestEnd", "ReviewID": "UR71170984", "Content": "I was really impressed with this hotel. I have stayed numerous times in Four Seasons and Ritz-Carlton hotels all over the world, but this hotel still managed to leave an impression. I was upgraded to a suite, which was simply beautiful, with a large balcony. My recommendation is not to book the cheapest room, but to book a balcony room. As these rooms are in short supply, you will be the top of the list for an upgrade to a magnificent suite. The hotel feels more like a private residence than a hotel; but I mean this in a positive way. And I also liked the two-level lobby, with cars on the lower level; which keeps the traffic out of the lobby. Location is also very good. The only downside, perhaps, is that all the hotel rooms are on the lower levels, so you will not have a nice view (the upper floors are private residences). This is without a doubt the best hotel in Vancouver, by far.", "Date": "July 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Beautiful, World-Class Hotel”", "Author": "cdp077", "ReviewID": "UR70793213", "Content": "An top-tier hotel. Beautiful rooms, excellent facilities and amenities, attentive staff, excellent restaurant, great downtown location. There is nothing you could want that this hotel does not have.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Shanghai", "Title": "“Extream friendly, confortable, convenient, professional- wonderful”", "Author": "Macayla", "ReviewID": "UR70720697", "Content": "My family stayed at Shangri-la Vancouver in June. We had a wonderful experience there. From the concierge to front desk, to the staff at the Market. Service: we met people who are very willing to take their time and effort to help us. Actually, they started to give us help regarding our travel plans,even before we travelling into the country, as this was the first time for us in Vancouver. They advised on our trip to another destination, arranged real estate agent for us. Without them, our trip would not have been so wonderful. Whenever we needed, they were always there to assist. They handled things very professionally, very warm, and in the mean time, kept a very confortable distant to avoid being too pushy or too casual. Food:Market is the inhouse dinning place. Great food, great service, great enviroment. Breakfast is great too. Location: The hotel is also very conveniently located, very close to the restaurants and shops. The Japaness restaurant accoss the street is very nice. Value:When you consider breakfast is included in the price, it is not expensive.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Orange County, CA", "Title": "“Nice but can improve”", "Author": "octraveler08", "ReviewID": "UR70103700", "Content": "My family and I stayed here for four nights to attend a family reunion recently and overall, we were comfortable and pleased with the hotel. As a pleasant surprise, the hotel upgraded our room upon our arrival. The room was generously sized and very comfortable. Everything was in good working order (remote control of drapes, heating/cooling, etc.) The toiletries were top quality, and our rooms were serviced adequately, though some days, a more thorough job would have been appreciated. All service people were friendly and courteous when we came upon them in the hallways, etc. A big disappointment was in the \"pool.\" Before we arrived, I wondered why there was no picture of the pool on their Web site, and when I arrived, I understood. It's miniscule--more like a wading pool. For some of us who swim for exercise, this was a let down. Food in the hotel restaurant was good at breakfast, though we found dinner to be overpriced and a little over seasoned, but that's just our taste. Location is very convenient to shopping of all kinds, and right next door is a food store that has gourmet products as well as everyday necessities. Overall, we enjoyed our stay but felt it to be lower in quality to the better Four Seasons. I will say, though, that their free wi-fi beats Four Seasons where you have to pay. In this day and age, I don't think there's any excuse for an expensive hotel to not offer free wifi to guests, so on this aspect, they have FS beat.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Best of the Best”", "Author": "jiffypop101", "ReviewID": "UR69897047", "Content": "This hotel is fantastic. We stayed here for 4 nights and really enjoyed it. The service is as good as it can be and the rooms are top notch. World class. A bit on the expensive side but you have to try this place. The restaurant serves the best breakfast I have ever had.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Delaware", "Title": "“Amazing!”", "Author": "SLI22", "ReviewID": "UR69690975", "Content": "My husband and I like to stay hotels that are part of the American Express fine hotels of the world. The Shangri-La lived up to its reputation as a fine hotel and more. We were upgraded to a one bedroom suite that was full of all the bells and whistles one could desire. I can't say enough good things about the hotel. The bed was the best we have ever slept in. Also, the location, right in the heart of downtown, is perfect. The concierge and the other staff were attentive and extremely helpful with any questions we had. In addition, we ate at the Market, the hotel restaurant, every morning and one evening and found the food delicious. I would never stay any place else but this hotel if I ever return to Vancouver. It's expensive, but you get what you pay for.", "Date": "July 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "San Francisco", "Title": "“Tripadvisor reviews misleading”", "Author": "sherlock1954", "ReviewID": "UR69379102", "Content": "This is the very first time I find the Tripadvisor reviews misleading. This hotel is expensive and I was expecting a very high quality. The rooms are small and the corridors dark, the hotel does not go above the 15th floor, don't expect a view except of office buildings. The pool was tiny and occupied by noisy children. We tried the restaurant and although it has a fancy chef you don't have much choice on what you eat, as most menus are prix fixe. At the end of the stay, although I had checked when we checked in that our rate was 3 nights for the price of 2, they tried to charge us for the full price of 3 nights anyway, all in all very disappointing.", "Date": "July 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Exceptional quality and service; can't wait to return”", "Author": "pinkcoatb", "ReviewID": "UR68352938", "Content": "I have stayed at this glorious hotel twice now and cannot wait until my next trip to Vancouver to stay again. From check-in to check-out, and every step along the way, the hotel and its staff exceeded my expectations. The underground check-in was extremely efficient; I appreciated that the staff knew this was my second visit and welcomed me back to the hotel. The concierge provided useful recommendations for hotels, bars, and bike rentals, and every staff member I encountered was genuinely friendly and always helpful. The bed and bedding were comfortable and other in-room amenities (bathrobe, slippers, umbrella, coffee maker, etc) were high quality. Love the L'Occitane products and heated floors in the bathroom. Check out was a breeze, and the boarding pass print station was handy. I had breakfast at Market as part of my package, and every waiter and hostess I encountered during my six day stay were friendly and appropriately chatty. The food was delicious, although I likely would have not eaten there without the package as it is quite pricey breakfast. The grocery store next to the hotel has great snacks as well. The hotel is about a five-minute walk away from the new Vancouver Conference Center. I used the gym everyday: good equipment, clean locker rooms. The steam room is average--I would have preferred some sort of eucalyptus smell or something, but on the whole, it was fine. Despite the chilly weather, I managed to swim twice because the pool is heated. The spa experience (body scrub + scalp massage + foot massage) was among the finest in the life. The booking process was simple, and the technician was superior at her craft and seemed like a very nice, sweet person. I was able to find much cheaper prices on Expedia than on the hotel's own website, so be sure to check out sites like that when looking for the best rate. I am very impressed with the Shangri-La brand as a whole. I am currently planning my honeymoon to Asia, and we will certainly be staying at Shangri-La hotels as frequently as we can.", "Date": "June 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leeds, Yorks", "Title": "“I just doesn't get much better than this”", "Author": "prs54fmpu", "ReviewID": "UR68155770", "Content": "What can I say about the Shangri-La that has not already been said, it is truly a unique experience from the mood lighting in the bedroom to the fabulous staff, I have travelled extensively and stayed in some of the best hotels in the world, but this was my first experience of a Shangri-La, from the moment you arrive you feel important and welcome, the reception is quaint and the staff excellent the concierge brilliant. The room staggering, I have never seen as many buttons to alter the lighting. The bathroom was wonderful and filled with L’Occitane products, yes you are in the city and privacy could be problem, but you have automatic blinds so who cares. A separate bath and shower are provided and two sinks so travelling with a partner makes getting ready a simple affair, a separate dressing room for all your cases keeps the main bedroom neat and tidy. So are there any issues, well yes, it is noisy, we stayed on the ninth floor and could not believe that an inner city hotel had such poor sound proofing, our room was on the corner of Thurlow and Alberni, it was so bad we could get to sleep until 4 in the morning, we did mention this at check out and got a very negative response as though it was impossible that anything could be wrong with the hotel. Due to the attitude you start to find other problems, the plug did not work in the second sink, the TV did not come on with sound sometimes, a lamp did not work properly, and would this stop be going back absolutely not, I would just get a better room. P.S. The lounge bar staff fantastic, and now they can also make a proper Pimms", "Date": "June 21, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Kelowna, Canada", "Title": "“the nicest room I have ever stayed in”", "Author": "peggyharp", "ReviewID": "UR67850597", "Content": "I have travelled all over the world and have stayed in every kind of accomodation possible and this was one of the nicest rooms I have ever been in (definately outclasses the much overranked Oriental in Bangkok). The Shangri-La Hotel in Vancouver was amazing. From check-in-quick, private and friendly, to the gourmet breakfast (included!) eveything was top notch. It was a treat to stay there.", "Date": "June 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Regina, New Mexico", "Title": "“If you want to treat yourself and endulge, Shangri La is perfect”", "Author": "beamen01", "ReviewID": "UR67756465", "Content": "The accommodations are excellent and the location is great if you are looking to stay in downtown Vancouver. An excellent overall experience.", "Date": "June 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Best in Vancouver for luxury and service, but lacks any views”", "Author": "simondo84", "ReviewID": "UR67744325", "Content": "The Shangri-la is by far and away the best hotel in Vancouver in terms of luxury, by a significant margin. This is very much matched by the service, although it is a more formal type of service which will be familiar to anyone who is used to travelling in Asia. Rooms: We stayed in a standard guest room with a beautiful King bed. The sheets had an exceptionally high thread count, and the bed was the perfect level of firmness. The electronic lighting controllers created a beautiful ambience at any time of day at the push of a button. The hotel has a distinctly asian themed decor, carried in to each rooms with the fabric wall paper, beautiful dark wood furniture and some nice asian art. Each room is adorned with a fantastic Sony TV (50\"), surround sound, iPod dock and free wi-fi. Bathrooms: Excellent. Marble from top to bottom, fluffy luxurious towels and robes, walk in shower, bathtub, TV in the bathroom mirror and L'Occitane toiletries. Restaurant: Marketplace is a beautiful modern fine dining experience. Expect nothing but the best in terms of food, wine and service. Many of the dishes have an Asian twist, but the cuisine is more European in my opinion. Pool and Spa: Whilst the spa looked great, I did not have a treatment. The pool was OK, but looks out on a very unattractive car park. The hot tub is the same. The fitness suite is as you would expect. Car Parking: Full valet service is excellent Service: Nothing is too much to ask, they really have brought the service found in Asian hotels right in to North America. Staff are friendly, gracious and impeccably dressed. Don't be intimidated by the formality of it, its really they type of service they are striving for. Whilst it may on the surface seem less warm and friendly, I guarantee they will never let your water glass go empty, your pillow unfluffed, your presence not greeted. Brilliant! Location: Great for business travellers, but for leisure I think staying on Waterfront is better. The Shangri-la hotel occupies the LOWEST 15 floors of the tallest building in Vancouver, so there is nothing to see in any direction, just offices and some ugly car parking garage. So if you are visiting, I would go for the Fairmont Pacifc Rim or Pan Pacific and you can wake up every morning to views over the Burrard Inlet and the mountains... that is if you can cope without staying right in the lap of luxury!", "Date": "June 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Excellent hotel”", "Author": "shaulke", "ReviewID": "UR67716862", "Content": "We stayed for 3 nights. Love the non-traditional layout without a formal lobby. The service was very attentive. The breakfast was very good. The location is superb - right in the middle of everything. I would have given it 5 stars if not for the fact the we were charged extra $75 upon checkout even though the rate was fully prepaid. Not a bid deal but still...", "Date": "June 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“OUTSTANDING hotel & impeccable service”", "Author": "millions1", "ReviewID": "UR67577316", "Content": "Want to feel like a VIP - stay at the luxurious \"Shangri-La Hotel\". The ammenities and service is outstanding, you will never stay anywhere else again.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Plymouth, Minnesota", "Title": "“Expensive, but worth it”", "Author": "squdgee", "ReviewID": "UR67546971", "Content": "The suite room was large, clean and luxurious. The entire staff was kind, courtious and helpful. I felt like a truely valued customer. Concierge staff was top notch.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fort St John, BC", "Title": "“Phenomenal service!”", "Author": "BC-KVB", "ReviewID": "UR67529140", "Content": "First stay at a Shangri-La, definitely will not be my last if it is up to me! An oasis of placid serenity, even though it's located right on West Georgia, Fabulous, very attentive staff. Wonderful place to stay! Now stay away from my hotel! Lol", "Date": "June 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Clemente, CA", "Title": "“Awesome Hotel/Location”", "Author": "Petarjake", "ReviewID": "UR67506865", "Content": "This is a fantastic hotel...beautifully appointed with the service and staff friendliness to match. The concierge was always very helpful and listened before making their recommendations for dinner in different parts of town. The location was perfect and walking distance or a short cab to wherever we wanted to go. My only slightly negative comment was not allowing any outside food or drink in the pool area. Other than that, it was a very impressive hotel and a very enjoyable stay.", "Date": "June 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Liverpool, UK.", "Title": "“good but not exceptional 5*”", "Author": "fussyboss", "ReviewID": "UR66911160", "Content": "Had two executive rooms for 3 nights in March. As described by other reviewers, beautifully appointed new hotel, lovely rooms with all modern gizmos, tip-top bed and large luxury bathroom, superb attention to detail throughout. However, the rooms are in full view of a busy office block and for privacy the drapes need to remain drawn! Service very good but not perfect. Restaurant good but not great, if we hadn't had a package would not have bothered with breakfast a second time, wouldn't make a special trip for dinner, divan seating uncomfortably close to other diners. Excellent gym. Basically, this is what I expect of a stylish, good 5 star hotel but it is is not in my opinion exceptional and we'll be back to one of the Fairmont's next year!", "Date": "June 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Best hotel I've ever stay at! Should be 6 stars!”", "Author": "turf727", "ReviewID": "UR66858167", "Content": "This hotel is beyond 5 stars. It puts other 5 star hotels to shame. It is a beautiful place, where tremendous thought has been but into every design. Everything is of the highest quality and highest level of design and function. The fabrics and textiles are amazing. The all marble bath was beyond beautiful, elegant, and very confortable (seperate tub/shower/toilet area). The bathroom was indeed my dream bathroom. The service, of course, was top quality too. The people are friendly, professional, and focused on the highest level of quality service. I wish there were Sangri La hotels throughout the USA (where I live), but sadly no. Hopefully they will expand. My stay couldn’t have been more elegant or lovely.", "Date": "June 8, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "4", "Service": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Impeccable As Always”", "Author": "colinchau", "ReviewID": "UR66848162", "Content": "We dined at the restaurant at Shangri-La Vancouver - Market by Jean-Georges. We had a great time and as always the service was great. The food was cooked perfectly and the plating was excellent. It was the first, second, and third time for the three of us there, and all of us would definitely love to come back any time. The staff were very helpful and kind in being responsive to a request to have the recipe for two of their dishes, the Arctic Char and Red Snapper. As promised, the Executive Chef was referred to our request and he kindly sent the recipes to us directly by email. Never once have we gotten push back or attitude from the staff, and they're always happy to help us.", "Date": "June 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“Shangri-La Vancouver is a home away from home!”", "Author": "RhiannonBrisbane", "ReviewID": "UR66668397", "Content": "From the moment you step foot inside this emaculate hotel you feel right at home. The staff are most helpful, the atmosphere is relaxing, the food is great and the facilities cater to almost every need! And if you are passionate about good beds, this hotel takes first prize for comfort. The softest, fluffiest most luxurious sheets, pillows and duvets will keep you sleeping for days!", "Date": "June 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“My first 5 star review!”", "Author": "nbk5276", "ReviewID": "UR66524068", "Content": "We only spent one night here on the way home from a relaxing trip up to Whistler. Finding the entrance to this hotel can be a bit tricky. It is in the garage on the lower level. We had to circle around the block. It is very easy to drive right by this building and not even realize it is a hotel. Check in went pretty smoothly. Within minutes we were on our way to the room. This room has to be one of the most spacious and beautifully appointed hotel rooms I have ever stayed in. I would describe the room as modern Asian minimalism. The bathroom was so gorgeous I didn't want to leave. My main criteria for judging a room is the bed and the water pressure on the shower and both were phenominal. Upon checkin there was a small fruit plate along with a handwritten note from the manager what a classy touch! The staff are very low key yet extremely friendly. Turndown in the evening was great instead of the expected choclates was a bookmark with quotes from the book lost horizon. I could just go on and on with all of the small attention to details of this place. The hotel is in a great location just a block away from Robson street the main shopping district of downtown Vancouver. This hotel will definitely be my hotel of choice for Vancouver from now on.", "Date": "June 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Brisbane", "Title": "“Stunning Hotel with Exceptional Service”", "Author": "BrisbaneMichelle", "ReviewID": "UR66476729", "Content": "My husvband and I stayed at the Shangri La and would confidently say it was one of the best three hotels we have ever stayed at. From the moment we checked in the service was exceptional to say the least. The Concierge was without doubt the best we've ever experienced, recommending restaurants and making reservations for us - nothing was a bother. The decor is stunningly modern but still welcoming and tranquil. The Lobby Bar and Restaurant on 3rd floor, were extremely good. Free internet access in the Business Centre, and a location one block from Robson Street (and fantastic restaurants) are an added bonus. All in all, we would highly recommend this hotel to anyone seeking a sophisicated and charming hotel in Vancouver.", "Date": "June 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“Not as Expected”", "Author": "World Passport", "ReviewID": "UR65859385", "Content": "Sure I've heard about this chain hotel before but the service is not as expected. Very small hotel parking entrance and the view from your room is absolutely NONE. For over US$300 a night, you would expect to have at least a decent view other than facing directly to an office building where people can look at you during their working hours. Privacy is NONE unless you want to close the curtain all day long. Breakfast is average. Cannot trust everybody's reviews on Trip Advisor anymore. Seating arrangement in the breakfast room is super bad. They seat you so close to each other. Ridiculous for a 5 star hotel. The AC in the room is rather noisy. I have to use an ear plug for my entire stay. You can hear the street noise from the street below even from the 11th floor. Will not be going back to this hotel anymore. Plenty of other hotels in the same area such as the Hyatt, Westin Grand, Four Seasons, Fairmont, etc. If view, breakfast, location, and service are important for you, then this is definitely not a hotel for you. I cannot believe that this is no. 1 Vancouver hotel in Trip Advisor. Why??? just because it's new???", "Date": "May 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Asian Hospitality”", "Author": "SydneyTommy", "ReviewID": "UR65690329", "Content": "This hotel manages to combine sophistication, hospitality and intimacy. Great asian hospitality influences. Loved the checkin, by the time I walked to the desk my paperwork was waiting. Location was good very close to Robson St. Exciting rooms and bathrooms with automated curtains and lights and more. Beautiful finishes. Great desk for laptop. I was here for only one night wished I could stay more.", "Date": "May 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Michigan", "Title": "“Perfection”", "Author": "Kenny_Blankenship", "ReviewID": "UR65440038", "Content": "While celebrating our 25th wedding anniversary, my wife and I spent one night at the Vancouver Shangri-La following a cruise. The staff was extraordinary, the property is modern, spotless and comfortable and is perfectly situated in the city. We were even unexpectedly surprised with a lovely anniversary cake delivered to our room. The Shangri-La provided a perfect ending to a special trip!", "Date": "May 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Very nice - great location!”", "Author": "housy123", "ReviewID": "UR65230690", "Content": "This is a fairly new hotel and is in an excellent location. Beautifully appointed and very nice staff. The concierge(s) were EXCELLENT and extremely helpful. The first time I ahve ever used a service that was really that good! Would definitely stay again.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Perfect stay”", "Author": "tigger000", "ReviewID": "UR65135456", "Content": "An excellent hotel with great service. Location perfect for exploring Vancouver, close to shops, restaurants. Inclusive breakfast was amazing, although if it hadn't been included in the room rate it would have been expensive. Room upgraded without asking, very high quality rooms. Definitely recommend this hotel if you can get it a discounted rate or you're looking for something special.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Irvine, California", "Title": "“A True 5-Star Hotel! Wow!”", "Author": "sctrojan1", "ReviewID": "UR64961785", "Content": "There is a reason why this hotel ranks high in Tripadvisor. The hotel was awesome. The rooms are spacious and luxurious. The beds were comfortable. Of course the service was excellent as well, including the front desk, valets, and housekeeping. We stayed here for 5 days and we felt welcomed by the staff during our entire stay. We ate breakfast at Market (in the hotel) every day and the breakfast was awesome and so was the service. The location is convenient since it is just a block to the shops on Robson Street. There is an Urban Fare Market right next to the hotel that has groceries. I highly recommend this hotel. TIP: The entrance to the underground parking is on Alberni St.", "Date": "May 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Luxury in the middle of a world class city”", "Author": "rick_obrien", "ReviewID": "UR64762720", "Content": "The room was stunning with beautifully finished amenities and little extra's like bowls of fresh fruit, a personalized welcoming note and even a mini TV screen built into the bathroom mirror. And, never taken for granted, it was so quiet...what wonderful sleeps we had. For us, however, the highlight was \"Market \", Shangri-La's contribution to exquisite dining. Our meal was an experience...an adventurous menu and wine list to match; service that is polished and friendly and all of it within a room that is always busy but never too loud, just right and fun. For us, the occasion was my wife's special birthday...and we will never forget it.", "Date": "May 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“My stay at the Shangri-La Hotel was the ultimate experience in every way.”", "Author": "travelinfoolFlorida", "ReviewID": "UR64690820", "Content": "My sister and I stayed for 3 days and were treated royally from the time we arrived until the time we checked out. The staff at reception was extraordinary. They were helpful, courteous, and knowledgeable. The concierge was happy to print out our boarding passes and was gracious even though it was a long, tedious procedure. The room was spectacular....a large sitting area, comfortable beds, and a bathroom that was beyond luxurious. The hotel is perfectly situated in the heart of Vancouver. Within 5-20 minutes, you can walk to the waterfront, shopping on Robson, Stanley Park, or to many wonderful restaurants. I would highly recommend the Shangri-La as the place to stay if you're in Vancouver. It is a bit pricey but well worth it to experience a hotel at its very best.", "Date": "May 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“quiet elegance!”", "Author": "plumber83", "ReviewID": "UR64451856", "Content": "We only stay in five star hotels and this was by far above and beyond the rest. Location is great! Staff are amazing, facilities are the best with all the most advanced and user friendly. Great value!", "Date": "May 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "san diego", "Title": "“Impeccable Service, Luxurious Guest Rooms”", "Author": "corpevents", "ReviewID": "UR63938266", "Content": "Highly recommend this hotel - entire staff from Sales & Conference Services to the Valet, were easy to work with, knowledgeable, polite, friendly, welcoming, etc.", "Date": "May 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria, B.C.", "Title": "“This boutique hotel excemplifies excellence!”", "Author": "TeahL", "ReviewID": "UR63604531", "Content": "From the service, to the perfect location in downtown Vancouver; to the staff that serves their guests we absolutely love staying here. We travel a great deal to Vancouver on business and the Shangri-La is unquestionably our number one choice. We have yet to check into a room that honestly didn't feel like we were the first guests to have occupied the room as the rooms are that immaculate. The staff is very friendly and welcoming from check-in, to the outstanding quality of service and food offered at the various restaurants...you won't be disappointed....l", "Date": "May 8, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“great experience”", "Author": "tobanker", "ReviewID": "UR63558989", "Content": "I recently stayed at the Shangri-la hotel in Vancouver. My wife and are regular visitors to Bangkok and always stay at the Shangri-la so we are well aware that the quality and service levels are of the highest standards. The Vancouver hotel maintains those standards. One point to offer- there are no harbour views from the rooms as the top floor is the 15th and the hotel is surrounded by other buildings. That said, the rooms are beautifully designed and offer a great experience. I have attached photos.", "Date": "May 8, 2010"}, {"Ratings": {"Service": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Alexandria, Virginia", "Title": "“Far beyond expectations”", "Author": "Traveler22304", "ReviewID": "UR63506407", "Content": "A memorable hotel. Elegant rooms, excellent service, and superb food.", "Date": "May 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Beijing", "Title": "“lovely new hotel in downtown Vancouver”", "Author": "BeijingAussieinchina", "ReviewID": "UR63392918", "Content": "After much consideration and as a fan of shangri-la hotels I decided to stay here for 6 nights - breakfast and internet access included. The hotel is quite new and has a chi spa (not visited). The hotel is accessed via an underground driveway with lift access to the lobby and concierge and lifts to the rooms. The rooms are very well appointed including L'occitane toiletries, TV screen in the bathroom mirror, black out electronic blinds, and mood settings and dimmer switches on the lights, and an ipod docking station. The room also had a Nespresso coffee machine which was a great idea and very welcome!! The TV menu was very comprehensive and the screen was a large flat panel. The fitness centre is located adjacent to the spa and has a good range of Technogym cardio and weights machines and free weights, as well as a Technogym Kinesis station. While breakfast was included in the room rate I selected, I was unaware that it was not a buffet and only included food up to a set amount. However there are plenty of alternatives very close to the hotel including Urban Fare next door - a grocery/takeaway/eatin store, many Starbucks, and an IGA store a few blocks away. The concierge was very helpful and efficient, and assisted me with ideas for activities and changing and making bookings for tours etc. The location of the hotel is good although if you choose to take the skytrain to/from the airport, the closest stations require walking a few blocks.", "Date": "May 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Helsinki", "Title": "“A Dream Come True”", "Author": "BrightblueSunflower", "ReviewID": "UR63336161", "Content": "Shangri-La Vancouver is a dream come true. Beautiful hotel, lovely athmosphere, friendly staff, wonderful breakfast, valet parking and concierge services - top class! Arriving to the hotel was pleasant enough, but entering the room took my breath away. Simply amazing. The best hotel ever. Without a doubt.", "Date": "May 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hubbard, Ohio", "Title": "“5-STAR SERVICE AT A 2-STAR PRICE”", "Author": "bk994", "ReviewID": "UR63271219", "Content": "Can't beat the quality and service. Food is top-notch, although room service is significantly pricier than you'd expect for what you get, even for a five star hotel. However, that's a minor critique for an overall excellent experience. Staff was very friendly and attentive and hotel is right in the middle of downtown. Wouldn't recommend anywhere else.", "Date": "May 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore", "Title": "“Beautiful rooms wonderful staff great location excellent food”", "Author": "Neal2277", "ReviewID": "UR63269336", "Content": "My son was offered enrollment in UBC so we went up to Vancouver to visit the school. I was able to book a room at theShangri la and with prepayment got a rate of $206 per night with free wifi, free parking and $60 dollars credit per day for breakfast. All in all this made it an affordable stay in a city with many very expensive hotels--all of which charge for the extras. Don't forget that Vancouver taxes add almost another 18%. The hotel was top flight with great linens, fancy marble bathroom--the TV built into the bathroom mirror was a bit over the top, but neat--slippers robes and a safe that fits laptops. Called room service for a bucket of ice and I swear they appeared in less than five minutes. The staff was helpful, friendly and remembered my name. The decor and influance is asian--you will be handed your keys with both hands try to remember to accept them with two hands as well. Parking is underground and comes in from the rear of the hotel. Not a big deal although I've seen reviews that complained about it. It's the tallest building downtown and distinctive looking so it is easy to find when walking around or driving into the city. We were in the smallest of their rooms on the 15th floor and didn't have much of a view due to the other high rise buildings--the other side of the building offers balconies and larger rooms--if you want a view make sure you inquire or make a request. I would have killed for an upgrade! Try the bar menu for an evening snack good burgers--we were there for the Stanley Cup playoffs and it was an interesting, multicultural, handsome and classy/casual crowd--they were serving buttered popcorn which sinfully rich. Eggs Benedict were great at breakfast and they had some really outstanding breakfast sausages (read not Jimmy Dean). Summary, if traveling on the expense account don't think twice-- just book it! If you are on your own dime check out their deals on their website. It is expensive but then so are all of the other good hotels in Vancouver and the Shangri la really does stand out. I'll be going to Xian China later this year and am looking forward to trying out their property there.", "Date": "May 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Outstanding in every respect”", "Author": "anthony_bowman", "ReviewID": "UR63268776", "Content": "Loved it. Its a very new Hotel, great service (as you come to expect from the Shangri-La group), lovely staff, nice rooms (massive digital LCD tv), food and facilities also great. Room rate (last minute booking) was very good.", "Date": "May 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“One of the Best”", "Author": "SydneyKevin07", "ReviewID": "UR62997151", "Content": "From the moment that we checked in for a recent 4 day stay we realised that the Shangri La was special. The lobby is discreet and elegant and the building is the newest high rise in town. The room was faultless and immaculate. The beds were very comfortable , huge Sony Bravia TV, espresso machine, great bath , premium shower products and very quick wifi. The staff were faultless and the lunch menu at the restaurant was remarkable value at $20 a person. Great location in the centre of Downtown within very easy walking distance to great restaurants and sights. I couldnt fault the hotel - except on recollection maybe the Flat Screen TV was a little large for the room !!!", "Date": "May 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“Discrete high-end hotel in the heart of the city”", "Author": "RockP", "ReviewID": "UR62758148", "Content": "Just stayed an evening in a deluxe room - very large and well appointed - and beautiful bathroom. Was upgraded upon arrival based on Tablet Plus membership. Also had early check in and late check out. Much has been made of the underground reception/lobby for check-in/out. Definitely has advantages for those interested in privacy/discretion/quiet. I see it as a plus having experienced it firsthand, unless you like the hustle and bustle of many downtown hotels. But remember this is more of a boutique hotel - only 119 rooms - which caters to a more discerning traveler who isn't concerned with seeing and being seen. You don't have the general public in common areas, so hotel has a calmer aura about it. Great location - near excellent shopping and dining. Staff were friendly and proficient. Breakfast is expensive but ours was included as was valet parking.", "Date": "April 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Pitt Meadows, Canada", "Title": "“Sooooo chic!”", "Author": "Karen00000000000000", "ReviewID": "UR62530076", "Content": "My husband and I were going to a wedding downtown so we booked into the Shangri-la overnight. It was a fantastic experience from start to end. The rooms are perfectly appointed with tasteful furniture, art and textures. The ability to control all the lighting and draperies with the push of a button from the bed was decadent. The TV in the mirror made getting ready to go out a lot more fun. The bed was so soft! All the staff were professional and very helpful. A very worthwhile splurge!", "Date": "April 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "canada", "Title": "“Great new hotel, but staff not up to par”", "Author": "vancouverchu", "ReviewID": "UR61774902", "Content": "Spring package is an unbeliveable value including valet parking and breakfast. Arrived to check in and the gal (new, limited training) was unable to locate my reservation. After 10 mins, she found it and proceed to go thru the details in a very slow manner, suggesting I join their Golden Circle program. Well, I was already a member, and needless to say, their reservation neglected this. Upon presenting my card, she attempted to find a room upgrade, but the manager on duty stepped in to speed up the process (line-up was growing). In a very unpleasant tone, he advise no other room was available. Breakfast also involved a long wait for a table, not that they were full, but under staffed. Modern facility, but service is far inferior to Shangri La hotels in Asia.", "Date": "April 17, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Rooms": "5", "Service": "5"}, "AuthorLocation": "Burnaby British Columbia", "Title": "“We booked a get away package with...”", "Author": "MrP9", "ReviewID": "UR60958403", "Content": "We booked a get away package with breakfast and parking included. Staff were very helpful, very professional, and happy we were at their hotel. Yes, we were upgraded to a beautiful suite, but regardless, we were treated like 5 star guests in a 5 star hotel. Room...awesome...the famous mirror TV did not work (battery dead) and we were greeted with a welcome note and fruit thing for some doctor who obviously couldn't make it. Undeniably the best hotel stay of our lives... Breakfast was fabulous and location was perfect for exploring downtown. Price for what we got...excellent. Yes we checked in underground and did wait 10 minutes for checkout...line up...but the stay and experience will bring us back.", "Date": "April 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary", "Title": "“Simply serene.”", "Author": "HelloCalgary", "ReviewID": "UR60428197", "Content": "As I flew into Vancouver, all I had in hand was a map to find the Shangri-La Hotel. I was traveling on business and the reservation had been arranged for me. To be honest, I had never heard of the Shangri-La. Upon arrival I was immediately impressed with the genuine feeling of \"Welcome\" by all staff. Once inside the hotel there is a feeling of calmness that comes, almost instantly as the staff warmly greets you and offers their help. The room decor is classic, simple and warm. The almost \"unseen\" staff work very diligently to keep your room tidy and clean. The food served was always of the highest quality, fresh and pleasing. I highly recommend the Shangri-La Vancouver as it would be such an enjoyable experience not soon forgotten.", "Date": "April 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston", "Title": "“Exemplary service, wonderful food and child friendly.”", "Author": "Elreid02", "ReviewID": "UR60321943", "Content": "My family and I stayed here for several nights. The hotel was wonderful! The service was exemplary. The wait staff in the restaurant were very accommodating to my children's dietary needs and the food was excellent. I did visit the spa as well which was also a great experience. The hotel is close to the beautiful Stanley Park and shopping destinations are also very convenient. I would definitely recommend this hotel.", "Date": "April 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "redmond, wa", "Title": "“Fantasic location, accomadating staff, very elegant rooms”", "Author": "shankar_wa", "ReviewID": "UR60022391", "Content": "We stayed at the Shangri-la for a night with our 10 month old son. The staff were accomdating in providing us with a microwave int he room and cleaning our the mini-bar so we could store his food in there, The room was very elegant and nice, the bathroom was great and the electirc mirror with the built-in TV was a nice novelty The 50inch TV in the room were actually a little too big for the room. The overall process of checkin was very efficient and it was nice to see the small touches they had in the room like the fruits and cookies in the room, the master switch to trun off the lights, the torch light in the night stand, charging station built into the desk and the ample number of open plugs. The amenties provided in the bath room were also were thoughtful - they had touthbrush, shaving razor, bath tub salts etc. The location was great and the breakfast at the MARKET was very good. Some of the things that i felt lacking were the confusing building access, the bathtub and toilet were a little dirty, the room service was slow and forgot to bring things when e requested them. Some of the staff were new to the hotel and the country itself and had a hard time communicating and understanding. The fitness room was very mediocore for this being a 5 star hotel.", "Date": "March 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Excellent Hotel. Fantastic Service. A Step Above.”", "Author": "PuffleNB", "ReviewID": "UR59871917", "Content": "This was our first stay at a Shangri-La Hotel. Having stayed at many fine hotels around the world this was a step above. We will definitely stay at the Shangri-La in Vancouver again and we will look for their other locations around the world.", "Date": "March 29, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "vancouver", "Title": "“Excellent food and service in Marketplace restaurant”", "Author": "lovethefood095", "ReviewID": "UR59863459", "Content": "Didn't stay at hotel but had a birthday dinner which was great! Staff was all very accommodating and food was delicious.", "Date": "March 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Exceptional service at an exceptional hotel”", "Author": "mischa3000", "ReviewID": "UR59815893", "Content": "We were a group of 8 guys on a bachelor party with a one night stopover in Vancouver; given the cultural Asian influence of the city we decided the Shangri La would be a fitting choice. Suffice to say it was a GREAT choice with plenty of praise to boot. Above all it was their level of service and attention to detail that has all of us speaking of that hotel to this day, we have all vowed to return with our significant others. The rooms are spacious, modern, and extremely comfortable. Highly recommended.", "Date": "March 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nanaimo, Canada", "Title": "“This is what all hotels should aspire to”", "Author": "BuongustaioSempre", "ReviewID": "UR59735999", "Content": "After having stayed at many 4 and 5 star hotels all over Asia and Europe, my wife and I have developed an appreciation for what a truly high quality hotel can offer. Although many describe themselves as 4 and 5 star, few ever achieve a level of quality that justifies those ratings. The Shangri La hotel in Vancouver, in our experience, well deserves the rating of 5 stars. The friendliness and professionalism of the staff is very impressive. The quality, cleanliness and comfort of the rooms were admirable, with the furnishings and style of décor being of the highest quality and also very soothing. Also, the Chinese breakfast we had in the restaurant was absolutely delicious and very well presented. Every encounter we had with the staff during our stay made us feel like a truly valued customer, even although we were there for just the one night on this occasion. One unique aspect of this hotel, that may surprise the first time visitor, is that the reception and concierge areas are quite small. Although this is unusual, the lasting impression is that this contributes to a feeling of warmth not found with hotels that have larger areas for these functions. This experience reminded us of staying at a 5 star hotel in Asia, which continent we have found has a much better appreciation of what constitutes a luxury hotel. Needless to say, this hotel will from now on be our first choice when staying in Vancouver, and our recommendation to anyone else.", "Date": "March 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Superb”", "Author": "Canadian-Beagle", "ReviewID": "UR54798094", "Content": "This hotel was superb. The rooms were roomy and beautiful. No expense has been spared. The washrooms were beautiful which includes a fairly large television in addition to excellent bath products. The service was excellent. I am accustomed to staying at high end hotels and this was my first exposure to the Shangri-La. It did not disappoint and actually exceeded my expectations. I would happily stay at this hotel again.", "Date": "January 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Portland, OR", "Title": "“Stupendous service and excellent hotel”", "Author": "ORJimmyT", "ReviewID": "UR54707448", "Content": "Had a great weekend stay at this fabulous hotel. Service, room and restaurant were first class. Everyone went out of their way to make my stay comfortable. It was fantastic!", "Date": "January 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Belfast, Ireland", "Title": "“Opulent Perfection”", "Author": "MightyHedgehog", "ReviewID": "UR53766378", "Content": "Arriving at the valet entrance we knew we were in for a treat when we saw immaculately presented staff, stunning decor and even a beautiful chandelier, all in the underground car park! Our room was breathtaking and we had no end of fun finding out what all the different switches around the room would do! The bathroom was large and spotless with bespoke vanity units in dark wood and featured a large luxurious bath. A shower area and toilet area were both separated from the main part of the bathroom by etched glass doors; the TV hidden in the bathroom mirror was a great way to catch up with the morning news. A handwritten personal note from the manager was very welcoming. Our morning visit to the gym was wonderful: the up to date equipment was positioned to give us breath-taking views of the cityscape below. The outside pool and jacuzzi were very pleasant, even in the light November rain! Throughout our stay, the staff members were very attentive, very efficient and greeted us with politeness and warmth. The atmosphere was tranquil and restful at all times. The quality of finish through the entire hotel was world class and the building sits as a jewel in the Vancouver skyline. Our overall impression of our stay was that this is the ONLY place we want to stay when we're in Vancouver.", "Date": "January 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Port Moody British Columbia", "Title": "“Incredible Hotel”", "Author": "BCwinetraveller", "ReviewID": "UR53602105", "Content": "No details left unturned, from Valet check-in to luxurious room. Bathroom was beautiful with features such as heated bathroom floor, inlaid TV in mirror, large tub and shower. Suite had everything imaginable, including shoe kit including polish and brushes. Push button drapes opened to view of the downtown city location. Full bar included any type of both non-alcoholic and alcoholic drink and BC wines. Expresso coffeemaker and kettle included for tea and coffee. Room had great light for reading and a large business desk with laptop plugins and adjustable lighting. Fresh fruit was left in room after turndown service. Would rank this among top hotels I have stayed in travels throughout North America.", "Date": "January 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Belfast N.Ireland", "Title": "“The best hotel I have ever stayed in.”", "Author": "nwogaboy", "ReviewID": "UR53484601", "Content": "The room was fantastic,the furniture was very modern, bathroom and washing facilities were finished with white marble which was beautiful,and i loved the tele screen in the bathroom mirror.There are lots of electronic gismo's, like electric curtains, 42 inch flat screen T V, I pod dock etc. The central location of this hotel means its an ideal for a city break. A !", "Date": "January 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "canada", "Title": "“Made our engagement weekend AMAZING!!!!”", "Author": "sunsetmarina", "ReviewID": "UR52969300", "Content": "My boyfriend of four years proposed over the weekend at the hotel, and the staff were amazing! We were upgraded to a suite, given a bottle of champagne, and the manager wrote us congratulations cards. Their attention to detail is fantastic- ice brought to your room, beds turned down in the evening, shoe shining, complimentary water bottles, excellent bar area in the room, television in the bathroom, great soaps and toiletries... absolutely a perfect stay!", "Date": "January 8, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Montreal, Canada", "Title": "“Great hotel”", "Author": "HoaV", "ReviewID": "UR51826646", "Content": "The rooms are nice and spacious. The restaurants is ok and the food pretty good. The spa at this hotel is simply amazing!!! You cannot stay at this hotel without trying theirs spa!!!", "Date": "December 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Whistler, Canada", "Title": "“Easy and Enjoyable”", "Author": "uberator", "ReviewID": "UR51583774", "Content": "From start to finish you are treated to the best service and top amenities in Vancouver. Valet is quick to great you by name and ensure your car cup holders are stocked with bottled water. Front desk guides you straight to your room for an in-room check-in. Room is finished with top of the line material, bed and linens. A great stay and worthy of the Shangri La Brand.", "Date": "December 20, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Expert Service, Extraordinary Comfort, Delicious food and beveages!”", "Author": "seattlen", "ReviewID": "UR49906061", "Content": "Having had the distinct honor of being the first guest to check in to the Shangri-La Vancouver when it opened earlier this year, I have returned several times and have never been disappointed. I believe this is the gold standard for hotels in Vancouver for me, and I have stayed at most of the 4 stars at least once. I chose the Shangri-la as my new company hotel after some very disappointing stays at the Opus and the Fairmont. I have no regrets. I use the Shangri-la for business and leisure travel alike. A couple girlfriend getaways, entertaining family when they stayed in town at the same time I did, and to host clients when I needed a great meal and an elegant atmosphere to entertain in. All expectations exceeded, every time! Beginning with the speedy and very personal check-in service by one of their staff, butler style, you can quickly sort out your paperwork in the room and then commence to enjoying the amenities that the hotel lays before you: a welcome basket with fresh fruit and some wine and chocolate (part of the Golden Circle Amenities Program) a truly gigantic bathtub, a Magic Mirror TV (as my husband refers to them) in the large bathroom, exceptional toiletries, all the nice extra touches like toothbrush, razor and shaving cream, nail file, laundry powder, sea salts for your bath... all organized for your use. A large shower and a private toilet make this one of the nicest hotel bathrooms I have seen in a long time. Move to the bedroom and the well sized rooms have one-touch window coverings and lights all manged through a panel next to the bed. The sheets are perfectly soft and luxurious, and the bed is extraordinarily comfortable. I have been known to be a few minutes late for an event while I reluctantly ended a nap to go get ready. The gentle glow of the clock that lights up when touched is just another example of the un-intrusive comfort the rooms presents. Turn down service is always discreetly finished and ready for my restful night by the time I return from dinner or a cocktail. If I am using a meeting space, like the private screening room that can be rented for my company events, I am always pleased that the service extends to their banquet and catering staff. Lovely rooms. I would LOVE to attend a wedding here. It would be truly elegant! The Nespresso machine that I cant live without at home is also happily part of the rooms features, and I usually fix myself a quick shot of Cafe Roma while I get my luggage put away. My only wish here is that cold cream would be ready in the room for me. I usually stop by the Market next to the hotel to grab a small carton for my stay. Connectivity for your laptop is a snap, and everything you may need is a phone call away, and the staff always answers your call as if you were the most important guest in the hotel and your needs are met quickly and efficiently. When, and if, you leave the room, stop by the grand lobby lounge for a delicious \"Pacific Rim\" beverage prepared by Nadia or Shane, who will make your time there enjoyable and delicious. Stay and listen to the wonderful piano player in the lobby lounge transport you back in time to the swanky days of elegant entertaining. Work out in the private yoga room, the large and well appointed fitness room, or enjoy the locker rooms steam room to unwind solo. Lounge by the pool and enjoy the sun if there is any, or wander down to Jean Georges and enjoy the sexy vibe, for business or to unwind with your friends. Its a respectable mix between sleek and unpretentious. But more importantly the food is succulent and satisfying and treated with great care. Room service was always prompt and perfectly prepared. Any minor issue is fixed immediately, no questions asked. More cream? No problem, there in three minutes. I have had the formal tea in the afternoons as well, and it was a charming and unique way to entertain a client, she and I both had a wonderful time with it. I have spent a couple afternoons at the spa, Chi, and truly enjoyed the service and the fact that I actually felt relaxed when I left and went directly to my amazing room where I napped sufficiently until it was time to take the prompt car service to my next event. Join the Golden Circle club and enjoy extra ammenities and rapid check out. Or, as Shangri-La Vancouver inspired me to do, travel to one of their other hotels in Asia and you will find that the service extends across the oceans for a reason. This hotel group has truly defined their service standard and as a business or personal travel stay, they have made each one special and memorable. If you were to be visiting Vancouver for the upcoming Olympics, for an important business meeting, or as a special getaway, Shangri-La would be the best location for your stay. Enjoy it, for even 24 hours here can feel like a wonderful vacation. Thank you to the staff of this exemplary hotel! Go, stay, relax, luxuriate, enjoy... and return again and again! Hint: Ask for the \"Experience Shangri-La Package\" when you book your reservation.", "Date": "November 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "toronto", "Title": "“A superb hotel experience in Vancouver, BC”", "Author": "silvertreenorth", "ReviewID": "UR49555152", "Content": "I spend a great deal of time travelling for business and staying in some pretty gorgeous hotels in North America . I must say that the new Shangri La hotel in Vancouver is all you could desire in a hotel - The room was exquisitely appointed, the bed and sheets glorious, the bathroom and fixtures perfect, the room products all good quality, and all the tiny touches like the button that closes the drapes, the dimmers for all the lighting -lovely ! the best part of the hotel is the staff they are really polite helpful and accommodating. all of it done in a simple and elegant way - Plus room service was fast and efficient with great food as well . I would highly recommend this hotel to any traveller that wants the best of hotel living !", "Date": "November 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Seattle", "Title": "“Finally, Vancouver is catching up to the world”", "Author": "DA00", "ReviewID": "UR48087107", "Content": "My husband and I visited Vancouver for a \"mini-moon\" after our wedding. The location is perfect for shopping and sightseeing. The porters were excellent, reception immediately realised we were recently married and referred to me as \"Mrs\" which was a smooth touch. The hotel provided complimentary honeymoon goodies which were decadent The room was excellent in quality and the amenities first class. There was an I-Pod docking station, tv, DVD etc. The bathroom was large, unusual for vancouver, with a large bath, walk-in shower We enjoyed our daily breakfast in the room, some very polite people who answered the phones and the ones who delivered our food. The swimming pool was shallow, however, served its purpose if, as I, you wanted to swim lengths. The fitness room was excellent and the machinery was all up-to-date. We found the changing rooms and spa equally excellent. We enjoyed afternoon tea and a few drinks before dinner. Their restaurant Market by Jean Georges is certainly the talk of the town, a lot of popular faces. The concierge was exceptional and very professional in their work. I cannot fault a thing at this prestigious hotel. Will definitely be visiting again!!", "Date": "October 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "GreatNeck", "Title": "“The wonderful Shangri La Hotel, Vancouver”", "Author": "GreatNeckGreatNeck", "ReviewID": "UR47891305", "Content": "Dear Eleanor and Andrew, Thank you for a wonderful informative few days. I decided that I am a Shangri La \"groupie.\" The central location of the hotel makes it easy to visit most of the sites of Vancouver. From the moment one enters the Shangri La Hotel, the atmosphere is one of serenity, incorporating a relaxing ambiance due in no small part to the scent throughout. I found the underlining feeling of the hotel to be contemporary and comfortable while not being overly trendy. The lobby is welcoming and the separation of the lower lobby from the upper lobby turned a potential problem into an asset, separating vehicular traffic from pedestrian traffic. The rooms are not identical in shape which is a plus. Every client has different requirements.Some like spacious rooms while others prefer large bathrooms and closets. Thus, a room can be assigned accordingly. The lighting in the bedroom was tactfully done and the bathroom lighting was bright enough so one can see. The bathtub has a back support and the additional amenities, (bath salts and lufa, special beds and bedding, pillow menu, the clock that lights up when touched and does not glare at you in the dark) make one realize that a lot of thought went into making the rooms extremely efficient, as well as comfortable . The wonderful balconies afford a spectacular view of the city. CHI is the ideal place to relax and unwind after a busy day, with different treatments to fit varied needs and time constraints of hotel guests. John George restaurant serves exceptional meals from breakfast to a wonderful dinner. The French toast offered on the breakfast menu is exceptionally good, as was everything we sampled for dinner. The formal tea was also an experience, with sandwiches, scones with clotted cream and sweets, not to mention the beautiful china on which it is served. Your entire staff was polite, attentive and helpful. Evy Edelman", "Date": "October 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York", "Title": "“I found my Shangri-La and didn't have to go to Asia...”", "Author": "andrewrnyc", "ReviewID": "UR47458008", "Content": "They did it. Smaller scale, but they achieved that five star Asian style of luxury. The settin is elegant and modern, not trendy. The arrival experience is very surprising. Being driven to the hotel down a ramp to the lower lobby, I was greeted by three people: one to get my luggage, one to direct the driver where to exit and the other to escort me to my guest room for check in. Total privacy. How nice... The bellman arrived during the short check in and explained everthing that my room conceiled. There is an amasing sound system under the TV. ipod station next to the bed. Control panel next to the bed to adjust everything in the room to set my mood for anything. It's like a showroom. Italian hand crafted furniture to envoke the feel of Vancouver, technology that offers everything (biggest TV in the city), and my favorite are the drape controls. Oh, I didn't mention the floor to ceiling marble bathrooms with TV hidden in the mirror. Not to mention the large glass shower with ajoining seperate tub. Did I mention floor to ceiling windows with shade controls. Amenities: L'Occitane, even bath salts. Entertaining: Market, by Jean Georges. Four areas to relax, impress or pick up. The lounge is sexy and not pretentious. The cafe, casual and affordable with a fire place. The terrace offers out door sexy mingling. The dining room bellows with banquettes and two private dining rooms. I need to figure my next event to host there overlooking Vancouver streets. Fitness facilities had to be over 5,000 feet. This is serious. Windows and new equiptment. Trainers on request that also offer access to another high energy facitilty accross the street. How about the outdoor pool and hot tub? They top it all off with a juice bar with a European goddess that knows what each fruit can offer to replenish your body. The lobby, sexy and tailored with some shimmer. Anyone arriving into the Shangri-La knows this is a committed luxe hotel that does it in subtle ways. No attitude. Just warm freindly styles. They have the magic of figuring out each guest to see what will make me feel comfortable and welcome, like they were expecting me. It may also be my fantastic travel agent. So for a Shang, this one is the sweet little stylish sister that moved to Vancouver. She is figuring out her space and emitting her flavor.", "Date": "October 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Lovely Hotel”", "Author": "NikkiS7", "ReviewID": "UR47114206", "Content": "There is only one complaint that I have, and it's petty I admit. The car entrance is underground; we circled probably 2-3x trying to find the entrance, but once we stepped foot into the hotel that made up for it. Very professional the way we were escorted to our room with guided tour. Explanation of what we ordered and preliminary charges. My boyfriend's computer was not picking up the free WiFi signal. They immediately sent up their IT guys to work on it...even though we never got connected they worked very diligently. Location is perfect. Right next to Robson Street. Breakfast, great. Professional and patient concierge. LOVED the bathroom. The suite we were in was impressive. Staff were exemplary. No complaints at all. They made sure we were comfortable during every second of our stay. Not to the point of nagging though. All in all, great stay.", "Date": "October 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "wodonga", "Title": "“Best from the rest”", "Author": "anderson25", "ReviewID": "UR46489795", "Content": "After reading many mixed hotel reviews and upcoming weather reports for the region and I was frustrated. Then I remembered my stay at Shangri-la Hong Kong—where the accommodations, service and general atmosphere made the hectic center of hongkong City feel like a leisurely escape. I had been to their properties in Cairns, andBeijing as well. There is a consistent feeling when you enter a Shangri-La—it is calming, sophisticated and luxurious—what I wanted in a business environment or romantic/leisure getaway this brand has it. The hotel staff were excellent throughout our stay and I'd like to take this opportunity of thanking them for a truly wonderful service. First class hotel and fully recommended.", "Date": "October 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Valsolda, Italy", "Title": "“Not quite the full Shangri-La experience”", "Author": "kenmaestro", "ReviewID": "UR46415704", "Content": "I stayed at the hotel in April 2009 so it had only just opened. The underground arrival is slightly weird but very efficient and I was escorted up to my 'upgraded' suite. I had book a deluxe corner king with balcony and was given a suite that, whilst beautifully appointed, had the most odd proportions and NO balcony. Many of the things one comes to expect from Shangri-La in Asia were in place - I took breakfast in my room each morning and it was beautifully presented and perfectly prepared, the bathroom was almost as big as the sitting room and was wonderfully appointed. The bedroom had a huge (50\"?) wall TV. It was so huge that the only place from where you could properly view it was in bed! When you take the elevator to the lobby you find yourself in a rather strange granite sided 'void' or that's at least how it feels. I took lunch one day at Market and it certainly lived up to Jean-George's East Coast reputation. In summary, certainly worth the special deal that I booked but will find it difficult to justify the racj rate of anything close. It's a very good addition to the Vancouver scene and may help bring the standard of other 'wannabe' properties (q.v. the Grande Residences at Sutton Place) up to scratch.", "Date": "October 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Vancouver", "Title": "“Unsophisticated Staff- consierge”", "Author": "roxygirlVancouver", "ReviewID": "UR43973914", "Content": "My spouse & I booked a weekend stay at the Shagri-la in Vancouver for our anniversary, and we were sadly disappointed regarding the level of service we received for what we paid. The amount of money we paid, should have reflect ed world class service and the Shangri -la & all of its unsophisticated phony staff, (especially the consierge who looked like he didn't want to be there) failed to deliver. I bet that when he goes somewhere, he expects to be treated like a King by everyone, but my wife & I were treated like we were staying at the Best Western. This hotel is overrated and failed to deliver. We will not recommend this hotel to anyone. What a joke.", "Date": "September 23, 2009"}], "HotelInfo": {"Name": "Shangri-La Hotel", "HotelURL": "/ShowUserReviews-g154943-d1176419-Reviews-Shangri_La_Hotel-Vancouver_British_Columbia.html", "Price": "$288 - $482*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1128 West Georgia Street</span>, <span class=\"locality\"><span property=\"v:locality\">Vancouver</span>, <span property=\"v:region\">British Columbia</span> <span property=\"v:postal-code\">V6E 0A8</span></span>, <span class=\"country-name\" property=\"v:country-name\">Canada</span> </span></span></address>", "HotelID": "1176419", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/6a/b3/f9/shangri-la-hotel.jpg"}}