{"Reviews": [{"Content": "Terribly disappointing We had been looking forward to our stay at Royal Candidasa, it has been a long and sometimes difficult year. After arriving at the Royal we were put on the wrong foot from the outset. We were asked why we were arriving a week late? We had in fact booked an extra night and were arriving on a friday rather than the usual Saturday - they really seemed surprised by this arrangerment even though we had this booking in place for many months.We were then shown to our room which seemed to be still made up for the previous occupants ie the foldout bed was in place in the middle of the living area and none of the usual quilts and cushions were in place on our bed. All this is no big deal but it set the tone for the next days at Royal.My next grumble would have to be the smell of the place. Royal seems to have real problems with plumbing and we made sure we kept the bathroom doors shut when we weren't in them or the smell would make life pretty unpleasant. Royal also seems to think that having over-perfumed bath/pool towels might solve the problem - it doesn't and you get good at holding your breath when you towel down.The manager came by on day four and gave us a discount card....we are still wondering why it took 'til day four to be told that we could get 10% discount on meals and also drinks except in happy hour...what happy hour? No-one had told us there was one and there's no sign to say there is, but hell it's not worth getting excited over anyway, as it's only 20% off drinks, which are already way overpriced in comparison to anywhere else in Candidasa. We wonder why they bother with this discount card at all, why not just lower the prices a bit and then you won't have so many guests eat elsewhere when they find out they can for a lot less.Staying at the Royal you get the feeling you are watching something slowly dying - the rooms are in need of a complete refurbishment ie the kitchen area is horrid and why is there a water cooler stand taking up floor space with no water bottle in it? Where are the complimentary bottles of water which almost all resorts supply each day?With so many wonderful resort, hotels, bunglaows etc available in Bali and Candidasa for that matter, Royal has to lift its game and make your stay there special. Instead of staying the 8 days which we had paid for, we left after 5 and stayed at a beautiful little resort in the heart of Candidasa.We are so disappointed with our stay at Royal but not the staff, who were always warm and friendly. I hope that Royal picks up its game and gives their terrific employees a hotel to be proud of ....Royal Candisdasa is not.", "Date": "Dec 29, 2008", "ReviewID": "UR910811832", "Ratings": {"Service": "4", "Business service": "1", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2", "Value": "1", "Rooms": "2", "Location": "3"}, "Author": "SOOz-Trip"}, {"Content": "Overrated, Boring Time share based resort located about 8mins drive South of Candi Dasa in the village of Manggis. The resort itself is lovely, don't get us wrong. The rooms were a good size, two BRs, two bath, small living area and kitchenette. Rooms were run down and our white tiles looked like someone had dragged an engine block across them. They had in-ground oil stains all through the unit. The rooms were clean though and well cleaned during our stay. The kitchen needed an urgent upgrade as the wobbly, slate-tile bench-tops are so 80's. We have four kids, two of whom were supposed to sleep on the pull-out sofa. Unfortunately, the sofa bed had three broken welds and refused to pull out, so the kids slept on a mattress on the floor. The poor staff did not know what to do, as the sofa was very heavy and we were in an upstairs unit. Co-incidentally maybe, but those two kids got very sick and the doctor had to be called. The doctor, might I add was very nice, very quick and dispensed medicines that saw a quick recovery. Travel insurance will cover that, so we're not worried about the cost, but the inconvenience and worry surely weren't needed. The resort has a beautiful open air restaurant that serves gorgeous food. The only problem being, it is triple the price of that offered in the nearby laneway, less than 50m away. Warm beers that were 36000rp at the resort, were 16000rp across the road, ice cold. We actually found eating in Candi Dasa the best. Reduced tourism has meant most restaurants pick up and deliver for free. So you go in for lunch, have a look around, come home for a swim and relax, then go back in for tea/drinks and get dropped home at your convenience. Cafe Wayan we found to be excellent value and quality. A mini-mart in town offers cheap supplies and the resort offer a free, but inconvenient shuttle service to and from. Otherwise it is 20000rp ($2.50) each way. There is no beach front as the surrounding reef was mined and crushed for lime many years ago and the coast line is now open to mother nature, which has kindly removed it of sand. Only rounded, black, volcanic rock remains. Google Earth has a shot of the beach front. The pool at the resort is far too small. At the end of the day, there is little to do but relax and sit around the pool. (which is why we actually chose to stay here) Unfortunately, when all the resort is doing this every afternoon, it is standing room only in the pool. This place is nice, but not worth the price.", "Date": "Jun 15, 2008", "ReviewID": "UR927131024", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "3"}, "Author": "sweet6deans"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g312684-d1182796-r23088462-Royal_Bali_Beach_Club_at_Candidasa-Candidasa_Bali.html", "HotelID": "1182796", "Price": "Unkonwn"}}