{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“I like it !! The room is cute and i love it”", "Author": "nFatrin", "ReviewID": "UR122075539", "Content": "I love the room and the staff was nice I saw a lot of people write bad review but i think this is kinda good room", "Date": "December 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Skopje, Republic of Macedonia", "Title": "“Bad!”", "Author": "TheITGirlMK", "ReviewID": "UR121680245", "Content": "I didn't expect too much from the motel since we were looking for the cheapest option available, but even the price we payed is not cheap enough for this hole. The room we had was tiny. We barely managed to find place for our bags. There is no closet. The bathroom was also very small and the door closed only from the outside. Sheets were old, smelly and with lots of stains. The TV was old and had a bad picture. The AC was to loud. Breakfast was served in an office next to the motel and there is no place to seat and eat, but if you are fan of the cheapest cereal you can take it to your room. There is a Wi-Fi network but it didn't work and the receptionist couldn't help us since he barely spoke English. The only good thing is the location, it's a 2 minute walk from the Chinese Theater and the walk of fame.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Never again!”", "Author": "Skoda12", "ReviewID": "UR119480273", "Content": "We wasn't expecting too much from this hotel as we only want somewhere to sleep. Unfortuntly the good location came at a price of not being able to sleep. The staff were very unfriendly and unwilling to help. The room was ok but in need of a good clean,. All you can hear throughout the night is the traffic on the main road next to the hotel and the constant sound of helicoptors and sirens. I would personaly recommend this hotel to bacpackers and young travellers", "Date": "October 19, 2011"}, {"Ratings": {"Overall": "2.0", "Rooms": "1", "Value": "2", "Location": "3"}, "AuthorLocation": "San Diego, California", "Title": "“lazy cleaner”", "Author": "syliaz", "ReviewID": "UR118093783", "Content": "only stayed the night for sight seeing with my best friend. As you walk up the stairs please watch your step or you might trip over on that extra \"step\" inside the corridor. :S Room was dirty, under my friend's bed we found piles of chewed up sunflower seeds, clearly the cleaning lady is lazy and doesn't use the vacuum cleaner for arriving, paying guests. Toilet is situated smack bam, close to the wall, feels like you have to sit at an angle to go to the toilet. Never again, that's for sure.", "Date": "September 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Vienna, Austria", "Title": "“clean, not more”", "Author": "Roundtrip23", "ReviewID": "UR110371296", "Content": "The area is already pretty shady, yet if you're looking for a clean place, somewhat close to where stuff is happening...take it. On a weekend I paid 70+t which is , of course, a rip off. This place is the absolute basic. I only took it because i was running out of options and had a roomsaver coupon that didn't coun't. Book in advance if you go to LA.....lesson learned.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Eugene, Oregon", "Title": "“Do not rent here!!! Worst experience ever!!!!”", "Author": "mcmuffin12", "ReviewID": "UR81256102", "Content": "Expect harassment from management for no reason at all. The foreign couple who runs the inn is rude and has terrible communication. The manager calls me after I check-in and demands payment for additional people staying over even though it was only my wife and I there. For whatever crazy reason, he believes I will throw some massive sleepover party and he wants money for it. After telling him that we’re not having anyone over, he calls again and threatens that he will have security take me to the police station. Later, as expected, the security guy comes a knockin and of course, he finds no other people around. When the couple felt the need to abruptly end a conversation, the husband would start saying “Money, money, money, money” accompanied by the gimme money hand gesture. When I tried to talk over that annoyance, his wife would jump in chanting the same. Then they would run away from the front desk. It was surreal. I thought I was in an episode of Seinfeld. The bathroom is tiny. There is literally about 6-8 inches of space between the front of the toilet and the wall/door. So you cannot sit down normally to use it. The manager’s wife also does the cleaning as they are too cheap to hire staff which explains why it’s not clean there. Bottom line, DO NOT RENT here. I wouldn’t stay for free. It was a horrible experience but I hope I can save others from this mess.", "Date": "September 27, 2010"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Brisbane, Australia", "Title": "“It's not worth it - even on the tightest of budgets”", "Author": "allherdoubts", "ReviewID": "UR79285294", "Content": "I had booked this hotel for the last few days of our stay in California. Whilst in San Francisco, I rang the hotel to advise that we had some issues with our flight and that we would be checking in on the 7th instead of the 6th. The person who answered the phone did not understand English well and seemed to misunderstand me, and tried to confirm that I would be arriving a day *earlier* instead of later as I had tried to explain. I said no, we are coming the day *after* we are supposed to check in, is that OK? - the person on the other end of the line said \"Fine, see you then\" and hung up. Upon arrival at the hotel we were greeted with abuse because they had been expecting us a day earlier than our check in date. The proprietor of the hotel then started shouting at us that we had rang on the 4th and said we would be arriving on the 5th. We in fact had told them that we had rang on the 5th and advised that we would be arriving on the 7th. The manager then advised that if we wanted to stay there, we would have to pay for the \"extra night\" that we had \"rang and booked on the 4th\". I was glad to take my business elsewhere and pay the booking cancellation fee rather than stay there, it looked terrible. We ended up staying at a hostel down the road which was both cleaner and cheaper.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Stayed here 2 times and went home with bed bug bites 2 times!”", "Author": "GAD9452", "ReviewID": "UR77413751", "Content": "The room is what you would expect for the price. A bed and bathroom, fridge is nice! Bathroom is small either use the toilet with the door open, or sit sideways on it. What I hated the most was the unexpected guest! BED BUGS! Had bites up and down both arms!", "Date": "August 29, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "England", "Title": "“Awful”", "Author": "Worldtravel009", "ReviewID": "UR29883342", "Content": "We have been traveling in the USA for a month and this was by far the worse!!! It was not worth $75 at all, it was dirty and smelly. The beds had bugs that bit us alive. The windows were held closed with blocks of wood. There was cigarette burns everywhere. The air-con unit had melted and throwing out gunk all over the carpet which was not removed. A bag in our room disappeared and the owners were extremely rude about the situation. I do not recommend this hotel at all. I wish we had paid out an extra $20 and stayed in the comfort inn across the road.", "Date": "May 13, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Vancouver", "Title": "“Don't Do It!!!!!!!!!!!!!”", "Author": "thaiaim", "ReviewID": "UR23237001", "Content": "Don't be fooled by it's address on Sunset Boulevard. It's nothing but trouble. The hotel (if you can call it that) is right off the blvd so anyone on the main street had easy access to your car and hotel rooms (you can walk right from the street to the hallways of the establishment). You will hear noises from the street all night. We got a NON-SMOKING twin double bed to find out that the room was complete with cigarette smoke AND an ash tray. When questioned why it was the case, the hotel staff nicely explained that he could not stop guest from smoking. The bathroom was filthy, no bath tub (even if there was, we would not go in there), just standing showers. The A/C unit looks like it's from the 1970s and it surely produces more dust and dirt than breathable air. Last but not least my boyfriend woke up with BEDBUG BITES all over his body (I was spared, for some reason). It was the worst experience of the trip. We informed the manager and he did nothing about it. Do not stay there. We paid $72 for the night and we wish we had spent more money to make sure this would not happen.", "Date": "January 3, 2009"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Brighton, England", "Title": "“OK for a cheap night”", "Author": "goldcardluke", "ReviewID": "UR22725686", "Content": "I stayed here for 1 night with friends. We were already paying for a hotel in Anaheim, but we wanted a place in Hollywood as we were going out for the evening. We paid about $75 per room. The good thing about this hotel is the location – about 5-10 minutes’ walk to The Walk of Fame and other attractions. The room was large. There was hanging space for clothes and the sheets seemed clean. The bathroom door did not shut completely and the room was quite dark, partly due to the lack of window light. When I opened the curtains in the morning the view was a brick wall and there were pigeons nesting on the window ledge which was very messy. The free takeaway breakfast was tea/coffee and fruit, pastries and donuts. If you are on a tight budget, the hotel is OK. I did not mind staying here for 1 night – it was really just a place to sleep for a few hours after a night out. I would not stay here for an entire holiday.", "Date": "December 14, 2008"}], "HotelInfo": {"Name": "Budget Inn Hollywood", "HotelURL": "/ShowUserReviews-g32655-d1186068-Reviews-Budget_Inn_Hollywood-Los_Angeles_California.html", "Price": "$65 - $82*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">6830 Sunset Boulevard</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">90028</span></span> </span> </span> </address>", "HotelID": "1186068", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/22/77/227756bec6758f759fb1c383bfd30ff37large.jpg"}}