{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Great Price, Reasonable Amenities”", "Author": "CynthiafromOhio2011", "ReviewID": "UR126783616", "Content": "Selected this hotel mostly because of the price and good experiences with other Quality Inns (see my review of the Quality Inn in Troy, Michigan). This place was a mixture of very good and some areas that were lacking. The positives and then the \"howevers\": 1. Very competitive price. I paid $109 for a standard room. During this period, comparable rooms closer to downtown were $199 and up. 2. Safe location: however, not close to anything. This hotel is located in a commerical / warehouse district. Nothing to do or eat really nearby. (There was an attractive Thai restaurant across the street, but you would be risking your life to try to cross this multi-lane street w/o a stop light.) If you are willing to walk a couple of blocks (in the scorching sun of Phoenix), there are some other alternatives. 3. Hotel provides free transporation to / from the airport; however, the shuttle is not a Quality Inn shuttle. You need to arrange transporation with Super Shuttle from airport (and then the hotel will pay Super Shuttle -- a cumbersome arrangement). Transporation into the real downtown by the hotel is only available Monday-Friday during a limited amount of hours, that did not work for me (or likely to work for anyone else). 4. Room was very clean; daily housekeeping was great. However, my room seemed dark and claustrophobic. Room had two double beds, but was crowded, e.g., the chair for the desk could not be used as there was not sufficient room between the desk and the bed.) Room needed more lighting, and the hallways also needed more lighting. My room looked out into a alleyway; however, the more expensive rooms have views (patios or balconies) of the courtyard with pool. AC in room was great, but hallways were a little too warm. Room was a bit dated, but everything worked and was in pretty good condition. 5. Morning breakfasts were great each day. Real scrambled eggs (not the powdered eggs you frequently find) and excellent sausage. Lots of choices for breakfast, and the breakfast room was very clean and well-stocked. 6. Good business center w/ up-to-date PC and excellent printer. However, internet speed was a little on the slow side. 7. Woman who worked the front desk and breakfast room was great -- helpful and friendly; however, the other front desk individuals were average - OK, but not particularly memorable. 8. Free USA Today and Wall Street Journal newspapers available each morning. Wonderful to have a choice of reading material. Lobby was very nice.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Nothing spectacular, but a solid place to stay”", "Author": "Ebart01", "ReviewID": "UR123742372", "Content": "Business traveler spending one night before flying out....location is in a commercial district, not scenic, but seemed safe. Great central location to museums, and 5 minutes to Sky Harbor. Area northeast was rough, but plenty of dining options. Room was average, rooms have balconies. Staff was courteous and knowledgable. Left too early for breakfast.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Indiana", "Title": "“An excellent choice for (just north of) downtown”", "Author": "WesIndiana", "ReviewID": "UR119622123", "Content": "This property is spotless. My room was clean, spacious, and orderly; the pool area was inviting; the lobby and breakfast area, while small, were clean. Breakfast includes a generous spread (eggs both scrambled and boiled, sausage, waffles, assorted breads, pastries (all individually wrapped), juices, cereals, coffee/tea. Every staff member offers a friendly \"hello\" when you walk in or out. It is located next to the Arizona Art Museum, which is next to the McDowell/Central light rail station. You're one stop beyond the edge of ASU downtown and two stops beyond VanBuren and the edge of business/commercial downtown. If you choose to walk, you're about 10 minutes north (along 3rd Ave) from the edge of ASU downtown along a (seemingly safe) mix of apartments, condos, and a couple schools. There's a hotel van parked out front offering free shuttles to the airport and local destinations. A large CVS is just west of the hotel and a large Safeway/McDonalds/Subway/Pizza is a block west. For me and my family, it's a great value option for downtown. The light rail provides easy access to the airport, ASU, and points beyond.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Houston, Texas", "Title": "“Worst Experience Ever!!!!!!! No Customer Service. A DUMP!”", "Author": "deidre2k", "ReviewID": "UR109957659", "Content": "Checked in during cross-country road trip at 3am. Got to room to discover there were not enough towels. Was told I had to wait until 10am to get more towels. A/C was broken and room temperature rose to 90 degrees. Woke up in hot sweat at 8am and informed the \"General Manager\" who refused to offer a refund since we had \"enjoyed the hotel's amenities\"! Left by 9am.", "Date": "May 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“GOOD CALL FROM MY FRIEND”", "Author": "SethBee", "ReviewID": "UR93474744", "Content": "My friend foudn this place by accident a year ago and he always stays there when he goes to Phoenix. He likes to stay on a Friday b/c it is so close to First Friday, a great monthly arts and culture festival in Phoenix. There shuttle takes him there and picks him up. Add to that great rates and very accomodating staff who remember your name when you come back and this place is a winner.", "Date": "January 17, 2011"}, {"Ratings": {"Overall": "5.0", "Value": "5", "Service": "5", "Location": "5"}, "AuthorLocation": "Prescott, Arizona", "Title": "“A+ Staff. Quick, friendly, caring, & treated me like family- 3 month stay.”", "Author": "PmSil", "ReviewID": "UR64777719", "Content": "I lived in this hotel for 3 months, while my husband was in the hospital. Most times I was lonely and afraid (sr. citizen). The Staff became my second family and I will forever be grateful for all of thier kindness and understanding. They took care of me from check-in to check-out and made me feel safe, and protected. The garden and pool area is absolutely beutiful. I have stayed in hotels all over the US, and this staff is the best of all. Thank you, forever, P.", "Date": "May 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Santa Cruz do Sul, RS", "Title": "“Average Hotel, but very good front desk + location to nearby museums”", "Author": "ChrisBoge", "ReviewID": "UR64124229", "Content": "We stayed 1 night : April 27th. Our 13 hour flight from Brazil > Houston > Phoenix arrived about 8:30am and we were prepared to wait until 3pm to do the respective regular check in. Well, we arrived at the hotel at 9:30am and our first great surprise was that the Hotel front desk manager understand our long trip adventure and allowed us to do the check-in immediately + breakfast with no additional fee. That was great. Rooms were average, remembering dark 80´s design (maybe it was a motel before), but very quiet. All equipments TV, free high speed Wi-Fi, shower and other items in good shape. Outdoor pool and business center OK. We choose this hotel for only one motive: the nearby Heard Museum (native American Indian art and culture) and the Phoenix Art Museum can be reached easy by foot in a not longer than 5 to 10 minutes walk.", "Date": "May 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Phoenix", "Title": "“Average quality, but decent value this close to downtown Phoenix”", "Author": "Cadillac22", "ReviewID": "UR55118209", "Content": "This seems to be an older motel that was refurbished quite some time ago and could use further freshening. It's okay, just nothing special. Check-in and check-out were fast and friendly. There is ample free parking. There is an elevator, but it's a bit dodgy, with the first-floor indicator light always on and the first floor button light not working, as well as the light fixture in disrepair. The halls are dim and a bit dingy. The two-queen-bed room was decent sized and clean. Like the halls, the rooms need a bit of updating -- some peeling wallpaper and dents and scars on the walls, etc, give the room a somewhat down-scale appearance. The beds, linens and pillows were not bad although not of luxury quality. The room had a fridge and the TV had lots of channels. Wireless Internet was good and the lamp on the work desk included two outlets -- nice to be able to plug in the laptop and phone without crawling on the floor. The HVAC unit was in a closet (apartment-style) and worked well. The shower curtain smelled a little bit mildewy but otherwise the bathroom was okay. There was plenty of hot water and the shower temp stayed constant, which is not always expected in an older motel. Location-wise, the motel is about 1 mile north of downtown, which is easily accessible by car, light rail, or even by foot if it's not a hot summer afternoon. The neighborhood is not bad and there are lots of restaurants nearby. Value-wise this is actually not a bad deal -- a hundred bucks in Phoenix during peak season (winter) is pretty good. You'll pay a LOT more for the Hyatt or Sheraton, so this is a good option if you're not on expense account and you don't mind a short drive.", "Date": "February 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Phoenix, AZ", "Title": "“Pleasant Stay”", "Author": "themooresangel61", "ReviewID": "UR24833913", "Content": "I enjoyed my stayat this motel. THe beds were not the best, but I did not have any problems. I enjoyed breakfast in the morning as well.", "Date": "February 20, 2009"}], "HotelInfo": {"Name": "Quality Inn & Suites Downtown", "HotelURL": "/ShowUserReviews-g31310-d118790-Reviews-Quality_Inn_Suites_Downtown-Phoenix_Arizona.html", "Price": "$89 - $208*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">202 East McDowell Rd</span>, <span class=\"locality\"><span property=\"v:locality\">Phoenix</span>, <span property=\"v:region\">AZ</span> <span property=\"v:postal-code\">85004</span></span> </span></span></address>", "HotelID": "118790", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/aa/b8/aab8d86e109528b5a8572cd074f342e27large.jpg"}}