{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“One must bring airplugs.....”", "Author": "Babu M", "ReviewID": "UR127529727", "Content": "A bit far from the city of Rome and the main airport, Fiumicino, but the area is fairly nice. It takes 10 minutes of walk to the commuter station then 15 minutes with the commuter train to Termini, the central station of Roma. But If one needs to fly from Ciampino airport then its good for a night or two but be prepared to put up with the noise of landing and taking off's and the train that passes by the hotel. The personnels are nice, polite and service minded yet I had to raise my voice to make them change my room. The rooms are neat and clean and the breakfast restaurant is fair. The personnel of the restaurant are very nice.", "Date": "April 9, 2012"}, {"Ratings": {"Overall": "1.0", "Location": "1", "Service": "1"}, "AuthorLocation": "Oslo, Norway", "Title": "“Unprofessional!”", "Author": "WHO492", "ReviewID": "UR119695200", "Content": "When searching for a hotel close to Ciampino airport with swimming pool, this hotel showed up. I booked a room, but when I arrived in the afternoon, warm and sweathy,and asked for the pool, I was being served a lie: \"I'm so sorry, the pool broke down three days ago\". When looking at the pool area, it was clear that the pool had been out all season, reinforcement bars at the pool side were rusty and weed were growing in the pool itself! The hotel is \"next door\" to both the railway line and the runway, so it's extremely noisy. I have now waited three months for a refund from the hotel, and they keep telling me \"the refund has been made\".", "Date": "October 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Good but don't forget your earplugs”", "Author": "valevh", "ReviewID": "UR66308601", "Content": "This was a good value hotel for Rome, but it was noisy, due to aircraft noise from the nearby airport. The room was clean, the sheets and bed very, very comfortable. The breakfast was Italian style (coffee, cakes etc) but not enough, just 2 small breads and a bad cappuccino. Don’t think to go walking to the airport, it’s impossible, it is about a 10-15 minute walk to Ciampino rail station and from there take a bus to the airport (1.30€ single ride). There is Wifi, and service was ok. Our bad luck, it was the champion’s league final that night, 50 noisy kids and a bus of Asian persons who left a 6.00am, so not really possible so sleep well with the noise plus the airplanes… We took this hotel because wanted to get easily to the airport and sleep out of Rome's noice and it wasn't the best choice...", "Date": "June 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "hedley hill", "Title": "“Convenient and very clean but don't forget your earplugs”", "Author": "pjdscott", "ReviewID": "UR52346012", "Content": "This was a great value hotel for Rome, but it was noisy, due to aircraft noise from the nearby airport. We asked for a quiet room in advance, but could still hear planes, and were thankful we had our earplugs. The room was clean, the sheets and bed very, very comfortable. The breakfast was Italian style (coffee, cakes etc) but ample for most, I suspect. It is about a 10-15 minute walk to Ciampino rail station and not too hard to find by foot. We didn't use their restaurant, but when I asked about wifi, the receptionist was most helpful and the wifi was free! However, you need to bring your laptop to the foyer - the signal does not extend to most rooms. We will definitely consider it again, especially if we can get a similar deal.", "Date": "January 2, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Calgary, Canada", "Title": "“Waht a difference a year makes”", "Author": "Calgary68", "ReviewID": "UR45511682", "Content": "Our hotel in Rome – the Hotel Ciampino was a real disappointment from the (same) hotel from last year. Last year, the hotel suffered a hot water outage. This year it just suffered. It was hot - no - it was insufferable. When I complained that the room was an oven, the desk clerk was indifferent, but finally offered us another room – which was worse. We did manage to sleep – don't know how – maybe the Zopiclone. Worst breakfast (of 20+) on the trip and a staff who didn't give a damn. Would we go back? Not a chance!", "Date": "September 30, 2009"}], "HotelInfo": {"Name": "Ciampino Hotel", "HotelURL": "/ShowUserReviews-g187791-d1187419-Reviews-Ciampino_Hotel-Rome_Lazio.html", "Price": "$38 - $207*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via A. Grandi 2</span> | <span class=\"extended-address\">Ciampino</span>, <span class=\"locality\"><span property=\"v:postal-code\">43</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "1187419", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/4c/29/4c294b87f63af8bb9b104ee81c79b88a1large.jpg"}}