{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Albert Lea, Minnesota", "Title": "“Decent place for extended stay”", "Author": "Jena T", "ReviewID": "UR128061901", "Content": "Attended a business meeting at this Suite, which was a perfect venue for an extended stay. Kitchenette is not well stocked, but usable. Grocery and shopping within close driving distance. Breakfast and dinner included in stay. Suites were perfect. Good hotel, I would recommend for all types of travelers and families.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Seattle, WA", "Title": "“Mostly Great!”", "Author": "OpEd", "ReviewID": "UR126463069", "Content": "I stayed here for 1+ week for work. The location is very convenient to the I-17 freeway and there is lots of retail just on the other side of the freeway. Staff: Amazing staff that was super friendly and went out of their way to talk to us and assist where possible. There was one breakfast staff person that was actually kind of rude (I think her name was Lori? Not Edith who was great), but she did warm up over the course of my stay. Rooms: The rooms are actually on the nicer end of most Homewood's I've stayed in and it was great to have a kitchenette. My only two complaints are that I was in a 5th floor room and while my room was non-smoking, the rest of the floor did have smoking rooms. Two nights after I checked in, I went up and it REEKED in the hallways coming to and from my room. If I had known, I would have asked for a different floor. It smelled pretty bad for the rest of the stay. The second is the shower ... the water pressure was low and my water never got really hot hot. Just more than warm. Amenities: I did not use the pool or the gym, but the outdoor BBQ's are a nice feature and the on-site laundry was very convenient. The elevators are pretty slow, but I used the stairs most of the time. I also used the business center to print some things and I like that it was in a separate room and I never once had to wait for a computer. The free breakfast was nice and they did provide a variety of items. If you came down later in the service, things like bananas and so forth were gone, but I was always able to find something hot. The bagels were pretty rock hard though. They are serve a \"mini\" dinner a few nights a week and while not great, it was super convenient when I was in a rush or if you're looking to save money. The dinners included free wine and beer. This would be an excellent hotel for a budget-conscious family. You get the suite / separate bedroom set-up plus a kitchenette AND the hotel serves you breakfast and dinner. I'll be back - just on a different floor!", "Date": "March 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Solid Homewood”", "Author": "FPodesta", "ReviewID": "UR125709115", "Content": "This Homewood, as its name suggests, is located in an office park area just outside of Phoenix. We had a 2-bed suite for an extremely reasonable price. The breakfast was as expected from a HWS, and the rooms were comfortable and clean. There was some lingering stench of cigarettes in the hallways, but it may have been related to one chain-smoking guest. All in all, it was a fine stay.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "White Lake, Michigan", "Title": "“Nice 3-day Stay.”", "Author": "Jugandme", "ReviewID": "UR125153067", "Content": "We liked this hotel very much. The staff was very friendly and helpful. They provided free breakfast every morning, and dinner for Mon. thru Thurs. We appreciated the provided computer in a quiet private room off the dining room. The only change I would appreciate would be to provide more cable channels. For such a nice facility, there was a smaller selection of channels than in a lot of cheaper places we have stayed in. No History or A & E, which I would have enjoyed after a day of sightseeing. Also, since these are suites, there is a kitchenette, and we think someone was frying onions all night long. The smell was quite strong. This was on the 3rd floor. But all in all, it was a good experience.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Manitou Springs, Colorado", "Title": "“Enjoyed my stay”", "Author": "ol_blue", "ReviewID": "UR123574140", "Content": "Based on previous reviews, I was little hesitant to book into this Homewood Suites location, although I'm a Hilton Honors member and usually find them to be great. I stayed for two nights (Jan 21-22) in a King suite on the 4th floor. The room was clean, the bed was very comfortable, and I never heard any other guests during the night. I never had a whiff of cigarette smoke, even though the 5th floor is a smoking floor. I thought it was easy to find the place, right off the 17 freeway. The complimentary breakfast had good variety. I missed having hard-boiled eggs and bananas, as some other hotels provide as part of their offerings. I will stay here again.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Yuma, Arizona", "Title": "“Good Place overall”", "Author": "jeb g", "ReviewID": "UR123339157", "Content": "This was a good place to stay. We were only there for one nite but it would be a great place to stay for a week with the family as they have a full fridge/kitchen area. We had the morning breakfast. it was ok but honestly the bf at hampton is usually better. but this is the place to stay if you need to feed a famly with out going out every nite. The workers were freindly. the pool was warm. the free popcorn was enjoyed by the kids. Thanks", "Date": "January 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Palm Springs, California", "Title": "“Nice place to stay”", "Author": "jchopstix", "ReviewID": "UR123199963", "Content": "This Hilton property is centrally located in Phoenix. The room rates are very reasonable. Well designed space for hotel of this type. The room was a little dusty and is in need of some minor repair work to the suite that we stayed in. The room was quiet and allowed for a good nights sleep. If you want the breakfast buffet go early as the small dining area will not accommodate everyone. Guest seem to hang around after eating and are oblivious to other guests desire to be able to sit at the table and have a meal. Saw many guests eating in the hotel lobby, on the sofa or taking the food back to their rooms.. Over all not a bad place to stay!", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Watkins Glen, New York", "Title": "“ODD”", "Author": "tigtink", "ReviewID": "UR121015381", "Content": "OK, This was an interesting hotel to say the least. This was our first trip to Phoenix so we wanted to stay and have the opportunity to stay where I could fix my own meals. OK - lets start with the positives: 1) Staff - very friendly and helpful - no complaints whatsoever - very nice people 2) morning breakfast and evening dinners - very nice - not 4 star or anything - but very appetizing and free - saves a lot on a trip 3) pool was very nice and noone but me out there reading my book while hubby went to his conference 4) unit was very clean - thank you Ok - here is where the strange stuff begins - not sure how else to describe: 1) you walk in the front door of our unit (We were in room #200 so not sure if all rooms are like this or not) and behind the door is a closet with a mirror door (had we opened the door a little wider we would have broken the mirror 2) In bedroom number 2 - there was a HUGE bathroon - very nice - but when you sit on the toilet you are facing yourself in yet another mirrored closet door - now if you are a slightly odd person and like to watch yourself on the toilet - I know several great mental health professionals (LOL) 3) The kitchenette - VERY small and instead of a cupboard under the sink - it was open and you could see all the pipes -pretty unattractive - could have at least hung a little curtain or something. 3) staying in the kitchen - top cupboard door could not be opened all the way because it hit the ceiling light - didnt really bother me as we did not store anything there and ate a nice bfast in the hotel every morning 4) no wal-mart or similar very close - so without a rental car you would not be going anywhere or getting any groceries 5) only 3 restaurants within walking distance: Fajitas - nice enough, Tomatoes - didnt go there and Outback Steak house - again nice enough Would I stay here again - probably not as I did not drive (hubby had rental car) and there was nothing close enough that I could walk to for window shopping etc.. But, again staff is very nice, the free meals were a benefit and they did a nice job. Hotel and room was clean albeit odd.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Ontario", "Title": "“Great value in a budget, family hotel”", "Author": "WineLoverOttawa", "ReviewID": "UR119669933", "Content": "You get what you pay for, and this Hilton property lived up to what I expect from a budget hotel -- a clean, comfortable room in a well-kept property, at a very good price. We stayed for two nights, in a 2-bedroom, 2-bathroom suite (a couple, and one elderly parent). While the furnishings are fairly basic, we had everything we needed in the suite -- very comfortable King beds and flat-screen TVs in both bedrooms, another TV in the shared living room (which has a sofa bed), and a well-supplied kitchen with complimentary popcorn! In addition to the standard buffet breakfast (which has lots of variety and is good, if not great) this property served a complimentary light supper from Mondays to Thursdays! Friendly staff were quick to provide directions and do anything else required to make our stay more pleasant. Not a place for a romantic or luxurious vacation, but a great hotel for business or family travel. Be aware that the TripAdvisor map and even GoogleMaps do not make it clear that this hotel is beside the freeway -- choose a room facing the parking lot or pool if you are a light sleeper. Tip: make a reservation, but recheck rates the week before you travel -- our rate went down substantially, so we just modified our online reservation and saved $70/night.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "DC", "Title": "“not too impressed with the breakfast”", "Author": "mad155", "ReviewID": "UR119403608", "Content": "Average is all i can say for this property. Staff was great though and room was always clean when i got back to it. i went down for breakfast once and it was not very good, so i never went back down. if you have stayed in a homewood suites before then you know what you get and it is the same here. as some mentioned it is difficult to get to but it is doable. i would also avoid the outback that is nearby. seperate review to follow. there is a much better Texas Roadhouse across the highway. again, seperate review to follow. i will stay here again because i am a hilton fan and it is close to where i work when i travel to Phoenix.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southern States", "Title": "“Best Stay in a Long Time”", "Author": "franklinmilford", "ReviewID": "UR119183926", "Content": "I had been placed in a poor property before moving to this locale, adn was hesitant. The property is is a very \"office area\" locale, difficult to navigate or understand at night. This is the onl negative about this property. It is actually very close to Fajitas andOutback, less thn a mile from ajor shopping, etc I had a 3 room suite, a nice small apartment with a full size kitchen and living room area. The bed was \"newish\" and had a selection of pillows. The \"water closet\" room of bathroom could not be occupied without a loud fan, but somethings you d not need light for!. The front desk staff was eaer to help, and filiar with area allowing for great suggestions. The breakfast areawas above standard,with fare such as omelets, sausage and bacon, the usual cold offerings.In the evenings, the reception from 5-7 was a complete meal, not happy hour snacks. There is a small conveniene store in lobbby area. Daily housekeeping is provideded, something usually not offered in the \"apartmen/long term\" stay hotels. A great stay and will be back. Was pleasantly suprised when I was given bill, as this place could charge more and get away with it. Another great Hilton property!!!", "Date": "October 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "2"}, "AuthorLocation": "New York City, New York", "Title": "“Blah... Basic Budget Hotel”", "Author": "Roddy_Rod", "ReviewID": "UR118707318", "Content": "I don't know the official star rating of this hotel but it is a solid 2 and nothing more or less. The staff is super friendly, but the rooms are drab and really put the Hilton name at stake. Homewood suites is definitely the lower end line of Hilton but this proves that and that's not really a good thing.", "Date": "September 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great Spot Off Interstate 17”", "Author": "Rabalicious", "ReviewID": "UR117202760", "Content": "This place was centrally located in the Phoenix metro area, so it made it easy to travel to all of our destinations that day. The mall was right down the street and the Interstate was right around the corner. The room was clean, the breakfast was \"decent\" (they burned the fake eggs), the pool looked well maintained, and the staff was really nice and helpful. I'd stay here again and again on future visits to the Phoenix area.", "Date": "August 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Good”", "Author": "Trsilvestre", "ReviewID": "UR116252704", "Content": "Everything was fine and good service overall, but it cOuld have littleore options for breakfast.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tucson, AZ", "Title": "“Great overall”", "Author": "Suehm", "ReviewID": "UR115984406", "Content": "We stayed for two nights. Had 3 teenagers with us and it was a mixed family get away as well as a work meeting in town. The room was a nice size, but with 5 of us, it did feel a little small (even tho it was two rooms) The separate bedroom had two double beds, not queen sized, and believe me, when you are sharing, you can tell the difference! The pull out couch in living room was typically a bit uncomfortable but still was glad to have it. The beds in the bedroom had nice linens but the beds themselves were a little saggy. (or is that me??~!) The kitchen has a full size refrig with ice maker. A nice microwave and plenty of storage space. They provide paper towels, dishes, utensils, coffee, dishwasher soap! The bathroom had the sink outside of the toilet/shower area which is good for many getting ready at the same time. Nice toiletries were provided. One of the nicest amenities of the place is the \"light supper\" provided each evening from 5-7. This is a huge money saver esp when you are travelling with kids. AND the nice thing is they have fairly nutritious items provided, not just pizza bites and nachos! Night one we had meatloaf, veggies, mashed pots, rolls and salad. Night two we had make your own salad with chicken and beef strips, veg soup and bread sticks. ALso they provide some wine and beer, lemonade. They also have a changing hot menu for brkfast which again is fairly nutritious. I think this was the biggest reason why people with kids or many folks in their party should consider staying here....AND the people working here were wonderful!! Front desk, brkfast and supper workers, maids, maintenance guys...ALL were friendly, responsive and respectful. We called down a few times to get more towels, blankets etc and they were always RIGHT ON IT....we never waited for more than 3 minutes for anything we asked. the pool was green. Not sure why. It made it less appealing but the kids still had a good time in it. No jacuzzi tho which was sort of disappointing. BUT overall it's a fine hotel with great service, It is right off the interstate so easy to get to. Sort of \"hidden\" in with large offices etc so little or no noise. VERY close to Metrocenter mall and some restaurants near the mall....(remember I was with teenagers so even tho they ate the supper provided, they still needed add'l food by 9 pm!) And oh yes, free high speed internet in the rooms. AND a very nice business center for guests to use too. Lobby is nice to hang out it as well. Overall a really great experience and I would def. recommend to anyone.", "Date": "July 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Paso Robles, California", "Title": "“Convenient, Comfortable, Suites with nice kitchen”", "Author": "pasowine", "ReviewID": "UR108557134", "Content": "This suites hotel seemed just fine. Front desk staff very pleasant and courteous. Kitchen was great and I liked the countertop bar stool orientation. TV's were new and worked well - with nice couch to lounge on in the living room. Bedroom was quiet and bed quite comfortable. Clean room. Didn't visit the pool, but it was filled with kids. About only negative was if you had a room overlooking the pool, it was a bit noisy late at night. The morning breakfast had numerous and extensive choices - enough for everyone. The evening \"snack\" was also great. Nice service, easy access in and out. All in all, a good value. One note - be aware the top (5th) floor is mixed smoking and non-smoking, which basically makes it smoking. The front desk was nice enough to change me to 4th floor.", "Date": "May 16, 2011"}, {"Ratings": {"Service": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Acceptable standard”", "Author": "Treborwf", "ReviewID": "UR97356042", "Content": "Always stay here when visiting due to location and it being a suite. Upon check in asked the receptionist for a certain type of room configuration (OCD with hotel rooms I guess), surprised to find out that receptionist thought all rooms were identical - which they are not. Informed by the breakfast guru (wife) that the breakfast is as bad as it usually is. Shame that the Lonestar restaurant nearby has closed down.", "Date": "February 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ontario", "Title": "“No problems once again”", "Author": "hasbeanshockey", "ReviewID": "UR65507486", "Content": "For the second straight year my wife and I stayed at this hotel for our March golf break. While it is not the Ritz, it's suites are clean and the employees are courteous and helpful. The breakfast is not superb, but what can you ask for when paying $110 dollars for a one bedroom suite located in a central area of Phoenix. We will definitely be back.", "Date": "May 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "San Francisco, California", "Title": "“Ok hotel, not the best location”", "Author": "rkaradi", "ReviewID": "UR55291389", "Content": "Just stayed here and the hotel was pretty good. I’m starting to like the Homewood suites for the space and in most cases the newness of them. This one seemed like it was new but not super new. The room I had was large and comfortable, with decent bedding and pillows. I only had breakfast one day and it was sort of sparse waffles, fruit, yoghurt and bread. I’m use to a little better spread. I didn’t use the pool, or really check out the property but what I saw was decent. My only gripe, very little signage to get from the lobby to the rooms. There are at least 3 sets of elevators and it was not clear which way to go from the elevators to the rooms. Other gripe the location of the hotel not a fan of Metro Centre after staying here, was a little ghetto (Ghetto Center) apparently is another name for the area. Granted almost every food chain was close by.", "Date": "February 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "1"}, "AuthorLocation": "anc", "Title": "“Nice hotel going down...hill”", "Author": "steve&martha", "ReviewID": "UR51022403", "Content": "I stay here often on business since my company training center is located near the hotel. The food at dinner and breakfast has been cut back and the quality has suffered. The pool was dirty and not cleaned the entire week I was there, unfortunately there is not a hottub. The beds seemed to been replaced and are not queen size. They have allowed a big sign in front of the hotel and the freeway noise is present, but this does not bother me. I like to jog on the trail in the park across the street so this is a great hotel for that, but don't try the exercise equipment since it is all broken down. The staff is friendly and helpful.", "Date": "December 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Louisville, KY", "Title": "“Just passing through Phoenix”", "Author": "thewonderdad_9", "ReviewID": "UR29344733", "Content": "Hotel was clean. Apparently renovations are completed - at least I didn't notice any. Lots of restaurants in walking distance. The room was very clean and comfortable. I love the ceiling fans in the bedrooms. I was able to get a very good $99 rate. I did notice that some rooms were very expensive. Very easy access of the I-17. If you are a geek, there is a Fry's 2 miles to the north. I give it a 4 star simply because I don't give 5 stars (I'm waiting for that one hotel to earn 5 stars from me...) Breakfast was fine, but I don't expect much - just a little something. It was a perfect hotel for passing through. I could easily see myself being comfortable here for a 2 or more night stay...", "Date": "May 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Solid Moderate Price Suites”", "Author": "FPodesta", "ReviewID": "UR27260904", "Content": "You will not be blown away by this hotel to any extent. The pool is mediocre. The breakfast is sub-par. The location is convenient to the highway, but nothing else. Still, a one or two bedroom suite is cheap. The prices are good. The staff is very helpful. If you are on business, or out vacationing with a family, or simply don't plan on being in the room much, the value is good.", "Date": "April 1, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "AZ", "Title": "“rough around the edges”", "Author": "chrysemis", "ReviewID": "UR23056027", "Content": "This hotel has the potential to be a nice extended stay hotel, but it currently has things to be desired. As also previously stated, the hotel was completing renovations during my stay (I was told that the first floor was the last to be worked on). As such, the rooms were nice (granite counters, full size fridge, comfortable bed, 2 flat screen TVs), but paint/glue fumes were noticeable in the hallways and rooms. Also, other coworkers and I noticed things that still needed attention in our hotel rooms -- bathroom vent cover missing, noisy ceiling fan, water leak from the ceiling, light fixture not working. Two out of the 5 large exercise equipments in the fitness room also were out of order. The evening reception was nice. Wine and beverages, salad, and hot snacks are available in a serve yourself set-up. The manager even occasionally went around to greet guests and offer to take away used plates and glasses. The breakfast selections, however, while hot, were generally of defrost-heat-n-serve quality. The waffle maker was a hit, but disappointing items included the completely albino hashbrowns and doughy breakfast burritos. Overall, this hotel could be better than it's currently being managed.", "Date": "December 28, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "2.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Littleton, Colorado", "Title": "“Okay Stay, but beware”", "Author": "DenverWriter", "ReviewID": "UR22150250", "Content": "We stayed for six nights. It's a good property with convenient access to all points in the Valley. Many restaurants nearby, including a Sweet Tomatoes, Lone Star Steakhouse, Fajitas and Outback all within walking distance. Nice park across the street to run. The rate we had was great ($109/night). Now for the not so good. They are doing extensive remodelling so there is a good deal of noise (drilling, hammering, etc.) during the day. Because of this activity, we had continuing visits from water bugs coming through the drains, one in particular was at least four inches long. After killing the invader, I took it to the front desk and the night manager did not offer anything other than \"It's Arizona...We've got bugs.\" Needless to say, I made sure that when we went to bed, we stuffed the drains with small hand towels so that we could sleep in peace. Other problems: The outer door card readers hardly ever worked, so you'd end up walking all the way around to the lobby entrance just to get in. The sprinklers burst one night, flooding the patio area and the breakfast left much to be desired. However, once the remodelling is finished, it'd be a great place for the price.", "Date": "November 24, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Windermere, Florida", "Title": "“Disappointed!”", "Author": "watermflower", "ReviewID": "UR20500691", "Content": "I have stayed in two other cities: in a Homewood Suite hotel, and I loved those! We arrived at 9pm, at this Phoenix Homewood Suite, due to flight delays. There was one bed left. It was a room close to highway traffic. We walked into the room. It was supposed to be a \"suite\", it was a 15x15 box, with a wall down the middle to make it a \"suite\". The fire alarm was torn off the wall. The artificial plants had at least 4 years of dust on them. The ethernet would not work. The phone cord fell out of the wall, when we tried to put the phone near where we were sitting. The \"computer tech\" called once, we got disconnected...and although we called the front desk at least 3 more times about this connection problem: the computer tech never returned our calls. The bedding and kitchen were clean (except for the plants), but every door in the suite: hit a dresser or a table. The decor was very outdated and dark. (not like the pictures on the website). The halls were dark and somewhat spookey. We stayed 1 night (we were booked for 3), and we left for a better Hilton hotel in another part of the city. We were very disappointed! I will be much more reluctant to book Homewood Suites from now on. Don't assume that the pictures on the internet are what you will get!", "Date": "September 30, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Los Angeles", "Title": "“Clean & Spacious”", "Author": "angieh_27", "ReviewID": "UR18220940", "Content": "This hotel is nice and clean. The staff was nice. I was able to print my airline boarding pass at the front desk. They serve a pretty decent breakfast. Waffles, fruit, \"eggs\" (not sure how fresh), yogurt, sausage, oj (not fresh), coffee, etc. The rooms are large, with a living room, kitchenette, even a dishwasher. The beds were comfy and there were a ton of different pillows, 5 on each bed and even more in the closet!! Also, it is within walking distance (less than a 5 min walk) to a couple of chain restaurants. Not flashy or anything but would definitely stay there again.", "Date": "July 24, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Charlottesville, Virginia", "Title": "“Good Stay for this NIce Hotel”", "Author": "caneshockey31", "ReviewID": "UR17200639", "Content": "This hotel is located right off Interstate 17. Not hard to find off the highway. We were originally booked in a 1 bedroom 2 double beds suite but, we got upgraded because there was a 2 bedroom with a king available. The pool and sport court area (basketball available) are open from 8am-10pm each night. Water was very warm and comfortable. The tempature outside was 109 and the water was about 95 but was very comfortable. The suite shop was very nice and had the items that i liked. The front desk staff was very helpful and friendly. They have a nice lobby area to watch tv and have the breakfast and managers reception. The hotel is about 20 mins from Phoenix airport and 10 mins from Deer Valley Airport. There are a number of hotels within 5 minutes of the hotel and there is ample parking for your car (free of charge) Good hotel and nice room.", "Date": "June 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "philadelphia", "Title": "“mixed”", "Author": "annetw", "ReviewID": "UR13099720", "Content": "Stayed for 10 nights with my 17 month old son and husband. The staff was friendly and welcoming and the rooms were okay - decently comfortable and clean. However, there was inadequate work space (surprising for a hotel designed for business travelers) and not enough drawer space. But, the breakfast was atrocious. Same thing, day after day, and what was served truly terrible tasting.", "Date": "January 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "san diego, CA", "Title": "“A very pleasant place to stay”", "Author": "ellieca", "ReviewID": "UR7288343", "Content": "Weare in the second day of a two day stay, and we think this is a lovely property. The suites are large, clean, and nicely furnished. The free evening meal last night consisted of two good soups and fresh salad fixings. Breakfast today included bacon and sausage, eggs, bagels and other rolls, canned peaches, yogurt, cereals, etc, and we thought it was very good. The only negative is the very loud A/C. We shut it off finally late last night and opened windows. For that reason, I probably would not stay here in summer. However, any other season, I would look forward to returning.", "Date": "April 6, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tacoma, WA", "Title": "“Good value for the money BUT......”", "Author": "AbCam", "ReviewID": "UR7215657", "Content": "This was our second time staying at this hotel, a week each time. The staff at this hotel is consistently great. Very friendly, polite, and anxious to please. The rooms could do with some updating. Our couch was very dirty and had stains. More light in the vanity area would be good. The bed is great. Our air conditioning quit working our 3rd day and it took until 7 pm to get someone up to fix it. They said we had \"froze\" it because we set the temp at 70 degrees - it was 99 outside and our room got the full blast of the sun. The free breakfast and \"manager's reception\" have gone downhill since last year. Every morning was the round re-heated eggs and sausage, one time cold french toast was in a basket on the side of the toaster ( but the toaster was broken on one side), bread and bagels, cereal, plus canned fruit cocktail. No yogurt this time, no variety. They ran out of styro cups and napkins. Last year the breakfast varied with bacon, pancakes, french toast in the steamer some days. The evening reception was hot dogs and canned baked beans once, canned ravioli once, mac and cheese next time. Last year was chicken wings, taco salad, etc. They did have lettuce, peppers, and broccoli out for salad bar each night. The beer dispenser was broken every day while we were there but wine was available, as were bottled sodas. The biggest complaint we have - and why we will not go back - is because of the noise of the air conditioner. It's a wall unit from floor to ceiling in the bedroom and is so loud it makes it difficult to sleep. We really like the hotel for the value and convenience but just can't over-come this noise at night. However, we would still recommend this hotel for families and anyone who is going to be in the area for an extended time that doesn't have a problem with the air conditioning noise. The kitchen is a big plus and there is a Fry's Market very close. The location is great for baseball spring training parks.", "Date": "March 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wilmington, DE", "Title": "“Great place to stay!!!”", "Author": "HonestLadyTraveler", "ReviewID": "UR6799317", "Content": "This was a great hotel to stay at!! Our room faced the pool, which was wonderful. The rooms were really clean and the staff was helpful and knowledgeable. They had a breakfast everyday and a managers reception on the week days. The only suggestion I would have would be to get there early, because the food goes fast. The drinks during the managers recpetion were plentiful! The hotel was right off of I-17 so getting anywhere was a breeze. I would def. stay here again, it was a wonderful experience. The room was very big and the kitchen was AMAZING. Great room, and a great value. I would highly recommend it.", "Date": "February 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Walnut Creek, CA", "Title": "“OK place, not as nice as other Homewood Suites”", "Author": "Scubamate", "ReviewID": "UR6732361", "Content": "This is the fourth different Homewood Suites I have stayed at, but unfortunately, is the first one to be somewhat disappointing. While it is still a good hotel with the amenities to make a business trip go smoothly, it lacks the attention to details in other Homewood suites I have accustomed to. Breakfast was weak with little variation. My room was showing its age, with stains in the tub and tired furniture. It was also facing I-17, so noise was a factor. I can also see that some of the rooms are very close (within several feet) of a giant billboard that is lit up at night. On the good side, the staff is friendly and helpful. There are several machines in the fitness room that actually work. Overall, it is OK for the value. If possible, ask for rooms that face the inside (not the freeway or Peoria Ave side).", "Date": "February 2, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Westfield, IN", "Title": "“ok, but not overly impressed”", "Author": "LAnderson4", "ReviewID": "UR4966019", "Content": "We stayed one night in this hotel. We asked for early check-in in advance, but when we arrived, it was not available - we wasted a couple of hours in the nearby mall, waiting for a room to be ready,although hotel was not full. Pool was small, but adequate. Rooms were large, clean and comfortable. Refrigerator made a bit of a racket. I was unable to find an icemaker anywhere on site - not enough time for freezer in room to make ice. A track team happened to be occupying the hotel at the same time - while chaperones were with the 10-15 yr olds (approx age) the younger siblings were allowed to run up and down the hallways yelling a screaming until well into the night. Management did nothing to quiet the noise. The business center was unattainable as well, as the chaperones gave the room key cards required to the kids who took turns pretty steadily. Breakfast was average - frozen waffles, eggs, sausage, juice, toast. Seating was more than ample. Area was clean and inviting.", "Date": "April 11, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Knoxville, Tennessee", "Title": "“Short Stay, Family of 5”", "Author": "mtnrealtor", "ReviewID": "UR4517912", "Content": "We stayed Feb. 17 - Feb. 20, our family of 5 (kids 1, 5, & 7) and my sister's family of 3 (one 5-yr. old). The rooms were great for us. Loved having full kitchen and sofa bed. Her room was on the highway side and was much bigger; ours was on the pool/sport court side. There was some noise from outside, but never too late and was always drowned out by the a/c. I was really impressed by the noise abatement between rooms. We were next door to a group of 4 teenage boys (there for a soccer tourney) and we never heard them except in the hallway. Breakfast was served every day and was mediocre at best, but good enough for us: cereal, bagels or danish, egg \"frisbees\" (warmed from frozen, I guess!), yogurt, toast (even had little pots of p'nut butter). We didn't stay for the dinners, but the one my sister had was disappointing - hot dogs and hamburgers on barbeque night. Oh, well - we didn't stay for the food. The staff was very pleasant and totally accomodating. We had requested a crib that was not in our room when we checked in - I called and it arrived right away. HOusekeeping came each day unless your privacy card was on the door. After 2 days w/the card out, they stuck a note under the door just to check in on us! The pool was adequate in size, but very poorly maintained. On our second day, they closed it to \"shock\" it, but the next day the water was so cloudy you couldn't see the second step. Don't know what was happening - again, we didn't stay for the pool, so didn't really affect us. The location was very close to lots of good restaurants, shopping and Castles 'n Coasters (small amusement park). Also across from a very large outdoor sports complex which had a HUGE open dog park, play structure, soccer/ball fields. In all, our stay was better than expected. I think I have learned not to expect much, though, so might be a little disappointing to the well-traveled!", "Date": "February 24, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "California", "Title": "“I thought it was another Embassy Suites, but...”", "Author": "plainjohn", "ReviewID": "UR1422579", "Content": "Looking for prices and a free breakfast, I saw the Homewood Suites and read in other review sites that there was a free breakfast here. I got a Internet special price and called because I was in late (11pm). Checkin was fine and the staff attentive at that time. The premises was clean and a newer facility. The suite was fine with a kitchen, fridge pots and plates and two seat nook area. The room was large with a very quiet ceiling fan. The AC was loud. The breakfast was a fraud. I called and specifically asked if they had bacon, eggs and potatoes. The person said they have eggs and sausage, but no potatoes. Well, it was a continential breakfast with some steam tray of precooked scrambled egg patties and sausage. There was the other juices, bagels and breads, but the hot foods was out of a steam tray. I had breakfast the next day at a breakfast spot the next morning. Overall, nice spot except for the fraud breakfast.", "Date": "October 26, 2003"}], "HotelInfo": {"Name": "Homewood Suites by Hilton Phoenix-Metro Center", "HotelURL": "/ShowUserReviews-g31310-d119353-Reviews-Homewood_Suites_by_Hilton_Phoenix_Metro_Center-Phoenix_Arizona.html", "Price": "$82 - $135*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2536 West Beryl Ave</span>, <span class=\"locality\"><span property=\"v:locality\">Phoenix</span>, <span property=\"v:region\">AZ</span> <span property=\"v:postal-code\">85021</span></span> </span></span></address>", "HotelID": "119353", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/fa/a8/faa8b9c895fcb24084241aad735a3ef75large.jpg"}}