{"Reviews": [{"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Brussels, Belgium", "Title": "“BEWARE OF SPECIAL CANCELLATION CONDITIONS DURING THE OLYMPICS!”", "Author": "marta i", "ReviewID": "UR125671623", "Content": "Read the small and very hidden print! NO cancellation at all possible during the Olympics in venere.com for this hotel IN SPITE OF BIG ANNOUNCEMENTS TO THE CONTRARY! Complaint already filed because of misleading and deceptive advertising. Venere's response to this day most unsatisfactory:-(((", "Date": "March 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Portsmouth, United Kingdom", "Title": "“Pleasant stay; good value for money.”", "Author": "liliputians", "ReviewID": "UR125302136", "Content": "Because of the word \"economy\" in the name I was not expecting too much but was pleasantly surprised. The room was quite clean and well equipped, although certainly not \"luxury.\" The decor is very modern and, while the paint could use a bit of touching up here and there, made overall a good impression. We had a duplex room, which I guess means a sleeping loft upstairs, which anyway is what we had. Our children slept on a fold out couch and rollaway cot downstairs. The reception is about half a block away from the actual apartments but if you know this in advance it isn't terribly inconvenient; I've walked farther in big hotels and resorts.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Utah", "Title": "“Very convenient location; minimalist accommodation”", "Author": "mule54", "ReviewID": "UR121928985", "Content": "The stand-out feature for #13 Inverness Terrace is its close proximity to two Tube lines at Bayswater and Queensway. The staircases seems to have been recently recarpeted, and the hallway/staircase looks fairly nice although there was some construction equipment (e.g., ladder) in the hallways. It was rather off-putting to find signs like this in the hallway: \"Do not put clothes in the toilet....\" And \"Don't leave rubbish in the hallways.\" There was no real sense of hospitality, which shows in the signage. The laundry room (washer/dryer) was also poorly signed; it noted 2 pounds for 30 minutes of wash, but then didn't explain that the washer requires much more time than that. The bed was firm, and there was adequate closet and storage space. Wireless internet was very reliable. In the studio, there is a small dining table and two plastic chairs. There is no artwork whatsoever or any decorate pillows to give the room a brightening effect. The kitchen was adequate although the lack of markers on the range/oven (hob) made cooking rather mysterious and trial & error. The dishware and cutlery were sufficient although barely. No Tee towels, so we bought one as well as paper towels. We also had to purchase toilet paper as it was not readily supplied. The TV was adequate although it is hung fairly low on the wall, and it's easy to run into as a result. The bathroom is small. There is no elevator, and our room was on top floor, so it was a hike with or without suitcases. Our main complaint, though, was that we had booked through London Choice, which did not send the credit through, and as a result, we paid twice for the studio, even though London Choice's agent when called, promised an immediate refund. In spite of daily communication, no refund was forthcoming. Queensway a block over has a lot of grocery stores (recommend an inexpensive flower bouquet to brighten the room!) and ethnic restaurants (again adequate but not extraordinary). Several of the businesses note that \"professional bag thieves operate in this area,\" so do be warned about the neighborhood, which is mixed--can be very nice and also touristy (which attracts thieves). In sum, if minimalist accommodations are okay, then this studio could be adequate.", "Date": "December 20, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Waterford, Ireland", "Title": "“Disgusting”", "Author": "321s_g", "ReviewID": "UR120855354", "Content": "I won't waste time writing all the awful things about this place, just don't stay here. Briefly; everything was horrible. The reception guy, the entrance to the apartment building, the room itself, the corridors, the area, the noise, the smell....don't waste your money or your time. We had booked 2 nights and checked out after the first night when we'd found a decent place to stay. Very, VERY disappointing.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“AVOID. The word \"Economy\" shouldn't excuse this place.”", "Author": "building_grey", "ReviewID": "UR118720436", "Content": "My boyfriend and I stayed here last night in a studio for two to share. We needed to be in the centre and unfortunately went for Hyde Park Economy Apartments in a rush without really looking at the reviews. As soon as it was confirmed I immediately regretted it but then I tried to reassure myself by thinking \"surely it can't be that bad, can it?\". I wouldn't consider myself a snob, anyway. I've no shame opting for cheap and basic accommodation because I believe that budget shouldn't necessarily mean bad. This however, was TERRIBLE. Convent location but so not worth the money. We were put in one of the basement rooms and it was a veritable sauna despite being below ground level, the heating switched off and being in London at the end of September. When we tried to open the window, we found was a broken sash that wouldn't stay open. The blinds were also hanging a good 10 inches from the bottom of the window with slats either broken or missing, and seeing as there were no curtains either, it meant we had little to no privacy. So... Good start. Stifling air, no privacy... What next? The studio was in a pretty poor state. Most of the furniture was either broken or damaged, even handles came off the cupboards. Nothing was properly cleaned either, dust was everywhere and the toilet was pretty disgusting too. The shower wouldn't stay one temperature for more than 10 seconds either, switching from boiling hot to ice cold or lukewarm and back again. The television's speakers cracked every minute or so and you don't get anything complimentary there. We had two very flat pillows on the bed and a duvet. No flat sheet, no extras, you get what you're given. It was so sticky and uncomfortable in the room that we had to take the duvet out, use the cover as a sheet, fold up the duvet and use it as a pillow. Oh, best of all - bedbugs. Glorious bedbugs. That says it all, really. I'd reiterate what others have said about reception, the inconvenience, there is no excuse. I've seen this advertised as a 3-4* hotel which couldn't be farther from the truth. I've stayed in much better no star hostels. They're obviously doing some renovations but they're purely superficial so when you peek through the entrance or go to the reception down the road you think \"oh, this is nice!\" but when you accept your keys and turn the corner you'll find rotten carpets, doors that slam and paper thin walls and ceiling. I wouldn't recommend this to anyone. Not even for a night. Noisy. Dirty. Falling apart. It ruined an otherwise lovely time in London.", "Date": "September 29, 2011"}, {"Ratings": {"Location": "4", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Good location.. but many reasons NOT to stay here..”", "Author": "Jamesngu", "ReviewID": "UR118292274", "Content": "Location is good. Within walking distance (3min) of underground station Bayswater. In fact, that's the ONLY truly good thing about the place. Adequate cooking facilities within the apartment. Working heater and hot water. Price is only reasonable if you have 3-4 people sharing the duplex suite, otherwise its totally NOT worth the price (even taking into account the good location). Check-in reception counter is far from the actual accommodation. Security of the apartment front door was a combi lock which hasn't been changed for eons.. It's obvious that only those few numbers have been pressed repeatedly. Room decor was spartan to say the least. No aircon. Room stank of paint. Beds were essentially 4 singles pushed together. Lousy mattress and flat pillows. I have stayed in motels with better furnishing. In summary, I would NOT return to stay and I would NOT recommend this place.", "Date": "September 18, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Voorburg, The Netherlands", "Title": "“Warning. Do not go to this appartment. It is terrible”", "Author": "staples1958", "ReviewID": "UR116009210", "Content": "Very noisy room (nr. 5 at nr 13). Hard slamming outdoor so we could not sleep at all. Room needs to be renovated very quickly. Dirty, small bathroom loose tiles. Very hard beds. Poor kitchenette. Dirty windows. You can hear the neighbours talk.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "3", "Service": "3"}, "AuthorLocation": "", "Title": "“Budget accommodation and pretty basic”", "Author": "Ragrunberg", "ReviewID": "UR114679631", "Content": "We couldn't find a review for Hyde Park Suites 9 Talbot square when we booked. This is one of many properties which come under the name Hyde park suites. We stayed in a studio with my husband and I in the bed and my 17yr old daughter on the couch. The room is small and reasonably functional. The kitchen had basic cooking facilities but we didn't try cooking in there. The apartment was on the first floor and the lift wasn't working so a couple of trips were needed to get our luggage upstairs. They refer ti the apartment as serviced but it wasn't although an extra set of towels was provided mid week. They didn't supply much at all, we had to buy our own loo paper and the shower was tiny, and I didn't know you could make a bathroom so small. Wifi for free was a bonus but it didn't work for the first two days and took many phone calls to sort out. The check in happens at a different site but they provided a car to get us and our luggage to the apartment for free, for which I thank them. The room was not secure, no locks on the windows. The blinds were broken letting in lots of light and the Telly only had 5 English stations but we werent there to watch tv. Excellent location. No early check in which was a pain after 26 hour flight from Melbourne.", "Date": "June 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“awful place”", "Author": "Victiria", "ReviewID": "UR107666787", "Content": "Please do not confuse Hyde Park Suites with Hyde Park Hotel. In Suites you will not get fresh towels, room make up or even piece of soup... They have a coin operated washer and dryer down stairs, but when you stay in London just a few days - do you have time for laundry? If you booked it, make sue to get room with the street view, not a back yard. There is a huge garbage storage in a back yard. No free Wi-Fi. The shower did not work properly, they did nothing to fix it, obviously. I regret that I did not take a few photos, but I don't want to remember this bad experience looking at them any way. Bad place! Not worth any money!", "Date": "May 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bangkok", "Title": "“Cramped and Cold”", "Author": "siamtraveler85", "ReviewID": "UR104599520", "Content": "Although the guy who checked us in and the housekeeper were extremely helpful and kind, the room itself was quite small and despite it being Mid April we were a bit chilly in the room as the heater wasn't working properly which also meant that our showers were quick and cold. the room was for 5 people but the fold out \"sofa bed\" was so tiny, one person could barely fit on it. Excellent location though, right next to all the good restaurants, convenience stores and bayswater tube station.", "Date": "April 19, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“So many names but most suited...Faulty towers.”", "Author": "Doiley", "ReviewID": "UR102362672", "Content": "These suites were titled on several sites under different names. After asking staff about this was given list of no.s they owned on rd.BS) Had to phone agent and ask in hotels next to findreception. A4 page on door was the sign.Rudeness of staff on check in. We paid again after checking in. 47 minutes later. Broken steps on entrance to block.broken fire alarm.booked a premier suite, it was room with sofa bed. Ensuite was dirty, toilet not even flushed! Cutlery looked as though it had been licked clean. No apology just more rude staff on check out. None of which were English so after we spoke they mumbled in another Lang. Beyond rude.", "Date": "March 31, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Trondheim, Norway", "Title": "“Terrible service, stay somewhere else!”", "Author": "TT71", "ReviewID": "UR99422237", "Content": "Says it is a hotel, but no change of sheets or towels, had to buy toiletpaper at the supermarket nearby, mould in the shower, rats inside, fire alarm constantly going off (false alarms), members of staff (?) suddenly coming into your room to for instance check the televison (which by the way only shows arab channels). Next time I will stay somewhere else.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "York", "Title": "“SHAMBOLIC SERVICE, UNSAFE, DON'T STAY HERE!!!”", "Author": "CelineYork", "ReviewID": "UR97224932", "Content": "I unfortunately stayed there with my parents for 2 nights: -When we arrived and throughout our stay the apartment STANK because of the shower. -On our first night we could not sleep because of a POLICE CHASE on the roof -On the following night WE WERE BURGLED ourselves. The police identified that the locking mechanism was clearly at fault and the door could be opened slimpy by sliding a card in the opening. We discussed endlessly with the USELESS STAFF before our departure and were assured that the two nights' stay would be refunded as well as the stolen goods. I also had to make numerous calls and battle just to speak to someone... 3 months later NOTHING has happened!!! What's more the disonhesty - their reply to my last e-mail to them states nothing will be re-imbursed!!!", "Date": "February 19, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Pwllheli, United Kingdom", "Title": "“DONT STAY HERE!”", "Author": "agrosmum", "ReviewID": "UR93778762", "Content": "The hotel is not self contained and certainly not three star - the service is appaling and not anywhere near expectations. If we had not paid for the entire stay we would have sought alternative accommodation elsewhere. Nothing works and there is no aplogogy for lack of services, in fact the staff will try to blame you for problems. Easy to Book do not help once they have booked you with the accommodation and there is no follow up there either.", "Date": "January 19, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Odense, Denmark", "Title": "“Average - but some flaws!”", "Author": "hjalhan", "ReviewID": "UR90422857", "Content": "Went here for a short weekend stay with my parents. When we first got to the hotel it was all fine - with good opportunities for cooking diner yourself, friendly staff etc. But, as the days passed some flaws appeared. We lived in a 2 floor flat - and on the 1st floor there was water coming down from the sealing, every time the people in the flat over us used the bathroom. The windows was very unsealed - so the flat was almost all time freezing cold. The tv was only able to take a few British tv channels in a horrible quality, otherwise there were 230 Arabic channels to watch! But apart from that, a nice hotel to a good price.", "Date": "December 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "London", "Title": "“There was a rat in my room”", "Author": "janebloggsy", "ReviewID": "UR87488959", "Content": "I was given a standard double when on the website it said I would be getting a silver double bed room. It was in the basement with a view of another room. I couldn't get a connection to the internet because of my location in the building. The bed was squeeky which meant my partner and I couldn't sleep very well. And to add to that, we saw a rat scratching away behind the fridge, and running around our room. As reception is closed between 10pm and 9am, there was no way of finding another room. As expected, we found it's faeces by the fridge the next day. This was the worst experience at a hotel/apartment that I've ever had in my life.", "Date": "November 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Wiesbaden, Germany", "Title": "“It will either suit you perfectly or you will hate it.”", "Author": "intheskies", "ReviewID": "UR86834004", "Content": "The Suites are serviced apartments which are suitable for some but not others. This is NOT the place for you if your idea of accomodation is where there is a hotel bar, room service, concierge or maid service. This IS your type of hotel if you are a frequent traveler that does not need hand holding in London and value your money. Location- you are within 2 minutes of tube stops on the Central and District/Circle lines. Hyde Park is 2 minutes away as well. Inverness Terrace is 1 street away from the bustle of Queensway, you are close but do not get the noise. There are grocery stores, restaurants and pubs quite close to the hotel. Rooms- we stayed in a basic double. They tried to check us in early ( check in is at 2 pm) but the specific room we had been alloted was not clean, so they held our bags. The reception is in a different building to the one which we stayed in, and is open ONLY 9-5. Not an issue for us at all. The room was in a basement, so view was nonexistent, but again as the room was used only for sleep it did not matter. It was a studio, with a built in kitchen with plates/glasses etc as well as a microwave. Great for saving $$ at breakfast. Also in room were an iron/board as well as a DVD player. NOT in room were bedside lamp/table ( overhead light was sufficent) or alarm clock or phone. Room is not serviced for our short stay but we had ample toilet paper and towels. While small for a studio, you actually get more space to spread out that MANY higher priced hotels in London. This is not a fancy room but certainly clean. The only downside was the noisy girls having a party upstairs but that can happen anywhere. I would certainly stay here again, this was my first time using a serviced apartment versus a hotel room and for a city I am familiar with , would consider this , or others similar again.", "Date": "November 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Norway", "Title": "“Poor quality and safety”", "Author": "Martel_8", "ReviewID": "UR84657600", "Content": "I stayed at the hotel for 5 days. My expctattions and demands are not vey high and I am travelling a lot. But - I will definately not recommend this hotel. The location is goos, but the hotel and rooms were really marked by bad taste and lack of maintenance. The staff were not service minded. I paid a lot for wireless connection that was really poor. only functioning half the time. All the guests were waked up by the fire alarm in the night and ran out in the street. No staff and no fire brigade appeared. The safety is really poor! The staff could not even give me a receipt or even a confirmation that I had stayed at the hotel for documentation. i have to serach for that to the booking agent. If you want room service you have to pay extra. No way - never there again!", "Date": "October 24, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "cork", "Title": "“Do not book this hotel, one of the worst places I've stayed.”", "Author": "tracyoconor80", "ReviewID": "UR83894336", "Content": "On arrival at the hotel the two receptionists did not seem to know what they were doing, we had booked two different types of apartments and they did not know which one was which. The reception is also too small for the number of rooms they have at this hotel, there were only 3 people in front of us yet we still had to wait in the very narrow corridor. Entering the \"apartment\" which is a very loose term for what you are getting, the room was extremely small; there was hardly any room to walk around the bed. The bed was extremely uncomfortable and it was so low it felt like we were sleeping on the floor. The bathroom was the most disappointing, it was tiny not at all as advertised and also there was not enough hot water, when turning on the shower it would be hot for approx 30 seconds and then it was freezing clod the rest of the shower. I would not recommend anyone to stay at these apartments; they are completely misrepresented in size and quality. Also staying here a taxi is approx 30 pounds if you are too late for the trains.", "Date": "October 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "tahoe", "Title": "“Great apartments will come back!!”", "Author": "kilbourne", "ReviewID": "UR82633983", "Content": "My husband and I had a great apartment we got upgraded when we checked for free which was great. The front desk did however charge us 50Â£ fee when checking in due to it being after 10pm (delayed plane) but great location close to Hyde park, tube stations, market, food etc...worth every penny.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“If you see Hyde Park Apartments... RUN AWAY!!!”", "Author": "purplejune", "ReviewID": "UR82253006", "Content": "We arrived in London after a shocking 23hr flight from Sydney and just wanted to collapse in a bed. The cab dropped us off at 11 Inverness Terrace but found out reception was actually two blocks away and had to drag all our luggage down there. We were given a room in no. 11 which looked ok from the outside but was truly scary on the inside. There were lots of dodgy people loitering in the entrance hall and stairwells, an ear-splitting party going on in the basement and ground floor flats, and acres of stairwells which we had to carry our luggage up. Or rather, one of the pimps loitering in the hallway carried up the stairwell for us. At the top of the stairs it was pitch black, no lighting so had to feel our way through the rabbit warren to our room. More parties were going on upstairs, babies were crying in the rooms across the hall... then we opened our door. Our room was filthy - I was too scared to touch anything because there were suspicious looking stains on everything, the two single \"beds\" were more like a couple of ancient mattresses thrown into an alcove with a couple of yellowed bed sheets (and also with suspicious looking stains) and the room was boiling with no air con. The \"view\" was of the garbage area and the back of the flats opposite. To open the windows I had to stand on the kitchen bench and reach up (thankfully i'm tall), but some were broken and kept closing. The only thing that came through the open windows was the stink of 20 people smoking in the basement flat below and the stench of garbage. The bathroom was filthy and miniscule, and even though I was ready to collapse there was NO WAY I was going within a 10km radius of those beds. We lugged our bags back down the stairs past the drug dealers and hookers and back down the street to reception. We jumped up and down and demanded a refund or a room that was fit for human habitation. We told the receptionist about the drug dealers and hookers in the hallways and the parties going on, and he just shrugged his shoulders and said that \"well, even if you were in a five-star hotel you can't guarantee there won't be prostitutes staying there\". Wrong answer, mate. We were prepared to lose all our money (which naturally had to be paid in advance and is non refundable) and stay somewhere else, but it was getting on midnight and we were both ready to collapse from exhaustion. After a huge argument with this bloke and his supervisor who kept telling us that they were absolutely fully booked, they caved in and gave us the keys to another apartment down the road to look at. This was in no 81 - the ground floor flat. It was a vast improvement - it still needed a clean, but it looked like it had been recently renovated and was at least livable (it was the flat that they show on their website). The supervisor told us he was doing us a huge favour, because this flat was much more expensive than the one we'd booked and we really should be paying more to stay there, so we asked him why he had photos of the more expensive flats on the internet when in reality the ones you get are cess pits. We were constantly worried that they'd charge our credit card because we were in the \"deluxe\" room (they keep you card number on file) but thankfully they didn't. The staff were rude when we checked out. Oh, and the apartments are definitely not serviced. No beds get made, no linen gets changed, no bathrooms get stocked - nothing. We also told them that we had no cutlery in the apartment and they said they'd send someone right over. No one ever came and we had to go buy some cutlery from Tescos so we could eat. We read these reviews after we'd booked but thought it couldn't possibly be this bad. It wasn't - it was far, far worse than we could ever have imagined. Please, do not give these crooks the money and the business. They should be shut down. How the hell they're even operating god only knows. The location is good, but for god's sake find somewhere else to stay in the area.", "Date": "October 5, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Orlando, Florida", "Title": "“Be careful which flat you get placed in... check it first ... some are bad”", "Author": "wends13", "ReviewID": "UR82059397", "Content": "Great location. First they put us in 77 Inverness Ter. 2nd floor which is their 3rd floor. After lugging all our luggage up 4 flights of stairs only to discover that the room ( suite ? ) was sub-standard!!! Went back to reception at 55 Inverness to be told that there was a ground floor available but it was GBP30.00 per night to upgrade to this room... this was the ground floor at 81 Inverness which was quite nice and seemed recently renovated and upgraded. I was also charged an additional 4% for paying with AMEX card! Reception is slow but nice and helpful but is unaware which rooms have balconies. In the end I would stay there again as the location is superb... BUT... be very careful which room you get placed in. Have a look first.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Dublin", "Title": "“DUMP - STAY AWAY”", "Author": "IndependentT", "ReviewID": "UR81479637", "Content": "Worst apartment experience in London I've had. Paid 144 Euros for one night. Waited over half an hour to check in. Rude receptionists. Sinks blocked when I arrived in room - rang receptionist - said someone would be over - no one came. Filthy walls, entranceway. Everything stank from the blocked pipes. EXTREMELY noisy - machines outside single glased window on ground floor. No curtains. I could go on.. I'd rather forget about the whole experience. Would warn anyone about staying in any of their apartments.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“Below average”", "Author": "AndyJ120", "ReviewID": "UR80879674", "Content": "On arrival, found somebody complaining about a basement level room. Ended up in a basement level room, window facing a dirty/grimy/unkepy and distgusting stairwell, many people walking by and other customers frequently walking past window making our stay very uncomfortable. TV stand was broken. Bed was absolutely appaling in terms of comfort (so was the sofa), also the bed was loud when moving the slightest bit, during the night temperature was way too high and had not air con. The walls and room were very dirty. A dirty cooking tray was left in the oven. Bathroom was generally clean, shower worked perfect that was the best part of the room. Kitchen table was incredibly small and had massive bumps and marks in the paint. Not enough cutlary and kitchen ware. Other than all of that... the location was absolutely perfect (very close to bayswater and queensway) down the road from hyde park also and a short walk to paddington station. Has cinema, bowling, restaurants, tesco express and metro, cash machine, shopping centre (whiteleys). Advice would be have your specations reasonably low and you wont be disappointed.", "Date": "September 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "ALICE SPRINGS", "Title": "“Excellent value for money and a good location”", "Author": "JPRICE_10", "ReviewID": "UR77882639", "Content": "I read several poor reviews of this hotel before staying there so I was a little aprehensive but I found the hotel to be really good. The location was great, Hyde Park is right at the end of the street and there are two tube stations very close by as well as a busy shopping street with nice restaurants one street over. The room was quite small but perfectly adequate for our needs with a comfortable bed and very clean. You do have to check in and then walk up to your apartment and there are no lifts so you should be prepared for that if you have heavy luggage but we had no problems. All in all I thought good value for money given that other places in London are so expensive.", "Date": "September 1, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Never again, you live and learn”", "Author": "manciniqueen", "ReviewID": "UR77705162", "Content": "I read reviews and because I am not fussy thought nothing of it. We booked a duplex appartment for 5 as it was impossible to get hotel room for 2 adults and 3 kids. When we arrived staff were good and we were in block 32 so short walk. Location is excellent with tube right nearby and tesco direct to fuel a picnic in the park really good. The room was geared for 3 had to ask for extra bedding cups, plates and towels and they knew from the booking we were a party of 5, hairdryer broke and you could actually go onto the balcony and break into your own apartment, the apartment was dirty the bed linen was clean but it smelt musty. This in itself was enough but went for Lebonese meal on high street and through the night kids were sick, yet again not within our capabilities but to phone housekeeping so we could mop floor after initial clear up and change towles, they did not respond for the whole of our 4 day stay until the final morning when they knocked at 9.15 to ask to be in for an 11am dept time... classic. Room red hot and no air con, you could not have patio doors open as they were open to a balcony all along the row. The worst was the noise. You are in London we were out from 9.30 till 11 with the kids to pack in the tourist bit but we were next to loud families and they would not open door so resorted to banging on wall at 1am and then again at 6am when children playing ball in the room, they did not speak English and reception did not want to know. We actually thought they were in all day so wondered if they were hostled there. It was like being next to a childminding gymnasium. If you get similar price book hotel with reception and a means of support. The management seem so far removed that they do not care and the next wave of foriegn travellers are next in so it does not matter. This is a first time as complainer as I normally use my tent so you can see I am used to roughing it but this went to far... P.S kids loved london there is a noodle bar on the same side as tesco across the road. it was so good. the best chinese we have had. Really good fresh and juicy dishes and so cheap. Service excellent. if you are brave and go to the apt go to this noodle bar.", "Date": "August 31, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "N. Ireland", "Title": "“Great location . Pity about shower , oven and microwave not working”", "Author": "RaeMcEalrea", "ReviewID": "UR76867043", "Content": "This apartment is in a great location but although we reported to the management that the shower was not working it was not fixed during the five days that we spent there, Also the oven nor the microwave worked and were not fixed during our stay.", "Date": "August 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Pickering, Canada", "Title": "“Just what I needed..”", "Author": "LovesToTravel2208", "ReviewID": "UR76824466", "Content": "After reading quite a few reviews here of this particular hotel I was a little nervous about what I would find on my arrival. The pictures I saw were almost exactly what my room looked like. I had a bed, a table, a tv and a full kitchen complete with a few dishes and a mini fridge. It was just what I needed as a single traveler. I went to the grocery store nearby and picked up some essentials and saved a load of money by not eating out. The bedding was clean as was the bathroom. A 2 minute walk down the street had you through the gates into Kensington/Hyde Park and and the Queensway subway station..perfect location for a quick tube ride to Oxford Street, Trafalgar Square, Big Ben, West Minister Abbey etc. The only negatives about where I stayed were: the floor creaked in a certain spot (who cares?), one of the tiles was a bit loose in the bathroom (again, who cares?), the tv had only one english channel available but I was too tired by the time I returned to the room every night I didn't care to watch tv and there is no elevator in the building. So when you first arrive and when you check out, you've got to lug your luggage down the stairs, and being on the third floor as I was, it sucked but it wouldn't be enough to discourage me from coming here again. It was a nice quiet tree-lined street full of \"townhomes\" and it felt like coming home to your own apartment at the end of the day, not a hotel. If I return to London solo in the future, I will be booking here again.", "Date": "August 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“What was to be expected at such a low rate?”", "Author": "Stadtmaus1234", "ReviewID": "UR73453676", "Content": "We arrived at Stansted and took a coach shuttle to Victoria Street station, which is well connected to the underground station next to the apartment via Central line to Queensway station. The staff at check-in was friendly but a bit unorganized. The first look into the apartment building was, let's say, unusual - a once beautiful stairways now pretty run down with and extremely old, dirty and ragged carpet. Our apartment had a laminate floor, a pretty spacious and fully equipped kitchen (stove with oven, fridge, microwave, toaster, electrical water cooker, coffee maker, cooking equipment, dishes, cutlery etc.), a comfortable double bed, one bedside table, a small table with two chairs, a flat screen TV with 4 channels (very bad reception), a large cupboard with hangers, an iron and ironing board, a really tiny bathroom with a toilet, washbasin, mirror and a shower. What we liked best: - conveniently located within short walking distance to 3 underground lines + to Hyde Park and Kensington Park - lots of grocery stores, pubs and restaurants on Queensway + surroundings (please don't try the Indian buffet on Iverness terrace!) - kitchen to be able to prepare breakfast and cool beverages - low rate What we liked least: - building rubble in hallway (from ground floor renovations) - neglected and dirty stairways - dust in the room (corners, massive on the window) - mould in the bathroom (ceiling, walls due to missing ventilation) - no sockets in bathroom (e.g. for hair dryer) - no lights next to the bed for bed time reading All in all it was pretty okay for the low rate we paid but I am sure that we are willing to spent more to get more comfort and cleanliness next time. I would not recommend this apartment to a friend but think it is suitable for backpackers or youth groups who's focus is on location and a low rate.", "Date": "August 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“It is a great location and we will be back again”", "Author": "salimalhadi", "ReviewID": "UR73293256", "Content": "We stayed in July 21, for 10 days with my two children, we realy like the place and the staff were very friendly and helpful, over all we enjoyed our stay and very much recommend for all those whom like to enjoy a holiday in London.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“Definitely no third time”", "Author": "MunichPam", "ReviewID": "UR72140230", "Content": "Been here twice, first time studio at base was poorly maintain with broken woodfloor. We gave it another short seeing location was good and most places closeby was book out. This time the studio was much smaller, oven not working and bathroom way too small with inconsistence hot/cold water. Not good value, would rather stay further out London for almost half the price.", "Date": "July 24, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Trondheim, Norway", "Title": "“Terrible service - good location”", "Author": "AlMe_10", "ReviewID": "UR72009039", "Content": "We had booked rooms for \"London Apartments\", 11 Inverness Street, which is non-existing. After a few phone calls to the travel agent (restplass.no), believing we had been hustled, we found that the hotel actually was Hyde Park Suites. We had two rooms, which initially looked nice.. The first room was clean enough, but had a non-functional air-conidtion, and was terribly noisy, located in the basement next to Inverness Street. The bathroom was moldy. The other room was nicer, however dirty. The sheets were not changed during our one week stay, the rooms were not cleaned, and towels were only changed after several complaints. The location was very good, and if the rate was lower, we could have tolerated the low level of service, but at the rate we paid, this hotel is not recommended.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Vicksburg, Mississippi", "Title": "“Runaway! What a ripoff!”", "Author": "adoptforlove1", "ReviewID": "UR68772340", "Content": "My experience with this place was a disaster from beginning to end. The staff is rude, I had to walk two blocks to get to my building from the office, walk up 6 flights of narrow stairs, the shower was moldy, there were flies all over the place, the tv had four channels and none of them were english, none of the electrical sockets worked, and it was extremely small, and it smelled like garbage. The staff asked me what I wanted them to do about it and when I told them they said my reasons were not good enough. I didn't spend one single night here. I left and they kept my money. If anyone says they had a good stay with these people...well, they really lucked out!", "Date": "June 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“More than we expected”", "Author": "Renee_amore", "ReviewID": "UR67643685", "Content": "We arrived at the hotel on the 9th and for the amount we paid in comparison to other deals in the area we got a bargain, the rooms were very clean, surprisingly there was a fully functioning kitchen with a washing machine, prompt service, Internet and best of all the location is fantastic as Hyde park and the shops is literally a minutes walk from this place.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Getting what you pay for”", "Author": "Kodac", "ReviewID": "UR65399835", "Content": "I stayed at 30 Inverness, there are no lifts so if you have mobility issues or lots of luggage, then this place won't be any good unless you're on the ground floor. But then because the walls are paper thin, you can expect to hear a bit of noise with people coming and going. I didn't have high expectations for the room so I wasn't disappointed. I was on the first floor and the room was tiny but it looked much like the photo on the Internet. It was reasonably clean although the drains in the bathroom were smelly, particularly overnight. I suspect this was because the building is quite old. I didn't experience any bed bugs but there was a window above the bed with no curtains to draw across it to keep the morning light out. If there had been, I would have had a better sleep. The location is what sells the place. Within a few minutes walk to Bayswater and Queensway tubes, Hyde Park, shops, restaurants and so on. Staff were reasonably friendly, although do be ware if they offer to order you taxi to pick you up after checking out, it won't be a black taxi, but one of the friend's 'limo' cars which cost about twice as much. I also discovered later that I was overcharged, so make sure you have your booking confirmation with you with your quoted room rate (I did not). And for these two reasons, I would not stay there again or recommend it to friends.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Venezia", "Title": "“terrible”", "Author": "Sonja1577", "ReviewID": "UR63208553", "Content": "Don't stay here, please!!! First thing: we were charged 50Â£ for the late check in!!??? Dirty bed sheets, smelly towels, toilet incredibly dirty!!! Awful, uncomfortable bed!!! Furniture falling apart! It's a kitchen with bed, not an apartment!!! We complained to the staff about a very dirty toilet, they did nothing! We cleaned it ourselves!? Staff extremely rude and unpleasant!!! Door handle of our room broken! We had ONE key for the front door and our room door!!?? It's such a shame that someone actually let this kind of people manage houses on such a great location?! :(", "Date": "May 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Lancashire", "Title": "“DON'T EVEN WALK THROUGH THE DOOR”", "Author": "NJPLancashire", "ReviewID": "UR61884283", "Content": "We arrived at this hovel Friday afternoon, the reception was dirty and the staff extremely rude. We were asked for ID i.e. passport even thou we were in our own country, then told we were not booked in but we provided our booking reference. Luckily 2 of our party took it upon themselves to have a look at one of the rooms - there were squalid. After several agruments we advised the staff we would not be staying and rang Lastminute.com who agreed to remimburse our costs and how are now looking into the matter. PLEASE DO NOT BE FOOLED BY THE PHOTOGRAPHS - THEY MUST HAVE BEEN TAKEN FROM A DIFFERENT WEBSITE. It said the apartments were 4 star I would give them -4. Nicola, Lancashire", "Date": "April 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Chicago", "Title": "“Bed Bugs”", "Author": "businesstraveler005", "ReviewID": "UR61615272", "Content": "11 inverness terrace building is dirty and had bed bugs that ate me alive in both rooms they gave me. DO NOT STAY THERE. (their other properties seem ok but NOT 11 inverness terrace)", "Date": "April 15, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Melbourne, Vic", "Title": "“You get what you pay for (or even less in this case)”", "Author": "AussieLovesLondon", "ReviewID": "UR61055373", "Content": "I agree with most other reviewers about Hyde Park Suites. The reception was crowded with suitcases and the staff were so young and inexperienced alarm bells rang in my head. It didn't help that we were sooo jetlagged from our long trip from Melbourne and were just craving somewhere to lay our weary heads. The girl took forever to process us (nearly an hour) and to our horror we were on the fifth floor with NO LIFT - even though I expressly asked for an apartment building with a lift. I complained but were told they were full up so TOO BAD! We were nearly dead after dragging our heavy bags one by one up to the heavens. The rooms were hot - we opened the windows but were then pounded by the noise of the construction of the buildings next door. The sofa was uncomfortable and the kitchen utensils very minimal. The only plus was that the location was good and close to everything. We are coming back to London in Oct 2010 and will stay somewhere else, thank you very much.", "Date": "April 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Stirling", "Title": "“Absolutely awful!”", "Author": "Vic1979", "ReviewID": "UR60238735", "Content": "Horrendous room - website is false advertising. Room very basic, furniture falling apart. Staff unhelpful. Don't be fooled by the website. Disgraceful!", "Date": "April 3, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "louth ireland", "Title": "“NOT WORTH THE MONEY”", "Author": "almajosgan100", "ReviewID": "UR55546768", "Content": "We stayed at No32 inverness Terrace flat 20, which was a 1 bed apartment, booked thru LovingLondonApartments.Com, Firstly this website do not refund and any cancellations are penalised. The apartment was in good location, Queensway or bayswater underground Stations are 2 min walk,There is no lift in the building,we were on the top floor,The hallway was clean and airy, The apaartment was small,basic,clean and very hot, we had the window open for the 3 days we there, Bedroom had comfortable bed and double wardrobe, living area had small kitchen with utensils for 4 ,and lounge had sofa bed which we never dicovered how to pull out,It was not very comfortable,tv which i had to fix as it didnt work and table and chairs, No pictures on walls, or lamps gave it a very baren feel, It is basic,fine for 2-3 days but only for those fit for 5 flights of stairs... The bathroom was very small, the shower tray cracked and used soap left by the sink for the next guests, clean towels where supplied as was toilet roll and rubbish bags, The area is fine there is a high street called Queensway around corner with spar, tesco lots of restaurants, The area has a high student and tourist population, It was very safe. Wouldnt go back to these apartments as the price was too high for what we got,On the last day the firealarm went off at 9am although no one came (janitor or fire service)to turn it off, basically Number 32 inverness Terrace is an ok clean building with basic clean apartments in a great location, nothing more..", "Date": "February 9, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Dubbo", "Title": "“Beware of cancellation policy - highway robbery.”", "Author": "nightowl66", "ReviewID": "UR54994799", "Content": "Booked this hotel and then read tripadvisor and found that reviews were less than favourable, I cancelled Hotel within a couple of days and found that they charged me a 104 pound cancellation fee. Just be very very careful that you want to stay here as it says in fine print their cancellation policy, and In my opinion it is a bit steep especially when you book some five months out and they could manage to rebook this room several times over. I guess I would rather lose my money than stay in a dive, which is pretty much what other reviews say.After emailing and phone call pleading with management, they were no help at all and refused to refund any of my money. Doesn't show London in a very good light.", "Date": "February 2, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "London", "Title": "“Horrible!! Do not ever stay there!”", "Author": "Jenny73London", "ReviewID": "UR50996694", "Content": "Horrible, is all I have to say. As soon as I walked in to the reception (which is one big joke. It is a shabby looking room with 2 desks and hundreds of suitcases) I knew I have made a HUGE mistake by booking an apartment with them. Once checked in, I was told my apartment was located 10 minutes away from the office. No help to carry my luggage was offered. The apartment was located on a third floor (no lift of course, but I already knew about it). I walked into my room, and I could not believe what I saw. Old, dirty-stained sheets. A broken sofa. In general it was one of the most depressing rooms I have seen in my life. On top of that, during my first night tons of cockroaches showed up, and I thought I was going to get a heart attack. They were basically everywhere. I went to the reception the next day, and said I would not stay in that room for another day. I was then told that this is a common thing in London, and because they were fully booked they could not offer me a different apartment. I asked for a refund, and was told that this is not possible. As I did not want to spend more money on my accommodation, I was made to stay in this horrible apartment with cockroaches every night. You would assume, that that is enough for one stay. A couple of days later, I heard a knock on my door. It turned up to be a bailiff who asked me to give him Â£2000 pounds for the electricity bills which have been outstanding for the last 2 years. Can you believe it!?! I was in shock. I was told that if I do not pay it at that point, they will remove all my belongings. I went to the reception with the gentleman. The poor guy at the desk tried to call his manager, who apparently was not available at that point. I have heard him saying that the bailiff came again. Which only proves, that this company does not even pay any bills. I would not be surprised if one of the guests was actually asked to pay for their bills. Horrible experience. I am not sure who allows these people to rent their accommodation. I have contacted my agent, and told him that I would expect him to do some kind of screening on the hotel he is so much recommending to other people. How can you allow this? I would never recommend this place to any of my enemies, so stay away if you can.", "Date": "December 10, 2009"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "nottingham", "Title": "“Horrid experience.”", "Author": "darkH0rse", "ReviewID": "UR50170889", "Content": "Aside from the fact that we weren't informed that there was no hot water or heat until after we'd paid for the rooms (non-refundable, of course), I WAS ROBBED in this hotel. The desk clerk was totally disinterested, did nothing to help, and he had the most appalling manner. We'd left our luggage with reception because the room wasn't available until 2pm -when we got back at 4:30pm, my backpack was gone. After insisting that someone do something about it, we got access to the security cameras, which showed clearly how a stranger walked into the reception area from the street on pretext of being a client and minutes later, attached my backpack to his own bag and walked out - while the entire staff were present! The baggage had been appropriately tagged by the hotel, and yet they claim no responsibility for the theft. There was no manager present, and no one of any authority could be contacted regarding any complaints. The room was mediocre, and noise from the corridors disturbed us late into the night. No hot water or heat the entire time. Shabby corridors. Truly awful experience - don't go near this place.", "Date": "November 27, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Sydney", "Title": "“Fault Ridden Towers”", "Author": "SydneyFifer", "ReviewID": "UR47608446", "Content": "Here is one to avoid. Booked through an agency named London Choice, things went down hill thanks to this agency taking our money, changing our booking, and refusing all attempts to contact them. On arrival we found the location excellent, but the accommodation a disaster for the following reasons: a lift facade with no lift in it, narrow stairs, fire doors propped open with the fire extinguishers, a blank health and safety notice board, wet towels, bathroom lights permanently on, overheating light switches, exposed wiring hanging out of holes in the walls, no dish towels, broken lights over kitchen stove, only one dining chair for two people, broken glass in window held together with paper and tape, window sashes broken, stained bed linen, and a mattress with multiple broken springs. External intercom system disconnected. Keys for the room were available at the other end of the street, and they requested a 100 pound key deposit. I would be happy to supply photos on request.", "Date": "October 24, 2009"}], "HotelInfo": {"Name": "Hyde Park Economy Apartments", "HotelURL": "/ShowUserReviews-g186338-d1194801-Reviews-Hyde_Park_Economy_Apartments-London_England.html", "Price": "$133 - $343*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">11 - 13 Inverness Terrace</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">W2 3JL</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "1194801", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/60/cf/60cf8beedf6f763e7af88369b063bfea13large.jpg"}}