{"Reviews": [{"Content": "Relaxing at the Puri Raja Despite some mixed reviews about the Puri Raja hotel in Legian, we had a great time.The hotel's website does not do the hotel justice, the hotel is set in gorgeous gardens with orchids and frangipani trees. It also has two great pools, one with a swim up bar which attracts a younger crowd and the other has more of a relaxed/grown up feel.The hotel is in walking distance to a dozen top-quality restaurants in Legian, which are set on the lovely beach front (which provides a much needed breeze on hot days/nights).Overall we really enjoyed our stay.", "Date": "Dec 14, 2008", "ReviewID": "UR268675135", "Ratings": {"Service": "4", "Business service": "5", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "sparkles000"}, {"Content": "Just as it should be We booked Puri Raja based on the reviews of tripadviser, and had a fabulous stay there. The bookings can be made directly through the hotel website, I haven't seen it on any online booking system. Puri Raja's location is perfect, right at the beach of Legian. The staff is generally really nice, maybe with the exeption of the front desk. The hotel has 2 pools, lush gardens, and a nice restaurant by the beach.", "Date": "Nov 19, 2008", "ReviewID": "UR395380689", "Ratings": {"Service": "4", "Business service": "2", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "hzxaa"}, {"Content": "This  Legian and the Puri Rajah Hotel, this place is actualy about $4 US a night cheaper than the Besakih however the two resorts cannot be more oposites the rooms and pools are more up to date, the breakfast is the same as the Besakih but you do get tea and coffee and bathroom goods replaced each day and as my wife says it is those little things that make a place. The room cleaning service is very poor our room was not made up until about 2pm every day, however the room was good but no room for a roll away bed. Both pools were very good. This place can be noisy at night due to the teenages that stay here. Once again we did the tour of the restaurants, Ricky's in our opinion was the best, followed by the Sinar (across the road from Melasti Resort), Patricks not bad, Bamboo (in legian St) this is run by the same people that had Bamboo Corner (it is no longer there either,they finished pulling it down yesterday), Maharta next door to Puri on the beach side very nice and you wont get a better price, there is another that we went to about 3 doors up from the Puri with the red boards out front they were also ok, but in our 14 nights we did not eat at what you could call a bad restaurant. The average price for the two of us including starter or desert, mains and drinks was around 120 to 150,000rph. Large Bintangs were anywhere from 17,000rph to 23,000rph.We did most of our shopping (all the surf stuff, tee shirts etc) at two special shops one in Sanur and one in Legian (fixed price and no rip off), if you want their shop names drop me an email I have left it open.Safari Park, all I can say is you must see it, it is a great day out but take your own drinks etc as they charge like a wounded bull in the park.The Blue Taxi is a great way to get around to the super markets costs about 25,000rph from Legian to Carrefour and anywhere from 18,000 to 26,000rph from Legian to Centro.It is amazing how some things have changed for the better over the last four years (this was our 15th trip) someone is ploughing a lot of money into the property market at the moment lets hope that they do not go too far over the top and charge an arm and a leg to stay at the new resorts when they are finished.", "Date": "Nov 14, 2008", "ReviewID": "UR435343810", "Ratings": {"Service": "1", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "4", "Location": "5"}, "Author": "AB1951"}, {"Content": "Great Location Just got back from a weeks stay at Puri Raja in Legian. The location is GREAT and walking distance to many shops and restaurants. And being right on the beach was ideal. I loved the location because it's only 5 minutes to walk to the hustle  bustle but the beach where the resort is, is very quiet in comparison and we weren't haggled too much as well. For the price, the rooms where very nice and the grounds are very pretty and kept up. We stayed in the Deluxe room near the pool and it was much worth the extra money. The rooms are bigger, bed is bigger, bathrooms are all marble and there is an outside shower I really enjoyed. Plus it was very close to the pool, restaurant  beach. We made drinks in our room to save some money and it made it easy to get ice from the bartender when we needed it. There was always security walking around which made us feel safe since we were there right before the executions and the staff were overall very friendly. The only staff that wasn't too friendly was the receptionists. But Katoot (if that's how you spell it) was my favorite staff member that mainly worked at the pool bar. VERY friendly and I now consider him a good friend. So be sure to ask for him and tell him Neisha  Rob recommended his services! I like that there are two pools as well. The main pool located toward the beach/restaurant is usually pretty busy and way too warm because it's pretty shallow. I preferred the pool toward the main lobby because it was quiet, clean and cooler since it was deeper. My only complaint would be the food. Breakfast was ok and came with our package. Keep in mind they say it's for American breakfast only, but you can actually choose anything on the menu for the same or less value. Other than that, we tried eating lunch a few times there and once couldn't take more than one bite. We found it pretty gross in comparison to other restaurants we'd eaten at throughout the island. But no biggy because there are tons of places to choose from within walking distance.When we return to Bali, we would stay here again if we decided to stay in Legian again.Hope this helps!", "Date": "Nov 10, 2008", "ReviewID": "UR608189181", "Ratings": {"Service": "4", "Business service": "5", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "TravelWithOpenEyes"}, {"Content": "Tout est parfait   showReview(22702006, 'full');", "Date": "Dec 13, 2008", "ReviewID": "UR210592317", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "lekid"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g608487-d1197843-r22729554-Puri_Raja-Legian_Bali.html", "HotelID": "1197843", "Price": "Unkonwn"}}