{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Yikes!”", "Author": "HappyTravelGuy", "ReviewID": "UR5639167", "Content": "We stayed here a couple of years ago and it was very scary. We chose the place because of the cheap rates, but you get what you pay for. There was so much mold on the shower/tub that my wife wouldn't use it. And the hotel is basically right around the corner from some pretty unseemly establishments (adult club). We didn't spend a lot, but it wasn't a nite to remember.", "Date": "August 21, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "CA", "Title": "“Awful Experience!”", "Author": "kittychick55", "ReviewID": "UR5536025", "Content": "All I can say is... you get what you pay for! You want cheap, you got it here. We stayed at Good Nite Inn for 3 nights during a blazing heat wave. The room we were in the a/c barely worked and the condenser had leaked all over the carpet and was soaked. The room smelled like mildew. We complained at the front desk, the person there was no help, would not give us the manager's name and said he/she would not be back till Monday, the day we were checking out! Unbelievable! And could not move us because they were sold out. The next afternoon we complained again to a new front desk person, at least she made the effort and moved us to another room with working a/c. No one had put in our previous complaint about the first room!. She sent a repair person to fix the a/c and clean up all the water on the carpet. I would not stay at Good Nite Inn again even if I had to sleep in my car. It smells awful, the carpet was dirty, looked like it was never cleaned. Next time I go to San Diego I will pay more for a nice hotel/motel room.", "Date": "August 1, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Phoenix, AZ", "Title": "“Not as advertised”", "Author": "snwrites", "ReviewID": "UR5480802", "Content": "Call before you book. Only rooms with King beds have refrigerators. We asked for one in our standard room and they brought us one that did not work. Front desk people were surly (night and day). Bathroom was not very clean. The price and location were great for our event at SDSU.", "Date": "July 18, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "3", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Las Vegas, NV", "Title": "“Beware Do Not Stay Here ”", "Author": "A TripAdvisor Member", "ReviewID": "UR5358806", "Content": "I would never reccomend this hotel, as soon as we walked in there was a misty smell we were in room 311 lower level in the back of the hotel. The Ice Machine did not work so we had to go to the other end of the hotel to get some Ice. The Beds were extremmly soft both husband and I could not sleep all night. The first night our phone rand all night long for no reason evertime we would pick it up there was no one there. They had 2 fitted sheets on the bed, so I ended up sleeping on plastic. The cleaning staff could not answer any questions I had because no one spoke any english. The only great thing I can say about this place was when I opened my drapes I saw beutifull flowers. Also Mission Beach and the San Diego Zoo are not far from this hotel (which is were we went). There is a better hotel right next door called the Best Western stay there instead I know I will be next time I am in San Diego.", "Date": "June 18, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Reno, NV", "Title": "“Disgusting”", "Author": "A TripAdvisor Member", "ReviewID": "UR5204740", "Content": "I have stayed in some cheap and dirty places in my time, but even in third world countries I have not seen something so disgusting. Upon entering the room, we were greeted with a musty rotten animal smell. There were dirty smudges all over the walls and fixtures. The floor hadn't been cleaned in a long time. The large white crusty stains on the floor under the TV was nauseating to look at. We never took our shoes off the entire visit. The TV had some sticky substance running down the front of it, so we had to use tissue to use the controls (there was no remote control). The bathroom was filthy. The tub had black grime in it and the toilet had dried blood on it. The bed had no fitted sheet, only two flat sheets, leaving the mattress exposed. Black hair was coming out from between the mattresses. We went to the front desk to complain. The girl was very friendly, but was unable to get us another room since they were all booked due to it being the SDSU graduation weekend. She offered to have it cleaned the next day when the cleaning staff was in, but this would not be soon enough. We ended up paying for the night and staying with friends in La Jolla. Perhaps other rooms are better, but this was terrible.", "Date": "May 23, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Orange County, CA", "Title": "“Terrible Conditions...”", "Author": "kaspernik", "ReviewID": "UR5180335", "Content": "We're usually not too picky if we just need a place to sleep - as long as it's clean and fairly comfortable. So, we weren't expecting the best night of our life - but we were appauled at the room condition. To start, the floor had not been vacuumed and had enough debris on it that we had to keep our shoes on. The bedding looked clean but the plastic covered mattresses didn't even have fitted sheets on them - they instead had flat sheets layed over them that weren't even large enough to tuck under. We ended up having a sleepless night because the sheet kept shifting around and we were laying directly on plastic. The bathroom was disgusting!!! The door and walls had something gross splashed all over them, the light switch and doorknob were gross and the worst part of all - the toilet seat had urine on it! When we talked to the lobby about it - they acted as if they didn't care - that it was no big deal - & told us the room had been cleaned. We didn't cause a fuss since as we were very tired, but we will definitely NEVER STAY HERE AGAIN! Honestly, a cheaper motel may be a better option!", "Date": "May 18, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Camp Pendleton CA", "Title": "“Great stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR4978714", "Content": "I recently stayed the night at this Good Nite Inn while on family \"road trip\" vacation! After a long drive and a long day at Sea World with my wife and 8 month year old boy it was nice and honestly pretty unexpected for the price I paid to come to an extremely spacious room that was right off the freeway but still very humble and tranquil. The staff was very courtious and the room was really clean like I already stated there was plenty off room to throw evrything down and still have room to relax. I would definetly recomend this place to a friend and would most certainly speend the night again. Now as we all know nothing in this world is perfect and my only suggestion to this establishment is to get better wireless connection for all those who travel with their lap tops. I hope this was helpful in making your decision.", "Date": "April 16, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Good for the price”", "Author": "A TripAdvisor Member", "ReviewID": "UR4591654", "Content": "I have stayed at this location several times. I find it to be quiet and clean. I have had nothing but good experiences here. For the price you get a lot. It's not a Doubletree or Westin, but for the price, it's a great place to stay.", "Date": "March 7, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "3", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Buenos Aires, Argentina", "Title": "“Just ok”", "Author": "lov", "ReviewID": "UR4146903", "Content": "Great value, its really budget hotel. If you have a car it's ok, it's pretty close to everywhere within 10 minutes by car. The room was just ok some dirty spots, mold on peeling wall paper (that was very gross!!), rust on silver tissue case etc. we missed bath towel once also, needed to go to front desk at night. Cleaning poeple did not replace plastic cups. Some spots were not cleaned. We were on first floor and we could hear upstairs,,(people were not that active so that was ok..) better bring your ear plugs. Bed was soft,,, not very good feeling. I think this is for budget travelers. It was really ok though if you just go to sleep for nights.", "Date": "November 27, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "3", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Anchorage", "Title": "“Too far out, hard to get in, the inn.”", "Author": "AnchorageaJackie", "ReviewID": "UR4074304", "Content": "We stayed at this hotel for 3 nites. There were problems from the beginning with our room, 213, and the door lock. Every time we wanted to get into our room the electronic key would not work, and we would have to go ask for help from the staff, and even they would have a hard time with the lock. There were no apologies from the staff for this problem at all, even when I complained at check out. The best part of our stay was to see the wild cottontail rabbits on the lawn in the evening. What a treat. The grounds appeared to be kept up well and the room was passible, though the bedspread was stained, and the pillows flat. Also, don't stay here if you expect to be closer to town. It was an experience to drive here every day.", "Date": "October 31, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "3", "Rooms": "1"}, "AuthorLocation": "San Antonio", "Title": "“Rats!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3910437", "Content": "We stayed there for our Navy reunion. As we sat on the patio outside the lobby, one guy saw a rat the size of a small cat run up the patio. That night at the pool, the courtyard was infested with rodents. I think they filmed \"Willard\" here. The rooms were not very clean, and were musty. The staff was helpful & courteous, but that's about it. Nothing was within walking distance. Do yourself a favor & stay in a trailor park.", "Date": "September 16, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Pretty basic, but acceptable.”", "Author": "A TripAdvisor Member", "ReviewID": "UR2947439", "Content": "Have been staying at GNI-SD for several years........usually on weekends. It's pretty \"basic\"........and could really stand having new carpets throughout. It is inexpensive, though..........and \"works\" on the budget of a retired person who doesn't intend to spend much actual time in the motel.", "Date": "December 28, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Los Angeles, California", "Title": "“No Frills Sleep”", "Author": "ketagyrl", "ReviewID": "UR2122111", "Content": "This hotel was a good bargain but not overly impressive. The room was not too small, in ok condition with a small \"patio,\" and the bed was decent. I asked for a non-smoking room but my room smelled slightly of cigarette smoke. No movie selections and a deposit is required for the phone(which the desk person neglected to tell me when I prepaid for the room). Free parking. Over all, it's not bad if you're just passing through town but think twice if you want a nice vacation hotel room.", "Date": "May 27, 2004"}], "HotelInfo": {"Name": "Good Nite Inn Mission Valley", "HotelURL": "/ShowUserReviews-g60750-d119734-Reviews-Good_Nite_Inn_Mission_Valley-San_Diego_California.html", "Price": "$57 - $85*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">4545 Waring Road</span>, <span class=\"locality\"><span property=\"v:locality\">San Diego</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">92120</span></span> </span> </span> </address>", "HotelID": "119734", "ImgURL": ""}}