{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lurgan, United Kingdom", "Title": "“Excellent base to see Barcelona and fantastic help from the land lady”", "Author": "Sjaunt", "ReviewID": "UR118553473", "Content": "We were overwhelmed by how friendly the land lady was. She helped us with any queries we had about Barcelona and the apartments and also managed to locate 2 Champions League tickets for 3 hours before the football match started. The rooms were very modern and every detail was perfect. They were extremely clean and the perfect size to use as base accommodation for visiting Barcelona.", "Date": "September 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "North", "Title": "“Absolutely outstanding.. brilliant for groups of friends”", "Author": "VandTNorth", "ReviewID": "UR116798277", "Content": "We stayed here as a group of 10 ladies, and hired out all 4 apartments, which meant that it was like staying in a large house. The lady who came to check us in was on time and very informative about Barcelona, answering any questions we had. The accommodation is very clean, and modern, and in an excellent location for the beach, port, bars and centre of town. I would recommend it to anyone, and we will certainly stay here if we visit Barcelona again.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Our home in Barcelona”", "Author": "RowenaH", "ReviewID": "UR116157845", "Content": "We stayed here last august 2010 and we are planning to go back again this year. The apartments were clean and very good located. The beach is only a 5 minute walk and the Rambla about 10 to 15 min. But the walk is along the harbour which makes it a nice stroll. There is a Supermarket right around the corner to get your supplies and there are a lot of nice restaurants all in the neighbourhood. The best thing is the price. No hotel can beat that ;-) Hope you have as good as a stay here as we did!", "Date": "August 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Freestanza Barceloneta !!! Perfect !!!!”", "Author": "Aussies68", "ReviewID": "UR84188701", "Content": "The apartment was great, good size exactly what it looked like in the photos on their website, very clean and tidy, a cubboard and hangers for your clothes, all kitchen essentials as well !!! It was very good we really enjoyed our stay there. Location: Only 15 min walk from Las Ramblas, 3 minute walk to the beach, 2 minute walk to Port Vella, it was honeslty the best location !!!! The apartment was a little hard to find for the taxi drive but he found it ! Food: There is soo many resturants o the main street near the apartment they all are pretty much the same - the food was amazing !!! Staff very helpful, everytime i had a question I just texted the apartment manager and she replied back with helpful answers. Noise: I noticed other people wrote how noisy it was - It was very quiet when we were there for the 4 days this just depends on whats happening around the area when you stay there DO THE BUS TOUR - Well worth it !!!", "Date": "October 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Great Apartment in Fantastic Location”", "Author": "ReviewerWakefield", "ReviewID": "UR64913852", "Content": "I would highly recommend these apartments. We stayed for a week in early May. We were in Barcelona for a spot of sightseeing and to visit the Spanish GP. The apartment made a great base for exploring the city, very close to all transport links, less than 5 mins from the Barceloneta metro station. Best of all it is in a really safe area, we never felt uncomfortable walking back at night which cannot be said for certain other areas of the city which we unintentionally wondered into. We stayed in the duplex apartment which was great for 4 guys, compact but comfortable. The apartment was very clean and maintained to a very high standard. On arrival at Barcelona airport we phoned through and confirmed our arrival. We were met 20 mins later at the apartment and provided with a tour and some essential info on the local area. Highly recommend to all, hope to visit again soon!", "Date": "May 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "bcn-milano", "Title": "“Loved it, excellent position”", "Author": "rebe", "ReviewID": "UR46828949", "Content": "I used to stay in these apartments for more than 2 years. Great location in easy walking distance of the main sites in Barcelona. 5 minutes walk to beach, 15 mins walk to Las Ramblas , 3 minutes walk to subway and 10 minutes walk to train station to get train to airport 30 minutes...and you are away from the tourists. On the port is a lot of very nice paella type restaurants. Lots of spannish local bars and restaurants in the locality. We ate some great tapas there. Also very near to local shops, fresh food market and supermarket up the road, bakery, pharmesist etc. The apartment is a little small but is nicely decorated. Kitchen is fully functional and have everything you need. Bathroom fully equiped also. Bed was comfortable, air-con included, all other amenities perfect. The street is quiet at night. The neighbourhood felt very secure and all the people we encounted where helpful and friendly. Marketa, the girl who met us at accommodation was fantastic, so helpful and friendly and spoke excellent English. Perfect for a traveller on their own who wants to spend their time at their own convenience.", "Date": "October 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Yorkshire", "Title": "“Ideal”", "Author": "Abby12345", "ReviewID": "UR23895576", "Content": "Although a very small room just a bed and ensuite it was ideal for our stay. If you want somewhere that is in an excellent location, cheap somewhere to sleep change and get washed this is the ideal place. There was only one problem that was the telephone number we had to ring the owner didnt work so had to go to local coffee bar and they rang the owner for us. However dont let this put you off. Two mins away from Metro and just a 10 min walk to the centre of Barcelona and a very short walk to the beach.", "Date": "January 25, 2009"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Epping", "Title": "“Great little find....”", "Author": "thechampishere", "ReviewID": "UR23723431", "Content": "Got a very good deal on these apartments from laterooms.com, and I would highly recommend them. Ideally situated, just 15 minutes from La Ramblas, and ten minutes from the Port Olimpic and Beach. Good sized rooms, very clean, in a nice quiet side street, only 2 min form Barceloneta metro. Good for couples of groups, I'm getting married soon and went away with my best man for a pre stag stag do....and it couldn't have been more ideal. Very good service and highly recommended.", "Date": "January 20, 2009"}], "HotelInfo": {"Name": "Freestanza Accommodation", "HotelURL": "/ShowUserReviews-g187497-d1197931-Reviews-Freestanza_Accommodation-Barcelona_Catalonia.html", "Price": "0", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">C Sant Miquel 10</span>, <span class=\"locality\"><span property=\"v:postal-code\">08003</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "1197931", "ImgURL": ""}}