{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Bucharest", "Title": "“Nice place for overnite”", "Author": "radu_sova", "ReviewID": "UR124198106", "Content": "Good location within reach of San Di's attractions. In the vicinity there is a Dennis Fast Food with decent meals and a liquor store (24/7). Beds are very comfy and the area is quiet.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“If you expect to stay in a clean room go somewhere else”", "Author": "Jensen29", "ReviewID": "UR117639790", "Content": "Very very disappointed in our stay here. We reserved a room with a kitchenette and sleeper sofa along with the queen bed. From the moment we opened the door it went downhill. It stunk yet the room had \"just been cleaned\". Everything in the kitchen area was dirty including the fact that there was only two forks, one which was broken, two plates, both with dried food on them, two spatulas- also dirty, and one frying pan and one medium stock pot. This is all. The fridge was a small dorm size fridge with a leaking freezer. Oh and did I mention when we arrived in the room we wiped the floor with some cleaning wipes we had and they were filthy after. On the plus side the fish market is close and the only one still alive is the Point Loma Seafoods one. The cafe is nothing special though. Trader Joes and Vons is only one mile down the road and Sunset Cliffs is about 5 minutes away.", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Buena Park, California", "Title": "“ill be back. good hotel...”", "Author": "RenSarigumbaGaleon", "ReviewID": "UR116574949", "Content": "The hotel manager is nice,hes name is ray.. good service and affordable prices, i can recommend this hotel", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Loved it! Will definitely come back when in San Diego!”", "Author": "jessicadavism", "ReviewID": "UR115406816", "Content": "I made a reservation online through the property's website by going to \"discounts\". I put in my information and the staff called me directly. The nice thing about this was I was able to negotiate a good price. We got a room with a kitchen. The kitchen comes with a pot, plates, utensils, a microwave, and a sink. Although we had intentions to cook, we ended up eating out for the short time we were there. The bed was pretty comfortable, and there was a pull-out couch (we didn't use it). We slept very well. The only complaint was that the couch was difficult to sit in because the springs were shot, so it sank down really low. But really, it was no big deal. Nice bathroom with all the necessities. Decorations and colors make it feel more expensive than it really is. TV with movie channels. Very friendly staff. It's in a great location just a block from a harbor. We took a nice walk around the harbor. Starbucks is nearby, as well as some bars and restaurants. Short drive from beaches. Free parking is a huge plus, as well as free wi-fi internet! Overall, we were more than pleased with our stay here. I'd highly recommend this location as a budget-friendly option in a very good location for your stay in San Diego.", "Date": "July 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Evergreen, Colorado", "Title": "“Great place to stay”", "Author": "austeve", "ReviewID": "UR102491969", "Content": "Rode our harleys from Green Valley Arizona to San Diego got in late and was greeted well. The motel is very clean and centrally located good parking and safe for te bikes. I can't say enough good things to say I will be back and will encourage all my friends to stay", "Date": "April 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Bernardino, California", "Title": "“fine motel & location for a budget traveler”", "Author": "escamo", "ReviewID": "UR100733987", "Content": "We have stayed here 2 times . The manager Ray was very helpful for us because we booked on Expedia and it was the wrong room that we desired, but Ray gave us the correct room at the same price. Very nice! The 2 room suite was very adequate and had all the amenities that you find in the high end hotels that can get very expensive in San Diego. It has a great location on the main street and within walking distance to stores, restaurants and the beautiful marina. It is freeway close to all of San Diego's main attractions. I have just booked two more nights for next week. A budget traveler's delight. Here's a tip. Don't book Point Loma Inn and Suites through a booking agent but call direct for the best price. They are very accommodating.", "Date": "March 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "wyanet, illinois", "Title": "“nice staff but wouldnt stay again”", "Author": "ashpinoza", "ReviewID": "UR91860886", "Content": "im not a super hotel snob or anything, but its not up to my standards for a few reasons. firstly, let me say that the staff was honestly GREAT. we had some changes last minute so we changed our dates last moment literally a day before. they accomadated the changes without hesitation. on their website they have a name your price type deal, and the owner bargained with me and gave me a fair price around 48 a night so it was very very cheap. we stayed one night. we were supposed to stay two but i couldnt deal with it here. when we got there checkin was fast and i asked for lower floor because we have a toddler and we got one. first, the area is really divey looking but alot of san diego is like that. i have been to san diego SEVERALLL times throughout my life and i know that it aint all bright and shiny everywhere. but this was really not a nice area. the hotels exterior is nothing pleasant. it was really bad looking but they did work hard to keep it clean, its just old. when you see the pics online, it seems pretty decent and looked like nice furnishings, however when you go in, they arent. they are VERY cheap, and lots of it was falling apart, wobbly tables, and there is a mirror headboard that we were worried about falling over. it was a kitchen suite, however it was so cramped and tiny in the room. the bed was very uncomfortable. and the oven had a bad smell when we used it. the bathroom was not very nice, decent but not great. there was a window in there too right infront of the shower. most of the room was cleaned well, however the carpet was FILTHY but i find this a problem even in really nice hotels there werent enough towels though :/ this place was probably worth the price for the AREA, but i really wouldnt stay again. at night, it was extremely noisy outside, not just cars, but people talking and doors shutting, the doors and walls are like paper. we also had no place to set up my sons pack and play thats how crowded it was so he got in bed with us. the beds wasnt comfortable, and that combined with the noise, we BARELY slept that night so we checked out early the next day i said i couldnt take a moment more of it. id rather pay the 40 more and go to a holiday inn. we tried the budget route, and it just was not for us. its very old and dingy and though the staff is great and DO work hard to keep it best as it can be, IMO it just needs to be torn down and redone.", "Date": "January 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Wellington, Colorado", "Title": "“Great location and price---comfortable beds!”", "Author": "BekaandJason", "ReviewID": "UR91246836", "Content": "This is a cute little hotel that has a wonderful staff and it located in the middle of everything...only a 5-10 minute drive to anywhere you would want to go in San Diego. The down side of that is it is off of a busy road and the rooms are not the most quiet. Nothing ear plugs can't solve though. The rooms are small, but they were clean. Folks this isn't a Hyatt or a Hilton, but if your looking for a cheap place to stay so you can spend your money elsewhere this is a great place. Ray the manager was always accomodating and there are microwaves and fridges in the rooms which is nice if your staying for a long period of time. We would definately stay here again!", "Date": "December 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Charlevoix, Michigan", "Title": "“Finding a room in the middle of San Diego adventure areas.”", "Author": "stevesailcharlevoix", "ReviewID": "UR80704371", "Content": "Pt. Loma Inns is located near all SD events and tourist destinations. It is close to town and freeways. Great restaurants and shelter island bay views are easy walking distances. The rooms were very clean and the management friendly and helpfull. I would highly recommend this thrifty hotel to all visiting San Diego.", "Date": "September 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Huntington Beach", "Title": "“BEWARE! Extremely Petty and Rude Front Desk Personal”", "Author": "socalfran", "ReviewID": "UR79513552", "Content": "The hotel itself was ok. Nice location, and spacious room, mainly due to the smaller bed size (not a king). The front desk clerk seemed to have an attitude from the time of check in. We arrived with friends who had a dog. Although the hotel offered pet rooms the dog was not ours, was not staying with us, and was not coming in our room. The clerk seemed rather over concerned with the dog, and so I made it a point to make sure the dog did not even come close to our room His careful eye, was rather uncomfortable. We were respecting the pet policy, and had nothing to make him assume we wouldn't. The following day of check out, he was prompt to notify us of the 11 am check out time. As I turned in my key I mentioned our bathroom sink was clogged and not draining, due to the latch coming off hooked from the drop stopper. The same front desk personal insisted on escorting me to take a look. I had picked up the room prior of any debris. Only the bed was unmade and I had placed the used wet towels in a pile under the sink so the maid could pick them all up together. When the Clerk noticed the towels he became very rude and condescending to me. He asked why i would throw them on the floor and why they were so \"filthy\". He picked each towel with his fingertips and a disgusted look on his face, inspecting it. I explained the tile bathroom floor was dirty (not from us) and the towels had justs soaked up some of the dirt. I told him it was nothing that wouldn't come out when washed. He began to insult me by saying I was dirty and do I throw towels on the floor in my own home. I explained I didn't understand the big deal and sarcastically asked if he wanted me to wash them for him. To my surprise he said yes and scooped them all up and handed them to me. I have yet to see if I have been charged on my credit card for incidental fees. I want to add, all the towels were obiviously old and used, very low end quality and the bath towels already had holes in them. The dirt on the towels was tracked into the tile bathroom from his hotel room carpet being dirty. I washed them in hot water and bleach as soon as I got home, and what do you know!? All dirt washed out. I plan on returning them to the hotel this week. regardless of condition of the towels and how they got that way, this hotel staff should be polite to any paying guest. If he had washed the towels and they remained unuseable he could have addressed it then. At $80 night, with no special ammenities other than location, you would think customer satisfaction is the least they could offer.", "Date": "September 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Albuquerque, New Mexico", "Title": "“Hard to beat location and price”", "Author": "Ozone88", "ReviewID": "UR79267375", "Content": "Upgraded to a bigger room with kitchenette by Ray the manager. Well-appointed if modest furnishing and very clean. The Wi-fi worked flawlessly and there were enough kitchen supplies to cook with. Maybe we were lucky but other guests were quiet and only noise came from cars on busy Rosecrans. Parking is very tight but Ray works it so most can fit in lot. Location is great, only one block from harbor and one block from road to airport. Price is hard to beat for San Diego.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Kent", "Title": "“Disappointing...”", "Author": "Chadwickthecat", "ReviewID": "UR75908302", "Content": "We stayed in this hotel for one night as part of a 3 week road trip across the US. It was certainly not the cheapest place we'd stayed in overall, but it was pretty cheap by San Diego standards. It was very well located and an easy walk to Humphries and lots of interesting restaurants along the harbour area. The funishings inside were a little tired, but we never plan on spending much time in a hotel room, so it didn't matter to us. This hotel was also amongst the lowest price we found in the area, so we didn't expect a palace. Unfortunately, our night was completely ruined by some irresponsible louts who returned to their room at about 1am and proceeded to shout and scream outside in the car park at the top of their voices until about 4am. We've stayed in motel style places before, and have been disturbed many times in the past but this noise was like nothing on earth. On three seperate occassions we tried to call the front desk to complain, but the phone line was permanently engaged (had they taken the phone off the hook?) In the morning, we complained at the front desk, and they were apologetic, but it was all too little too late. They explained that they had also heard the shouting and screaming from the other guests, but had assumed it was from another hotel... Although hotels cannot be held responsible for the social skills of their customers, I do not feel they took adequate steps to resolve the issue. For this reason only, I would be very reluctant to return to this hotel.", "Date": "August 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Oslo", "Title": "“Friendly and cheap”", "Author": "Geirmund", "ReviewID": "UR72074711", "Content": "PLI was our base during our three weeks summer holiday stay in SD and surroundings. Very friendly, helpful and serviceminded manager! He did all the best for us, always with an honest smile! Our group of 9 (four adults, three teenagers, two under 10) shared two rooms. Not much space, main bed very good, the other one (sofa bed) a little soft for the kids sharing it - they ended up in a heap in the middle but no serious complaints from the tired ones. Bathroom and kitchen ok, same with the cleaning. All in all, we got what we payed for. The only thing we really missed was a couple of extra chairs round the balcony table in the evenings when socialising. Keep up the good work! With kind regards Geirmund and the rest at #14.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Just what we needed!”", "Author": "GR85", "ReviewID": "UR70851719", "Content": "\"Point Loma Inn @ Suites\" The Best place to stay - wonderful! for the price, location, room and service! This motel is very small -over a dozen rooms, surrounded by many other motels we went first, where we stumbled on some problems like: at the \"Dolphin\" motel for 5 people they had to offer 2 rooms, because one room holds up to 3 persons. At \"Comfort Inn\" up to 4 persons and \"Sun Harbor\" is very cheap, not only by price but by the look and feel as well. They got tiny rooms and dirty carpet, hair on the pillow case, just nasty!! \"Ramada\" was nice but almost $80 more for 3 nights then at \"Point Loma\". We got a discount for 3 nights, plus remember the weekend is always more $$ but we got a flat rate for all 3 days (on 4th of July weekend!). AAA discount included. They also have breakfast: cereal, muffins, milk, coffee and fresh orange juice. Very Friendly and pleasant management. Our room was shown before checking in. For Two adults and three young kids it is perfect accommodation! Main room for parents with a queen bed, fridge, TV, microwave, coffee maker iron and ironing board, dresser, nice table and 2 chairs - lot's of room and the other bedroom with two single beds, beautiful bedding and 2nd TV. Room is super clean, feels more like hotel, nice decor and bedding. Our bathroom was nice as well with a dryer and fresh towels, shampoo and soap. We didn't bring our laptop other ways we'll use their Free wireless internet. Location of the motel is amazing! in just a minute walk away from beautiful San Diego Bay with boats and yachts. Point Loma SportFishing, restaurants. Very short drive (5 minutes) to Sea World, old San Diego and Down town, Coronado isled, beach and museums like \"Maritime\", \"USS Midway\". It is also right by the airport. Very close to the ocean and many more things... We loved the stay there and will come there again! Would be nice to have different breakfast each morning. And one thing for the room: it needs bigger trash cans. That's about it!", "Date": "July 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Lake Tahoe (California), California", "Title": "“Caring and woderful mangement and staff.”", "Author": "CaptainJ27", "ReviewID": "UR68686848", "Content": "I had a peaceful and wonderful stay in the Point Loma Inn and Suit. I was taking a course at Maritime Institue in sd and needed that type of hospitality. Not only where they peaceful, their prices where WAY LESS than the other motels around. There location was only a block from the school and was really easy for me to consintrate and focus on my studies. Rooms where big enough to do all my assignments and had great space for my charting. I was there for two weeks, mangement and staff made me feel like i was at home. Nevertheless I passed my exams! I recommend this hotel to the future students who will intend Maritime Institute in SD. Sincerly yours Captain Jazen Wakeman", "Date": "June 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "McDermo90", "Title": "“Great Stay will be back soon”", "Author": "McDermo90", "ReviewID": "UR58421568", "Content": "Great place to kick back, i have been coming here on and off for about three months and every stay is pleasurable. the front desk(ray) isnt hard to approach and is a gentlemen and took care of my needs. right next to the water, good location for food. Will definatly be here again shortly.", "Date": "March 13, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "5", "Value": "5", "Location": "4"}, "AuthorLocation": "San Diego", "Title": "“A nice place at a great cost”", "Author": "TripSanDiego", "ReviewID": "UR47326066", "Content": "The people in the evening and in the morning front office were very nice. The hotel was old, but, VERY well kept up and being single with a daughter, yes, I had to make sure the front door was locked, like any hotel, but I was comfortable the whole night (that's a wish-list with a 8 year old daughter who needs a drink in the middle of the night...). I was next to a busy road but, at the bedroom I had in room #9, I didn't hear anything. I didn't need the kitchen but if I did, everything was there. The bathroom was nice and clean with hot water coming right away. Maybe I lucked out on my timing of starting the shower but regardless that is very rare to have . I don't do alot in San Diego's downtown but, if things come about where I'm in that area to visit with friends and I am looking for a hotel not to far from the airport, I would make a reservation at the same hotel being the great cost, the front office, and the comfort I had with the stay. The room was comfortable where we relaxed in, ate at with the to-go order from Denny's and with the work that was finished off with the Girl Scouts picture book that I did with my daughter.......", "Date": "October 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "marana az", "Title": "“I was treated like a Oueen”", "Author": "LattMaranaAz", "ReviewID": "UR37272642", "Content": "These People were so nice to me and made me feel so special. The room was so clean and they even up graded me to a very special upstairs room because it was late in the afternoon and the manager felt sorry for me being a older woman alone and it was getting dark before long. What he did not know was that my husband was in the hospital in La jolla and I was tired and afraid being by myself. I cannot tell you how wonderful it made me feel to stay at this special place. I would say that the people that stay at this Inn will be blessed as I was.", "Date": "August 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Scottsdale, AZ", "Title": "“Fun Stay!”", "Author": "ADVENTURES85260", "ReviewID": "UR36031421", "Content": "We have been staying at the Point Loma Inn & Suites on and off for the past month and love it. The staff is pleasant and the Manager (Ray) is extremely friendly and helpful. The rooms are very clean and sanitized and the housekeeping service will bring you whatever you need. It is walking distance to most anything you would need as far as food and entertainment. This is the place to stay if you are on a budget!", "Date": "July 28, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Burlington", "Title": "“great deal”", "Author": "boothinstaller", "ReviewID": "UR18287953", "Content": "Great deal at a great price. Kitchen had all i needed. Room was clean and quiet. A close walk to fishing charters, 5min to Ocean beach, 10min to Mission Beach, 10 min to airport, 15 min to convention center. Debbie from the front desk was able to answer all my needs. No complaints.", "Date": "July 26, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "B.C.", "Title": "“Great room and Location”", "Author": "shuster8", "ReviewID": "UR17917400", "Content": "We stayed at several hotels in the last 2 weeks so I will base my review on comparing them. Wow was I surprised to find out our room was a suite! I was not expecting this, and it was a nice change from staying 2 weeks in other hotel rooms only (and for the same price). We stayed for 3 days (2 nights). I have posted video of our room so I guess you can find that in my profile. It was a nice suite, nice couch which pulled out to a bed, our queen bed was comfortable, decoration was nice, nice new windows all around, shower had good water pressure, full size fridge & stove and kitchenette. Our kitchen even had pots & pans, plates, bowls and utensils which had I known I would be in a suite would have been awesome! There was even an in room safe which was great! The marina was a block from the hotel and there was a Jack in the box across the street, KFC, McD's, and Denny's Restaurant really close by in walking distance. Not too far a drive away ( a couple miles) I discovered a Target store and Chillis Restaurant, Red Lobster, Black Angus and another nice BBQ restaurant. The airport was a short drive and there was no close airplane noises. The only thing in the room I personally would have liked would have been dark curtains for the two windows in the kitchen, the blinds let in too much light when trying to sleep and also one of the blinds wasn't long enough on one window as well. But other then that the suite was really nice. The Continental breakfast provided by the hotel consisted of boxed cereal and milk and orange juice and danish only which were individually wrapped so that was nice. We personally would have appreciated a 2nd juice being allergic to oranges and maybe a toast machine with bread or bagels, but having the cereal option for the kids was great! The free breakfast just was not the same scale as a couple other hotels we had been at but still better then 1 of them but the bonus of having the suite out weighted all the other places anyways. They were training a new front desk person when we arrived so I can't comment on the front desk service except that the guy doing the training on July 10 was really nice and professional! I did get annoyed one night with the people above us, I swear they were letting their kids jump up and down late at night and it sounded like a bunch of elephants. I felt so sorry for the maid, she looked young and was by herself to do the whole place - all they have is one small washing machine and one dryer for her to try and do all towels and linen in daily. I don't know how that is possible. I can't comment on the maid service either because I left a do not disturd sign on our door the whole time, which I'm sure she was grateful for. The parking lot is pretty small but it is a small hotel so what can you do...I counted 15 suites but only 11 parking stalls, + 1 Handicap space, so I could see if there was a full house parking could become a problem since the side streets were always full up as well but maybe not everyone comes with a vehicle so therefore parking might be fine. I notice they list 14 suites here, so maybe there isn't 15. I had no problems with my stay and would definitely stay there again if I had to stay in San Diego again. However I can see that they really need to come up with a solution with doing the hotel laundry -There is no room on the property to make a larger laundry area except maybe the little space at the back or maybe they should consider making one suite into a small single room and turning one of the kitchenettes and part of one suite into a decent size hotel laundry room so they can provide clean towels on a daily basis and clean the hotel bedding. At the very least they might be able to get two stacking washer/dryer combo's in the existing tiny laundry room - or prehaps out source their laundry (Maybe that is already what they do with the sheets??? I don't know...) I know I was beside their laundry room and all I ever saw was mounds of towels on top the one machine and no one around. But don't quote me anyways, for all I know they may have another laundry room they use on the upper level??? I'm just guessing they don't though going on the previous person's review of never having their towels changed the whole 10 days of their stay.", "Date": "July 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Rochester NY", "Title": "“Low Cost, Close to Transporation & Sites”", "Author": "MountainMaiden", "ReviewID": "UR17688326", "Content": "The hotel is old, but rooms have had some renovations - new windows and bathroom fixtures. We had requested a unit with an extra couch, but got a unit with a kitchenette. The kitchenette had absolutely no kitchenware. Not even an ice bucket, but the frig and microwave worked. We had to go to the office for paper cups. It was clean when we arrived, but the maid only came once in 10 days to make the bed. On three days we got towels, on other days we had to take our dirty towels to the office and request new ones. Parking lot is really small and hard to get in and out of. Location is phenomenal - walking distance to Shelter Island and 5 minutes from airport. We took the #28 bus for $2 to Old Town and the Old Town Trolley Station. We walked the 2 miles to the airport and took the #992 bus to the Gaslight District so didn't have to pay downtown parking $10 or worry about drinking and driving. I would stay there again. There is not much in the area for dining, just the chain restaurants. It's worth taking the #28 a few blocks to Old Town.", "Date": "July 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "MIssouri", "Title": "“Great Experience”", "Author": "harlam04", "ReviewID": "UR17677062", "Content": "I very much enjoyed my stay at this Inn. I was there in April of 2008. The owners were very helpful and polite. Anything that I needed was available to me. Also, the Inn has everything you need. Wireless internet, hairdryers, kitchenettes, microwaves. It's a great location. The parking lot is small and kind of awkward to get out of, but otherwise this place was really good. The rooms look really nice. My room had a couch, a small kitchen, large TV. This place really is a great price for a great place.", "Date": "July 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mesa, AZ", "Title": "“Cute Little Place, Very Nice Manager...BUT”", "Author": "Jewly84", "ReviewID": "UR16832127", "Content": "My boyfriend and I went there for our anniversary in May. The night we checked in, it was about 11pm when we got into town. The outside appearance and surrounding area was pretty friendly looking and we felt good about staying there. There was one thing that really freaked us out though. There was a car parked in the parking lot with newspaper clipping, blankets, and towels taped ALL over it with clear packing tape. It was the weirdest thing I've ever seen. The next day we saw the owner of the car........she was a middle aged woman wearing just about every piece of clothing she owned, a big floppy hat, and a necktie around her face covering nose. My only guess was that she was paying the hotel to let her park her car there and live out of it...or something. Very strange. Other than that we had a wonderful time and felt perfectly safe and comfortable.", "Date": "June 10, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sacramento", "Title": "“Great for the Budget minded!”", "Author": "weegieSacramento", "ReviewID": "UR16033954", "Content": "Room was clean, staff was pleasant. Location is great! Close to airport, Shelter Island, Ocean Beach, PLNU, Sea World. If you are on a budget, this is the hotel for you!", "Date": "May 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moxee, wa", "Title": "“Enjoyed very much”", "Author": "mhm3741", "ReviewID": "UR15061126", "Content": "My wife and I stayed at the Loma Lodge in 1981 and are planning a return to San Diego in June and plan to stay there again. The year 2004 is incorrect, the year \"1981\" is not an option.", "Date": "April 15, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Lakewood, Ca", "Title": "“Not worth the money”", "Author": "djb3338", "ReviewID": "UR8517966", "Content": "It is a dirty motel. We didn't have maid service we had to go get everything ourselves, towels, toilet paper, coffee, and empty our own trash. Had to borrow a table out of the laundry area because the room didn't come with a table. No batteries in remote control. Way over priced for type of room. Shady looking people checking in and out. Nosy right on main road.", "Date": "August 27, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Oregon", "Title": "“Will not go back to this hotel”", "Author": "Chitra1", "ReviewID": "UR7697771", "Content": "We had booked this hotel room with kichennette for 4 days. Family with 2 kids. There was too much new paint smell in the room and no way to open the windows. There was no furniture nor any kichen stuff. After complaining the hotel staff bought a few stuff from Big Lots next day. Had 1 phone in room with outgoing calls thru operator for a heavy sur-charge. Also, was an incident when the staff was rude to my family folks when they asked for more toilet paper. Also, as I found out the price was not cheap either. There were several others at the same price with better amenities. Also, we were told that there was no pool nor a breakfast. Kids were conting on San Diego warm water pool and very dis-appointed. We cut short our visit by 1 day but te hotel charged for it any way. I am still figting wth them to get some money back. Overall, very bad experience for kids and family. I am now even afraid to use the internet bookng... Never know, what you get. Will never go back there again. Chitra, Oregon.", "Date": "May 25, 2007"}, {"Ratings": {"Overall": "1.0", "Value": "1"}, "AuthorLocation": "Sacramento", "Title": "“Unsafe>>>”", "Author": "kalygurl", "ReviewID": "UR5703177", "Content": "i was desparate cos i booked two days b4 going.... but truthfuly, you can definitely find a better deal.. i dont' recommend this place at all. no parking. not a safe place .. noisy cos we were right by the street.. definitely hooker place.. don't go there.. no matter what.. mean mean mean lady.. who was lazy .. and rude.. she wasn't even there in the morning so we can drop off our key.. got the kitchen to go with it.. um.. wut can i say.. horrible .. no kitchen ware at all.. no pots/pan.. nothing useful.. rusty silverware.. smallest microwave ever... NO AC at all.. the fans were running the whole time we were there.. it was horrible.. the place had a weird odor.. .. oh man.. do yourself a favor.. and don't stay here..", "Date": "August 23, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "3", "Service": "1", "Rooms": "1"}, "AuthorLocation": "San Francisco", "Title": "“I'd rather stay at the Bates Motel...”", "Author": "A TripAdvisor Member", "ReviewID": "UR5476581", "Content": "Occasionally, I read bad reviews and wonder whether the people who write them are simply too demanding. Although I've never written a bad review before, this place screams out for one. Speaking of screaming, check out the parking lot at 3:00 a.m. You'll see shirtless and barefoot hotel \"guests\" revved up on meth and screaming at the top of their lungs. If you are lucky, like we were, a \"guest\" from another room might even wander over and use your bathroom. Most likely, someone was shooting up in hers. I probably could have handled the colorful \"guests\" if the rooms didn't resemble crack dens inhabited by feral monkeys. The rooms at this place gave a whole new meaning to the term \"stains.\" The bathroom even came pre-furnished with the last guest's pubic hairs. After one night there, I'm having myself tested for TB and the plague...", "Date": "July 17, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "San Francisco, CA", "Title": "“Oh, No!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5464427", "Content": "I recently went to San Diego with some buddies for a weekend of fishing and golf. We booked the Point Loma Inn site-unseen, aside from the information we found on the Internet. When we arrived and checked in there were some, shall we say, seemingly shady people staying in one of the rooms...which turned out to be next door to the room one of my friends was ultimately staying in. These people were casing our truck while we were checking in - the first alarm bell. After checking in one of my friends and I were given a room upstairs - except that there was still someone staying in it. After the guy finally wandered out with his stuff (which consisted of the clothes on his back and an extra pair of jeans) he left behind a bunch of fast food trash. The lady at the front counter said that she would have the room cleaned up in 30 minutes. We went to get something to eat and were gone over an hour. Upon our return the room was still not ready. In fact the door had been left wide open the whole time. Again we were told that the room would be ready in just a little while and yes they were very sorry. A couple of hours later we basically had to stay and watch the front desk lady prepare our room because the maid had left for the day. While watching our room upstairs be prepared we hung out out front of our other two friends rooms (which were next to each other on the first floor) and observed a rather interesting parade of people showing up at the Shady People's room. Some were let in and some were ignored. That night the Shady People opened for business. It seems that had, um, \"stuff\" for sale and were up until all hours of the night, much to our chagrin. The next morning we let the lady at the front desk in on the Shady People's activities of the night before, as well as the fact that there were cockroaches in one of my friend's bathroom...and strange fluids on the ceiling...and burn marks on the walls. We asked for our money back for the two nights we had paid for that we were not going to stay - we had no problems paying for the night we had spent there. We were then informed that there would be a $40 cancellation fee charged for our early check-out. Needless to say I would never ever ever ever stay here again nor would I recommend this place to anyone. We found out through the grapevine over the nect couple of nights that this place has a particular REPUTATION in the Point Loma area.", "Date": "July 13, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "San Francisco", "Title": "“Crack and Hookers - no lie!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5459141", "Content": "I'm writting this to warn unsuspecting people who are looking to save money, that this is not the place to stay unless you're looking for rock or hookers; they are fully stocked in this area. The noise all night was out of control and there isn't anyone there at night to control the \"guests\". To top it off, there are NO air conditioners in this hotel. So, you have the windows open all day, with crack heads hanging around, that's just a combination that I don't want to be part of. This is the worst place to stay, I'd rather sleep in a dumpster!", "Date": "July 12, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Duisburg/Germany", "Title": "“Dingy - but overall O.K.”", "Author": "A TripAdvisor Member", "ReviewID": "UR5436970", "Content": "The place really needs remodelling/renovation. Also, the place was not the cleanest place to stay at. Location is certainly a plus. Short driving distance to all major points of interest. Limited free parking was available. There was also a kitchenette. The gas oven was barely usable since it would immediatly trigger the smoke detector. The fridge, coffee maker, etc. were O.K. We had a deal from expedia which cost us around 60$/night (50â‚¬). Overall, if you consider all the other places that are around this is probably not the worst deal you could get.", "Date": "July 7, 2006"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Phoenix", "Title": "“the worst service”", "Author": "A TripAdvisor Member", "ReviewID": "UR5299054", "Content": "Made a reservation on 05/22/2006, and came to the hotel around 4:00pm 05/28/2006. They told me they never got the reservation fax or email from their internet provider. After the lady at check-in desk could not find any available rooms at their partners, she called her manager. The first thing her manage said to me was \"That's no business of mine, ....\". I knew I would waste my time if I tried to get any help from this hotel, then I just dropped the phone and left the hotel. Something learned: 1. always make a reservation through hotel's website. If book a room through other websites, make sure you call the hotel before you get there. 2. always make a reservation at high-reputation hotels", "Date": "June 5, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Louisville, KY", "Title": "“Toxin exposure warning”", "Author": "A TripAdvisor Member", "ReviewID": "UR4335844", "Content": "There are signs posted at all entrances of the hotel warning of exposure to toxins. I would avoid this hotel. The rooms smell moldy and the bed spread and pull out couch had cigerette burn holes in them. We had arranged for the hotel to get discounts for the San Diego Zoo the day before and they did not get them.", "Date": "January 10, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Plymouth, Indiana", "Title": "“Saturday Night Live”", "Author": "A TripAdvisor Member", "ReviewID": "UR3283608", "Content": "I picked this motel based on prior reviews plus I had a pleasant stay last year at sister motel Old Town Inn. I was going to be in the city by myself without a car and needed something inexpensive where I could walk safely around the area during the day and have a short cab ride to the airport. This one fit the bill. I should have been a little concerned when I heard the office is only open from 7 am to 11 pm - no manager on duty at night? I also didn't bargain for the loud 5-hour party in the parking lot and upstairs the first night I got there - I forgot how you can hear absolutely everything in these older motels. The next day I asked for a quieter room further from the office but was assured the noisy party guests were checking out that day and it was much better the 2nd night. The room was clean, personnel friendly, internet dial-up capability, fridge/microwave/cofeemaker/Cable TV. Easy walking distance to Shelter Island, my fave fast food restaurant Jack-in-the-Box, and a grocery store. Would I stay there again? I'd have to give that some serious thought.", "Date": "March 17, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Westport, CT", "Title": "“Great value!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1344521", "Content": "I thought this little motel was a terrific value. The room was clean, roomy, with microwave, small fridge, coffee maker, iron & ironing board and hair dryer. What do you want for $65 a night?? Plus the people that manned the front desk were VERY friendly and helpful. Yes, it's located on a busy street, but the fan provided drowned out all traffic noise. There's often a down side to being in a great location. The price of a little noise was small compared to being near the marina and a $7 (5 minute) ride to the airport. I will definitely go to the Point Loma Inn again.", "Date": "September 18, 2003"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Amelia Island, Fl.", "Title": "“bad investment”", "Author": "A TripAdvisor Member", "ReviewID": "UR1188745", "Content": "The room was dingy. NO a/c. Box fan in closet. Must open window to traffic noise to get air circulation. 72 hour cancellation policy. Better prices at the Vagabond Inn around the corner.", "Date": "August 1, 2003"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Phoenix, AZ", "Title": "“Very quaint”", "Author": "A TripAdvisor Member", "ReviewID": "UR987730", "Content": "Located by the marina I wasn't expecting it to be anything but your basic motel room with bed, bath, and television. but for a decent price I was pleasantly surprised. The room was very clean and had a full kitchen with all the amenities you would need for a long stay. My trip had started out horrible, but I have to say that this hotel made it that much more enjoyable.", "Date": "May 5, 2003"}], "HotelInfo": {"Name": "Point Loma Inn", "HotelURL": "/ShowUserReviews-g60750-d119746-Reviews-Point_Loma_Inn-San_Diego_California.html", "Price": "$79 - $177*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2933 Fenelon Street</span>, <span class=\"locality\"><span property=\"v:locality\">San Diego</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">92106</span></span> </span> </span> </address>", "HotelID": "119746", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/63/8f/638f654803e37eb543c45dcc50bc116b5large.jpg"}}