{"Reviews": [{"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Montreal", "Title": "“A place to remember”", "Author": "J_Legal", "ReviewID": "UR126947878", "Content": "This say was my longest ever in Las Vegas. I'm there on a regular basis for business, so often that I have seen everything on the Strip! I am looking for a place to stay that feels just like home. This is exactly what I have found at this hotel. The apartments are clean, modern and spacious with well appointed kitchen and the convenience of an in-room washer and dryer. Great service, convenient to everything, I will be back!", "Date": "March 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "media, pa", "Title": "“Great value”", "Author": "thealinda", "ReviewID": "UR126925171", "Content": "We were in Vegas for 12 days on business and did not want to stay on the strip. This place was perfect - close enough to everything but also quiet. The rooms were beautiful and clean. Our balcony looked out on the lovely pool which we did not have time to use but it looked great. Breakfast was very good but the dinners were so so. There is a free shuttle to the airport and the MGM. all in all it is a great value.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Great hotel to stay with kids while in Vegas”", "Author": "HikerMom58", "ReviewID": "UR126706625", "Content": "Our vacation had us fly in and out of Vegas. On the inbound we stayed on the Strip and that was enough for us. On the way back we stayed at Staybridge - a family favourite chain. The rooms here are quite lovely and modern. The service was impeccable. We did have one problem...while eating our dinner I started to smell what I thought was tobacco smoke (it ended up being marijuana)...odd as it is a non-smoking hotel. It got stronger so called the desk...the staff came down to check it out and said there had been some concern with the room next to ours. They very quickly moved us and our former neighbour paid his fine ...once again everyone was quick to apologize...but I am getting tired with hotels when you have a problem they figure a slightly larger room and said sorry...the space was not required as within 5 minutes we were all in bed and headed out to airport in the am...no follow-up, no discount, no extra points for loyalty club....", "Date": "March 26, 2012"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Dublin, California", "Title": "“Beautiful Place”", "Author": "AD19EW", "ReviewID": "UR126189491", "Content": "Spacious, reasonable, decent breakfast - great place, highly recommend.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Perfect service”", "Author": "Graham l", "ReviewID": "UR126188500", "Content": "We stayed at the Staybridge Suite and found the staff to be very helpful and attentive.Everyone was so friendly, and the hotel was in a perfect location. I would highly recommend this Hotel for a stay in Vegas.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Ashford, Kent", "Title": "“The best way to do Vegas!”", "Author": "scooterpervy", "ReviewID": "UR126029276", "Content": "Fantastic facility, a short cab ride from the Strip. You could walk it, but who walks in Vegas!? I guess that if you want to be in a casino hotel it would fall short, but as a non-gambler with two teens, the excellent facilities, kitchenette, massive bathroom and superb outdoor pool, combined with a phenomenal 50% price discount, make it a superb location. I would recommend this to all but hardcore party animals, and that's because I don't want them ruining it for the rest of us.....", "Date": "March 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Angouleme, France", "Title": "“Great hotel”", "Author": "Krissy16250", "ReviewID": "UR125962730", "Content": "Lovely clean very comfortable hotel, lovely staff, excellent service! Completely smoke free is a bonus. Comfortable, good sized room with all amenities of an apartment. Excellent choice of complimentary breakfast foods & beverages. In a quiet location away from the strip, which is exactly what we wanted, so a car is necessary. Will stay here again!!!", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Oahu, Hawaii", "Title": "“Free Airport Shuttle, Free Breakfast, and no casino, I love it”", "Author": "Jim L", "ReviewID": "UR125777023", "Content": "Not that there is anything wrong with Casinos, it's Vegas. It's nice to be able to return to a nice quiet lobby, no cigarette smoke and drunk people everywhere. I like that there are all the ammenities of an apartment, it helps on the food costs as Las Vegas restaurants are expensive. I really can't complain about anything except it is off the strip, and there's not much around it in the immediate area.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Excellent Property but car is needed”", "Author": "cobaorbust_12", "ReviewID": "UR125774241", "Content": "This was our first visit to Vegas and the reviews of this hotel convinced us to stay here. We were not disappointed as all other reviews are bang on. We emailed the hotel and requested a Delux King 5th floor on strip side and that's exactly what we got when we arrived. Staff are all excellent and the full breakfast and Sundowner appies we're always very good. The hotel is only 5 minutes from the strip, however, you are always planning around the shuttle that leaves every hour. I would recommend renting a car as we spent too much time in shuttle, buses and cabs. Even though the Staybridge was nice to come home after the gruelling 5-10 miles of walking each day, I think a hotel on the strip is in our plans for our next trip to Vegas.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Always happy with this hotel”", "Author": "Patrick Z", "ReviewID": "UR124895781", "Content": "I had stayed at this hotel at other locations and knew what to expect. The breakfast, the service, location & everything! The even have a free shuttle to the airport and MGM (the strip). Save yourself the hassle if you don't have a car, buy a 24 hr bus pass for $7 and it takes you up and down the strip even to Freemont! The express bus has less stops hint hint! The outlet mall on the north side is better! FYI", "Date": "February 20, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South Mississippi", "Title": "“Pleasantly Surprised”", "Author": "TheBigDaddy", "ReviewID": "UR124799067", "Content": "I basically live in motels due to the nature of my work and this was my first stay at a Staybridge Suites. I was shocked at the level of detail in the rooms. I will now be looking at these properties a little more. While I was there the internet continued to give me problems. When I called the internet provider they would fix it but it always came back. I will stay here again if the internet is fixed. The reason I rate the service low is due to the fact that the property pushes the burden of repairing the internet off on you the customer.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "pittsburgh", "Title": "“trust the reviews! this place is great!”", "Author": "dunkirk2", "ReviewID": "UR123158915", "Content": "Having a full apartment makes all the difference during an extended stay and we used the oven/cooktop /microwave to prepare most of our meals \"at home\". Cleanup was easy with the full size dishwasher. The large fridge- freezer has an icemaker too. Duel sinks in the bathroom, a built in washer and dryer and private balcony are the icing on this delectable condo-cake! The breakfast haS plenty of selections and the staff is super friendly! The shuttle service to and from the strip/airport was another super bonus! WE SHALL RETURN!!!!!!", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Great option inVegas!”", "Author": "MarySP", "ReviewID": "UR123104120", "Content": "This hotel is not located on the Strip (Las Vegas Boulevard), but it's less than 5 min drive from there. In my opinion, it is the best hotel in Vegas if you plan to have a car during your stay. Reasons: 1- It's not one of those gigantic cassino hotels where you have to walk for 20 minutes to get to your room. 2- Parking is free and there's always space - so you don't have to wait for the valet to park and bring your car (and tip him) but you also won't have to drive around for hours looking for a space. 3- Breakfast is included and it is very good. I saw several reviews complaining that they always ran out of items at the buffet, but I stayed there for 10 days, had breakfast on most of them and didn't have this issue. 4- There are no resort fees and wireless internet is avaliable for free. 5- The rooms are very big and even have a full kitchen in case you want to cook. 6- Location is great, you're less than 5 min drive away from the Strip, and because it's not on the strip, you can use alternative ways to avoid traffic. 7- It's not the cheapest hotel in Vegas, but I thought it had a good cost/benefit ratio. The only negative point of this hotel is about their cleanning schedule. They have a police to only fully clean your room once a week - during weekdays they will only replace towels, take off trash and do the beds, and they won't do anything on weekends. That was ok with me, but I think it should have been better planned... I stayed there for 10 days, and they only fully cleaned the room on day 8, when we were about to leave... Not very cleaver in my opinion. I definitly would stay there again. I would only not recommend this hotel if you plan to stay in Vegas without a car. In this case, even though the hotel has a complimentary shuttle (I didn't use it, so I don't know if it's good), I think the best option would be to stay in one of the cassinos on the Strip.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Front Royal, Virginia", "Title": "“Great Off the Strip Hotel”", "Author": "cwousar", "ReviewID": "UR122997448", "Content": "This Staybridge Hotel is a hidden gem in Las Vegas. As a businessman, I wanted a quiet hotel where I could relax and do a little work. The hotel is great. Each room is a suite with breakfast provided. The staff is friendly and very helpful. I will be back.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "San Diego", "Title": "“Not at all what others have experienced - Beware!!”", "Author": "4travelreview", "ReviewID": "UR122895490", "Content": "Based on previous reviews on Trip Advisor, we reserved a room for 2 adults and 2 children. We were told that the only accomodations for 4 were a king bed and sleeper sofa, but that the room would be made up for the four of us. In addition to our written reservation, we also placed 3 phone calls to make sure the room was set correctly. We arrived at 7:00 pm and checked in. The sofa bed was not made up. We called the front desk and were told no one else was working at the hotel except the shuttle driver who was out driving, but on his return, he would come up and make the bed. After waiting 45 minutes to an hour, with still no return of the shuttle driver, we asked for sheets to make it up ourselves. We were told no. No managment on duty until the next day. Hotel room was not very clean. The breakfast buffet was missing several items, supposedly because of machines out of order. Dirty plates and silverware mixed in with the clean. We tried to talk with a manager the next morning and were avoided. After several emails back and forth with no apologies, only blame toward us, they finally took $50 off and removed a pet fee. With a bill for $300, this seems inadequate to say the least. We had been traveling all day and just wanted to go to bed. Instead it took several hours to get sheets thrown over (not even tucked in) a sleeper sofa for our daughters. Our reservation paperwork clearly showed 4 people. The manager's excuse was that they are a \"suites\" hotel with king beds and not set up for families. With no managment or staff other than a desk clerk and shuttle driver on duty in Las Vegas at 7:00pm, they are ill prepared for any guests arrival. With the poor housekeeping in the room and breakfast room, it is very questionable what level of service they will provide at all. Very disappointing after reading other reviews on Trip Advisor. The manager's fall back was to send copies of phone logs which did not accurately portray what my phone calls had even been about and he completely ignored what my reservation paperwork showd. Stay away! Too many good choices in Las Vegas to deal with this poor management and poor service.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nottingham", "Title": "“Great choice”", "Author": "TwizzleNottingham", "ReviewID": "UR122274750", "Content": "We really enjoyed our stay here. We arrived on Thanksgiving and received a complimentary Thanksgiving Meal. The receptionist was very helpful and patient with our questions as this was our first visit to Las Vegas. The room was spacious, spotless, and we appreciated the kitchen. We didnt use the shuttle service ourselves we preferred to walk but others might find it too far. After the madness of the strip it was great to return to some peace and quiet!. Breakfast was excellent with a choice of hot and cold foods which were regularly replaced by efficient staff.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Home, Suite Home”", "Author": "Cherimabrie", "ReviewID": "UR122237591", "Content": "My family and I stayed at this hotel and it was the best experience. We felt so comfortable and with young children that's important. The room decor was current and the cleanliness was impeccable. To top it all off breakfast was amazing. The staff was pleasant and warm when checking in and out of our room. Sales Manager Star Persley helped us book an incredible room with a view of the Vegas strip. The Staybridge is conveniently located near the strip and the shuttle service makes for nice travel to and from the near by casinos. To sum it all up, when planning a trip to Vegas, the hustle and bustle of the strip hotels will have to take a back seat. We will stay at the Staybridge.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“One of the nicest Staybridge Hotels I stayed at”", "Author": "ClevAP", "ReviewID": "UR121421313", "Content": "This hotel is only a few years old. It is very clean, rooms very large, close to the Strip (across the Highway I-15 from Mandalay Bay). Their free breakfast is great. Free shuttle to MGM and airport. I would recommend this to anyone.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "birmingham, UK", "Title": "“Well worth being off the strip.”", "Author": "missbeebirmingham", "ReviewID": "UR120737878", "Content": "All the positive reviews are exactly right about this hotel. It is also fantastic value for Las Vegas (or anywhere in the USA to be frank). The hotel shuttle was a great service, and if we missed it, a cab wasn't so expensive. The hotel was very clean and modern. Room not quite as big as I'd hoped, but luxurious and clean. Nice bathroom, and balcony view. Great swimming pool and jacuzzi. Staff were helpful. Free breakfasts and early bird buffet dinners were good (not usual Vegas strip hotel standard), but what do you want for free! The only negative thing I have to say, is because there are no nearby shops to reach on foot, essentials like water and washing powder (for the laundry room) are a little on the pricey side. But saves hiring a car! Stay here - you won't regret it.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cedar Rapids, Iowa", "Title": "“PERFECT HOTEL !”", "Author": "JetterJ", "ReviewID": "UR120553427", "Content": "This Staybridge Suites is a hidden gem in the hustle and bustle of Las Vegas. Just off the corner of Mandalay Bay it is close enough to the strip to enjoy it without being in that \"strip\" atmosphere. The hotel is incredible- we had a full kitchen as well as a washer and dryer in the room! ( oh yeah- and a full size dining room table with 6 chairs!) The balcony was an added surprise we didn't know about in advance! The front desk was able to meet both requests we had: top floor & facing the strip. It was very neat to sit out on the balcony and take in all the beautiful lights of Vegas at night. The room was spotless. Bed super soft and nice bedding to go with it. The living room had gigantic sectional which allowed us all to stretch out and watch a little TV during down time. The food the hotel offered at both the breakfast AND the sundowner meal was excellent. Especially the grilled burgers and hot dogs. ( both breakfast and sundowner meal included in price of the room) The parking lot was nice and safe - no issues leaving a car parked. Took advantage of the shuttle bus that ran to the MGM every hour whenever possible. We were SO glad not to have to traipse through a HUGE casino to get to our room at the end of a long tiring day. Seemed a little pricey - but was worth the extra money. Will stay there again when we go back to Las Vegas!! PS- forgot to mention: NO lines to check in ( some hotels in Vegas have up to a half hour wait just to check in!) AND no waiting in lines for an elevator to get to room ( AGAIN - HUGE BUSY HOTELS = HUGE LINES TO GET INTO THE ELEVATOR!!) THINK ABOUT IT PEOPLE!! IT BECOMES A REAL PAIN IN THE BUTT !!", "Date": "November 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Laurel, Maryland", "Title": "“Good Stay”", "Author": "KittyChan", "ReviewID": "UR120502520", "Content": "I had to book a Vegas hotel for a weekend at fairly short notice last month, and Staybridge came up on my list of possibilities for Marriott-group hotels offering U.S. Government rates for my dates. I checked the hotel's reviews on TripAdvisor and booked the (very good) rate. I wasn't disappointed. Staybridge is as other reviewers have described: clean, comfortable, and (mostly) pretty quiet. I arrived at noon, and the front-desk clerk apologized that my \"one-bedroom suite\" wouldn't be ready until around 3 p.m.: not surprising, given the hotel's popularity and a weekend stay. What was surprising was the offer of the suite, as I'd only booked the standard king-bed studio. (The clerk said that Staybridge normally upgrades government reservations to the suites when available.) I asked if one of those was ready; it was, and I was on my way. The studio was fine. I was at the end of the hall and thus right next to a stairway, which proved to be much more convenient for parking and quick access to the lobby. (The elevators were located pretty far down the hall.) The room itself, while narrow, was well laid out, with all the good conveniences and features that others have noted: big bathroom, full kitchen, comfortable sitting area, up-to-date LCD TV, and balcony. I even had a good view (over Russell Rd.) of the southern end of the Strip. Staybridge's location is a plus: just west of the Strip, off Russell Rd., in its own quiet little zoned subdivision (as with so much in Vegas). Getting to and back from the Strip was thus a breeze, and there's convenient parking ringing the hotel. I had a rather noisy family staying next to me, but the sound wasn't too bad. Staybridge seems to be a bit bitter than average on this score for its three-star category; indeed, the overall quality and the amenities of this well-maintained four-year old property would appear to justify a four-star classification. Good job, Staybridge.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Wolverhampton, United Kingdom", "Title": "“Alternative Vegas”", "Author": "jezzieboy", "ReviewID": "UR120271769", "Content": "We booked this hotel after reading the many positive reviews and we were not disappointed. The staff are friendly and helpful and the suites large, modern and very well equiped. Cleanliness was also to a high standard. Perfect for a Vegas stay away from The Strip, smoking and gambling free. Ideal as we had a young child with us and really came to Vegas for the Canyon and Hoover Dam, not for Vegas life. Free breakfast was fine with a good selection but we did not try the free dinner option. Free shuttle to and from MGM Grand was useful. Overall would recommend highly with one proviso. We requested and got a pool view suite, which looks over the smart pool area and a couple of similar small hotels and an industrial area. However this hotel is close to the airport and aircraft noise started early and was very frequent during the morning. It woke me several times. This would apply to many hotels in this area and is worth noting if you sleep lightly. Rooms on the Freeway side have a view of the strip and possibly some freeway noise but maybe the aircaraft noise would be less. Other reviewers have noted how quiet the hotel is and certainly internal noise was none existant so it may just be my sensitivity to planes. But this is the only reason I have not awarded the hotel an excellent rating.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "uk", "Title": "“A tranquil retreat from the hustle and bustle”", "Author": "margsSouthYorkshire", "ReviewID": "UR120238378", "Content": "We have just spent 5 nights at the Staybridge and I have not got a single complaint about it. The suite was on the 5th floor with a view of the strip and was spotlessly clean.You can't hear the traffic at all unless you open the patio door.The bed was very big and comfy! No problem sleeping at all.We had washer and dryer, full kitchen- no kettle though - (felllow Brits!) apparently it is not usual to get these in American kitchens! We really liked the pool - it is never crowded and you get complimentary towels on the loungers. There's a smashing hot tub and the saltwater pool itself is warm and kept very clean - we saw the chap checking the water and putting the chairs and tables in order every time we went.You do get aircraft noise by the pool but it didn't spoil it for us at all. The breakfasts are really good to say they are free- as good as any 5 star hotel in our opinion. Hot dishes ( bacon eggs and sausage patties), cereals, fruit, yogurt, toast, pastries plus juice and coffee. We didn't go to the evening meals so don't know whats on offer there. I would recommend the Staybridge to anyone who prefers an \"away from it all\" place to stay with easy access to the Interstate and the Strip. We will return - no question!", "Date": "November 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "atlanta", "Title": "“\"Great hotel just off of the strip\"”", "Author": "123neels", "ReviewID": "UR120162851", "Content": "this is a great hotel just south of the strip. if you need to go to city center or the airport, but don't want the noise, then you have the right place. the hotel is very clean, and the staff are attentive to your needs. The heated saltwater pool has a fire pit on its deck, there are two hot tubs, there are three cabanas that you don't have to pay for. the gym on the second floor is a fairly nice gym for a hotel. the breakfast that is included is very sufficient. I will definitely stay here again. the beds and water pressure are great as well.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "haywards heath", "Title": "“Believe the reviews: this is the ideal base in Las Vegas”", "Author": "ourholiday", "ReviewID": "UR119628667", "Content": "The Staybridge is a great place to stay. It's just off the strip, with a courtesy shuttle every hour, the suites are excellent and we found the reception staff very helpful. The pool is very warm and large, the breakfast fine and the free dinner on Tuesday, Wednesday, Thursday a nice bonus. HIghly recommended overall.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "yyc", "Title": "“Extremely Impressed”", "Author": "yyclhryyc", "ReviewID": "UR119623739", "Content": "I am usually a HIE regular for business. I come to LV often and usually stay on the strip. This was my first time staying off-strip and decided to stay at the Staybridge after reading the + reviews and after a very good stay at a Staybridge in Utah. I booked a regular suite but was upgraded to a corner 1 bedroom king suite as a Priority Club Platinum member. The room has a \"wow\" factor. It is very big and modern. There is a full size kitchen which was great. There even is in-suite laundry. All applicances were hi-end. The bed was extremely comfortable. Two flat screen tvs. View of Mandalay Bay from pation and picture window. Staff were very pleasant and accommodating. Today I will be moving to the Bellagio for a 3-day comp stay, but am seriously consider staying at the Staybridge even though I have to pay. This is how much I love it. If you don't mind staying off the strip or have a vehicle, then I would highly recommend this Staybridge. Parking is adequate and seems secure (not sure if there is security). The only negatives (\"negatives\" is perhaps a bit strong, perhaps \"neutrals\") is that the room was set to 80 degrees when I first came in the room and I immediately turned it down to 68 degrees and after an overnight the temperature only made it down to 71 degrees. There is only one thermostat and 2 vents. The room may be too big. The other comment is that there is no soap dish/shampoo holder in the shower enclosure.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ciamannacce", "Title": "“Extra value stay: very nice staff and very nice room (large, clean,comfortable)”", "Author": "Galera_u_veru", "ReviewID": "UR119599925", "Content": "Close to everything , but located aside from the strip (which was good to us as a family), quiet (no traffic or airplane noise), and very affordable, we had a chance to experience the very kindness of staff because our son got very sick when we stayed there. Half price five star hotel, best bet in Vegas I am sure", "Date": "October 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“More than pleasantly surprised.”", "Author": "wattbro", "ReviewID": "UR119535204", "Content": "Well more than pleasantly surpised to say the least! When my cycling group, Major Motion, booked this hotel as our spot for the Viva Vegas Century ride I immediately checked the website for details; I'm really \"into\" where I stay. The website pics were quite cool and the pricing was on par or slightly better than anything similar I could get with any discount. I called and spoke with Star Persley, sales manager and contact for our stay, to discuss details and my room preference. She was very nice over the phone, totally pumped about the property and certain I'd be pleased...I was very pleased! The location was perfect, close to the strip but not in the mix. The grounds were very well kept and the rooms, I had a 1 bedroom suite, were immaculate! New furnishings with a modern architectural flair, great view of the strip and ample natural light; the patio can be accessed from both living room and bedroom. The kitchen's nicely appointed and the bathroom compliments. All said, I've made this location one of my \"Vegas Favorites\" and would highly recommend it to anyone seeking a location of this type. By the way, the entire staff, day and night, were very cool. The complementary breakfast after the previous days' 100mi ride, also very cool. All said, if you want my advice, stay at the Staybridge! Cheers, Raj", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Can not be beat for value, cleanliness and quality. This is my third stay here. The staff is friendly and accommodating. The poo”", "Author": "CaryNC2", "ReviewID": "UR119300189", "Content": "Can not be beat for value, cleanliness and quality. This is my third stay. The staff is friendly and accommodating. The pool is peaceful and pretty . The rooms are beautiful. I love it here and return again and again. Oh and the breakfast is excellent.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great Find”", "Author": "janeandallen", "ReviewID": "UR119233617", "Content": "We had 2 nights there. Great hotel off the madness of the strip, but just a one block walk to Mandalay Bay Conference Centre, plus there is a free shuttle. We had a one bedroom suite and it was huge. We could have sat 6 for dinner and 8 watching TV. Room was nice and clean, with a fully fitted kitchen. Good free wi-fi. Good pool, although a little noisy with the planes taking off from LAS. Plenty of recliners and some cabanas. Good fitness room, with 2 of the major aerobic machines. Good complimentary breakfast - hot and cold options with fruit. Would stay there again.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Good price ~ Good concept”", "Author": "Gr8erEscapes", "ReviewID": "UR119148527", "Content": "This hotel must be very new as there are a lot of kinks to be worked out ~ with housekeeping being it's weakest point. The rooms are great ~ we had a nicely furnished bedroom, full kitchen, bath and living room. The room was very dusty when we checked in; it seemed that our supplies were replenished on a whim (ex: lots of shampoo but no TP); and, one day, the cleaning of our room was completely overlooked. The kitchen was nicely supplied with glasses, dinnerware, utensils, etc. ~ except there was only ONE pan ~ a frying pan with no lid. (And, the front desk confirmed that this was correct ~ go figure ~ a full-sized stove and only one pan?) The Bond Lounge (on the premises) is open Friday thru Monday for beer and wine and light meals; however, on the Saturday we checked in, they had NO food ~ citing a delivery/order problem. They said they would not have any food to serve until the following Monday. This sort of disorganization and inexperience prevailed and over-shadowed an otherwise nice extended stay concept. BTW, you can get a room with a great view of the strip, but it sits right at the intersection of (busy) Russell and the I15 ~ noisy, despite the dual-paned windows, and rendering the little patio useless. The sound-proofing in the walls is not very good ~ we had a family in the room next door one night and it seemed as if the four of them were right in the room with us. I doubt I would stay here again.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Peaks & Troughs”", "Author": "stanley23913548", "ReviewID": "UR119122272", "Content": "The Good, the Bad & the Ugly in that order If you've got wheels, this hotel is in a great location to take advantage of nearby arterial roads such as I-15, I-215 & I-95. No wheels, no problem. They have a shuttle that transports guests to and from the strip. The hotel has spacious suites that are well equiped and outclass the competition in their class, such as Embassy Suites.The fitness room is bigger than most I've stayed in. But..... Two types of amenities thast are tie breakers for me, are hot-tubs/whirlpools, and a \"full breakfast\". The full breakfast is poor in comparison to the afore-mentioned competition. The staff in this area appears to be limited in numbers. If one member doesn't turn up, then as happened, the full breakfast became continental. The remaining young Lady to her credit, worked like a trojan to try and compensate, but there was still no hot food. On other shifts, people like Adolpho, were very personable and reliable and a full breakfast ensued.. The hot-tubs, of which there were two adjacent to the heated outdoor pool, were cold tubs. The front desk staff weren't aware that they were out of service, and that parts were awaiting. Doesn't say much for the communication between maintenance and front desk. And... Timing is everything with the shuttle service. If you book a return shuttle time that coincides with the time of the front desk shift change, and the fact that you are waiting for the said vehicle as you bake in the afternoon sun outside the MGM, but the handover/takeover doesn't bear mention of your request to be picked up, then as they say, you will be hung out to dry, literally. I can attest to this, and apparently, it's not an uncommon event. If the troughs could be expunged, then this place is great value. However, there is a certain amount of denial by management, and thus I expect similar negative events to transpire. You either want return business, and optimize occupancy levels, or you inadvertantly and unwittingly, become unpaid representatives of your competition. I'd like to return, but a culture change must ensue. If you bring any of these issues to the staff's attention, then those big beaming smiles that greet you on arrival, are replaced by testiness. I know, some of us are just too picky and should be more forgiving, and I'm sure others had better experiences, but last week, I doubt it. As harsh as this critique seems, if this place was firing on all cylinders, then it would be hard to find better value, and it's parent company would be well pleased.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "North Pole, Alaska", "Title": "“Love This Place”", "Author": "Anoini2", "ReviewID": "UR119109697", "Content": "Staybridge-LAS I love this hotel!  I already like Staybridge but this is not your typical Staybridge hotel.  I can now understand why it's one of TA's top-rated hotel in Las Vegas.  The hotel is NOT on the strip which was perfectly fine with me. I would rather stay here than the strip anyway.  It's like a refuge from the craziness of the strip. Check-in was great and we were upgraded to a king one-bedroom suite for being a priority club member.  The room was  beautiful and it overlooks the pool and we had a private balcony.  Our suite had a full size kitchen with everything you need IF you want to cook.  There was even a full size washer and dryer on the suite.  How sweet is that!! Just bring your laundry detergent so you dont have to buy one downstairs.  The bathroom was clean and spacious actually the whole suite was spacious. WIFI had great signal which was great. There was a tv in the living room and one in the bedroom. Checked out the pool area and it was like a mini resort with four cabanas and you are not getting charged extra for it. There was two hot tubs, a wadding pool next to the large pool.  When we were there, someone was painting the floor in the pool area, this place is well-maintained.   Breakfast was great, as expected with Staybridge. I always like their oatmeal and the bowls were larger than the Staybridge I stayed at.  The breakfast area was beautiful and overlooks the pool and a decent size.  They also have a sun downer on Tues, Wed, Thur.  This hotel has very good, not only do you get free hot breakfast, you also get free dinner on TWT.  Plus, free WIFI, great resort like pool and amenities and great service.  The only negative that I can think of was the small dish detergent seemed watered down. The color looked right but it was watery oh and I saw one popcorn on the floor but that's really trying hard to find fault.  I can't wait to stay here again.   For helpful tip: Restaurants:  Japonais at Mirage was amazing, service was great too, I think everything in their menu are all good, you really can't go wrong.  It's pricey but worth it. Also went to Stacks at the Mirage.  Ugh, we waited over half an hour for our seats and the hostess said it will only be less than ten minutes and there were plenty of tables available. Great food though but the service was awful. Qua at Ceasars was great and the Imperial Spa has great body scrub and only charges a fraction of the price than the spas at the Strip. BEST Foot Spa on Rainbow Blvd has the best massage and great rates too.  BTW, these are NOT the happy ending kind of businesses and are legitimately decent.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Gloucester", "Title": "“Excellent hotel at an affordable price”", "Author": "RJ_70", "ReviewID": "UR119094392", "Content": "We stayed here 2 nights and were sorry we didn't have longer. The room was huge and extremely well furnished. The balcony offered a view across to the strip, and although the hotel is a short distance away from the main attractions of Vegas, there is an hourly free shuttle to both the strip and the airport. We particularly enjoyed the pool and jacuzzi after a day of trawling the strip. The complementary breakfast, and mid-week buffet were also very welcome. Would definitely return.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bellevue, Washington", "Title": "“Oasis off the Strip”", "Author": "jstm58", "ReviewID": "UR119090357", "Content": "I read the reviews before booking this property as I wanted to stay away from the Vegas strip but be able to access it. This hotel did not disappoint. They have a free shuttle that runs every hour til 10pm. We had a 1 bedroom suite with full kitchen even though they provide a hot breakfast. Staff is friendly and service oriented. Decor is contemporary and most rooms have tall windows for viewing the mountains and lights of the strip. Our suite even had its own washer/dryer. It was quiet and a good choice for us as we did some sightseeing outside Vegas and their free parking and easy location to freeway came in handy.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lacey, Washington", "Title": "“Superior Business Hotel”", "Author": "wyzik", "ReviewID": "UR118345612", "Content": "My employers' training center is in Las Vegas, and this is one of their recommended hotels. It's easy to see why. The suites are large, very modern, and in immaculate condition. While more of an \"extended stay\" business hotel than what most people think of when they think of a hotel, this property has enough amenities and services to make a stay pleasant. Overall, I look forward to my stays here--it's nicer than some places I've lived!", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "brussels", "Title": "“What a perfect alternative to the busy, noisy strip hotels!”", "Author": "golfedegem", "ReviewID": "UR118086279", "Content": "I stayed here last March and picked this hotel based on the Tripadvisor reviews (as usual) and believe me, I was not disappointed! The hotel is just minutes away from everything you will need. There is a major highway right outside and there was road work at that time, but I never heard the traffic. The breakfast is as can be expected and the suites are spacious and very clean. Of course you need a car and with this highway just in front of the hotel you are just a short drive to the strip, the malles, the factory outlet, the Callaway golf learning center and the airport. Tempus fugit, time passes very fast in Vegas but you'll find some rest in this hotel.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Edmonton Canada", "Title": "“Wonderful Stay at a Great Hotel”", "Author": "TrueNorthFamily", "ReviewID": "UR118016641", "Content": "We spent a week in Las Vegas at the end of August and I wished we had chosen this hotel first. From the moment we walked into the Staybridge Suites I knew we would love it. I had reviewed several hotels before our trip and the Staybridge was one of the frontrunners. On our fourth day we drove here and were very lucky they still had rooms. The previous night they were fully booked. Once we arrived I was greeted by a friendly front desk clerk. I don't remember her name but she immediately made us feel welcome. After our previous hotel, I was hesitant about booking a room without seeing it. The staff were very nice and within 20 minutes showed us two newly cleaned suites. Both were gorgeous rooms. We paid a little extra since they only had two rooms left and chose one of the largest suites. It was amazing. Our room faced the awesome pool. The room itself was large and spacious. Main features were a full size kitchen, washer/dryer, dining-room table for four, large living-room sectional which made into a bed, large LCD TV, separate King bedroom with another LCD TV, en-suite with double sinks, nice sized tub, separate bathroom with toilet, shower and sink. There also was a small balcony with 2 chairs and a small table. I only wish the door came with some instructions on how to lock/unlock it. Figuring that out was a challenge. The room was clean and stocked with a couple items like coffee and a small bag of popcorn. We cooked a few nights in the room which was great but the range fan is not vented outside. It just blows into the room. ? The king bed was very comfortable with higher quality bed linens and great pillows. Finally I was able to get a good nights sleep. This was a welcome surprise and much needed. The pool is salt water which surprised us. My kids were not so sure about it. One hated it but soon became used to it, loved it and never wanted to leave. All this despite the incredible heat. It is fairly deep for little children but is really great for emerging swimmers. The shallow end is about 3 1/2 feet and dips to around 5 feet. There is a ledge around the whole pool which was great. The pool is large and was never crowded. There is a section that is shallow and is nicely designed with a waterfall feature. Just behind the waterfall are showers and bathrooms. One thing to note is the Staybridge keeps their pool area clean and the pool water is checked every morning. I saw someone out each morning performing pool maintenance. There is also an abundance of pool loungers with towels on each one, and patio tables with umbrellas to enjoy. One thing I should mention is when outside it is fairly noisy from airline traffic. It is so loud at times you cannot hear the music playing around the pool or one another for that matter. This was an okay trade off for us since we loved the hotel, the pool and the staff. A great thing about the Staybridge is the free breakfast in the morning. They also have a few nights a week where they serve light supper but we missed those. At any rate, the breakfast is hot and served fresh in the morning. The dining room is nicely decorated and is kept clean. At the buffet you could find eggs, omelettes, biscuits, sausages, bacon, fruit salad, fresh whole fruit, hot oatmeal, coffee, tea, juices, milk, yogourt, waffles, bagels, bread and muffins. The staff was very nice, the patrons were equally as nice and you couldn't ask for a better way to start the day. This hotel is in a great location too. It's located southwest of the Mandalay Bay. It's close to the highway with easy accessibility to many places and is only minutes away from the airport. The Las Vegas Town Center, and both the North and South outlets are only minutes away. Not far down the highway west is a larger outdoor mall area with a Walmart and other stores. I believe it is called Arroyo Center. Housekeeping consists of emptying trash, refreshing towels and making beds. If you're staying for 7 nights or more, they'll do a more thorough cleaning. One thing to note is on weekends there is no housekeeping unless requested. We stayed over a weekend and I have never experienced this type of service or lack of service before. I can make my own bed and rehang my own towels but I really could have used some cleaning supplies for the sinks. For the price you pay for this hotel a light cleaning included with the housekeeping would have been nice. Other than housekeeping concerns, we really enjoyed our 4 night stay at this hotel. In future trips to Las Vegas, we will definitely stay here again.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Beijing, China", "Title": "“Perfect Accommodations!”", "Author": "ciscospudd", "ReviewID": "UR117564425", "Content": "I travel frequently both professionally and personally, and I will say that our experience at the Staybridge Suites in Las Vegas has been top-notch. First impressions go a long way and when checking in at a hotel you can learn a lot based on your interaction with the staff at the front desk. During check-in, Jody was professional, friendly, knowledgable, and succint. Kudos Jody and thank you for your time. The second impressions that you usually get at a hotel is the room itself, and at the Staybridge in Vegas, I will say that it is one of the cleanest hotels I have ever stayed. Additonally the rooms are spacious and more than adequate for a stay in LV whether you are visiting for business or vacation. Our room had a great view of the various hotels and the neon lighting on the strip, sans the hustle and bustle of the strip! The A/C worked excellent and we were in LV during the hottest month ever recorded. The hotel offers hourly shuttle services to the strip (MGM); this is a 12 minute endeavor. We caught a show at the Caesars Palace (Rod Stewart) and used the courtesy shuttle. The driver was a safe driver, and personable. We did catch a cab home from Caesars to Staybridge and paid $15.00 which included a tip just to give you an idea of taxi prices. The bottom line: I would highly recommend Staybridge Suites for your LV endeavors and will stay here again the next time we visit.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Salt Lake City", "Title": "“Wonderful, you will be pleasantly suprised.....”", "Author": "Jeffrey H", "ReviewID": "UR117299353", "Content": "As a business traveler who stays in hotels approximately 275 nights a year, I have to honestly say that this property is everything a business traveler could ask for... In room laundry facilities, full kitchens and large spacious upscale suites as well as the most convenient access to all locations in the Las Vegas valley. I have been staying at this property when in Vegas since May 2009 when I happened to discover it. I had stayed at most all other properties in Vegas previously, and always choose this property now when in Vegas... The staff of courteous professionals are outstanding and make it a priority to make you feel at home. If staying in Vegas short term or long term on business make sure to contact \"Star Persley\" in sales. Star is wonderful and most helpful in assuring your reservations and accommodations are perfect for your individual situation. This property is perfect for the long term, short term business traveler as well as family friendly for the vacation travelers or professionals during the transition phase of re-location. If you have stayed at other Staybridge locations in other cities around the country, you are in for a pleasant surprise, as this property is unlike any other I have stayed at (and I have stayed at many). This property was originally built as a timeshare (as I have been told) and affords all the comforts of home. You will not be disappointed...", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Stafford, United Kingdom", "Title": "“Brilliant hotel, better than Desert Rose Resort.”", "Author": "latham_10", "ReviewID": "UR117110797", "Content": "Really lovely hotel. Looks new and very clean rooms. Everything you could need. Great buffet breakfast. Lovely pool area which was always quiet. Would come here again.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Jupiter, Florida", "Title": "“Great hotel for business or leisure”", "Author": "rtvbiztrav", "ReviewID": "UR117043924", "Content": "Very comfortable hotel and a great value. Easy access to the \"Strip\". All suites are large and very comfortable with full kitchens and washer/dryer right in the room. Even balconies which is rare for Vegas. Hot breakfast every morning and dinner TWT nights. Nice pool area too. Friendy helpful staff, and very thorough housekeeping.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Conroe, Texas", "Title": "“FANTASTIC!”", "Author": "letsgo l", "ReviewID": "UR116995076", "Content": "Great use of room very spacious! Breakast every day and dinenr 3 nights a week. FANTASTIC place for the crowds. Pool is excellent", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Boston, MA", "Title": "“Wish I could've stayed longer!”", "Author": "bostechboy", "ReviewID": "UR116894908", "Content": "This is a great hotel. Located close to McCarren Airport, it provides great views of planes coming for a landing - they seemed to be at eye level as they approached the airport flying by, but they were far enough away so as not seem noisy. The sruuite was gorgeous, clean, and modern.staff is very friendly. I paid under $100 per night to stay at what seems like a 5-star hotel. It's not located on the strip, which s nice if you want the option of being close to the strip, but don't want the noise. Highly recommended.", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Alberta", "Title": "“Had a bigger room than last time”", "Author": "CS6", "ReviewID": "UR116438778", "Content": "Bit weird in that it had three sinks, in fact four if you count the one in the kitchen, but it was a huge room. But anyway the reason I'm writing another review is that I was definitely right about the pillows, they are on the hard side and harder than average for an IHG brand hotel. No idea why, but I brought my own pillow with me the second time. Also I had a hell of a job locking the door to the patio. But anyway these minor niggles aside it is a great hotel, shame about the roadworks.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“elegant room & no bedbugs”", "Author": "travelmystic", "ReviewID": "UR116287367", "Content": "In a city where bedbugs are the \"hidden\" secret. This hotel is bedbug free and really understands the travelers fear of bringing the little buggers home. Our one bedroom king suite on the top floor was spotless, beautiful and an easy walk to the casinos. we liked it so much we booked a night for our trip home, rather than staying with family. The room we had on our return trip was a studio and although smaller was just as nice. The marble entry, huge bathrooms and fully equipped kitchen with granite counters and comfortable beds are well worth the price.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Fort Worth, Texas", "Title": "“Absolutely Awesome!”", "Author": "Babs200", "ReviewID": "UR116280180", "Content": "We spent the last two days of our vacation to the Grand Canyon in Las Vegas. We found this hotel by using our priority club points for the room. This is one of the best hotels we have ever stayed in! Our suite had a full size kitchen with refridgerator, dishwasher, range and stackable washer and dryer. There was a separate dining area with a table and six chairs and a large sectional sofa in the living room. The flat panel t.v. was a nice size on a large cabinet with plenty of storage for clothes, dvd's etc. Directly off the living room is a walk out balcony with lounge chairs and a small table. Our view was the Las Vegas strip just across the freeway from the hotel. We chose a room with a King size bed. There was another nice flat panel t.v. in the bedroom. The bathroom had a generous size double sink vanity with a deep soaking tub. In a separate room was another vanity with a walk in shower and the toliet. If pressed for time, two people could take baths at the same time since there is a shower and tub. We really enjoyed relaxing in the spacious bathroom. We've had better hotel breakfasts. The eggs were cold and rubbery. Other food items were ok but nothing special. The fact that it's included made it tolerable. The hotel had a beautiful pool area that we unfortunately did not have a chance to use since our time was limited. When in Las Vegas again, we will definately stay at the Staybridge Suites again!", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Brunswick, GA", "Title": "“6 weeks here was nice”", "Author": "mrlittlejohn", "ReviewID": "UR116157862", "Content": "Let me say that this is a great place to stay. Very comfortable rooms. Very well equipped. Easy location in and out of. Let me tell you about the 2 dissappointing factors. 1) I was there on business. This is a long term stay facility. And when there on business, DO NOT expect good internet service. Their speed factor is right on par with dial up. I complained several times. They just responded like they have NEVER heard about this problem. I even tried the CAT5 cable connection and no change at all. As a matter of fact, my company has between 15 to 20 paople staying here all the time. Every person in my class and other coworkers staying there said the same thing. I guess if they acknowledged the problem, it would not annoy me so much. 2) The pool was very nice and relaxing, but the hot tub was broken several times while there. I would report it and then 2 days later it was still cold. I would report it again and they would have to go out and verifiy it, as apparently it was not believed or not accepted as not being warm. It was down probably 15% of the time during my 6 week stay there. I would reccommend this place to anyone, don't let my knit picking of the 2 things stop you unless they are your primary concerns. Mike", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Atlanta", "Title": "“Very nice hotel off the strip”", "Author": "FMeister", "ReviewID": "UR116113602", "Content": "We stayed at the Staybridge Suites the night before dropping our rental car off at the airport for our flight home. It was perfect. Parking convenient. People friendly. Room was clean and comfortable. Nice (free) breakfast. We'd stayed on the strip before heading to Utah for a few days and Staybridge allowed us to get to the airport without the complications of the crowds and parking issues of the strip. Plus, it was less expensive. No casino, which didn't bother us, but they provide shuttles to get you to the gambling, shows, etc., if that's what you came for.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Edinburgh, Scotland", "Title": "“Perfect for the family in Las Vegas”", "Author": "tankengine", "ReviewID": "UR115939374", "Content": "We chose this hotel in Las Vegas based on TripAdvisor review. So glad we did. This is the perfect base for Las Vegas especially if you have younger children. We had a lovely one bedroom suite, which had a full functioning kitchen. It also had a washing machine and dryer. Bonus. It's not located on the Strip, but just a short drive away. This makes it quieter. We made use of the free breakfast. A couple of hot choices and fruit and pastries. A couple of nights you can get a free meal. The interaction with staff were all positive and helpful. Would we use this again when in Vegas, a big yes.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Honiton, United Kingdom", "Title": "“Very impressed”", "Author": "Mountain300", "ReviewID": "UR115737735", "Content": "Arrived 20 Jul 11 for 3 nights. On arrival we recieved a free upgrade, our room was 325. I have only used the staybridge suites in the UK so it was interesting to see what the differences would be, we were not dissapointed unlkie where we are now in Staybridge at Annaheim, LA. I agree with all the positive cooments made by other travellers. It is slightly out of town but when you have been on the strip all day this is welcomed break. Very modern, nice and quiet. Using the shuttle to the MGM is easy, a quick call to book your pick up when you have had enough. A taxi costs approx $15 dpending on where you get picke up from. Would definetly stay here again if we come back to LV. The highlight of our visit for me was the Belagio fountains at night, I could stand there for hours.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Bruxelles", "Title": "“Good deal for money”", "Author": "NicsiBruxelles", "ReviewID": "UR115590289", "Content": "An excellent choice for a calm place in Vegas. Rooms are ok, not top of the rock, but good enough for a family stay. I really appreciated breakfast served in real cups and dishes and not the standard throwaway. A touch of class that you find only in higher level hotels.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Baden. Switzerland", "Title": "“We loved it and want to go back!”", "Author": "FlyingHirsch", "ReviewID": "UR115510803", "Content": "Fantastic value. The suite was huge. Two bathrooms, one with shower/WC/basin and the other with bath/2 basins. The bath plug was, however, broken. When we reported this they sent someone up to fix it within 1/2 hour. Washing machine & tumbler in the room. Separate lounge area (open plan with the kitchen) with corner sofa, TV, and telephone. New kitchen with microwave, dishwasher, oven/hobs, freezer/fridge, plenty of cupboard space! Bedroom had a big bed and TV, side table and chair, wardrobe, telephone. We had a balcony with 2 chairs and table overlooking the pool. The pool was clean and big enough for a short swim. There were clean towels on each sun lounger. During the week there was a complimentary buffet dinner between 17:30 & 19:30; although they took time to refill the serving dishes and there wasn't a huge choice. Breakfast was included: a good range of choice and good quality. Located within walking distance of \"the strip\", they also offer a complimentary shuttle to the MGM Grand on the hour.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "2"}, "AuthorLocation": "", "Title": "“not sure what all the fuss is about”", "Author": "us_guy_in_uk", "ReviewID": "UR115411074", "Content": "Stayed here for 7 nights in Feb/Mar 2011, based on the TA reviews. Yes, the rooms are expansive (and not very expensive), but aren't all hotels like this in Vegas? Maybe not. Only stayed in Vegas on one other occassion, and that was the MGM Signature, so maybe I was spoiled on that trip. (Now that is a GREAT hotel!) Loads of room in the Staybridge Suites, great kitchen if you want to do your own meals. Breakfast is defintiely NOT great -- mediocre at best. It is away from the strip, so that's either a possitive or a negative. A good hike if you want some exercise. The free shuttle runs once an hour in both directions, but I did have an issue with the hotel on one occassion when I called ahead to schedule a shuttle coming back from the strip and, in spite of that, they left without me. 2 minute walk to the Crazy Horse III Club if you are into that. (Be careful of the VIP rooms there -- will cost you an arm and a leg!) Probably would not use the Staybridge Suites again -- like I said, nothing special here.", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "DC", "Title": "“Very quiet and will be back”", "Author": "Miss_Icey", "ReviewID": "UR115131873", "Content": "My first time to Las Vegas and I am happy that I booked my hotel reservations with StayBridge. It is a hotel that is away from the strip, but close enough that if you wanted to walk to MGM you could (about a 15-20 minute to MGM and a 10 min walk to the famous Welcome to Las Vegas sign). Free buffet style breakfast in the morning, you pay for dinner. Free shuttle that takes you to the strip, drop-off and pick-up at the MGM Grand and it runs every hour and the last shuttle is at 10pm or 11pm but you can catch a cab back or take the bus which drops you off 1 blck from the hotel at Mandalay Bay hotel. Shuttle does NOT pick you up from the airport, but it will drop you off at the airport when your stay is over. The hotel rooms are very clean, it is the size of a 1 bedroom apartment, I had a balcony that faced the strip, and I could see Mandalay Bay hotel and the lights from the strip at night. Flat screen television in the bedroom and living room area, huge bathroom with double sinks, full complete kitchen and the bonus was a washer and dryer that you could use for free but you had to pay for your own detergent which was fine for me. The only time I intereacted with the hotel staff is when I checked in, used the shuttle and when I went to have breakfast but it was a hi/bye type conversation, except with the shuttle driver, I forgot his name, but he drove the shuttle during the day and he was great when it came to a conversation. The pool area is great and the hotel gets extra points for the cabanas. When I went to the pool, it was only 5 of us out there and it was wonderful and very very peaceful. If you do not like noise and want to stay away from the strip, this is the hotel to stay at. The hotel really accomodates business professionals and a older mature crowd that wants to leave the partying, clubbing, loud noise etc. etc. at the strip and not bring it back to the hotel. Also pets are allowed at the hotel for a fee I believe.", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Loved it”", "Author": "liveinasuitcase", "ReviewID": "UR114933726", "Content": "All the good stuff people write about here is true. These were condos that when the market tanked that were turned into a hotel. I’d wanted to take the stainless refrigerator home. Washer/dryer in your room. It’s like staying in a nice, big vacation condo. It was very clean too. This was nicer than the Bellagio or Paris. It reminded me of the Signature at the MGM but nicer. There are even cabanas at the (uncrowded) pool. How likely are you to get a free cabana at the Strip hotels? If you are “over” the Strip but need to be close to it to go to work, you’ll really enjoy here. The Courtyard right next door is nice too - I’ve stayed there too. The first shuttle in the morning to the MGM can be a tad bit unreliable but not enough to cause you any problems as long as you stay on top of it.", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Ontario, California", "Title": "“Business and Comfort”", "Author": "CAgrand", "ReviewID": "UR114916566", "Content": "I stayed here for business for one night. The rooms are not only roomy, but they provide many of the comforts of home with an extra sitting room as well as a kitchen. Modern and practical design make the visit a pleasure. The only negative was that there was not many choices for eating nearby. I was hard pressed to find a fast food restaurant within a few miles. They do provide phone numbers if you want to order in.", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Lovely suites, quiet location, great breakfasts, free shuttle”", "Author": "TravellingAussieMum", "ReviewID": "UR114658939", "Content": "Liked this hotel very much, found rooms to be spacious, clean and modern, with quality fittings and furniture. As others have noted, nowhere to eat in walking distance, or places to buy food to prepare in your room, but free shuttle to the Strip overcomes these problems. Breakfasts were fantastic, with fresh cooked hot items, lots of fruit and cereals, and eating in lovely dining/function area. Our kids slept on the sofabed in the sitting room, which was a good option for under twelves. Excellent swimming pool and helpful front desk staff. Suites were few and far between (and expensive!!!) on the Strip, so found this to be an excellent and low cost alternative, and we appreciated the quiet location at night. Laundry facilities in room a great bonus for travellers.", "Date": "June 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "johnjosephdonovan", "Title": "“Contemportary, Comfortable, Not so convenient”", "Author": "johnjosephdonovan", "ReviewID": "UR113357220", "Content": "I stayed here with a number of colleagues in January 2011 (attending a Trade Show) and though it was a little far from the Exhibition we were attending, the location certainly made for a good nights sleep. The rooms are very ample, in the style of Staybridge Suites across the US and include a kitchen. Didn't get to use the swimming pool (it being January) but it looked like it was well kept. Front desk staff were very helpful.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Great place to stay if you don't need to be on the Strip”", "Author": "Cuterunninggirl", "ReviewID": "UR113129785", "Content": "Beautiful suites, nice pool, huge variety of complimentary breakfast choices, and nice exercise room for a hotel. No complaints about this hotel located about a mile from the Strip. CLEAN & classy!", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Fabulous Place!”", "Author": "BuyBuys", "ReviewID": "UR112495175", "Content": "We are currently staying here on vacation for 2 nights with our kids and we love it! We have a king suite and it is perfect for us. We love that it has a washer and dryer, beautiful kitchen and a big sofa sleeper. We also love the dinner in the evenings. But, I think it's only a few days during the week. The breakfast is good for a hotel chain. We also are glad that there isn't a casino here so it's calm and peaceful. Highly recommend this place. But, don't tell anyone so you can have the pool area all to yourself! :)", "Date": "June 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Gijon, Spain", "Title": "“It's not a hotel, it's home”", "Author": "rafa_friends", "ReviewID": "UR111381354", "Content": "I just spent 6 weeks with my family there and we didn't want to leave. The suite has a large bedroom with direct access to the balcony. Bed is very comfortable. The living room is larger than the one in my own house with a large sofa which is also a double bed. There are two large LCD TVs, complete kitchen with even washing machine and dryer. Big tub and also a shower. Our room had views to the Strip and the highway but windows are soundproofed enough so noise it's not an issue. Besides, you could even go walking to Mandalay Bay so the Strip is really close. There is a shuttle service to the Strip and the airport though. Complimentary breakfast is good and they serve also a \"social hour\" dinner from tuesdays to thursdays offering pizzas, burgers, sandwiches, etc depending on the day. Great swimming pool including two hot water whirpools and quite well equipped gym. If I had to complain about anything, it would be the Internet connection speed which is topped at 0,5Mbps which is not enough for streaming video or skype videocalls but, at least the rate is stable. Without any doubt I'd come back again.", "Date": "June 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Western NY", "Title": "“Great accomodation OFF the strip but accessible to the strip!”", "Author": "Sedonamoon", "ReviewID": "UR109875486", "Content": "Stayed here for 2 nights before heading off to Zion & Bryce. There is a shuttle to the strip (it drops off/picks up @ MGM) but the shuttle's last trip is @ 10pm. You will need to grab a taxi after that. I would recommend getting a taxi from Mandalay Bay (the closest spot on the strip to the Staybridge) - it will run you about $10 (depending on what you tip). You could walk but it requires going over an expressway overpass & there is some construction going on in that area & the sidewalk is a bit broken up. It was VERY windy when we where there & the walk was not pleasant - hence the taxi ride the next night! The rooms were very clean, quiet, & spacious. The breakfast was fantastic with lots of choices for everyone - I really appreciated the fresh fruit, hot oatmeal, & yogurt. The staff was always very pleasant, professional, & helpful. I hope not to have to go back to Vegas again but if I do - I wouldn't hesitate to stay here again.", "Date": "May 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "melbourne", "Title": "“excellent hotel a little away from the action, EXCELLENT POOL.”", "Author": "david77melb", "ReviewID": "UR106163006", "Content": "We stayed recently for 5 days. its a new hotel hence everything is new. One of the best feature was the heated pool. We have stayed in a few hotels around the world including 5 star hotels. This pool was excellent, it beats most of the pools that we have seen. A large clean pool with a large pool for kids and 2 (yes 2 ) spa's. The best part was that it was empty most of the time and we had the pool to ourselves. The second best feature was in built washing machine and a dryer in the room \"YES IN THE ROOM \". It had a full kitchen ( electric hotplate / oven / microwave/fridge/sink/granite bench top etc). Clean rooms. good service. Good Bfast. Kitchen staff good and helpful front reception. 3 computers (internet)with printers helped a lot ( unfortunately one got stolen while we were staying) but it still had 2 computers so no need to wait for your turn. It was away from the main strip which we knew and chose it due to the kids. If you have kids or don't want to stay in the main strip then this is a good hotel. You have to have a car to stay in this place as its a on the other side of the highway I15. But if you have come for the glamour and want to stay \"where the action is\" then this is not the place for you. It also has a reasonable sized fitness centre. David.", "Date": "April 29, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sacramento, California", "Title": "“Hair in shower, bathroom, stepped on a screwdriver left behind”", "Author": "jpcrash", "ReviewID": "UR105081804", "Content": "This hotel must have complained to tripadvisor to get my review removed but I'll try it again. This is a legitimate review. The location is a pretty good location and fairly new looking hotel. I'm a platinum member of Priority Club which is the top level in the IHG reward program system. I used my points for a free stay at this location and it did not meet overall expectations. There was hair in the shower and bathroom including poop particles on the back of the toilet. All the luggage carts squeaked and squealed very badly, like that annoying grocery cart. Stepped on a screwdriver left behind by maintenance or previous guest, either or would be pretty bad. Left the screwdriver with a note for housekeeping the next day. Left at 5AM and asked night employee about manager contact information and maybe a little bit of breakfast to go in the AM. He gave me the hotel phone number and told me to call later and employee wasn't able to even give me a banana to go. Other brand hotels are more then helpful when it comes to this sort of thing. I contacted guest relations (corporate) and they didn't help me very much either. They acted like my business wasn't of value, and I'm supposed to be considered on of the more valued guests because I am a platinum member. The hotel didn't refund my points used or even offer me a free night for a future stay to try and get my business back. I'll be back in the area in June but will be spending my week at another hotel. So much for $1500 of revenue going to staybridge.", "Date": "April 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Evergreen, Colorado", "Title": "“If I could live here I would - seriously...”", "Author": "Travelin_Man069", "ReviewID": "UR104429432", "Content": "Stayed here at a colleagues recommendation and they were spot on. This place wasn't a hotel room - it was more like a luxury apartment! Polished stone floors, kitchen was stocked with everything you would need to cook a full course meal including full size stainless appliances, all dishes and place settings, etc etc, full size dining room, washer and dryer. I just cant say enough. I'ved stayed at hotels all accross the US some five times as expensive as this one that don't even come close to this. The next time I'm in Vegas (and I will be) there is no question at all where I will be staying!", "Date": "April 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Still the best value hotel in Vegas”", "Author": "mitchellaustralia", "ReviewID": "UR104305401", "Content": "This was my second family trip to Vegas in 2 years and we did not hesitate to book the Staybridge once again. The hotel is just off the strip at the south end but is only 5 mins away by car. The rooms are quiet and clean and do not not smell of smoke like all the ones on the strip. There is free parking and a free breakfast provided as well. On Tues to Thurs nights there is also a free light meal in the dining room. Access to the outlet malls at the North & South ends of Vegas is very easy from the hotel. I booked a few months in advance from Australia and asked for a strip view room. When I checked in a few hours early the friendly staff had my requested room ready. The room featured bedding for 4 people, huge bathroom, balcony, kitchen and most importantly for us a washer/dryer combo. This is still the best value hotel in Vegas.", "Date": "April 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "El Paso, Texas", "Title": "“May I move in! There should be a Staybride Suites in every city.”", "Author": "Dejoma", "ReviewID": "UR103334855", "Content": "I've stayed at a few Staybridge Suites on the East coast, but they have out done themselves in Las Vegas. Separate living and sleep area, two flat screen televisions, full kitchen, washer and dryer in the room and a balcony. Only paid $93 for the night. Only negative would be the distance away from the strip. I will definitely return if I'm ever in Las Vegas again.", "Date": "April 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Great rooms, ideal for long stays”", "Author": "trx899", "ReviewID": "UR102384815", "Content": "Huge rooms, with kitchen, washing machine, dryer and terrace with a reasonable price", "Date": "April 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Vancouver, Washington", "Title": "“It's All True”", "Author": "kumtux", "ReviewID": "UR101678857", "Content": "I selected this property based upon the Trip Advisor ratings. It is indeed a very remarkable hotel-- clean, quiet, large rooms designed for extended stay. But makes a great weekend vacation condo! I have no complaints and plan to stay here again next year. since my vacation is not focused on \"The Strip.\" Rates are very competitive.", "Date": "March 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Southern California", "Title": "“Excellent hotel for business in Las Vegas”", "Author": "SoCal_Visitor", "ReviewID": "UR101530006", "Content": "New and polished. Condo-like rooms. Great staff. Good free breakfast and light dinner during the week. On the opposite side of the freeway from the strip, in an area of hotels and commercial buildings; not exactly pretty, but convenient. Not much within walking distance. A convenience store is a block away, but tends to be filled with semi-seedy people.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Awesome Staybridge! Beward of traffic/construction noise.”", "Author": "frekwentflier", "ReviewID": "UR100784042", "Content": "Simply put, this is one of the nicest hotels I've ever stayed at! I basically got a 1 bedroom apartment complete with full kitchen (stainless steel appliances!) within site of the Strip! Amazing! Everything about the hotel was perfect. It's new, the rooms are great, the check in & breakfast areas very nice, and very important, pretty fast wireless Internet! The room even had a balcony with a couple of chairs. Great for hanging out in the evening! The pool area was wonderful! They have both a hot and a cool tub jacuzzi. I took advantage of both as much as possible. The only downfall is the location is very close to I-15, so if you get a room facing that way, there will be a lot of traffic and construction noise. It was worth it to me to have a view of the Strip, but in hindsight, I wish I had asked for a quieter room. While I did not use it, they do offer a free shuttle to the MGM so you can get your gambling fix. From now on, unless my company doesn't give me a choice, this is the hotel I'll stay at in Vegas!", "Date": "March 20, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "chelmsford", "Title": "“great hotel”", "Author": "suejessex", "ReviewID": "UR99683341", "Content": "Stayed for 4 nights at the staybridge, very clean, very friendly staff, breakfast great. would recommend them perhaps next time have a car as we had to use taxi's a lot.", "Date": "March 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Salisbury, Indiana", "Title": "“Quality Staybridge”", "Author": "JimCrall", "ReviewID": "UR99120143", "Content": "The rooms were very nice, new, and they even had an oven and laundry machines right in the room. No smoking allowed in the rooms, but they had a balcony, so no worries. It's very close to the strip, but not too close, so the traffic was bearable. I stayed here for 3 weeks, and the staff was very friendly.", "Date": "March 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Las Vegas' hidden gem!”", "Author": "DebbieT", "ReviewID": "UR99037700", "Content": "This off-strip jewel is everything the other reviewers said it was. Clean clean clean, with housekeeping that I swear, I NEVER saw, but always did a wonderful job. One of my traveling partners said \"We must be the only people on this floor, it's sooo quiet!\" I related this to the desk clerk who laughed and said \"Thank you for telling me that, we're actually at 100% capacity!\" Completely furnished kitchens were extremely convenient to this budget-conscious trio of travelers. We were able to make a grocery stop which allowed us to save a ton of cash. Business center had three computers to use, never a wait. Fast connections. WiFi worked well, but the password changes every Sunday. Free breakfast was substantial, well-presented and tasty. We were present for one Tuesday night's fare as well, tacos and make-your-own burritos and cheese nachos. There was always something for the dieters in the crowd as well. Great stay. Great rooms. Great staff. Feel comfortable that you chose this hotel!", "Date": "March 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Michigan", "Title": "“Best hotel I have stayed at.”", "Author": "Colesmom", "ReviewID": "UR97359818", "Content": "The staybridged suites in Las Vegas is a terrific hotel. Lobby, hallways, rooms are super clean. Our suite was huge. Could not hear any noise from hallways and very little from the road outside. Terrific breakfast in the morning and a small evening meal on thurs (also in tues. And weds. but we weren't here). Nice shuttle to the strip every hour until 10 pm. Would definitely stay at this hotel again!", "Date": "February 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Alberta", "Title": "“Nice hotel, if you can find the entrance.”", "Author": "CS6", "ReviewID": "UR96466739", "Content": "Bit tricky to find the entrance, there are currently roadworks on Russell Road. Without a GPS I think you'd miss it to be honest, plus the signage on the road into the parking lot isn't the clearest either. This is a more upscale hotel than the average Staybridge Suites, the regular room I had was larger than at other Staybridge Suites I've stayed at. The bathroom is perfumed which I didn't like, reminded me of going into A&F at the mall. It is quiet with good sound insulation, so I couldn't hear I-15 at all even though it was so close. I could just hear aircraft landing at the airport (my room was east facing) but it wasn't loud enough to cause any issues with sleeping. Room had proper HDTV, which was nice, but the internet connection was pretty slow. The bed was the standard Holiday Inn set up, but I wasn't impressed with the pillows, I had a choice between hard and really hard, which was unusual. It is close to the strip but not on the strip, which is good, imv. If I go again I'll take my own pillow though.", "Date": "February 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Moss, Norway", "Title": "“Wonderful!!!!!”", "Author": "lf-Norway", "ReviewID": "UR94912203", "Content": "Our second stay at this hotel! Will not consider another next time either. LOVE IT!", "Date": "January 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Pacific Northwest", "Title": "“Clean, safe, and quiet with good service”", "Author": "travelerduo", "ReviewID": "UR94700177", "Content": "The Staybridge Suites are new and gleamingly clean, and I found the hotel to be a welcome respite from the dark, smoky casinos and the noisy Strip with hucksters every few feet. The staff people are courteous and helpful, and there is a tiny shop that sells snacks and items travelers tend to forget to bring along. The complimentary breakfast is generous and varied, with fresh fruit, scrambled eggs or egg white, toast, bagels, waffles, cottage cheese, jalapenos, yogurt, milk, hot and cold cereal, juice, and hot beverages. Tuesday through Thursday evenings there is a free (!) small but adequate buffet. All of the complimentary meals are welcome, because it's not all that easy or inexpensive to get to the Strip or to anywhere else for meals. The free shuttle runs once an hour, but only to the MGM Grand, and taxi fares can add up. With some planning, you can work it out so that you're near a restaurant when you need to be. There is no free shuttle to the hotel from the airport, but the hotel shuttle is free from the hotel TO the airport. The fare from the airport was around $18, before the tip. The room was super clean and quiet. The shower head was plenty strong for good hair washing, and free Internet access was available. The kitchen was well stocked, with plates, mugs, glasses, and sliverware, plus a dishwasher, fridge, and microwave. It might even have had an oven. I was relieved to stay there and not on the strip, in spite of the inconvenience of going out for lunch. On the other hand, there are a couple of menus in the kitchenette for places you can order from. The prices are reasonable. It takes 45 minutes from the order to the delivery, possibly less.", "Date": "January 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Columbia, Maryland", "Title": "“Great stay at the Staybridge”", "Author": "agentchris", "ReviewID": "UR93530641", "Content": "As many others reviews have stated, the Staybridge Suites is a great non-Strip option in Vegas. It is just of Russell Street at the south end of the Strip, near Mandalay Bay. Having stayed on the Strip before in a large Casino Hotel (MGM Grand & Monte Carlo) it was nice not having the crowds and noise to deal with. Rooms at the Staybridge are great, morning breakfast was much better than average and best of all was the staff at the hotel. I found the internet connection to be better than many hotels and there is a nice business center and fitness room with high quality equipment in the hotel. I would recommend a car though it is not necessary with the shuttle service and cabs. Unless you need to or want to be on the Strip I would highly recommend the Staybridge Suites as a great alternative. Chris", "Date": "January 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Iowa", "Title": "“Pleasant experience and good value”", "Author": "Fuzby", "ReviewID": "UR92766458", "Content": "We selected this hotel based upon previous reviews, and were not disappointed. We are non-gamblers (coming to the area mostly for hiking), so weren't motivated to pay the higher prices for glitzy casino hotels, but wanted to do a bit of sightseeing and dining on the Strip, so didn't want to be too far away. Staybridge is within easy access (we could see all the lights from our room), and they have an hourly shuttle to the Strip if you don't want to rent a car. Our suite was quite spacious, with a well-appointed full kitchen, two large-screen TVs, and even a small washer and dryer. It overlooked a busy road, so there was traffic noise, but the heavy curtains helped block light and noise, and we slept well. Free wireless access and breakast were welcome perks. Nice & a good value!", "Date": "January 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Gaithersburg, Maryland", "Title": "“Excellent Hotel, Excellent Value”", "Author": "ResearcherMD", "ReviewID": "UR92356511", "Content": "This hotel was perfect for us our recent trip to Las Vegas. We had a one bedroom suite with plenty of room to spread out. The kitchen enabled us to keep leftovers in the fridge and make coffee in the morning. When we wanted to relax, it gave us the space to not step on each other. I do recommend that you have a car and utilize the hotel's free parking. All the casinos have free self-parking, and a car gives you the flexibility to go off the strip as well, without paying for taxis. You cannot easily walk to the strip from the Staybridge, but we did not care because we had a car. The Staybridge deserves the rating it has on Trip Advisor, which is what got us to stay there to begin with. The staff is very friendly and helpful. We would definitely stay there again.", "Date": "January 9, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Branchport, New York", "Title": "“This is one nice hotel deserving of its high rating”", "Author": "oldgoat1", "ReviewID": "UR91163045", "Content": "I often don't trust Tripadvisor reviews . I see good reviews for horrible hotels and wonder who wrote them. However, the Staybridge Suites in Las Vegas earns its good reviews honestly. My original stay in Vegas was supposed to be 6 days long at the Silverton. But after 2 days, I had enough of that place. I went to the Staybridge Suites in the morning, and asked to see a room. An assistant manager(Maria?) gave me the full blown tour of the hotel. I was treated like a special person. I couldn't wait to finish my vacation there. The desk person was nice, patient, and gave me probably one of the nicest rooms they had, even though I had no idea where the good locations were. She gave me a 5th floor corner room with an unbelievable view of the Strip and the mountains that ring Las Vegas. The breakfast each morning had everything anyone would want, and the evening reception Tueday through Thursday was pretty ample. Most of the larger suites have their own washer and dryer, but the studios don't. The Staybridge has washers and dryers that guests can use for free. That was a first for me. The shuttle ran almost hourly to the MGM, and you called for the shuttle to pick you up 15 minutes after the hour. There was also shuttle service to the airport. The location was great too. Two convenience stores within walking distance, and a small mall with a Whole Foods right around the corner south on the BLvd. Great great customer service and good location make this an outstanding choice for a Las Vegas stay.You won't be sorry.", "Date": "December 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“As good as the reviews say, if not better!”", "Author": "seriocomic", "ReviewID": "UR87246393", "Content": "We chose Staybridge Suites as an alternative for the Wynn Las Vegas for our remaining two nights in Vegas to go a little cheaper and a little quieter and we were so happy that the reviews here on TripAdviser were right. Clean and comfortable rooms, amazingly helpful and friendly staff, free Wifi and breakfast, free shuttle to the MGM and airport (awesome!). Read the other reviews and trust me when I say that if you don't mind being a mile off the strip then this is the place to stay. TIP: Check with desk staff before ordering delivery as the premises are subject to leaflet-droppers who sneak menus under your door.", "Date": "November 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Carlos, CA", "Title": "“Great place to stay”", "Author": "2taxworkers", "ReviewID": "UR86468577", "Content": "We just stayed there for 5 nights as we were attending a convention in Las Vegas. We were definitely surprised at how beautiful and spacious the room was. They offer a daily breakfast, which was not gourmet, but it hit the spot and was included in the price of the room. Also there was an evening light supper, from Tues through Thurs. The food was actually pretty good 2 of 3 of the nights. The pool and hot tubs were absolutely lovely, heated to the right temps. The staff could not have been nicer, throughout the entire place. One thing that bugged me - the air conditioning vent blew right on me when I was in bed. I wish they would have located that somewhere else! Other than that, it was a nice respite from the hustle and bustle of the strip. We will definitely stay here again, and recommend to others as well.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "San Francisco, California", "Title": "“Wow!”", "Author": "shario", "ReviewID": "UR86270431", "Content": "Unfortunately we only stayed one night at the Staybridge but it was so great we didn't want to leave! Where to begin...we were coming from a business conference so had a ton of laundry to do and it was wonderful to have a washer dryer in our room so we could just put the clothes in and leave instead of doing them at a laundromat or paying hotel laundry prices. The washer is a little tricky and took awhile to figure out (I think you push the lock icon-don't remember exactly what we did but it wasn't broken like we thought it was). There were two flat screen tvs in our suite. The kitchen was very well appointed, including a dishwasher. We even had a little balcony, not that there was anything to see except a few police actions. The only downside of this place is the location, which is off the Strip. It is best to have a car or you'll spend a bit of money on cabs. I heard there is a shuttle but we didn't notice it while we were there. There is a nice little fitness center, 24 hour market (where you purchase the detergent if you need it), free breakfast and internet. We could have gotten a cheaper hotel but after you add up all the extras, and no resort fee, this hotel was a bargain. It was great for us because we were going on a road trip the next day so we were able to avoid Strip traffic and get right on the highway. Highly recommended.", "Date": "November 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kansas", "Title": "“Another great stay at the Staybridge”", "Author": "mss09", "ReviewID": "UR85731523", "Content": "We just got back from a 4 night stay and again what a fantastic hotel! So nice and quiet being away from the strip. We were able to check in early and the front desk even called later to see if everything was to our satisfaction.Our room was facing the east so enjoyed watching the sun rise in the morning and the lights of the hotels in the distance. Shuttle takes you to the MGM hourly and it is within a long walking distance. Rooms were big, nice kitchen area, big bathroom with great shower, comfortable bed. Breakfast in the morning was sufficient enough to start the day. Overall would definitely stay here again.", "Date": "November 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jersey, Channel Islands", "Title": "“As good as everyone says, and more”", "Author": "BigSkySam", "ReviewID": "UR84704002", "Content": "I booked a two night stay here in October 2010 based on the previous reviews, and I am very glad I did! I was able to get here within 10 minutes of leaving the airport. Checking in was nice and easy, and the young lady on the desk (I believe her name was Mercedes, apologies if I have that wrong) phoned to check everything was ok. Great service! The room itself was spacious, elegantly furnished and had a compact but perfectly equipped kitchen. The bed was comfortable, and I had no problems with my feet sticking over the edge (I'm 6'10'' and that happens a lot). The bathroom was as close to perfect as it gets, with a great shower that had excellent water pressure. Lots of towels of every different size too. My room was on the 5th floor, right by the sign on the freeway side. I could only hear the cars (And the planes taking off) with the door open, didn't have any problems hearing them when I fell asleep. Wireless Internet was good, no problems with signal strength or speed (I managed to Skype call without any issues). The car park was secure, with a regular security patrol on the grounds. There was also a little fitness centre, that had a good selection of cardio machines. On my first night I went to see the Blue Man Group at the Venetian (See separate review on that one). On the way back, I stopped at a Target and bought some supplies (As I was going to be driving up to Northern California a few days later). Consequently I came back with a few 12 packs of Mountain Dew, some water and other bags. I was able to make it to the lobby with these, but not much further. A hotel employee named Eduardo offered to help, and assisted me with carrying some of the items up to my room. He was extremely helpful, and even refused when I offered to tip him. I was very impressed by this! I checked out early on Saturday morning, and this was done promptly and efficiently by a very helpful employee (I believe her name was Myra). Overall this hotel is a real gem. Ok, its not on the Strip but its no less than 10 minutes away by car. In all honesty, its actually better that its away from all the mayhem. I'd describe the Las Vegas Strip as an assault on all your senses at once, so the Staybridge Suites is a little oasis of calm away from it all. Highly recommended.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saskatchewan", "Title": "“Great relaxing hotel in Vegas”", "Author": "Colleentraveller", "ReviewID": "UR82901459", "Content": "This has been our second time staying at Staybridge Suites in Vegas and once again it was a great experience. The hotel is very clean and quiet unless you are at the pool and there will be airplane noise. The rooms are big and very clean. The pool area was never busy and again clean. The staff was very pleasant and responded to needs very quickly and courtesiously. The location is great if you have a car since there is easy access to the I15 and the 215 highway. Stay here and you will not be disappointed.", "Date": "October 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Virginia", "Title": "“Great service and wonderful rooms”", "Author": "luvtravel023", "ReviewID": "UR82719202", "Content": "We stayed here for only one night of our 8 day trip to Vegas and Southern Utah. We arrived early for checkin and they had one of our rooms ready. Since we had to wait an additional hour for our second room they upgraded that room. (It was still before their published checkin time). Very nice rooms with balconies and beautiful kitchens. We had a problem with our TV in one room and with the Washer/Dryer in the other room. They were there immediately to fix the problems. Very nice staff! We would definitely stay here again.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Henderson, Nevada", "Title": "“The only thing that could make this place perfect, if it was on strip”", "Author": "Henderson_NevadaKen", "ReviewID": "UR81663602", "Content": "If all Staybridge suites are like this one I wouldn't want to stay anywherre else Full Kitchen baloncy living room. free breakfast every morning Dinner tues thru thursday every week. a great tropical looking pool two hot tubs very relaxing only problem there wi fi was down most of the time. it didn't brother me. You would have to dirve if you wanted to see Las Vegas strip. Rates are very reasonable for what you get.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "san diego", "Title": "“Very nice place I'm 21 brought three min...”", "Author": "atm619", "ReviewID": "UR80370558", "Content": "Very nice place I'm 21 brought three min pins they have the best pet policy, and they have comlientry breakfast Lund and dinner, room was seruper clean cool and bed was comfy pool is nice, not too busy place and if your looking for more of a party place maybe not, very happy stay for three nights if you gonna be more than that this is cool cause it's like a condo,", "Date": "September 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Milan, Italy", "Title": "“Simply perfect and beautiful!”", "Author": "Raffasworld", "ReviewID": "UR79784243", "Content": "There are so many pros for this hotel and I can't still believe why people should go to any hotels on the Strip! we booked a king guestroom with a balcony and the room...is not exactly a room but an apartment of medium size. huge living room with the kitchen, beautiful bedroom and huge bathroom. everything is super clean too. the balcony is large and very nice if you like to breath some fresh hair at night. our room was facing the big road and the Las vegas skyline. Even facing the road, the room is very well isolated and no noises at all inside. Check in was fast and smooth, breakfast is very good, simple but extremely fresh. The staff was very kind, we asked for a late check out at 3pm and they said right away yes at no charge! it's really a gem and the best part is the pool area... it closes at midnight and it's very clean and quite. Any \"cons\": very hard to find, maybe for this hotel you have to rent a car (we did and parking is for free...). I heard the hotel has a shuttle that can bring you to the Strip but I don't know better for this service.", "Date": "September 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cambridgeshire", "Title": "“Don't overlook Staybridge Suites”", "Author": "TimboCambridgeshire", "ReviewID": "UR79560156", "Content": "Whilst this hotel is off the strip, the free shuttle bus, the fabulous rooms and the deserted pool made the hotel perfect for our stay. There is a little aircraft noise and the smell of aviation fuel (subject to wind direction) although this must be consistent with other hotels this end of the strip. If you want to return to some peace at the end of your hectic 'Vegas' day you couldn't fail to find this hotel just the job!", "Date": "September 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Scotland", "Title": "“Out if the way but nice hotel”", "Author": "sheridan_10", "ReviewID": "UR78690161", "Content": "The only one issue with the hotel was its distance from the main strip. But with shuttle buses running regularly it wasnt really a problem. The rooms were lovely, big and very clean. The only one issue we had was that when the prepared their complimentary meals, there were no vegetarian options, meaning we had to do without. Apart from that the stay was very nice.", "Date": "September 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "East Anglia UK", "Title": "“Brilliant like having your own hotel”", "Author": "dannma", "ReviewID": "UR76657444", "Content": "Just spent the last 3 days staying at this hotel and really am struggling to find anything wrong with other than minor detail that the shuttle bus stops operating at 10.15pm which in Las Vegas is really early. As other people have said the hotel is out of the hustle and bustle of the strip and situated on the Dean Martin Strip which allows you to easily get from one of the strip to the other without much traffic. The rooms are fantastic and look like they have just been remodelled. Everywhere is clean and tidy. The staff are the most helpful we could have come across and the breakfast is great. Pool is lovely and warm and throughout our stay most times had the pool to ourselves. If you want lots of people, noise and traffic don't stay here. If you want calm relaxing environment with hourly complimentary bus into MGM stay here. Please don't tell too many other people about our secret gem.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Birmingham", "Title": "“Lovely suites in quiet location just off the Strip.”", "Author": "TwoTripsters", "ReviewID": "UR76552886", "Content": "Booked here because of mostly excellent reviews on tripadvisor and we wanted a bit of peace and quiet away from the Strip. We certainly were not disappointed in any way. From the moment we entered the lobby we were treated very well by the courteous and helpful staff. Even though we were early, our excellent suites were ready for us. Everything was of the highest quality and for our convenience. After reading a recent negative review about the noise from the nearby airport, we completely disagree with what was said. Our suite faced the airport and yes, if we were on the balcony in the 106 degrees temperature then, we could hear the planes and watch them as they took off. But they were not very loud at all. When doors and windows were closed we barely heard a thing from outside, including the nearby roads and all slept really well. The hotel serves a daily complementary breakfast which is varied and offers a good choice. Also on Tues, Wed and Thurs evening a light buffet which is also complementary is available.. A regular shuttle service is available to the Strip. We definitely would recommend these suites to anyone and only wish there were many more others around the USA, with as good value and service as these.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "PA", "Title": "“Nice Hotel! Highly Recommend.”", "Author": "Parklandmom", "ReviewID": "UR74464442", "Content": "I stayed here on August 7th with my husband and teenage daughter. In my opinion, it earns its rating as #2 hotel in Vegas. The rooms were nicely done and very spacious. Full kitchen, king size bed, balcony. This is a great hotel if you do not want to stay directly on the strip. They have shuttle service, or you can rent a car or get a cab to whereever you want to go. I would definately stay here again.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Good value and convenient to Strip”", "Author": "ttraveling", "ReviewID": "UR73330264", "Content": "Stayed one night with children ages 10 and 12. The one bedroom suite was very spacious. Not sure if the kids would have been comfortable for more than a couple nights on the sofa bed but it was fine for our short stay. Our balcony overlooked the road but street noise was not a problem for sleeping. Free breakfast is fine with 2 hot entrees, waffle station, cereal, bagels/toast. Staff was very friendly and the pool was adequate and not at all crowded mid-day. Not much within walking distance; we had a rental car so did not use the shuttle. I recommend this hotel for those looking for a quieter place off the strip.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Amazing Room with All the Amenities Right Off the Strip”", "Author": "FITfalcon", "ReviewID": "UR72953855", "Content": "I stayed at this hotel for about 30 days and it was, hands down, the nicest room I have seen for less than $100 per day. I spend approximately 48 weeks/year traveling for business. For a long term stay I haven't seen a better room than this in a chain hotel. The room has everything you can possibly want, including a full kitchen with new stainless appliances and a washer/dryer. The bed was great and the curtains were very thick. I worked night shift (7pm-7am) and slept during the day. I never woke up from noise inside or outside the hotel. Pretty good considering the airport about a mile away. They also have an excellent fitness center. The free breakfast buffet was a bit better than par. The location was excellent; a 5 minute ride to the strip, airport and any shopping/restaurant. I wish every place I went had a hotel like this one", "Date": "July 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Perfect but rent a car”", "Author": "NatashaLitmanen", "ReviewID": "UR72896657", "Content": "The services, the room, the staff and the meal was great. Recomended but If you want to go to this hotel you need to rent a car... simply. It's not so near of the center.", "Date": "July 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zandvoort, The Netherlands", "Title": "“Terrific”", "Author": "nederlandse_toerist", "ReviewID": "UR72729508", "Content": "We stayed here for 3 nights in August last year. This hotel is simply perfect: very pleasant and comfortable, remarkably friendly staff, great swimming pool. Excellent location, away from the frenzy on The Strip (which is 5 or at most 10 minutes by car) and also not very far from the airport. Good enough breakfast buffet. Night shop at the gas station a little further on (couple of minutes walk). Gym with a view on casino hotels on The Strip. At the check-in we got a (unasked-for) upgrade to a stunning room with separate bedroom (incl. a big flatscreen), huge bathroom, fully-equiped kitchen, dishwasher, and even a washing machine and dryer. We only payed about 130 dollar per night (incl. taxes and breakfast). In fact, it was an apartment in which one could easily stay a couple of weeks. We were overwhelmed by it's luxury. Extremely agreeable.", "Date": "July 28, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Australia, Hunter Valley", "Title": "“Just beautiful”", "Author": "jollyies", "ReviewID": "UR71716473", "Content": "Our stay at Staybridge was just perfect. We were very tired and grumpy when we got there from the long drive from LA and I was dissapointed that our room doesn't have a washing machine.(at that time i didn't do too much shopping and I had no clean clothes left). Anyway, the nice lady downstairs gave us a great upgrade to a nice big suit with kitchen, big bathroom, lounge room with a second tv(first big tv being in the bedroom). I need to mention that the room had a balcony where you could enjoy either the view of the strip or the view of the pool. I prefer the view of pool (and the montains). We spend one night in a room with the strip view and we had to move because the AC didn t work to my husband expectation(i didn't agree with that anyway). There is a shuttle that takes you to the strip, nice breakfast(we didn't wake up for it too much for it though). If I will ever go back there I will go at Staybridge 100%. Oh, I forgot to say: the beds are sooooo confortable.", "Date": "July 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Excellent hotel!”", "Author": "salbot", "ReviewID": "UR70331314", "Content": "This hotel is brilliant! I think it is the best hotel I have stayed in! The rooms are amazing - massive with kitchens and big bathrooms and 2 TVs. Very clean and staff were really nice. The breakfasts were good too. It was also nice that the hotel didn't have a casino in it! There was free internet and wifi and a pool which was never busy. They provide a free shuttle bus every hour to the strip which takes about 5 minutes. They also pick you up from the strip and bring you back if it was before 10pm. We returned later than that every night so we just got the deuce bus to Mandalay Bay hotel - last stop for the bus and then walked to the hotel which took about 15 mins. This walk was fine at night as it wasn't blazing hot! I would definitely stay here again and recommend it.", "Date": "July 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tupelo, Mississippi", "Title": "“Best stay for off the strip lodging.”", "Author": "AE_Man76", "ReviewID": "UR69900413", "Content": "We always use Holiday Inn hotels to accrue points and was tickled to find this nice, new hotel off the strip but close enough to see everything. We were upgraded to a balcony room with a view of the mountains and the strip. The hotel ran a shuttle at the top of each hour to MGM, and a taxi to Mandalay Bay was only about $10-12. On Thursday, we had free soup and salad and each day offered a great breakfast. My wife and I would take some bagels and peanut butter or such to our rooms and enjoy a \"free lunch\" as well. The pool was great and rarely used by others. The rooms were very spacious and nicely done. Cleaning service each day was good. Also, a great fitness center! Best choice we made in Vegas.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "melbourne australia", "Title": "“Impressed, highly recommended, would stay again & again”", "Author": "mumdadand2kids4", "ReviewID": "UR68030499", "Content": "What a fantastic place. There were 4 of us, 2 adults, 2 young children and it was quite spacious. The rooms were of high quality, very clean and modern. The kitchen was of high quality, with all you need to get by. Didn't cook there, just made sandwiches, warmed milk, snacks etc Bathroom was really spacious and clean. It was so easy staying there. We had a washer/dryer in our room which was priceless when our little one required a change of clothes so often! The staff were very friendly, but service was very slow when we requested linens for the sofa bed on our first night (after almost 18 hours of travelling, 15hours in the air)- it took them almost 1 hour to bring up the linens. High speed internet was reliable and the business center was great, the gym looked fancy too-wish I had time to use it! Included breakfast was convenient-although basic, but more than enough for a simple breakfast. Parking was easy, with multiple access to the building from different areas (so every parking spot was a good one). Impressed, highly recommended, would stay again & again", "Date": "June 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amsterdam", "Title": "“Still a wonderful choice for off-strip stay”", "Author": "cag18", "ReviewID": "UR67672456", "Content": "My girlfriend and I just returned from an extended stay in Las Vegas at the Staybridge. We had visited for a couple of nights last June and decided to return this year, to really spend more time in LV to enjoy the weather and local entertainment. The suites are spacious and very well presented. The kitchens have everything you need, and as long as you are not in one of the small studios (dont waste your time in them) you will also have in-suite laundry facilities. We chose the king-bed suite again, and had more than enough space. All very clean. Excellent value. The swimming pool is a very nice size, and is never busy. At its busiest during our stay we shared the pool area with 5 other people. About 495 less than if we had been staying at the Bellagio. The hottubs are a nice i treat for after sunset. The hotel has ample parking right outside, and the shuttle bus will take you to the strip at the top of the hour. Driving to the strip is also very easy, and self-parking at any of the bigger hotel/casinos was always very easy. Taxi rides back to the hotel should not set you back more than about $15. Breakfast does the trick, with plenty on offer, and on Tue/Wed/Thur you can also pickup a complimentary evening meal down in the breakfast room/lounge. We were treated to some nice BBQ treats one evening. Perfect pre-gambling snack! Perhaps the best thing going for the Staybridge LV is the wonderful service provided by the very willing staff. From reception through house-keeping, we were always greeted by smiles and a friendly hello. Everybody seemed to take pride in their job, and helps keep it running very smoothly. I was very happy to find the ever helpful Eduardo still working there. I am very pleased to say that this hotel is still as great as we remembered from 2009. Yes, a pool view room does also result in quite a bit of noise from planes when they take off towards the west from McCarran, and yes I am sure the air conditioning in the rooms could be a little quieter (tip: cool the room well before bedtime and then turn it off for the night), but regardless, I would always look to stay here if I was wanting to be just a short ride away from the strip. If the glamour (and chaos) of staying on the strip does not appeal to you, then I suggest you check out the Staybridge Suites on Dean Martin Drive. C.", "Date": "June 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "redditch united kingdom", "Title": "“Great hotel rooms and breakast excellent shuttle service to stip very poor”", "Author": "bluenose6", "ReviewID": "UR67253283", "Content": "The good news the hotel ..quality size of rooms fatastic,the breakfast could not be faulted the staff keep everything very clean ,ok you say whats the problem.well its this booked from the UK for seven nights the shuttle service was a very important factor as the Hotel is off the strip and dont take any notice of anyone who tells you can walk into the strip you gave to cross a busy motorway three times I did once,you take your life in your hands ,the Staybridge do not encourage you to use the Shuttle sevice it does not run on the hour as advertisedyou request it 9times out of ten its not available....... whilst on the other hand there are two marriott and one holiday inn right opposite who do run on the hour every hour until midnight ...my advice to anyone coming from the UK check out the Marriott and Holiday inn on DEAN MARTIN DRIVE,if a shuttle service is an important factor in booking the Staybrige Suites", "Date": "June 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Budapest", "Title": "“Close to the airport, good value”", "Author": "Boldizsar", "ReviewID": "UR66587479", "Content": "We arrived late evening from Europe and went to the national parks early morning therefore we needed a hotel close to the airport. It was a 10 minute drive. It is not far from the strip either, we could see Luxor and Mandalay Bay from our window. Of course it is too far from anything to walk but very convenient to go to the highways. The building is together with two similar inns I think you can find a room without reservation. The rooms are clean, look new, spacious with a full kitchen, bed was comfortable, no noise from the street. Wifi was free. Our only problem was that the breakfast started too late at 7.30. It is OK if you gamled the whole night but not if you start your tour early. We would not stay here for a Las Vegas experience but for one night it is a very good choice and value.", "Date": "June 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“Great hotel just off the strip! Highly Reccomended!”", "Author": "DC413", "ReviewID": "UR66235022", "Content": "We decided to stay here for our first trip to Vegas based on the recommendations from trip advisor and that I was able to get some free reward nights. We were not disappointed. All the staff was extremely helpful and nice. We arrived at 11:00am, and although our room was not cleaned, they said they would start on it right away and it would be done in an hour. We came back an hour later, and the room was ready as promised, 3 hours before check in time! There's a lot to like about this place. As mentioned before, all the staff were extremely helpful and nice. The rooms are suite style and very spacious, clean and contemporary. The full fridge and washer/dryer came in handy. The free breakfast was also wonderful, with both hot and cold choices. Not having to pay for breakfast every morning can be a big money saver. The hotel also has a shuttle that runs to the MGM every hour until 10pm. We used it almost every day. The hotel is basically across I-15 from Mandalay, and while not on the strip, it is definitely walkable if you don't mind walking a couple miles. We walked home from the strip every night with no problems. The pool area is also very nice, and doesn't have the party scene of most of the large hotel/casino pools. With 2 hot tubs, and large swimming pool, and cabanas, it was easy to relax and enjoy the quiet pool atmosphere. Perfect for escaping the craziness of the strip. The excercise room was also very large and well equipped with dumbells, weight machines, treadmills, stair steppers and a strip view. There really isn't anything to dislike about this hotel. I'd recommend a pool view room if you plan to spend time on the balcony though, as the balconies on the strip view rooms are noisy due to adjacent I-15 (the noise was not an issue inside the room however), and the view is of the backside of the strip so not that impressive. Staybridge really is the perfect place to stay if you want to relax away from the casino hotels and craziness of the strip while still not being too far removed from the action.", "Date": "June 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“A fantastic hotel away from The Strip”", "Author": "Wolin", "ReviewID": "UR64883119", "Content": "We really enjoyed our stay. The staff are great, our suite was very clean and spacious; it had a balcony with table and chairs, washer and dryer and a full kitchen. This was topped off by a big comfy bed. Breakfast was really good; eggs, toast, fruit salad, juice ++. The free shuttle to The Strip ran every hour. I recommend this for any stay of more than a few days.", "Date": "May 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Norwich", "Title": "“Fantastic Value”", "Author": "Sicall", "ReviewID": "UR60887963", "Content": "Chose this hotel due to the reports on this page and i wasnt dissapointed. Not only are the rooms, spacious and beautifully appointed the facilities are excellent as well. The pool area is very well designed and the dining room that serves breakfast in the morning is a refreshing change from most American chain hotels. The staff were very friendly and helpful throughout our stay. The location is easy to get to from the freeway and the strip. If you want somewhere that doesnt have a slot machine in sight this hotel comes highly recommended.", "Date": "April 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Michigan's Upper Peninsula", "Title": "“Looking for a great stay while in Vegas?”", "Author": "LakeshoreLady", "ReviewID": "UR60777165", "Content": "My husband and I spent a week at the Staybridge Suites and couldn't be happier. I use Trip Advisor for all of our travels and chose this hotel because of the great reviews. This is definitely THE place for extended stays while in the Vegas area. The hotel is situated only minutes from The Strip, but offers travelers a quiter, more restful place to enjoy their vacation. Our suite wa a one-bedroom, with living room, dining room, kitchen and bathroom - all very nicely furnished and immaculately clean! The suite offers nice amenities, such as a balcony with table and chairs, upgraded toiletries in the bathroom, 2 flat screen TVs, free wireless, in-room washer and dryer, icemaker ( a must!), dishwasher, Whirlpool stainless appliances, and ample space to move about. The staff is both accommodating and cordial - very attentive to the traveler's needs. The free breakfast buffet includes scrambled eggs, bacon, sausage, oatmeal, dry cereal, toast, muffins, bagels, cheese omelets, biscuits and gravy, waffles with strawberrirs and cream, juices, coffee, a variety of milk - including soy, and all the trimmings. On Tuesday through Thursday nights, a complimentary light supper is also offered...this included Taco & Nacho night, Soup & Salad night and Pasta (with salad and garlic bread) night. And it actually tasted good! I highly recommend this hotel to anyone looking for a good value, comfortable accommodations, and quick and easy access to The Strip! The hotel does offer a shuttle to MGM Grand, which is a great starting point for visiting The Strip. No worries about booking your stay here - you won't be disappointed!", "Date": "April 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Best Non Strip hotel by far”", "Author": "Drizz1129", "ReviewID": "UR59779686", "Content": "This place is amazing! The rooms are top quality - clean, modern, fresh, and with a full kitchen too! I asked for and received a studio suite facing the strip - the view was amazing at night with all the lights from the strip. We even had a lovely balcony that was great to sit on after a long day on the strip. The pool and Jacuzzi area was great as well, never over crowded like the pools on the strip, and such beautiful landscaping and facilities. The best part had to be the complementary breakfast and evening dinners. Such a money saver! If you were here with a family, it would be perfect. The breakfast was always fresh and each day they had new options. Dinners were tasty, but I would not call them gourmet. Still, it’s all free! They also had a free shuttle going to and from the strip. I would go back to this property in a heartbeat.", "Date": "March 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Toronto, Ontario", "Title": "“GREAT HOTEL BUT THE STAFF ISN'T WHAT IT USED TO BE”", "Author": "LasVegasFan007", "ReviewID": "UR59542538", "Content": "This is a pretty decent hotel. We stayed at this hotel for 4 months in 2009 and we are back for at least 2 months in 2010. Since 2009, the hotel had a 95% staff turnover. All the people we liked from last year are gone. The big difference this year is that the hotel has become less guest friendly. The price of the room includes daily breakfast and a light dinner on Tuesday, Wednesday and Thursday. In terms of dinner they seem to run out of things, even if you arrive at a reasonable time. Last night was Pasta Night and they were out of tomato sauce about 1/2 hour after dinner started. How expensive is plain tomato sauce? Last year the hotel provided non-stop soft drinks and coffee. This year, they only offer coffee during breakfast and soft drinks from 5:30 PM to 7:30 PM. And usually they are out of ice. What I find particularly annoying is that housekeeping pays NO attention to the DO NOT DISTURB sign! (Don't even bother to put it up)!!! With the Do Not Disturb sign on the door, they start banging on the door early on a Sunday Morning.and try to get in if you don't open the door in 3 seconds! You say no to them, and they again come back a short while later and ignore the do not disturb sign. Not a very pleasant situation after a late Saturday Night in Las Vegas. These may not be earth shattering problems but the culture of the hotel is changing but not for the better. My other complaint is that this hotel has the slowest Internet that I have ever experienced. It is virtually impossible to watch anything on Youtube or any other online video. If you want to do more than just browse and check your emails, then you will not be happy with this Internet. It is very slow, especially during peak hours. Mind you, the hotel doesn't charge extra for it. Still, as everybody mentions, the rooms are very nice. The location is pretty good, near I15 and just south of Mandalay Bay. If you need to get somewhere across town, you can get there quite quickly. This is a very nice hotel and I am hoping that it doesn't continue to go downhill. However, last year I gave the hotel 5 Stars Across the board!", "Date": "March 25, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Salem, Oregon", "Title": "“Nice time in Vegas”", "Author": "Salemduckfan", "ReviewID": "UR57382707", "Content": "If you want a place off the strip this new hotel is great. I stay at Staybridge for business so I know the brand. They have a shuttle that takes you to the MGM and picks up too.", "Date": "February 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canada", "Title": "“This is a fabulous place to stay !”", "Author": "liketravelCanada", "ReviewID": "UR57046611", "Content": "Myself and two friends stayed in one of the larger suites for one week.. last Nov. The kitchen was amazing, with all new & full size , high end appliances and lots of utensils etc. The bed was massive and super comfortable.. we lived liked queens and a king.. for the week ! Large sized Flat screen TV in living and bedroom. We did not notice any noise at all.. from planes or traffic. Our suite was located above the pool etc.. area. It was an excellent value and very comfortable.", "Date": "February 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Central Virginia", "Title": "“Best Staybridge Suites I have stayed at. Great location but comes with some traffic and airport noise.”", "Author": "vamaddog", "ReviewID": "UR56786251", "Content": "My wife and I recently stayed here for three nights. We booked a One Bedroom Suite and it was awsome. Very roomy, upgraded kitchen with granet counters, in room laundry, a split bathroom area with one half open to the bedroom area having the tub and double vanity and the closed room having another vanity toilet and shower. Decorating was very nice with upscale furnishings and a comfortable bed. Two large flat screen TV's. A full size dining room table for four. Bedroom could be closed off from the living area with large pocket doors. The property is adjacent to I-15 and near the airport which is great for easy access. The down side is the traffic and airport noise. With the doors closed we did not hear the noise, but if you sit on the patio or leave the doors open you will hear it, same is true for the pool area. Lots of free parking. The two issues we grumbled a little about were a shower head that would not tilt down enough for a normal height person. NBA players would find it perfect, others not. This would be an easy fix for the maintenance folks after a trip to Lowes or Home Depot for a different angled connector. The other issue was that the temperature in the breakfast area was cold each day, probably 65 degrees. They need to better balance that system. We plan to stay here again. It is a pleasant break from the hectic and smoky properties on the Strip. Best enjoyed if you bring your car or rent one. Free shuttle is nice, but limited in schedule and routes.", "Date": "February 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“all the comforts of home.”", "Author": "TheAlexanders205", "ReviewID": "UR56577508", "Content": "What can I say.... this is by far the best Staybridge in their system that I have stayed in. large comfortable room. great breakfast great fitness room shuttle to MGM. quite nice pool area. nothing bad.... go to the strip and then back to the Staybridge and wind down.", "Date": "February 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Isle of Man", "Title": "“Great Rooms”", "Author": "iomboi", "ReviewID": "UR55334956", "Content": "Really nice hotel, would definately stay again. Can get quite pricey back and forth to the strip although there is a free shuttle provided only found this out when checking out, was not informed at check in but oh well, for all the ppl who do get taxi's its about 15 dollar including tip to strip one way. rooms are big and airy well there are suites there good for the value. staff seemed a bit slow but they were some competent ones, overall a nice hotel.", "Date": "February 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "5"}, "AuthorLocation": "Colorado Mountains", "Title": "“Beware of this hotel if you don't like jet blast and noise every 45 seconds!”", "Author": "RiverRogue", "ReviewID": "UR54544110", "Content": "This hotel would be the best in town except for the fact that is right on the runway so the jet blast literally shakes the rooms. And, there are major roads and highways within feet of the hotel on the other side. Planes took off every minute or so all night long. The rooms are stunningly beautiful with a large tub, nice kitchen, suite layout with large flat screen televisions etc.. And, the hotel has a lovely pool and spa. BUT, WHAT GOOD IS ANY HOTEL IF YOU CAN'T SLEEP EVEN WITH EARPLUGS IN? I would only rate this hotel high for people used to living right on a freeway.", "Date": "January 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Utah", "Title": "“Fantastic for the price!”", "Author": "lost_travelers", "ReviewID": "UR52714802", "Content": "Booked the deluxe suite in May 2009 for New Years 2010. Got a fantastic rate since it was booked early and paid in full; stayed 6 nights. Our goal was to have New Years on Fremont Street, which was AWESOME! then go rock climbing at Red Rock National Conservation Area for the rest of the time. We had a great time. Pros: Breakfast included: waffles, eggs, bacon, biscuits/gravy, cereals, fruit, yogurt, coffee, juice Dinner included (Tues-Thurs): never made it to these since we were on the strip those nights Shuttle service to MGM (didn't use this either, easier with own vehicle) Big kitchen and living area Comfortable huge bed Corner couch in living room with pullout bed (not so comfy though) Big screen TV in living room and master bedroom Friendly staff who tried to be helpful Apparently there's cocktail nights, but we never made it to those either. Very clean, modernized suites Non-smoking hotel Away from the strip Washer and dryer Fitness Center 24hrs Cons Shower sometimes didn't get hot enough for my liking Hot tubs outside were never hot. We told the front desk on day 1 who said maintenance would work on it. The next day neither hottub was warm, told front desk again who said they were broken and maintenance was trying to fix them. Never did get a chance to soak in a hottub. Also the pool is cold in January since it isn't heated!", "Date": "January 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Santa Cruz, CA", "Title": "“I can see why this is rated #1 in Vegas”", "Author": "Lattenut", "ReviewID": "UR52261930", "Content": "Just returned from a 5 day stay in Vegas at Staybridge Suites. We wanted something with a kitchen and off the strip. This place was perfect. You can see the strip but not hear the strip. The rooms are large, the bed is comfy and the kitchen has everything you could need. Bonus - not a slot machine in sight! Free breakfast is blah, but other than that - our stay was perfect.", "Date": "December 31, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "New Mexico", "Title": "“WOW, The Reviws are Right”", "Author": "llsee", "ReviewID": "UR50835389", "Content": "The wife and I recently visited Vegas to celebrate our 40th anniversary. Our daughter and her husband flew in to join us. Based on the reviews here on Tripadvisor, we decided to both book a suite at the Staybridge. All I can say is the reviews are correct. The hotel is extremely nice, not far off the strip, and the suite we had was beautiful. Nicely decorated, it was huge. There was a full kitchen (with stainless appliances), a dining area , large corner sofa that also turned into a sleeper, a separate bedroom, Flat screen TVs in both the living and bed rooms, a tub, dual sinks, and a separate room with a walk-in shower, sink and toilet. This suite was larger than several apartments we have lived in. All this for less than a standard room at most of the casino hotels. Everything was clean and in excellent shape, and even though they said that they only cleaned the rooms on the weekend by request, they straightened up our room and provided clean towels even though we did not request it. The hotel is only 2 blocks away from the Mandalay Bay, was convenient to roads that allowed for easy access to the big casinos. Although they have a shuttle, you will definitely appreciate having a car at this hotel. With its location, it was easy to access the casinos on the East side of the strip and avoid having to drive on the strip. Granted, there is no room service or in-hotel restaurant, however, we wanted to eat at several of the well known chef's restaurants. The no-smoking building, and free breakfast along with the well-appointed large suites, made this a reasonable compromise for the price. Ok, I had a couple of quibbles. When we arrived at about 2:30 in the afternoon, the desk clerk told us he could not check us in before 3:00 PM. We said our daughter had called and said she was already there. We asked him to check and he said that no one was there by that name. So, we called her cell phone and she had indeed already checked in and was in a suite on the 3rd floor. We decided that the 4 of us would just go get a late lunch. And when we returned about 5:30 PM, the manager apologized profusely for the confusion earlier and said the clerk was new. In my book though, it was no-harm, no-foul. One other small quibble is that I thought the shower head was rather oddly placed in the walk-in shower. Those are just quibbles, and our 3 night stay was truly enjoyable and very pleasant. We will definitely stay here on our next visit to Vega$.", "Date": "December 7, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "The Netherlands", "Title": "“Perfect room in a wonderfull hotel at a quiet place”", "Author": "Minfra", "ReviewID": "UR50290103", "Content": "The hotel is not at the Strip but about 10min. by car away from the MGM building at the Strip. Just at the other side of highway 15. A quiet spot to relax from the dazzle and razzle of crazy Las Vegas. There is a free shuttle that brings you to the strip and take you back to the hotel at the time that you agree with the frinedly drivers. The suites are grand: living room, sleeping room, bathroom and a fully equiped kitchen. There is even with a washing machine. The hotel has a large swimming pool and whirl pools. During our stay in September, we were only with less than 10 persons in the pool late afternoon. Much more preferred than the colossal hotels at the Strip where you are with hundreds at breakfeast and in the swimming pool.", "Date": "November 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles", "Title": "“All great except the Internet connection”", "Author": "SoCalFam99", "ReviewID": "UR50288327", "Content": "I had stayed there on a business trip a few months ago, based upon the great reviews in TripAdvisor. On that trip, the poolside music went on at 3:00 AM accidentally, and it took the front desk 20 minutes to get it turned off. My room had a pool view and the music woke me. The next morning when I told the staff that I had to get up early, and was not prepared for my meeting due to the middle-of-the-night pool noise, they refunded the room charge for the night. The suites are amazing. They are like new apartments. I brought the wife and kids 11/23-11/25 and the only complaint was that the Internet speed in our room was slow at all times of day, wired and wireless, on 2 different laptops. Beside that, everything was perfect. The breakfast, the staff, the pool/jacuzzi, and so on. We now have a new Las Vegas home.", "Date": "November 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Kansas", "Title": "“Great hotel off strip”", "Author": "mss09", "ReviewID": "UR50031683", "Content": "We selected this hotel based on reviews and were not disappointed! We thought about staying on the strip, but after booking this hotel we're so glad we didn't. The hotel has an hourly shuttle to MGM and that worked great for us.The room was great, had a kitchen, big shower, king size bed. The breakfast in the morning was sufficient, saved us from spending more money on food, business center was handy for printing out our boarding passes, staff was great, always very helpful. Would definitely stay here again if we come back to Las Vegas.", "Date": "November 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "manchester", "Title": "“Superb in every way”", "Author": "phil0264", "ReviewID": "UR49266229", "Content": "Fantastic suite, good breaky, helpful staff. Location was just behind the strip, behind the Mandalay. A free mini-bus runs every hour from the suites to the MGM and back again. We used this as a base for our wedding, and can't rate it high enough. Yes we could have stayed on the strip, but there you get just a room for the same price, and you're stuck there in the midst of everything, all the time. This place is so handy and just a bit away, but so close to the airport, etc. And free wifi aswell.", "Date": "November 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "omaha", "Title": "“Nice Hotel”", "Author": "redomaha", "ReviewID": "UR49069521", "Content": "Staybridge suites was a very nice hotel for the price. The rooms are modern and clean and quiet if you are not toward the road. We did have a problem upon check in that we were told they were overbooked and they would put us elsewhere. But he proceeded to check in the people that came after us. Upon calling our travel company they were suddenly able to accomadate us. I would recommend this hotel in spite of our problem", "Date": "November 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "1", "Rooms": "5"}, "AuthorLocation": "Australia", "Title": "“Gorgeous rooms, fabulous staff - but not ideal location”", "Author": "LizzieD79", "ReviewID": "UR48720896", "Content": "My sister and I stayed at Staybridge for 3 nights during our North American holiday. The room itself was absolutely beautiful and huge. There are full kitchen and laundry facilities in the room, a dining area, a TV area (with a huge couch), a large bedroom, and 2 bathroom areas (one with a large bath, and another with toilet and shower). Staff were friendly and extremely helpful. On our checkout day we nearly missed our flight, and they went out of their way to get us to the airport quickly in their complimentary shuttle. However, we felt that this was not the most convenient place to stay in order to explore the strip. While there was a shuttle running between the hotel and the strip, this only ran every hour, and the final bus came back from Vegas at around 10pm. This didn't make a lot of sense to us considering that Vegas is a city that most people would want to be exploring at night. Getting back to the hotel late at night was difficult because taxi drivers did not seem to have heard of this hotel. We also found that we had very little hot water in our room, which was quite frustrating when wanting to unwind with a nice shower or bath after a long day. I would recommend this hotel if you want somewhere luxuriously large to stay in Vegas that is away from the strip itself, but don't plan to be in Vegas after 10pm. However, would recommend staying somewhere on the strip if you plan to be out later than that - it would be a lot easier.", "Date": "November 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Wirral", "Title": "“Simply the best place to stay in Las Vegas”", "Author": "WirralStuart", "ReviewID": "UR48698073", "Content": "My wife and I stayed at the Staybridge for 2 nights before departing on a motorcycle road trip around the Grand Canyon, we returned for a third night before flying back to thr UK. The rooms are very large and spotlessly clean, fridge, sink, full size dish washer, coffee machine, bed the size of a planet and a really good bathroom. Lovely swimming pool, which unfortunately we didn't get to use. Free hourly shuttle to the MGM Grand and returning from the MGM at 15 minutes past the hour, last shuttle at 22:15 which might restrict some people, but a taxi is only about $15, if you can find a taxi driver who knows where the Staybridge is! Staff were very helpful, we were able to leave our large suitcase at the hotel while we were on our road trip. 24 hour convenience shop stocked with most essentials. Aboslutely made our trip.", "Date": "November 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Minnesota", "Title": "“Exceeded expectations and then some.”", "Author": "limo77", "ReviewID": "UR48135552", "Content": "This hotel had great reviews and did not disappoint. Though I had forgotten exactly which amenities were offered, we were happily surprised when we walked into our room. The lobby was beautiful, but we have seen hotels with great lobby areas with old, boring rooms in disrepair. We were there for our daughters wedding, and had 12 people over between the wedding and reception and there was room for more:) Full kitchen with regular sized oven, stainless steel dishwasher and full sized fridge. Microwave, toaster, coffemaker, dishes, pots, pans, dishsoap, paper towels, salt, pepper, micropopcorn, coffee, too much to mention. A closet with stackable washer/dryer, nice dining table for 4, larger sofa with one side you can lay down on? can't remember what they are called. Balcony with table and two chairs. Nice large picture window in living room area, coffee table, larger flat screen t.v. in wall unit. Bedroom had king bed, with tons of pillows. There was a little placard saying there were feather down pillows in a closet if that was your preference. The bedroom had a door to the balcony as well. Two nightstands, and dresser with another flat screen t.v. A clothes closet in the bedroom. Ironing board and iron. Bathroom: nice larger tub/shower with granite type tile on floor. Beautiful vanity area with 2 sinks and mirrors. Nice lighting, not flourescent. Large bathroom, that could be accessed from main living area and bedroom. We have never been in a room that was so freshly painted and modernly decorated in every room. Service: front desk employees were excellent,; patient, cheerful, and helpful.Helped us with directions, etc. We saw a sign at desk mentioning a free shuttle to the MGM Grand regularly and back to Staybridge. Pool area: Never crowded. Nice pool and two jacuzzi's surrounded by some palm trees. Many chaise lounges, some with thick cushions, and 2 or 3 cabana types with the mattress and roof. BBQ grills, and outdoor tables for drinks and breakfast. FREE BREAKFAST!! This had bacon, sausage, scrambled eggs, omelets(egg type changed on the two days we were there)yogurt, breads, several types of fruit, juice, coffee, milk. Anything we couldn't eat(ate in our room) we just put in fridge for a snack later. There was a convenience type store right in the hotel. We bought a couple of micromeals. Not cheap as a regular grocery, but convenient. This was easy to find, a mapquest brought us right to it. Close to the strip, very close to airport. We are SO glad we did not spend more than twice as much to stay on the Strip! Since it is close to the airport there were planes taking off quite often, but from what we heard from others attending the wedding, it was much quieter than their hotels with music playing loudly all the time. Everyone who came to our room was jealous, and could not believe the price of less than $130.00 per night. They all said they would stay at the Staybridge if they ever came back to Las Vegas. I believe there was an exercise room, but did not check into all amenities. Awesome hotel, and terrific value!!!", "Date": "October 30, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Cork, Ireland", "Title": "“Top Quality - Incredible Value - Oasis of Tranquility”", "Author": "ConanTheCorkonian", "ReviewID": "UR48099500", "Content": "This place is excellent - the suites are huge, very modern, well designed and spotlessly clean. I have stayed in a lot of 4 and 5 star hotels around the world, and this is up there with any of them. Service is excellent and the staff were very friendly and helpful. Our room faced towards the highway and the strip, but we were not bothered by noise at all. The only slight downside is that it is not on the strip. Getting the shuttle to the strip takes about 20-25 minutes, including waiting for it. I don't know if you can get this level of quality on the strip though (maybe in the Bellagio), and you certainly won't get a quiet lobby and staff who remember you. Also the prices are excellent - I think I payed about 100 dollars per night.", "Date": "October 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sydney", "Title": "“Absolutely brilliant staff & facilities!”", "Author": "sydney59", "ReviewID": "UR48082733", "Content": "From Sydney Australia. Stayed here for 3 nights in October. I initially was going to book a hotel on the strip but after researching trip advisor I found this one. The hotel is about a 5min drive from the strip & there is a free shuttle every hour. It was great to leave all the noise & crowds behind each night as we went back to the hotel for a relaxing quiet night's sleep. The strip is more suited to singles or couples who want to party all night. The hotel staff were brilliant and allowed me an early check into a great suite with views directly overlooking the strip. The king bed was huge as was the queen sofa for 2 teenage boys. The room featured a kitchen & washer/dryer which was great for catching up on our laundry load for 4 people. Breakfast was complimentary & the selection was good. There is a pool, business centre & gym to use. Parking is free. Shopping was best at Las Vegas Premium Outlet (north end of strip). Don't forget to register on Chelsea Premium outlet website for discount coupons. We had a late flight on our last day & the staff locked our lugggage into a secure room for the day which allowed us a lot of freedom with sightseeing (drove to Hoover Dam approx 60mins). This hotel is more like a business/corporate/resort facility yet makes every family member feel at home. Absolutely brilliant staff & facilities. I will stay here in the future.", "Date": "October 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "las vegas", "Title": "“This place is GORGEOUS”", "Author": "tom2119", "ReviewID": "UR47893007", "Content": "The best trip to Las Vegas I have ever had. One bedroom suite is huge ...staff is awesome!", "Date": "October 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Singapore", "Title": "“Glad we've choosen this one!”", "Author": "Icegrapetea", "ReviewID": "UR47388601", "Content": "Were there from 7Oct to 10Oct with my 16 months toddler. The place is just across Mandalay Bay. Taxi to hotel from airport about USD20. Free shuttle to MGM Grand once every hr! Fridge, washing machine, dryer, cooker, microwave, dish washer in suites very useful for me. 42\" flat screen TV and comfortable bed. Mini mart in the hotel premise convenient for me. Pump station mins of walk away. Place is very clean and well maintained. Free daily breakfast and light dinner from tue to thurs save us a lot of money for shopping. Taxi to premium outlet about USD30.", "Date": "October 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Location": "2", "Rooms": "5"}, "AuthorLocation": "California", "Title": "“Not quiet at all!”", "Author": "Cal48", "ReviewID": "UR47186139", "Content": "Stayed here on recommendations of TripAdvisor. The noisiest place we have stayed in quite some time!! Our room looked out over toward the strip, freeway, and two busy roads that intersected right by the hotel. Awful - could not sleep at all! Room was nice and staff were very friendly. Would NOT recommend this place!", "Date": "October 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Redruth, United Kingdom", "Title": "“As good as we expected”", "Author": "madgio", "ReviewID": "UR47160688", "Content": "We booked this hotel as the reviews were so good, we were not disappointed, clean, comfortable, friendly, good food, what more could we ask for!", "Date": "October 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Moss, Norway", "Title": "“GREAT!”", "Author": "lf-Norway", "ReviewID": "UR47125668", "Content": "We stayed for one week and had a wonderful stay! I have absolutely nothing to complain about. We had a one bedroom apartment. We had a couple of days with temp. in the 100' s so we tried the pool! Loved that as well. The breakfast was nice - the staff just wonderful from the moment we checked in (after midnight by the way...) until or departure. We did not want to live on the strip and we don't gamble so, easy to choose. We chose this hotel based on the reviews here on Tripadvisor! LOVED IT! We will stay here again on our next vacation in Vegas! Thank you for making this place such a great place to stay!", "Date": "October 18, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Lake Country, Canada", "Title": "“$75 non-refundable pet fee and higher prices than online.”", "Author": "strattc", "ReviewID": "UR46860905", "Content": "We did not make reservations as we were on a road trip. When we arrived at the hotel we inquired as to the best available rate and the front desk clerk quoted us $25 more than the online price for the hotel. Also, they charge a $75 non-refundable pet fee. I can see charging a deposit, but traveler's like ourselves leave the room as we found it or better - you would never know a pet had been there so $75 seems high to us. Close to the strip (4 minutes drive) but nothing else around the hotel.", "Date": "October 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Newbury, England", "Title": "“Statbridge Suites - stay there !”", "Author": "wbph", "ReviewID": "UR46815335", "Content": "Almost too good to be true. Polite and friendly staff and never heard the word 'no'. Excellent suite giving that ability to have a home away from home. Lovely pool and hot tub. Use the barbeque ? - no problem. We had a view across the bay - the Mandalay Bay, which is across the I15 and two other roads. No noise problems, even from the planes. Right away from all the noise and trilling machines it was an excellent location for us who wanted to visit LV other than to gamble. Highly recommended and will certainly be our number one place to stay when we go again.", "Date": "October 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Midwest", "Title": "“Other Reviews are right - Staybridge is Terrific!!!”", "Author": "whitfang", "ReviewID": "UR46709281", "Content": "Only 2 'problems': (1) Not right on The Strip! In our case, we enjoyed the relative quiet, but if you come to gamble/drink/party at night, you'd probably like being at the Bellagio, Ceasar's, etc. (2) Jets taking off are noisy! Close to the south end of the airport runways, so jets are at full power. They start at 6am and stop at 11pm, so it's not real bad, but you do notice them. And you ARE close to the airport if you are flying out. The rooms are super clean and roomy, nice bedding, nice TVs, nice pool and hot tubs, free exercise room, free business center with computers, free in-room Wi-Fi, good (hot) breakfast. The bacon was even crisp. No complaints at all staying here.", "Date": "October 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "2.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "uk", "Title": "“FANTASTIC”", "Author": "mackleeds49", "ReviewID": "UR46543331", "Content": "Fantastic friendly hotel.rooms are deluxe, pool area amazing.breakfast very nice.very quite away from the hustle and bustle of the strip.going back next year.", "Date": "October 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "San Francisco", "Title": "“Clean and new hotel”", "Author": "LighterWay", "ReviewID": "UR46264929", "Content": "The hotel was great. Definitely newer and very clean. No smokiness that you get from the older hotels. Only downdise was that it was away from the strip. However since we had a car, this wasn't a problem at all. Loved it here and would recommend to anyone.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New Mexico", "Title": "“Most beautiful room I've ever stayed in.”", "Author": "PicassosModel", "ReviewID": "UR46239767", "Content": "If you want to stay on the strip, this is not the place. It is located just off the south end of the strip and has a shuttle that runs every hour to the MGM. It is beautifully decorated and has high end touches in the rooms like art niches, top of the line linens, custom furniture, two bathrooms, full kitchens and some have washers/dryers. It also has a very nice pool area with nice chaise lounges and plenty of extra towels. The breakfast is free and is very tasty and has a nice variety. We had no complaints at all. They even let us park our car there free for 8 days while we flew to Jamaica. There is a free shuttle to the airport, but you have to take a cab from the airport to the hotel which cost us $20 w/ tip. We will definitely stay here again when in Vegas.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "alaska", "Title": "“They treated us like they appreciated our business.”", "Author": "sunworshiperAlaska", "ReviewID": "UR46022554", "Content": "This is the first time I have written a review. I felt compelled to do so because of the great service that experienced during my stay. Everyone had a smile and was very kind and helpful and seemed to really enjoy there job. The room was clean and well furnished. Bed was comfortable and bedding was plush. The breakfast was fresh and tasty with a wide assortment and everything was very clean. I really can't say enough good things about the hotel but it was the staff that really made the stay enjoyable to me. There is no shortage of nice places in Las Vegas to stay but I will return to the Staybridge Suites for all of my future travel plans.", "Date": "October 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Seattle, WA", "Title": "“Marvelous Hotel. Highly recommended.”", "Author": "martygSeattle_WA", "ReviewID": "UR45952484", "Content": "This place is AMAZING VALUE.. PROS: It's not a casino hotel. Staff are friendly and helpful. Free food in the evenings and breakfast are great. Rooms are spacious, modern, quiet, and comfortable. Free shuttle to the strip. We also got a free ride to the airport. Free wireless internet. Great fitness center. CONS: These are small. The \"music\" around the pool is loud and annoying. We had to wait for ages for our crib, and sofabed, despite booking these and reminding the staff at check-in. It's a good 20-25 minute walk to the strip (but you can take the hourly shuttle), and it's a $20 taxi fare from the Wynn end of the strip.", "Date": "October 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Wales, UK", "Title": "“excellant hotel”", "Author": "McDonaldsWales", "ReviewID": "UR45541553", "Content": "booked due to recommendation from trip advisor, was not disappointed. The rooms are excellent, the staff have been extremely helpful, the breakfast was great and they have a shuttle bus that drops you off right in the middle of the strip. Value for money, cannot recommend this highly enough.", "Date": "September 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Waterloo, Ontario", "Title": "“A Great Alternative to The Strip”", "Author": "CGDWaterloo_Ontario", "ReviewID": "UR45241964", "Content": "This is a quiet, smoke-free oasis removed from The Strip, but a short, free transfer away. We were greeted by friendly staff and found a clean, well-appointed and maintained suite awaiting us. It had everything needed for a longer stay, including dishes, stove, micro, washer and dryer. And - the A/C was a quiet, temperature controlled unit. We enjoyed the large-size, cool pool and the excellent breakfast. This is great value for the little money we paid.", "Date": "September 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Liverpool", "Title": "“Lovely Hotel”", "Author": "Rosalita22", "ReviewID": "UR45073946", "Content": "We stayed for one night at this hotel. We were given an upgrade to a one bedroom suite overlooking the pool (we'd booked a studio suite). The lady on reception was very helpful and friendly. The suite was exceptional - very clean and modern. We used the fitness centre, which had a great view overlooking the strip. Complimentary breakfast was nice too. Definitely stay here again in the future.", "Date": "September 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Scotland", "Title": "“Can't Fault This Place”", "Author": "Ross_Eld", "ReviewID": "UR44365298", "Content": "Its very seldom I give a place 5 stars, but this place was excellent in every way, plus Scott gave us a free upgrade - top notch place to stay.", "Date": "September 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Berkeley, CA", "Title": "“Great Place to Stay in Vegas”", "Author": "paulie47", "ReviewID": "UR43994852", "Content": "This hotel is simply great, especially for the price. You should understand it is not the strip experience. It is a few blocks south and west of the strip. It is a non-gaming hotel. It has no room service (but an outside vendor can bring meals.) That said it was a tremendous place to stay. We got a full suite for $108 per night. Full kitchen with a stove as well as a microwave, dishes, etc. Full size refrigerator without the extortionist prices if you use it or move anything in it. Large living room. Two flat screen tvs, Large comfortable bed. Huge bathroom. Shower high enough that I didn't have to duck my 6'3\" frame under it. Clean and modern. Breakfast is included, with eggs, fruit, cereal, etc. Nice pool, with salt and not chlorinated. Free wi-fi. It's near the take-off pattern of the airport, but is quiet inside. The people are all very friendly, and we asked for and got a late check-out with no hassle or extra price. Large and well equipped exercise room, with no extra charge to use it. There is a shuttle to the strip that runs about every hour to the MGM Grand. You can walk to Mandalay Bay for their buffet. Absolutely a great weekend in Vegas, thanks to Staybridge. I definitely would stay there again. The only criticism my wife had -- no full length mirror. Now that's pretty minor, not worth a half a star.", "Date": "September 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Southern US", "Title": "“This IS the #1 Hotel in Vegas”", "Author": "LittleLucy30", "ReviewID": "UR43624433", "Content": "After planning a trip to Vegas, my husband and I decided on Staybridge due to the ranking and reviews on this site. We were not disapponted. We were able to check in earlier than the 3PM check in and the room was everything we had expected. We stayed in the King Suite with a full kitchen and washer/dryer. We actually didn't use the kitchen as often as we thought we would, but used the washer and dryer every single day. The room itself was spotless and modern, with comfy couch and bed. The breakfast was great (since it was free!) but we didn't try the light dinner they served during the week. There was a little bit of street noise (room faced the strip) and we could hear airplanes occasionally, but overall the place was very quiet. The pool is oustanding, it's a large saltwater pool with a kiddie pool, and hot and cold jacuzzis. The location just off the strip and the fact that the entire hotel is non-smoking were high pluses. Staff was extremely helpful and very nice. I had to call one day because my room wasn't cleaned but they took care of it right away. If we ever decide to return to Vegas, we will return to Staybridge.", "Date": "September 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Detroit the Motor City", "Title": "“Great place to stay in Las Vegas”", "Author": "BogeyPar", "ReviewID": "UR43379702", "Content": "My brother and I flew out to Vegas to see a concert and do a little bit of gaming. As soon as I walked in the suite I was blown away by the size and \"newness\" of the suite. Stainless steel appliances separate sleep area with a King Bed, huge bath tub and a stand up shower. The couch was also a queen size bed and from what my brother said it was very comfortable. Two large flat screen TV's and stainless steel appliances. All I can say is that I would stay here again the next time I come out to Vegas.", "Date": "September 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Walnut Creek", "Title": "“Nice Hotel off the Strip.”", "Author": "Kevin_WalnutCreek", "ReviewID": "UR43217313", "Content": "You can drive to the Strip and enjoy the free parking. The staff was very nice, and very interested in helping. I was in Las Vegas for business for 3 days and wanted a larger room with a kitchen. The room was a good size with a couch area. The kitchen was well stocked with utensils, along with a working freezer compartment. The bed was very comfortable. The AC was very forceful… either on and blowing hard of off and quite. The only downside was that the walls were a bit thin and the TV next door kept me up one night. The free breakfast was good each morning. The big HD flat screen (42”?) was nice.", "Date": "September 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Aliso Viejo, California", "Title": "“wonderful stay and great value for the money”", "Author": "dreaminofcabo", "ReviewID": "UR40223150", "Content": "My fiance and I stayed at the Staybridge Suites this past Labor Day weekend. We usually stay on the strip on our Vegas trips but after realizing how expensive that would be on a holiday weekend, I looked into alternatives and noticed all the great reviews of this place here on Tripadvisor. I was a little apprehensive on how a hotel like this could be ranked #1 of ALL the hotels in Vegas, but after staying there I can definitely understand the rave reviews it gets. The hotel is located right on the other side of the I-15 highway from Mandalay Bay and THEhotel, and I would highly recommend it to anyone traveling to Vegas and has a car. It is not walking distance to the strip at all and while there is a shuttle that runs to the MGM, it only runs every hour and stops at 11pm, so we just drove to each place we wanted to go and took advantage of the free valet parking everywhere. When we checked in on Saturday, the front desk were telling a number of people ahead of us that they had overbooked rooms and would have to move them across the parking lot to the Fairfield Inn and Suites, but that they would get a refund back for their night stay. While it would've been nice to not pay for a night's stay, I didn't want to stay somewhere else, and luckily since I was a Priority Club member, a room was still available to us. We were assigned room 514 with a view of the pool. The room looked completely new, with a full kitchen, living room, large bathroom, separate bedroom with king bed, and even a washer/dryer in one machine. As others have mentioned, free breakfast is included in your stay and is served 7:30-10:30am on weekends, and 6:30-9:30am on weekdays. They had plenty of food, cereals, oatmeal, bagels/breads, yogurts, fruit, premade cheese omelets, sausage patties, biscuits, gravy, and a waffle maker that was quite popular. I also hung out at the pool one morning and there were only a handful of people around. They had comfy lounge chairs, as well as 3 cabanas for anyone to use. If you are looking for somewhere to stay with poolside service and $20 slushies, then this isn't the place for you, but if you want peace and quiet in the sun or shade, whatever your preference, this is the perfect spot. All in all, if I could get a good deal on the strip, I would probably prefer to stay there for the convenience. However, if the Staybridge is cheaper than what the strip has to offer, then I wouldn't hesitate to stay here again. You will not be able to find the conveniences of having your own kitchen, laundry facilities, free internet, and free breakfast anywhere else for this price.", "Date": "September 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Atlanta, GA", "Title": "“Great overall experience”", "Author": "bjustice", "ReviewID": "UR39954425", "Content": "The hotel is only about a mile from the Las Vegas strip. I was very pleased with the experience. We had a King Suite with a sleeper sofa - perfect for a couple with a teenager. The Kitchenette made it very convenient to have snacks and drinks on hand. The room was a good size. I would recommend for a family hotel near the strip. It is convenient to most things but not on the main drag of the strip. The room was clean,. the staff was courteous. Overall very positive - particularly for the price. I would definitely recommend to my friends.", "Date": "September 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Philadelphia", "Title": "“A must for families with little kids”", "Author": "BeckyStepana", "ReviewID": "UR39628875", "Content": "We just returned from a 6-night stay at Staybridge, and can't say enough about our visit. The hotel is located just past \"The Strip\", which makes it far enough from the congestion, noise, smoke, poker machines and posters/videos of scantily-clad women to please any parent, but convenient enough to get there to see some of the sites (like the pirate show and volcano, big hits with the preschool set). The hotel offers a shuttle to the middle of the Strip, although we rented a car and parked at the casinos, which was free. The hotel is brand-spanking new, and the rooms are gigantic. We booked a king-suite, which included a separate bedroom for us with a door, pull-out sofa for our 5-year-old in the living room, small dining room & full kitchen complete with oven, dishwasher, and full washer/dryer. Big, new bathroom with double sinks. Balcony overlooking the pool (definitely request pool view, as the other side of the hotel looks at a highway). Maid service was spotless. Bed was super comfy, and the sofa-bed not bad either. Two flat-screen TVs, one in each room. The pool is large, with a great shallow end for little kids (about 1 ½ feet deep) with fountains cascading from a wall. They have two hot tubs, cabanas (free!) and nice squishy loungers. Couldn't get my daughter out of the pool, and there were few people in it the entire week, either because it's a little off-season or because most of the adults were off at the casinos. We felt like we owned the place. There's an outdoor gas grill for guests to use – go buy a steak and grill it up (cheaper and tastier than at the casinos). Breakfast includes hot dishes – rotation of omelets or scrambled eggs, sausage, bacon, and all of the usual continental fare like bagels, danish, oatmeal. Oh, and make-your-own waffles. On Tues-Thurs they also serve a 530 PM appetizer buffet, with hotdogs/burgers fresh from the grill, tacos, salad bar, etc. But what made breakfast/appetizer service really special was Sandra, the woman who runs the dining room. She was so welcoming and hospitable – she went in the back to get my daughter fruit during one of the evening meals, and if we showed up a little early or late for breakfast, she made sure we had something to eat. (A lot of hungover patrons made similar comments after dragging downstairs too late for breakfast...) It's rare to find such attentive and warm service these days, and she set a great standard. Oh, they had free internet in the business center, and a really nice fitness center overlooking the mountains. Vegas is exciting and there's a lot to do at the Strip (don't miss Zion and Bryce!), but if you're with kids, it's REALLY nice to have a haven from all the glitter and just relax at a place that's really welcoming to families. We'd definitely stay there again.", "Date": "September 2, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Vancouver, Washington", "Title": "“What a wonderful place! Highly recommended!”", "Author": "aprata", "ReviewID": "UR39230912", "Content": "I am a tripadvisor fanatic - I read and take reviews very seriously. We booked a one bedroom king size suite for one night (August 28-29 2009), since we needed to stay in Vegas for one night for a family trip, and we wanted a clean place that did not take forever to get around like the huge strip hotels yet was close to everything and had all the amenities. I am so glad we chose Staybridge Suites! We usually travel to 4-5 star resorts so I was skeptical whether I would indeed find similar quality, yet we did! We arrived 11:30 am, way too early, yet staff was wonderful and checked us in immediately - we had suite 500, very private, last suite at the end of the hallway, with a pool view. The whole hotel is very clean, new and modern, and there is no trace of that musty smell that comes with most old(er) mega hotels on the strip. It is a non-smoking property as well, and everything was fresh and clean. The one bedroom was just like a timeshare apartment - full kitchen with Whirlpool stainless steel appliances, two flat screen large TVs (one in bedroom and one in living room), AC, two (smaller) closets with hangers, dining table with chairs, small balcony with two chairs and one table, alarm clock, washer and drier in unit, bathroom with double sinks. Free breakfast is nice, yet for a healthy eater I could not find many healthy choices - they had pastries, eggs with cheese inside (that was the part that I did not like, the cheese made the meal heavy), the fresh fruit was sunk in sweet syrup, bagels, waffles. Very good meal if you are not terribly health conscious. The business center has free internet and printing, so you can print boarding passes, which we did since we did not carry our laptop with us, but wireless is also free if you need it. Parking is free, there are no resort fees, no additional charges other than the nightly room rate plus tax. The pool was lovely, there were towels available on the back of the chairs, there is shade and actual cabanas with mattresses to lay on, which usually you only find at 4-5 star resorts only. We did not use the free shuttle but I understand there is a free shuttle to the strip every hour until 11 pm. Overall, we loved this place - if you want to be close to the strip yet away from its craziness, if you want a clean, new, modern place with no musty smell, if you want no resort fees and wireless fees and all sorts of extra charges, and free breakfast, this is the place for you. I would stay here again with no hesitation when we go back to Vegas.", "Date": "August 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“A hidden gem, visit ASAP before the secret of this place is out”", "Author": "Hooleybooley", "ReviewID": "UR38416193", "Content": "This hotel is such a hidden gem. We stayed here for two nights in the second week of August but it appeared we were two of only a few people staying here (mostly families). We had the Pool and two Jacuzzi's to ourselves during the day - although temperatures were hitting an all time high at 107degrees & we spent most of it under the umbrellas and cushioned loungers. There were 4 poster bed style loungers too if you wanted them. We had a nosey in the pool area of the Luxor and this was heaving with people all crammed into the pool area - the Staybridge was a breath of fresh air. The rooms were fab and brand new, the beds were huge and were very high. I'm only 5ft 2 and I needed to jump a bit to get on them!! The kitchen was fully equiped with everything you needed with free coffee and popcorn and also had a washer and a dryer. Location wise, the hotel is not on the strip. In fact it is on the other side of the I15, this meant we had to drive 5 mins to the strip but we parked for free at the Luxor. So it wasn't that much of a problem. We did have an issue with a trip we had organised and the organisers would not pick us up from our location, we had to drive to them - I think this is more an issue with the organisers of the trip - Pallion Helicopters. Breakfast was good with fresh fruit and hot options but dinner was poor (soup & a poor limp salad(limp due to the weather I think)) - both were free which was a added bonus for a self catering facility. Finally, this hotel is close to the airport and I15 but no noise is heard in the hotel at all.", "Date": "August 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "los angeles ca", "Title": "“The StayBridge Suites is the answer...!!”", "Author": "tcranla", "ReviewID": "UR38288837", "Content": "StayBridge Suites is the answer, whether you are traveling alone, on business, or with your family. StayBridge Suites is the \"bridge\" between the comforts of home and luxury hotel living. The hotel staff and management team are proud of what has been accomplished here. Their pride shows on their smiling faces and an eager to please attitude that begins with a delicious full course breakfast, a late afternoon snack, or a late night swim.Staybridge Suites is exactly what I've been looking for in travel to Las Vegas, or anywhere else. Sincerely, Tracie Craig-Porter", "Date": "August 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Northamptonshire, England", "Title": "“Superb”", "Author": "Juliathesecond", "ReviewID": "UR38279448", "Content": "An absolutely fantastic hotel, the staff especially were perfect; friendly, approachable, full of personality without being over the top. The rooms were all spacious, comfortable, clean and well furnished. The shuttle service to the strip was excellent. The atmosphere at breakfast and in the afternoons in the lounge area, and by the pool was very friendly without being intrusive. We were so glad that we stayed off the strip, it was the best hotel we stayed in of our whole holiday in America. I would absolutely recommend it to anyone, and we would definately stay there again. I can't praise the whole experience of the hotel enough.", "Date": "August 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Gloucestershire", "Title": "“Absolutely top notch!!”", "Author": "Backtrack7", "ReviewID": "UR38277086", "Content": "This is a fantastic hotel, we have just returned from a two week stay and I cannot fault any aspect. The staff, without exception, are friendly and courteous and do their utmost to ensure you enjoy your stay. We had a one bed suite and it was incredible, very roomy and very well equipped - the hotel opened fairly recently so everything is brand new. The complimentary breakfast is fine, fresh fruit, cereal, scrambled eggs, bacon, bagels, toast, waffles etc etc and they also provide three decent evening meals for all guests (Tue-Thu). The hotel runs a shuttle bus service to the strip every hour and they will also come and pick you up - saves a fortune on taxi fares. They will also run you to the airport! The pool is really nice, very quiet during the week and although the hotel is a little busier at the weekend the pool is still under used. Location wise you are 10 minutes from the strip (shuttle) but there is no entertainment in the immediate vicinity of the hotel - if you are absolutely stuck there is a petrol station about five minutes away that sells the sort of food that petrol stations sell and there are other like hotels/motels in the area such as the Marriot Inn and Holiday Inn express. After a wander around each they cannot compare with the opulence of the Staybridge. We had a meal in the Marriot and it wasn't particularly good. There is also free Internet access and the use of a safety deposit box (also free). Maid service is provided every day, they make the bed, and sort the bathroom and the kitchen(replenishing the basics - coffee, popcorn etc) but do not tidy up the general living area. If you have a hire car there is Walmart Supercentre just over 15 mins away if you need to stock up on goodies.", "Date": "August 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Cardiff", "Title": "“Oustanding value and service levels”", "Author": "Dave F", "ReviewID": "UR38065272", "Content": "Simply the best value hotel we have ever stayed in anywhere in world!! . So many great comments have been made on TA and don't need to repeat however we agree with them. A few practical comments I have not seen but may help. 1. Shuttle bus is excellent ( leaves 'top of hour' to strip and 'bottom of hour' to airport but only on request, so if you are on strip and want bus home you need to ring reception, as if no-one is going to strip you won't get picked up. Shuttle bus drivers are so helpful, indeed called at Petrol sation/Food store opposite for us to pick up beer/water and used his ID for us as we didn't have ours ( in Vegas need ID all the time irrespective of age! We didn't need a car. 2. Pool is large, clean and have a good suppy of clean towels, and enough sun beds for all. 3. We found location superb. Whilst strip is great fun we didn't want to be on it 24/7. For a quiet night there is free Pizza delivery to hotel, and of course you can stock Your own fridge/freezer up with drinks! 4. Our daughter particularly enjoyed the free Wi Fi throughout hotel. 5. Fitness Suite was superb. Its large, several machines and well air conditioned. 6. Didn't try the evening meal Mon-Thurs but is there if you would like it. Breakfast is excellent, and the girl who served us every morning really friendly. 7 . Nothing was too much trouble for front desk staff. Scott in particular was great. also may help... 1. We did the Sundance Grand Canyon 4 in 1 trip which was superb. Recommend pre -booking as there was limited availability. 2. We went to watch Jersey Boys at Venetian Hotel.. again would recommend. After 3 weeks on holiday starting in Vegas, then touring West Coast we are still talking about this hotel and the excellent levels of service and value for money If you are adamant you want to stay on strip then clearly Staybridge isn't and it is too far to walk, but apart from that I would say it was for us as close to faultless as you can get and I consider myself balanced and fair and don't normally give anything top marks!", "Date": "August 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Newcastle-Upon-Tyne UK", "Title": "“A peaceful calm place to stay in Las Vegas!”", "Author": "foggy_hall_travellor", "ReviewID": "UR37504728", "Content": "Stayed here to catch our breath en route from San Francisco to the Grand Canyon and Bryce. Everything the rave reviews say is true wonderful spacious accomodation and a lovely pool. Great variety of items on the breakfast buffet. Decided to return for two more nights on our return from the Canyons before flying home. The second time we were upgraded to a huge suite with picture windows looking down the towards the strip. If you want to be in the middle of the hustlers on the strip this isn't the place for you. For me I had a lovely time relaxing time by the pool and taking advantage of the free laundry facilities - the first time I've arrived home with suit cases full of clean clothes. Thanks to all the helpful staff on reception and the Shuttle bus driver who rescued us from the strip when we'd had enough.", "Date": "August 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Singapore", "Title": "“Great value off the strip”", "Author": "mikekSingapore", "ReviewID": "UR37322927", "Content": "We stayed at the Staybridge because of the excellent TripAdvisor.com reviews. We were not disappointed. This is an excellent choice for families going to Las Vegas. The highlights are the following: * Full suites with kitchen * Free, Excellent breakfast every morning (eggs, waffles, sausage, cereal) * Free dinner served on Tue, Wed, Thu (soup, hambugers, hot dogs) * No extra charges for exercise room, Wi-Fi We had many family over to our suite. They were staying at hotels on The Strip. Everyone was jealous of our room and accommodations at the Staybridge. I would strongly recommend getting a rental car if staying at the Staybridge. It is a short 5 minute drive from the Airport and only 5 minutes to The Strip. A key benefit is to relax in your room or by the pool. It is helpful to have a car so you can visit a grocery store or go to different Strip Casinos. The hotel does have shuttle going to the MGM Grand every 30 minutes. We thoroughly enjoyed our visit and would suggest staying at the StayBridge for any visitors to Vegas, but especially families. If you're just going to Vegas to gamble and party, then this isn't the place for you. There's no casino, no restaurants, no bar.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Northamptonshire, UK", "Title": "“Totally Amazing - The Best!”", "Author": "Garya2404", "ReviewID": "UR37311279", "Content": "We stayed at the Staybridge Suits on the 6th and 7th August 2009. This hotel is the best I have ever stayed in. We had a one bedroomed apartment that came with a full kitchen, oven, microwave, hob, dishwasher, washing machine, tumble dryer. A huge living area with a dining table, L shaped settee and a 50\" TV. The the bedroom had a massive bed with TV, wardrobes bath area two sinks and a door leading into the shower / toilet room! The staff at this hotel were like your own family and could not do enough to make everything just right. They have a swimming pool that is good for adults and children along with two seperate hot tubs. Whn you are by the pool they come around and offer you clean towels about every hour or so! The hotel also run a shuttle bus into the airport and strip at Vegas which is only about 5 minutes away, this departs on the hour upto 10pm and then coming back it picks you up outside the side entrance to the MGM at half past the hour with the last one being at 10:30pm. This hotel was built for timeshare options and the company offering the timeshares could not get them sold so Staybridge purchased the whole building and made a few changes and now its the best hotel in the area.........Stay here and just enjoy the luxry and quality of this hotel 10 out of 10 in all areas! Well done Staybridge staff you are all amazing!", "Date": "August 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Ireland", "Title": "“Loved this hotel”", "Author": "kisssmeimirish", "ReviewID": "UR37276973", "Content": "this hotel was great, my friend and I stayed in circus circus last time we were here which was a dump so this time we booked somewhere that wasn't your typical tacky vegas hotel. when we got there the cute guy and reception upgraded us to a bigger suite for free. the staff were always really friendly and the room was amazing-2 plasma TV screens, huge bedroom,sitting room,kitchen and bathrooms. breakfast was great, it was only supposed to be served til 10.30 but when we struggled down stairs at 12 after a night out they made us some anyway. this hotel is great and there is a shuttle bus to the strip every 30 min-however its not within walking distance. overall it was great to be able to access the strip so easily and still be able to come back to a really nice quite hotel. 10/10", "Date": "August 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Kansas City", "Title": "“Off the Strip oasis”", "Author": "Scooter14", "ReviewID": "UR37051223", "Content": "Just returned from 4 day visit to Staybridge Suites Las Vegas. Based upon Trip Advisor reviews decided to try. Met and exceeded every expectation. Have previously stayed everywhere on Strip from Bellagio to Venetian etc in 25 years of trips. This was the best. Room was first class in every way - marble entry, 2 flat screens, full kitchen, great A/C. Lovely, quiet pool. Parking right by front door. Excellent daily breakfast with smiling, helpful faces-Jason and Sandra. For a great local casino drive 5 miles south to South Point.. $ 88 a night prepay and they upgraded us at check-in. So much better than walking through casino to get to room, dealing with casino parking and crowded pool. Highly recommend!!!", "Date": "August 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "So Cal", "Title": "“What a Great Place to Stay”", "Author": "VegasnMead", "ReviewID": "UR36928815", "Content": "Unbelievably close to the strip without all the hassles of the strip. What a great place to stay. The rooms were extremely clean and every piece of furniture was comfortable. The kids enjoyed sleeping on the pull out sofa, while the parents had a great room to themselves. The kitchen was fully stocked with all materials needed to prepare meals. However there is a complimentary breakfast included with the stay that should not be passed up. From fruits, to cereals, to make your own waffle to sausage or bacon or even cheese omelettes. This place had it all. I know the next time i plan to visit Las Vegas, I am making my reservations at Staybridge. On top of all this, the staff at Staybridge was extremely nice, helpful, and knowledgable. Even the complimentary shuttle driver that would take you and pick you up from the MGM... We are definitely going back to STAYBRIDGE.", "Date": "August 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "California", "Title": "“Great hotel. We will definately return again.”", "Author": "lrfisher73", "ReviewID": "UR36900105", "Content": "We loved this hotel, and we will stay here again. I highly reccomend this hotel. The hotel was very clean. The staff was friendly and helpful. It was a great hotel to stay with children. I loved the fact that it had a kitchen, and the breakfast in the morning was good and fun for the kids too. There is a shuttle that took us over to the strip and it runs all day; very convenient. The pool is nice and clean, not as crowded as other hotel pools we have visited; a big plus!! The view from our room was awesome! The vegas strip at night is amazing!!", "Date": "August 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Spacious suite with everything.”", "Author": "cartist", "ReviewID": "UR36771458", "Content": "Our suite had everything including washer-dryer, flat screen TVs in the living room and the bedroom, full stove and microwave, and a great view of the skyline. Helpful staff and a good business center topped off a great stay. Not on the strip nor near the casinos, this was not a bad thing as it meant the hotel was quiet. It took 15 minutes to get onto the strip when we wanted night-life.", "Date": "August 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "SoCal", "Title": "“Very nice stay at the Staybridge Suites Las Vegas”", "Author": "MannyH", "ReviewID": "UR36234354", "Content": "We aren't gamblers but love to go to Vegas for the Entertainment Shows and Food. So naturally this was an excellent hotel away from the strip. It's close to the airport, freeways and around the corner from the strip if you need to access it. In fact, it's close enough where on my stays I did some runs (exercise) to the strip and back. The hotel itself was very nice. Full kitchen, washer and dryer a very comfortable king bed and a comfortable sofa bed. We had the pool view which I thought is much better than the freeway view but you can't go wrong with any room in this hotel. You get free wifi internet in your room, lobby and pool areas with complimentary breakfast. The lady that prepares the food there is just the greatest! Highly recommend this place.", "Date": "July 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Antwerp", "Title": "“Best value for your money”", "Author": "HugoC", "ReviewID": "UR36128163", "Content": "Price quality wise this hotel is difficult to beat. Big 2 room suite, very comfortable king size bed and comfortable queen sofa bed (no complaints from my daughters, on the contrary they also enjoyed their big flat screen TV). Well equipped kitchen, nice balcony, big pool, shuttle to the strip (until 10pm), copious breakfast and (from Monday till Thursday) a complementary light evening meal. What do you need more? I forgot: very friendly and efficient personnel, easy to reach and ample parking space.", "Date": "July 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Toronto", "Title": "“Good alternative to the Strip”", "Author": "RoscoToronto", "ReviewID": "UR35789628", "Content": "Main advantage is the room size and location to the strip and highways. We had car rental and the location was the best for getting all around the Vegas area. Room almost as big as a condo. We have 2 teenagers and they enjoyed having the living room queen sofabed and flat screen TV all to themselves. Wireless internet was great as was the buffet breakfast which was a step above the usual continental breakfast you usually see. Downsides, not many, just had to ask for linens to make up the sofabed after arriving (at midnight) and having to constantly ask for more towels and washclothes from housekeeping everyday (rooms are for 4 people but they leave only enough for 2?) Overall though, very good.", "Date": "July 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Drogheda Ireland", "Title": "“A luxurious gem at a bargain price.”", "Author": "BMRC", "ReviewID": "UR35120067", "Content": "What a gem in the middle of the desert! and all for €63 per night (midweek). We stayed two nights and it was easily the best value hotel I've ever stayed in. The hotel is only opened since Sept '08 so everything is sparklig new. The suites are like a self contained apartment with a fully equipped kitchen stocking the best quality delph and cutlery. There is even a dishwasher and free laundry facilities downstairs. The bed and bed lien were superb (way too much bed clothes for the 110 degrees of heat). We had our own balcony too. Midweek the hotel provides an evening reception with salads, tacos, sausages etc available.. Breakfast had omelettes, sausage, eggs bacon etc as well as fruit and yogurts. Incredible service. Perhaps the rates are not so good at weekends but they can't be that much dearer. The hotel did provide a free shuttle service to and from the strip as well. It is about a two mile trip and the shuttle runs until 10.30pm. A taxi for coming home later will cost about €10. We missed the shuttle one morning (runs every hour) and decided to walk as it didn't look to be too long of a walk. MISTAKE!........ We meandered around the Manderlay hotel to get to the strip in incredible \"hot hairdryer\" type heat at 10.00am............it took ages and not to be recommended. Vegas is not made to suit pedestrians, no footpaths etc. This hotel is just great and the fact that it's not on the strip I consider to be a bonus. We visited Caser's Palace and other similar hotels..... Who wants to stay in such places when you come down to the lobby to see endless rows of slot machines?? Not for me. Staybridge gave you a break from the strip and a lot of luxury thrown in!", "Date": "July 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chandler, AZ", "Title": "“Best value in Las Vegas and close to strip”", "Author": "busytraveler50", "ReviewID": "UR34870252", "Content": "full size kitchens in room - best value in Las Vegas and amazing fitness room with views overlooking the strip", "Date": "July 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Houston, TX", "Title": "“Staybridge suite Las Vegas is value for your money!”", "Author": "Bussybee09", "ReviewID": "UR34843309", "Content": "I chose this hotel because of the great reviews I read online and I was not disappointed. Words cannot describe how clean and ultra-modern the hotel suites are- 2 flat screen tvs, dining area, beautiful kitchen with utensils and pots, large refrigerator/freezer and a balcony. I would definitely choose this place again if I plan to stay off strip. Great gym, free wi-fi, free breakfast and about 1-2 miles from the strip. Absolutely great value for my money.", "Date": "July 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "france", "Title": "“Excellent hotel”", "Author": "diddlina", "ReviewID": "UR34793947", "Content": "My husband and I stayed in this hotel on a two day trip to Las Vegas and if we ever go back, we will definitely stay in this hotel again. The hotel is 5 mins away from the Strip, which is not a bad thing. There is an excellent and reliable free shuttle service to the Strip. The staff are very friendly and helpful. The hotel is well furnished. It is probably the cleanest hotel we have ever stayed in. The complimentary breakfast is very good. Our room had a little kitchen with all that you may need, including mugs, cutlery and tea towels. There was even a small bottle of washing up liquid. There are no restaurants or shops nearby but the hotel's mini market is well stocked.", "Date": "July 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Monroe, Washington", "Title": "“Luxury at a great price!”", "Author": "vickisue54", "ReviewID": "UR34167260", "Content": "Although our stay began with a reservation glitch, I would totally recommend this beautiful hotel a bit off the strip but within a short shuttle ride. The sweet woman at the front desk told us to go upstairs to their business center where we fixed the problem. She even stored our luggage in their secured area and then upgraded us for our trouble. The room was really a condo, not even a hotel room, quite spacious and tastefully decorated. Two flat screen TVs, one in the living room and one in the bedroom. Lovely tiled bathroom with a soaking tub, double sinks, high end ammenities. The kitchen was fully equipped if we had wanted to cook, but the lovely front desk clerk had already told us about some nearby restaurants that were very good and reasonably priced. Then there was the terrific pool, spa and exercise area. Wow! We were amazed these weren't more heavily used, but glad we could feel like we were in a private club. Another above the norm perk was the full breakfast in a restaurant sized room attended by friendly staff which was probably the best we had on this and many other trips. We noted ofcourse that this property was rated #1 by TripAdvisor and I can completely agree!", "Date": "July 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Maryland", "Title": "“Nice Stay”", "Author": "severnmd", "ReviewID": "UR34147548", "Content": "We stayed here on the June 30th. The desk staff was very friendly and helpful. Even though we came about 40 minutes earlier than the usual check in time, she provided us a nice room, The room was very spacious, and had a separate sleeping are for the adults. The kitchen was beautiful and had brand new stainless steel appilances. Hotel provided the light dinner on the June 30th, and it was not bad. The breakfast was also good.", "Date": "July 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Virginia", "Title": "“New, clean, excellent hotel”", "Author": "Mr_Blue_111", "ReviewID": "UR33976480", "Content": "Stayed here on last night in Las Vegas before flying out, based on Trip Advisor feedback-- was an excellent experience. Large, modern, comfortable suite with all amenities, including full kitchen and washer/dryer--for a great rate. Not a beautiful location (next to freeway), but the hotel itself is well designed, is not noisy and offers very convenient access to the airport. Staff were efficient and accommodating. If you are looking for a safe, clean, convenient place to rest, with free shuttle to MGM Grand, this is a great option.", "Date": "July 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Mississippi", "Title": "“Great Place to Stay”", "Author": "kimrj2", "ReviewID": "UR33867037", "Content": "Overall I enjoyed by recent week long stay at the Staybridge Suites. Location is just off the strip...excellent if you want to avoid traffic and the noisy, smoke filled casions. Just walking through some of the casino hotels, the lines for check in/out were extremely long...didn't have to deal with that. Front desk/management staff was very friendly and professional. Check in time is at 3:00 p.m.; however we arrived around 12:00 and was able to check in. The 1 BR suite was really nice, flat screen tv, seperate tub and shower, double sink in tub area and another sink in the shower/lavatory area. Sectional sofa and flat screen tv in the sitting area along with a dinner table for 4. Bed was extremely comfortable with flat screen on the wall in the BR. We chose the \"strip view \" as oppose to the pool view. We had a rental so we did not encounter the shuttle bus problems mentioned in the other reviews. Problems -- Being that we stayed for a week, the first 3 days the maid service was wonderful. However, around mid-stay it was horrible. One day we did not receive services at all and had to wait an hour or so for towels. The next day, the bed was made, but the tub had not been cleaned, only a few towels were left (no hand or face towels). One day I thought I saw the maid take a hand towel from one rack, turn it inside out, and place it on the other rack (wasn't for sure so I didn't say anything). At the end of the stay, I was totally disgusted with the maid service. I had planned to leave a tip at the end of the stay; however, the only tip she received was to do a BETTER JOB! Also, our room was above the workout facilities and I had to call the front desk several times to complain about guests dropping weights...very annoying! Just don't stay on the 3rd floor above the workout facility (which is on the 2nd floor). By the way, they did offer to move us, but who wants to pack up all their stuff and move???? Other than that, the hotel is a good choice for the $$$ (around $100 a night) to be near the strip. I would definitely stay there again.", "Date": "July 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Came away impressed”", "Author": "NeverUnpacked", "ReviewID": "UR33697932", "Content": "We came to town the night before we had originally planned (we travel space available), so we chose a room here (at $90) for one night rather than an extra night (at $569) at Mandalay Bay, which is down the street and where we were spending the rest of our long weekend. Our experience here at Staybridge was very positive. Check in was quick, and the desk clerk and security guard were very friendly and helpful. We opened the door to the room and were impressed with the space and amenities. Everything was clean and new. We decided to take the night off, relax in the suite, have a cocktail on the small veranda and move on in the morning. The bed was very comfortable so we slept in on Saturday and nearly missed breakfast. The one problem was that there were no eggs by that time (9:20 am). Everything else was adequate, but not spectacular; we brought our meal back and ate in the room since the breakfast area was quite full and everything we needed was in our own kitchen. Before leaving, we decided to check out the pool. There were only a few people there, so rather than fight the crowd at MB, we checked out of the room but asked to stay and use the pool, which was fine with them. We spent the day relaxing in the sun (and shade) on the padded lounges and retiring to the (free) cabana for a quick nap. There were no added amenities with the cabana (TV, shower, personalized service) like other pools, but it was just right for our day. We stayed until mid-afternoon and proceeded to the rest of our weekend at Mandalay Bay. Our stay was only for the one night and since there were only two of us, our reservation was accurate and we had our own rental car for transportation, we didn't encounter any of the problems that a few other guests have experienced. We found it to be a very good value and would not hesitate to stay here again.", "Date": "July 1, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Colorado", "Title": "“Not that great!?”", "Author": "Senor6", "ReviewID": "UR33581720", "Content": "Upon further review there seems to be some kinks in the Staybridge armor. Check-in was a breeze and very friendly front desk staff. We were given 3 keys and quickly headed up to our pool facing suite. All amenities appeared to be in working order and clean. As bedtime approached (we were there on a semi-business trip) we discovered that the pull out sofa had no linens. Why I ask were we not informed of this at check in? Service?? So a phone call was made to the front desk around 10ish and he said it would be up right away with the linens. 30 minutes pass and no linens, junior is getting tired and would like to rest on his sofa sleeper. Now I go down to the front desk and demand the linens and refuse to leave until they appear. He had forgotten to call housekeeping and they were on their way, yadayadayada. So I wait at the front desk another 10 minutes or so for them to finally arrive. We put junior down and all is good or so it seems. Now it is past 11 and granted it was a Friday night, but the rock music (great tunes) wa sblaring by the pool and numeorus guests were enjoying a late night dip. My experience with hotels in Vegas is around dusk they close, not here. So at 11:15 another call to the front desk asking them to turn off the LOUD music and ask the guests to leave the pool area. 30 minutes pass and still we hear Smoke on the Water at a party level. Finally the misses has had enough and she marches doewn to the front desk. They were engaged in conversation (front desk and security guard) and had forgotten about my earlier phone call. Said something like; \"I didn't realize that the music was still on.\" So to make a long story short; rooms are nice (ask for linens at check in), exercise room well equipped, breakfast is fine (no bacon!), location is convenient to south strip,but service is lacking if non existent. So often in Las Vegas the hotel staff really go out of their way to ensure that the guest is satisfied and this was definetly not the case at the Staybridge Suites.", "Date": "June 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Oro Valley, AZ", "Title": "“As Great as We Had Hoped”", "Author": "jbellour", "ReviewID": "UR33500244", "Content": "This is a great find. We decided to go to Vegas on the spur of the moment and booked the Staybridge based on TripAdvisor #1 rating. Did I tell you I love TripAdvisor? The room was ready when we arrived at 3 pm, and it was a great little suite with a 4th floor view of the Las Vegas Strip. The room was spotless and well designed with nice high ceilings, unobstructed balcony views, an efficient kitchenette with all table settings, cookware, etc., and a spacious bathroom. The hotel is about a quarter mile from Las Vegas Blvd (the \"Strip\") just East of I-15 at the Russell Ave interchange. While the walk is feasible, it is a little long on a hot day. I'd recommend you take the hourly hotel shuttle that goes to a major hotel on the Strip. Or if you have a car, drive to one of the free parking garages of any mega-hotel/casino and make it your base for little walking jaunts on the strip, then drive back to the hotel. The Staybridge is very accessible, and is certainly much quieter than any of the Strip Hotels. The staff, from the front desk to housekeeping to the breakfast room, were all gracious, helpful and made us feel like special guests. Plus, it's a NO Smoking hotel. AND they have a great complimentary breakfast each morning in a well furnished lounge area, with real scrambled eggs, bacon/sausage and make-your-own waffles. This hotel is an excellent value. We were treated very well with service you'd be lucky to get at a hotel at 3 times the price. We'll definitely return.", "Date": "June 29, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Pontiac, MO", "Title": "“I really wanted to agree with the others!”", "Author": "bushlamo", "ReviewID": "UR33440451", "Content": "After reading all the reviews on TA, I changed a two-night Las Vegas stay from the No. 2 hotel to the No. 1 TA rated Staybridge Suites. Now, I'm a tad sorry I did that. All other reviews on TA are pretty accurate--the hotel itself is great, the staff is for the most part, friendly and professional. It SHOULD have been a great stay. So want went wrong? Here comes the list: 1. Upon entering the room, noticed a very nice dark brown sectional sofa with one cusion from another sofa (it was bright green and white). Could have been overlooked, but a bit tacky! 2. Three people in the room with a sleeper sofa and a separate bedroom. No linens for the sleeper sofa. Had to call the desk. My opinion only, but they should have known that with three people we needed the extra linen. 3. Only one roll of toilet paper in room--that three people thing again. 4. On the second day, the air conditioner was not cooling efficiently. Maintenance tried to fix it, but said the room would have to be shut down. We opted to say in the room rather than move, however, another item was added to this list. 5. Maid cleaned room, said she would bring fresh towels later. When she brought them back, they were damp. Used or poor drying? 6. First morning there were no eggs at the breakfast bar. Several people had to wait to get scrambled eggs. 7. They advertise \"Sundowners\" with beer and wine, and a \"limited bar\" on their website, however, they have no liquor license as yet and have neither. 8. There is apparently a governor on the shower handle. You couldn't take a HOT shower if you wanted to. It was, at best, a bit above lukewarm. 9. And now, the straw that broke the camel's back: We were told on check-in of the shuttle service to MGM Grand and told it ran on the hour, or if needed, call, and it would pick us up right away. The last night in Vegas, we hurried to catch the shuttle on the hour. We arrived 10 minutes early, no shuttle. Another couple was also waiting. Called the hotel and was told \"He should be on his way, if not we'll send him.\" Thanked them and sat down to wait. It's about a 10 minute trip. Sat down to wait. No shuttle. Called the desk again. \"He's on the way. Should be there soon.\" Half hour later, the shuttle showed up. Driver said he was sorry, but had to go to the airport. So, for an hour, because no one told us where the shuttle actually was, five of us stood around waiting. We could have had a drink, did a bit more touring, whatever. Instead, we waited by the pick-up point because he was supposedly going to be there \"any minute.\" Not a good way to run a railroad (or a shuttle)! In closing, all I can say is that if these folks get it together there, they have a wonderful place to stay in Vegas, but I cannot say that I truly enjoyed my stay there this time!", "Date": "June 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“Very very pleased.”", "Author": "trooper2009", "ReviewID": "UR32732500", "Content": "For £60 you get a huge place with all nice and new finishes. Also the pool is ace and nice and quiet. Only thing i would highlight is the shuttle bus needed to take you to strip on the hour and takes 10 mins- this ends at 23:00 - taxi fare from strip only $13 roughly. This hotel is away from the stip with no games/casinoes nearby - great for quiet get away after the full rush of Vegas- I would go back there again as i liked the peace before the buzz! Oh this hotel is right next to the motorway- although you don't hear a thing with the new doors/windows- nice to be away from the strip and i at 29 love loud partying although loved the peace.", "Date": "June 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "san diego", "Title": "“Great Place.. Everything was just as all the reviews said!”", "Author": "ritapopita", "ReviewID": "UR32537857", "Content": "I chose this place based on all the great reviews.We were very happy. My husband was very pleased with big screen t.v. and the very comfortable bed. The breakfast was yummy and lot's of choices. If you don't want to walk through a huge smoke filled casino to get to your room a half an hour later this is the place to stay.", "Date": "June 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dayton, Ohio", "Title": "“Lovely”", "Author": "Czufam", "ReviewID": "UR32494048", "Content": "The hotel is everything that has been described in the posted reviews. I would however change a couple of things about the shower. It has no place to set soap and shampoo, not even an upper ledge. While the shower itself is about 4' x 2' the shower head and handle to adjust it are facing the side that is 2'.", "Date": "June 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Omaha, NE", "Title": "“Can't beat this one if you want to stay off the strip.”", "Author": "tannedboy", "ReviewID": "UR32328152", "Content": "Hotel was brand new. Great pool, free breakfast, free shuttle to and from MGM Grand. The rooms were huge and gorgeous. Our room had a living room, kitchen, dining table, bedroom with king bed and large bathroom. Stayed at Caesar's Palace two nights before staying here. Staybridge rooms were a lot nicer (and were less than $100/night). If you are looking for a great place that is off the strip yet really close, you can't beat this place. The pool is large and has plenty of seating available. I still can't believe this place is around $100/night!", "Date": "June 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Arizona", "Title": "“Great value and service”", "Author": "s_geo", "ReviewID": "UR31807340", "Content": "I researched this hotel on tripadvisor before choosing this hotel due to its rave reviews. Good news is that we enjoyed the stay as well. We checked in earlier than 3 pm with no issue. All matters were handled quickly and with ease. Location is well suited to be away from casino busyness. Very close to the I15 freeway as well..", "Date": "June 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "New Mexico", "Title": "“Fabulous Find!”", "Author": "TencatNewMexico", "ReviewID": "UR31777204", "Content": "We stayed at the Staybridge Suites for four nights during a family vacation based on the reviews on this site, and we were not disappointed. From the time we checked in to the time we left, we were treated so well by all staff we encountered. They were friendly and helpful. When we checked in we needed a crib and roll away bed. Both were brought to us promptly, with a few extra pillows and blankets that we hadn't asked for, which was a nice touch. The room was probably the quietest room I've ever stayed in; no in-hotel noise could be heard even when the hotel was at full capacity. We had a nice view of the strip from our room. The room had a washer and dryer which came in handy with a 2 month old baby. The only thing that could be improved is the breakfast area which does not have enough indoor seating. All in all a wonderful stay at an affordable price. We'll stay there again!", "Date": "June 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Australia", "Title": "“Fantastic Value and Quality”", "Author": "Eb0y", "ReviewID": "UR31520444", "Content": "Me, my wife and my 16 month old stayed for 4 nights while visiting Vegas. The place was near new and well appointed with full size kitchen, washer, dryer etc. The swimming pool and BBQ areas were excellent as was the gym.The hotel was spotlessly clean throughout. All the staff were very friendly and helpful. There is a regular shuttle bus going to and from the Strip dropping you at the MGM Grand (about a 2 mile drive). We found the hotel very child friendly and was a very relaxing place to stay so close to the hustle of the Strip. It was fantastic value for money as I think we payed only about $90 a night. I highly recommend the Staybridge Suites of Las Vegas.", "Date": "June 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "2", "Rooms": "4"}, "AuthorLocation": "Seoul, South Korea", "Title": "“Super nice staff and big rooms! A top value in Las Vegas.”", "Author": "Westinhan", "ReviewID": "UR31501035", "Content": "Staybridge Suites Las Vegas is less than 10 minutes away from the airport and is located next to the 15 Freeway. You can sometimes hear planes flying by, but it is not noisy enough to keep you from sleeping (and I am a sensitive sleeper). They cannot pick you up from the airport due to local laws, but they will drop you back off for free. Nearby are other similar-looking Suites and motels. The location is not convenient as it costs about $15 by taxi to get to the Las Vegas Strip. If you have a car though, I don't think it will be a big issue. There is a free shuttle provided every hour, at the hour to the MGM Grand Las Vegas Hotel & Casino. The front desk staff are super nice and they really go out of their way to be helpful! I would say they are one of the best hotel staff that I have ever experienced. I really want to commend them for their service. They are the highlight of this hotel. I would describe them as friendly, attentive to detail, kind, and busy! A single staff member will juggle multiple phone calls, someone trying to buy something at the store next door, and try to help you. I especially liked the black lady though I don't remember her name. I give them all a big thumbs up! The lobby is quite nice. This is a four-story building that I believe was intended to be an apartment or condo-type of thing. There is a pool (it is okay) and a couple of jacuzzis outside. And there is parking in the front which I believe is free. Because these were intended to be apartments, they are very big! We stayed in the King-size bed bedroom suite and there was a bedroom with King-size bed, a very large bathroom, a living room, a kitchen, and balcony. It was wonderful that a washer and dryer were included. You can buy detergent for $2 at Bridgemart which is basically a space next to the front desk where they have food, beverages, and other items and is run by the front desk. I would describe the furnishings as upscale middle-class. The room was very nice, but I would not call it luxury. I really liked the fact that it was a full apartment with kitchen and I think this would be a great place to stay for a week or so, if you're in Las Vegas. The only issue I had was that the toilet cover would slide to the side a bit when sitting on it and the bathroom toiletries were not top-quality. I even found a used soap at the sink. Also, the first day the cleaning staff did not come by until it was too late (around 4pm?) to clean up. They missed the second day, too. There is no room service. So we had to order food in which was fine because the front desk staff gave us delivery menus (American, Italian, Thai, etc.) and the food can be delivered direct to your room. The Thai is excellent! I was very surprised as the portions were huge, the prices cheap (all under $10), and the dishes we ordered were very tasty (almost authentic Thai and very spicy, if you ask for it). I had read here at Tripadvisor that the breakfast at the hotel was really good, but we did not experience any of it because we woke up late each morning. Breakfast takes place in a large room with a TV screen on CNBC. The room didn't look too special, but it appeared they had unlimited soda and coffee available. The guests are basically middle-class Americans. There was one thug-like type with low-hanging jeans with his somewhat trashy-looking girlfriend. But I didn't mind them too much as they seemed alright people. Anyhow, I really enjoyed my stay here. It was very comfortable and again the staff are excellent. SUMMARY: The staff at Staybridge Suites are really great and the black lady is awesome! I love her. At the prices they charge, this is a top value even in Las Vegas and I noticed two separate incidents when guests asked for long-term or frequent guest rates as they seemed to very much like the place. They were both people who apparently come often to Las Vegas, so I assume they know comparative value. I agree with their assessments as I would definitely stay here again, especially for a longer stay in the city.", "Date": "June 3, 2009"}], "HotelInfo": {"Name": "Staybridge Suites Las Vegas", "HotelURL": "/ShowUserReviews-g45963-d1197075-Reviews-Staybridge_Suites_Las_Vegas-Las_Vegas_Nevada.html", "Price": "$135 - $175*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">5735 Dean Martin Drive</span>, <span class=\"locality\"><span property=\"v:locality\">Las Vegas</span>, <span property=\"v:region\">NV</span> <span property=\"v:postal-code\">89118</span></span> </span> </span> </address>", "HotelID": "1197075", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/6e/db/6edbe7afce37fbd75ca4b83c6440d2c76large.jpg"}}