{"Reviews": [{"Ratings": {"Overall": "4.0"}, "AuthorLocation": "enschede", "Title": "“great stay”", "Author": "Pinkeltjes H", "ReviewID": "UR119368980", "Content": "The hotel looks great on the website, but the actual experience far exceeds what a picture can convey. The hotel has a sophisticated yet cozy ambient. The magnificent marble hall with oak boasserie invites you in to read newspapers and relax with a glass of wine. Our suite had a private terrace with a great view of the rooftops of Rome and Villa Borghese Park. The hotel within a walking distance from the city center, but there is a magnificent complimentary shuttle which connects you every half an hour with Piazza di Spagna. Above all, most of things are just superb, and personal is savvy, but I still fail to understand how a LHW hotel chain broadband WiFi internet access is less than seamless sometimes.", "Date": "October 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Honiton, United Kingdom", "Title": "“Fawlty Towers!”", "Author": "Lorrieritchie", "ReviewID": "UR115331979", "Content": "My cousin booked this hotel through Bookings.com. The website looked excellent, and the rooms were air conditioned, in a quiet neighbourhood. A week before we were flying, I emailed the hotel direct to ask about arranging airport transfers (as advertised on their website). I did not receive a reply. I tried to ring but had great difficulty in making myself understood or understanding the person I was speaking to, and was told to email again and they would reply. I emailed again, quoting the booking number, my cousins name, and advised them we would be late arriving. I did not receive a reply. At the airport our plane was delayed by an hour, so we asked an italian speaking person to speak to the hotel and explain we would be even later. As she put the phone down, she said something to the effect \"good luck with this one!\" When we finally got to Villa Borghese Resort (6 bedrooms on the 1st floor of a building), the \"night porter\" (aka Manuel) informed us that there was a problem with the water and he was sending us to another hotel. Bearing in mind it was now 11.30pm, in a strange city, and 2 females, we were not happy. He couldn't tell us where in Rome the other hotel was, he would not pay for the taxi but said the hotel at the other end would. He would not let us speak to the other hotel, and said the internet was not working so we could not see the other hotel. We refused to go to another hotel, so he said he may have a room upstairs but \"problem with water\" but could use a shower and toilet downstairs. We agreed to this and were taken up to a very nice room........ with no air conditioning and bedside lamps with no plugs to plug into. He also could not provide a fan. We flushed the toilet and he agreed that the water may be ok on this side of the building. We gather the room was halfway through refurbishment but beds were made and towels laid out on bed. After a hot and noisy night (with windows open to try and cool the room down) we went back downstairs to pay for our accommodation. We now met \"Sybil\" and witnessed some heated arguments between Sybil and Manuel, particularly over whether we could or could not walk to the Vatican. We said we would consider changing rooms later if \"water was fixed\". However, due to the hotel being further out of the centre than we expected, we did not get back during the day and so crept in at 11.15, too exhausted to face Manuel again. AFter another very hot and noisy night we asked to now change rooms, but was told that the rooms were now booked. We accepted this and went off out again, after asking again for a fan and being told no, returning back at 11.00pm. As we entered our bedroom area, and turned on a light, all the lights and power blew. So down went my cousin to wake \"Manuel\" up to come and fix the lights. He didn't have a clue, so grudgingly agreed to move us downstairs - to a room which was non existent earlier in the day! When I questioned him on this he didn't have a valid answer. So we had a lovely sleep in an air conditioned room. Fortunately we were able to laugh about our experience, but are convinced that had not been a water problem, and that our room had been double booked. WE were charged the full price despite the problems, and then to add insult to injury, my cousin had an email from Bookings.com on our return to say we had not turned up and would therefore be charged a penalty fee! The rooms themselves are nicely furnished, very clean, and the beds were comfortable, and I am sure once air conditioning is fitted in the room we were in the room will be wonderful. However, the whole experience was spoiled by the inefficiency of the staff and the fact we were lied to on several occasions, such that we definitely would not stay there again.", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Italy", "Title": "“Not to be recommended”", "Author": "paolooo067", "ReviewID": "UR115111923", "Content": "Bad service, low-quality breakfast, not very clean. The person in charge of the night shift is the most incompetent, annoying, bad-mannered employee I have ever met in any hotel or bed & breakfast I have ever stayed before (and there are many!). Location would be good, rooms are big, but overall it is pretty bad. While two years, when it was just opened, the quality/price ratio was good, this is not the case any longer.", "Date": "July 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Paris", "Title": "“Quiet, residential hotel near Villa Borghese Park- good value for money.”", "Author": "cocoa_mo", "ReviewID": "UR31388198", "Content": "We stayed at the Villa Borghese Resort in May, and we enjoyed our stay overall. The room looks exactly like the pictures, and is big considering typical rooms in Europe and central Rome. We even had an extra bed in our room, although we didn’t ask for it. Clean and modern- good deal for the price. We found the location to be particularly convenient for those who want to stay away from the loud, touristy part of central Rome but still be close enough for convenience. We were 10-15 minutes away by bus from all the major sites and even walked home once when we needed to digest a big meal.  The staff was helpful and friendly, although not everyone spoke English. We managed to communicate what we needed without any problems. The breakfast left something to be desired, and there is absolutely nothing “resort” about this place- it’s more like staying in a private residence. However, we would stay again on a future trip! Note: if you are staying here, there is not a big sign outside the building just a marker on the doorbell- especially hard to see at night from a cab. ;)", "Date": "June 2, 2009"}], "HotelInfo": {"Name": "Villa Borghese Resort", "HotelURL": "/ShowUserReviews-g187791-d1198058-Reviews-Villa_Borghese_Resort-Rome_Lazio.html", "Price": "$85 - $144*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Tevere 15</span>, <span class=\"locality\"><span property=\"v:postal-code\">00198</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "1198058", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/2e/5c/2e5c1e7f5e0b687a47b2e8e1dfd943421large.jpg"}}