{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Rochester", "Title": "“Fine budget hotel”", "Author": "michaelstrachan", "ReviewID": "UR126231150", "Content": "We booked this hotel as we were visiting friends in Dubai for the weekend. The rooms we quite small but for the price acceptable. The bed was comfy enough but the bathroom was very small. There were no tea/coffee making facilities in the room and minibar. For drinking water there were vending machines on each floor which you needed coins for- reception didn't have any change. We popped into the Madison bar which was a bit soulless and the service was pretty poor though again it was cheap so acceptable. We tried the Latin bar for an early evening drink but it was dead. Although we didn't eat there we did have a peek at the buffet. Didn't look very appetising. The hotel did have a pretty good location though and we could get to the mall of the Emirates or Jumeirah in minutes.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Value for money with little adjustments!!!”", "Author": "beenakothari", "ReviewID": "UR125780184", "Content": "Value for money however rooms are very small. Staff is not very supportive. Still I enjoyed my stay since its not very far from the mall of the emirates. The metro station sharaf d g station is also not very far!! If u want to stay at decent place and don't want to pay much then this place is good!!!", "Date": "March 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Cairo, Egypt", "Title": "“Typical IBIS: Best Value vs. Money”", "Author": "Hossam_Elgeneidy", "ReviewID": "UR125176439", "Content": "- Very Low Rates - Huge value for the money you will paying I would highly recommend it for travelers going to Dubai on a low budget", "Date": "February 25, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Good Location / Standard Room”", "Author": "timurthemimur", "ReviewID": "UR124792555", "Content": "Location was good, it was a standard Ibis Hotel with a room with reasonable size. (Like all the other Ibis hotels there was no fridge in the room) clean & good location. Free Wi-Fi in the lobby. I stayed in this hotel in 2011 and at that times there was no alternative hotels with similar prices... since there are many alternatives in Marina & Tecom region now (which are newer / better equipped / better location) this hotel should reduce their prices or I don't think they'll survive long.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Very basic, location not easy to reach, staff underqualified, left item in the room and got 'lost'”", "Author": "Serenellaferraro", "ReviewID": "UR124440784", "Content": "After my checkout I realised I had left a Hermes bracelet in the room, I called the Hotel and it was gone. Super basic hotel, staff is underqualified. After waiting for 1 hour for an iron they brought it but the guy removed the adaptor, it had an european plug and it didn't fir the ones in the rooms which are British... Location a bit in the middle of nowhere...", "Date": "February 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Gurgaon, India", "Title": "“Comfortable and cosy”", "Author": "ParamitaC", "ReviewID": "UR124372334", "Content": "The hotel has a good location being quite close (walking time: 15 min) to the Metro station- Sharaf DG and Mall of Emirates (next station). Rooms are very clean but small while the bathrooms are smaller. They also do not have bell boy services.But the security guard was kind enough to help us with our baggages. Checking in took a longer time than expected as the rooms were not available. Guess pre-booking do not have much sanity. The breakfast spread is good and was quite swift in refilling and cleaning.The wide variety of food would definitely fill every guest's pallate. The staff is efficient although we had just a slight problem in getting the adaptors. Tolietries include shower gel/ shampoo and hand wash with a blow dryer. Clean towels (two large ones and one small one for a double bed room) were changed every day. Indians should carry their own adaptors for charging. Local landline phones are free while for international calls they request to purchase a calling card of 40AED. Television sets are LCDs with cable channels buzzing with mostly Arabic channels with one or two english and hindi channels. In all can definitely consider IBIS Al Barsha provided you are comfortable with the small sized rooms and bathrooms. But then advisable to stay outdoors to soak in the city's warmth rather then get stuck up in the hotel rooms.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tehran", "Title": "“Enjoyed it”", "Author": "Nil0ufar", "ReviewID": "UR123898856", "Content": "It was very convenient hotel.Good value for money.the room was not big but good enough , clean & neat, breakfast was good & economic the area for break fast was good also it offer an out door area which was very good, bathroom was small but clean. there was no water or .. in the mini bar but a machine available in each floor that offers drinks. free internet available in lobby. I will go back again.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Riyadh", "Title": "“platinum member”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR123831831", "Content": "Greetings, the hotel is good at many levels, I have 2 complaints that I hope you take seriously: 1- I am platinum member, so when I arrive at reception, I go straight to the Accord privileged members stand at reception, yet there is no one! the hotel is busy, so all the receptionists are at the normal stands receiving the other guests, and the privileged guests have to wait!! that is unacceptable! you must have 1 person dedicated for us! 2- I use my vouchers to pay, so upon arrival I submit enough vouchers to cover my stay and my food or drinks consumption, yet when I go to the restaurant or bar in the hotel and sign the bill to my room, the waiter tells me that I don't have credits on my room!! the receptionist must log the vouchers in immediately upon check in the system, so that I can order my meals and drinks to my room. I am going back to this hotel this weekend and will be for many weekends to come, I hope I will feel that my comments have found listening ears! thank you", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Doha, Qatar", "Title": "“good value in Dubai”", "Author": "eric m", "ReviewID": "UR123200025", "Content": "as I came on short business trip in Dubaï, I really enjoyed to stay in Ibis Al barsha, Good value between the service and the final bill I will recommend this hotel and come back for my next trip", "Date": "January 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Taree, Australia", "Title": "“An enjoyable 2 day stay”", "Author": "Cherie M", "ReviewID": "UR122338031", "Content": "My room was clean & in a good state of repair. The bathroom was a little small & it would have been nice to have tea & coffee facilities in the room, which is accepted as the norm in other places I've stayed in other parts of the world. I arrived very early morning & there was a room ready for me. I found the staff to be pleasant & helpful. The food was good & plenty of it. I would gladly visit again & hope to one day. Thanks guys for making my holiday memorable in all the right ways.", "Date": "December 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Athens, Greece", "Title": "“Good Value”", "Author": "Fishingboat", "ReviewID": "UR122128896", "Content": "We booked hotel online and got an excellent price. Equivalent of 50 GBP for a double room inclusive of breakfast. Previous reviewers have noted small rooms which I would agree with. However, for a short stay they are in my opinion, absolutely adequate, quite new and very clean. The breakfast was average and served in a rather loudly decorated cafe type room. The worst thing here was that they are using very slow automatic machines to dispense the tea and coffee. One of these was defective resulting in long queues at the two, still functioning machines. In conclusion, I would say this is a good value choice for a short stay. Shopping trip or business tripbut not for someone staying longer and expecting to experience the type of luxury and service that can be found in Dubai’s 5 star hotels..", "Date": "December 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "1", "Location": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“IBIS never again”", "Author": "Coopoerman1956", "ReviewID": "UR121915283", "Content": "Stayed here with friends in October. Room was so small, the two of us sharing a room had to be very friendly! Not enough pillows, or storage space. Wi-Fi was not reliable. Forget about the 15 min promise to resolve complaints - the suggestion that was given to me was to leave and try another hotel! Waited ages for extra towel to take to beach and missed the bus. Location not great as you either need to walk along dusty tracks or take a taxi every time you want to go out. The bars were full of drunk expats who did not seem to care about the price of bottled beer. Personally, I would never stay in an IBIS again and would never recommend.", "Date": "December 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Budapest, Hungary", "Title": "“An Easy Place to Stay in Dubai”", "Author": "Teachrman", "ReviewID": "UR121734941", "Content": "I stayed at this hotel from Dec 5 through 12, 2011, and found pretty much everything well-done, well-maintained and well-taken-care-of. The staff were friendly and smiling, always eager to help, efficient and pleasant at all times. never a grumble or frown, The premises were clean and well-kept. Location is a touch inconvenient, but a 15-minute walk from a metro station and easily accessible by taxi. Value for price is excellent. I know there were some dissatisfied visitors who also rated this hotel, but my experience was only - I repeat, ONLY - positive. Everything was done in a highly professional manner. I would be pleased to stay here again and to recommend it to single travelers.", "Date": "December 14, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Sydney, Australia", "Title": "“NOT worth it”", "Author": "mosman2088", "ReviewID": "UR120708529", "Content": "This hotel is on the Emirates contract list, & promoted as a 24 hour checkin hotel with room guaranteed on arrival - NOT!!!Don't arrive Emirates flight at 07.00, NOT a room without a fight at reception, 15 min Guarantee does NOT apply, NOT a Fridge in the room and its 40Degrees outside, NOT enough space to turn around in the room NOT helpful, NOT local, NOT great Breakfast, NOT Worth it", "Date": "November 17, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Riyadh, Saudi Arabia", "Title": "“ibis”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR120604923", "Content": "it is good hotel but the bathroom was small and the fridge was not cold, the location is far away from the center (burj Khalifah) but is too close from the metro station. but in general the hotel is good", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Al-Ain, UAE", "Title": "“Decent value for money”", "Author": "Mike and Ann i", "ReviewID": "UR120556072", "Content": "It's a little bit far from Mall of the Emirates but there is a train stop nearby and free parking. The rooms are small but spotless, beds are comfortable (a bit hard which I like) and walls are thick enough so you don't hear your neighbors talking.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“zero star”", "Author": "Up S", "ReviewID": "UR120423771", "Content": "Tiny and terrible! Rates have gone up to 'compete with other hotels' according to receptionist BUT no extra value added for rate increase! A 'do it yourself' hotel with misleading promises! The 15 min problem resolution service or be our guest for free promotion doesn't apply if you call for an iron and ironing board! There is no mention of what the 15 min service applies to though so don't expect a free stay because what is not written down can't be argued as i found out!!!.....My advice is that you buy a tent and camp out!", "Date": "November 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Jeddah, Saudi Arabia", "Title": "“just ibis nice standers”", "Author": "Abdulwahab B Posted by an Accorhotels.com traveler", "ReviewID": "UR120283829", "Content": "small room , very small WC like you are in airplane ,location ok if you have car or use taxi and want to be near JBR and emirats mall ,metro walking dist but not during summer days ,internet very slaow in loby but in room very expensive ,bed is ver hard good for few hours sleep and after that you have backeach", "Date": "November 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Tauranga", "Title": "“Budget basic - stopover hotel”", "Author": "Patsprat", "ReviewID": "UR120239233", "Content": "We were booked into this hotel as a stopover on our way from NZ to the UK; it served the purpose but certainly wasn't providing any frills. A standard smallish room, with only the most basic furnishings and needed more than the 2 small towels provided in the bathroom. A handtowel would have been nice and certainly a bathmat to help contain the water from the shower - there wasn't a 'lip' to prevent water spreading out over the rest of the small bathroom which made it messy and you stood in a puddle when using the handbasin. Not nice. Airconditioning was efficient thank goodness and the room was clean and spartanly tidy. Bed was very firm indeed. Overall adequate for a brief stopover (but ask for bathmat and/or extra towels) but not a relaxing place to stay for a longer period. In fact, as a stopover hotel it was relatively distant from the airport, good for visiting the mall of the Emirates and other attractions.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Sydney, Australia", "Title": "“Dubai”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR120132559", "Content": "When I first came there the Taxi driver was confused which Ibis Hotel when I said Al Barsha as there were 2 in Al Barsha and later on when I was in my tour group they all said there was plenty of confusion with these two Ibis Hotels in Al Barsha with Taxi drivers and tour drivers. First impression of the first staff I spoke to Marshina or something had a attitude problem and did not smile. I was waiting in line until a rude customer went in front of me and pushed in line and even though Marshina witnessed this she still served her and was rude to me. Service is nice enough but found most staff unacknowledged with services and my questions with local questions. The bar staff was very rude always asking if I have paid a bill in the kitchen (which was not even his department and to which I already paid) and he done that to the rest of the customers as well in a rude manner. Although most staff was nice I found them to be incompetent with information on local services and questions I had. People running the Coffee shop was nice and give them praise. The lady Ruby was also very knowledgeable and helpful during my stay which gave me good memories of service of the hotel.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Exceeded expectations and great value!”", "Author": "Kiu", "ReviewID": "UR120093367", "Content": "I stayed at the Ibis Al Barsha for 8 nights in September 2011. This was recommended to me for its location and low price. As always I checked the reviews on TA prior to booking and there was mixed reviews but its unbelievably low price could not be beaten at the time. I managed to find a rate of £27 GBP per night including breakfast! It is a basic hotel in that it does not have any gym or pool facilities but the standard of the rooms and the hotel itself was the same, if not better, than many 4 star hotels I have stayed in the UK. The hotel and rooms are very clean and well maintained. I often saw managers or senior staff carrying out inspections around the hotel. The Reception staff are friendly and polite and check-in and check-out went smoothly. Free wi-fi in the lounge, cafes and restaurants is a bonus. Wifi is chargeable in rooms and is expensive. Easier and cheaper to pop to the lounge. The cafe is 24 hours which is good for getting a drink or snack or using the computers and internet for free (time limited). I booked a double room for single occupancy. The room was spacious and is exactly as the pictures you see online. The bed was big and comfy (I like a firm mattress) and there was even a small fridge in the cupboard which was great for keeping drinks cool. There are vending machines on each floor selling snacks and drinks. The only slight con if I was to give one was that the bathroom was small and there was no bath. The shower only had half a glass screen and no shower curtain so the floor could get pretty wet. The trick is to try and keep the aim of the shower towards the inside walls! A multi-purpose wash (hand/hair/shower gel) is installed by the sink and in the shower which is usually not expected of 2/3 star hotels. The only thing that was missing was tea/coffee making facilities so I did missing having a cup of tea in the mornings or a hot drink before bed. There was a good selection for breakfast of cereals, fruit, hot breakfast foods, drinks and teas/coffees. Exceeded my expectations for this hotel. I never tried any of the food from the other restaurants or cafe as I always went out. The location is good if you have a car or prepared to take taxis which are very cheap. The hotel is kind of located in the middle of no where but is close enough proximity to main areas. There is not much in its immediate area. The nearest metro station is 'Sharaf DG' and about 5-10 min walk but it is not an easy walk especially in 35+ heat. It involves walking along the main road and crossing two roundabouts with no obvious pedestrian crossings. Taxis are very cheap so I would suggest taking a taxi to your location or to the metro stations: Sharaf DG or Mall of Emirates (5 mins drive). Note, the beach is not 'accross the road' as any maps may lead you to assume! Approx distances/costs by taxi: Jumeirah public beach and beach park = 20 mins (30 Dhs) Mall of Emirates = less than 5 mins (10 Dhs) Dubai Marina = 15 mins (25 Dhs) Dubai Mall/Burj Khalifa/Downtown = 30 mins Airport = 20 mins (40 Dhs) (Taxis from the aiport to the hotel are aprox 80 Dhs) Warning re hotel taxis: There 'hotel taxis' located immediately outside the hotel with nice white cars. The men are very quick to approach you and pursuade you to take their taxi for a fixed price but be warned, they charge double the usual fee of a standard taxi! There are always standard taxis outside the hotel (to the left of the entrance) so just say no thank you and walk away. FYI: Taxi to the Mall of Emirates takes less than 5 mins and costs 10 Dhs which is also the minimum fare (hotel taxi charge 20 Dhs). Always wave down a taxi, never call and book one as this is much more costly. The hotel is fairly new so many taxi drivers may not know where it is. There is an Ibis hotel by the Mall of Emirates so you could be taken there instead. Here are directions to the hotel: Drive to Al barsha on Sheikh Zayed Road, take the exit at Mall of Emirates (Jebel Ali/Abu Dhabi), continue along side Sheikh Zayed Road (SZR) but take the 'Service road' which is a two-lane, two-way road that runs alongside SZR. Continue on this road crossing two roundabouts until you see the hotel on the left hand side. Look for the opening in the barrier and enter onto the hotel grounds (desert). If you miss the turning off SZR or do not take the 'Service Road' you will have to stay on the main road and go all the way around and back to the Mall of Emirates as you can not turn off from SZR! Note many taxi drivers are new to the country so do not know much of Dubai. Even having an address can be useless! Always carry a map and if possible, the telephone number of your destination should you need to call to get directions for the taxi driver. Overall I was very impressed with this hotel considering the mixed reviews on TA and it exceeded my expectations. I had a very pleasant stay and would certainly return again.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“nice staff”", "Author": "broadbase", "ReviewID": "UR119854420", "Content": "Stayed in the hotel in the middle of feb this year. I did ask the travel agent to be near the shopping centre. budget hotel was awful. For the money i paid, i could have got a 4 star in the district where i asked. there was not even a complimentary bottle water in the room on arrival and anyone who has been to Dubai knows how hot it is. The bathroom was very small, i struggled to get in. there were drinks machines to buy water but it was always empty. i complianed to the staff and the gentleman was very attentive to my needs, but still paid a fiver for a litre of water. i did tell him, that wasn't the hotel i had booked, he confessed they had made a mistake in the allocation and i should have been in another ibis in the Deira area.as there was a trade fair at the time all hotels in Dubai were full and could not change to the novotel next door. Its was too far from city centre and cost a lot in taxis. There were no tea/coffee facilities in the rooms either and i think that should be a minimum requisite and most certainly water must be in the room when your arrival. I am going back to Dubai but will never stay at this hotel as i will never stay in an Ibis in the UK.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Riyadh, Saudi Arabia", "Title": "“Budget hotel - value for money”", "Author": "vin6", "ReviewID": "UR119820460", "Content": "Stayed here for 9 nights on a business trip to Dubai-solo traveler. Rooms are meant for single travelers, cleanliness is good although 6th floor smells of Cigarette smoke. The bathroom is very small, may not be suitable for XXL people (no offense, please). The best part is the Morning Breakfast, which is really worth the bang for your buck. No room service for food or coffee, unfortunately. The front office is very helpful. At the bar they have only one Sri Lankan guy who is really friendly however at times he is quite busy with serving other guests so getting a drink might take a while longer. The bed is comfortable, I didn't had any issues with pillows like some of the other guests who have mentioned. There is no ventilation for fresh air. The windows are sealed so if you live on the 6th floor which is meant for smoking it might get suffocating. Mall of the emirates is a good 20 mins walking distance, so consider taking a taxi. Parking is free in an open area adjacent to the hotel. Free wi-fi Internet is only available in the lobby, they also have free pc's available for hotel guests in the cafeteria. One special mention - I left my mobile at the breakfast buffet, in the evening I inquired about it with the reception and they had kept it in their safe keeping, pretty reliable guys. Thanks Over all- It is good economy hotel and worth your money if you are on a business trip. Special tip- stay on top floors as the music played at the disco is audible in the rooms, which might go on till late night.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“friendly personnel.”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR119815232", "Content": "good location, friendly and proffessionel personnel, clean. miss discount by very frequent stay, even as very regular stay no discounts. would appreciate the possiblity of free internet also in the rooms, is now only available in the often busy lobby and only against extra payment in the room. When room internet is used extra payments are high for this extra", "Date": "October 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bahrain", "Title": "“Good to the value”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR119619398", "Content": "The room did not have tissues except in the toilet! it would also be good if the toilets had separate soup and shampoo rather than a two-in-one bottle. Also, i had a small problem purchasing wi-fi in the room as only ONE of the staff in the reception had access to the passwords which made me wait for half an hour for the person to get back on desk and provide me with the password.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Not recommended AT ALL”", "Author": "Adam K", "ReviewID": "UR118803176", "Content": "No room service for luggage (it means you need to carry it yourself to the room), no complimentary items in the room, no safe in the room, terrible design of shower and toilet, expensive in house cafe and unfriendly staff ... I will never ever stay there again ...", "Date": "October 1, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“Good enough for a weekend away with friends”", "Author": "3allaf", "ReviewID": "UR117963255", "Content": "The room space is not much, but when you are the type of person who doesnt really care for a good bed and luxurious shower then you wont mind this one. my girlfriends booked the room and i slept over wasnt so spacious but it was manageable for 3. things we didnt like: the shower is not really separated from the rest of the bathroom and water could reach beneath the sink if you dont watch out. no fridge to keep snacks or drinks. you might hear people in the ally, id say not so much of a sound proof.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "2"}, "AuthorLocation": "Lagos", "Title": "“Frugal Elegance”", "Author": "biojum", "ReviewID": "UR117102552", "Content": "Pros: Price , ambience ,very close to metro station (about 3 minutes walk) Cons:1. Location (out of the way,a few taxis found it difficult to locate which was quite frustrating as I wasn't familiar with that area of Dubai either) 2. Small rooms: However I marvel at the way the hotel managed the small space.The room did not lack any necessity but no fridge though 3. Staff were a bit distant: The reception desk staff had hardly any smiles but they seemed to know what they were doing so... 4. No porter: I found this amazing cos I'd never stayed in a hotel without porters before. Overall good stay if the lack of frills do not bother you (It is a budget hotell afterall) which may be okay for business travellers but otherwise this hotel is not for you.Would probably use it if I'm travelling alone again.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“ibis is ibis”", "Author": "AlenKa1010", "ReviewID": "UR116951066", "Content": "my husband and i had to stay for 3 nights at ibis due to some emergence. Obviously, we were not expecting much as we knew what ibis hotels are about, but i was quite discouraged to see very cold and poor service at reception when we arrived without prior booking. I think it improved a little bit when reception clerk realised that we are a decent couple and when we told him that we are staying for several and not 1 night, however first impression was already spoiled. 2 of receptionist didn't speak good english and could not explain anything about the hotel until their supervisor arrived and took charge. we had to take our bags up by ourselves and water machine didn't work on the floor. i had to go down and on the way back had a ride in the elevator with several business ladies and their customers, not very pleasant. thanks god they had non-smoking rooms! our room was very small and sheets were not very white. bathroom was the tiniest and shower didn't work properly. food that was offered for suhoor (early breakfast for fasting muslims) was horrible. overall, we didn't expect much and didn't get much which is fair,. however i hope i will never find myself there again.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“One of the better budget hotels you can find in Dubai”", "Author": "AbuDhabiWil", "ReviewID": "UR116275381", "Content": "I was attracted to this Ibis only because of its rates - think it was 70 USD that time. Still one of the cheapest and most reliable budget hotels in Dubai, Free underground parking and proximity to the Mall of the Emirates makes this hotel my second choice if rooms are fully booked in Holiday Inn Al Barsha.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Cape Town", "Title": "“Good value for money”", "Author": "PrincipessaSA", "ReviewID": "UR116262803", "Content": "Good value for money. The reception staff is not overly friendly but the restaurant staff makes up for it. Relatively clean, free Wireless internet in lobby.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Value for Money”", "Author": "almatysen", "ReviewID": "UR115966450", "Content": "I stayed here for about 15 days and like me there were few long term guests. Overall the ambience has the IBIS touch everywhere. If one needs 'anything', he gets his 'everything' - offcourse on his/her own. The reception with several large wall 'black' clocks is however the only 'drab' in the entire ambience. Bar is small and has a friendly Sri Lankan bartender. Food though not much of a choice is manageable. The choice of breads one can have for breakfast is a treat.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Convenient Hotel”", "Author": "Sparky2509", "ReviewID": "UR111109744", "Content": "We stayed at this Ibis for 2 nights at the end of May. It's a large hotel chain and everything was fine. A number of bars and restaurants, a cafe with free internet. The rooms are modern and accomodating, the rate was the best deal, we booked it in conjuncting with an Emirates Flight. Elham on the front desk helped us with and early check-in and tour which was awsome, a great first impression for this hotel. The only negative was the smoking in the bars and restaurant, most places around the world now are smoke free but saying that you just have to adapt to the culture which is Dubai. If you can get a good deal I recommend this hotel.", "Date": "June 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Makassar, Indonesia", "Title": "“Plus point: Near Metro Station to Save Taxi Cost”", "Author": "Robby_hsetio", "ReviewID": "UR109602576", "Content": "I stay for 4 days and 4 nights. The hotel is OK so do the price. AC, Bed, breakfast, cafe and the hospitality is good. The bathroom is a little bit small, trying not to say 'so small.' It's very hard to keep the bathroom floor dry and no slippery. there is no shower curtain. But the towels are clean. No mineral water as a complimentary. The plus point is, this hotel is near to the metro station. Just cost 5 dhs for a taximeter (but the minimum payment is 10 dhs). If the weather good, better go by walk. I can't do it for the first day because there is a light sandstrom and the weather temperature reach 45 deg Celcius. So I go mall to mall by metro, it's very cheap. and for the end of the day I love to run back to this hotel, to enjoy my hotel's bed with my wife. I have a good golden memory with this hotel.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Good priced hotel and good service but Dodgy hotel car!”", "Author": "RazDorset", "ReviewID": "UR108283363", "Content": "I stayed for 8 days in this hotel, it was pretty good hotel in terms of what you pay. The pick up and drop was inclusive so, it was handy plus fairly good break fast was also inclusive in the price. It is good deal, it's very clean, staff are more or less helpful. Free internet connectivity is only in the lobby AREA not sure why they do not provide in the room. Next time I will book IBIS next to the mall of Emirates, which is also very close to the Dubai Metro Station. IBIS al Barsha is slightly far from the Metro Station Sharaf DG, well it is because hot so little walk of 10 mins. seems quite tough. Caution: pls. do not take any taxi from the hotel, these are like taxi tout , I wanted to go to Noor Islamic bank area, I asked them whether it's on meter, they told me yes it is but only AED 4 is extra I have to pay than from the normal taxi. When I got in to the car there was no sign of meter and the driver do not know the location ( I was told later by a local it is deliberate). this was really annoying, the gang of them told me the driver knows the location! Any way I had pay more than double amount at the end just because he was lost, can you imagine?? So, they were basically tout and will put you in awakward situation and you feel like you were trapped. The hotel authority should check it out and make some strict rule and not posted dodgy drivers who can cheat the hotel guests. After you had good experiance in the hotel, it is off puting when you sue these dodgy hotel taxi. Please DO NOT USE THESE TOUTS , USE THE NORMAL METERED TAXIS INSTEAD.", "Date": "May 15, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "timmy8oy", "Title": "“Not bad but could have been so much better”", "Author": "timmy8oy", "ReviewID": "UR107374023", "Content": "Staff reasonably helpful, free Wi Fi is a big plus, Room was too small, I don`t expect a palace for the money but it was not big enough, the water in the shower ran hot and cold and the restaurant and the breakfast looked inviting but was a big let down. Maybe its an Arab thing but the food was cold, but all in all, good value for money", "Date": "May 8, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bahrain", "Title": "“good hotel”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR106810521", "Content": "onlything i asked for extra billows, and the answer was shocking: there was no extra billows.as for cleaning and room service ,and desk help all were good. otherthing the location is excellent, close to metro station, also ah.zaid road with emarait and dubai moles in approximity", "Date": "May 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "USA", "Title": "“Good Hotel”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR103682535", "Content": "Stuff cortious,Cleanliness very good,rooms spacious,Missed the usual Accor tea service in the room. Room service!!!! they charge 10 AED to send you 5 AED water bottle, Be careful of bunch of rubbers as they call themselves Hotel Taxis!!!!!!", "Date": "April 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Kanpur, India", "Title": "“Ibis Al Barsha”", "Author": "Avis_11", "ReviewID": "UR102867066", "Content": "We had booked 5 twin rooms for stay on the weekend.. Inspite of specific request we didn't get the rooms on the same floor! The location was not that great. We realised that there were hotels at the same rate at a much better location next to the Mall of Emirates e.g. the Citymax Al Barsha. On a good note there was an option of late breakfast which was very convenient as we usually got up very late but then it was not all that great. There was no water flask given in the room which was extremely inconvenient as evertime we had to walk to the vending machine just to get water.", "Date": "April 5, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Manama, Bahrain", "Title": "“Great value for money”", "Author": "NicolasB84 Posted by an Accorhotels.com traveler", "ReviewID": "UR102517638", "Content": "The hotel is a great value for money, with a good location and fast check-in/check-out process. If you only need to spend the night and are not requiring to enjoy hotels facilities (pool, beach, f&b...), then Ibis hotel in Dubai would be your perfect bet.", "Date": "April 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Free Internet”", "Author": "Rhea2079", "ReviewID": "UR101584736", "Content": "The internet in the lobby is totally free and the wifi is everywhere even inside the bar.", "Date": "March 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“comfortable and affordable”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR100955398", "Content": "I was traveling alone, i was comfy and cheap, it would have been most enjoyable if we were in a group, siting at the Cafe or bar, the hotel is located at sheikh zayed road and we never got lost coming back by taxi as it is very visible and easy to find ... plus break fast was good and healthy I enjoyed almost everyday and the only day i missed it i got a small one at the cafe ... ;)", "Date": "March 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Cairo, Egypt", "Title": "“SImple, basic, but reasonable standard for the price”", "Author": "PhilipRylah", "ReviewID": "UR99794568", "Content": "This is a modern-looking hotel with comfortable lobby area and restaurant, with 2 bars. You get what you pay for, and this is a very good rate for Dubai. Rooms are comensurately quite basic but comfortable enough, and with all necessary amenities. Location next to a busy road is suitable for road transport convenience, if not the views. Food is was quite good at the breakfasts and lunches I tried, though the breakfast coffee machine is a time-waster. The hotel has a 15 minute guaranteed service time though it took me 45 minutes and 3 phone calls to get an adaptor. Reception didn't seem interested in granting me any requisite benefit to compensate for the delay. At other times it was also difficult to get through to someone at reception.", "Date": "March 11, 2011"}, {"Ratings": {"Overall": "5.0", "Service": "5"}, "AuthorLocation": "Urbana, Illinois", "Title": "“The most attentive manager/staff ever”", "Author": "ahaghig", "ReviewID": "UR97608817", "Content": "First off, let me tell you that I will stay in this hotel next week and will update my review then. In Dubai, hotels are supposed to apply for customers' visa if needed. I was late and kind of in rush to obtain the visa. The courteous manager did his best to make it ready even earlier than we expected. All the staff did really a good job on this issue and were pretty considerate about my situation. I will update my review after my stay.", "Date": "February 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Excelent Hotel”", "Author": "Paulpm57", "ReviewID": "UR96013888", "Content": "I have stayed in the Ibis Barsha, Dubai several times and will continue to do so, Prices are competative, the accomodation is very comfortable and the staff always friendly and helpful. The restaurants serve good quality food all day and the evening buffet varies from night to night with theme evenings serving an interesting mix of dishes.. The hotel makes an excelent base for a trip to Dubai and is easy to access by car or taxi.", "Date": "February 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "muscat", "Title": "“Decent hotel”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR95890698", "Content": "IBIS al Barsha is a conveniently located hotel, close to one of the main shopping center, Mall of the emirates. Room is clean, bathroom and toilet could be more spacious and some complementary drinking water would be most welcome. Free internet services are available in the loby and the cafe - if this is also available in the room it would be great. Overall a pleasant and comfortable hotel to stay for short holidays", "Date": "February 8, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Jeddah, Saudi Arabia", "Title": "“Good Experience”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR95461969", "Content": "The space of the room are fair but quality of bed and mattress are a little bit less than fair ... but overall the hotel and price are very good and recommended.", "Date": "February 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Fujairah, United Arab Emirates", "Title": "“Don't stay there”", "Author": "hellothere311321", "ReviewID": "UR91372868", "Content": "Terrible hotel. We hardly slept with the noise from two floors below until the early hours of the morning and when we finally slept on a rock hard mattress we were woken by smoke coming in through the a/c vents even though it was a non-smoking floor. Rooms were tiny. Threadbare towels in bathrooms, no bars of soap. Dirty and smelly cafe in lobby. Unfriendly staff. If you are looking for cheap go somewhere else - you'll find better. Hard to find worse.", "Date": "January 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "saudi", "Title": "“happy”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR91205465", "Content": "i am glad to stay in Ibis Al Barsha and i will coming for any business in UAE also next time i coming with my friends thx for every thing ibis .", "Date": "December 31, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3"}, "AuthorLocation": "Athens, Greece", "Title": "“Bare bones”", "Author": "brionnaj", "ReviewID": "UR86260468", "Content": "Our group was booked for a conference here, and although it provided a fairly clean place to sleep, and a better than average breakfast buffet, that's all the positive I can come up with. The front desk staff is very slow (in part due to their required procedures and other part due to their competence level), and there doesn't seem to be a dedicated operator so you can often call and find it busy (due to said slow staff). The room is fine for one person - I'd hate to navigate it with a 2nd in there. On two different occasions I returned to the hotel at 4pm and my room hadn't been cleaned. On the other days I think it was done in a perfunctory manner at best. Thank goodness I'm not a slob. If you are looking for something cheap in that area, and don't need any frills (or even something other than a plastic cup to drink from in the room), this place suits. But don't expect anything more!", "Date": "November 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“Far, far away...”", "Author": "easy_goin_chic", "ReviewID": "UR72308363", "Content": ".... there was a hotel. This hotel is located in the middle of nowhere. Doesn't even have a proper address, and cabbies have no idea where it is. Shame really because there is nothing wrong with the hotel itself. It feels a bit empty as in not many people are around at any given point in time. Rooms don't have a fridge but are quite nice besides that and the toiletries were delightful (citron handwash and sage shower gel). Breakfast buffet had a very wide selection. Highly recommend getting the breakfast at the hotel because there is nothing nearby and it's a very good value breakfast.", "Date": "July 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Hong Kong", "Title": "“Hellish!”", "Author": "dganet", "ReviewID": "UR68434427", "Content": "I stayed here for a couple of nights to be closer to a mate who was leaving Dubai and stupidly thought it would be of the Ibis quality of France..............eh, WRONG! This is a dreadful hotel! Reception staff are slow, at best and the rooms are grotty. You can't swing a cat in them and the sorry excuse for a shower room has to be seen to be believed. Considering the state of the place, the food & drinks prices are expensive and the internet cost is extortionate and so slow it's like pulling teeth. Getting RTA taxis in the morning is very difficult and you get many 'rogue' private taxi firms pulling up looking to rip you off! DON'T waste your money on this dive, there are loads of charming boutique hotels in the area which offer a far better service!", "Date": "June 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "trivandrum", "Title": "“The Best Hotel for Budget client as well as Business in Dubai”", "Author": "pmmujeeb", "ReviewID": "UR67977280", "Content": "I have been stayed and enjoyed the 03 nights with Continental Plan and visited frequently by Metro train from Mall of the Emirates station to Dubai World Trade Center to attend the Arabian Travel Mart .The rooms are well equipped with electronic controlling key and very spacious with 24 hours centrally air conditioned and entertained with all the international television channel including French,Italian ,English and Arab as well.There is a possibility to visit Dubai city tour ,sand dune safari, luxury drive,etc from the travel desk of the hotel.it is very comfortable to visit Mall of the Emirates shopping center by 10 minutes walk and there is a Fathima Masjid for Muslim prayer and over looking distance from Arab Burj.", "Date": "June 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Durban, South Africa", "Title": "“Definitely no frills - basic, very, very basic”", "Author": "VanessaNarotam", "ReviewID": "UR60910756", "Content": "Stayed at the Ibis Al Barsha on a Dubai Stopover package, and chose it based on it's proximity to the mall of the emirates, the Ibis MOE was my first choice, but they did not have availability. To start, there are no porters! My sister and I had to take 4 big bags up to our rooms. Then, when we ordered room service, they do not bring it up to your room, you have to pick it up. No complimentary tea/coffee. The staff were nice, friendly. The manager in the breakfast restaurant was very nice, he opened about 10mins early on the day that we were leaving so that my elderly parents could have some breakfast before we left for the airport - we appreciated that. Reception staff friendly - but no one went out of their way to make an impression. I would not choose this hotel again, or recommend it.", "Date": "April 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "England", "Title": "“Pleasant and cheap hotel”", "Author": "Englis_tourist", "ReviewID": "UR58429298", "Content": "My friend and I recently stayed at the Hotel Ibis in Al Barsha. I'd read the reviews of the hotel prior to going, so had a fair idea of what to expect. The hotel was modest, no extra niceties, but for the price that we paid, it was a pretty decent hotel. The rooms are small, but not smaller than expected and it was an ample size for my friend and I. The bathroom is riduculously small, allowing just enough room to turn around in! There are no extractor fans and so the condensation remains in the bathroom for quite a long time. The shower did present a bit of problem in that the water ran out onto the bathroom floor. This meant that we had to order extra towels to mop up the excess water. The hotel is more suited to business travellers (although you have to pay for the internet) and doesn't have a pool. There were no facilities for simply relaxing in the sun, making a trip to the beach a necessity. Don't use the hotel taxis (white taxis) as they at lest a third more expensive than the Dubai taxis (the cream and red/blue taxis). The location was OK, although the Hotel Ibis, Mall of the Emirates would have been slighly more central for us. Overall, the hotel was good for the price, but I would not stay there again.", "Date": "March 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Typical Ibis, Cheap and Clean”", "Author": "Steve5839", "ReviewID": "UR55875012", "Content": "This is a typical Ibis, cheap, clean and basic, so don’t think otherwise when booking an Ibis. I have stopped at the Ibis Mall of the Emirates and this Ibis is a little more Arabic in decor, but nevertheless it is an Ibis. Check in and checkout no problems, bar facility adequate and the bar food we had was also very good. The breakfast was a typical Ibis Dubai one and again perfectly ok, I did not try any of the hotel restaurants. The hotel location is a little far out from anything, but there are taxies outside and they are relatively cheap about £7 to down town. The TV was a little limited (for English speakers) and the internet is comparatively expensive, but still a lot cheaper than using a UK USB. I was there on business and found it perfectly adequate, my only gripe was the toilet space (see photo) it was that small that you cannot move freely on and off the toilet with banging your knee on the toilet roll holder. Would I stop there again, yes its perfectly ok for a quick cheap business stopover.", "Date": "February 13, 2010"}], "HotelInfo": {"Name": "Ibis Al Barsha", "HotelURL": "/ShowUserReviews-g295424-d1200931-Reviews-Ibis_Al_Barsha-Dubai.html", "Price": "$54 - $109*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Sheikh Zayed Road</span>, <span class=\"locality\"><span property=\"v:locality\">Dubai</span></span>, <span class=\"country-name\" property=\"v:country-name\">United Arab Emirates</span> </span> </span> </address>", "HotelID": "1200931", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/21/53/50/ibis-al-barsha.jpg"}}