{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Nice experience.”", "Author": "sithlord66", "ReviewID": "UR125996118", "Content": "Champaign is the central point between Des Moines and family in Kentucy. The Wingate is a nice place to rendezvous. Clean rooms and the very pet friendly. The breakfast kept me from giving a 5 rating across the board but it is a nice place to stay.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Nice getaway!”", "Author": "caratstone", "ReviewID": "UR125797451", "Content": "Arrived very late Sat night. Check-in clerk first gave two rooms far away from each other, then found two almost adjoining. He was very nice. Nice workout room, and nice pool. All staff were friendly. Breakfast was good and not rushed..they didn't close down at the stroke of 9:30, and coffee was still available later. Lots of cheaper places nearby, but I think this was worth the nominally higher rate. Cheapest rate for me was found on their own site! The room was very large...one big room with bed towards the far end near the window, and sitting area nearer the door. Microwave and fridge were good to have in the room. (Bring popcorn!)", "Date": "March 8, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Makanda, Illinois", "Title": "“bad experience”", "Author": "Donna S", "ReviewID": "UR123188847", "Content": "Guess with all the great reviews I just had the fluke. I waited at the hotel desk for about 15 min before anyone showed up, it was after midnight, didnt make me feel the most secure. Room was nice, but at breakfast the next morning there was no juice, fruit or yougurt. Staff really didn't seem to care, \"oh yeah, guess we are still out of that\" I checked out, and went to the Hawthorn Inn for the rest of my stay.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Lawrenceville, Georgia", "Title": "“Nice place, good value, accommodating staff”", "Author": "30043ron", "ReviewID": "UR122989639", "Content": "We traveled to Champaign to visit family and booked at neighboring hotel property. Unfortunately due to a flooding incident in a nearby room, we checked out at 11:45 p.m. as firetrucks and an ambulance headed our way. We remembered that Wingate had great Trip Advisor reviews when we made our original booking and decided to inquire and give it a try. The staff was most helpful, made last minute accommodations and helped us get situated. The room was well-appointed, even if a little small, and the breakfast was ample.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Arlington Hts, IL", "Title": "“Nice Hotel”", "Author": "Virginia4227", "ReviewID": "UR120818862", "Content": "Stayed here while visiting our daughter for Dad's Weekend. Clean, friendly front desk, Very nice bathroom, decent breakfast. We will stay here again, next year. On the outskirts of campus, but not bad. Not walking distance. Located near the Macy's Mall. One block to Panera.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Yorkshire", "Title": "“Comfortable, clean and airy.”", "Author": "purplefleece", "ReviewID": "UR120810527", "Content": "I have stayed here for two years running. The rooms are large and clean, comfortable beds. Fridge, ice in hallway, helpful staff. Very basic breakfast which I didn't eat much partly because the food is unhealthy and low quality but also breakfast is taken in the foyer where there has been a drains problem. The woman in charge of breakfast was very friendly and helpful. Lots of families for little league type sports at weekends. Can be active at weekends. Lots of parking spaces. You can see woodchucks on the grass next door! It is located in the hotel district quite a distance from the centre of Champaign but a very short drive from the shopping malls and loads of restaurants. Very difficult to find quality, healthy food..... Hopefully the problem of the smell if sewage/drains has been resolved. Maybe it has been by now. I stayed there in May 2011. Great place and good value.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago", "Title": "“Nice hotel, fair value, good location”", "Author": "Redbird_Craig", "ReviewID": "UR118547647", "Content": "We enjoyed our time at Wingate. The rooms were nice and the bed was very comfy. It wasn't the best value we've ever had in terms of the price, but it wasn't overpriced by any means. The staff was courteous and the hotel was nice and quiet.", "Date": "September 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Northwest Illinois", "Title": "“Good choice in Champaign area”", "Author": "pdrane56", "ReviewID": "UR118007862", "Content": "We think this is a good choice. The rooms are always very clean, and the sound prooffing is also good. Wi-fi connection works great. On this last visit, my husband tried to use the pool and the water was too cold. He said the hot tub wasn't very hot either. We did see some kids in it later during the weekend - so it either warmed up or kids don't care. I wish they had some better breakfast options. One day there were bananas but they weren't anywhere nearly ripe, otherwise it is heavy on the carbs with some yogurt as one of the healthy options. I agree that the coffee needs improvement, it is not hot, and it is weak. But overall - we've been pleased when we stay here. Love the fact that they have a refrigerator in the room - that is one reason I chose this over the Country Inn and Suites which is right next door.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Springfield, Illinois", "Title": "“Excellent for price”", "Author": "SusanShawnee", "ReviewID": "UR116422993", "Content": "Room was large and clean and quiet. Great value for the money.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "chicago", "Title": "“solid”", "Author": "hoby1kanobee", "ReviewID": "UR115857336", "Content": "spent 2 nights there. was during incredible heat wave. hvac worked fine. typical breakfast though hot water wasn't hot enough for hot chocolate, and coffee quality was weak. \"health club\" consisted solely of stationary bike, treadmill, and elliptical, which worked fine. Indoor pool looked nice but didn't use. room had microwave and fridge which was a pleasant surprise.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "southportsmouth, ky", "Title": "“Wingate? absolutely,yes we will stay again.”", "Author": "salisburyc59", "ReviewID": "UR111294534", "Content": "First impression is what you look for when you go into a hotel. I spend 3 weeks out of the month in a hotel somewhere, in 3 to 4 different states. As soon as I walked into the door in Vienna/Parkersburg WV, I was impressed. clean, nice smell in the air, large dinning area, with reception area...couch and chairs when you walk in the door. Front desk folks very accommadating, especially Belinda. Belinda was very attentive to the people. She took the time to set and talk with a little lady that was 90 years old from california. You could see she was totally listening to all her stories. The Rooms were very nice, with new deep plus burgandy carpet that looked brand new. There was a safe in the closet. Well needless to say it was a great week and I wouldn't hesitate at all to come again. Infact, Wingate by Wyndham will be the first hotel that will be on my mind when I book again. And, pool open 24 hours as well as the fitness area..Who else has this?", "Date": "June 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wyoming, Michigan", "Title": "“Great Night Sleep!”", "Author": "MichiganderMom", "ReviewID": "UR103334982", "Content": "We stayed one night in Champaign and were given a room on the first floor----this place must have terrific insulation for it was so quiet---no sound of doors opening or people walking on the floor above us. The bed was very comfortable----I didn't check to see if it was a Beauty Rest like we have a home but we were not bothered with movement when we turned or got up---the linens were quality too. The cleanliness of the room was excellent and the shower had great pressure with lots of hot water. The breakfast was delicious with lots of choices. The room microwave and refrigerator were nice touches. Once again we checked the TripAdvisor site and were very pleased with our choice!", "Date": "April 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Paul, Minnesota", "Title": "“Clean, comfortable hotel - good value”", "Author": "cadp52", "ReviewID": "UR96673360", "Content": "We spent one night here. Hotel was very clean and comfortable. Breakfast was what we expected. Only two real issues to comment on - front desk staff was non-existent at check-in. We very nearly left for the Country Inn & Suites next door. We experienced the same problem when we checked out. Also our room on the second floor experienced alot of noise from the floor above. But for the price, it was a great value and a comfortable stay.", "Date": "February 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Madison, Wisconsin", "Title": "“Friendly service, spotless rooms-just what I needed”", "Author": "Evansthecat", "ReviewID": "UR89859668", "Content": "I was greeted warmly on a snowy, cold evening and offered a choice of 2nd or 3rd floor. In retrospect, I should have chosen third because it became apparent there were some high energy children in the room above me. Fortunately they must have gone to bed by 9. This was only a minor annoyance in a very nice stay (two nights) overall. Either the hotel is new or they have a great maintenance team because everything was in good repair and spotless. The room temp was comfortable. I loved having the digital thermostat on an interior wall so that I could make the adjustments I needed. The bath was nice and the toiletries were pleasant. I had one king bed in an enormous room with a large flatscreen TV, a pod coffeemaker and plenty of storage space. The bed was great and the linens smelled fresh. I think there were at least 4 pillows and a bolster. The pool and work out room looked nice, but I didn't use them. The breakfast area was premiere. The attendant was friendly and really worked hard to keep things stocked and cleaned. In many motels the breakfast area looks like an after thought shoved into a corner, but it was clear that it was an important part of this hotels hospitality. There were 12 four top tables, so even if the place had high occupancy there would be no wait for a seat. Holiday decorations were kept to a tasteful, unobstrusive level.", "Date": "December 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kennett Square PA", "Title": "“Okay place, service was marginal.”", "Author": "Travelom", "ReviewID": "UR83933162", "Content": "On arrival at this hotel around 6 p.m., no clerk was to be found at the desk. There was a printed note stating that the clerk would be back momentarily. After waiting ten minutes, she did appear. No apology or comment on our wait. She checked us in without a smile, or any attempt at politeness. Very cold. The room was clean and comfortable, but with all the hotels in the area, I would go somewhere else where I could find all the comforts as well as thoughtful help.", "Date": "October 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orangeville, Illinois", "Title": "“When on business trips, this is a great place to stay.”", "Author": "Gail S", "ReviewID": "UR81628300", "Content": "The front desk was efficient and friendly. The room was very clean and smelled nice but not overly flowery which I hate. It was near a ton of restaurants and right near the interstate and easy to find. It had a nice pool area and a nice parking lot. Could have used a slightly bigger breakfast area when there's a busload of kids staying there, and they could have used a little more help in the breakfast area when they were having a rush of kids that were there to attend a sporting event. Overall, I'll definitely stay there again.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Peters, Missouri", "Title": "“Great choice among the newer CU properties”", "Author": "clvier1", "ReviewID": "UR73317553", "Content": "As a nearly 20-year resident of Champaign, having moved away last summer, I had occasion to need a hotel for one night. Lucky for me a number of nicer newer properties have been constructed; the Hilton Garden Inn and Homewood Suites, and the Wyndham Wingate (and they apparently have taken over the old Hawthorne Suites on Neil, which had been declining for years). Anyway: Pros: Great location not too far from downtown Champaign (many good independent dining choices and bars) and close to mall and grocery stores. Decorating and finishing done with care (it is a newer property, too). Breakfast in pleasant, open dining area with eggs and sausage the day I was there, both were good. 24 hour business center and convenience store with snacks, drinks, etc. Keycard required after hours to gain any entrance at all. Pool/sauna area pleasant if small. Rooms laid out thoughtfully - sleeping area, desk/lounging area/bathroom, all distinct. Spacious room with nice amenities. Electronic thermostat functions well and HVAC is quiet. Great flatscreens with 50-60 channel choices. Only caveat is the bathroom, whilel outfitted handsomely, has a rather high counter and a bulge that takes away valuable room - careful when exiting the room. Well done place and highly recommended.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dacula, Georgia, USA", "Title": "“Outstanding Hotel & Customer Service”", "Author": "BellaBoo00", "ReviewID": "UR68929108", "Content": "My wife, 3 kids (ages 10, 5, 1) and big dog stayed in a 2 queen room. the room was very clean everyday (especially after the mess my kids made). They greeted us at the front desk every day. The morning breakfast was fresh (kids like making the waffles the best). The housekeepers were also very friendly after my 5 yr old vomitted all over the bed sheets (twice) and we asked for additional sheets. they cleaned the mess and was very courteous. We will definitely stay here the next time we are in town. This is one of the best hotels we ever stayed in. I will look for this hotel in other cities we visit as well.", "Date": "June 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Glenside, Pennsylvania", "Title": "“Nice place to stay, though understaffed and noisy.”", "Author": "SydneyRom", "ReviewID": "UR64001252", "Content": "Nice, new hotel. Facilities are great. We loved our stay for the most part. Bed was a bit hard for me, but hubby liked that. Coffee in the room was not great according to hubby. Clean establishment. The weekend we were there had many family reunions, kids sports teams, and science fair groups visiting which made for a noisy stay at times. It was understaffed in both the front desk area and the breakfast area. Breakfast was good, but not large or bountiful enough to service so many people at once. We would stay here again and recommend a stay to those that are tolerant of children and teens. We had no problems and the staff were friendly. The free internet was a bit iffy, but worked in the end. Not ideal if we were there working a lot online.", "Date": "May 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Illinois", "Title": "“Superb!”", "Author": "be_elle_kay", "ReviewID": "UR59870264", "Content": "We stayed at this property for 3 nights, in a queen double room. The room was beautifully decorated, very clean, and everything was in working order. I personally liked that there was a digital thermostat in the room - and when the air/heat came on, it was not noticeable. My only negative thing that I would have to say is that the room is slightly cramped. The desk chair always seemed to be in the way (we ended up moving it out from under the desk and up against a wall). The bathroom, while lovely, was also small. I am about 5 foot 8, and when I was changing in the bathroom, my fingers hit the ceiling. I believe the website mentions that there are curved shower rods in the shower. Yes, this is true, but it doesn't seem to add space because the show rods are mounted only 30 inches from the wall - so at the widest point it only seems like a regularly sized shower (hopefully that makes sense). The bathroom counter/sink is taller than your standard counter height, which I really liked. The bed and pillows were very comfortable. Included with the price of the stay was breakfast. Nothing fancy (bagel, english muffins, toast, cereals, instant oatmeal, a waffle maker, yogurt, fruit, muffins, assorted juices, coffee, tea and some scrambled eggs) - but I really was happy to have it. We traveled wtih 2 small girls, so it was convenient having food right in the hotel, and it was also very nice that it was \"free\" since our girls can be picky eaters sometimes. They love cereal, but who wants to go to an actual restaurant and pay 3.99 for a bowl of cereal? Not me. The woman in the breakfast area on the weekend was very helpful and friendly. The pool was nice. Chilly, but nice and clean. The hot tub was nice and warm. Although I did not use the fitness center, I peeked in and on occassion saw other guest using the machines and they seemed to be in working order. Overall, everything was very clean and the staff was very helpful and friendly. I plan to stay here the next time I am in the area.", "Date": "March 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Joliet", "Title": "“Always confirm reservation, even when booking online through their website.”", "Author": "need2retire", "ReviewID": "UR56029012", "Content": "We booked online through Wingate website, but were told when we arrived that the Manager had \"modified\" our reservation. Apparently they had overbooked (imagine that) a suite, so bumped us since we were the last ones to register. Tried to put us in a \"double\" instead, and then asked us to pay an additional $20 to upgrade! I don't think so! Explained to them that this was simply not the way to do business and they agreed to put us in a King room, but not a suite. Otherwise, hotel was very nice, breakfast was great and atmosphere was very pleasing....except for hallways seemed very noisy.", "Date": "February 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Illinois", "Title": "“Fabulous”", "Author": "TooMuch43", "ReviewID": "UR54241524", "Content": "You know how it is when you go on line to book a hotel stay and you hope that everything meets it's reviews and that the rooms actually do look like they do on their web site well let me tell ya, the Wingate in Champaing, Illinois was beyond all that. From the point of booking the trip on the phone to walking through the doors of the hotel to the nice warm breakfast and especially the curtious staff our stay here was one of the best I've had. Thank you to the day manager Chris Huber and his staff for making our stay enjoyable.", "Date": "January 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "toronto, ontario", "Title": "“very nice facitlity”", "Author": "collegedriver", "ReviewID": "UR52453389", "Content": "We have been choosing this hotel since August 2009, since that time we always book here which is a once a month. Staff is polite and helpful. Rooms are bright and fresh, enjoy as it is a non smoking hotel. Well maintained.", "Date": "January 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "IL", "Title": "“Ok hotel but not as good as it sounded”", "Author": "Mommy2MM", "ReviewID": "UR52062936", "Content": "After reading the reviews, it sounded like this hotel would be perfect for our stay with family. The room was nice and good sized. There was some hair on tub and on floor in bathroom but I can overlook that. Bathroom was nice but if you are short, you may have a problem leaning over the sink because it is very high and recessed back. The worst and most upsetting part was the pool and hot tub. We stayed an extra day just so the kids could swim at at 11:50am they were cleaning it and put new water in hot tub. It was FREEZING and we couldn't even get in the pool (even the kids didn't want to) and the hot tub was so cold, we couldn't sit down in it. After waiting about 30 minutes, it finally warmed up enough to get in and the kids had to \"swim\" in there. So disappointing when we spent the money to stay and swim. They did not apologize or anything and just told us they had cleaned it. Breakfast buffet was 'ok'. Orange juice was very watery and almost undrinkable. Had the make your own waffles, sausage links, scrambled eggs, toast, bagels, cereal, and very green bananas. The suite was very nice (a family member was in one)!! It worked great for our family Christmas get together and had a large living room/dining room combo. A table that seated 4 and wet bar with lots of room and storage. Huge bathroom and bedroom. Nice LCD, flat screen TV's. We had 12 people in the suite and were very comfortable.", "Date": "December 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Absolutely FABULOUS!!”", "Author": "Lehee", "ReviewID": "UR50192060", "Content": "We stayed here one night while on a road trip to Memphis. We throughly enjoyed our time at this hotel. The front desk staff were very pleasant and helpful. The hotel is appointed beautifully and very comfortable. We appreciated the microwave, refrigerator, and coffee maker in our room. The breakfast area was well stocked and kept clean and tidy during the breakfast service. Easy access to the expressway and local restaurants. I highly recommend to anyone that they should stay here while in the Champaign-Urbana area.", "Date": "November 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Great Lakes country", "Title": "“Newer motel, nicely furnished”", "Author": "luvtodrive", "ReviewID": "UR38158887", "Content": "New since about March 2009, clean, quiet, nice furnishings, quick checkin, but I was given a keycard to an already-occupied room. Lucky for them, there was another room available. Hey, stuff happens. I did make sure to keep my security lock on though. The staff was friendly. Rates were reasonable (I chose the non-refundable rate, saving about $10-20). Breakfast bar was nice, with a do-it-yourself waffles machine, scrambled eggs, sausage, mini-pastries, bagels, bread, cereal, juices, fruit (though it looked a little old - the oranges were kind of shriveled).", "Date": "August 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Rockford, Illinois", "Title": "“Great room and good location”", "Author": "PJJoeT", "ReviewID": "UR26018697", "Content": "This is a very new hotel in Champaign and by far the place to stay for business. The room is fantastic with an extremely comfortable bed and a great HD flat panel t.v. The shower has a huge shower head and the layout is very nice, with the sink actually in the bathroom (at least in my one king bed room). I was there on a very busy weekend for the Illinois high school state wrestling finals. The place was probably sold out and the front desk handled everything is an efficient manner. I highly recommend this hotel. One more great note, Buffalo Wild Wings is a one minute drive across the street!", "Date": "March 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Naperville, IL.", "Title": "“Best Place To Stay In Champaign”", "Author": "traverlerjack", "ReviewID": "UR25837563", "Content": "This is one the nicest places I've stayed in, certainly the best in the Champaign-Urbana area. The entrance lobby is beautiful and clean. This hotel is new within the last 6 months. The place is impeccably clean. The rooms are spacious and the beds are very comfortable in fact one of the most comfortable beds I've ever slept on. The room has a flat screened TV which has plenty of cable channels. The bathroom was beautiful with a very comfortable shower. The pool area with the whirlpool next to it are very nice. The pool & whirlpool water temperatures were just right. The complimentary breakfast was fine. The make-your-own waffles were delicious. The eating area was quite spacious and comfortable seating and clean tables. You can watch TV on the lobby's huge flat screened TV while you eat. If you need a place to stay in the the Champaign-Urbana whether business or leisure I guarantee this is the one! I surely was impressed by this hotel.", "Date": "March 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "BC", "Title": "“Great Value in Champaign”", "Author": "keepermom", "ReviewID": "UR23708320", "Content": "This hotel is pretty new. I think we may have been the first to stay in our room. The location is great, about 10 minutes to the University but just 5 minutes to 2 main shopping areas. One large mall with Macys and Berengers and the other area has Staples, WalMart, Target etc. Breakfast is included in price and 2 out of 3 mornings included the make it yourself waffles *yum*. There were also hot eggs and sausage patties each morning. The coffee was excellent. The room (2 queens) was very spacious and had a desk with chair as well as a chair/ottoman combo. The beds were very comfortable and the hotel was very quiet. It is in a bit from the highway so much quieter than some places we have stayed. The front desk and breakfast room staff were always very friendly and greeted us each time we entered and left. My only issues: water pressure wasn't the best however, this may be a regional thing. Cheese omeletes weren't labeled on the breakfest buffet. I don't eat cheese and just thought it was a scrambled type dish. Not a great surprise.", "Date": "January 19, 2009"}], "HotelInfo": {"Name": "Wingate By Wyndham Champaign", "HotelURL": "/ShowUserReviews-g35790-d1206563-Reviews-Wingate_By_Wyndham_Champaign-Champaign_Illinois.html", "Price": "$84 - $129*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">516 West Marketview Drive</span>, <span class=\"locality\"><span property=\"v:locality\">Champaign</span>, <span property=\"v:region\">IL</span> <span property=\"v:postal-code\">61822</span></span> </span> </span> </address>", "HotelID": "1206563", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/06/d0/06d06f8a4b676e16b7c26ad2f07459445large.jpg"}}