{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Addis, Louisiana", "Title": "“Outstanding Deal!!!”", "Author": "Kenm1971", "ReviewID": "UR135708540", "Content": "Not exactly a Bed and Breakfast, but not quite a Boutique Hotel..... Somewhere in between. I will say this..... For the price, the location, and helpfullness of the staff......... YOU CAN'T FIND A BETTER DEAL!!!! The staff are SO NICE and sweet. They gave us restaurant recommendations, ideas for what to do, and even offered to setup any tours we would like to have taken!!! I just can't say enough about the staff. This is not a large hotel, but a nice, quaint place to stay while staying in New Orleans. My wife and I loved it,.... we will be back. That's a promise.", "Date": "July 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "United Kingdom", "Title": "“Excellent”", "Author": "UKoutcast", "ReviewID": "UR133885925", "Content": "I stayed here in early April with my parents. From arrival to departure the owner was very helpful. From recommending places to eat to sites to see. The rooms were very clean and we loved the enclosed patio garden. I intend to return to New Orleans and will book to stay here again. I have already recommended this hotel to my friends. Thanks to everyone at Avenue garden.", "Date": "July 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“Another great stay!”", "Author": "Beke3300", "ReviewID": "UR133302244", "Content": "Third time at this hotel and still loving it! The friendly staff and quaint atmosphere keep us coming back. This is a unique older hotel with flavor. Love the new (to us)fountain in the courtyard too. Large rooms with New Orleans furniture, high ceilings and privacy. We always stay in the upper rooms above the courtyard. This is not a cookie cutter hotel. There are no ice machines, soda machines, pool, etc. this is more similar to a bed and breakfast. The management will get ice for you from the kitchen until 10pm and they sell sodas and snacks in office. No parking lot, but ale parking on side streets and we have never had any problems. This is all part of why we stay here. Do not want cookie cutter. Travel a Loy and look for great alternatives. Located away from noise of downtown but easy trolley ride to everything. Walk within 2 blocks to restaurants, bars, coffee shop, boutiques. Zea's restaurant is our favorite, try the duck empanadas! Pastries and coffee served at hotel but if you want more, Tavern on corner serves excellent breakfast and bloody Mary's. Will definitely return!", "Date": "July 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Easton, PA", "Title": "“Clean and good location”", "Author": "Sue H", "ReviewID": "UR130851470", "Content": "The staff was very helpful and friendly. I had the room with three double beds at the very top of the property. The room is dated but clean. The bathroom had dirty wash cloths left in the tub area (ewww) and it was missing the alarm clock and blow dryer. I called the front desk and the did replace the missing items. There is no elevator so if stairs are a problem, do try to book on a lower floor. The breakfast was good to get a jump start before your day and you can get coffee/tea anytime. There was a mini fridge in the room that was clean. The bathroom was old but clean. do note that the shampoo is in ketchup packets. The room was appropraite for the value. I don't think I would stay again though. The location is really great. You can walk to the museums and can catch the street car to the french quarter or garden district. Make sure you bring quarters and singles for the street car. Slice, a nice pizza place is just about next door to the propertly. When I went outside to have breakfast in a quaint patio, the staff was there sweeping up and chain smoked the whole time I was outside.", "Date": "May 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Lovely, clean, comfy, great owner and staff”", "Author": "LBorden", "ReviewID": "UR129658472", "Content": "We had a room with 2 double beds. Excellent value for money. Impressed by its beauty once coming in. There is a charming interior garden, tea and coffee out all day, a good continental breakfast. All of the various management and staff made us feel like part of the family. Many comfortable interior sitting areas as well. Right on the St. Charles streetcar line, a short trip to both the French Quarter and the Garden District. Very convenient for us. Traveled to and from Jazz Fest very conveniently. Other guests were civilized and down to earth. Would stay here again in a heartbeat.", "Date": "May 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Good Value”", "Author": "Zonker123", "ReviewID": "UR128194985", "Content": "Not the Ritz, but nice if you can get a good rate. We got a double for $109. Room was a little worn down but clean and comfortable. We stayed in Room 16. Door knob to the room was loose. Could be easily fixed with a screwdriver. Old kind of TV and kind of a hodge podge in regards to furniture and decorations. Felt like we were staying at Grandma's cluttered house. Big Head Drew Brees adorned the mainhallway along with old misc. pictures and mirrors. Kind of different. Also, you actually use real keys to get in hotel and room. Wow! Shower had a little drainage problem (ended up with water around my ankles). Could be easily fixed. Cute little courtyard. You have to park in the street since they have no on site parking. But felt safe and nothing happened to car. You also have to load in through front door which has stairs to climb. Could be an issue if you have big bags, although they helped carry them in. Staff was extemely friendly! Very nice and accommodating. Check in was a breeze. I wouldn't stay for more than a night or two, but if you are on a tight budget and just need a place to sleep, this is the place for you.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wild Wonderful West Virginia", "Title": "“Happy with the Avenue Garden Hotel”", "Author": "wvchick69", "ReviewID": "UR128092864", "Content": "I prefer this type accommodations when in NOLA instead of the boring, newer hotels and to be an older building, it is in great shape. Good location with several good restaurants within walking distance. Parking can be an issue...we usually had luck across the street near the athletic club. Our room was clean and comfortable...it's more like a home instead of a hotel. The front desk and housekeeping staff were always friendly and helpful. We thought it was pretty quiet here considering it's located on a city street. My only complaint would be a couple issues in our bathroom in need of maintenance. Would definitely return!", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "fayetteville", "Title": "“new orleans”", "Author": "groverb83", "ReviewID": "UR127772029", "Content": "we stayed at the Ave. Garden Hotel on St. Charles Ave. Most pleasurable stay ever. Keith and staff went beyond any normal customer service and really took care of our needs. If i ever visit New Orleans again i will definitely stay here again. stay was more of a homey stay then staying at a big name hotel chain. thanks for the memories.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montgomery", "Title": "“Clean and Convienient”", "Author": "Charles K", "ReviewID": "UR126708453", "Content": "This hotel was just as advertised. The rooms were clean and the location was great. The street car stop was right across the street. There is also a great daiquiri shop two blocks away. One of the best daiquiris in the entire city.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St. Petersburg, Florida", "Title": "“Fun, Friendly, Convenient!”", "Author": "travelover1959", "ReviewID": "UR126411297", "Content": "We stayed for 4 nights, a long weekend trip over the St. Patrick's Day weekend, March 2012. Our group included four couples, and we each had a queen room. The rooms were clean, well-appointed, comfortable, and surprisingly quiet. Super convenient location; catch the charming St. Charles streetcar right across the street. There is a great pizza place, \"Slice\" , right next door and Voodoo Barbecue next door on the other side, the old standby St. Charles Tavern (open 24 hours) and an Irish tavern right across the street. Service was friendly and the continental-style breakfast was just enough. Our entire group met every morning for coffee in the charming courtyard with pretty flowers and a cute fountain. A great deal, reasonably priced. We will be back!", "Date": "March 20, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Russellville, Kentucky, United States", "Title": "“Warning !!! Not A Hotel !!! A cheap 1970's wanna be bed and breakfast”", "Author": "Randy C", "ReviewID": "UR126370395", "Content": "First of all this is no where near a hotel. This is a cheap 1970s bed and breakfast. This is an old house and you rent a bedroom that has a bathroom that I could barely fit in. I sat in a chair in the room and dust flew out. The floors are so uneven the ironing board would barely stand. You could hear anyone who walked the halls at any time. We are a younger 30s couple that travels 6 to 7 times a year and came to New Orleans a day early and had to stay here 1 night and it was horrible. If a 1970s bed and breakfast is your cup of tea, then this place is perfect for you.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great Location, great little hotel.”", "Author": "Sorcha N", "ReviewID": "UR125657390", "Content": "Great place to stay in New Orleans. Clean, comfortable and very homely.. My only complaint is that 'someone' on the front desk needs to take a check on 'her' mood.... we're always friendly so it's a bit of a shock to get your head bitten off for asking a question. Other than that..., it's a great place to stay.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oswego, Illinois", "Title": "“NOISY!”", "Author": "roxycw04", "ReviewID": "UR123256910", "Content": "This was a nice hotel, but VERY noisy. Our room was nice, had a lot of space, and an electric fireplace. We stayed along the back of the hotel (room 26) and the guy near the hotel uses the ally behind the hotel as a yard for his 3 dogs. The dogs were up late at night and early in the morning barking nonstop! I said something to a lady that worked at the hotel at breakfest the first morning and she just says that \"oh yes, everyone complains about that\" with no solution. The walls were also very thin and we could hear the conversation word for word of the people staying next to us. I would not stay here again.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boca Raton, Florida", "Title": "“Great Boutique hotel in Garden District”", "Author": "rcandresen", "ReviewID": "UR122688904", "Content": "This is a great little hotel in New Orleans. The cable car stops right in front of the hotel, but you can walk down to the French Quarter also. (That way you can justify eating a little more at one of the fabulous restaurants. They provide a nice little continental breakfast. The staff is very friendly and the hotel is very safe and cozy.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“We got lucky!”", "Author": "lbgage", "ReviewID": "UR122192850", "Content": "Lydia runs a tight ship at this hotel. The Avenue Garden Hotel staff was so friendly and helpful to our party of 4. They even gave us a room at ground level with a porch because they thought the 4 of us would enjoy our 4 day stay better. Lydia knows so much about local history and got us in touch with a tour of the Houmas House Plantation. She was a fount of information about the city and what things to do and where to be safe. We just had a wonderful time at her hotel. The room was clean, there were always enough towels and we just enjoyed ourselves. We have to give an extra thanks to Terri who cleaned our room and just took the time to chat with us and also made us feel so much at home during our first time in New Orleans. Stay at this hotel. You will be quite happy you did.", "Date": "December 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Taunton", "Title": "“Just about perfect”", "Author": "MTFTaunton", "ReviewID": "UR121880781", "Content": "Lovely old style Hotel with free on street parking. Our room had a balcony overlooking the street car line, took about 15 minutes to the French quarter so all in all ideal", "Date": "December 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Alexandria, Louisiana", "Title": "“Depends on which room you get”", "Author": "LivingIcon", "ReviewID": "UR120696616", "Content": "There were three of us in an upstairs double room (26). The staff could only find one key to give us when we checked in. Really? The room was clean enough but dated. Funky old bedspreads. Very bland decor in the room. Missing toilet paper roll holder bar. Really? One of the mattress sets seemed worn out, somewhat sunken. The window overlooked a space between an adjacent building where two guard dogs barked at random times in the afternoon and early morning. Internet service dropped one morning of the three nights we were there. There was no coffeemaker in the room and coffee wasn't made downstairs until 8 a.m. Saturday--that seemed late to us. It was prepared by 7 on the other two mornings. The good points: Great location, easy access to street car. Friendly staff. Reasonable rate. Nice patio/courtyard. Charming hallway. We knew the hotel did not provide parking when we reserved the room. There were cones on the street in front of the hotel which provided for unloading and loading. And there was no problem finding spots to park along the nearby cross street. This would not be my first, second or third choice on future trips to New Orleans. There are so many wonderful hotels in this city. And often good deals can be found. But, when an event is going on and other places are booked up, I could see turning to this hotel.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Atlanta, GA", "Title": "“Disappointing”", "Author": "Nanybel", "ReviewID": "UR120054650", "Content": "My husband helped me choose this hotel, for my road trip with Mom to New Orleans last weekend, based on the great reviews on Tripadvisor.. I was very excited and Mom was curious since she had never experienced staying in other than fancy, more impersonal hotels. Before I start complaining, I must say that the staff is very nice and friendly and that the place looks charming and cozy. We were greeted by a nice lady called Aura and a gentleman who helped us out with our luggage; Aura showed us the way to our room. At first I thought it was very convenient because it was located on the first floor (no elevators here, of course) and in the back of the building, next to the breakfast area. It seemed to be very quiet too. The bathroom had the smallest sink I've ever seen in a hotel (or motel!); no room for toiletries and the towels were clean but pretty old. When I was ready to go to bed, the heater smelled weird, like when something is burning, and soon enough it broke; we woke up in the middle of the night freezing, and to top it of, a garbage truck stopped by and spent what seemed hours on the side of the street emptying the huge dumpsters and making the loudest noise, and a dog who lived in the building behind the hotel (right outside our window) started barking and didn't stop until late morning.... Breakfast was pretty lame: some coffee, teas, some red juice they said was apple juice, half and half, oatmeal, cake and bagels and a cheap cream cheese; no healthy protein, no milk, no fruits. After a very lovely day out, we got back to the hotel at around 10:30pm to learn that we had to move our stuff to another room on the second floor, because they could not repair the air conditioning unit. We thought that even though it was very inconvenient, (since we had to leave the hotel next morning) it was worth it, so we packed and up we went. What seemed to be a nicer and warm room with a fake fireplace, ended up being just another room right above the one we stayed the first night, with an extremely slippery bathtub, and the noise from the garbage truck and the barking dog repeated all over again waking us up way too early. I feel bad for writing a review like this, and I wish I could say that we just got and unlucky bedroom and an isolated issue, but unfortunately I can't. Mom left thinking that Ave Garden should not be considered a 'hotel'......", "Date": "November 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Mt. Vernon", "Title": "“We loved it”", "Author": "Brian H", "ReviewID": "UR118008177", "Content": "We love it and will go back. We had 3 people an a room with 2 large beds. We felt like we were staying in someone's home. The staff was great, friendly, helpful, courteous, and made us feel like family. Our cruise was detained for 2 days due to tropical storm Lee and there was no problem stayed in same room. We pack too much and they kept our overage and when we returned for one more night they were glad to see us back. The trolley stopped right in front of the Avenue but you do have to be patient fro the trolley. The cost is $1.25 each way. Breakfast the coffee cake and muffins by Melissa will be missed. After hugs goodbye we will try to get back to the avenue.", "Date": "September 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“WHAT A GEM!”", "Author": "midnightkitty5582", "ReviewID": "UR117922141", "Content": "I was in need of a month plus place to stay. Had an upstairs room w a kitchen. Staff was more than accomadating! They are always quick to help or fix somethng! Prime location, great rates!", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "El Paso, Texas", "Title": "“Lovely!!”", "Author": "Gabi B", "ReviewID": "UR116997091", "Content": "The mister and I stayed here during our anniversary trip, and we had an amazing time! Everyone was really sweet and really friendly, and didn't seem to mind us coming in and out of the hotel as we needed to change clothes, or retrieve items from our room. They have a continental breakfast waiting for you every morning, which turned out to be really useful when we weren't quite ready to change out of our pajamas to go to find breakfast. At first I felt kind of awkward walking out of my room to get a cup of tea in my pjs, but felt immediately at ease when I realized that everyone else was doing it too! The coziness of the hotel almost makes you feel as though you're staying in someone's house, in a way. They also have a resident kitty, who was the sweetest thing, and let me snuggle her when I was missing my own cat. The rooms are nice and the sheets are clean. There was ample storage space for clothes (a closet, and a nightstand with giant drawers). The room also came with a microwave and mini refrigerator, which was so useful to have when we wanted to snack on our leftovers from that day's dinner. The kitchenette also has a sink and some cupboards which were great for extra storage. Housekeeping was great in the sense that we didn't even know that they had been in there, until we went to the bathroom to see that we had fresh towels and that things were tidied up a bit. They very much respected our belongings, and everything was just as we had left it. One of the best perks of this hotel is that it was walking distance (or trolley distance) from everywhere that we needed to be! We walked to/from the train station which is about four blocks away. On our first night there we went walking around to familiarize ourselves with the area, and before we knew it, we were in the Quarter! It was about a twenty minute walk, and when we didn't want to walk, we didn't have to because the trolley line is right outside the front door! There are also some awesome restaurants right up and down the street from the hotel, including a great sushi place, and the tavern right next door. Also, if you find yourself running out of toothpaste or something like that, then there's a Walgreen's about three blocks away! All in all, it was a great stay. Very comfortable for a very decent price considering that we were on a budget. We'll definitely be staying here again on our next trip back!", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Waco", "Title": "“Jewel of the Garden District”", "Author": "jloosier9919", "ReviewID": "UR116170070", "Content": "The Avenue Garden Hotel is one of the best kept secrets of the New Orleans Garden District. This historic hotel is priced reasonably and has enormous charm. The hospitality of the staff and the ambiance of this beautiful European style boutique made me feel right at home. It is conveniently located right along St. Charles Avenue. The streetcar stops frequently almost right outside the front door of the hotel. It is within walking to distance to ATM's, restaurants, and the World War II Museum. The streetcar line (St. Charles Line) ends at the intersection of CanaI and Bourbon Street s in the French Quarter. Streetcar fare is $1.50 per trip. Free parallel parking is available on the streets near the hotel. I never had to move my car once during my stay. The staff is caring and considerate of your needs. I asked for a slightly quieter room and was accommodated accordingly with a room with a small kitchenette (refrigerator, microwave, sink, and pantry). Any requests you need, be sure and ask. On-site management is available to make sure your stay is enjoyable. Complimentary continental breakfast. Thanks to Lydia for a great stay! Will be a returning guest.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Washington, DC", "Title": "“Cozy, quaint hotel...like staying in someone's home.”", "Author": "jleefrog", "ReviewID": "UR115098230", "Content": "We stayed here while in New Orleans largely because of the good reviews on Trip Advisor, and we were not disappointed! This place is nestled away in the quieter Garden District (about a 10 minute cab ride from the French Quarter), and we really appreciated that it was not party central and that we could park for free along the street with no problems (not the case at Mardi Gras when there are parades, as indicated by numerous street signs). The staff were all pleasant, the hotel was quiet and clean, and it really had that old New Orleans charm. We dined in the French Quarter, but there are also some decent looking restaurants on St. Charles Ave. right by the hotel, which is right across the street from a trolley stop. Definitely recommend for adults or families traveling to New Orleans who want a pleasant, quiet, inexpensive place to stay.", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Shreveport, Louisiana", "Title": "“We will NEVER stay at the place again!!!!!!!!!!!!!!!”", "Author": "Female28", "ReviewID": "UR115047653", "Content": "This was my boyfriends birthday and we were expecting a great vacation, but however when we arrived at the hotel there where no valet or bellmens services so we had to park a block away from the hotel and drag our bags to the hotel. Then when we make it to the hotel we had to stand outside because the door was locked and the person that works at the hotel was standing out front having a conversation with someone while we waited until she was done then she decided to open the door to let us in. We prepaid for our room online and when we finally got into our room the room looks nothing like the pictures online,the room was very small for four people to stay in. Then our A/C did not work, we did not get out room serviced becuase no one works after 1pm to clean the rooms so we had to stay in a dirty room all day and night and then when we called to complain the owner as well as her staff had the worst attitude!!!!!!!. they didn't show no concern about what we was going thru. The owner really needs to take a 101 class on how to treat her guest!!!!!!We end up checking out a day earliy because we was VERY unhappy with our whole experiance. We wasted our time and money going to that HELL HOLE!!!!! I woundn't tell a homeless person to stay there. So please do not come to this dump!!! it not worth it!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Friendly hotel with lots of character”", "Author": "Tesremos", "ReviewID": "UR111995179", "Content": "This family owned and run hotel is located on St. Charles Avenue and dates back to the 1890s. It is comfortable and well maintained with large bedrooms and cosy public areas. The owner, Lydia, is often on hand and all of the staff are friendly and helpful. This is a quiet area of town but has an abundance of restaurants and bars within a few blocks and, best of all, the famous St. Charles Avenue Streetcar stop is right outside the front door! This lovely old-style transport takes you to Canal/Bourbon in minutes.", "Date": "June 7, 2011"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Beware - bed bugs”", "Author": "Dakotacris", "ReviewID": "UR108736703", "Content": "I feel terrible for writing bad reviews, especially when this place is a cute place, has nice staff, and is in a good area, but I have the 20-25 bites as my memento of staying here. Tthe stress of bed bugs is not worth anything. Please reconsider staying here until they have addressed this issue.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Macon, Georgia", "Title": "“Cute bed and breakfast type hotel”", "Author": "rwells745", "ReviewID": "UR107193346", "Content": "We stayed here to visit graduate schools, Tulane and University of New Orleans. It was in a good location, but St. Charles Avenue is a really long road, so if you plan on walking to attractions on that road, it may be a long walk, or just get on the trolley. There is a main building to this hotel. That is where the continental breakfast was - it was nice, there were some homemade cakes and other breakfast goodies. Nothing too extravagant. There was also a computer in a common area for guest use and a courtyard in the middle of the hotel. Our room was actually in a connected building above a pizza parlor. It was a nice, remodeled themed room - super cute, red, animal prints. The bathroom was also nice - marble counter, etc. When we arrived, the staff was nice, but not overly friendly, but when we called them about a problem with our air conditioner and with our phone, they responded promptly by coming right up to get the air conditioner fixed and brought a replacement phone. The only complaint about this hotel is that you have to find parking on the street either in front of the hotel, on the side of the building, in the back of the building, anywhere you can find it, which was not always convenient. Also, because our room was directly above the sidewalk and the street, we heard a lot of noise - people being loud outside, traffic, etc. There are restaurants within walking distance, and we went to the St. Charles Tavern late one night (24 hours). It was a fun little place, friendly staff, good food and drinks. Overall, I would definitely recommend this hotel.", "Date": "May 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "chicago", "Title": "“A Fantastic beautiful warm & friendly place to stay!”", "Author": "ChicagoHelga", "ReviewID": "UR106121351", "Content": "After checking on trip advisor I booked a room for my daughter and I for Easter week at the Avenue Garden Hotel at 1509 St Charles St New orleans La.. We were blown away with how wonderful the people running it were. Elvinia booked us in a beautiful room ( room 18) that had two queen size beds in it. It was clean, beautifully furnished, quiet and the beds were very very comfortable. The long hallway was a pleasure to walk down, the outside patio was a delight to sit and have our morning tea, the microwave to warm items was just outside our room as was the Free internet Wi-Fi computer, the maid service left the rooms in pristine shape and the people running the establishmen't couldnt have been more accomodating or kind to us. They mentioned that they had a membership to the health club across the street which we did take advantage of and they gave us free maps of the city as well as advice on where to dine, shop, or do a tour . The street car stop was right in front and the hotel is nestle between two resturants- Slice which is a casual resturant and had fantastic itlaian food on one side and VooDoo Barbque on the other side. It is also located 2 blocks from Emeril Delmonico's resturant. The street and area was very safe. We parked for the week on a non-metered side street one block down with no problems and the street car ride to and from the French quarter was approx 10 minutes. Great location, safe area, outstanding hotel!!!", "Date": "April 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Must Stay HERE!!!”", "Author": "travelinshutterbuggy", "ReviewID": "UR102564442", "Content": "Birthday trip with my sister was amazing thanks to Avenue Garden Hotel. It is a cute, quaint, charming hotel away from the stench of the French Quarter but close enough to get there quickly. Streetcar across the street made it super easy to get there, $1.25 each way or $5 for an all day pass. Cab to get there was $10 each way to avoid the wait or people. Staff was very nice and helpful. My sister had stayed at the Doubletree near the French Quarter a few months prior and not only was it more expensive, the room was smaller and felt dingy. Our room at Avenue Garden was spacious with a granite wet bar, mini fridge, and microwave, hairdryer, iron, ironing board, everything one can need. Very cute hotel, will stay here any and everytime we visit NOLA.", "Date": "April 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Awesome”", "Author": "NashvegasLady", "ReviewID": "UR102109484", "Content": "The desk clerk that met called \"V\" was helpful and very welcoming. I put myself in a pickle when I left my phone in a cab on my first day in New Orleans. She not only helped me get it back but she let me use her blackberry to get in touch with my boyfriend back home. No two rooms in the hotel are the same lending a feeling of specialness to the occupant. The one bed deluxe room I stayed in was very spacious and clean. There was a nice outdoor patio to hang out in that was right outside the entrance to my room. The streetcar is right out front while there are two restaurants one each side of the hotel so there was never a lack of food options. It was also very quiet and the staff respected the \"do not disturb \" sign which I appreciated since I'm a night person. Loved the hotel and it definintely was a big part of my awesome new orleans experience.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Excellent Place”", "Author": "Steve_GrantPark_ATL", "ReviewID": "UR102092583", "Content": "We went down for a long weekend and have nothing but great things to say about the Avenue Garden Hotel. The staff was extremely friendly and helpful. We trucked scooters down with us for a rally and they let us lock them up behind the gate in front of the hotel and also showed us where we could stash our ramp that wouldn't fit inside the truck. The hotel is clean, secure and the location is fantastic. We had dinner next door at Slice pizza and after a couple nights of drinking we had late breakfast across the street at a 24 hr restaurant. The trolley runs in front of the hotel and will take you around the city. The hotel is also a short distance from Magazine St in the Garden District where we enjoyed plenty of food. Our room was on the side of the hotel and quiet. The curtains also did a great job of blocking out the daylight and letting us sleep in late. I would highly recommend staying there and the next time I'm going to NOLA this is the first place I'll look for a room. Location wise, it cost us $10 for a taxi to Bourbon St but we didn't have to suffer from the smell of the Quarter at the Avenue Garden nor the drunken crowds. They don't have private parking but when we checked in Friday afternoon they told us they parking meters don't have to be paid on the weekend so we left the truck parked out front all weekend. Otherwise you'll have to park on the side street. We live in downtown Atlanta so we don't leave anything in our car so this wasn't an issue with us. Staying in the Quarter hotels all had a $30 per night parking.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Charming boutique hotel with great staff”", "Author": "karzen", "ReviewID": "UR101014556", "Content": "Wonderful little hotel that has all the charm of a traditional southern home with a good breakfast which can be eaten outside on a very cute patio. The owner and manager were wonderful - we were looked after very well (beyond our expectations) and we felt like more than just another guest on a different day and will definitely go back! We will need to go back and visit the ghosts anyway :)", "Date": "March 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edinburg, Texas", "Title": "“Perfect location, nice neighborhood, would stay again.”", "Author": "suprlonghorn", "ReviewID": "UR100834742", "Content": "My girlfriend and I stayed here for 4 days in March and were both pretty satisfied with the hotel. The front office was pretty helpful and friendly. Security or safety was not a problem since keys are given to guests just to enter through the front door of the hotel. Overall, we enjoyed our stay and would stay here again. Pros: -Location: between Garden District and Bourbon St/Casino -Charm: We wanted to stay at an older, local place to get more of the NOLA experience -Service: Family owned property, always available Minor Cons: - Thin walls: Sleeping wasn't too much of a problem since we were worn out every day, but at times we were woken up by the music next door, conversations outside, and traffic/motorcycles driving by. - Restroom: Overall updated and appeared modern with a hint of charm, but not very functional. More counter space would be nice and stronger plumbing/toilets (multiple flushes were needed often)", "Date": "March 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“this is the best hotel”", "Author": "lele032010", "ReviewID": "UR100661829", "Content": "I was travelling to texas on february 18 and on my way i found this hotel in new orleans to stay overnite and I like the place, which was very comfortable and the staff and the owner was available all the time and very courtseous and helpful and they made my stay like staying at home and i will definately go back to stay in this hotel whenever i have chance to visit new orleans and i will recommend to all my friends", "Date": "March 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Savannah, Georgia", "Title": "“the avenue garden hotel was a beaufuil place it was clean and the owner was a sweet heart and the staff was very pleasa”", "Author": "kitkatt66", "ReviewID": "UR100050091", "Content": "we had a great time the hotel was beauiful located in the heart of town the staff was very pleasant ,very clean i would reccommend this place to everyone. theres is so much to do .", "Date": "March 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Rude staff and outdated small rooms.”", "Author": "Luvmyjr", "ReviewID": "UR98249380", "Content": "This old hotel located on the edge of downtown and the garden district could be a jewel, but we were very unimpressed with management's lack of interest in customers. We were never greeted with a smile or any enthusiasm. One employee in particular was especially annoyed at our presence. The staff was not helpful when asked where to dine or what to do. The room was tiny and dated. The blankets had holes and bleach spots. The spare pillow was nasty with blood stains. Overall just worn out. All of the room issues would probably have been overlooked but became blaring due to the poor customer service.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Williamstown, New Jersey", "Title": "“Had a Great stay”", "Author": "njgeorgia", "ReviewID": "UR94795095", "Content": "We stayed for a 4 day week end and were very impressed. This is not a 5 star lux hotel, it is what it says it is, a great old home to stay comfortably for a visit to NO. Our room was clean, comfortable, and quite. The bathroom was well apointed, good water pressure for an old home. The location was great also, with the street car line steps from the door the city is at your fingertips. BarBQue place next door with good food was convienent for drinks and a quick meal. Due to storms we had to change our flight in and out, we arrived early and left late, no problem. The owner and others at the hotel are friendly and cordial, with great tips where to go, how to get there, and when to come back. We stay at many bed and breakfasts in the Cape May area of New Jersey and have to say we were pleasantly surprised with our accomadationsThey even printed our boarding passes for us before we left, called us a cab, and talked to us while we waited. This is a real gem, and we will return. Thanks for a great get away from the snow.", "Date": "January 28, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Knoxville, Tennessee", "Title": "“If you like the smell of disinfectant, this is for you !”", "Author": "daniel37922", "ReviewID": "UR91729708", "Content": "I am somewhat suspicious that the reviews listed for this property may not be from guests. The hotel is in a somewhat seedy location. There are rooms that face an alley where the next door pizza resaturant has trash cans that get rattled throughout the night. Upon entering the hotel you can get a strong disinfectant smell. Our room had no heat so they gave us a portable heater. Guess what? It overloaded the circuit, went off, and then the overhead lights would not come on. The first room they showed us had lamp shades missing or damaged and the outside veranda ovrelooking the street was carpeted with that green astro turf looking stuff. How this continues to get a high rating is beyoind me.", "Date": "January 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South Florida, Florida", "Title": "“I Can't Wait to Go Back”", "Author": "Jmp05", "ReviewID": "UR88838478", "Content": "This place was everything the positive reviews make it up to be. Firstly, the location is ideal if you are visiting N'awlins and don't quite know your way around because the street car picks you up right outside and it is the cheapest and most scenic way to get to and from the French Quarter. The staff is warm and welcoming giving you that true Southern hospitality showing you to your room and giving you a quick tour of the hotel when you check in. The rooms are quiet and comfortable and have a true historic New Orleans feel to them. The free continental breakfast had an nice variety of cakes, bagels, etc. and excellent coffee and tea. I love this hotel and wish we could have stayed longer, but know exactly where to stay next time I have the pleasure to visit this truly unique and magical city. There is just a special feeling about New Orleans that I've never felt anywhere else. We had such a great time living it up down on Bourbon Street and the surrounding hidden corners of \"Le Vieux Carre.\" It was great to feel carefree, get a little tipsy and take the street car home! You can find parking on one of the nearby side streets. However, it is close to downtown and did not appear to be the safest place to want to leave a car and valuables unattended, so it might be worth it to pay to park in their lot.", "Date": "December 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Will DEFINITELY stay here again the next time we're in New Orleans”", "Author": "derbdo", "ReviewID": "UR87703853", "Content": "Where to begin? What a fantastic find. This is a converted home turned hotel. It has a lot of charm. Me and my girlfriend stayed for 2 nights. We arrived well early of check in, approximately 11am, but we were given a room immediately. The reception person was so sweet. She made time for small talk and gave us a tour of the entire facility. We were treated like family from the get go. The room we were given was VERY clean. It had been renovated and you could tell that they put a lot of effort into the design. The bathroom was very modern and stylish with a rain shower head. We laughed at the fact that there was a mirror over the bed! Talk about kinky. The bed was comfortable. Only small drawbacks was that there was no safe and the side tables were small so you couldn't really rest anything on them. The hotel is located a little further away from the French Quarter. You will definitely need to take a taxi or trolly to get around. Great location if you plan on seeing the Garden District or Arts area (on Julia St) or just simply getting away from the hustle and bustle of the French Quarter without going TOO far. There are BEAUTIFUL old style houses in this area if you walk further along St Charles. Tulane University is a ways down the road too. We caught a few students drinking at the local pub on our way down to the French Quarter. Very harmless, fun loving crowd! There's not much as far as dining in the area. A restaurant named Zea, but its pretty much Burger King and Popeye's from there! The bar on the corner had a great po boy though and a great bartender. I really want to take a moment though to comment about the people that work there AND the owner. Honestly, you will not find any more southern hospitality. The first night we got there, the lock on my suitcase jammed and at 10pm they made every effort to find a bolt cutter for me. The receptionist (Aura) was SO helpful and friendly. But the owner, Lydia, a sweeter lady you will not find. A true southern belle. Spend some time if you can to just talk to her. The stories she can tell and she knows so much of the history of the city. She seriously made our trip and I can't wait to come back in the years ahead to continue our conversations. I've been to many hotels in my day, but this was an experience that I will soon not forget. I will always recommend this place to anyone visiting New Orleans. Thank you to all of the hotel staff for making it a memorable vacation for us. We'll see you again soon.", "Date": "November 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ft Polk, LA", "Title": "“The stay was GREAT”", "Author": "armywife219", "ReviewID": "UR81373337", "Content": "My husband, my son and I stayed at the Avenue Garden Hotel a few weeks ago. It was a last minute hotel choice and they were VERY friendly. We called that moring and arried that afternoon. They got us in right away and up to our room no questions asked. Our room was great. Very warm and wecoming. Not only the room but the whole hotel. The patio is amazing my husband son and I sat out there all the time! The staff was very friendly. Every time we asked them how do i get to this place or that place they would tell us and draw a map for us. It's not that far from the French Quarter. About a 8 minutes troolie cart ride. It's right next to a great BBQ place and accross the street from that is a very nice quiet little bar to get away from the comotion of Bourbon Street. I loved our stay there and they can expect me back for another visit when my husband get's back from deployment! I would recomend this hotel to anyone who would like to have a nice quiet place to stay away from downtown!", "Date": "September 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "charlotte, nc", "Title": "“Wonderful Experience”", "Author": "carolinasunshine13", "ReviewID": "UR79285675", "Content": "I had previously stayed at this hotel a number of times when it was under previous ownership, and when I had a long business related trip to New Orleans, I opted to try the hotel under its current ownership. Lydia was a great host and our room was clean, convenient to our business in the convention center. We were three adults in the room and found it spacious enough to handle three women and our luggage. Michelle, our housekeeping staff was great as well and made sure our room was stocked with fresh towels. The next time I am in NOLA, I would stay here again (if space is available). Guests can use the athletic club across the stress at no charge, and there is a desktop computer with Internet access for guest use as well. Secure parking nearby and plenty of on street parking as well. Plenty of nearby restaurants nearby within walking distance.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Mobile, Alabama", "Title": "“Don't be fooled by the photos and positive reviews”", "Author": "SouthernALgirl", "ReviewID": "UR79273949", "Content": "When I travel and go on vacations I like to stay in places that are either nicer than my own home or that are equivalent to my own home. Unfortunately the room we stayed in was far worse than any of my own homes. And let me go ahead and say that I have a great appreciation for Victorian style homes because I grew up in one. When we first walked into the hotel I was very pleased with what I saw as far as decor and got a \"homey\" feel from the front entrance. Ora, the woman at the front desk, greeted us gave us a tour and then showed us to our room. The second she opened the door my boyfriend and I were so disappointed. The room we got was supposedly a suite but to us it was a motel. The bathroom in the room was probably the worst. Very outdated and very very small. The shower curtain was very dingy and cheap and we also found someone's hair clip in the shower. Ew. All of the fixtures were very cheap and outdated as well and the towels they gave us were basically rags. Now for the bedroom. The carpets were very worn and we even found a dead roach in the corner. The views from our windows faced dumpsters and alleys and the furniture was falling apart. I walked by one of the chairs in the room and was severely scratched by a rusty nail that was sticking out of it. Because we purchased a suite I was thinking we were going to have a refrigerator in the room but we were sadely mistaken because they only had a mini fridge in the common area for everyones use. After putting our left overs in the mini fridge we realized that there was no microwave for us to reheat our food had we wanted to eat it later. To sum it all up, I think everything was ok except for the room. I wouldn't come back here for free, until they did some major upgrading.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“Wonderful place”", "Author": "KManTraveling", "ReviewID": "UR78924566", "Content": "This is a great place to stay while in New Orleans. I can't say enough about how friendly and helpful Lydia and Ora were during our stay. It's a pretty hotel with a long, beautiful corridor that runs from the front of the house to the back. The room was clean and cozy. We had a corner room (room 16), so we had windows on two sides of the room which was nice. There's a resident cat roaming around that is very friendly, and does it's part to add to the character of the place. There is a nice courtyard with a water fountain and tables that is a peaceful place to sit and read or converse with friends. It's a fairly short trollie ride to get to the French Quarter, and the trollie stops right in front of the hotel. All for a reasonable price. They have hot coffee brewed throughout the day and a nice continental breakfast. I'd highly recommend Avenue Garden.", "Date": "September 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "The ATL", "Title": "“Best Location this side of Canal Street”", "Author": "Edsad", "ReviewID": "UR74983660", "Content": "The Avenue Garden Hotel is at a great location in NOLA. Positioned near the intersection of St. Charles and Martin Luther King Jr. Blvd, and on the St. Charles Street Car Line, the Hotel is easy to find. From this vantage point it is easy to get to all the major attractions in NOLA. There are also plenty restaurants (fast food to five clams) in walking distance. The rooms are clean and the staff is friendly. There is a large common area inside, a nice courtyard outside, and a second floor balcony overlooking St. Charles Ave . However, parking in the garage is $20/day, and it is located around the corner. There is a community refrigerator in the lobby. And the shower curtain could be replaced. The hotel has charm and personally, this puts it above average to very good.", "Date": "August 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Smyrna, Tennessee", "Title": "“Outstanding Service- we felt at home!”", "Author": "pappafot", "ReviewID": "UR73954843", "Content": "From the moment we entered the Avenue Garden Hotel, we were greeted and treated with great care! My sister's sudden death brought us to New Orleans. Lydia, the owner, assisted us in every way she could to make our stay comfortable and relaxing. The rooms were nice and clean. The decor is absolutely \"New Orleans\"! The coffee was made fresh every morning and there were always goodies out for breakfast. The courtyard is inviting and private. There are nice \"living rooms\" upstairs and down. We were able to congregate in the living rooms and courtyard to talk and visit. Regular hotels would not have these nice private spots in-house! Our party consisted of 15 people. We were able to keep cold drinks in the refrigerators supplied on each floor. There is a nice garage around the block, so there is no fuss with valets and tips, etc! The front balcony was a fun spot to just sit and \"people\" watch. The location was wonderful - not too far from the French Quarter, but not too close! I will absolutely stay there on my next visit to New Orleans!", "Date": "August 5, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Norman, Okla.", "Title": "“Save yourself the cringing and stay anywhere else.”", "Author": "JRM_Norman", "ReviewID": "UR70949214", "Content": "By far, worst experience of my trip to New Orleans. I know you get what you pay for and I don't expect a lot from a budget room. However, let me list the ways this place disappointed even me: 15 or so huge, Louisiana-size flies on the wall (probably due to the ill-fitting door), AC that never cooled the room, hair on the bathroom floor (and not a little, enough to make me throw a towel down), broken TV stand, lights burnt out, scary linens on the bed, etc. The owner may reply that I should have alerted them to these problems. I reply that they should know of these problems just by opening the door and checking their rooms now and then. The positive reviews of this place must have come from people who spent too much time on Bourbon Street. Save yourself the cringing and stay anywhere else.", "Date": "July 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dover, AR", "Title": "“Bed & Breakfast feel”", "Author": "jcarj", "ReviewID": "UR69128154", "Content": "This motel was a wonderful place to stay. We enjoyed it greatly. The staff was very friendly and helpful. The location was convenient to Garden District and French Quarter. The motel was very clean and comfortable. Some have shown picures and said the motel was in poor condition. In my opinion, there were few imperfections. The few I saw were being repaired. The owners appear to take greatT care to meat the needs of the guest and keep the building beautiful. My favorite resident at the motel was Baby Girl. It was very relaxing sitting on the patio, rubbing her belly and listening to her purr. It was like being at home with my own pet. We have been to New Orleans several times and from now on we will certainly stay here.", "Date": "June 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“great location”", "Author": "Schweizerchick", "ReviewID": "UR65178501", "Content": "We stayed here for 3 days at the end of a convention - now I must say that we had been at a 4 star hotel in the French Quarter, so its a bit of a shock to move to a 2 star...however, once we settled in, we really liked it. We especially liked the little courtyard in which to have breakfast, and the living room area where we hung out to use the wireless. The room was a bit disappointing as it was on the main level, dark, and a spider paid me a visit...! However, I am sure that an upper floor would have avoided that! We loved the location..lots of restaurants out the door...rode the St Charles streetcar to the Audubon Zoo and saw the universities and the park. Walking in the Garden District is amazing. We loved the reasonable price as well, so all and all for value, this hotel is highly recommended. The staff were very friendly and helpful. You really felt like you were staying at a B and B....I would stay here again.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "glasgow, scotland", "Title": "“Home Away from Home”", "Author": "dadofsix", "ReviewID": "UR63953152", "Content": "The Avenue Garden Hotel was perfect for us. We were visitng my daughter at Tulane so the ride there in our car was just a few minutes. To visit the Quarter we walked out the door and the St Charles streetcar was right there. Parking at the hotel was on-street for free and never (even during Jazzfest weekend) did we park more than a block away. Having Voodoo BBQ and Slice next door was good for a late night snack and the continental breakfast in the courtyard, with its soothing fountain, was great.. But the best part may have been the hospitality. Lydia was always ready to chat, make suggestions, or assist me in any way ( I had a work project to accomplish during my weekend). We felt as if we were in a B &B rather than an impersonal hotel -- It was like a home away from home and we hope to return soon.", "Date": "May 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Clearmont, Missouri", "Title": "“Delightful experience”", "Author": "SeeCMO", "ReviewID": "UR63859206", "Content": "I loved staying at the Avenue Garden Hotel. The management provided valuable information and guidance, the breakfast lemon cake was wonderful, the proximity to the trolley was perfect. Area eateries were quite fun, convenient, and seemed wonderfully New Orleans. The Avenue Garden Hotel adds nicely to the experience of visiting New Orleans. It seemed a part of the old/new New Orleans' culture. The room I had was quite large and quite clean. The common areas in the hotel were most inviting, cozy. If you are going to be in New Orleans for any length of time try this hotel.", "Date": "May 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houma, Louisiana", "Title": "“Better than staying in the Quarter.”", "Author": "CessyCotton", "ReviewID": "UR62703636", "Content": "We usually stay in the Quarter when we go to New Orleans, but after reading the reviews on Avenue Garden Hotel we decided to stay there. It was the most wonderful place! Old style New Orleans, friendly staff, and a beautiful patio. We loved our room, it was very clean and well appointed. The street car stops right in front of the hotel so getting to the Quarter was very easy. I have recommened this hotel to my family and friends. I am looking forward to my visit back this summer. Thanks you Avenue Garden for such a relaxing stay, and I will see you soon!", "Date": "April 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Zion, Illinois", "Title": "“A great place to stay!”", "Author": "ajmartin1m", "ReviewID": "UR61951249", "Content": "Everyone I met at the hotel made me feel very welcome and comfortable from the moment I arrived. This was my second trip to New Orleans and the best expierence ever. The room I had was a little cramped, but it was clean and the bed was comfortable. I was very relaxed and enjoyed the quiet, compared to staying exactly in the French Quarter. Everything you wanted to see was walking distance or you could have taken the trolley closer to town. Whenever I have the chance to return I will DEFINATELY consider staying here again. Thank you to everyone at the Avenue Garden Hotel for such a wonderful experience and great memories!!!!!!!!!!!!!!!!", "Date": "April 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Absolutely Wonderful Hotel”", "Author": "WD80", "ReviewID": "UR60747700", "Content": "We have traveled the world over as our hobby to see new places and have new memorable experiences. One of the most important aspects of all our vacations is where we stay. We select a place based on comfort, safety, location, affordability and any special flair. Well last week, the Avenue Garden Hotel met all our expectation and more. The Avenue Garden is essentially a boutique Hotel/B&B located directly of the trolley line in the Garden District. The Hotel, built in the 1800s, maintains the style and class for todayâ€™s traveler but also is reminiscent of being at home. When you arrive, you receive a key to the Hotelâ€™s front door and a room key (not a computer chip card). If you have a car to park, then you also get a garage door opener to the Hotel garage less than 1 block away. The Hotel management and staff willingly help with your luggage, parking the car, and any else they can. I booked the hotel through Bookit.com. Bookit advertised free parking even though the Hotel expressly (I saw the emails) explained to Bookit that parking was not free. This is what was so special about Avenue Garden Hotel. Due to Bookit misinformation, the Hotel management decided to upgrade our room to a wing of the hotel where we practically had complete privacy. Now, the hotel manager did not have to open up a separate wing of the hotel just for us, but she did. She did not have to put us in a bigger room with antique amenities, but she did. She did not have to waive our parking fee, but she did. She and her staff did not have to tell us the best hot spots in the French Quarter, but they did. This was absolutely a wonderful stay at an absolutely wonder hotel.", "Date": "April 8, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "North Carolina", "Title": "“Tales of two hotels”", "Author": "NCMAja", "ReviewID": "UR59547859", "Content": "I was very excited to stay here, especially after all the glowing reviews. Reality, however, leaves a bit to be desired. The first clue was when we checked in--\"first I'll show you around the hotel, then I'll take you to the building where your room is\" ???!! Up a long, steep, dark flight of stairs was a small, dark room. the \"free off-street parking\" promised by the booking agency was a \"problem we've been trying to correct\". The \"light continental breakfast\" may have been wonderful, but we didn't really feel like going out on the street in the early morning to get it. The brightest spot was the housekeeper, who did a wonderful job....", "Date": "March 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Camden, Maine", "Title": "“Great value, excellent time had by all!”", "Author": "Readeo1", "ReviewID": "UR58494829", "Content": "I co-led a group of 14 runners with a few spouses headed to New Orleans for the Mardi Gras marathon. Our host Lydia and the rest of her staff were friendly and helpful. The rooms were in good shape and our group all were satisfied with the accommodations. Conveniently on the street car line and easy to walk to the French Quarter, Convention Center and the river boats, I would certainly return to both New Orleans and the Avenue Garden Hotel.", "Date": "March 13, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“We stayed at Avenue Garden the week of...”", "Author": "JulieRN", "ReviewID": "UR56719738", "Content": "We stayed at Avenue Garden the week of Mardi Gras from Saturday through Wednesday. I could not have dreamed of a better vacation. First of all... Location, location, location. We were directly on the parade route, every parade passed right in front of the hotel. And the hotel staff couldn't have been more helpful, informative, and downright friendly. I felt like I had become a part of their family. They made us feel at home, had a space corded off in front of the hotel to watch the parade, Mr. Drees bbq'd some incredible meats, sausage, and veggies (with a wonderful Moroccan flair). Lydia, who I believe is the owner or manager, was incredibly nice, went out of her way to make our stay special, really bent over backwards to accomodate us. She shared with us not only the touristy things to see but also the kinda \"off the beaten path\" stuff. She knows slot about the city and culture. We would not stay anywhere else and are already booking our stay for next Mardi Gras. The rooms are cozy, it's a down home b&b feel. It feels like new Orleans, not some sterile made up hotel. We highly recommend this place.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "fairhaven,Ma.", "Title": "“the only place to be for mardi gras”", "Author": "dreesbigsetfan", "ReviewID": "UR56716426", "Content": "felt like home inside,staff really goes over the top to please guests.Lydia knows the best places to visit and the best way to get there. the parades are right out the front door,and great food from the grill.thanks again Lydia for a wonderful stay. send my love to jo-jo,drees. can't wait to see you all next year.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mobile, AL", "Title": "“The Perfect Home Away from Home!”", "Author": "rrfenton", "ReviewID": "UR56706973", "Content": "The Avenue Garden Hotel not only met our expectations but exceeded our expectations! Our family has traveled to New Orleans for over 20 years for Mardi Gras, but this experience was the best.. Rather than staying in a traditional hotel we chose the Avenue Garden Hotel. This establishment is more of a bed and breakfast than a chain hotel. We felt at home the moment we arrived. Rooms were clean, staff friendly and helpful, and the decor was beautiful. The location was perfect for Mardi Gras. Once we parked our car on Friday there was no need to retrieve it until Tuesday evening. Restaurants of all types are in walking distance. The parades are right out the front door. We always felt safe and secure whether we were inside or outside....and our children also felt comfortable outside even though it was Mardi Gras. I would highly recommend the Avenue Garden Hotel. We have already booked our rooms for next year and have been recommending this establishment to others. Not only do I now refer to this as \"Home away from home\"....but their staff are now like family! Thanks to the staff for a wonderful Mardi Gras...you all made our experience perfect!", "Date": "February 21, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Boca Raton, FL", "Title": "“Rooms need major renovation”", "Author": "travelingms", "ReviewID": "UR56704101", "Content": "Although the owner of the hotel , Lydia,was a delight, rooms need to be renovated. I was totally disappointed as well as the the other couple we went with. I was afraid to take my shoes off. The bedspreads were old and worn as well as the furniture. My husband has had a sore back since we've been home from trip; horrible mattress. A couple of her staff were not friendly any time you asked them for a request.. There were only a few towels in the room and when we requested more, it was like a look of \"how dare you!\" I chose this hotel based on Trip Advisor reviews. When economic times get better, Lydia, you must renovate the rooms. Also some soap would be nice too to shower. I wasn't going to write a review, but the last \"glowing\" review just put me over the edge and makes me wonder. Unless they had a spectacular room and lucked out ona last-minute cancellation, we were definitely on different planets. I would definitely not come back here unless", "Date": "February 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Memphis, TN", "Title": "“Southern Comfort at its best!”", "Author": "Hipichic1971", "ReviewID": "UR56432022", "Content": "After not being able to get 2 other people to travel with us for Mardi Gras, it was getting down to the wire in finding a hotel with inexpensive rates that 2 could reasonably share. It was a last minute shot when we stopped by this hotel, hoping for a good deal. We got the best rate in town. This is a quaint hotel with lots of character. The staff was great. This hotel goes all out for Mardi Gras and set up an area in the median so that we could comfortably enjoy the parades as they passed by. Did I mention that this hotel is right on the parade route? All but Endymion. Everything is within walking distance from the hotel. When we left, we left feeling like we were part of their family. They even hugged us goodbye and asked us to call them to let them know we got home all right. We will definitely return. (Tip, if you sit on the ladder mounted to a pole on the median, you might catch a set of beads from Harry Connick Jr., like I did!)", "Date": "February 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "NC", "Title": "“Seen Better Days”", "Author": "soxtraveler2", "ReviewID": "UR56180542", "Content": "I don't usually write reviews, but felt I needed to. I was really excited about this hotel from the other reviews, and I'm not sure if it was just our room or what, but it had definitely seen better days. The room had a great deal of peeling paint and wallpaper, as well as waterspots and old leaks on the ceiling. There were picture hangers with no pictures, and the bedspread was tattered and ripped. In the bathroom, there were two different styles and lengths of curtains that only partially covered a pole. The shower grout was dirty, the tub was chipped and discolored, and there was a lightbulb out in the fixture. The exhaust fan was broken and literally looked like something had ripped through the ceiling and tore its way out of it. The bathroom was really just not appealing and we kept the door closed. The whole room wasn't visibly dirty, but I didn't feel like I wanted to lie on the bedspread or let my young daughter crawl around on the floor. I did feel like I was putting out the desk clerk when I asked for some water before we left early one morning. I also wasn't aware that there were only steps, and older-home type steps that turn midway up, which was difficult with a young child, luggage, and carseat. I guess it was mostly aesthetics, but it was not a place I'd return to. The location was convenient, especially to the streetcar, and there were a couple good restaurants (particularly the pizza place next door) and a drugstore within walking distance.", "Date": "February 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "chicago", "Title": "“good location but dark, small rooms”", "Author": "ChicagoSped", "ReviewID": "UR55342107", "Content": "i suppose its like a house where location matters this place is very convenient but the room I had was small, dark and seemed poorly maintained. I suppose keeping a room in working order here must be hard with some tourists but I felt like it was the cheap apt you had when you were in college. the bathroom looked like it was repaired from holes in the wall, the towel bars looked like they were reinforced to hold people who hang on them, and the room was very tight with a large bed. Not sure if the lack of soap and shampoo was an oversight by the cleaning crew but its a disappointment when you step in bathroom to take a shower in the AM. Greet staff were friendly.", "Date": "February 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston", "Title": "“Great location, reasonable rates”", "Author": "HoustonMusiclover", "ReviewID": "UR55016208", "Content": "This was my second stay at the Avenue Garden Hotel. Although it doesn't have a restaurant on site. There's a great Italian restaurant next door and Voodoo BBQ on the other side as well as wonderful breakfasts at the St. Charles Tavern across the street as well as many other restaurants within walking distance. The trolley also runs right in front and it's a quick ride to Canal, the French Quarter and you can take a ride all the way through the Garden District from the hotel. The staff was very friendly and the rooms were clean. All the rooms were unique. Just don't get the front room off the front porch unless you're a heavy sleeper or early riser. Love this hotel and will always stay here when I'm in New Orleans.", "Date": "February 2, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "South Louisiana", "Title": "“AVENUE GARDEN HOTEL QUAINT, PLEASANT SURPRISE”", "Author": "Chubbywalker", "ReviewID": "UR54141061", "Content": "4 of us stayed here for the Cardinalâ€™s/Saintâ€™s game. As frequent visitors to NOLA, we decided to try something other than the 'Quarter. We recalled this gem from a stay last year. It is located in a former home, with whimsical detail to its dÃ©cor. Our rooms were nice size, clean & comfortable. Not large by 'chain' standards but certainly accommodating. Sorta feels like a nice B & B. No nightclubs nearby but Vieux Carreâ€™ is a 10 minute, $8 cab ride away. We were more interested in a little charm with lot less noise and no crowds in the street. Magazine St. with its shops is nearby. Plenty of nice restaurants, funky bars on this end of town plust ability for a morning run or â€˜chubby walkâ€™ down St. Charles. We appreciated the morning coffee, juices & light breakfast too. We recommend this if someone wants to try something other than the â€˜Quarter. Cool place, nice & gracious staff. Lotta bang for the buck.", "Date": "January 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Chicago", "Title": "“Great value for St. Charles Ave. location”", "Author": "leohonor", "ReviewID": "UR53857819", "Content": "Very reasonable rates for an excellent location; very convenient to a number of areas. Two Victorian style houses are combined for this hotel. Good, basic rooms with all necessities. Very accommodating, friendly and helpful staff. Rate includes continental breakfast; pleasant outdoor patio. Good restaurants within walking distance, including one of Emeril's. Although on St. Charles, the hotel is very quiet. Just walk out the door to hop on the St. Charles streetcar to French Quarter in one direction and Garden District and Tulane in the other.", "Date": "January 19, 2010"}, {"Ratings": {"Overall": "1.0", "Location": "1"}, "AuthorLocation": "New Orleans", "Title": "“Staff is abhorrently rude, shouting at passersby from the porch”", "Author": "x1ladybug", "ReviewID": "UR52680155", "Content": "Although the Garden Avenue Hotel seems to have received very great reviews on TripAdvisor, I must say that I have personally witnessed their staff shouting rudely at locals from the porch. As a manager for a local reputable tour company, I was appalled at the blatent rude shouts and comments from a staff member. I personally book groups in hotels and bed and breakfasts in the city, both corporate and leisure, and I can think of a multitude of other overnight accomodations with the same atmosphere, location, and price point of the Garden Avenue Hotel that I would rather send my business to. I sincerely would not recommend this Hotel to anyone whether they be clients, colleagues, or family/friends.", "Date": "January 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "NYC", "Title": "“Great location and great service!”", "Author": "saran116", "ReviewID": "UR52409512", "Content": "My sisters and I stayed at Avenue Garden Hotel for 3 nights for New Year's and loved it. There were 3 of us so we got the room on the top floor with 3 beds. The staff was awesome and Lydia Blanchard was great in pointing us to the right places to go during our stay (The Laura and Oak Alley plantation tour is a must!)! It was conveniently located and enabled us to hop on the St. Charle's trolley which stops right in front of the hotel. This was our first time in NOLA and we could not have asked for a better place to stay! The next time we go back, we'll definitely be staying here! Thanks!!", "Date": "January 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Macau, China", "Title": "“Exactly what I was looking for”", "Author": "nataliegoes", "ReviewID": "UR49476427", "Content": "When you stay in New Orleans you are not looking for an Interstate Cookie Cutter motel, all sterile and boring. You want quirky, and unique and Southern, and laissez-fair. And that's exactly what we found at the Avenue Garden. It's a quirky old house (or two) that rambles forever. It's decorated with contemporary, classic and kitschy artwork. The rooms are clean and comfortable and homey. Yet they still have Wi-fi (thank god). Breakfast was yummy, we loved eating out on the porch attended by the hotel cat. If you are looking for great tour guides, that's not really their job, so take a good book. But it's New Orleans, so go open minded and anywhere you go will be interesting.", "Date": "November 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Maryland", "Title": "“Great location!”", "Author": "thedukea1", "ReviewID": "UR48603538", "Content": "My wife and I made our first trip to New Orleans to celebrate our 10th Anniversary in mid October. Lydia, gave us great advice on dining/getting around the city and is one of the nicest hosts we have encountered while traveling. Per Lydia we went to the Acme Oyster House in the French Quarter for dinner the first night...it was awesome...highly recommend the chargrilled oysters. The location was great...a ten minute trolley ride (depending on traffic) to the French Quarter. The trolley stopped outside the hotel, less than half a block away. Plenty of free parking on the side streets (thanks to Lydia for that tip)...the police station is two blocks away so the area felt pretty safe. We saw officers eating at all of the restaurants around the hotel at various times of the day. Voodoo BBQ which is next door was really good. There is also a 24 hour Tavern next to Voodoo which serves ok food. At Pizza joint on the other side of the hotel which was always packed & Emeril's Delmonico, just a block or so away across the street. As for the hotel itself, it's broken into two buildings...the main house, where you check in and the building that is adjacent to it through a very cool deck/patio area. We stayed in the adjacent building. The room was clean and had plenty of space for us to store our cloths. The only problem we had was that there was a door to an adjoining room...it didn't dull any noise. It was like we were in the room with them. Plus we could hear the police sirens and cars honking rather easy all during the night. I would recommend trying to get a room in the main building. We were in our room less then 8 hours a day, so it didn't really bother us but I could see where the noise may bother others. If all you plan to do is just stay in the French Quarter, don't rent a car. With the trolley stopping right in front of the hotel, it's wasted money....and you will pay to park if you drive anywhere...and it wont be cheap. We really enjoyed our stay and definitely will go back!", "Date": "November 5, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "UK", "Title": "“Just OK”", "Author": "puddinguk", "ReviewID": "UR48289039", "Content": "we chose this hotel after seeing a few rave reviews on this site and where looking forward to something special however we where disapponted. For a start when they say parking they mean that either you pay an extra twenty a night or they direct you to find a side street to park in. We had booked and paid on line which confused the girl on reception who still thought we had to pay, she later appologised. It is unlikley that you will be able to park close to the hotel so travel light as once you arrive there are lots and lots of stairs to climb although to be fair a lady member of staff did offer to help carry some bags. The hotel does have character but that shouldnt include things like cracked mirror in the hall, silvering coming off the mirror in the bathroom etc. As you enter the room the door barely misses banging into the bed and we had a great view of a brick wall. This was the only hotel room we have ever stayed in that doesnt provide at least one bin, nor does it provide coffee making facilities. The bedhead is lovely carved wood but as a result it has sharp edges to bang your head on. The towels provided are the thin and of poor quality. After unpacking we set off to see some sights and got back a few hours later to find the room to our door wide open and two workmen inside working in the bathroom, they said they were doing routing maintence and stayed a further half hour. We later discovered that they were not doing routing maintenance but trying to fix the toilet, however they failed and the toilet continually refilled all night. The breakfast bar consists of two tables in a small alcove at the foot of the stairs, they say they provide cerials however by this they mean packets of oatmeal and grits not cornflakes etc. This would have been fine as I like oatmeal however they provide neither a microwave or kettle just a flask of warm water so that was a non starter. So we settled for toast however they only provide one toaster for all the guests and although it has four slots only two where working to there was a queue but thats just as well as there is only one small table to eat at indoors. We then thought well we will just have some orange juice but only apple is provided but if you want cake there is more than you can shake a stick at. Oh and if you have a problem with cats you may want to give this a miss as they have free run including the kitchen area. Guests are limited to certain hours at the hotel in that they have to leave by eleven pm. The walls are increadibly thin and therefore expect to be woken by any late arrvals and be heard even talking in your room. Certainly you will be woken by street noise or by any rain drumming on the air con units. In terms of location it is just too far to walk to the French Quarter but the street car does stop just outside however as this stop is at the end of the line expect to have to stand for the journey and in the evening the car may well be full and go sailing past, On coming back I misplaced my keys somewhere in the hall way and explained this to the man on reception as I was looking for them, he was indifferent and certainly never offered any assistance. This sounds a bit harsh and in fairness the hotel was ok if a bit below average its just that the comments here made it sound brilliant and its certainly not that. I am sure that there are beter value and better run in this great city. And as to the people running it they were the least helpful we have met in any hotel we have been to so far.", "Date": "November 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Chicago", "Title": "“Comfort, Hospitality, Convenience and an overall wonderful hotel experience in New Orleans.”", "Author": "mishellica", "ReviewID": "UR47919265", "Content": "I had the pleasure of staying for a full week in October 2009 at the Avenue Garden with a group of 10 friends on a rebuilding vacation. During that week my friends and I felt so welcome and relaxed due to the hospitality of the owners Lydia and Melissa as well as their staff. The hotel has the feel of a bed and breakfast that is set in a beautiful and unique building that I dare say feels very \"New Orleans\". Our group had 3 rooms, each was comfortable, clean, and quiet. The hotel is located right off of the St. Charles Streetcar, so it's very convenient to get to the French Quarter from there. The hotel is within short walking distances to many restaurants (including the excellent Voodoo BBQ downstairs), bars, as well as a Walgreens and Borders. Lydia and Melissa were happy to recommend places for us to experience, things to do, and great restaurants as well. One evening our group was hanging out in the parlor/lounge room before we were going to head out for the evening, and we starting talking with Lydia and some other guests. We ended up staying in the whole evening playing cards and talking and had a great time. The best part was that Lydia cooked out on the grill in the courtyard and offered Shrimp and Linguini for dinner to us. Staying at the Avenue Garden ended up not being just a place to rest during our New Orleans vacation, it actually played a part in creating a memorable and wonderful New Orleans experience. I totally recommend it!", "Date": "October 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Birmingham, AL", "Title": "“Frequent travelers, nicest staff EVER encountered!!!”", "Author": "ShelBama", "ReviewID": "UR46947656", "Content": "Our stay at the Avenue Garden Hotel was perfect! Our room was very nicely decorated, high ceilings, elegant bathroom, comfortable bed; everything you hope for, but don't always find. The location couldn't have been better. The trolley stopped outside, less than half a block away. There were also amazing restaurants within short walking distance. We ate lunch at voodoo barbecue every day because it was so good, not to mention the Purple Haze on tap. We walked to dinner at Emeril's Delmonico, just a block or two away. There is also the 24 hour Tavern across the street for late night fare. Of course we started each day with an amazing complimentary breakfast at the Avenue Garden which included this amazing cake! We don't usually eat cake for breakfast, but it is New Orleans, and it is a decadent way to start a decadent day. We also can't say enough positive things about the staff! They were unbelievably kind and helpful!!! They went above and beyond any expectations to help us fulfill our slightest whim, even in the middle of the night! I have traveled to New Orleans frequently, and we do not want to stay anywhere else during future visits. It really couldn't have been a more positive experience!", "Date": "October 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Atlanta, GA", "Title": "“This is my \"go-to\" place to stay in NOLA!”", "Author": "collegemama", "ReviewID": "UR45391489", "Content": "In August, I was in New Orleans to move my son into college and attend freshman orientation. I am thrilled to have found Avenue Garden! Immediately, I felt like I was a special guest in a private home. Lydia, the owner, is so gracious and attentive. The building is filled with old-fashioned southern charm, original art, and lovely comfortable furnishings. The continental breakfast is filled with a variety of pastries, breads and cereals, hot and cold. The hotel is surrounded by a variety of restaurants and the streetcar stops right in front, convenient to both the French Quarter and the Garden District. I am certain I will be staying there frequently over the next few years of my son's university tenure, and I look forward to the many opportunities to spend time w/ my new friend, Lydia!", "Date": "September 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "austria", "Title": "“cozy and familial”", "Author": "moni1712", "ReviewID": "UR44019138", "Content": "+ friendly and helpful staff + Breakfast in the morning + Internet access + surrounded by cute little restaurants + close to the french quarter + close to the garden district + streetcar station right across the street", "Date": "September 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "columbus,Ohio", "Title": "“Homey, comfortable, beautiful,convenient, and outstanding art”", "Author": "mogtog", "ReviewID": "UR42188983", "Content": "It was our second stay at the Garden Avenue and we like it so well we've already made reservations for next year. This is a weekend of the Jazz Festival and also our Anniverary weekend so we knew we would have a special time at this hotel. Lydia, the manager, started the same day we first stayed at this hotel. She has really beautified the building and added many personal touches that make this place gorgeous and comfortable. The staff is very courteous and helpful. The location is wonderful as it is at the end of the Garden District and the St.Charles streetcar is directly across from the hotel. Fine dining and casual dining is within walking distance. The price is very reasonable. We can't wait to return to this wonderful place. New Orleans is coming back.", "Date": "September 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "St. Louis", "Title": "“No other way to go”", "Author": "JSchultz80920", "ReviewID": "UR38115296", "Content": "This hotel was cozy, conveniently located and allowed you to feel as a resident for a stay, instead of just a hotel guest. The private entrances, charming courtyard and extremely friendly staff can't be beat. The trolley car picks you up right in front of the hotel, and is wonderful for heading out into the Garden District to see the history and architecture, or to take you to the French Quarter for some serious partying. If you are going to New Orleans, definately stay here!!!", "Date": "August 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Massachusetts", "Title": "“Better than your typical hotel stay!”", "Author": "travellingamy77", "ReviewID": "UR37030283", "Content": "I am a college student on a road trip and am used to just those typical Days Inn type places. I chose this hotel for it's (most importantly) rate and lack of bed bug reports, proximity to the French Quarter, and ability to put my car somewhere safe. I am very easy to please- all I really require is a safe, clean, place to sleep and this hotel went WAY above my expectations. The woman at the desk was very helpful. We couldn't figure out how to get the shower to work (but I am stupid and do this everywhere =) ) and she helped us find our way around with a map and good directions. Breakfast was amazing. I made myself some hot oatmeal, toasted a bagel with jelly, and a small piece of chocolate cake. We had our breakfast courtyard/patio type place right by the room. Our room is small, which is fine we paid $60/night for it, but for what it is it looks so pretty. I feel like I cheated the budget, but I didn't. We have everything we need, a spacious marble bathroom, and even a little kitchen area for a sink and microwave. Parking is $20 a day, in a garage around the block. I looked all over, parking is around this rate anywhere (hotel wise) near French Quarter. I feel safe with my car there. There is a $1.25 trolley right across the street that takes you to/from the French Quarter. We ate at both the pizzeria and the bbq restaurants directly on either side of the hotel and they were really cool with good food. This place is very cute, it is not the same as walking up and down the creepy hallways of a dreary chain motel. We were greeted by everyone we saw, staff and visitors. It is unique and definitely well worth a stay. It goes above and beyond a typical hotel visit.", "Date": "August 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Austin", "Title": "“Little Hotel with Lots of charm”", "Author": "Jdiddy78", "ReviewID": "UR36915097", "Content": "We arrived at the Avenue Garden Hotel just past 9pm on Thursday night. As we walked toward the hotel my girlfriends phone began to ring, just as we were about to answer we walked past a lady on the steps of the hotel on her phone, she paused and asked if we were the two people who had called her earlier lost? We replied we were, and she informed us she was calling to tell us there was an open parking spot in front of the hotel and she had been waiting out front for us. That is how we met Litya, the hotel manager, a charming southern lady who then took the time to show us around the former townhome (my guess) that was our hotel. She answered all of our touristy questions and even recommended The Acme Oyster House to eat, which became our favorite (try the char-grilled oysters!). About the hotel: This is a quaint, small hotel, it is not the Marriott or Hilton. We were looking for something that was had the character of the city, and in my opinion this place has it. The room was medium size, good enough for two people, it had an old fireplace that had been sealed, nice king size bed, tv and window a/c unit that definitely kept the room cool (I keep my house at 72 degrees year round, I like it cold, I cannot sleep if it's hot, and the window unit definitely worked!) The bathroom was a little small, but if you're only complaint is that you wish there was more bathroom space, that's a good thing. There was a continental breakfest served every morning, I didn't partake, as half the reason for the trip was to have NOLA food, but I saw groups of people each morning eating together on the patio sitting area. Coffee was ready every morning, which I did have. The area is great, lots of restaurants around the area. The tram picks up across the street which you can take to Canal Strret across from bourbon for $1.25 each way. Also, we took taxi's home each night from Bourbon street, and it ran from $7-8 each time. The front door of the hotel is locked at all times, you are given a key at checkin, so we always felt very safe. All in all, we enjoyed our stay, and the hotel definitely added to it, wouldn't hesitate to stay again!", "Date": "August 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sunderland", "Title": "“A Southern Gem”", "Author": "Gooner666", "ReviewID": "UR36797818", "Content": "Just returned to the UK after an extended trip to the USA and must admit enjoyed New Orleans the most! A fabulous small hotel that just oozes zstyle and has charming staff. The welcome you receive and atmosphere during your stay is brilliant and Lydia is most helpful. Close to the street car so no need for your own transport. Excellent bars and places to eat on your doorstep. If you want generic hotel rooms courtesy of a chain don't stay here...if you want a style, ambiance, a warm welcome, good advice and excellent coffee in the courtyard, the feel of a Louisiana welcome and excellent value for money then this is the place for you. I will return!!", "Date": "August 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Santa Rosa, CA", "Title": "“Quirky! Clean and convenient”", "Author": "travelbuddy32", "ReviewID": "UR35995175", "Content": "This was our second night on a cross country drive. Room was clean and looked just as nice as the pictures online indicated. Staff was helpful and courteous. Parking is limited. Steps from the trolley line. Would have loved to stay another night and would definitely return if in New Orleans again.", "Date": "July 28, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "NY", "Title": "“Excellent hotel for the size”", "Author": "duppykiller", "ReviewID": "UR35598888", "Content": "Stayed here for the weekend in October, and have to say I was impressed. Although the rooms are a bit small, being that it is a house converted into a hotel. The staff on site are wonderful. All were extremely helpful and friendly!! They all suggested places you can eat, nightlife, etc. Not too far from downtown NO and Bourbon street, though I had rented a car, the trolley was convenient being right out the front door of the hotel. Takes about 5-10 minutes to get to downtown NO by car. Very convenient. Would definitely stay here again!! Thanks for a great stay and excellent hospitality!!", "Date": "July 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Denton, TX", "Title": "“Great Hotel and Fantastic staff”", "Author": "storie444", "ReviewID": "UR34966908", "Content": "the hotel was fantastic, it had a very nice New Orleans feel and the staff was great. Manfred, a member of the hotel staff, was very helpful in finding local places and cool clubs/bars to just chill; He also was very hospitable and was always up for friendly conversation. The owner also changed are room for free when she found a mistake in our booking. Her and her partner were very nice. The honeymoon suite is beautiful and well decorated with unique furniture and artwork. The whole hotel has a very \"homey feel\" and the building itself has an old style motif throughout its hallways. I loved sitting on the patio under one of the big umbrellas and just smelling the local eateries. There are several excellent restraunts around the hotel and a trolly car across the street for easy transportation. They made me and my partner's honeymoon a wonderful experience.", "Date": "July 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "San Diego", "Title": "“I love this hotel!”", "Author": "jgfarned", "ReviewID": "UR34779602", "Content": "My boyfriend and I have stayed here twice, we liked it so much the first time. This is an older property, (window-type AC) and the rooms are small. If you're used to places like Hilton or Hyatt, the Avenue Garden may be a bit of a culture shock - there's not even a proper \"front desk,\" just a window. That being said, the staff is wonderful, the rooms are clean, there's free internet access, a lovely courtyard patio, and a New Orleans-style rooftop balcony that looks onto St. Charles. Not the part of St. Charles in the Garden District - that's further uptown; this is a slightly grittier, but still pretty nice, part of St Charles closer to the Quarter. This has been the major selling point for us: location, location, location. There's a street car stop right across from the hotel, and a cab into the heart of the Quarter is not expensive from here either. There are two tavern-type bars at either end of the block that are both open 24/7. (The St. Charles Tavern used to have awesome food, but is under new management and now the formerly delicious gumbo tastes like it came from a can. Bring back the old SCT!) There is a pretty good fast-food style BBQ place next to the hotel, and a truly excellent - and very reasonably priced - gourmet pizza place on the other side. Oh, and a new sushi/Japanese place just opened a few doors down (haven't gotten to try that one yet). In short, the Avenue Garden is surrounded by fabulous food choices, is close to both the Quarter and Uptown, and is a wonderful mix of New Orleans personality and professionalism. If you're looking for something different from the big chains, I highly recommend this place. It's not luxurious, but definitely worth the very reasonable price.", "Date": "July 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Cambridge, UK", "Title": "“Fine, but quite far from the French quarter”", "Author": "JoW2009", "ReviewID": "UR33718411", "Content": "Rather far out from the French quarter if you are only staying for a short time, but nice that it is in different district so you are close to other things instead. Street car stop just outside, which takes you to French quarter for a couple of bucks. But as most restaurants and music are in the French quarter you need to factor in a ten buck cab ride to get you back in the evening - for that price there are nice places in the French quarter which are still quiet enough. Rather eccentric staff - muddle over reservation wasn't fun to deal with when arriving. Otherwise helpful and very nice that they extended check out time to fit in with our flight departure.", "Date": "July 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Pearland, Texas", "Title": "“Feels like home away from home”", "Author": "1supermom", "ReviewID": "UR33708225", "Content": "My husband and I stayed here with our 11-year old daughters. The room was comfortable. There was a sitting area right outside our door with a sofa, table, and internet, which was convenient for reading and playing board games with the kids. There are two small restaurants on either side of the hotel (Italian and BBQ) so we walked next door, picked up dinner, and returned to the hotel to eat on their wonderful patio. Our room also had a small refrigerator. Ms. Lydia and Mr. Manfred couldn't have been kinder, and took care of our every need. The trolley stops right in front, and for five dollars, we all rode into the Garden District and the French Quarter. We plan on staying here again! (p.s. Thanks for the tea, Manfred!)", "Date": "July 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "lakeland, florida", "Title": "“Great Little Hotel........Felt like we were visiting old friends!”", "Author": "jkoscin1", "ReviewID": "UR33334161", "Content": "Wanting to get away for a short 3 day vacation, this hotel was the perfect choice. Upon arriving earlier than check-in, Lydia,our hostess, alllowed my wife and I to relax in the comfort of our room, and made us feel welcome. The room was extremely neat and clean, and the king-sized bed was comfortable. There was a very good continental breakfast served daily, with fresh coffee, baked goods, and juice. We enjoyed relaxing in the courtyard before we started our day. Lydia was helpful in suggesting itineraries during our short stay, and helped us make travel arrangements as needed. It didn't hurt also, that the streetcar line was located in front of the hotel. All-in-all, if you're looking for a great place to stay, without the impersonal feel of a large property, you won't go wrong staying at this hotel. We're looking forward to returning in the future!", "Date": "June 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New Orleans, LA", "Title": "“classic and charming new orleans style”", "Author": "shadesofpale", "ReviewID": "UR33331601", "Content": "avenue garden hotel is located on the st. charles streetcar line, which makes it incredibly easy to travel from uptown to downtown and to the french quarter. it is secure, with actual keys given to guests that unlock a series of doors leading to the rooms. the suites were large and roomy and the bedding was especially comfortable! amenities were more than i expected (fridge, ironing board, microwave, kitchen type sink) and the staff was very helpful through my stay. i recommend staying here not only because it is locally owned and managed, but because it provides a guest with an authentic new orleans experience.", "Date": "June 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Thibodaux, Louisiana", "Title": "“So very New Orleans, and so very nice!”", "Author": "bayouboy99", "ReviewID": "UR32923594", "Content": "I love, love, love, love, love this hotel. My stay here was fantastic. Lydia, the manager (owner? not sure) is as sweet and helpful as she can be, and hotel staff are kind and always ready to help with anything. The location on St. Charles means a $6 cab ride to the French Quarter in one direction and Uptown in the other. This means you're not far from the party, but when you've had enough you're a cheap cab ride to your quiet hotel room. Also, the location means hailing a cab at most hours of the day/night is super easy. The room was spotless, the bed was comfortable, the patio was precious. Stay here! You won't regret it. The price is so good I'd even call it underpriced. Highly, highly recommended!", "Date": "June 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "twoscoopsoflove", "Title": "“Southern Hospitality meets Southern Charm”", "Author": "twoscoopsoflove", "ReviewID": "UR32921693", "Content": "I stayed three nights in this amazing hotel. Lydia, Melissa, Manfeard and all the staff are always willing and glad to help. I had everything I needed and was very comfortable for my entire stay. The room was very clean, and the hotel decor is charming! The hotel is very secure, and someone is always available for any need. The location is superb. Not even five minutes from Downtown and the French Quarter, and within walking distance to many restaurants, shops, and bars. I can't wait to come back and stay at Avenue Gardens, my home away from home.", "Date": "June 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "oklahoma", "Title": "“Exceptionally charming hotel and staff”", "Author": "gatordoc96", "ReviewID": "UR32809980", "Content": "We stayed here for a brief overnight passage through town and found this wonderful place on trip advisor. The staff treated us like family from the moment we arrived. They went out of their way to accommodate our parking needs after a late arrival. The rooms were very charming with antique dÃ©cor and modern amenities! Great location on St. Charles street by the garden district with street car access a few steps away! We have been to New Orleans several times and wish we could have stayed here sooner!", "Date": "June 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Washington State, USA", "Title": "“Perfect place to stay for my first visit to New Orleans”", "Author": "rbc709295", "ReviewID": "UR32183457", "Content": "I stayed at the Avenue Garden Hotel the first week in June and I have to say that I have never enjoyed myself more. I booked through hotels.com and so when I arrived, I just had to stop by the desk and pick up the keys to the room. Lydia is the owner of the hotel and she is just about the nicest person I've ever encountered while traveling- extremely friendly, warm, and hospitable. When I asked her how far it was to Union Station, she offered to drive me there to pick up my grandmother - THEN she gave us a personal tour of the French Quarter! It was so pleasantly unexpected and wonderful; my grandmother and I enjoyed ourselves thoroughly. There are about 40 rooms in the hotel in 3 separate sections. Our room (#17) was right off of the Magnolia Room which is a common area with a living room feel (couch/chairs), a computer (with free internet access), and a dining room table - oh and let us not forget the AIR CONDITIONING!! Our room had 2 beds and a large bathroom with everything clean and comfortable and exactly what we needed for our 2 day visit. I also got a little tour of some of the other rooms with king beds in them and original brick-work and pre-war shuttered windows/doors and they're all individually fantastic!! The hotel is decorated with Lydia's family's art (mother and brother), giving the entire hotel a homey and personal feeling instead of that hotel-mass-produced prints of flowers and fruit - you can even purchase some of the art if you are so inclined. The patio seating area was gorgeous with the painted mural and potted flowers. The wrought-iron tables and chairs were beautiful to look at and surprisingly comfortable to sit and relax on and with the smells coming from VooDoo BBQ right next door...how much better could it be?!?!?! My grandmother uses a walker and was finding it a bit diffcult to get up and down the front stairs of the hotel so Lydia kindly offered us a personal key to the side gate so we could use the ramp up to our room - much appreciated by my gramma I can tell you! She also offered to call a cab for us anytime we went out touring and recommened places to eat and visit when we'd stop by the office. Melissa was also extremely friendly and helpful with anything we needed during our stay and always made a point of asking how we were and what sights we saw that day - and actually listened when we told her! These are the little things that make or break a stay for me when I'm away from home and I because of the service and facilities at Avenue Garden, I've already started planning when I'll be back to book this hotel again for my next trip to N'awlins! Honestly, I could go on about my experience at Avenue Garden Hotel but the bottom line is that it all comes down to this: It is a small, intimate, friendly, extremely welcoming, and priced-just-right hotel that should be enjoyed by as many visitors as possible!", "Date": "June 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Cerritos, California", "Title": "“Charming Small Hotel with Great Location and Friendly Staff”", "Author": "joe_travelerSoCal", "ReviewID": "UR30046614", "Content": "My girlfriend and I spent two nights and we were totally pleased. The \"street car\" on St. Charles in front of the hotel runs every few minutes and takes you straight to the French quarter. In the other dirrection, it takes you past old mansions, a beautiful park, and old universities. The hotel is in a nice neighborhood and consists of three smaller buildings attached by a nice enclosed private patio. Room 13 was nicely appointed and even thought it was near the front desk, we never heard any noise. It had its own air conditioner. Melissa was especially helpful as were all the staff. 24 hour street parking was just around the corner for our rental car, or you could pay $20 for the hotel to privide parking. I prefer smallher hotels and Avenue Garden met all our expectations. Joe and Sophie", "Date": "May 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "California", "Title": "“Highly recommend”", "Author": "cam100648", "ReviewID": "UR30037284", "Content": "We stayed at the hotel several years ago and enjoyed it then. It is now under new ownership and it is even nicer. They made many upgrades and added a really personal 'New Orleans' touch to the premise. Great location. We got a day pass for the RTA and toured New Orleans for $5.00!! Hotel is situated between a pizza parlour and a bar-b-que place. Both had wonderful food and we ordered food to go and sat on the hotel's front patio and ate while we watched the people, street car, vehicles, etc. go by. Very fun!!! We think it is the best deal in town.", "Date": "May 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Switzerland", "Title": "“Nice room and very nice people”", "Author": "meruk", "ReviewID": "UR29461690", "Content": "my som and I spent 2 nights at the Avenue Gardenhotel. The staffwere fantastic. Our room was nice and clean.", "Date": "May 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Oakland,CA", "Title": "“Great location and a homey charm!”", "Author": "randalv", "ReviewID": "UR29200829", "Content": "Loved this hotel. We stayed here for 3 nights (on a weekend between major tourist events) and felt perfectly at home. The owner gave us a tour and was very nice, as were the staff. It's a small business and a small, non-chain hotel with a family-run feel. The rooms were spacious and clean, nothing fancy, but a great deal for the price. A simple breakfast was included and we enjoyed ours every morning on the outdoor patio. The trolley stops right out front on St. Charles and for $1.25 will whisk you to the French Quarter in <10 minutes, or in the other direction, towards Uptown. The trolley Uptown (towards universities, cemeteries, Audubon Park, etc) was a highlight in and of itself for its 20+ minute parade through miles of scenic, stately, classic New Orleans houses. We had no trouble getting a cab outside the hotel on St. Charles either when the trolleys filled up, which they do when things are happening in the Quarter. I'd definitely stay here again. Just enough off the beaten path to quietly regroup between outings, but with easy access to everything New Orleans has to offer.", "Date": "May 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "CT", "Title": "“Great Value, Charm and Character!”", "Author": "CTJeremy", "ReviewID": "UR27642464", "Content": "My wife and I celebrated our anniversary with a trip to New Orleans and chose the Avenue Garden to spend the 5 nights in. We weren't exactly sure what to expect as the rate was almost \"too good to be true\" but were very pleasantly surprised! We wanted a hotel with a local feeling as we can stay in a generic high rise chain hotel anytime in that is exactly what this property offers, it felt more like a BnB than a hotel. The staff were all very helpful and responsive to our requests and questions. The location, right on the streetcar line, made our many trips to the French Quarter and the historic Garden District a piece of cake! We will definitely be back to New Orleans and would stay here again in a heartbeat.", "Date": "April 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "MINNESOTA", "Title": "“Fantasic Place”", "Author": "Jill M", "ReviewID": "UR27309811", "Content": "We stayed two nights at the end of March. It has more of a B& B feel than a hotel, the rooms were clean & spacious. Lydia was a gracious host who helped us with directions and questions. Alvina gave us great restaurant ideas. The Street car is right out front which worked out well to get around the city. The breakfast was good for continental we loved sitting out on the patio with all the flowers. The staff was great someone was always aorund if you had a question:) Thanks for the wonderful stay!!!!!", "Date": "April 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "San Diego, California", "Title": "“Very nice place, nice people, and great location.”", "Author": "osiris321", "ReviewID": "UR26849880", "Content": "My GF and I stayed four nights here and we liked it a lot. The staff is very helpful, our room was roomy and clean, as were the common areas. The price couldn't be beat. Continental breakfast was nice and well-done. Our room did have a framed mirror on the ceiling over the bed, which I wasn't keen on, but just ask for a room without one if that doesn't appeal to you, and they'll be happy to oblige. We wanted some extra blankets and the manager brought us a new comforter, still in its packaging. She also helped us to arrange for taxi service and was just generally very helpful. You can't beat the location, just walk out the door and you're on the St. Charles streetcar line. You don't even need a car to get to the Quarter or to the heart of the Garden District. Enjoy your stay in New Orleans!", "Date": "March 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Nebraska", "Title": "“Nice hotel and a good value!”", "Author": "jsgemnet", "ReviewID": "UR26781429", "Content": "I've stayed at the Avenue Garden hotel on several visits to New Orleans and it gets better each time. The new owner is a super nice lady who's doing her very best to make your stay comfortable, enjoyable as well as affordable! The Garden District location is exactly where I want to be. Give this hotel a try!!!", "Date": "March 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Best Southern Hospitality and Staff in New Orleans”", "Author": "Lizcara", "ReviewID": "UR26110193", "Content": "Great value, wonderful location, charming accomodations, good security, BEST STAFF ever. My new home away from home in New Orleans. You will love this place.", "Date": "March 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Thunder Bay, Ontario", "Title": "“Nice rooms, really nice staff, excellent location.”", "Author": "jimbojones007", "ReviewID": "UR25535526", "Content": "My wife and I spent 6 nights at the Avenue Garden Hotel starting the day after Mardi Gras and the staff could not have been more helpful or accomodating. The streetcar stops right in front of the hotel whichever direction you want to go, whether heading towards the end of the line up Carrolton for some nice restaurants along the way or to the end of the line at Bourbon and Canal Streets. We bought a 3 day pass for the streetcars and certainly got our moneys worth but we also walked right to the waterfront and into the French Quarter because we both enjoy walking for hours at a time for the exercise and to see the sights first hand rather than from the back of a taxi, tour bus or streetcar. The continental breakfast was a good start to the day however there is great pizza/pasta/salads next door (http://www.slicepizzeria.com/) or the Voodoo BBQ (http://www.voodoobbqandgrill.com/st.charles.html) on the other side of the hotel. I would recommend staying here to friends and family!", "Date": "March 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Texas", "Title": "“Just what we wanted for Mardi Gras!”", "Author": "cruiser890", "ReviewID": "UR25226879", "Content": "Great location to watch Mardi Gras parades. Staff was friendly and motivated to ensure guests enjoyed themselves. A great continental breakfast was provided as well as snacks and coffee all day. Only drawback was the price to park - a bit more than the average N.O. hotel. We will definitely stay at the hotel again.", "Date": "February 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kildare, Ireland", "Title": "“The best hotel Ive ever stayed at”", "Author": "MyPaperLion", "ReviewID": "UR24600818", "Content": "I went to New Orleans for a music festival with some friends and stayed at The Avenue Garden Hotel. Not only is it close to town but The staff are some of the nicest people I have ever met. They went out of their way to help my friends and I and I am eternally grateful for all the help I received while i was there. They really care about you as a person and how youre getting along. The hotel was extremely comfortable and homely and I wont ever hesitate when I have to pick a hotel to stay at when I'm in New Orleans. Stay at this hotel. You wont regret it.", "Date": "February 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Classic New Orleans”", "Author": "nbtterfly", "ReviewID": "UR24403022", "Content": "This hotel is run by the nicest people in the world! If you are unfamiliar with New Orleans this is the place to stay. The staff is incredibly helpful in helping you find where you need to go and making recommendations for things to do. The hotel itself is located right along the path of one of New Orleans best Mardi Gras parades and beads hang in the trees along St. Charles year round. It's the ideal location for visiting the French Quarter because the street car line stops right outside the hotel! You have easy access to all of the best New Orleans sights at the same time as staying in one of the quieter parts of town. The hotel building is small and quaint and the ideal location for your 'classic' New Orleans vacation! I have stayed here on two occasions and you CANNOT beat the quality of the hotel for this price. I will never stay any where else when I visit New Orleans!!", "Date": "February 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Loved this hotel!”", "Author": "pipsterLA", "ReviewID": "UR24058213", "Content": "My friend and I stayed at this cute little hotel for a weekend, and we absolutely LOVED it. The staff were fantastic (Manfread even bought us special cream cheese for our bagels in the morning!) - they were helpful, nice, accomodating, and friendly. The location was great - right on historic St. Charles Ave, where you can take a streetcar down the road to look at old beautiful NOLA houses, and also close to the French Quarter. We definitely recommend this hotel!", "Date": "January 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Trinidad", "Title": "“Easy in teh Big Easy”", "Author": "AryanPrince", "ReviewID": "UR23549619", "Content": "The staff at this hotel were professional, warm and extremely friendly. In fact in all my travels I have not come across a more \"down-to-earth\" bunch. Interaction with them was excellent.", "Date": "January 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "calera", "Title": "“Wonderful True New Orleans Hotel !!!!”", "Author": "Debbie17Calera", "ReviewID": "UR22747221", "Content": "Wow what a neat find!! I was in New Orleans on a business trip. Wanting to save money I booked this hotel. Wow what a surprise did I get for my money!! Upon walking thru the door I knew it was going to be a treat. Lots of wonderful New Orleans character. Building was built in 1800s with high ceilings, windows, and doors. After I checked in the desk clerk walked me to my room, showing me the balony I was welcomed to use, and the breakfast room as well. The staff was extremly friendly and helpful. As a women traveling alone, I felt very save and secure staying here. I'll be back!!!", "Date": "December 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bloomington, IN", "Title": "“A Wonderful Experience”", "Author": "dack6849", "ReviewID": "UR21575668", "Content": "My wife had flight coupons that needed to be used before the expiration date. We wanted to go someplace we've never been for a long weekend. We chose New Orleans. Knowing very little about the city or the hotels, I chose to try to save money by using Orbitz.com. We took a shuttle from the airport to the city. We were the last stop since our hotel was not in the city, but in the Garden District. Again, we didn't really know what that meant. Everyone else was dropped off at a high rise hotel that can be found in any city USA. Our hotel was an old 2-story hotel in a very quaint part of town. We entered the hotel and began what was one of the most wonderful weekends we have ever enjoyed together - and the Garden Avenue Hotel was a big part of the perfect weekend. The accommodations were perfect. The staff is incredibly friendly and the surrounding area is amazing. Upon leaving, my wife and I commented that our stay was much more like a Bed and Breakfast than a hotel. Lydia, Alvia and the rest of the staff went out of their way to make sure we had everything we needed saw the highlights of the city. I will never stay any place else and highly recommend The Garden Avenue to anyone traveling to New Orleans. By the way, if you look at a map and it seems the hotel is too far from the city, the street car will get you to the intersection of Canal and Bourbon in 10 minutes. Taking the street car the other direction will lead you into one of the most beautiful neighborhoods in the world. Take it all the way to the end, eat at the Camilla Grill and enjoy a walk back past Tulane University and Loyola University, the beautiful old houses and down Magazine Street.", "Date": "November 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sachse, Texas", "Title": "“Perfectly Quaint”", "Author": "sachsemom", "ReviewID": "UR20453261", "Content": "I would definately stay here again. The rooms were nice and the atomosphere was that of a quaint bed and breakfast. The staff were accomodating, helpful and knowledgeable offering information on tours and restaurants. One of the best places we ate was Voo Doo BBQ which is right next door and Stop 9 which is just across the street. I recommend a swamp tour through Louisiana Tour Co. It's a bit pricey for the air boat tour but well worth it. Our guide was charming, funny and full of New Orleans history! The Haunted History Tour was mediocre at best.", "Date": "September 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Birmingham, AL", "Title": "“Nice place, good location”", "Author": "wjg63", "ReviewID": "UR19119961", "Content": "We went down to NOLA for a long weekend and picked this place after a little web searching. Our room was very comfortable and recently renovated. The staff was friendly and helpfull. Emeril's is a 2 block walk away. The Garden District has become a little more sketchy of a neighborhood post Katrina, but is still one of the nicer parts of New Orleans. Lots of good restaurants in easy walking distance.", "Date": "August 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ireland", "Title": "“would go back”", "Author": "europeanfly", "ReviewID": "UR19041746", "Content": "This hotel was well located and the street car is right outside the door so its so easy to get in and out of the french quarter and bourbon st. The room was perfect for me as a solo traveller, the bed was huge and the decor had an old french feel about it. The staff were very helpful in advising me about tours and places to go and see. I didn't spend much time in the room but carpet on the floor could have been hoovered a little and water in the shower was cold at times but overall i had an enjoyable stay and the neighbourhood is safe and quiet", "Date": "August 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Louisina", "Title": "“We loved it!!!!! Best deal in NOLA!!”", "Author": "travel4workAA", "ReviewID": "UR17285879", "Content": "This place is amazing! My husband and I stayed here for our anniversary and loved it. We booked on the website last minute and got a great rate. The staff was wonderful and very helpful. They offer off street parking for $10 a day, which is very affordable and recommended. The location was perfect ~ right on the trolley line. There are several local restaurants and bars that are very close and very affordable. The rooms are like an old boarding house and very romantic. The court yard is great for just chilling with a few drinks and friends. I recommend this place to anyone who wants a try New Orleans experience at a great price and location.", "Date": "June 27, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Houston", "Title": "“Hit and Miss”", "Author": "wynot", "ReviewID": "UR17188052", "Content": "The Avenue Garden Hotel is not for everyone but if you are comfortable with some compromises, it's a good value. We travel often and prefer off-beat, privately owned properties so the Avenue Garden was right up our alley. That said, there are both pros and cons. On the upside, the location in the Garden District is convenient to the street car, dining and the New Orleans vibe is palpable. It should be noted that the hotel offers very limited parking in its garage around the block (with a glitchy garage door) so you may be parking on the street any where within a several block radius. Keep that in mind if you are uncomfortable leaving your car unattended the neighborhood. The hotel does have a loading zone in the front and we were able to park there long enough to move our bags in and out. Upon check-in, we were given a room without a shower curtain but with clothes and personal items in the armoire (the result of a minor miscommunication, as it turns out). Those things were easily remedied but the door didn't lock and that was not! We were moved to another, less desirable room for the night and then moved again to a nicer room the next day. Having seen three rooms, I can honestly say that the furnishings are a little bit dinged but the beds are comfortable, the bathrooms functional, and the overall level of cleanliness is quite good. There are some oddities afoot however: despite two network hubs, there is no wi-fi - no connectability, no signal - but there is a computer for use in a common area and it had good internet speed. All three rooms we saw had ironing boards but only one had an iron. One room had only one lamp and it was in the opposite corner from the beds. There were no hairdryers. If you are traveling by car, seriously consider bringing your own pillows. On the plus side, the staff was very pleasant and accommodating. The owner is making upgrades to the property. We got a bargain rate and overall the accommodations were well in line with what we paid. I was really only frustrated with the defective door lock (I'm told it's been fixed) and the lack of wi-fi which truly was maddening.", "Date": "June 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Milwaukee, WI/New Orleans, LA", "Title": "“Avenue Garden Hotel”", "Author": "ChristinX1", "ReviewID": "UR17158784", "Content": "I've stayed in this quaint hotel every time I've been home to visit New Orleans (since Katrina), and each time it gets better. Avenue Garden is now under new ownership, and the lovely Ms. Lydia is simply awesome. She's friendly, and she cares about her guests. She is updating/repairing the rooms, which has been a work in progress since Katrina, and I'm happy to see it. The rooms themselves are small, but they suit me fine, as I'm not there to sleep - I'm there to visit and have fun! I'm rarely in my room. There is a nice sized TV, alarm clock, and efficient AC. If you are in a room nearer to St. Charles Ave, you might hear the streetcar pass by in the evening/morning, but to me it's a soothing sound (I'm happy they're back!). There is a computer for guest's use in the lobby, and there is now an assortment of breakfast items there, as well (this is new - it used to be just coffee) - muffins, sweet rolls, juice and the like. There is no elevator, so be prepared to not only walk up the front steps, but to your room if you're upstairs. I request a 1st level room when I stay there. Location-wise, I don't think there's a better deal in the city. Right Uptown/Garden District on the St. Charles streetcar line, and just a few dollars for a United into the CBD, Quarter or Marigny. It's walking distance to Magazine Street (4 blocks), and there are several excellent restaurants, bars and shops right on St. Charles Avenue, as well (Slice, Miyako, St. Charles Tavern, Sushi Brothers, Voodoo BBQ and Lucky's, to name a few). Until I move back home, this is where I'll always stay.", "Date": "June 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Antonio", "Title": "“Gorgeous Wonderful Avenue Garden”", "Author": "PedroAguayo", "ReviewID": "UR17157300", "Content": "We arrived in New Orleans planning to stay with a friend, and when plans changed we went on Orbitz and searched for a nice Hotel within our friends living area. Low and behold we found a great deal for the Avenue Garden Hotel. Now for the price we got through orbitz for the hotel, well I'll just say we really appreciated it. This Hotel was magnificent, beautiful, and truly New Orleans style. The rooms were so fabulously decorated in old French Quarter, the staff was extremely pleasant. Everything was so convenient to get to. I know when I go back I'm booking this hotel even if I have to pay triple the price!!", "Date": "June 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lake Charles, LA", "Title": "“Fine with me”", "Author": "ManandDan", "ReviewID": "UR16966646", "Content": "This hotel was fine with me. The staff was more than accommodating when I had to change the reservation date several times. We had room #28. Our bed was very, very comfortable. The bathroom was immaculate. I am VERY picky about a clean hotel bathroom and I was impressed. The tub was sparkling white with no sign of dirt or mold anywhere. The hotel is old and the furniture in the room was slightly scratched, etc. But, who cares about a dresser or night stand you aren't going to use! We did only stay one night, so I cannot comment on the maid service. Also, we did not park in the garage, so we did not have to pay the $10 parking fee. I would definitely stay there again...........", "Date": "June 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "transafe", "Title": "“Great Experience”", "Author": "transafe", "ReviewID": "UR16942621", "Content": "This hotel has a new owner and she is doing a great job of upgrading the facilities. She is gracious and has great southern hospitality and charm about her. It is a great place for people who like to see New Orleans away from French Quarters. Great restaurants next door.", "Date": "June 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronot, Ontario", "Title": "“Ideal Spot! Great Experience!”", "Author": "QueenSt11", "ReviewID": "UR16747015", "Content": "I stayed at the hotel a few weekends ago while in town to attend my granddaughter's graduation from Loyola. The hotel is the quintessential bargain for college parents and is in the greatest location - not quite in the french quarter and not too far uptown. The hotel is located right on the trolley line (with RTA passes available at the front desk) and the ride to campus or downtown is no more than twenty minutes. The building was characteristically New Orleans and made me feel like I was staying with family or friends rather than at a hotel. If you are looking for a fancy, corporate Marriot or Sheraton, this is not the place for you. But if you prefer to stay in a cozy and comfortable bed and breakfast type of hotel, the Avenue Garden is the perfect fit. The staff was helpful, friendly, and well-informed about the area. I had no problems getting around by myself. My room was spacious and the interior looked very new. Housekeeping was curteous and kept my room clean and stocked. Overall, I was more than pleased with my experience and would strongly recommend this hotel, especially to those traveling on a budget.", "Date": "June 7, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "601_Queen", "Title": "“Hell Hotel!!!!Hell Manager!!!!!!Owner!!!Whatever!”", "Author": "601_Queen", "ReviewID": "UR16613024", "Content": "I checked-in this hotel on a Wednesday, and stayed until Saturday morning as I couldn't get out of the hotel as told by the website I booked with had spoken with the nasty, UNPROFESSIONAL manager. When I arrived, a lady was storming out the door past me. The red flag should've gone off...The nasty manager said to the desk clerk, \"MISSISSIPPI\" -Yea room #25\". Which must be the worst piece-of-crap on the property! I dialed 0 to report the smoke alarm was hanging by the wires, and the curtain was hanging on the 1st day, it had not been remedied even when I checked out. See Pics...They don't change the sheets, but will make your bed. If someone partially use shampoo, you will get the leftovers in your bathroom. For breakfast, on Wednesday there was raisin bread and there was the same bread on Friday morning, too. They will tell you this-and-that is being renovated-a LIE! There was no renovation going on in the kitchen on neither day, and you will walk to the attached restaurant for ice...There's no FREE parking. Get prepared to park on the street, and feed the meters! I complained to the manager which states she just arrived there, but further states that she is the \"OWNER\". She didn't want to hear anything I had to say, and walked to her room #18. She slammed the door, and that's how complaints are handled. The only positive is the location.", "Date": "June 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Philadelphia PA", "Title": "“Great place to stay”", "Author": "CristinB", "ReviewID": "UR15803638", "Content": "I stayed here during Jazz Fest and was expecting something not so nice but I was pleasantly surprised. We arrived in town very early and they let us check in to our room early and gave us garage parking spot for the whole weekend. The room was very clean and staff was very nice. I was very pleased w/ my stay and will definitely stay here again.", "Date": "May 8, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Just right for me”", "Author": "vascale", "ReviewID": "UR15437227", "Content": "I booked this hotel on their website with no problems. The location is great, mid-between the French Quarter and the Garden District, both really accessible from the St. Charles street car stop right across the street. It's $1.25 each way for all streetcars, but you can get an all day pass at the desk for $3, or go down to the small market a few blocks down on the same side of the street for a 3 day pass. The hotel staff is nice and will help set up tours, but you can do this either on their computer (free internet) or call from your room. My room was comfy, with a mirror on the ceiling :) They do have balconies, but I wasn't able to get a room with it, instead my view was a blank wall across the alley, but that was ok. The window had a crack in it, housekeeping didn't clean inbetween days in my room, but I saw they did in others. Wasn't a problem though. The shower didn't work for me, but can't say it was broken...may have just been me. Baths were great though. The bed was a king and REALLY comfortable. Staff accomodated a wake up call. They are at the desk until 3am and very helpful with directions and safety measures. GREAT pizza literally 2 steps next door, and great BBQ on corner, 30 seconds away. Would stay here again, definitely. Oh, best part, $59 a night. Can't beat that!", "Date": "April 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Gainesville, FL", "Title": "“Fantastic value”", "Author": "ataube59", "ReviewID": "UR15041177", "Content": "The Avenue Garden Hotel is a nice, small hotel in the Garden District in New Orleans. Located near a bunch of good (and relatively inexpensive) restaurants, it is in a good neighborhood, with easy access to a trolley that takes you to the French Quarter. We had a sizable group (8 people) and the staff bent over backwards to make our stay enjoyable. All of that and price was hard to beat. If you don't expect anything too fancy you will be very satisfied.", "Date": "April 14, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "west Texas", "Title": "“Good hotel, good price”", "Author": "porter_osborne", "ReviewID": "UR14925829", "Content": "Property is renovated old structure. The style of the hotel give lots of old city feel with most modern conveniences. Was there same weekend as a youth group, so they were a bit noisy, but that can happen in any hotel. trolly stop is right across the street and takes you all the way to canal and st. charles.", "Date": "April 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Davenport, IA", "Title": "“Very happy with our stay!”", "Author": "Breity2", "ReviewID": "UR13794929", "Content": "We just got back from staying in New Orleans at the Avenue Garden Hotel. We were very impressed with the hotel. With paying such a cheap rate ($59/night), I was a little nervous about what we'd get because 'you get what you pay for'. We arrived in town around 11 a.m. and didn't figure our room would be ready, but figured we'd stop and see anyway. Well, it wasn't so we decided to take the street car down to the French Quarter and start our sight seeing. We left our luggage in the car because we drove down, but they were also willing to store your luggage in a side room for you if you needed to. We had left our phone number with them, so they called us when the room was ready, which was nice so we didn't have to keep wondering. We chose to park on the side streets, not in the garage that was offered, and had absolutely no problems. The hardest time we had finding parking was in the French Quarter, not around our hotel. After checking in, showing us our room and offering to help carry our luggage for us, the girl working the front desk left us to get settled in. Our room was great!! It was number 47 which I would definitely recommend. It was on the top floor on the front so we had two double doors going out to the balcony and a king size bed. They made this room very modern, as well. The bed (king size) was not the most comfortable, but it served its purpose. My only two complaints about this hotel would be the light in the bathroom above the mirror didn't work and the light bulb in the ceiling didn't work all the time as well. My husband was trying to get the bulb in the ceiling to work, and it shattered everywhere. They came up and cleaned it up very quickly, but never got it replaced, so I had to do my hair/makeup in the main room with the light from a lamp. My second complaint is there's no phone in the room. That made our previous problem a little inconvenient. Overall, I would recommend this hotel! It's location was great with the street car right out front and two great restaurants on each side of it! We never walked to the French Quarter, but it was definitely do-able. Kudos to the Avenue Garden Hotel!!!", "Date": "February 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "cheeseandwine", "Title": "“location, location, price, location”", "Author": "cheeseandwine", "ReviewID": "UR11269099", "Content": "I am a business traveler who has a set budget. I try to find a a great hotel for a great price so I can spend my money eating New Orleans' wonderful cuisine. This was my first trip to the Avenue Garden Hotel and my stay was nothing short of wonderful. I arrived earlier than the 3:00 p.m. check in time, prepared to wait, but was able to get into my room immediately. Parking was offered to me in a garage behind the hotel which was about a 1/2 block...instead i parked on side of the hotel which was free and closer to the one entrance. The room was a bit small for my taste but it had all the essentials. Furniture was a little outdated but didn't bother me. The room had a king sized bed(comfy bed and pillows), desk and chair, nice size t.v. and a non working fireplace that added a bit of charm. The bathroom may have been a little outdated as well but was well lit by a small window and had great water pressure as well as an abundance of hot water...I love hot showers. The front desk was very helpful in finding me the best spots in town to eat and listen to live music. The street car stops right out front and runs till around 11 which is nice if you are downtown eating a late dinner. The hotel is located in the perfect location. A stones throw to the garden district and arts district and not far from the French Quarter...which takes like 15 minutes to walk to. Being a business traveler I need internet access, and a good night sleep which i was able to get at the Avenue Garden Hotel. by the way, the internet is free. I will definitely be staying here for future trips to New Orleans, business related or not. The great location and the friendly and helpful staff as well as the comfortable and affordable accommodations will keep me coming back!", "Date": "December 5, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Baton Rouge,La", "Title": "“We got a parking ticket for $20 for staying at this hotel”", "Author": "Poohmon02", "ReviewID": "UR11201097", "Content": "We stayed there when a special event was going on and when we got there,the front desk rep. told us that we can park anywhere,because the police dont ticket people on the weekends, so we parked in front of the hotel(on St. Charles Street)because there was no where to park, when we checked in our room we walked back to our car and there was a parking ticket on our car. I would like to say for those who plan to go to Mardi Gras if you want to stay at this hotel, park on Martin Luther king street or on another street, but it is going to be hard to find a parking space because the restaraunts customers park there also, do not park in front of the gree and white house too.", "Date": "December 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Francisco", "Title": "“I love the Avenue Garden”", "Author": "BillArkansaw", "ReviewID": "UR10483427", "Content": "I've stayed in four rooms at the Avenue Garden Hotel over four visits over the years. I'm both cheap and a single traveler, so it is a great hotel for me. When I first started coming to New Orleans, I would compare prices and the AGH was always very reasonably priced compared to its competition. A couple of the rooms I have stayed in were a little on the small side, but they were plenty for just me. The bigger rooms should be enough for a couple. The hotel is located in sort of an odd neighborhood that isn't in any of the destinations, but it is near to all of them. I really don't understand why people would want to pay a severe premium to stay in the French Quarter and the nonsense that it entails when you can stay 5 minutes away for a fraction of the price. The hotel doesn't have a bar or restaurant, but it really wouldn't make sense to have either when there is a perfectly good BBQ joint on one side and an excellent pizza place on the other. Avenue Garden Hotel isn't a fancy place and it isn't a big place, but it is placed right and priced right, so that's all I can really ask for (it also doesn't hurt that the girls behind the desk are cute.)", "Date": "October 31, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Jolon, California", "Title": "“Great base for New Orleans visit - comfortable, economical & friendly”", "Author": "slc624", "ReviewID": "UR8538691", "Content": "The Avenue Garden Hotel is a great place to use as a base for a trip to New Orleans. A few small flaws keep it from perfection, but for the price I don't think it can be beat anywhere. I had never visited New Orleans before, so I have no point of reference for the feel of the city and the Garden District, nor for what makes a good price for a hotel there. But since what we paid was less than a Motel 6 here in Wilmington, N.C., (and which is nowhere near either the beach or the river!) and the hotel itself and the neighborhood it lives in were both significantly more charming than the average Motel 6, I call it a fabulous bargain. As a boutique hotel, the Avenue Garden probably offers a wide variety of rooms, so I will specify that we were in Room 16. It's a two-bed double, with two double windows (although the view is nothing to write home about â€“ a brick wall on one side and a vacant lot and cyclone fence, with morning glories, on the other) providing plenty of natural light. The window air conditioning unit wasn't on when we arrived late in a sweltering afternoon, but it cooled off adequately while we were out for dinner. The beds, bathroom, shower, and water pressure were all fine, but the water temperature â€“ \"cold\" water so warm that no hot needed to be added for an August shower â€“ left something to be desired. The biggest issue we had with the hotel staff was the mystification with which they greeted my request for something nonskid to stand on in the smooth-as-glass bathtub while showering. Apparently their 78-year-old mothers aren't using it! We made do with a towel in the tub. The second-biggest issue was their insistence on making up the entire room every day, removing perfectly good soap and shampoo, when we specifically asked them to leave clean towels only. We also had a minor problem with the remote control for the TV that took four people two days to fix. For those driving to New Orleans or renting a car for the visit, note carefully: the garage is very small, perhaps eight spaces. It is free, which is great, but there wasn't a space available the day we arrived, so the car had to stay on the street in a metered space that needs quarters beginning at 8 a.m. Fortunately, we were having breakfast around the corner and saw some other guests leaving to go check out, so I ran and got the prized garage clicker before I fed any meters. The staff suggested that it would help to mention that youâ€™re driving when you make the reservation, although they didn't go so far as to say that would guarantee a spot as they are first-come, first-serve. There is also a distinct lack of information provided about the hotel's services and offerings, at least in our room. We had to follow a man with an ice bucket to find the ice machine. The desk is open (I think) between 7 a.m. and 11 p.m., with a phone number for other-hours emergencies. There is a breakfast area (it looks like one and one desk clerk referred to it as such), but no breakfast, only coffee â€“ and infuriatingly enough, they turn off the reservoir-style coffee maker so that it takes an hour to heat up and I couldn't even make tea that I brought myself until 8 a.m., after arising at 6 since I was still on Eastern time. The website claims internet access in every room, but since there was no desk and this was among the amenities about which no information was provided, I never even got out my laptop to try and find out. The old, slow computer in the lobby just outside the room sufficed for a quick map search or to check my email. Somehow it got logged off one morning, but the staff got it back up for me when I asked. The staff, except for the two issues noted above, were all very friendly and helpful. There were a couple of unusual aspects to the reservation and they dealt with them in a an outstandingly satisfactory fashion. When I left the keys on the nightstand during a jaunt down on the bayous, they happily let us in when we returned, and they even printed a map for me, out of my email. While it would be a very long and perhaps not recommended walk to the French Quarter, it can also be a pain to drive. Fortunately we went there with family members who were staying there, so I didn't have to drive or pay for a cab. Based upon my observations of traffic, etc., I think I would drive and pay to park in the public lot along the river near the French Market for a daytime visit and take a cab for an evening out in the French Quarter. It's also important to note that the streetcars, as of this writing at the end of August 2007, are still not running along St. Charles Avenue past Lee Circle (coming from the French Quarter). Lee Circle is about 10 blocks away, but I didn't see a likely (safe and comfortable) pedestrian route there. I don't know what the schedule is for restoring streetcar service â€“ once they are back, the transportation issue would be much less important. I might even do without a car on a return trip if the streetcar were running â€“ airport shuttle is $13 each way per person, so for just me it would be a decent savings. Right in the walkable radius of the hotel are several options for food, including Emeril's Delmonico. We didn't eat there, but certainly would give it a try if we hadn't had such a busy schedule already. The best meal we had in three days there was at VooDoo BBQ right next door â€“ so close that the hotel's back patio connects to theirs! A party of six had all the major offerings on the menu but the ribs, and it was all absolutely wonderful, from the pulled pork and brisket to the corn pudding and \"gris-gris greens\" (mustard) just like Grandma's. St. Charles Tavern around the corner was good for breakfast (think neighborhood bar that morphs into pancake house at dawn, open 24 hours!) but we ran into a real attitude problem on the second visit â€“ look for a separate review shortly. The rest of our party was staying in a nice, slightly larger hotel with a pool, in the French Quarter, for about $20 a night more for a comparable room also including free parking, and walking distance to all the tourist stuff. Those who want to be in the thick of things in the French Quarter may want to spend a little more, especially if they don't plan to drive at all. But for us, with a schedule that included several legs on I-10, accessed only five blocks from the hotel, this one really suited us, and if I go back I will definitely stay there again. As for New Orleans itself, well, there isn't room in a review like this. It was unbelievable all the way around, but to us what is most remarkable is the resiliency of the city and its people. It is still terrible in many places, and we may well have dealt with people whose living conditions are still bad â€“ but in tourist places and elsewhere, they were warm and welcoming and never let on, and we were deeply impressed.", "Date": "August 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Regina, Saskatchewan Canada", "Title": "“Was like being at home”", "Author": "HeartNewOrleans", "ReviewID": "UR7630925", "Content": "We stayed at this hotel in June of 2004 and had a wonderful time. I have read many reviews and have determined that it all depends on what your expectations are. If you are expecting a posh five star hotel with all of the amenities, then you will be disappointed because this hotel has a bed and breakfast feel to it. It is cozy and comfortable, warm and beautifully decorated. Our stay at this hotel made us feel like it was our home for the seven days we stayed. The staff was wonderful, especially the front desk girl who we actually became friends with. We are getting married next July 2008 and plan to return to New Orleans as part of our homeymoon and will definately be staying at this hotel.", "Date": "May 16, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "San Francisco", "Title": "“disapointed”", "Author": "onhollyday", "ReviewID": "UR7539865", "Content": "Based on the previous reviews, I expected a little more from this hotel...I don't care if a hotel I stay in is fancy, modern or with a lot of amentities BUT I do care if it is clean. This place did not feel clean and the bedding was very old and questionable... I did not look forward to laying my head down each night. We even switched rooms in hopes of it improving but it did not. The hotel staff was very nice though and the location was pretty convenient.", "Date": "May 2, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Atlanta", "Title": "“Pleasantly surprised!”", "Author": "apoa17", "ReviewID": "UR7271441", "Content": "I recently stayed for four nights in New Orleans for a convention and with my company I travel a ton and frankly can call the bigger chain hotels home. I asked my company to find a more home -like place to stay and found AGH to be what I was looking for. It's small enough that the staff knew my name yet the hotel provided all the amenities and courtesy of the big names. From check in to check out, I was consistently asked how my stay was and if anything could be done to make it better. The bed and breakfast style hotel was refreshing after a long day. Quiet, friendly and relaxing. There were plenty of places for a quick bite if my schedule demanded it and above all I felt safe, a concern I had staying in downtown New Orleans. The location was perfect for me, far enough away from the hustle and bustle of downtown yet close enough to the city's best restaurants and unique nightlife. I would definitely suggest it to travelers missing home and tired of \"business as usual\" trips.", "Date": "April 2, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "sterling heights, mi", "Title": "“Great Place for Get Away”", "Author": "momof3beautifulgirls", "ReviewID": "UR6634402", "Content": "The hotel was a great place for a 4 day get-away. The hotel is next door to a fantastic bbq restaurant and short walks to many other wonderful places to eat. The bus line is right in front of the hotel to take you to the French Quarter ($2.50 round trip ride vs. an expensive taxi ride is definitely a plus when staying for several days). Hotel staff were pleasant, room was small but clean, and any requests were handled quickly. The patio was a great way to sit outside, but it is enclosed by the buildings and didn't really provide any views, but that was okay with us because we just wanted to be out enjoying the 70 degree weather. Be sure to visit Donna's on North Rampart for live jazz, good food, and friendly New Orleans people.", "Date": "January 21, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "", "Title": "“Dreary and Dirty”", "Author": "LoveNewOrleans", "ReviewID": "UR6359674", "Content": "I read all the reviews so I thought it was going to be an ok hotel - Well - I walked into this room that smelled like wet towels - the fan did not work - the toilet over flowed and there is absolutely no hot water in the morning or around dinner time - The bathroom floor was dirty and looked like it needed a good scrubbing - The outside chairs were all ripped and dirty - the coffee seemed like it was there for hours and never changed - Overall, a dump - I would never go back and would never recommend this place -", "Date": "December 11, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Columbus, GA", "Title": "“Ok experience but kind of rundown”", "Author": "LydiaGenevieve", "ReviewID": "UR6034950", "Content": "We stayed one night at the Avenue Garden hotel for our honeymoon and although the room was pretty nice we had a fair amount of problems. I recommend contacting the property directly and checking expedia prices to see which is better, it varies. We were told that there was parking that would be $10 or $15 per day but when we arrived there was no more available, luckily we were allowed to park in the employee parking lot. We had (months ago) requested the honeymoon suite featured on their website with the round red bed but when we arrived we were in the other \"honeymoon suite,\" which was one of the most atrocious rooms I've ever seen. We were able to be moved into the room we had originally requested but when we got in the carpet had litter all over it and there were no towels. These problems were fixed promptly and the room is actually pretty nice. The furniture is pretty neat, nice paint job, etc but there were all sorts of little things that really took away from it. The blinds looked like someone had been shoved into them, one set were pretty mangled and needed replacing. The bedspread was a pretty red velvet but had a big tear on one side and dried wax all over. The bathroom was gorgeous, obviously redone recently but the sink had a wooden base with a chunk missing from it that could easily have been fixed or at least painted over. The shower was extremely difficult to work and although the girl at the front desk was nice when we called about it she had no idea how to work it either. The bed was the major thing, I'm still sore from sleeping in it because it has an egg crate cushioning that is hand made and is in little bits, sliding all around under the sheet and making everything uneven, especially at the head. The details were all lacking, and we will most likely not stay here again. Also, be aware that the trolley out front is still not working.", "Date": "October 31, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“Completely in love with the Avenue Garden Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR5479981", "Content": "I absolutely love the Avenue Garden Hotel. It is an extremely lovely and quaint hotel with excellent service and beautiful rooms. Its location is perfect for those who want to travel to both the French Quarter and to Uptown New Orleans. It is also ideal for those visiting New Orleans during Mardi Gras, as it is situated directly on the parade route. I have thoroughly enjoyed all of my stays at this hotel. I give it two enthusiastic thumbs up!!", "Date": "July 18, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Best Hotel in New Orleans”", "Author": "A TripAdvisor Member", "ReviewID": "UR5372597", "Content": "This is one of the nicest hotels that i have stayed in. It is idealy located on St. Charles and the staff is great. The room was very nice, clean, and spacious. I will definatly be back. i have been visting New Orleans for years both business and pleasure and have stayed in many hotels this on shines above the rest", "Date": "June 21, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“Charming home away from home”", "Author": "A TripAdvisor Member", "ReviewID": "UR5366920", "Content": "I recently had the pleasure of staying for the second time at the Avenue Garden Hotel. This inn is located in a series of renovated 19th century townhouses on the St. Charles streetcar line (currently serviced by buses). It is centrally located with easy access to the French Quarter, Arts District, Central Business District, shopping on Magazine Street, Uptown, Garden District, River Bend and the Universities. It would be a perfect place to stay for families dropping off or visiting their Tulane, Loyola, or UNO students. I was in fact visiting my son, a student at UNO. My first visit I stayed in an adorable little room in the rear, very bright and quiet with french doors. This stay I had a beautiful large room in front with a balcony over the street, king size bed with luxurious bedcoverings, and a recently remodeled marble bathroom with shower. The exterior was being painted while I was there and new carpet installed in the stairwell. The young staff is gracious and helped arrange reservations for dinners. There also is excellent pizza and BBQ on the block if you don't feel like venturing far. Although the hotel has not served continental breakfast since Katrina there is a wonderful neighborhood cafe, the Please U, a block and a half away where you can step back in time and enjoy a bottomless cup of coffee, an oyster omelet and grits. This hotel manifests this traveler's dream--good value and location, friendly staff and an authentic sense of place.", "Date": "June 20, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Rooms": "2", "Service": "3"}, "AuthorLocation": "Unknown", "Title": "“Was VERY Unimpressed”", "Author": "A TripAdvisor Member", "ReviewID": "UR5236891", "Content": "We spent three nights at the hotel, and ran into several problems. First, the hotel apparently is getting overbooked by Orbitz. Our double room was converted to two singles (which doesn't work well with a 3 year old), and then we ended up with a single with a rollaway. To date (admittedly, only a few business days since), we have not seen a refund for the room discrepancy. Also, although parking is mentioned as available, it is provided at an extra cost of $10 a day. And that gets you a garage door opener to their storage facility, which houses five cars at best, and requires you to Back out onto a major thoroughfare to leave. Additionally, they oversell the parking, to the point that our last night we were unable to make use of it. They were at least gracious enough to refund the cost of the parking for all nights. Continental breakfast does not exist at this point, post Katrina. Entry to the hotel is through a single front door. Our room was down a hall, outside, then up a stairwell outside. The entrance was a block and a half away from the 'available' parking. Construction work started around 8:30 each day we were there (including a weekend), with the accompanying noises, some of which managed to be just outside our room. Also, our room had a broken water pipe for the shower stall, to the point we could see water leaking through the wall in two places above the shower head. The resultant smell of mold (and possibly a dead animal in the walls) made the bathroom a chore to use. Checkout was 11:30, but the cleaning crew made their first round at 10:30 AM, almost walking in on us when we didn't get to the door fast enough in response to their knocking. There was no 'Do Not Disturb' placard for use.. On checkout, our requests for proof of the room change and requests to see an itemized list of chages were rebuffed.They said they would contact Orbitz about the refund, but they gave us no way to check them on it. Also, their website does not seem to have been updated since Katrina, and is incorrect on at least the continental breakfast. Overall, we were very unimpressed with our time in the hotel. Perhaps we judge it too harshly, but it was not a pleasant stay. The parking fee, the room shuffling (and the questionable refund), the construction noises, the lack of continental breakfast as per their website, the overzealous cleaning crew and the bathroom were just too many problems for the hotel's meager benefit of location.", "Date": "May 30, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "UK & New Orleans", "Title": "“Stayed here twice, and both times were nice!”", "Author": "devisuz", "ReviewID": "UR5034357", "Content": "I've stayed at this hotel two summers in a row for at least 3 nights each time. I have visted New Orleans for two summers, and each time I spent the first few nights of my stay at this hotel. I think it is a charming little place, and very pleasant. You definitely get a taste of New Orleans from this place, and the hotel feels quite homely, which is the reason why I like it most. Our rooms were very spacious, I've probably stayed at four different rooms at the hotel and all of them were spacious, well maintained and very pleasant. It is very nice to take a walk in that area, and it is in a good location (although I always used a car) the street car passes right out front. I'm not sure what is like recently after hearing a few bad reviews since the last time I stayed there, however both times I stayed there, I recall that housekeeping was every day. If I am able to, I plan to stay at this hotel again this summer as I think it is a great find, and reminds me a lot of New Orleans, I have nothing but nice memories of this place.", "Date": "May 4, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“We enjoyed our stay”", "Author": "Ms325i", "ReviewID": "UR4999196", "Content": "Just returned from a 3-day stay at the Avenue Garden Hotel. It was my first and my boyfriendâ€™s second visit to Nola. We found the hotel on Expedia and booked, not realizing that it would have been actually cheaper to book directly on the hotelâ€™s website. The hotel was easy to find, right on St. Charles in the Garden District. Our review of our stay is as follows: Rooms: -Room was large with King sized bed, nicely decorated, very charming with high ceilings. --Bathroom appears to be newly renovated and has a shower stall (no tub). -Shower in our room had poor water pressure and a faulty shower head, instead of a stream of water you got mist. -The hotel apparently has wireless access in all guest rooms, however service was non-existent during our stay. They do have a computer set up in the lounge area that guests are welcome to use. -Our room had a balcony that faced St. Charles St. We used it throughout our stay to people watch and enjoy the weather. -There is no daily room service. -Rooms do not have phones, alarm clocks or wastebaskets. Restaurants Hits: -Slice pizza next door which smelled delicious and Voodoo BBQ a few doors away, I highly recommend Voodoo, the chicken and brisket were excellent. -The Oceana Grill in the French Quarter is great for fresh fish/seafood and the hurricanes are highly addictive. Misses: -CafÃ© du Monde-beignets are inconsistent. First day we ordered them they were hot, fresh and airy, the second day we ordered them they were cold, spongy and heavy. There is another cafÃ©, CafÃ© Beignet across the street but it was closed for the duration of our stay. - 24 hour St. Charles tavern/restaurant a few blocks down from the hotel, stay far, far away from this place. My boyfriend ate a sandwich there on our last night and became violently ill with food poisoning. We wrote a letter to the health department regarding this incident. We had a car and used it during the day. Streetcars are still not running so we walked to the French Quarter in the evenings and took a cab back to the hotel. There are busses that run along St. Charles, but the service is not very frequent. Because we had a car we were able to venture out of the tourist districts and visit the various districts that were hit by the hurricane. It was encouraging to see the effort being made by residents to help each other get their lives and properties back together. Please feel free to contact me if you have any questions regarding our stay.", "Date": "April 24, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“I loved It!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4976579", "Content": "We stayed at the Avenue Garden Hotel for a week in april. It is a real tast of New Orleans. Great staff,and we loved the location. There must be 10 restaurants with in a couple of blocks of the hotel. We are planning to go back to the city in August and will stay at the Avenue garden Hotel. If you want to get a real taste of New Orleans this is the place for you.", "Date": "April 16, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“More than I expected”", "Author": "A TripAdvisor Member", "ReviewID": "UR4422584", "Content": "I found this hotel online and reviewed some of the comments and found them to be excellent. I thought there were a few exaggerations because of the price. To my suprise....everything said about this place was true. It was absolutely awesome. New Orleans charm in every corner. Staff was superb. A breath of fresh air away from the regular \"hotel scene\". Small place which allowed for reading in the courtyard. I went alone for a business trip, but would definetly like to bring a loved one for a romantic stay.", "Date": "February 6, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Feels like Home”", "Author": "Banana4", "ReviewID": "UR4156267", "Content": "I stayed at the Avenue Garden Hotel for three weeks in October. I work for a major news organization and this is where they chose for us to stay. When I was staying at the Avenue Garden it did not feel like the traditional hotel that I am used to staying . This hotel had a real since of home. I would highly recommend this hotel to anyone trying to get a real since of New Orleans. The staff were friendly, and the housekeepers were excellent and very pleasent.I know I will come back to New Orleans again for pleasure one day, and I would not stay anywhere else but this hotel.", "Date": "December 1, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Awesome Hotel and amazing Bang for your buck.”", "Author": "A TripAdvisor Member", "ReviewID": "UR3796749", "Content": "We stayed for a business trip mixed in with a little bit of pleasure. This hotel is the perfect mix between New Orleans charm and modern conveniences. There's free wireless access in the rooms and if you don't have your computer, there's also 2 computers in a little reading room with free internet access. So it's totally convenient and such a pleasant place to stay. Better yet is the location, right on the streetcar line and in the middle of the Garden District. Definitely the best deal in town. Service was friendly and we always had exactly what we needed. I recommend this hotel to anyone wanting to experience New Orleans. We'll definitely stay here again!", "Date": "August 22, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "East Texas, Pennsylvania", "Title": "“Got dibbs on the Balcony Room!!!!!!”", "Author": "prefer_boxers2brats", "ReviewID": "UR3738566", "Content": "This was our 2nd stay at Avenue Garden. The 1st time we were here, we had two rooms on the first floor near the checkin desk, which were very quiet even though they were on the main hall. This time, we had 3 rooms as we were celebrating my son's 21st birthday & we'd brought friends along. We were just as pleased this time! This hotel is actually two townhouses nestled between a restuarant on either side. If you really want to feel the flavor of New Orleans, this place is perfect. It is very cozy & romantic & we felt very safe no matter what hour we were sitting outside.If you want a VIEW, request one of the balcony rooms in front where you can spend hours watching people go by as we did. (One of them has a round bed in it!) We had the right townhouse upstairs balcony room and our friends had the other room behind ours. Both were enclosed in a tiny hall that made us feel like we had our own wing! There were other rooms that were accessable by the outside porch and we loved the little patio area. We also had #45 downstairs which faced the street and the young people loved it. It was big enough to handle 3 21yrs olds and all their stuff and beautifully decorated. The staff was very helpful and courteous, especially since we arrived between the departure of one tropical storm and the anticipated arrival of the next one. Our beds were quite comfy and we had no noise from the street. Besides the restuarants nearby, there is also a day spa a couple of doors down. We actually own a timeshare at another St. Charles Hotel but we much prefer this hotel over that one ! (we plan to sell the timeshare!) You can book directly with the hotel & get great rates. The management has done a great job with renovations & customer satisfaction. We had one concern (not worth mentioning..)and the staff took immediate steps to correct it for us. We had a great stay in NO and we definately feel that Avenue Garden was an important reason we did...we will definately be back!", "Date": "August 5, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "3.0", "Value": "5", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Unknown", "Title": "“Good way to experience N'awlins, but needs some help”", "Author": "A TripAdvisor Member", "ReviewID": "UR3675121", "Content": "This was the first trip to New Orleans for my husband and I. We wanted to experience the historical value and culture of the city first-hand, so we opted not for one of the larger, newer hotels downtown - like the Wyndham. We chose the Avenue Garden because it looked quaint online, the price was beyond right, free parking was being offered at the time, and, above all, there were no recent bad reviews. We really value other travelers' comments and, because of that, I hope this review helps others. As other reviewers have said, this hotel has loads of potential and good features - good location, nice artwork on the walls, tall ceilings, secure parking, etc. Larger, structural refurbishments would make this place fabulous. However, there are several low-cost things that NEED to be remedied now: spots on towels, spots on blanket, spots on lamp shade, hole in sheet, not changing sheets daily, permanent rather than replaced-daily bathmat, old and lumpy pillows, etc. These things make ALL the difference between \"great\" and \"wish we would've stayed elsewhere.\" I wish I would have taken pictures of our room because we were clearly not in one of the recently remodeled rooms; other rooms on this site were much nicer than the one we stayed in. I don't consider myself a \"picky\" traveler because we don't spend a lot of time in the room when we travel - but the bathroom we had actually made it DIFFICULT to get ready efficiently and get out on your way. It was super tiny (which is something that can't be fixed without lots of $$) BUT, there was no place on the sink for toiletries, a mini garbage can that we quickly overflowed, no place for anything in the shower - I found myself holding my razor in my teeth while I lathered up to shave my legs. Overall: was by no means bad, was much more than worth what we paid, but, sadly, due to the little things, would probably pick another place next time.", "Date": "July 17, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "2", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“stayed during Essencefest”", "Author": "A TripAdvisor Member", "ReviewID": "UR3666155", "Content": "My husband and I stayed at the Avenue Garden Hotel during the Essence Music festival. It was one of the only hotels that didn't quadruaple the price during the festival weekend. The highest night was only $149.00 We loved the location and the room was really nice and clean the bath room was beautiful. Most of all there wasn't a foul smell that you sometimes get from hotels in this price range. The Street car stopped directly in front of the hotel. I don't think we could have done any better for the price we paid. There was also breakfast treats in the morining, like coffee, boiled eggs, juice and muffins. I really only had one complaint ... one night after the room was alreadty cleaned for the day my husband and I went out to the concerts around 7:00 pm, when we returned to the room.... someone had come in and taken all the towels... which was really strange. We called the front desk and they said we could come down to the desk and get more, but we still found this creepy.", "Date": "July 14, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Really Nice Place!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3588154", "Content": "My husband and I stayed at the Garden Avenue Hotel for our 41st wedding anniversary. We had a huge room overlooking St. Charles Street. It was very clean, very nicely furnished and convenient to everything. The streetcar stopped right outside the front door. The staff was very friendly and helpful. The breakfast was quite nice with English Muffins, Blueberry muffins, Bagels, milk, cereal, coffee, etc. We ate dinner next door at the Voodoo BBQ. The meat melted in your mouth, and was great. We were very pleased with our stay, and would definitely stay there again.", "Date": "June 20, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“Great Place to Stay and Close to Everything!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3576596", "Content": "My husband and I wanted to find a place that was affordable and close to most of the sites such as the riverwalk ,Bourbon Street, ferry boat , zoo, tours, and restaurants. It was perfect. We walked out the hotel door and hopped on the street car and went everywhere! You buy a pass(5.00) for the day and you can ride all day. The Voo Doo BBQ is right next door and I must say it was some of the best BBQ around . The hotel does serve a small breakfast in the mornings and it was nice sitting out on the patio. The hotel is like staying in a Bed and Breakfast. Our room was small, but if you are not planning on living in your room the entire time it is just fine. The room is clean and very comfortable.The staff were all very nice. Lydia who worked at the desk is very helpful and friendly. I would recommend the Avenue Garden Hotel to anyone.", "Date": "June 20, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Unknown", "Title": "“great place, amazing deal”", "Author": "A TripAdvisor Member", "ReviewID": "UR3548758", "Content": "as two recent college grads, my friend and i were looking for a safe, affodable place to stay in new orleans. the avenue garden was just that. it has a cozy bed and breakfast feel, free breakfast, free internet, friendly staff, a/c, patio, and is very accessible to the french quarter, magazine street and uptown. And for two people for three nights we payed just $115. i couldn't ask for more :>", "Date": "June 13, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“A great find with great value”", "Author": "A TripAdvisor Member", "ReviewID": "UR3450355", "Content": "We stayed at the Avenue Garden Hotel from 4/15 to 4/19 and were very happy with the establishment. The hotel could use a bit of work as far as maintenance goes but it's obvious that the owners are trying hard to get it in top shape and keep it up. The privately owned hotel feels like a modified bed and breakfast. The staff was sincere and very accommodating but may not be as knowledgeable as the professionally trained staff from a hotel chain. We didn't get quite the information we were hoping for as far as tours and general information. However, they were courteous and helpful as we needed to store some food items for our 2-year-old in their fridge. The first night, we were given room #45 which was a BIG, very beautiful, stand-alone room with private entry, giant ceiling, beautiful bathroom and architecture. The only problem for us was that it faced the street and was very, very noisy - so we asked for a room change and were re-assigned to room #30. This was a smaller but quiet, private and cozy room on the third floor (it was the only room on that floor). People who may have concerns about climbing a lot of stairs should request not to be put in this room as there are many stairs and no elevator. The room was clean and nice and we had maid service daily, including the carpet being vacuumed (which we really appreciated since our little boy had left several trails of cracker and cereal bar crumbs). The hotel was located right on the St. Charles streetcar line. There were plenty of restaurants within a few blocks of the hotel: Slice Pizzeria (check out their calzones) and Voodoo BBQ (not that impressive). The St. Charles Tavern (food was ok, a good place to mingle with the locals) is approximately 20 feet away, a Cajun/Mexican restaurant across the street, a 5-star Emeril restaurant, and fast food restaurants like KFC, Wendy's and Burger King are just around the corner. There is also a Walgreen's and an ice-cream shop 2-3 blocks away and the D-Day museum is within 15 minutes walking distance. You don't need a car when you stay at this hotel. Some previous reviewers stated that the streetcars are always full - you can avoid that by leaving earlier (8:30am - 9:30am). We never had to wait for more than 15 minutes even on the weekend. Safety - the main street seemed pretty safe. There were joggers running in the area all the time. Breakfast - The hotel's breakfast was typical: bagels, English muffins, cereal (two kinds), milk, coffee and orange juice. Nothing fancy but will save you some breakfast $$ if you're on a budget. I was hoping to try out the banana bread some of the previous reviewers were talking about but it was not available during our stay. Price - Incredible value. One piece of advice - shop for the cheapest rate on the web and then call the hotel directly and ask for that rate. That way, you will guarantee yourself the lowest rate and avoid paying the service fees the travel websites charge. Summary - Avenue Garden hotel is not the Hyatt (and you are not paying the Hyatt's rate, either). Unless you're honeymooners, what you need is a comfortable and cozy place where you can have a good night of sleep after a busy sightseeing day, and this place fits the bill. We will stay there on our next visit.", "Date": "May 9, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Unknown", "Title": "“Nice cheap hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3311614", "Content": "I spent a pleasant long weekend at the Avenue Garden(s?) hotel in New Orleans in late March 2005. The staff were informally pleasant and courteous not fawning, like I have encountered elsewhere in the USA. The breakfast was basic (bagel, muffins, cream cheese, jam, coffee, juice) but suitable. The location is ok, being close to the Garden District and not far from the French Quarter by tram (I might have walked into town in the mornings if I had spent long enough to get my bearings, but I took the tram instead). There was a small amount of mould in the bathroom, but nothing terrible. There was free internet/web e-mail access. I was very pleased with what I got for my money and although I rarely visit the same town twice for pleasure (the world is so big and life is so short!) I would consider staying there again if I was staying in New Orleans again. But if I had a bigger budget I might also stay in a quiet part of the French quarter instead. Basically you get what you pay for and this was the very most I would expect to get for my money. If you book into this place, don't expect the hotel to be the highlight of your stay in New Orleans - it's not a designer hotel experience by any means, just a clean, comfortable pleasant place to stay in while you are touring the swamps/French Quarter/Garden district (the latter is very close by). Having said that, I felt like it was a very suitable place to stay in New Orleans, very good to get a feel for the character of a non-touristy bit of town, rather than some boring generic higher class hotel in the centre of a town. Out of everywhere in the world I have been, the hotel reminded me of cheap, informal, pleasant, quiet hotels in Northern Europe - like Holland. All in all the Avenue Garden(s?) hotel gave me a more positive and fond feeling for America and Americans than I had before I visited the country.", "Date": "March 30, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Loved it!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3294674", "Content": "This hotel was perfect. We couldn't have asked for more especially for the price. The room had a modern decor, and the service was excellent. There is a street car stop in front of the hotel, but it seemed to be crowded most of the time. If you are planning on staying out late on Bourbon St. you may have to wait a while for the street car. I believe someone told us it runs every 30-45min. after midnight. All in all this place was worth it, and I would love to stay there again.", "Date": "March 22, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Unknown", "Title": "“not the worst, but not the greatest”", "Author": "A TripAdvisor Member", "ReviewID": "UR3286029", "Content": "Ok, well first of all the only nice people in this hotel is the cleaning staff. The front desk people weren't friendly at all. Well, they were friendly when we were paying our bill. They do have a parking garage, but it looks like something that would be in a horror movie! Do not walk through there by yourself, day or night. They do have a free breakfast. I totally suggest the banana bread. It's really good. Sadly, I only had it for 2 mornings because they stopped serving it. The hotel itself is in the perfect location. The trolley line is right in front of it. There are tons of restaurants around it. I suggest the restaurant right beside it, Slice. That's about it, our room was clean, we never ran out of towels, and we had an awesome time in New Orleans! If you're going, have fun and take the Haunted History Tour with Midge!", "Date": "March 18, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Unknown", "Title": "“Needy People Need Not Apply”", "Author": "A TripAdvisor Member", "ReviewID": "UR3273398", "Content": "I was on vacation recently and stayed in The Avenue Garden Hotel. The hotel was cute, but did have major problems: including paint coming off of the walls outside and inside. THE LOCATION IS IT'S BEST ASSET. It's between two great places to eat...VooDoo Bar-B-Que and Slice Pizzaria...It's also right on the street car line and near some beautiful homes. The staff left quite a bit to be desired. If you are someone who doesn't need help finding your way around New Orleans than this place should be fine. Don't ask them any questions! The hotel cleaning staff was great and were the friendliest people I met in New Orleans! The parking garage was around the corner and wasn't that bad. I wouldn't recommend walking down the side street alone at night...but during the day there was nothing to fear. I would recommend using the garage, even though it is super expensive...the neighborhood behind the hotel was a little shady and I wouldn't want my car out there. Let's see...Oh, be careful and make sure that they don't over charge you. I am still waiting on them to refund some of my money! Over all, it wasn't horrible. Again, the location is supreme, but the service wasn't great and it's not the prettiest place in the world.", "Date": "March 14, 2005"}, {"Ratings": {"Overall": "1.0", "Rooms": "2"}, "AuthorLocation": "Gangelt, Germany", "Title": "“Beware”", "Author": "Cherie4000", "ReviewID": "UR3267245", "Content": "Ours and three other cars where broken into, the windows smashed in and they stole everything. We were all parked on a neighborhood street next to an exclusive mens health club. Beware of the surroundings, it is not safe. Two weeks before us the same thing happened. Also the hotel was not clean, they overcharged us, and the breakfast was not something to write home about. The paint was chipping off the sides of the building, our balcony had food, and beer cans, and the doors where not secure.", "Date": "March 11, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "los angeles", "Title": "“dirty, never again”", "Author": "avabava", "ReviewID": "UR3183582", "Content": "We were very disapointed with this hotel. After much research and trying to stay budget without sacrificing standards (basically looking for a deal) I settled on Avenue Garden. At the time I don't think there was one bad review the pictures looked great ect. I know it always looks better in pictures but I was really counting on the reviews to tell all. My biggest complaint was the room was filthy. Mold in the corner of the bath, filth around edges of bathroom floor, I don't think it was vacuumed once while we were there. This is a hotel there is no excuse for filth. My husband did not want me to complain (afraid of making the staff mad), so I did not but I should not have had to. It has so much potential it is sad. The fact that the hotel was worn did not bother us. The hotel would be amazing if it was refurbished. We had a great room #20 I think, upstairs, balcony outside but it was the dirtiest room I have ever stayed in. I hear they have different standards in N.O. this was our first and last time to N.O. Loved the carriage ride, swap and plantation tour, that saved our vacation. I guess if you don't mind complaining or cleaning the room yourself then it's not a bad place.", "Date": "February 13, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“Great for a Wedding”", "Author": "A TripAdvisor Member", "ReviewID": "UR3106861", "Content": "We had all of our wedding guests stay in the Avenue Garden Hotel. Everyone loved it! The hotel is small and quaint and totally New Orleans. I also found out it's family owned and operated which makes it even better. We picked this place because it was on the streetcar line and in walking distance to tons of restaurants. Our friends were able to take the streetcar into the French Quarter so no one had to worry about renting a car. The hotel manager gave us excellent prices for the wedding party guests and really helped us organize everyone's stay. There were even fresh bouquets of flowers all over the hotel for our wedding. The cute patio was our friends' place to hang out and chat after all of the wedding events. Everyone loved the convenience of the complimentary continental breakfast. I'd recommend this hotel to anyone who is having a wedding in New Orleans and wants a fantastic place for your guests.", "Date": "February 2, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "boulder", "Title": "“Elegant, and Charming...”", "Author": "m.s.1976", "ReviewID": "UR3091111", "Content": "We booked our trip to New Orleans and we stayed at the avenue Garden Hotel. i found that the travel package that we ordered gave us a room there with one double bed. I asked the Hotel if I could upgrade to a king bed room and they let me for only an extra $10 a day. I also told them that I wanted a room with a balcony. When we arrived I was amazed at how well they took care of the place, lots of southern art on the walls, very charming. The first room they put us in was nice, but there was no balcony, and the window had a view of a wall, I said I thought we were getting a room with a balcony. She said if we waited a few minutes that they would put us in one of their newly renovated rooms, so we had lunch at the voodoo bbq, which by the way is excellent, and when we came back they showed us to our room. We were the first people to ever stay in this room, since the renovation, and it was beautiful, with a private balcony and wicker furnature. The bed was huge with a satin comforter and pillows. The bathroom was all marble, this room was so charming that I felt right at home. Their continental breakfast was great with hard boiled eggs, and orange juice milk bagels english muffins and coffee or tea. The street car is a pain I wouldnt reccomend taking it its always very crowded and its hard to find the right stop if you dont know your way around. The restuarants I would reccomend is Emerils Delmonico, its about 3 block away, Le Madeline was also really good and within walking distance, and this Italian restuarant called Bravo is right up the street as well in walking distance, voodoo bbq is good too and reasonably priced. St. Carles tavern is across the street and its alright but the good thing about that place is that its open all night. I would reccomend going to the river walk and seeing the aquarium, and take a boat ride. Be careful if you go to Bourbon street past 10pm there are alot of pick pockets, this guy had come up to us and put mardi gras beads around our neck and then asked for a donation, he said he was starving and I felt sorry for him so I pulled out my money I only had 8 bucks I was going to give him 3 and he grabbed all the money out of my hand aggressively and ran. I am glad I was not carrying alot of money, if someone tries this with you dont let them put beads on you and tell them you are not interested unless you want to get mugged and keep your purse very close to your body and hold onto it tightly. I had a wonderful time in New Orleans and the Avenue Garden Hotel is a great place with kind southern hospitality. I am quite sure you will be pleased with it. Thank you.", "Date": "January 27, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "North Carolina", "Title": "“Worth $53, but watch your credit card bill!”", "Author": "brainman73", "ReviewID": "UR2985758", "Content": "I was prepared to give the hotel a 4 (of 5) rating, except for one snafu, which I will describe later, that dropped my rating to a 3. The hotel certainly not a \"4-star hotel\" by the standard definition, but it deserves 4 stars based on the price-to-quality ratio. My wife and I, who are both \"poor\" students, stayed there 3 nights, right before Christmas, and paid $53/night. The hotel was acceptable; the hotel itself was definitely a good value for the price and location, especially considering most other hotels in the ZIP code were nearly twice as expensive. It's not in the heart of the French Quarter, but that section is loud and crowded anyway, so I liked being a mile away from the \"action.\" The St. Charles trolley stops 20 ft. from the hotel door and will take you right to Burbon Street/French Quarter within 10 minutes, so, if you want to save $30-$50 by not staying in the F.Q., this hotel is a good bet. The best deal for transportation is to buy a 3-day trolley/bus pass, which is available for $12 at Williams Grocery about 8 blocks up St. Charles. (It's easy to miss the sign, unless you're walking on the opposite side of the street.) If you fly in, don't rent a car unless you must. Parking is scarce and expensive, and the streets are narrow and confusing. We took the E-2 bus, which runs from the airport's upper deck right into the heart of the N.O. business district (downtown). It is about a 10-15 block walk to the hotel from the final stop of the bus to the hotel. It's around a 15 minute walk, quite an exercise when you're towing luggage, but it is not too bad compared to the $26-$28 that you would spend on a cab or a shuttle for two. The hotel is fairly clean, though older. It is like a mediocre bed and breakfast. There were places that could have used a touch of paint, and there was a little rust on the metal fixtures. You must be rung into the building by someone at the front desk, and there is no one manning the desk in the middle of the night (11 pm to 7 am, I believe), so they give you a key to get into the hotel along with your room key. All in all, though, it was not that bad. Unless you're used to staying in the Ritz-Carlton, this is a fine choice for those on a budget. Besides, when you're a tourist to N.O., you don't really spend much time in the hotel anyway. Each morning, there is a continental breakfast. It's decent--bagles, English muffins, cereal with milk, orange juice; one morning there was also cinnamon bread and hard-boiled eggs. There is almost always free Twinnings tea and mediocre coffee (though sometimes they ran out of tea bags; you can ask for more, though). Next to the small eating area (gets crowded in the morning), there is a small outdoor patio where you can eat if the weather permits. There is also a sitting room/computer room. Internet use is free, but there is sometimes a line of 2-3 people waiting to use the one computer during popular hours. The decoration of this room is a bit tacky and outdated (ugly green cover on the couch, old unread books on bookshelves, antiquated computer manuals with the books, etc.). The room was acceptable, TV had dozens of cable channels, bathroom was fairly clean, and maid was competent. There was no \"Do Not Disturb\" doorhanger, so I guess you have no choice about maid service. The bed was large and comfortable, and the room, as promised, included ironing board, table, chairs, and extra pillow. There was an ice bucket, but it did not come with a liner bag, and I never saw an ice machine anyway, so we didn't use the bucket. The staff seemed nice, but I didn't get the extreme friendliness that other people have reported. We arrived a few hours early, and William let us check in early after a 15-min wait to get the room ready, so that was nice. He wasn't especially friendly, but was not rude either; he was just \"there.\" The other staff members were just \"there\" for us too. I have no specific complaints or praises for them. The one main complaint I have happened one week after we checked out. We prepaid for the room, so we did not have to pay when we checked in or out. However, since we had paid in advance, when we checked in, we were charged a provisional $60 to offset any expenses we might incur while there. This was fine with me; many hotels do this, and I knew we would have no other expenses of importance on the room. We were supposed to have this provisional charge refunded when we left if there were no other charges. While we were there, the only additional expenses we had were 2 local phone calls (35 cents each)--that's it. Well, a week after we checked out, I viewed my credit card statment and found that we had been charged $43 extra!! (not 70 cents!) I immediately called the hotel and asked for the reason for this charge. The woman who answered appeared to be new. She looked at my account in the computer and could not find any record of this extra charge. She said (this is a direct quote), \"We didn't make no charges on your card.\" I told her I was looking right at my credit card statement with the extra $43 charge, so someone obviously did. She could not explain it, so I asked that William to call me the next day, since he was the one who checked me in. I thought maybe he could explain the extra charge. I didn't receive a phone call, but I did contact my credit card company to challenge the bogus charge, and they took it off. I'm still not sure why this charge was made, so I recommend anyone staying at this hotel to double-check your credit card statement to make sure your card is properly charged. If it hadn't been for this frustrating surprise, I would have granted the hotel a 4 rating. I would probably stay here again if I return to N.O., but I'll be sure to watch the charges to my card.", "Date": "January 6, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“The Charm of New Orleans”", "Author": "A TripAdvisor Member", "ReviewID": "UR2971263", "Content": "My husband and I stayed here during our anniversery for a nice little gettaway. We were on a budget so we were not looking to spend much money. Luckily, I found this hotel and was not expecting such an awsome little place for only $69 a night. It deffinitley gave off the unique charm of New Orleans and had that Southern Hopitality atmosphere throughout. The frontdesk workers were so helpful and friendly, which is one of the main reasons why I know we will be staying here again next visit to New Orleans. The location is perfect because it is right smack dab in the middle of the garden distriict and the French Quarter, which allowed us to veiw other areas of New Orleans besides Bourbon Street. We stayed in a beautifully decorated room facing St. Charles Avenue, which is their honeymoon suite. They upgraded our room to this suite when they realized it was our anniversery. The suite had a red velvet circular bed and a mirror on the ceiling... very romantic, and is located on the second floor of this to die for pizzaria. We loved the Avenue Garden Hotel and make sure you ask about those suites ... i know we will next time around.", "Date": "January 2, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "3", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Cherry Hill, NJ", "Title": "“Not worth $55 a night”", "Author": "italianchick163", "ReviewID": "UR2944859", "Content": "First I will say we left the Avenue Garden Hotel due to just basically hating the place. We got to the hotel and the room I was told we were booked in was \"under construction\" and we couldn't stay in it. I was told we would be in a revamped room when we booked with a new bathroom. They moved us to another room and it did look clean, but looked like it wasn't remodeled in about 30 years. The baseboard in the bathroom was splintering off and mold was around the base of the tub. The room had a view of a brick wall and had really no character. Let's say the holiday inn or best western is way above. We would have been paying $55.00 a night and that room was NOT worth $55.00 a night. So we thought we could deal with it, tried to be in good spirits, and went out for lunch. About 6 hours later we get back and open the door to find our luggage is missing and a note says our bags are moved and to go to the front desk. We were told our room had termites and they moved us to room 12. This room was right next to the front desk and was totally loud and noisy. We found a bag of half eaten chips in the room, the toilet seat was dirty and again the atmosphere was just depressing. Needed major work on the bathroom especially. We decided we needed to leave. I was not going to let the room ruin our trip. The front desk person was VERY nice and understanding and didn't give us any problem. He worked with us and gave us our money back, I think he knew we felt cheated. As we were waiting for him, we saw a hotel staff member bringing wine to the remodeled room we were supposed to have in the beginning, so they obviously lied to us about the under construction excuse and had given away the room to someone else. It just seems like this place has potential, but needs work. They should have remodeled the whole place before they opened it. They had the water turned off for about 6 hours that day on the one half of the hotel and I know people were at the front desk complaining about not being able to shower or shave. The hotel's solution was to let them into an unoccupied room in the other side of the hotel to use the bathroom, they were trying to be helpful. I also think the location is not great. It's in a kind of ugly section of town inbetween the garden district and the Business District. For first-time traveleres to New Orleans, this place is not a good option because you won't get the true New Orleans expereince unless you stay in the or close to the Quarter. If you are a college kid who does not CARE at all about the room and you are planning on just somewhere to crash, this place is OK. But if you are a couple looking for a romantic place, a business traveler or family, this place is not for you. It has a small amount of potential to be a nicer place, they just need to get organized and work out the kinks.", "Date": "December 26, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“Excellent”", "Author": "A TripAdvisor Member", "ReviewID": "UR2883469", "Content": "I stayed at the Avenue Garden Hotel in late October. First of all, the city is so much fun during Halloween. I think everyone should go there one year. If you do go, you should stay at the Avenue Garden Hotel, they have the best customer service I have seen in a long time. Everyone from the front desk staff, housekeeping to even the owner are helpful with whatever I may have asked. The hotel has a great New Orleans charm to it, they have a FREE breakfast in the morning, the streetcar is directly outside the front door of the hotel making it so easy to get back and forth to the hotel from the French Quater. There is so much to do in this area of the city even though it is not in the main area, the French Quater. It is in this area the locals call the Garden District, it is an old area of New Orleans that the homes are like masions, they are amazing, it is for sure the most beautiful area in New Orleans that I saw. Bourbon Street was fun for a few nights, but if you want to be somewhere that you can walk out the door and have tons of restaurants and bars and still have the beautiful scenery of the streetcar and nice homes, Avenue Garden Hotel is the place to stay.", "Date": "December 15, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Unknown", "Title": "“Not too Bad”", "Author": "A TripAdvisor Member", "ReviewID": "UR2880022", "Content": "My girlfriend and I stayed at the Avenue Garden Hotel back in August 2004 and the room was nice for the price. The hotel use to be a house and there is a long hallway as soon as you enter the hotel. The front desk is really small and located about midway down the hall. The owners have made great use of the space and the decor is really nice but the view from your room leaves something to really be desired. All in all we enjoyed our stay and it is located right on the streetcar line and the 2 places that I would highly recommend for dining would be #1 Copeland's Cheesecake Bistro on St. Charles Ave and #2 Voodoo's Bar-B-Que also located on St. Charles Ave. I would definitely stay at this hotel again especially for the price.", "Date": "December 14, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Great value for money”", "Author": "chocksaway", "ReviewID": "UR2859135", "Content": "This place is perfect for the budget traveler. We stayed for four nights, booked through Orbitz.com for a rate of $55 per night. This is not a high-end hotel, more of a B&B feel to it. However the room was great, comfortable and bathroom was nice. View was non-existent but we didn't spend much time in the room. Breakfast is extremely basic so set your expecations appropriately there. The St Charles Ave streetcar could not be more convenient to get to the French Quarter and to the Garden District. The area is completely safe and in fact is quite full of restaurants and bars. I agree that Voodoo restaurant, right next door, is good value. We parked on the sidestreet without any problems. Out of all the hotel staff we encountered, we found Kristen to be extremely good. This place is perfect budget accomodation in a very convenient location. I would stay here again without question. If you are looking for something more glitzy, or a romantic weekend with a date etc, you might want to choose somewhere more upmarket.", "Date": "December 1, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Wilkes-Barre, PA", "Title": "“Below average at best”", "Author": "KeeperOfTheCastle", "ReviewID": "UR2798546", "Content": "I was very disappointed with this hotel. The room was very small and not cleaned very well at all. There was soap scum in the sink and mold in the shower. The comforter on the bed had spots on it and you could tell that it was not washed after the last occupant.The building is very old and is need of repair.The railing on the steps to the second floor was loose and ready to fall off.My room was off a porch on the second. I had to enter my room from the porch. The light on the porch did not work and I could barely see to get the key in the door. The wood floor on the porch was soft from water damage and rot. It was covered with a carpet but I could feel it sink down when I walked on it. I would not ever stay at this hotel again.", "Date": "October 31, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“Terrible Experience”", "Author": "A TripAdvisor Member", "ReviewID": "UR2760133", "Content": "We chose this hotel because of all the great reviews posted on this website. We arrived in late afternoon, and was told by the receptionist that our room had a plumbing problem and we could not check in. Very nicely, he handed us a broucher for another Bed and Breakfast and ensured us a reservation has been made for us, and that it was a great place. Being as \"innocent\" as we are, we took her words at face value, and found us arriving at a place where, lets say, an adult male do not feel comfortable walking around. The \"Bed and Breakfast\" itsself is a room rented out by a Swedish couple who do not speak English. We called Anenue Garden Inn right away and hoping there was a mistake, but was told that is the place. After much \"heated discussion\" with Anenue Garden, they finally admitted that they do not know this place, and only selected it because there is vacancy. They also admitted that there are actually other rooms available for us in thier very own hotel. However, at that time, we do not feel like being a customer of a place that treated their customer so badly in the first place. We ended up having to scramble looking for a place to stay and finally settled down at 8pm with another hotel. Our New Orleans experience is badly tinted...", "Date": "October 20, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Burlington, Canada", "Title": "“you get what you pay for”", "Author": "agac", "ReviewID": "UR2701749", "Content": "Spent 3 nights here with my spouse. It was our first visit to NO.We based our decision to stay here on the wonderful reviews about the hotel- BIG MISTAKE. The location is on the fringe of the garden district, if you expect to be surrounded by beautiful mansions, your in the wrong area. We were placed in the adjoining building. Our room was very tiny, no room for our luggage, walls were very thin we could here everything in the adjoining room. Bathroom is in need of major renovations, we saw mold and the shower curtain looked like it had spent some time in the bayou.Housekeeping was nothing to write home about.Staff omitted to provide us with towels or soap and left garbage bags in the room.If you want to stay in the Garden district there were nicer hotels a few blocks down the street.After our stay, my wife and I were wondering if we had stayed in the same hotel that everyone is raving about.", "Date": "October 13, 2004"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "knoxville tn", "Title": "“awesome little hotel- A+++++”", "Author": "lizzie241", "ReviewID": "UR2686901", "Content": "Great PlaceTo Stay- Garden District Is Great with many restaurants in walking distance... BRAVO, VOODOO BARBQ AND PONCHATRAIN CAFE-ASK FOR MICHAEL AWESOME WAITER. We ate at all 3 of them. TROLLEY STOPS RIGHT ACROSS THE STREET.. Our room number was 44 .WAS NEAT CLEAN FRESHLY PAINTED..comfy bed- Very quiet with a cute courtyard for breakfast--Try the homemade poppyseed coffee cake-.FELT VERY SECURE-Paid extra 18 dollars a day for garage, we had our own clicker and could go and come as we pleased. STAFF AWESOME-Kirsten was great and Alexis too.Housekeeping was really good too.Its family run-you can tell- homely feel.. They also had a computer to check email etc. NICE... WE WILL RETURN... YOULL LOVE IT..", "Date": "October 10, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Unknown", "Title": "“We'll be staying here again!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2605470", "Content": "My husband & I loved this place. The location was great (assuming you don't want to be in the Quarter). We just hopped on the streetcar and it dropped us off at Canal & Bourbon. The room was charming and clean. The front staff were friendly and helpful. AND our favorite thing about Avenue Garden Hotel ... VooDoo BBQ next door. Best meal we had in New Orleans!", "Date": "September 28, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“Great”", "Author": "A TripAdvisor Member", "ReviewID": "UR2571424", "Content": "L just want to say this is one off the best Hotel to stay at in new orleans. Everything was right there from places to eat to street car picking you right up at the door.And the people there are so great Thanks to Alexis for all her help while we were there she was the most plesant and happy all the time and had a answer to everything we need. Thanks girl i miss you already.Hope to see ya soon.m.j.", "Date": "September 14, 2004"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“The most beautiful hotel & concierge's in new orleans”", "Author": "A TripAdvisor Member", "ReviewID": "UR2521089", "Content": "Myself and a few buddies arrived in New Orleans after a long drive to escape the hurricanes in Florida. Once we checked into the Hotel we were greated by gorgeous smiles and the best service we have experienced in the whole of the USA. Thanks to first class service we soon started to relax and enjoy ourselves once again. Hopefully this review will encourage others to stay at such a wonderful hotel, and I'm sure you will have as good a time as us if you do. By the way the locattion was very good and the prices were very reasonable too. Special thankyou to all the staff especially Kristen and Alexis. Love Jerome Andy Stevie Mark Daylo", "Date": "September 9, 2004"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Wonderful”", "Author": "A TripAdvisor Member", "ReviewID": "UR2519901", "Content": "We had the Queen Suite, we loved it! The room was tastefully done. The desk clerks were so nice and so willing to help make sure the stay was going well. The trolley stop was right out the door. Our room was on the bottom floor in a another building.We were able to come come and go without even going in the hotel. The only thing about this room is you do have street noise. BUT we still loved it! I recommend this room to anyone who doesn't mind the noise from the street. The air conditioning worked great. Copelands which is about 3-4 blocks down has the BEST cheesecake ever!", "Date": "September 9, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Unknown", "Title": "“What a gem!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2450358", "Content": "What a gem! A friend came into town for a \"moms' weekend away,\" so we just wanted something inexpensive and clean. The hotel served our purpose -- a clean place to sleep and shower. Plus it was close to the street car, the restaurants, and the spa we were visiting. Our room was very quiet, although other rooms were closer to the stairs and we wondered if those guests suffered from all the guests walking past -- i don't know. The front desk clerk was very friendly and we felt safe and comfortable. The only challenge is parking. St. Charles has a lot of restrictions (meters) and the side streets get sketchy pretty fast.", "Date": "August 15, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“Great Value for the Price!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2325284", "Content": "The hotel is very central to the downtown area, french quarter and nearby restaurants as you can hop on the St. Charles streetcar (right accross the street) to get around. It's about a 5-10 minute ride into the downtown area..then you can walk to the french quarter or hop on another trolley with your pass to get to the french market, riverwalk, convention centre, casino, and other attractions. Our family of of four slepted very comfortably in a large room with two double beds. Each bed was in a separate area..each with it's own tv. The rooms were very clean, fresh towels every morning, good airconditioning and ceiling fans over each bed. The bathroom was very clean and included a hair dryer. Breakfeast was served from 7:30-9:30 every morning. This included coffee, juice, milk, cereal, bagels, english muffins and boiled eggs. There is a lovely patio area and sitting room with a computer that has internet access. I was able to check my email every day. The staff was very friendly and extremely helpful. A 3 day pass for the streetcar can be purchased at Winstons Grocery Store just down the street from the hotel. The pass will give you unlimited access to the trolley both on the St. Charles line and another downtown one for the three days. It runs every 5 minutes until 12am each night..this mode of transportation was very convenient and is very safe. We ate very well at the following restaurants..voodoo bbq, mothers, delmonicos (extremely pricely, but well worth it!), cafe du monde, and the cheesecake bistro. We went on the Steamboat Natchez Riverboat (not worth the price) and a tour of the Laura Plantation..good tour but would have liked to see a very traditional Southern Plantation..this was a Creole Plantation. Great jazz club to check out is Snug Harbor Bistro..nice atmosphere..amazing music and reasonably priced food and drink.", "Date": "July 27, 2004"}], "HotelInfo": {"Name": "Avenue Garden Hotel", "HotelURL": "/ShowUserReviews-g60864-d120848-Reviews-Avenue_Garden_Hotel-New_Orleans_Louisiana.html", "Price": "$95 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1509 St. Charles Ave.</span>, <span class=\"locality\"><span property=\"v:locality\">New Orleans</span>, <span property=\"v:region\">LA</span> <span property=\"v:postal-code\">70130</span></span> </span></span></address>", "HotelID": "120848", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/7d/33/7d330faf33b736e7d35d5c2371f657fd1large.jpg"}}