{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Baltimore", "Title": "“Pleasant surprise”", "Author": "BobP2923", "ReviewID": "UR122122630", "Content": "I stopped vacationing in Ocean City, Maryland years ago because it was just too expensive. Hotels there are the biggest ripoff in the state. It was with some trepidation that I decided to stay for 2 nights in September. Waiting til the last minute I was unable to find rooms anywhere for Sunfest weekend. I was ready to give up when I made 1 last phone call after midnight of the day I wanted to arrive and got an answer. The young lady on the phone was very pleasant and immediately asked me what kind of room I wanted, 2 Doubles or 1 Queen. (They actually had rooms!) When I asked about the price she told me $69.00 a night. What? No \"one hundred\" or \"two hundred\" in front of that? Other hotels in the area were raping their guests for triple digit rates. Must be a joke. I dialed the wrong number or something and someone was messing with me. But it was real. I ended up with a room with 2 double beds right up by the front office. Couldn't have been better. Pros: The room was clean and well maintained. I like to check out the trim work and patches on the walls and ceilings from previous rambunctious activity. Everything was perfect. We had a good T.V., table and 2 chairs and a dresser to keep clothes. I really don't remember using any heat or ac so I can't comment on that. The beach is only a block and a half away. Only 2 stories to deal with...no highrise here. \"Old school\" beach hotel. Despite being near a busy intersection it was very quiet. Cons: The room was a little on the small side but no big deal. The table and 2 chairs seemed a little crammed in due to the size but they were usable and I was glad to have them...I did use them. There was no desk in the room but it wouldn't fit anyway. Location is way up north near the Delaware line (is actually in Delaware) which some people might not like but I prefer to be far away from the noise. I like cruising up coastal highway and have plenty of time when I am on vacation anyway. They are not open all year. As a matter of fact they were getting ready to close for the winter the weekend I was there. (Although the pool was still open). If I ever decide to stay in Ocean City again this is the first and ONLY place I will consider.", "Date": "December 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Thomasville, North Carolina", "Title": "“A WONDERFUL MOTEL!!!!!!!!!!!!!”", "Author": "beachboy19", "ReviewID": "UR101722130", "Content": "The service was wonderful. All the housekeepers and ladies at the front dek were wonderful. You felt like you were a king or a queen you were treated so well by the staff. They helped you with all your needs. Really nice pool.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Middletown CT", "Title": "“The spot to stay in OC”", "Author": "D722", "ReviewID": "UR58051779", "Content": "My boyfriend and I stayed at this hotel in August 2009, Unsure of how it would look when we got down there we were both pleasntly surprised! The staff was super friendly, check-in and out went smoothly, and we were right on the boardwalk! Our room was on the 2nd floor, comfy bed, normal sized hotel bathroom VERY CLEAN. It was not only clean but a romantic hotel at that, and Kid friendly. Never used the pool but a good size and clean as well. The deck right outside our room has rocking chairs and is open till midnight, if your a people watcher like me its nice to sit out and check out the boarwalk, watch the people on the rides from the amusemnet park and the best part is the beach! Your right there, we went down almost every morning of our stay. Right when you enter from the guest entrance you can use the showers to clean off before you enter the hotel. This was a great stay for us, We are planning on going down again this summer and staying here!", "Date": "March 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Bel Air, MD", "Title": "“Pleasant surprise -- immaculate!!”", "Author": "Lynkath24", "ReviewID": "UR35778565", "Content": "I was skeptical because of the word \"budget\" in the web address. However, I was pleasantly surprised! The room was immaculate (which is MOST important), the king size bed was extremely comfortable. There was a nice sitting area surrounded by windows and even a little balcony. It was quiet in spite of the busy intersection just outside. While there were no frills, who needs it when you're just looking for a place to shower and put your head down at night while grabbing a few days on the beach (which is one block walking distance). The bathroom was small, and the towels were a little skimpy, but that did not take anything away from the enjoyment of our stay. I would definitely return to the Atlantic Coast Inn.", "Date": "July 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "PA", "Title": "“WOW! Great Place, Great Location, Super Staff!! Good Value!!”", "Author": "dartoot", "ReviewID": "UR33817794", "Content": "Stayed here June 24 through June 27, 2009. Room 236. Room with 2 double beds. Dorm size fridge and small micro. Served our needs very well. This was a last minute get-away for my husband and I. The motel grounds are very well kept. Clean, lawn groomed,very neat. The pool area is also very well kept. The room was spotless! The motel may be an older building, but it very well maintained. The bathroom is a little small but was very clean (this being more important to me than a large bathroom.) My only complaint is that the shower didn't have much water pressure, but that is just a very small complaint. Front desk ladies are wonderful! Check in/check out no problems and very friendly and helpful. Friendly housekeeping staff and they do an excellent job. There are 3 Mini-Golf courses and a WaterPark within a block of the motel. And the beach is just about a block and a half from the motel. The Ocean City bus terminal is within an approx. 2 block walk (just across the state line) and you can take the bus all the way to the OC Inlet and the Boardwalk. You can ride all day for $2.00!! We picked the Atlantic Coast Inn for the price but we are looking forward to returning in the future because of the clean room, neat motel grounds and very friendly staff!!", "Date": "July 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Delaware", "Title": "“Nice room for the money”", "Author": "outofthemainstream", "ReviewID": "UR29310208", "Content": "Everything was neat, clean and well kept. I was surprised because it wasn't very expensive compared to other places in the area. Lots to do within walking distance.", "Date": "May 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Michigan", "Title": "“Super retreat!!!”", "Author": "jbabes", "ReviewID": "UR5807073", "Content": "What a relaxing stay...room was bright, cheery and very clean. The staff was there when needed and not when you wanted privacy....we had a king room and was just perfect for our needs. The beach was close and the pool sparkling and relaxing. Would definately return A++++.", "Date": "September 16, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“what a location. 3 mini golfs, waterslide, movie house and great beach”", "Author": "A TripAdvisor Member", "ReviewID": "UR5443533", "Content": "We found this jem in our AAA guide . Easy to see why it's the only AAA rated property in the area. We are looking forward to our next vist.", "Date": "July 9, 2006"}], "HotelInfo": {"Name": "Atlantic Coast Inn", "HotelURL": "/ShowUserReviews-g41298-d120943-Reviews-Atlantic_Coast_Inn-Ocean_City_Maryland.html", "Price": "0", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">146th Street</span>, <span class=\"locality\"><span property=\"v:locality\">Ocean City</span>, <span property=\"v:region\">MD</span> <span property=\"v:postal-code\">21842</span></span> (Formerly Atlantic Budget Inn)</span></span></address>", "HotelID": "120943", "ImgURL": ""}}