{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Pennsylvania, USA", "Title": "“Fair hotel, difficult location”", "Author": "Howard4", "ReviewID": "UR126117221", "Content": "After a 4 1/2 hr., uneventful, drive from Philadelphia area, it took 3 \"turnarounds\" through small streets, a trucking distribution center, a highway, and heavy traffic to find the place--and that was in daylight with a GPS!!! Hotel itself is just OK at best. Staff was friendly. Included breakfast not so good. The hotel sits in what seems to be a trucking distribution center near South Boston, 1.7 miles from Faneuil Hall. Parking spaces were always filled except for the rear of the hotel--with some random people walking around and tractor-trailors parked there as well. Even after the daylight experience, coming back to the hotel (from a different direction) again included a \"turnaround\" due to a missed turn. I am not directionally challenged; it's just that this hotel is difficult to get in and out of. $133 AAA rate. Not cheap, but less expensive than most hotels in Boston. Old addage, you get what you pay for.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Hawaii", "Title": "“Good, nice, inexpensive Holiday Inn near Logan airport”", "Author": "petervee", "ReviewID": "UR126054372", "Content": "I stayed here because I had a flight early in the morning and had to be near Logan airport. The hotel offers nice rooms, nice breakfast and is much closer to Logan airport than a map shows. It took me just 10 minutes to drive there, sign posted all the way. The area may not be the best but as an airport hotel it is excellent. Rooms are nice and big. There is free parking behind the hotel (also unusual compared to other Boston hotels).", "Date": "March 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Wisconsin", "Title": "“Find something else!”", "Author": "ChrisandCandiO", "ReviewID": "UR125905600", "Content": "I had to book a last minute hotel in Boston and this one was available. I trusted it because of the reputible name of Holiday Inn and the continental breakfast in a pricey city like Boston. Upon my check in I noticed a moldy stain about 12 inches in diameter on the ceiling. I asked for a new room and was kindly given one. However, the next room had loose tiles on the bathroom floor and hair on the wall. As the night went on I learned how paper thin the walls were and each time we rode the elevator we thought it wasnt going to make it. Honestly, it took three times of a typical elevator ride and made quite a bit of noise. The staff was very nice, valet was great but the environment and location were not great at all. I recommend finding another hotel.", "Date": "March 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto, Ontario, Canada", "Title": "“Friendly service!”", "Author": "Raymond W", "ReviewID": "UR125517685", "Content": "Great Friendly service. Coffee could have been fresher in the morning. Check in and check out were easy. Getting in and out of the parking lot is a little challenging.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hartford CT", "Title": "“A good place to stay in Boston with free parking”", "Author": "Mrjamie", "ReviewID": "UR124901308", "Content": "We stayed 3 days just to see the sights, and wanted a place to park that was included. If you are looking for 4 - 5 star fancy, and the Ritz, this is not the place for you. But if you want a clean, safe place for a short stay. Consider this hotel. By the way, I am reviewing the one on 69 Boston St. as I believe there are several. Here are some values: Free parking so you can come and go. Free shuttle to Metro (subway) Full breakfast with attentive and helpful staff. It was not a menu - cooked to order, but we found it way ahead of typical \"continental breakfasts\" Quick elevators; push the button and the door opens (some require a long wait) Best of all: the staff is genuinely helpful and seemed concerned that guests enjoy not just survive. I'm not used to stopping at the desk each morning to greet workers on duty, but they went the extra mile to be helpful. I'd rather have this than stay at a fancy place where the people are starchy or artificial in their friendliness. The room was clean; heat worked quickly and quietly (Feb.) For those who have read grumpy reports about this place, we really wonder what they are talking about. We were impressed. Example; we had a small leak in the minivan radiator; nothing serious but I needed to add some water one morning. The hotel manager Dennis was passing by and he said \"If you need anything or there is any way we can help, please don't hesitate to ask.\" Finally, there price was about average for the city - or perhaps a little better; but when you figure in free parking, it was a good buy. By the way, there was a small refrigerator and a mincrowave oven in the room; next property was a small strip mall with a Panera Bread restaurant (excellent) and an Olive Garden (fair - not impressed)", "Date": "February 20, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Oak Bluffs, Massachusetts", "Title": "“Gross”", "Author": "laura0299", "ReviewID": "UR124875003", "Content": "We only stayed here for the park and fly promotion which was good, although I was nervous my car wouldn't be there when we returned, or broken into. Our room was really run down and gross. The bathroom door lock was broken off the door so it wouldn't lock, moldy shower curtain, gross floor, and water damage around the tub and floor so there was little holes into the wall everywhere. I didn't feel clean and was nervous to take my shoes off. Wouldn't stay here again, and wouldn't recommend it to anyone, tons of other great clean safe places to stay in the city!", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“A good HIE”", "Author": "Tauwhare", "ReviewID": "UR124176183", "Content": "Stayed in Sept '10 for 2 nights. Very good hotel, great location, great breakfast, great room - very spacious). Most of the reception staff very friendly and helpful - with one exception. I'm sure it would be the same person mentioned by Kathy C. We were charged for several shuttle trips that we didn't take and when we challenged them on our bill, she threw a real wobbly. But you don't let one person spoil what was otherwise a very enjoyable stay. HIE hotels are a great choice and we won't let her stop us from using the chain again.", "Date": "February 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Better than most HIE - Recently rennovated”", "Author": "P4620", "ReviewID": "UR123944125", "Content": "I was here 1 night for business. The hotel has been recently upgraded and provides good value compared to other similar type properties. Just a few miles outside of downtown Boston right off of 93 (on the south side). Convenient to Boston and Logan airport. the hotel is right near a shopping center that has an applebees and an Olive garden as well as a target and best buy. The hotel has free parking and free internet that is faster/more reliable than a lot of hotels I have stayed at. The room was on the small side but I would say normal size for boston (I had a 1 bed queen room). My room was quiet with power outlets near the bed and at the desk. There was a nice flat screen TV with tons of channels (including HD), a fridge, microwave and a workdesk/chair. The bathroom is small but plenty of hot water. The bed was comfortable but like most HIE the pillows were small (a minor convenience). The linens/towels were clean and in good shape and in general the entire hotel was very clean. The front desk was staff was very nice/pleasant.", "Date": "January 31, 2012"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Warning - UNRELIABLE, Desk Clerk Should get FIRED!!!”", "Author": "Kathy C", "ReviewID": "UR123284139", "Content": "The Desk clerk was a Big B-- / pain. She had to work a double and took it out on my family, Slooow and when I asked for the manager she then cancelled my reservation. Left us without a room and couldn't care less. I dealt with Holiday Inn for 30 years and will never stay at another. How can you cancel a paid in advance guaranteed room. Went to the Best Western and had a nice weekend anyway.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "San Ramon, California", "Title": "“Better than staying downtown if you have a car or don't mind a short cab ride”", "Author": "semi-pro-traveller", "ReviewID": "UR123252765", "Content": "Inexpensive, clean, service, near airport, free parking. Recognized Platinum status with upgrade and gift. Will come back for sure.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brunswick, Maine", "Title": "“In the thick of things...”", "Author": "dickinsons94", "ReviewID": "UR122818052", "Content": "This hotel really is adjacent to the TD Banknorth Center (North Station). The online rate was better than the actual reservation rate over the telephone and the reservation specialist was honest about it. The lobby looks fabulous and the complimentary breakfast was out of this world good. The staff was very welcoming on all shifts. DOWNSIDE: There was a washcloth left in our bathtub with personal hair on it. The temperature of the room was hot, uncomfortable and not controllable by us (we stayed 12/23 so it was cold out). When I told the front desk about it the next day, they offered the suggestion to put the heat on economy and leave the windows open...", "Date": "January 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London", "Title": "“Average Hotel for average prices”", "Author": "Hotspur91", "ReviewID": "UR122803281", "Content": "We stayed here because it was cheap compared to other hotels in Boston. This is due to the fact that it is quite far from the centre but we are from London so were happy enough to walk to the Subway station and use public transport to move around. The parking and wifi were free which was good as was the breakfast. Breakfast was sufficient but I wouldn't have paid for it. It would be good to have more than one type of tea and American orange juice always seems to be watery, sugary, orange flavoured drink rather than orange juice. Staff could be a bit surly but generally were ok. The room was tired but large and ok for our purposes as we didn't spend much time in the room. The bathroom smelt a little damp. Overall, I wouldn't go out my way to recommend this place to a friend but if it is a lot cheaper than anywhere else, I would tell them that you get what you pay for!", "Date": "January 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Close to everything”", "Author": "dialafa", "ReviewID": "UR119947655", "Content": "Clean, easy, above average continental breakfast, and great rooms/beds. In Cambridge, but Boston is such a walkable city that it's close to everything. Also, close to the metro and public transportation. Across the street is a market so it's great if you want to save money since the Holiday Inn has a mini fridge and a microwave.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "tennessee", "Title": "“Boston Mass. Holiday Inn Express”", "Author": "TennesseeBob", "ReviewID": "UR119919075", "Content": "October 20,2011. We stayed at the Holiday Inn Express at 69 Boston St. on the Southside of Boston. We were to leave the next day for a cruise. The staff at the front desk Carol,Gina.and Sahahi were very friendly and helpful in all of our request. A full morning breakfast. A shuttle service was provided from the airport to hotel and from the hotel to the cruise ship. A small fee of $10. bucks covered it. My next trip to Boston will be with these people.We enjoyed our stay.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“Fairly good”", "Author": "chris036", "ReviewID": "UR119879233", "Content": "Booked on the strength of reviews I found this Holiday Inn to be ok only. Staff were a bit distant, as is the location - although they provide a free shuttle to Andrew metro station, which is actually only 8mins walk away anyway. Town isn't too far, but it does take up time so bear it in mind. Rooms a little tired, lifts old and slow, but free breakfast, wifi, coffee all make it value for money.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brussels", "Title": "“Easy to reach and close to Boston city and Logan airport”", "Author": "YvonneBrussels", "ReviewID": "UR119748774", "Content": "It was easy to find the hotel using the rented GPS in our rental car. Please be aware that you have to pay immediately about 4 dollars for the tunnel, driving from the airport (island) so make sure to have some cash. The parking is free at the hotel. The Andrew metro station is a 7 minutes walk, a ticket 2 dollar per ride and easy to buy from a Charley ticket machine in the station, cash or Visa. If you buy more rides at once the price of a Charley ticket is 1,70 dolar. The metro is the best way to get to town because downtown parking fees can go up to 35 dollar per day. The Park street metro stop is a good start for the Freedom trail and for the Beacon hill area (with the Cheers bar on Beacon street from the tv series Cheers). A taxi from the hotel to downtown might cost about 20 dollar. The hotel is basic but good, and breakfast is included, very convenient. The staff was helpful in explaining where to go as a tourist. Free WIFI in the hotel and computers in the lobby.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“boston good for me”", "Author": "denmar186338", "ReviewID": "UR119524028", "Content": "seen some off the reviews This is good value i thought my room was clean good wet room Breakfast was good enough staff were always busy but helpful &their tube is easy to work out & easy access to walk too or take shuttle at the back their is some good cheap stores to take gifts back to London Good place", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Overland Park, Kansas", "Title": "“EXCELLENT SERVICE MAKES UP FOR LOCATION!”", "Author": "showmetraveler", "ReviewID": "UR119354487", "Content": "It's true that this hotel is a little distant from the tourist area of Boston, but the staff and amenities more than make up for any inconvenience. The hotel's shuttle will pick you up from and return you to Logan for $5 pp 24/7. The shuttle will also take you to and return you from the nearby Andrew subway station for a quick ride downtown. All of the local tour companies pickup and return to this hotel. Free internet, free breakfast. GREAT front desk staff. And it's $100 per night cheaper than downtown hotels that don't offer anywhere near the service. It would be great if all the sights were just out the front door like at the Parker House, but we felt the trade-off was more than worth it.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "liverpool", "Title": "“nice staff”", "Author": "gweaffer", "ReviewID": "UR119307079", "Content": "Stayed for a few nights prior to travelling to New York. Hotel was booked for us as part of a package.Breakfast was OK. Staff where polite and helpful. Hotel quite dated could do with a up grade", "Date": "October 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "gary7272", "Title": "“Tired hotel, but enthusiastic staff...”", "Author": "gary7272", "ReviewID": "UR119194563", "Content": "My wife, son and I stayed for two nights at the HIE. It is not the easiest place to find in the southern part of Boston...Be sure to have a GPS or great directions...The hotel is quite tired looking, but adequate for our purposes. The location is within 10 minutes of a T station that will take you almost anywhere in Boston. It is behind a shopping center with a Target, TJ Max,etc...Panera's, Applebees... The parking was free which was a great plus. The rooms seemed dated as did the entire complex. The parking lot was being worked on, so at times we had to move cones to get out of the lot. The breakfast was quite mediocre. Nevertheless, the staff was quite helpful and knowledgeable, especiallly the front desk people who were extremely enthusiastic. It was generically overpriced, but somewhat reasonable for Boston.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "il", "Title": "“Good Hotel”", "Author": "vasnos", "ReviewID": "UR118618319", "Content": "Stayed here two days prior to our cruise. Great accomidations and good breakfast. Shuttle brought us to cruise terminal.Needs a little cosmetic work, but they were working on some of that while we were there. i would recommend the Holiday in Express, Boston.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Maidenhead, United Kingdom", "Title": "“OK hotel, friendly staff”", "Author": "Ellieque", "ReviewID": "UR118602226", "Content": "Rooms are nothing special but we were only there for a couple of nights. Damp smell and room was pretty small. Hotels in Boston are way overpriced, so worth it to stay a little way out. Breakfast was included and was fine. We got the shuttle to and from the airport which was good value. The T station is only about 10 mins stroll and you can get downtown in a few minutes. We got cabs back at night though. The staff were friendly and sociable.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Good Value, Great Service”", "Author": "K C", "ReviewID": "UR118335355", "Content": "Carol, Sarahi, Gina & Antwann were the best!!! Arrived August 25th 11:45 pm, shuttle picked us up within 20 minutes ($5 fee each way). Check-in was easy! Rooms are a little small and have a stench carpet odor! Nothing a little glade solid air freshener couldn't fix (which I grabbed at the local target in the strip mall right behind the hotel) :) Hotel is in a pretty good location.... A few minutes (walking) to the subway station...& they provide free shuttle within a certain radius! Continental breakfast is complimentary, not bad.... Late night complimentary cookies were GREAT! Especially fresh out the oven... ummm ummm If the rates are lower than $149 a night, will stay here again! If not, I'll take my chances on higher rates and stay a little closer to downtown. Add the taxi fare(s) to the bill and it'll average out. PS. This staff will go the extra mile to ensure your stay is as pleasant as they can make it. I really appreciate the extra attention and personal conversation. Oh yeah, and my most humble appreciation for allowing us to leave our belongings in the room past check out while we hung out at Fenway Park! :)", "Date": "September 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "", "Title": "“Fantastic Hotel - Don't judge it by the Neighborhood”", "Author": "BigTimeLeafsFan", "ReviewID": "UR118333661", "Content": "Great room, great staff and great breakfast included. This place had everything going for it. Even though it's next to the freeway, with planes flying by, we didn't seem to hear much of that and slept well. The neighborhood could use some fixing up, but the people all seemed friendly enough. Less than a 10 minute walk straight up the street to the subway, getting on the \"T\" at \"Andrew.\" We asked for directions and got lots of help. I'd stay here again for sure.", "Date": "September 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“A super little place - staff were so helpful”", "Author": "gak2705", "ReviewID": "UR118032237", "Content": "My husband and I were stuck when our flight was cancelled because of hurricane Irene. The staff in the hotel were so helpful and friendly they made sure we were able to contact our airline etc. It has a great a location (backing onto a retail park with many goood stores). It is close to the metro and easy to find. Breakfast was good and plentiful and the warm cookies a treat in the evening. $5 transportation to the airport and the site seeing trolley stops every morning. A good little find", "Date": "September 12, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Danielson, Connecticut", "Title": "“Cancelled reservation due to hurricane Irene”", "Author": "Linnea S", "ReviewID": "UR117239680", "Content": "Had advance reservations for night of 8/27. Even though there is a no refund policy, due to impending Hurricane Irene did not charge for cancellation. Thank you.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "CHICAGO", "Title": "“GREAT LOCATION... VERY HELPFUL STAFF- CLOSE ANDREW SUBWAY”", "Author": "CHICAGO049", "ReviewID": "UR116943881", "Content": "Picked up at Airport within 20 Min.... This Hotel is Close to Andrew Red Line Subway Station a 10 min walk. Desk personnel very helpful and Informative, Rooms were clean. South Bay Shopping Center right behind Hotel..Target-Best Buy- TJ Max -Marshalls Try 224 Restaurant about 10 min walk west on Boston Street. Excellent food menu... also 3 restaurants in shopping center.. Only negative things I will say is parking fills up very fast, and Breakfast room is small so at times must wait for a table.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Great service, helpful staff and easy to get to downtown”", "Author": "Rita k K", "ReviewID": "UR116843728", "Content": "We stayed here for 4 nighst in mid August. The room was clean, breakfast was decent. We walked to the subway (approx 6 min) and rode to downtown in 30 minutes. We took the train to Fenway and the Aquarium. The hotel isn't an upscale area, but we had no issues. Target, TJ MAX, Marshall's,Applebees, and a grocery store and Best Buy,and more are in the South Bay mall right behind the hotel. The staff was so nice. The shuttle drove us to the train station the first day so we could see how to get there! After that we walked as we needed the exercise. Did the harbour cruise twice, one to see the harbour and the other to go to see Fort Warren on one of the islands. A fun day trip. Of course seeing Boston vs the Yankees was the highlight for us! Would definitely stay here again!!", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Good value for money, decent location”", "Author": "SoumitreeG", "ReviewID": "UR116745816", "Content": "Was on a short business trip and hence chose this hotel because of the good price offers. On the side of a main highway, hence nothing much in the immediate vicinity (like shops, entertainment centers, etc), but it just a 10 min cab ride away from the city center and the marina/ docks, etc. The staff at the reception counter are very helpful, but wish the same could be said for the staff in charge of the morning breakfast - they were very rude and surly. rooms were nice and decent. fairly big, clean, nice clean toilet/ bathrooms.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“It is an overall best option in consideration of convenience and cost”", "Author": "Tea2gather", "ReviewID": "UR116685467", "Content": "We know it is not a luxury option option. Everything is just ordinary . The queen bed room we have is very small, but at least is clean. The hotel just finish renovation inside so it smells very fresh. We still like it because it is 5 -10 min walking distance from Andrew subway even though the route is not on highly traffic area. There is a south bay shopping centre right behind the hotel with target, best buy, and Marshall. We do not have to pay extra for parking. One down side is you can hear noise from next door even though we ask for quiet floor.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "west plam beach, fl", "Title": "“Great location - Not-so-great hotel”", "Author": "babsy sue", "ReviewID": "UR116629072", "Content": "One main reason we chose this hotel was that it is very convenient to everything - and it certainly is - and there is free parking. However, this hotel states it was renovated in February 2011; but when we arrived in July 2011, the renovation was still taking place. We went without cable for a night and half a day while it was being upgraded without being advised beforehand. Our room, one double bed, was very tiny for two people but it was clean. The parking was filled very quickly, and one night we had to park in the next-door hotel's lot. The breakfast bar didn't have a microwave, so I couldn't get oatmeal (I could have made it in my room as there was a microwave there; but I didn't bring any with me). There was no hotel book in the room for reference, and the people at the front desk seemed very disinterested. We paid for our stay with Priority Club reward points; and I believe 25,000 per night was too many points for what we received.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“Quiet and safe”", "Author": "AbuDhabiWil", "ReviewID": "UR116266619", "Content": "Great value for a decent HI Express in pricey Boston. Ample parking lots and clean rooms. Great warm breakfast in the morning. Close proximity to the metro. Would definitely choose this hotel when we are back in New England!", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Belleville, Canada", "Title": "“Shuttle no longer”", "Author": "PickmePlease", "ReviewID": "UR116187855", "Content": "As of a day before our trip we had called and inquired about the shuttle to make sure it still went downtown in which we were told yes , and when we arrived they said it no longer did. This was a HUGE disappointment as we were traveling with young children. I did not feel the safest in this area, especially walking to the subway with the kids.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Australia", "Title": "“GOOD VALUE FOR MONEY FAMILY HOTEL”", "Author": "Aussietez", "ReviewID": "UR116157768", "Content": "This hotel does the simply things well. It is very clean and the 2 double rooms are very adequately sized and fitted out for a family of 4. Breakfast was included in the room tariff and the food was better than average. The best part of the hotel however were the two ladies at the reception desk. They were both excellent and couldn't do enough for you. From early check-in, to recommending things to do whilst in Boston. The neighbourhood the property is in is just ok. Not the most aesthetically pleasing but by no means a deal breaker. We walked to the nearest subway each day (about 12 minute walk) and felt very safe during the day. It was then about another 15 minutes on the subway to get into Boston City. Ample free parking on-site. Limited dining choices in neighbourhood.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Denver", "Title": "“Great Deal”", "Author": "Traveler802", "ReviewID": "UR115917885", "Content": "Booked this hotel through Last Miinute Travel for a bargain rate of $99/night. I was pleasantly surprised to find clean, very adequate rooms and rate included a full breakfast in the morning. There is a shuttle to the airport for only $5 and the hotel is within walking distance to the T. I wouldn't hesitate to stay here again....great location out of the city with easy access to the city!", "Date": "July 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "San Diego, CA", "Title": "“Quick business trip”", "Author": "superdeejayanna", "ReviewID": "UR115864171", "Content": "This hotel was by far the best value I could find for my last business trip to Boston. It has free parking, which is awesome if you bring a car. No, the neighborhood is not cute, but it's centrally located, close to the highway and perfect for what I needed. The staff were friendly and helpful. The free newlywed was just okay.", "Date": "July 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Good value”", "Author": "songbird1329", "ReviewID": "UR115605977", "Content": "We had a short stay in Boston and wanted something convenient and relatively inexpensive. This place fit the bill and I would not hesitate to stay here again. Love that the entire hotel is non smoking. The shuttle to mass transit was a nice extra. Our room was clean and comfortable ... but relatively small ( we chose a room with one queen bed). The hotel was in the middle of renovations when we stayed so parking was at a premium. Overall a good experience.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "toronto", "Title": "“Noisy but \"ok\"”", "Author": "scooter44", "ReviewID": "UR115577639", "Content": "Stayed for one night on the way back from a trip up the coast to Maine. While they have made a good effort at refreshing the decor and updating the amenities, you could tell that structurally it was a bit \"iffy\". We stayed in room 401, directly across from the elevator. It was VERY noisy with the elevator pinging all evening and the conversations that take place while waiting for elevator. They elevator cables are also in serious need of some WD40 as they squeak and squeal on the way up and down ALL NIGHT. I think they may have scrimped on the door quality for the rooms as I could hear everything going on out there. This could be just that room but I don't know. The room was overall comfortable however - the decor was nice, shower and bathroom clean and nice, and the kitchenette was great. The continental breakfast was fine also. Right next to Boston Garden so probably ideal for a game night.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "New York City, New York", "Title": "“not bad!!!”", "Author": "midgetwarrior", "ReviewID": "UR115555014", "Content": "Staff was helpful when asking questions or directions.... hotel was in walking distance to the train OR if you want to wait for the shuttle, you can. Its about a 10-15min walk to the train. Only saw the shuttle a few times... it was faster to just walk most times..(only rode in the shuttle once during our entire stay and we were back and forth to the train a lot) No pool in the hotel.. BUT there are beaches if you drive to the Quincy (shore drive) area or by Castle Island (which was really crowded). Room was new, and clean.... hallway carpet smelled like new car smell (wtf? Haha) flatscreen tv, fridge so new the door didnt open, microwave, ice machine by the elevators, wifi throughout the hotel (we were on 5th floor and i got perfect service no problem), vending machine downstairs in lobby.. Free breakfast til I think 11?... cereal, cinnabon (awesome), yogurt and other stuff like eggs, sausage (meh), bagels. Checkout is 12 I believe. Free parking for the duration of your stay. 15-20mins to the city via the T. Simple transportation system. Can't get lost. Would def. stay here again!", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Puerto Rico", "Title": "“Awsome Unforgetable Experience”", "Author": "Rita147319", "ReviewID": "UR115140384", "Content": "My family and I went to Boston for a wedding and we had to stay at the wedding's hotel (H--tt). After the wedding we moved to the Holiday Inn Express, because the other one was too expensive and had no dinners nearby, so we had to do all of our meals there. The Holiday Inn was and unforgetable experience. I considerate it as a family hotel. The front desk ladies were very friendly and helpful throughout all of the different shifts. The room had a refrigerator, a microwave and a coffe maker all for free (the other one charged you for every item).The roomn was extremly cleaned and it smelled like they had changed the carpets recently for new ones. It served full breakfast daily also for free. It has a shuttle bus to and from the airport for a very small fee, compare to a taxi that charged you 5 times that fee. The location is also very convenient. It is near the subway, which it takes you to all the tourist and historical places. It has a mall walking distance with a huge grocery store. We could also do our plane check in because it has access to computers with free internet and printer. We spent the 4th of July sitting in front of our room window (which faced the city) watching the fireworks display, while listening to the music concert on the TV. What a nice way to celebrate the Independence Day!!!", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Westport, Connecticut", "Title": "“Horrible experience”", "Author": "CTgirl77", "ReviewID": "UR115025796", "Content": "We stayed in a suite with my 2 sons over the 4th of July holiday. We chose the place because we thought it was a good value. Big mistake. Our room was filthy. I didn't even want to put our suitcase on the floor because the carpet was so dirty. The room was also very dark (which was probably a good thing, considering how dirty it was). We stayed on the 3rd floor and the elevator was out of service. Not a great neighborhood.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Waterloo, Canada", "Title": "“Good hotel for St. Paddy's Day!”", "Author": "RyanD36", "ReviewID": "UR113170810", "Content": "A few friends and I stayed here for a couple of nights for St. Patrick's Day. It isn't in the nicest part of town, but it is near the subway and the airport. It isn't near downtown, but it is much cheaper than hotels in the downtown area, and it is easy to get there with just a subway ride. The staff were very friendly, and had no problems with us being loud and having multiple people in our rooms (maybe they are not so nice if it isn't St. Patrick's Day). Internet worked great and was free, and rooms were clean. The continental breakfast was sufficient - the cereal and fruits were good, the hot food they had out wasn't great. Overall, a good place to stay for a few days to see Boston and party with some friends, while saving some money.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Vancouver", "Title": "“Lived up to expectations in every single way, and I don't mean good.”", "Author": "diva_enroute", "ReviewID": "UR112814528", "Content": "From the moment I arrived at this hotel, I knew what I was in for. They are currently renovating the outside of the building and so the main door was not available. Guests are asked to go through a side door which isn't automatic which made it really difficult to drag a large luggage through while struggling to hold the door open. I arrived at the front desk and no one greeted me, the lobby was a ghost town. Granted it was 1230am that I arrived but nonetheless you'd expect there to be front staff. I called out and didn't get a response and finally saw the maintenance person. He then had to find the front desk guy. The front desk guy was friendly enough but not very helpful. After he signed in, he told me to have a good stay but he hadn't given me a key. So I had to ask for it. Then I asked if there was a shuttle to the convention centre. He promptly replied \"Yes\" but that was it. I had to follow up with additional questions to find out schedule details. The rooms are newly renovated which I think is the only thing it has going for it, but the room had a very strong paint smell which was overwhelming. Overall the room was small but there wasn't a lot of furniture so it was well laid out. The washroom wasn't clean, I found stray hairs in the shower. Additionally the remote control was not \"sanitized\" as it typically is these days at nicer hotels. There is, however, free WIFI. The bed was soft and a bit saggy. It is a Holiday Inn Express which I guess is your bare basic type of accommodation but the price point I didn't find particularly \"basic\" at $160/night. Would I come back to this chain? Not likely if it was on my own coin, but I'm on business and there's a \"guideline\" as to which hotels are acceptable. So I'm guessing I may see another HI Express in my future - hopefully it will be better than this one.", "Date": "June 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Lake Forest, CA", "Title": "“Great Place”", "Author": "Travelinf00l", "ReviewID": "UR112105985", "Content": "This wasn't anything fancy but it was very clean and the staff was very friendly and helpful. They have a very nice breakfast in the morning, it is adjacent to a large shopping center with restaurants within walking distance. The Beantown trolley picks up in the morning and has a very nice tour of Boston, and will bring you back at the end of the day. The hotel has a luggage room to store your luggage if you need it. And we could reserve the shuttle to take us to the cruise ship in the afternoon. So convenient! We enjoyed our stay and I would definately recommend this to friends.", "Date": "June 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bloomsburg, Pennsylvania", "Title": "“Great Place for a long Boston Weekend”", "Author": "Hjk131", "ReviewID": "UR108337533", "Content": "This hotel was perfect for our Boston trip. Free parking, free breakfast, and a short walk to the Andrew line (Subway) to get downtown. The subways were very easy to use. The hotel staff were friendly and helpful. I would stay here again and recommend this hotel.", "Date": "May 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Northville, MI", "Title": "“Economical place to stay in Boston, but seemed a bit tired.”", "Author": "kak531", "ReviewID": "UR108239334", "Content": "Definitely an economical place to stay, less than half the price of major DT Boston hotels. However, it seems to be an older HI, and could use a renovation. B-fast was better than avg. Overall an OK stay, just not special in any way other than price.", "Date": "May 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Concord, New Hampshire", "Title": "“Used Park Sleep Fly to book hotel.”", "Author": "vrichard65", "ReviewID": "UR107760312", "Content": "I used ParkSleepFly to book hotel. This is the only way they allow it if you want to park while you travel. The ParkSleepFly service never booked the hotel room. When we went to check in, there were no rooms available. I had to wait about an hour until some group that was missing a person was willing to give up a room that we could have. The shuttle service was ok. A little slow on the way back. I would never use the ParkSleepFly service again! The customer service person at the Holiday Inn Express said this service often doesn't book the hotel room. The floor we were on was loud until late. Some kids in the hall making a lot of noise. Very Disappointed!!", "Date": "May 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Bexley, United Kingdom", "Title": "“Good place to stay”", "Author": "BexleyStuart", "ReviewID": "UR107732139", "Content": "We stayed here for three nights with our 2 year old son for a city break. From the outside it looks pretty run down (as it is undergoing renovations) - but inside was clean and the customer service really good. The complimentary breakfast was great - although the dining area got pretty busy. Although not in the city centre - we used the nearby T station at Andrew a lot - it took about 10 mins to get to downtown. Area felt safe to walk around - and there's a good retail park next door with a supermarket, Appleby's etc. With so many Boston hotels really expensive, this place was a good low cost alternative.", "Date": "May 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "chicago, il", "Title": "“Perfect location and price - but we are easy to please”", "Author": "mustie", "ReviewID": "UR105495363", "Content": "My husband and I have stayed here for the second time and will stay again when we are in Boston. The reason of our stay is that I come out to run the Boston marathon each April. When vacationing we always try to find the biggest bang for our buck - and the Holiday Inn Express at 69 Boston Street has just that! The rooms are clean and comfortable. The staff is friendly and accomodating - very helpful with getting us around Boston. The location is just a short walk from the subway and only a few stops out from downtown Boston. The continental breakfast is delicous and there is something for everyone. There is a nice shopping center behind the hotel. Shuttle transportation is provided for $5 a person and can be lined up with a phone call to pick you up from the airport when you arrive and take you back the day you depart - but you can also take the subway from the airport to the hotel. If you are looking for a reasonably priced hotel that is clean and comfortable and just a short subway ride to everything this is the place for you. We will see you in April!", "Date": "April 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Maybe the car enjoyed it....”", "Author": "maxclancy72", "ReviewID": "UR102901789", "Content": "... but no one else did. We stayed for the night before an early flight out of Logan; the car stayed for a week. The hotel was difficult to find using hotel's online directions; had to call home for some reference. The mystery directions added about 30 minutes of driving late night in fringe areas of South Boston. Not exactly a sterling start to a week vacation. Even when located, the directions brought us to the wrong end of a one way. Check in was quick and easy. Room was 'non-smoking' however was clearly not. Smokey smell was strong enough to keep us awake. 5am transfer to airport was quick and timely. Pick up on return trip was not as efficient. A miscommunication between front desk and driver over which terminal we were waiting at led to a 45 minute wait in a cold rain. Overall nothing catastrophic however it was a rather sour bookend to an otherwise fantastic vacation. There are plenty of other park, stay, & fly options around Logan and we'll be looking elsewhere next time.", "Date": "April 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "New York City, New York", "Title": "“so far away from boston”", "Author": "LovesLondon415", "ReviewID": "UR102692533", "Content": "This hotel is not in Boston city center. I learned that the hard way as I left Boston South Station and traveled down the highway to what looked like a highway exit to where my hotel was. In order to take the subway you needed to walk across a bridge to what looked like a rundown neighborhood. I had to cab it. the room was fine. it looked like the hotel was going through major renovations. it was quiet. the free breakfast was fine too. if you need a quick hotel to stay in and don't mind cabbing it into the city then this is fine for the price. but if you have the ability - stay in boston city center as it's a pain.", "Date": "April 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Hit Or Miss”", "Author": "hotelguest10001", "ReviewID": "UR102453833", "Content": "i stayed here four times and had good exp.twice and not so good the other two times but will give them another chance and see if its better next time around.", "Date": "April 1, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Decent hotel outside of city center”", "Author": "aikman04", "ReviewID": "UR95272291", "Content": "This hotel is easy to reach from the freeway and has free parking. It is located at about a 5-10 minutes walk from a subway station. From this subway station you can get to locations in the city center in about 10 minutes. There is a free shuttle bus from the hotel to the subway. The room were basic and clean. The breakfast was not good. When we arrived most of it was already gone, even though we arrived half an hour before breakast was closed. But overall this is a decent hotel, nothing fancy.", "Date": "February 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lagrangeville, NY", "Title": "“Love the cinnamon rolls at breakfast”", "Author": "Yung4fr", "ReviewID": "UR91230503", "Content": "A GF and I (2 females) stayed here for a weekend Boston trip. Good value hotel with great breakfast -- I do like their cinnamon rolls if you did not get that from the title. :-) The hotel is 0.4 miles walk to the nearest metro station; not bad of a walk although a little quiet at night, but we did not feel unsafe. The hotel was undergoing renovations (outside walls) while we were staying and on the Saturday morning of our stay, there were workers outside our window by 7AM. Good thing we were already up and had the blinds drawn, so if the renovation is still on going, ask for a room away from the renovation if you are a late sleeper.", "Date": "December 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Stonington Borough", "Title": "“Park, Stay and Fly with up to 21 days free parking here - what a bargain!”", "Author": "Stonington-Sue", "ReviewID": "UR90100986", "Content": "I must admit I was slightly concerned by a few of the earlier reviews I'd read but decided to give this place a try. If you're looking for scenic this isn't the place, however, if you want somewhere clean to lay your head and a good shuttle service to Boston Logan, look no further! We usually stay at the Doubletree near the University which is good for this type of stay too but they don't offer the additional days parking beyond ten or is it fourteen - not sure on that. I have no idea why as they have a huge car park and I don't want to pay $10 a day to leave my car there on the extra days!! (Note to management - OK, so it's in the wrong place!). Definitely follow their recommended exit as your GPS will tell you something different and if you're arriving after dark, it's not that easy to see as it's tucked away, slightly set back from the road. However, I called from nearby and they were easily able to point me in the right direction! The lady at the front desk was very helpful - a resourceful and unflappable type - just the right sort for that job! The room was perfectly adequate, clean and tidy. I wasn't able to stay for the breakfast as I had to head off early but if it's included, why not take advantage if you can?! My car was safe and sound when I got back and the shuttle driver stopped right in front and loaded my bags into the trunk - wonderful! You wait at the Hotel Courtesy Bus stop, right outside - Terminal E, in my case and they were there very promptly. Would I stay here again? Yes, why not? The only thing I didn't enjoy was that the heater is a little loud, but if you consider that white noise, it's helpful! If not, heat the room and then just turn it off when you turn in. It was absolutely fine. On the plus side, it's the most economical place I could find in Boston and does exactly what it says on the tin! Oh! One last thing - if you have a choice, don't park under the trees near the fence as the birds will be busy while you're away!", "Date": "December 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Queensland", "Title": "“Comfortable and friendly hotel”", "Author": "valui", "ReviewID": "UR89296020", "Content": "What can you say .We enjoyed our stay, the staff very accomodating and helpful, the beds comfortable and clean , internet available in lobby and a good breakfast. There was a guest laundry which was very useful and a gym which never seemed to be in use. The shuttle bus was handy to take you to the station altougfh we walked a few times as it was good exercise and not very far. We also had dinner at Applebees which was excellent and had huge servings., and did shopping in the mall next door. The only bad thing was we got a taxi from the airport instead of the shuttle and wasted a few dollars.", "Date": "December 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Great little place”", "Author": "Curlywurly3669", "ReviewID": "UR87524824", "Content": "From the moment we arrived to the lovely smiles of the Girls on Reception to the Shuttle Bus Driver dropping us off at the Cruise Port, we had a great time. Our room was lovely and clean with a great comfortable bed. Didnt have much of a view but that didnt matter as we only stayed one night. The Breakfast buffet was great and the Staff were very polite and friendly. Just a few minutes walk away was a retail park with a Target store on it which was great for buying all your forgotten toiletries and stuff. Have already earmarked a return visit to Boston next year and hope I`ll be able to use this Hotel again. The Hotel had an External (I think) refurbishment going on when we arrived but that should be over soon.", "Date": "November 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Excellent service, first quality staff”", "Author": "raya06", "ReviewID": "UR86538490", "Content": "This is my first review online, but the service I received at the Holiday Inn Express was so outstanding I feel compelled to thank the great staff. First, Gina and her beautiful smile who was an outstanding hostess. Miguel the bus driver who was wonderful. Everyone from the desk clerks to the cleaning staff maintained a professional attitude with a wonderful smile. They have shuttle to the airport as well as the convention center which was so convenient. The free breakfast was excellent, clean and delicious. Guests are treated like royalty. The location is excellent next to a great shopping center with restaurants and a Target. I highly recommend. Great value for the money.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Colton, California", "Title": "“A very economical place to stay for Boston”", "Author": "paiawahine", "ReviewID": "UR86464418", "Content": "We were at this HI Express 2 years ago and so this year we returned because of the wonderful service and price. Two years ago the shuttles were free but this year it was $5 per person from the airport to the hotel and also $5 to Black Falcon, which was fine with us. There are 2 computers in the lobby for the guests to use free of charge. Also breakfast is included which is extensive such as eggs, sausage, cereal, juices, fresh fruits etc. which filled us up. Upon arrival, we met a couple that I knew from a previous cruise and we walked over to the restaurants, which is quite close to the hotel. We were going to eat at the Olive Garden but the wait was 45 min. and no wait at Applebees. The next time we stay at the HI Express, I'd like to order from Alfredo's and have them deliver and eat it at the breakfast room. Target is in the same shopping area which is convenient if one needs things that were forgotten or couldn't take into the plane as carry-on before going to Black Falcon cruise terminal. The bathroom had the usual, bath soap bars, lotion and shampoo/conditioner and nice thick towels. Someday, we'd like to stay a little longer and explore Boston more.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Bristol", "Title": "“Good for Boston & Logan Airport - hard to find”", "Author": "DSandJB", "ReviewID": "UR85667696", "Content": "We only stayed one night before getting a flight home, but the service at check in was good - although they had us booked in rooms on different floors they changed this without being asked. As previous reviewers have said there is a good breakfast area which seemed full of people at all hours of the day and night, and the refurbishment work on the outside of the hotel doesn't affect the inside or alter the comfort of the rooms. Our biggest problem with the Holiday Inn was finding the way in - if you come from the north on I93 (Route 1) then it's easy, but coming from the south and turning into Boston Street you can't get to it easily. Directions from the south - exit I93 at exit 16 for Southampton Street. Go left on Southampton Street over I93 and then turn back to re-join I93 going south, but instead of joining I93 keep right to enter the hotel car park.", "Date": "November 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glenrothes, United Kingdom", "Title": "“excellent stopover”", "Author": "EllieK016", "ReviewID": "UR84960789", "Content": "We stayed here for one night before flying home to Scotland. The hotel was in an excellent location, only 5 minutes by taxi to Quincy Market. The rooms were clean and spacious, the beds extremely comfortable and best of al the hotel runs a shuttle to and from the airport for only $5 per person each way (use the phone in the arrivals hall to arrange your pick up). Excellent complementary hot breakfast and free coffee 24/7. Although the hotel is undergoing remodelling, this had no impact on our Saturday night stay. The staff were extremely efficient and friendly and I would have no hesitation in booking this hotel for a longer stay", "Date": "October 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dorset", "Title": "“Good value”", "Author": "Sturmey", "ReviewID": "UR84896779", "Content": "We stayed here 5 nights and found the overall service very good and the staff particularly helpful. The room was clean and the bed very comfortable. The breakfast choice was brilliant and the only critisism would be an occasional queue for the (one) toaster. The shuttle bus collected us from the airport which made life easy. The local metro station is no more than a 10 minute walk away although we did make use of the free shuttle service to the sation on a couple of occasions. I think that a good indication of the overall experience would be the fact that we would unquestionably stay here again.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Derby, United Kingdom", "Title": "“Great”", "Author": "Flyoctober", "ReviewID": "UR84795240", "Content": "We really enjoyed staying at the hotel. It was very convenient to the \"T'. A very quick walk was ideal with young children. The hotel was clean, the staff were polite and friendly and very helpful. I enjoyed using the treadmill in the exercise room. The breakfast was perfect for us and very tasty and suited all our needs (including our sometimes fussy children). The walk to the 'South bay' shopping centre was great - we enjoyed shopping in Target, especially - such good prices! Thanks for a great stay - would highly recommend the hotel, well worth the money.", "Date": "October 25, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "california", "Title": "“Wonderful!”", "Author": "SunnyCalGirl4ever", "ReviewID": "UR84689223", "Content": "Perfect location...just a few miles from downtown Boston, and just a 5 minute walk to the \"T\" (subway) station. The employees went out of their way to help us in every way they possibly could. The hotel was very quiet and clean and served a hot breakfast to get us going every day. It was a wonderful stay!", "Date": "October 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Bexleyheath", "Title": "“Good except for breakfast”", "Author": "RobRobJenJen", "ReviewID": "UR83692828", "Content": "We stayed for 2 nights in August 2010, Â£100/night booked 8 weeks in advance. There was a 10 mins walk to subway (if directed correctly!) or you can get a courtesy lift there at set times. It's about 10-15 mins to/from downtown on the subway. The room was huge. (See photo for view from it) Coffee was always available in the lounge. Breakfast was basic with some hot food. As with the other Holiday Inn Express that we used on this holiday (N Conway NH) there was no free space on either day to sit to eat it. (We came back later to the remnants on the first day and on the second day we took the food to our room!) (One of 8 accommodations reviewed this holiday)", "Date": "October 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Washington State", "Title": "“Great Value for Boston”", "Author": "PollyannaDreamgirl", "ReviewID": "UR83344101", "Content": "We chose this hotel for a 2-day pre-cruise based on price and location. It was half the price of in-town hotels, and close to the public transportation (subway lines). There were several restaurants within walking distance (Applebee's and Olive Garden), as well as a grocery store and office supply store. The hotel had a shuttle for $5 a person that picked up or delivered to the airport, PLUS picked up or delivered to Black Falcon Wharf (the cruise terminal). They also told us that when we returned from our cruise, we could call for the shuttle (for $5), store our luggage with them (even though we weren't going to be staying the night), and use their shuttle to return to the airport. It was a nice, clean, space. The beds were very comfortable. The staff was very friendly and helpful. The breakfast was the normal continental-style hotel breakfast and tasteful, however they could have used more tables for seating. We had an issue when leaving for the wharf the morning of our cruise. We (4 of us) had booked the shuttle for an 11:30am departure, when an over-zealous tour director demanded they take her whole group on that paticular shuttle. The hotel manager actually loaded up our luggage, and personally drove the 4 of us to our cruise ship. Great customer service!", "Date": "October 13, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Great Deal”", "Author": "Tamwam", "ReviewID": "UR83249762", "Content": "Was a little worried about choosing this place because of reviews but was pleasantly surprised. I did not feel unsafe at anytime even walking to and from the subway. If you are a typical suburbia american you might feel a little out of your element but get over it. It is a big city after all, I did see a little graffiti. I have an 11 and 13 year old girl and we were fine walking around the area. The accomodations were fine and the breakfast was good.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Rochester, New York", "Title": "“This was deifinitely not up to the quality of other Holiday Inn Expresses.”", "Author": "BobMRoch", "ReviewID": "UR82702412", "Content": "This Holiday Inn Express fell far short of the standards set by other H.I.E.s. The breakfast buffet was not well attended, nor did it have the variety of other H.I.E.s. For two days their signature cinnamon rolls were not even available. During our entire stay the printer attached to the public PC in the lobby was low on toner and printed half the page very, very faintly and the staff seemed uninterested in doing anything about it. The overall condition of the place was getting \"tired\" and badly needed renovation. Additionally, many amenities and creature comforts seemed to be missing. In general, there were many relatively minor errors, but when added all together made for a stay that was less than expected.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Massachusetts", "Title": "“Great park sleep and fly hotel”", "Author": "kidfamilytravels", "ReviewID": "UR81994893", "Content": "My family and I had a great experience at this hotel. We stayed there the night before flying out of Logan. The staff there was very helpful. The rooms were nice. The exercise room was open early and late morning hours (which is when I tend to work out), and this was super-convenient. The shuttle to the airport came promptly at both ends of our trip. The park sleep and fly package is a great value and we would definitely be interested in staying at the hotel again before a future flight, and maybe on other trips to Boston as well.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "new york", "Title": "“On the ball”", "Author": "carolinaboss", "ReviewID": "UR80966431", "Content": "My companies have used several Boston hotels for business over the past year and have finally found a home. Convenient-with great value-they are very good to us-like a home away from home-feel confident in sending both employees and clients there-great job,personal service,good for my business.Keep up the great work!!!", "Date": "September 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cave Creek, Arizona", "Title": "“Really nice place”", "Author": "drhemlockccw", "ReviewID": "UR80839378", "Content": "We went to Boston/Cape Cod just to see the sights. Stay here for 4 nights and were very pleased. 10 minute walk to the \"T\", three restaurants/delis close by, shuttle to and from airport and free good breakfasts. The staff were very helpful and friendly. Prices were descent, for Boston. The rooms were clean and well maintained. I'd stay here again if we ever visit Boston again.", "Date": "September 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Nantwich, United Kingdom", "Title": "“OK for the money”", "Author": "SCHu89", "ReviewID": "UR80285304", "Content": "Hotel a little tired and rough around the edges. However if you need budget hotel accommodation in Boston it's not a bad choice, about a 5-7 minute walk to the subway which was OK in the day, we didn't fancy the walk at night which meant taxis were required to get back to the hotel (between $10 to $17 from city centre). Close to a busy Interstate, but the constant noise from the traffic could not be heard in our room. Staff very friendly, couldn't do enough to provide information, and shuttle bus to the airport at $5 each way per person was excellent value. The complimentary breakfast is basic and no-frills but the coffee was OK and available throughout the day.", "Date": "September 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "NSW", "Title": "“Great spot for visiting Boston”", "Author": "CrowNSW", "ReviewID": "UR78515144", "Content": "Chose this hotel mainly because of cost. Very wary with so many mixed reviews, however we were pleasantly surprised. The hotel was very clean, the staff most helpful and the breakfast, whilst basic,was more than adequate. We booked Beantown trolley tickets from the hotel so we were picked up at 8:30am by trolley shuttle and returned from the city by 5:30pm for the 2 days, so didn't need to use Andrew T station. Contrary to some reviewers comments, there are several nearby options for evening meals ranging from the Olive Garden Italian (always very busy) and Applebees (great steak and cod) in the adjacent shopping centre to a more upmarket Italian called 224 at, obviously, 224 Boston Rd, just a short walk away. In our opinion, a great budget location.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Milan, Italy", "Title": "“it's better searching for other hotel”", "Author": "lore77italy", "ReviewID": "UR77683178", "Content": "We stayed fo one night; it rained from the wall all the night and the hotel answer was \"extra towel\"!!!! wonderful breakfast from 6 a.m.; not far from the subway, but in an ugly area of the city.", "Date": "August 31, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Madison, Wi", "Title": "“DONT DO IT”", "Author": "reeds", "ReviewID": "UR77170041", "Content": "spent two nights at this hotel in July. I chose it because the cost was substantially cheaper than hotels near the boston attractions. I also did some research and found out the hotel was near the subway. In fact, the subway is only a few blocks away- not a bad spot, actually. The room itself was very disappointing. The hotel just seemed to be a bit dated, could use a freshen up..I can even live with that, im not the most picky guy..but what I have to say next is TRUE, and I seriously cannot believe it happened. The first night, just getting ready for bed, and I dropped something near the bed. I bend over to pick it up, and I see what looks like a mouse trap. Closer look- yep, a mouse trap. The trap was between the wall and the bed, and the trap was set. NO mouse was in the trap, but I seriously could not believe what I saw. My thoughts were this: Did this hotel have mice? If so, would you really attempt to kill them while paying customers slept in the hotel? What if they caught the mouse, would they risk the chance of a dead mouse be in the trap while customers stayed there? I even thought, maybe it was a prank from the last guests..Probably with that theory is, if it were a prank, certainly the maids would have seen the trap, and taken it away! Of course they would, UNLESS they cleaned the room so POORLY, they didn't even look near the headboard and didnt even vacuum the room! Either way its a LOSE LOSE for this property.. I even sent management an email, explaining the situation..Not even an offer to make it right!? IF this is how the hotel takes care of its customers, well, you can decide. I will NEVER honor another Holiday inn EVER.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "England", "Title": "“reasonably priced, convenient, very helpful staff”", "Author": "cathb2910", "ReviewID": "UR75739215", "Content": "We stayed for five nights. Free coffee throughout the day, plus cookies at 6pm!, free computers in hotel lobby, free parking, breakfast included and the staff were very friendly and helpful with every query. Subway was only 5 minutes walk away - not sure I'd want to walk back very late at night, but we found it was fine at about 9.30pm. Would have liked more choice of places to eat near the hotel - we ate at The Olive Garden (good) and Applebees (not so good) in the shopping centre. Beware - although the address is Boston Street, you can't actually drive into the hotel from Boston Street, much to the annoyance of our sat-nav!! You have to go in through the South Bay shopping centre. Would definitely recommend this as a cheap but adequate hotel to stay - free parking was a real bonus, and it's only 15 mins from Logan airport. Although right next to the freeway, we weren't disturbed by any traffic noise (and our room was about as close as you could get to the road.", "Date": "August 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oklahoma", "Title": "“good value”", "Author": "okfergy2", "ReviewID": "UR75037649", "Content": "We parked our car and took the trains into Boston. The station was within walking distance of the motel. They serve a large breakfast buffet. Parking is free. It is a short drive to the airport. Unless you have to be down in the heart of the city, this is a great place to stay with decent rates for the area. (I made an advance purchase and saved quite a bit of money.)", "Date": "August 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "RLP, Deutschland", "Title": "“Close to the T, clean rooms and free parking”", "Author": "Emilie80", "ReviewID": "UR75025830", "Content": "The Holiday Inn on Boston Street is one of the very few downtown hotels that offers free parking. The Hotel is very close to the Andrew T stop on the red line, walking to the station takes approx. 8 minutes. Breakfast and Wi-fi are complementary as well and the rooms are clean. I will definitely stay there again.", "Date": "August 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good value for price & close to subway and bus station”", "Author": "Lizzyla74", "ReviewID": "UR73329290", "Content": "My husband and I spent three nights here with our five month old. We found the staff to be helpful and friendly. The room was fairly \"no frills\" but clean and comfortable, plus a baby crib was provided at no extra cost. There is a buffet breakfast included, with a simple but varied selection of foods. Coffee is available downstairs throughout the day and also coffee makers in the bedrooms. Although dinner is not available there are several companies that deliver takeaways to the room (pizza from Alfredo's was particularly good). This area of Boston is fairly down market but is close to the airport and just a few subway stops from the city centre (Andrew station on the red line). There's a large general store (Target) nearby plus a supermarket a short walk away. Although it's situated next to the freeway we were not aware of excess traffic noise. We would happily stay here again.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Montreal", "Title": "“Not the most modern hotel, but close to train station”", "Author": "CaziMontreal", "ReviewID": "UR72775809", "Content": "Average hotel, but offers breakfast and is close to train station - app. 15 minutes from Boston Downtown", "Date": "July 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Mansfield, GA", "Title": "“Average but out of the way”", "Author": "Smallwood4", "ReviewID": "UR72300053", "Content": "This is your average Holiday Inn but the staff was exceptional. Only draw back was the location - it's not close to anything except the shopping center next door. It is definately NOT within walking distance to the subway station, especially during bad weather or at night. We ended up catching a cab to get back to the hotel late one night & even then I was scared in that neighborhood at night (hanging out at the Dunkin Donuts until the cab arrived). Next time, I'll spend a little more $ and get closer to city.", "Date": "July 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“great staff and close to everything”", "Author": "soft8800", "ReviewID": "UR72165658", "Content": "The front desk staff of Carol Gutierrez, Sarahi Ayala and Gwen Kimble were very accomadating and helpful. They had happy personalities and were eager to help and assist. The subway is within walking distance.", "Date": "July 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Utrecht, The Netherlands", "Title": "“Good value for money”", "Author": "yumas_nl", "ReviewID": "UR71989907", "Content": "Stayed here for three nights in June. This place offers good value for money; clean rooms, friendly staff and a 5 minute walk to the T's red line, which takes you downtown in only 10 to 15 minutes (about 3 stops).", "Date": "July 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Shellharbour, Australia", "Title": "“Good Value, Better Than Expected”", "Author": "Member From Shellharbour Australia", "ReviewID": "UR71734013", "Content": "Much nicer than expected. Pleasant helpful staff, nice room and very good value for money overall. Reasonable breakfast. Short 5 min walk to shopping and Applebees, and about 10 minute easy walk to Andrew T Station. The area is not overly fancy and while walking is fine during the day, there are not a lot of people around after hours. If you have any concerns, a cab ride at time of writing was $6 from downtown, a small price for peace of mind. They also have a shutte to airport for nominal fare. Overall, excellent value for money and nice place to stay.", "Date": "July 21, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New York", "Title": "“Cheating with the room type”", "Author": "zxcvmnbv", "ReviewID": "UR69773824", "Content": "We stayed 1 night there, I booked and paid in advance for 2 rooms with 2 double beds, and requested connecting rooms since we have teenagers, the ladies at the front desk were very nice AT the beginning, she said the connecting rooms are not avaialable, the best they can do is next or across, with queen or 2 doubles. I picked 2 rooms next to each, and thought they are 2 doubles (my mistake), then I realized I misunderstood. So, I went down and ask to change to the room across (politely), which was empty and have 2 doubles. One of the lady said they already told me there is no 2 doubles available, which I'm sure one choice was 1 queen and 2 doubles. Anyway, her face turned mean & sound nasty, and found a room on the other floor, I told her I need them on the same floor and close to each other, she said nothing is available, so I stay with the queen rooms. I mentioned to her, I booked and paid for the rooms with 2 doubles, which costs more than the single queen room, and she said that is no guarantee. I was so disappointed and would like to share this to everyone. This is the wrost Holiday Inn Express I've ever stayed with.", "Date": "July 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Clemente, California", "Title": "“Great value, free internet, central location, friendly staff...”", "Author": "DJM2320", "ReviewID": "UR69684831", "Content": "My 16 year old son and I stayed 4 nights at this hotel during a tour of universities in the Boston area. The staff was very helpful and friendly, parking was free, internet was free, breakfast included. We were on a two week tour of East Coast Colleges and this was by far the best value hotel we stayed in and the accommodations were as good as some places we stayed that charged twice as much. Convenience to the Andrew 'T' Station made it easy to get around Boston without using a car (though we had one for the rest of our tour outside Boston). I have an 18 year starting at Berklee this fall and will consider staying here again during his move-in weekend/orientation. I've looked for hotels closer to Berklee but all are twice the cost without the frills of free breakfast, free internet and free parking.", "Date": "July 4, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Ashland, Ohio", "Title": "“Good location and price but some disappointments”", "Author": "cbhickey2", "ReviewID": "UR69279566", "Content": "Stayed here for four night while our family vacationed in Boston/Cape Cod. Selected this hotel due to its price, breakfast, ratings, and proximity to the subway station (Andrews - Red Line). Hotel prices (and parking) are very high downtown and this was the closest, reasonably priced ($150) hotel I could find. It was faily easy to get to and parking was free and secure but limited. The parking lot was shared with an adjacent hotel so I guess we could've parked over there if needed. The attached restaurant is currently closed but their is a shopping plaza directly behind the hotel that has an Applebees and Olive Garden. The plaza also has all the big boxes such as Target, Best Buy, etc. I takes about ten minutes to walk to the stores. The subway is near but a little longer than the 5 minute walk they claim. Closer to 10 minutes and the area you walk through is one I wouldn't be in after dark. During the day I felt very safe though. Very easy to learn the subway system and you can get all your passes right at Andrews Station. No problems at all with the entire subway system in Boston. Expected to see many buses too like Chicago and D.C. but they didn't exist at least downtown. The hotel was a little disappinting. The breakfast was very good with a lot of variety but the eating area is small and most days we had difficulty getting a table. They have coffee available all day and night and serve chocolate chip cookies at 6 PM nightly. The staff was very friendly and helpful with suggestions. Housekeeping was also responsive to any request we made. The room itself was not the greatest. It did have a fridge which was nice and the beds were large for doubles, almost queen size and very comfortable. The two problems I had was even though we had four people in the room they were very stingy with the bathroom towels and nightly we had to call housekeeping for more. One day they left a single wash cloth for four people to use! The main problem I had with the room was a mouse evidently was staying with us too as one night it got into our snack bag and had a field day. I informed housekeeping of this and they said they'd tell the front desk about it but nothing ever became of it. We secured everything from then on inside a lock suitcase. The bathroom was a little rundown and even had a hole in the baseboard where I presume the mouse family was staying. Maybe they were taking our towels?? But overall I'd recommend this hotel due to its price and location but would suggest you look around a little more. The hotel adjacent to this one look better and I think it was only $10-20 more per night. I'd probably stay there next time in town. Being near a subway stop is very important though as driving and parking in Boston is impossble. Boston and Cape Cod are great places to visit and we had a good time. Four days is plenty to see everything. The Freedom Trail in Boston is good but be aware most buildings along the way require a separate admission. Fenway Park was very good and be sure to spend time at the harbor.", "Date": "June 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Jersey City, New Jersey", "Title": "“Fine, convenient choice”", "Author": "NewportJC", "ReviewID": "UR69223096", "Content": "No complaints. The room was clean and comfortable. The hotel is right off the highway and has plenty of free parking. There's a \"T\" station a 10-minute walk away to get to downtown.", "Date": "June 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "DUBAI", "Title": "“Convenient Hotel to attend conferences & exhibitions at Convention center Boston”", "Author": "PRATHAPA", "ReviewID": "UR68399242", "Content": "Clean , value for money and convenient hotel, to attend conferences and exhibitions in Boston Convention Center. Hotel has shuttle to airport and convention center makes it very convenient for traveller attending. I stayed all the thrre times I visited BOSTON SEAFOOD SHOW", "Date": "June 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Santa Barbara, California", "Title": "“Now this is a bargain!”", "Author": "DCAlexander", "ReviewID": "UR66984421", "Content": "I looked at alot of hotels in Boston and went out on a limb on this one, but it paid off. The price was amazing ($112), the location perfect, and free parking and breakfast to boot. We had no complaints at all. Sure the furniture was a bit forlorn and ragged, but who cares? It was clean, quiet, friendly, and close to downtown. The only downside was that it was hard to get to, but after the first time that's not an issue.", "Date": "June 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“I was very impressed with the quality and friendliness of the service.”", "Author": "bdonick", "ReviewID": "UR66840694", "Content": "Everyone we met at the hotel was very pleasant and helpful, but we were extremely impressed by Carol Gutierrez who managed the front desk. She was very busy but made everyone feel that she was doing her best to insure that they would be well taken care of.. When we had a problem with our room, she quickly resolved it and was also helpful with information about traveling in the area.", "Date": "June 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cortlandt Manor, New York", "Title": "“SUPERIOR SERVICE”", "Author": "dianedee23", "ReviewID": "UR64279204", "Content": "Checkin was prompt and hassle free! Needed 2 double beds, but hotel was booked and instead of giving me a hard time, GINA COLON, at front desk went out of her way to accommodate me. She was fantastic! Again, asked the front desk for a good seafood restaurant and SARAHI AYALE, went the extra mile and called the UNION OYSTER HOUSE (BEST SEAFOOD EVER) to get directions and parking and printed me a copy of the driving directions. The room was clean, comfortable beds and FABULOUS BREAKFAST. A MUST STAY IF IN BOSTON!!! THANKS AGAIN TO GINA AND SARAHI at front desk for all their help. You made my Boston trip memorable.", "Date": "May 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "South Carolina", "Title": "“Clean Room but no frills”", "Author": "ModerationForMe", "ReviewID": "UR63798672", "Content": "A colleague of mine picked this hotel. We were meeting in town, so we had to commute via two trains. The commute wasn't too bad, and the walk to/from Andrew Station seemed quite safe, even at night. I took the hotel shuttle from the airport which was also convenient and a good bargin at $5. My main complaint would the exercise room. It had the basics, but one treadmill did not work, and only a short person would be able to use the stair master without his/her head hitting the ceiling. There was a water boil order while I was there (this was not the hotels fault -- the entire city of Boston and neighboring communities was without safe water). They did have a sign mentioning it, but no notice in the room, and no bottled water was offered.", "Date": "May 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Saved me a bundle”", "Author": "kenpoguy", "ReviewID": "UR61102590", "Content": "I used to stay in other 3 star or 4 star hotels in the past, mostly reserved from Hotwire. The problem with that is you never know the location or name of the hotel until its too late. This time I booked it through Priceline and I knew ahead of time which hotel I would be staying at and was also able to find out its amenities before booking my room. And I must say, I have not been disappointed at all. The service was great and prompt. We were upgraded to a bigger room at no cost. The condition and cleanliness of the room was no better or worse than the other hotels I've stayed in the past (Double Tree, Crown Plaza, Radisson etc). The lobby and the reception area are very modest. They did have free Internet services from the lobby, which was great for the kids when they'd get bored while waiting for us in the lobby. The location of this hotel was another reason we decided to stay there. It was 5 minutes walking distance from the Red line (Andrew subway station). I do not like to drive in unfamiliar cities, especially when I have to visit several locations and places. The unfamiliar traffic patterns and parking are too much of a hassle. Granted that there are other hotels also with this convenience, but they mostly located in the downtown areas where the rates would be double or triple what I paid here. The best thing about this hotel was the free parking and free breakfast, neither of which I had experienced before. With two growing kids and 2 adults, these amenities save me about $80 a day. (Most hotels charge about $25 to park the car a day). There was free wireless Internet throughout the hotel. This was not as fast as we are accustomed to. The Internet speed was about 1 Mbps. But it became better later at nights (when there was less network traffic). What this hotel lacked was a gym, a swimming pool and a restaurant. But we did not miss any of these, as we never used any of these amenities in other hotels we stayed at anyway. All in all, I definitely recommend this hotel and will definitely stay here if I revisit Boston in the future.", "Date": "April 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Rochester, New York", "Title": "“Disappointing for Holiday Inn Express”", "Author": "AntsInMyPantsDE", "ReviewID": "UR60111082", "Content": "I was really disappointed by this Holiday Inn Express. I'm usually really happy with the chain, but found this Boston location to be drab and with a mix of good a bad service. The Marriott next door was actually a little cheaper and all around nicer. From when we checked in, we found the attendant to be unhelpful, unfriendly and even stubborn. When we got to our room, we saw how rundown the place was. The doors and furniture were chipped, dirty, sticky and there was a bad odor that was mixed with a cleaning product smell. Breakfast staff was also mopey. We were told about a 'complimentary' shuttle and when we went to use it, found out our room would be charged. That all being said, we did find our other staff encounters to be pleasant and helpful during the remainder of our stay. The walk to the subway is very short, and the hotel is right off of the highway, which makes it rather convenient. The neighborhood setting is nothing too nice, I'm not sure I would be comfortable walking to the subway stop alone as a young woman dressed in business attire.", "Date": "April 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Would definitely stay again”", "Author": "alocin42", "ReviewID": "UR59118459", "Content": "My sister and I stayed for three (very wet!) nights in March and given the washout the hotel was the best part of the trip. Until recently we would have stayed in hostels or cheap B&Bs as students but now we're both working we can afford to splash out a little more, and you can definitely notice the difference! The hotel is located 10 mins walk from Arthur Metro station on the red line which is only a few stops down from South Station and the centre of Boston. It's close to an expressway but we didn't find noise a problem. The rooms were large and clean, the beds comfortable, the complimentary breakfast was very good including a range such as cereal, toast, eggs, bacon, muffins, very yummy cinnamon rolls. There was always coffee available in the lobby as well as to make in your room and at 6pm each night they produced freshly baked cookies! There was a washer and dryer in the basement with free washing powder which was very handy when all our clean clothes got drenched and staff were happy to help change our money into quarters. We had a very pleasant stay despite the weather and I would definitely recommend this hotel to a friend.", "Date": "March 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Franconia, New Hampshire", "Title": "“GReat park, sleep, fly deal”", "Author": "Hoot06", "ReviewID": "UR57249375", "Content": "just bring ear plugs if you need quiet to sleep as the walls are pretty thin. Other than that this was a great experience. Shuttle was quick, car was fine, hotel was clean, it's very close to Logan, and the staff was very helpful and efficient. Easy to get to - right off the highway.", "Date": "February 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Chicago IL", "Title": "“Diamond in the rough”", "Author": "libboy", "ReviewID": "UR57141016", "Content": "I attended a conference at the Boston Convention and Exhibition Center and took the subway every day. The Andrew stop on the Red Line is only a short walk away. Be sure to purchase a \"Charlie Card\" to save on transportation costs. Even though I was there for only four days I saved several dollars using that \"Charlie Card\". When you get off the subway and approach the hotel you may wonder if the neighborhood is safe. That feeling soon went away for me as I had no worries for my safety. The hotel overlooks South Bay mall which has just about every suburban big box store you need -- Target, Best Buy, Marshalls, and others. The hotel is clean and staff friendly. Breakfast wasn't real healthy but tasty and free. Internet access was also free in the lobby and in the rooms. I would return in a heart beat especially after having saved a ton of money at this hotel compared to the downtown hotels.", "Date": "February 26, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Good Hotel”", "Author": "Abhishekca1", "ReviewID": "UR56992872", "Content": "It is a very good hotel near the metro station. They also provide a pick & drop facility to the city centre & down town.", "Date": "February 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Melbourne", "Title": "“Save a bucket by staying at this hotel”", "Author": "letyoursoulglo", "ReviewID": "UR52882227", "Content": "We stayed here for three nights after reading Tripadvisor and noticing that it is a short walk to the train. We are very glad we did. The hotel staff were very helpful and friendly, especially when the room they initially put us in stank of cigarette smoke and I requested a new room - they obliged immediately. Free wi-fi here and free cookies - nice touch. Internet terminals were a little slow, but big deal. The breakfast was fine with different options daily and the subway station was only a few stops from the centre of town. Our room was fine, no issues there. There is also an enormous outdoor mall next door with eating options and shopping so you don't want for anything (no restaurant on site). Stay at this nice HI Express and save downtown prices - you won't regret it!", "Date": "January 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "north adams ma", "Title": "“Already looking forward to the next stay!!!!”", "Author": "jadiejen", "ReviewID": "UR49186416", "Content": "Although our stay was only one night and we spent very little time in the room other than sleeping, I feel the need to review this great hotel! The staff was friendly, the hotel was clean and well decorated and our room was gorgeous! My husband and I were both pleasantly surprised by the high quality comforter and pillows on the bed. I hate the ususal cheap wool blankets that most lower priced hotels/motels use. The bed was comfortable and I slept great. I didn't even have to use my own pillows that I ALWAYS travel with. The continental breakfast was delicous and well stocked (even though we came out less than an hour before breakfast hours ended). The cinnamon buns were even better than described in other reviews. I even took one for the road. I am very much looking forward to staying here again in the future for a longer stay!!! We also enjoyed the free parking and high speed internet. The only things I can criticize are the lack of swimming pool and the peeling ceilling in the corner of our room. However, nothing to keep me from coming back time and time again. Great job Holiday Inn Express Boston!!!!", "Date": "November 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Dundee, Scotland", "Title": "“Take a subway ride away from the expensive city centre hotels and be surprised.”", "Author": "MissyMac78", "ReviewID": "UR47355743", "Content": "Just a 3 station stop from Boston city centre on the underground and a 6 mins walk (timed) and you will find this smashing hotel. From the outside it looks rather dated and the surrounding area is a mixed bag. But don't be judgemental, inside the reception area is roomy, bright and well laid out. Staff are polite and very helpful. Reasonably priced ($5) minibus service to Airports etc. Free parking is a bonus so near the city. Leave your car and travel by an easily understood underground system. Remember to buy a Charlie ticket ~ great value! Breakfast is adequate with a wide variety offered ~ cheap orange juice was off putting though. Rooms are clean with comfy beds and fairly roomy. The bathroom is poorly laid out especially around the sink area which is a nuisance. However, it is the price and convenience and the good atmosphere which makes this hotel to seriously consider when visiting Boston.", "Date": "October 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Berlin, Germany", "Title": "“Decent hotel, close enough to city center for reasonable price”", "Author": "Frunobulax", "ReviewID": "UR46866699", "Content": "Although a little shabby from the outside and located between a highway and a shopping mall, the hotel turned out to be a good choice to stay close to the city center (10 minute walk to the subway which takes you to the center in 5 more minutes) for a reasonable price. However, the hotel is located a few miles south of the city center so it is not near to any of the nightlife districts. The room was clean, not too small and quiet (even though the highway was pretty close you couldn't hear it), the hotel has a huge parking lot with free parking for guests, there are two restaurants (Olive Garden and Applebees) in the mall nearby and the breakfast was OK (a typical american breakfast). The staff was always helpful.", "Date": "October 14, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "UK", "Title": "“Terrific Value”", "Author": "DavidPooleDorset", "ReviewID": "UR46488010", "Content": "Four of us stayed overnight. Staff efficient , courteous and friendly, particularly Gina on front desk on morning of our departure. Facilities good including 24 hr coffee, tea etc. The room was clean with coffee making facilities, fridge, TV, microwave, hairdryer, iron and ironing board. Beds comfortable! The price included breakfast - more than adequate and parking (so often extras in Boston) The hotel was within 10 minutes walk from the train station making it easy to get into the City centre. Only criticism is that hotel cannot be accessed by car from Boston street so sat nav not usable and finding access a bit tricky. Would certainly use hotel again", "Date": "October 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Quebec", "Title": "“great service at a great price”", "Author": "Jr61_ca", "ReviewID": "UR43106106", "Content": "We were 3 couples that stayed at this Hotel on september 10, 2009. Service at the front desk was excellent. (Special thanks to Carol G.) In fact all the staff were great. As others had mentioned, the outside could use a coat of paint. But the inside was very clean, The breakfast area was very convienient. We took the train(subway) which was about a 15 minute walk. We were downtown in no time. That evening we walked down Boston street to an Italian restaurant (recommended by front desk) It was great and at no time did we feel like we were in any danger. We will stay at this hotel on our next visit to Boston.", "Date": "September 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "aberdeen", "Title": "“Good Value For Money - Excellent Breakfast”", "Author": "dferguson", "ReviewID": "UR42833747", "Content": "Stayed there for 3 nights recently. Approx 3 miles from downtown which is easily accessed by underground train from nearby station. Rooms a good size and very clean. Service very good and the breakfast excellent. Coffee and tea available 24 hours a day. Staff very pleasant and helpful at reception.", "Date": "September 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Maine", "Title": "“Great value, Great staff”", "Author": "SamuelAdamsMaine", "ReviewID": "UR39040797", "Content": "I have stayed at this hotel twice this year; each time, the experience was great. Sure, it's great that it is located two blocks from the T station and yes, it is rather convenient that there are stores and restaurants within walking distance. But the biggest perk to staying at this hotel is the people who work there. They are the friendliest and the most professional. They take pride in what they do and they are there to make your vacation enjoyable. Each morning, the Continental breakfast area was always well supplied and kept VERY clean. I am being serious when I say that the employees here take pride in what they do. The front desk people were charming, conversational and helpful. They answered any and all questions I had and they were a joy to work with. I will continue to book all of my stays here at the Holiday Inn Express when I travel to Boston. Mind you, I am not the type of guy who writes reviews; in this case, I feel the need to because everyone there deserves praise for a job well done.", "Date": "August 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“Great budget hotel”", "Author": "HolidayJunky007", "ReviewID": "UR38747661", "Content": "I was pleasantly surprised on arrival, the room was large and kept clean. It was sufficiently far enough away from the main road not to cause a nuisance at night and the staff were very helpful. Breakfast was buffet style so busy periods were hectic essentially if a coach party was in at the same time. It is located some way out of town so the Andrew Subway station across the bridge came in very handy, it was relatively cheap for a weeks ticket. I would recommend this hotel to the budget traveller and would stay there again.", "Date": "August 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York", "Title": "“What a great place to stay!!”", "Author": "Not_a_happy_traveler", "ReviewID": "UR38672733", "Content": "I cannot recommend this hotel highly enough - this is the second time I've stayed there and had the most wonderful experience!! The staff is incredibly polite, helpful, efficient and friendly; it's located two blocks from a T station, a short hop to Downtown Boston, there are three great restaurant's nearby (Appleby's, Olive Garden and Bickfords) all reasonably priced, a shopping mall a block away with everything you could want, they serve a Continental Breakfast with everything you could want, they're wifi enabled... There was a microwave and fridge in the room and we definitely made use of that!! I'll certainly be happy to stay there again and know I'll be just as happily satisfied!!", "Date": "August 24, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "1", "Rooms": "3"}, "AuthorLocation": "Newfoundland", "Title": "“Too far away”", "Author": "Sharpay10", "ReviewID": "UR37694855", "Content": "Stayed here for 1 night in July. Rooms are small and run down. This hotel is located outside downtown Boston and is priced accordingly. It is located next to a bunch of stores and a couple restaurants (Applebees and Olive Garden) as well as a Target and Old Navy and other stores which are all in walking distance. We traveled from the South Station to hotel and back by taxi. It was too far removed to visit the downtown attractions in the time we had. Next time we will pay the extra $ to be closer to the city.", "Date": "August 14, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Bristol", "Title": "“Not memorable, and overpriced”", "Author": "chappers29", "ReviewID": "UR36291650", "Content": "I stayed here for 6 nights while in Boston for the marathon in April 2009. THis is a peak time for hotels in Boston, so perhaps prices go up. But still, I think we paid $170 per night which for a hotel of this standard was very poor value. The hotel is right next to a busy highway and unfortunately our room was the closest possible to the road. This meant a lot of noise, and interrupted sleep.`Not great preparation for the marathon. The nicest thing about the hotel was the other guests, particularly those staying for the marathon. Nice camaraderie. Breakfast was poor, but it often is in the USA. I love travelling to the States but hotel breakfasts are usually so mean and functional. Location was poor too. It was about a 10 minute walk to the local subway. There is a local shopping/retail park with a supermarket, a couple of restaurants and some electronic goods shops. It's generally a rather run-down area. In retrospect we should have paid a bit more and got somewhere nicer in the city centre. That said, during marathon week these hotels go for $250-$300 a night. A good alternative would have been to go for a hotel at one of the extremes of the subway system i.e. gone right out of town. Probably a lot cheaper and more pleasant than this. I wouldn't say don't stay at the HIE, but I would say don't stay for 6 nights! I reckon 2 is a good maximum.", "Date": "July 31, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Shelton, CT", "Title": "“Another Overnight while at BCEC”", "Author": "oldfashionedvalues", "ReviewID": "UR36239486", "Content": "Convenient to BCEC via access road, avoiding South Boston Mess. Shuttle charge instituted after reservation made, no exception made for fee, boss was pissed. This was the original deal maker on pricing versus others with BCEC parking costs. Hotel next to shopping center and two chain restaurants ,so no journeys into unfamiliar territory needed to eat or buy last minute supplies. Free HIE breakfast good, enough protein for low carb dieters, decent cup of coffee too, 24 hrs. Boss liked free cookies at night. Internet service dependable, cell phones (Verizon & AT&T) worked well there. Parking at a premium.", "Date": "July 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Ontario, Canada", "Title": "“Would definitely go back!”", "Author": "funnurse", "ReviewID": "UR36075042", "Content": "Travelled to Boston last week and stayed at the Holiday Inn Express with hubby and our 3 kids. It was great! Price was right, rooms clean, staff wonderful and the complimentary breakfast is wonderful. They serve the usual toasts, bagels, cereal, coffee, juice, milk but also some hot foods, selection varies from day to day. We had bacon, cheese omelets, biscuit sausage gravy. There were also bananas, yogourt,english muffins, etc. A real nice place to go. Don't worry about the outside peeling paint, it doesn't reflect the inside. Also, this hotel is right next to shopping (same parking almost) there's a target, old navy and other stores right next to it as well as Applebee's and Olive Garden. Just wish there was a pool and it would be perfect but we'll be back notheless!", "Date": "July 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Cork", "Title": "“Shuttle service big advantage”", "Author": "Ariii", "ReviewID": "UR35968069", "Content": "We spent 3 nights in this hotel. I travelled with my husband and 2 adult childrenv (19 and 22) We flew into Logan to start our trip to US - The shuttle service to and from the airport is an excellent service, - door to door service $5 very handy. This hotel is very reasonable. The staff were really helpful and very pleasant. Alot of choice for breakfast. My son and daughter were very impressed with the free internet access. Andrew Station is only a short few minutes walk, just 2 or 3 stops into Boston.A member of staff recommended the \"224 Restaurant\" for an evening meal. This restaurant is only a few minutes from the hotel and we were made very welcome by the staff and enjoyed a beautiful meal. No problem storing suitcases free of charge the day we were checking out. Only negative commnet - we arrived on Fri evening for 3 nights - told breakfast was from 8 -11 but failed to tell us that on mon it is 7 -10 so we missed out on breakfast on the final morning. Reception didn't have any influence so couldn't organise a breakfast for us at ten past ten. Although when all is said and done I would still recommend this hotel.", "Date": "July 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Greene, maine", "Title": "“Excellent Customer Service, easy access to the T, economical, friendly”", "Author": "armymomME", "ReviewID": "UR35764104", "Content": "Our 1 night stay to send our daughter off to Basic training was made so easy with the friendly customer service, helping w/directions and suggestions for walking. The room was clean, breakfast sufficient, and other guests were friendly and sharing of the lobby computers. Access to the T was an easy walk and our early morning 2 mile walk to the Federal building on Summer St was done without trepidation. It was also an easy access from I-93 S. We will stay here again to visit Boston.", "Date": "July 25, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "2"}, "AuthorLocation": "stockholm", "Title": "“a great average hotel in bostopn johnb.”", "Author": "swedenman", "ReviewID": "UR35762702", "Content": "hi i stayed at the holiday inn south boston for one night june29 i had a a stop over in logan airpp. to and i booked on logan airport via courtesy phonecalls . great the hotel is a bit far and the location is not so great besides the big highway . but anyway its a great average holiday inn hotel the staff was helpful and they were nice its kind of worn and little bit run down but anyway ok . ok for a night stay even a great hotel. from . fr johnnyb.", "Date": "July 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Toowoomba, Australia", "Title": "“Definate Recommend”", "Author": "Aussie-traveler-04", "ReviewID": "UR35625620", "Content": "We stayed here for 3 nights and found it to be the best motel of our month in the US. It is not the newest, but the facilities are great, the rooms big, the motel is quiet, staff friendly, next door to a large shopping centre, 200m to a train station, although we used taxi's as it is a $8-10 fare to most of boston. the cookies they bake at 6pm each night are yummy, there are 3 restuarants right next door. I guess the best thing after a large number of the motels we stayed at had poor service was the staff actually smiled and laughed and appeared to like working there.", "Date": "July 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Belgium", "Title": "“Nice hotel, too far from city center with children”", "Author": "NathDC", "ReviewID": "UR35578395", "Content": "First the good news: the hotel was very clean, the breakfast was excellent, especially with the kids! And there was the South Bay Shopping Center right next to the hotel, this was really great because the stores were open late. The staff was OK, but we especially remember one lady who was there every morning at breakfast and who was so nice to our kids (they're only 2 and 4, but they still remember her saying \"Yummie in the tummy\"). She made our stay there extra special! One thing we didn't like was the fact that this hotel was pretty far from Boston's center, we had to take 3 trains to get there and with 2 strollers and sometimes no elevator (or very dirty and smelly ones) we did sometimes regret not getting more info about the location first... But if you want a good ,clean and not too expensive hotel and you have no children, then why not?", "Date": "July 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York, NY", "Title": "“Great choice”", "Author": "Latvian83", "ReviewID": "UR34795566", "Content": "I went to Boston for a one week vacation with my wife and we settled in Holiday Inn Express at 69 Boston street. I chose the bank after reading its many reviews. We like the hotel very very much for the following reasons: - The rooms are really nice, spacious and clean. - The staff are really great and friendly, especially the front desk people and they tell you what you need to know about the hotel and its amenities. - The breakfast is served everyday between 6-10 AM on weekdays and between 7-11 AM on weekends and it's such a nice Continental breakfast although it needs more varieties. - They have a complimentary coffee in thermoses all day long and they serve complimentary cookies at 6 pm everyday. - The rooms are provided with Free Wireless internet. - The hotel provides $5 shuttle service to Boston Logan Airport which leaves at the top of the hour. - The location of the hotel is really convenient. It's only 10-15 minutes, walking distance, away from Andrew station and the red line. - The hotel is situated next to The South Bay Center which has all sorts of shops that you need in your everyday shopping which includes: Target, Home Depot, Old Navy, Stop and Shop, Applebeas, Olive Garden, Best Buy, Bank of America. - The only thing I didn't like about the hotel is they have one washer machine only located in the basement and it costs $2.", "Date": "July 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "IL cornfields", "Title": "“Excellent value, safe choice.”", "Author": "Junebug327", "ReviewID": "UR32315578", "Content": "I spent a lot of time reading reviews of other hotels in the Boston area and was almost worried about why this hotel was so inexpensive compared to others. We booked anyway, thinking we would deal with discomforts in order to save a bit of money. There was no need to worry. The staff was cheerful and friendly. The room was very clean and attractive. Within a few minutes walk we were able to choose between an Applebee's and an Olive Garden. The breakfast provided for free the next day was not bad, either! It made a great base for adventure.", "Date": "June 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Manchester, England", "Title": "“A little Gem”", "Author": "wallcova", "ReviewID": "UR31936676", "Content": "We have stayed here before but are really please with this hotel. It is clean and the staff friendly. It is only two stops out from the centre of Boston on the Subway so is easy to get to and a samll prcie to apy for how much cheaper it is than the downtown hotels. The brekafast is also a very welcome one. I cannot than k the staff enough for all the help they gave us while we were there. The only thing I would recommend is a refurbishment of the outside as it is looking a little tired and is not a good reflection of the interior of this express Holiday Inn", "Date": "June 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Wyoming, RI", "Title": "“Well worth it!”", "Author": "JanetCWyoming_RI", "ReviewID": "UR31214167", "Content": "Stayed here May 29&30 for DMB at Fenway. Hotel was a great value for the price. Needs outside paint; however, the interior is fine. A short walk to the Red line which can get you to anywhere you want to go in Boston. The area is a bit run down, but we never once felt unsafe, even when returning to the hotel near mid-night. Having a refrigerator and microwave in the room plus a free breakfast buffet was nice. There is a shopping center a five minute walk with Stop&Shop, Target, Olive Garden and many more. If you make your reservations well in advance of your stay, save the hotel as a favorite, and check pricing often. I made my guaranteed reservation in March for this stay, and I reduced the daily base price from the original $144 per night to $104! The rates change often, so check as often as possible. By the time we stayed here, the prices were up to $156/night, but I had locked in at $104. Basically, we stayed two nights for less than one night closer to Fenway, but were totally satisfied. Also, if you stay here and go to a game at Fenway, return via the Fenway stop on the Red Line; you will most likely get a seat. If you return at the Kenmore stop, you are most likely going be standing in a crowd. Still worth taking the T for the savings!", "Date": "May 31, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Wexford, Ireland", "Title": "“Goog value hotel”", "Author": "paudbrowne", "ReviewID": "UR30025854", "Content": "We stayed in this hotel for the Boston Marathon in April and really enjoyed our stay. The area the Hotel is in looks quite rough at first but we felt safe there even at night time. The train station is 10 min walk from hotel. From there it is a 10 min train ride to the city centre. The breakfast was very good with a nice selection. The rooms are adaquate size. There is a shuttle bus to the airport at $5 per person which is very handy. Over all a good value hotel with easy access in the main attraction of the city. We all also found a nice restrauntant on Boston St. (actually the hotel receptionist recommended it to us). When you come on to Boston St. from the hotel turn right and it is about 4 block up on the right left side. We also enjoyed a few beers in a pub opposite the train station again it looks a bit rough but we felt comfortable there.", "Date": "May 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Miramichi, NB", "Title": "“Great value, and terrific service in a nice, clean hotel.”", "Author": "rhodar", "ReviewID": "UR29788814", "Content": "We arrived in Boston just after 11 am, after driving all night, and, even though check-in time is not until 3 pm, we were allowed to have our room right away. The desk clerk was more than helpful, even suggesting that we help ourselves to something from the breakfast room before they finished putting the breakfast bar items away. The price was very reasonable, the room spotlessly clean and very comforable, and the location was good - just a few minutes walk to Andrews Square subway station. The included breakfast was delicious, with lots to choose from, including hot sausage patties, eggs, and wonderul biscuits. The coffee was excellent, and the dining area was impeccable and well stocked, even with dozens of patrons taking advantage of the breakfast buffet. The attendant was very pleasant, even while she was very busy keeping up with restocking the selection of breakfast items. Checkout was a breeze, and we even got help with mapping out our route. Oh, and free parking in Boston? What a bonus! Great job Holiday Inn Express!", "Date": "May 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Seattle", "Title": "“Good option for hotel near airport”", "Author": "EasyGoingTraveler77", "ReviewID": "UR27863745", "Content": "Stayed here just 1 night so I could catch an early flight the next morning. Everything was just fine - a basic Holiday Inn. Good value. Note that their shuttle to the airport does fill up at peak hours, so you may not be able to use it.", "Date": "April 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "California", "Title": "“Friendly service, convenient location”", "Author": "Maddie_RB", "ReviewID": "UR27796481", "Content": "It may look a little run down from the outside, but it's very nice and clean inside. The rooms were spacious, has a little fridge and microwave. I don't know when the hotel has gone all non-smoking, the original room we were given smelled heavily like cigarettes, so they changed us, but there were still some subtle smells. It's a 5 minute walk to the Andrew subway station on the Red line, one can get to/from Logan just by using the Red and Silver line (change at South Station). Very convenient location.", "Date": "April 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Scarsdale, New York", "Title": "“Would definitely stay there again!”", "Author": "Chia33", "ReviewID": "UR27786299", "Content": "Let's see... nice room with comfortable beds and a microwave (though the bathroom is a little small). I had made a mistake and double booked but the GM corrected it for me with little hassle. Very good breakfast, with sausage/omelet/bacon and lots of other stuff! The location was fine; we drove and it was very convenient with plenty of parking. Definitely enjoyed my stay there.", "Date": "April 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "NYC", "Title": "“Pretty Good”", "Author": "fireball50", "ReviewID": "UR27058564", "Content": "For the price I paid ($109) in Boston, it was good. I will definitely stay here again. Pros: Free Parking - The best part about this hotel because Boston city parking is horrible. Park the car here and take public transportation. Free breakfast - Menu options were very good (hot and cold choice selections) and plenty of space in the dining area. Free wifi internet - Slow at times but overall great. Excellent service - Front desk was very professional and will answer any questions you have here. Cons: Beds are not the best, not very comfortable but it was clean. Door is a lil flimsy and cannot block all the noises in the hallway. Bathroom is on the cramped side. We requested extra towels and they were quick on getting them for us. The walk to the public transportation is a bit on the \"shady\" side. Not the best neighborhood.", "Date": "March 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "MelonPicklesMayo", "Title": "“Excellent hotel!”", "Author": "MelonPicklesMayo", "ReviewID": "UR22790747", "Content": "My husband and I have stayed at many hotels, including 4 and 5 star hotels. I have to say that the Holiday Inn Express Boston (a 2 star) was one of the best, if not the best, hotel we've stayed at. The room was large and came with a microwave and fridge (plus TV). The hotel was clean and quiet, the beds were really comfortable, and the hot breakfast, high speed internet, and parking were free (unheard of in Boston) too! The rate, booked through Priceline, was also incredibly reasonable. STAY HERE IF YOU'RE IN BOSTON!!!", "Date": "December 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "2", "Rooms": "4", "Location": "1"}, "AuthorLocation": "westfield", "Title": "“TV's Don't Work?”", "Author": "xdanixo", "ReviewID": "UR22133006", "Content": "My boyfriend and I wanted to stay the weekend in Boston, so we booked at Holiday Inn Express. Its pretty much down a shitty street, we drove by it 3 times and finally found it. The inside was just renovated and we got a room on the second floor. The tv;s didnt work so they gave us another room with a view of the TD BankNorth Garden. It was a nice hotel, except when the bars let out. It was wayyy to loud outside. I wouldnt recommend that side of the hotel. But they breakfast was nice, and theres a parking garage right across the street. Nice walk to Quincy Market..Not far at all.", "Date": "November 24, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Connecticut", "Title": "“A Great Deal”", "Author": "HikermanCT", "ReviewID": "UR21679676", "Content": "A great deal for a hotel close to Boston. We paid less than $100/night for a very nice, clean, comfortable room; the cost of the room included a great breakfast buffet (eggs, bacon, sausage, French toast, English muffins, fruit, etc). The front desk people were extremely helpful and friendly. The T (subway) station is less than a 10 minute walk and in 3 or 4 stops gets you into the center of the city. The neighborhood for most of the way between the hotel and the T station is quiet and well-kept, but the block right around the station was a bit run down. We walked several times, including a late-night walk back to the hotel and had no problems. We would definitely use this hotel next time we visit Boston.", "Date": "November 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dallas, TX", "Title": "“Great Choice”", "Author": "BethanyinDallas", "ReviewID": "UR21568080", "Content": "We stayed here for 3 nights while sightseeing in the Boston area. Great location for the price, close to the metro, free parking, decent breakfast buffet, free internet in the lobby. The front desk personnel were extremely friendly and helpful. I loved the toiletries provided in the room. Nothing luxurious, but that wasn't our expectation when we booked it. It was a pleasant stay. Would definitely stay here again.", "Date": "November 5, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Boston Tea Party”", "Author": "KatyFearn", "ReviewID": "UR20540857", "Content": "This hotel was the first we stayed in on our trip and we knew at least that it was good, clean and supplied us with a buffet Breakfast to start us on our way. We were recommended this hotel by an ex-collegue of my partner's who had stayed here the previous August. The room provided everything we were looking for and was comfortable- a good nights sleep after a day of sight seeing. The breakfast was a buffet with a good selection of muffins, toast cereals and some hot items like bacon and sausage gravy (a mystery to us scots!). If you have a car when in Boston, this hotel offers a car park and is just of the I-95. The only reason I might not rate this hotel more highly is that if you plan to use the subway, it is 10 minutes away and the surrounding area is not one to hang around in after dark. The subway does attract people to it and they seem to hang there after dark. Would not recommend people walk in the area alone at night. However, another positive, well for all you shoppers (me and not my poor partner) there is a large retail park located directly behind the hotel with a good selection of shops, restaurants and a supermarket.", "Date": "October 1, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Wrexham, United Kingdom", "Title": "“Best Value Boston Hotel - With Free Parking!!”", "Author": "SteveHammer", "ReviewID": "UR20087683", "Content": "If you want a reasonably priced, clean hotel, with free parking and easy access to a subway stop this is it. The hotel is situated about a 5/10 minute walk from Andrew Station. Although you wouldn't class the area as upmarket it certainly seems safe enough. We walked back and to to the station both in daylight and at night and never felt unsafe at all. In fact we hardly encountered anyone.Trains run regularly into Boston from here and we never had to wait more than five minutes for one to turn up. The hotel backs on to a shopping strip with Target, Old Navy, Famous Footwear etc plus an Applebees. All the staff we encountered during our stay were very friendly, cheerful and helpful. Actualy I dont think I've stayed at a hotel where \"all \" the staff were this nice. Good selection of breakfast items. They could do with a couple of extra toasters though as it did get a bit busy at times. The rooms are your typical Holiday Inn rooms. We were on the fifth floor and had a great view of the Boston skyline. If you're going to Boston and are taking a car this is an excellent choice for the free parking alone, PLUS, It'll only cost you about half the price of a city centre hotel.", "Date": "September 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Fort Lauderdale", "Title": "“Holiday inn Express stay”", "Author": "tab00007", "ReviewID": "UR18262262", "Content": "We needed an affordable place to stay while in Boston on our vacation. This was one of the most inexpensive places near Downtown Boston. The parking was free which is a huge plus in the area. Many hotels were charging a lot of money for parking. It was a short walk to the train station to get to downtown. For the location and price the hotel was great. Many hotels were charging 150 bucks for the same night and just down the street. This was a great deal on the hotels website. In regards to some other comments mentioning the area of the hotel I did not mind the neighborhood having to walk to the train. I guess in the evening it could be a differnt story.", "Date": "July 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kentville, Canada", "Title": "“Great hotel”", "Author": "lseamone", "ReviewID": "UR17313960", "Content": "This is the second time we've stayed at this hotel. I believe it has gone through some improvements since we were here last. It's a great location to hop the subway to anywhere in Boston. We came by car, and parking is free. The rooms are spacious and comfortable. We checked in fairly early and a room was ready. Front counter staff very friendly and accomodating. The breakfast was very good-hot and cold.", "Date": "June 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Georgia", "Title": "“No complaints!”", "Author": "IvyMom", "ReviewID": "UR16888455", "Content": "Great value. Enjoyed our stay. Free shuttle to airport was delayed by a parade; hotel arranged for substitute from another hotel to keep us on schedule. Hearty breakfast, patient, informative staff. Safe & clean. Taxi service was not reliable during our stay.", "Date": "June 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Good Place To Stay...”", "Author": "Traveling_Bruces", "ReviewID": "UR16611192", "Content": "My husband and I stayed here for a weekend trip to Boston. The hotel is close to the subway (red line) which will take you to downtown Boston in minutes. From there, you can walk almost anywhere. This hotel is conveniently close to a mall with a Target, Old Navy, Marshalls, Olive Garden, and an Applebee's. If you are adventurous, you can walk down Boston St. and dine at 224. It was a nice little find for a late night dinner. Very friendly staff and great food. Our room on the third floor was clean and served it's purpose. Somewhere to rest for our next day out and about. The continental breakfast hit the spot for a quick meal before starting our day. We had no complaints about this Holiday Inn Express. The price fit nicely into our budget. We will be coming back to this hotel on our next trip to Boston.", "Date": "June 2, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Washington, DC", "Title": "“OK. Not great, but OK.”", "Author": "thosetwo", "ReviewID": "UR16413139", "Content": "We hadn't been to Boston in quite a few years and were astounded at the prices for downtown hotels. The HI Express was by far the best price we found on a decent hotel, and it is decent: clean, friendly staff, free hi-speed internet, reasonable breakfast. The trade-off is the location. Msgr O'Brien Highway is an industrial strip, a bit dingy, ripe for renewal. We never felt unsafe though and spent a good deal of time walking around that part of Cambridge. The Lechmere T stop is within half a mile and that proved very handy. All in all, a good value.", "Date": "May 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bristol", "Title": "“exccellent value”", "Author": "sallybristol001", "ReviewID": "UR16322218", "Content": "arrived at the hotel by hotel shuttle after leaving drivers licence in a washington hotel so unable to rent a car, friendly staff, complimentary breakfast & tea, coffee & hot chocolate always available during the day. The local Mall was just over the small parking lot with applebees & the Olive Garden restaurants, we used the shuttle to take us to the harbour for a little exploring & the next day bought a 2 day pass to explore Washington on a hop on hop off bus, we were collected in the morning from the hotel & taken to a central point & used the bus to get around the city, there were two stops close to each other (near the start and end of the journey) which would take you back without having to transverse the whole city to get to the final stop, a complimentary harbour cruise was on offer too. We were taken back to our hotel at 5pm, or you can use the subway, a short walk back to the hotel. Free internet access available in the lobby was useful and available for longer than the 10mins stated if there was no queue to use it.", "Date": "May 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Saskatoon, Canada", "Title": "“Great find for Marathon weekend”", "Author": "farmgrl", "ReviewID": "UR15431528", "Content": "Our party of 3 stayed for 4 nights during Marathon weekend at the HI Express. The hotel was full with many marathoners from other parts of the world also staying here. The halls were very quiet at night! Just like other reviewers have mentioned - the staff was friendly and helpful, buffet breakfast was all we needed to get going in the morning, access to the T was quick and easy, rooms were clean. The staff also accomodated it's marathon guests by having breakfast at 5:00 a.m. (2 hrs early) on race day. The whole experience was positive except that we had to have a smoking room and the windows don't open. I am still airing out the suitcases! All in all we felt this hotel was a great deal in comparison to other places ( I discussed this with other spectators on race day). I too spent days researching on TA to choose this hotel.", "Date": "April 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“A great budget find in Boston”", "Author": "gustavsnarp", "ReviewID": "UR15279803", "Content": "This hotel was perfect, the room was fairly spacious and quite clean. The staff was friendly and had no problem with our arrival before check in time. The breakfast wasn't great, but it was free and better than just donuts. The rates are much lower than downtown. Their is absolutely nothing wrong with the neighborhood, it's not rich, but it's perfectly safe and reasonable. The walk to the subway is quick and easy. I cannot imagine staying anywhere else in Boston unless I wanted a luxury hotel or made some amazing find. There is also a little italian deli nearby for cheap eats as well as a shopping center where you can get most anything you need.", "Date": "April 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Omaha", "Title": "“Stay Here!”", "Author": "AEO", "ReviewID": "UR15108473", "Content": "My son and I booked a room at the Holiday Inn Express located at 69 Boston Street in Boston, Massachusettes while doing a college visit. I researched for several days for a reasonably priced hotel in Boston that was close to downtown (not an easy feat!) We were THRILLED with the accomodations! The room was VERY clean, the bed was extremely comfortable, the breakfast was nice and our stay was very pleasant! All at a very reasonable price!!!!! The hotel is a 5 minute walk from the Andrew train station which will take you downtown in a matter of minutes! Very convenient and easy to use! (We'd never ridden a subway before and were initially intimidated.) The hotel is also a short block from a large shopping mall with Old Navy, Bed, Bath and Beyond, Target, and much more! The hotel baked fresh chocolate chip cookies every afternoon for the guests to enjoy! The staff was pleasant and helpful! We'd DEFINITELY stay there again! The only negatives I could come up with were that the walls seemed alittle thin and we could hear noise in the hallway at night, but it did not disturb us. The area that the hotel is located in is also not an area one would walk around to sight see. However, if you're looking for a reasonably priced, clean and conveniently located hotel near downtown...book a room here!", "Date": "April 17, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Northern VA", "Title": "“Solid hotel near T for tourists”", "Author": "inabag", "ReviewID": "UR15030884", "Content": "My girlfriend and I just got back from a 5 day, 4 night stay in Boston. We did all the normal touristy stuff, and used the T often. The Holiday Inn was within walking distance to the andrew T station. The neighborhood was alright, safe enough to walk around in if your with someone else. We ended up walking back close to midnight on both thursday and friday and had no problems whatsoever. The staff at the hotel was very nice, and we had no problems. Our room was clean, and had what we needed as tourists who wanted to spend more time out in the city then in our hotel room. Our toilet tank handle was broken and needed to be jiggled with to work, but we let them know about it. They serve complimentary breakfast everyday, which was a huge blessing for us. It is a buffet style breakfast, and they had a huge spread everyday that included eggs, bacon, sausage, toast, english muffins, bagels, french toast, fruit, muffins, cinnamon rolls, milk, juices, coffee, etc. Overall I would suggest this to anyone who wants to stay on the cheaper side in Boston, who does not mind a 10 minute walk to the T, and can get over the fact its not a 5 star hotel or a 5 star area for that matter. It served our needs, and we would stay there again.", "Date": "April 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Georgetown, Canada", "Title": "“Great place to stay while in Boston”", "Author": "Magicats", "ReviewID": "UR14826314", "Content": "We stayed at this hotel for 2 nights while we visted Boston and to watch a hockey game. It was very easy to get to as we drove from Ontario. While there we parked the car and utilized Boston's subway system to get into downtown and all around Boston. The Subway station was a short walk about 10 minutes or you could take the hotel's complimentary shuttle. The rooms where a comfortable size for sleeping and changing in. Best of all the rooms were very clean! Breakfast was good with the typical omellet, sausage patties, fruit...etc. Staff were friendly and helpful throughout our stay. We did return in the evening both nights walking from the subway and found the neighbourhood quiet. Albeit it was very cold out so not sure how quiet it would be in a warmer month. Overall this was a great place to stay if you planned to use public transportation! Would definately stay here again while in Boston!", "Date": "April 6, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Amsterdam", "Title": "“We'll be back!”", "Author": "Mars061", "ReviewID": "UR14791874", "Content": "My wife and I stayed here for 3 nights because it was way cheaper than hotels in town and because it was close to the Boston subway (T), which takes you into town for $ 1,70. We read some very negative reviews so we were pleasantly surprised to find this a wonderful place. The staff was friendly and helpful, the room was clean. Our room was a bit small and didn't have the nice view someone else wrote about but that was no problem for us. The colours of the TV were a bit dark and that couldn't be fixed but big deal... The breakfast was very nice, coffee and tea were fresh all day and night, in the lobby were two computers to use for those not bringing laptops. The walk to the T station was about 5 minutes (I can imagine the neighborhood being a bit scary for a woman by herself but we never encountered anything disturbing and it really is only a short walk) and the ride into Boston was less than 10 minutes. I would definately stay here again. For those wanting to do some shopping, there's a Target, Marshalls, Old Navy and some other stores very close by (3 minute walk) and also an Applebees restaurant and a Stop and Shop. The shuttle service to the airport was very convenient too. I think we will be staying here again on our next visit to Boston!", "Date": "April 4, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "CoastalMaine", "Title": "“Don't Stay Here!”", "Author": "TimD53", "ReviewID": "UR12652287", "Content": "This is NOT in the heart of Boston! This is in a truly bad neighborhood. We stayed here for the park and fly and had a bad experience with that as well. I highly recommend finding anything else in Boston away from here.", "Date": "January 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Philadelphia, PA", "Title": "“A perfectly fine place”", "Author": "Sacro", "ReviewID": "UR10961806", "Content": "I chanced upon the Holiday Inn Express while attempting to find a reasonably-priced room close to the new convention center in South Boston. Fortunately, I found what I was looking for and more. The facility was clean and well-cared for. My room had 1 queen-sized bed that was comfortable, room temp was fine, tv and other amenities adequate. Wireless internet was available in the lobby and the room had an ethernet connection, though it didn't work on my laptop for some reason. The free breakfast buffet was really good -- cereal, many bread products (bagels, waffles, french toast, muffins), fresh fruit, coffee, tea, hot chocolate, and juice. Most strikingly, the staff were extremely friendly, competent, and professional, even in the face of 100+ conventioneers all clamoring to get onto the 7 am morning shuttle bus (free!!) to the convention center. The motel runs a free shuttle service to and from the convention center and the airport. It's a 7-minute walk to the subway through a reasonably safe neighborhood. I would stay there again even without a convention to attend if I wanted an inexpensive and professionally-run place to stay.", "Date": "November 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cork, Ireland", "Title": "“Holiday Inn Worth A Visit”", "Author": "vikkiCork_Ireland", "ReviewID": "UR10715637", "Content": "I stayed at The Holiday Inn Boston Street for 4 nights from 25 October 2007 with my husband and daughter. This was my fourth trip to Boston and my first stay in a budget hotel and to be honest I will be back!!! The hotel staff are extremely friendly and did everything they could to accomodate people. Our room was large in comparison to downtown Boston hotel rooms and while the decor was a little dated the room was spotlessly clean. We had a great view of Boston lit up by night from our room. Breakfast was provided and there was lots to choose from for both adults and children. The T is LESS than a ten minute walk and three stops to Downtown Crossing. The hotel will also organise a cab if required it only costs 10/15 dollars for a cab downtown. We rang the hotel ahead with a few queries including car hire which they were very helpful with. There was also a shuttle bus on the hour to the airport which we availed of on the way back to the airport. For a shopping trip this was an excellent base, I will return next Autumn with my friends.", "Date": "November 9, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Sussex", "Title": "“Great Value, Location ok”", "Author": "Mary014", "ReviewID": "UR10507461", "Content": "I was on business all week and wanted to tag a couple of days on the end and couldnt afford where I lodged all week, so I found this hotel with the review on on trip advisor. It was clean, quite pleasant and I took the subway into town in the morning and got taxis back at night. The taxi cost me $12 one evening and $18 another, so expect to pay something like that. I think if you are looking for value, then go here, it's not so far out of Boston city but personally I prefer to me more on top of things. I can't complain really though as it was clean, free breakfast and also a free transfer to the airport. Would recommend if you are on a budget.", "Date": "November 1, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Lancaster County, PA", "Title": "“Worst hotel experience - ever!”", "Author": "SatireFireFly", "ReviewID": "UR10499656", "Content": "My husband and I booked this hotel through travelocity because it was within walking distance to the subway which would allow for easy travel without a vehicle. That was it's ONLY positive attribute. Our room was dirty, there was visibile dust & dirt on the wall, the shower curtain was made of white cloth and looked as though it had never been taken down to be washed after it's initial hanging, the maids spoke NO english so they couldn't tell us why they skipped our room and we had to call down to the front desk to have them double back, and the staff of the hotel were uneducated and rude. When asked how to get to Salem we literally got FIVE different sets of directions, four of which were completely wrong. Our train also arrived late and so we were unable to be in town for our first night which we had prepaid for. Upon calling to advise travelocity of the situation they called the hotel (which if we would have known that's all they did we would have just called ourselves...) and were told there would be no refund. So they got all of our money for a night at the hotel that we were not there. They were also quite rude when our train finally DID arrive and we made it into town. They refused to answer questions as to why we had to pay for a night we were unable to stay when the situation was completely out of our control refusing to say anything other than, \"hotel policy\". They were so unhelpful and downright nasty when we called or stopped by the front desk with questions that we finally just stopped associating with them all together for the remainder of our trip. I now understand why they refuse to give refunds under any circumstances - because anyone in their right mind would demand one and never stay even a single night here. We've been stuck in this hotel for a week because we prepaid and they will not refund our money in order for us to seek better accomodations despite their \"hospitality guarantee\" that if something's wrong they'll make it right or you won't pay. In reality if something's wrong you'll get the 3rd degree until they begrudging come to do a half [--] fixer up and then you'll be shunned the remainder of your time at the hotel. My husband is active military so I've seen my fair share of various hotels, I've never stayed in a Holiday Inn Express before this one so I don't know if this is the rule or the exception, but I certainly will not stay at another in order to find out. I will NEVER book at a Holiday Inn Express again.", "Date": "November 1, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Messingham, North Linc's", "Title": "“Adequate for our needs”", "Author": "DavyP", "ReviewID": "UR10431115", "Content": "We had two nights in this hotel, it was adequate for our needs, beds clean, rooms fine, breakfast typically American continental i.e. waffles (cook yourself, good fun) cereals, pastries,coffee etc'. The best thing was the free airport transfers, the worst is its location, right on two motorways. There are three places within walking distance to eat, Applebees, Olive garden & one other I cant remember the name of. All in all adequate for touring as you dont spend much time in the hotel.", "Date": "October 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Stafford", "Title": "“Brilliant for a Boston stay”", "Author": "Part_time_traveller", "ReviewID": "UR8828334", "Content": "Stayed 4 days in September, booked 2 rooms direct with the Hotel Chain website (they guarantee that's the cheapest way), about $100 a room, breakfast included. I suggest that you check out city centre hotels in Boston and see if you can get one with breakfast for less than twice that. First the only (to us) disadvantage, it's not within walking distance of the centre, and therefore meal options withing walking distance of the hotel are limited. However, cab to centre is $10 (in our case between 4 of us!), cab from airport is $10, and shuttle from hotel to airport is free and good and reliable, despite what others below might say! Breakfast buffet is good quality, plentiful, and free. T station is 15 mins walk away, but as the T is $2 per ride, for 4 of us we took a cab. Rooms are clean, well decorated and standard Holiday Inn layout. Hotel has a laundry room for guests and free internet terminals (for us non-Wifi people). Staff ranged from efficient to super helpful with directions and recommendations, special mention to Trina, who wrote out some personal recommendations for us and was always happy to give that extra help. I would suggest anyone gives this serious consideration for a Boston stay, we think it would have been hard to beat.", "Date": "September 20, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cedar Falls, Iowa", "Title": "“Decent room and location for the price”", "Author": "redbird71", "ReviewID": "UR8753700", "Content": "We chose this hotel for two reasons â€“ cost and proximity to a subway station to get us around town. We wanted a room that was nice, yet knowing we wouldnâ€™t be spending much time in the room. We spent approximately $130/night for 4 adults and 2 double beds non-smoking room. The hotel seemed very warm and welcoming. It looked like it was cared for. Our room was on the second floor with a window looking to the North. It looked over the roof of a restaurant but you could see downtown Boston. The room itself was clean and had nice warm tones to welcome you back after a long day of walking. Otherwise, it was standard size for two-double beds â€“ what I would expect from a Holiday Inn Express. Its location is in South Boston, just off of I-93. There was a newer shopping complex with a Home Depot just Northwest of the hotel and a restaurant adjacent to the building. In order to get to the Andrew T station (subway & bus), it was close to a 1/4 mile walk requiring us to walk around the â€œFortressâ€� building, over I-93 to Andrew Square where traffic can be tricky to navigate with 6 streets converging together. Just remember to head North on Dorchester Av. past the Dunkinâ€™ Donuts to find the station. The only problem we had with our location was one night the red line that services Andrew was shutdown due to a fire on a bridge. We were let out at the Park St. station in Boston Common with quite a distance back to the hotel. It was here when I thought it might not be a bad idea to get a hotel in the downtown area and not have to worry about something like this happening. After discussing our options (walk, bus, taxi) we waited for a shuttle bus to transport us and we got as far as the Broadway station (one stop away). From there we decided to walk down Dorchester Ave. back to the hotel. It was dark in areas as it appeared this was more of an industrial area and left me feeling a little uneasy as not many people were out, plus, the walk was a good mile or more back to the Andrew station but in the end everything worked out OK. As for amenities used, the hotel sent its shuttle to pick us up from the airport when we arrived and the standard continental breakfast suited us well for beginning our day. Overall it was a nice place to stay and I thought we did pretty well with getting a decent room and rate while staying close to downtown Boston. I would stay here again and would recommend it to anyone looking to stay at a hotel for the same reasons I wrote above.", "Date": "September 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Hong Kong, China", "Title": "“Perfectly good for a couple of nights”", "Author": "mrrfrost", "ReviewID": "UR7869737", "Content": "About a 10 minute walk from Andrew subway station, the Holiday Inn Express is fairly convenient to get to Downtown Boston. The hotel is clean and with a pick-up service from the airport and a drop-off service to the cruise ship terminal too, it's difficult to fault the hotel too much. There was quite a lot of rowdiness on our first night - but not the hotel's fault. The breakfast is adeqaute and there is a small, antiquated gym and 2 terminals offering free internet access. And compared to the rest of Boston - good value too,", "Date": "June 17, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Hard to Beat for the Money”", "Author": "marysj", "ReviewID": "UR7438340", "Content": "I agree with the majority of the reviews on this site. For Boston, this is a very reasonably priced hotel indeed - but difficult to find! You need to enter a nearby shopping mall car park in order to access the hotel. The rooms were clean and bright and the excellent breakfast took us completely by surprise. You are a 10 minute walk from the subway and then another 10 minutes away from downtown. While quite central, the location isn't great. I was nervous walking back from the subway but we had no trouble whatsoever. Best to take your meals when you are in downtown Boston. I have to say I didn't find the staff overly friendly. There was a clear problem with our room when we arrived. And although the staff did arrange for us to be moved, there was no apology whatsoever. Normally, we stay in better hotels. But this trip to New England was about economy. This hotel offers very good value for money for Boston. So if you are on a budget, you'd be hard pressed to find better - you would be looking at double the rate, at the very least, to stay in a better hotel downtown. The trade-off is the location. Would stay again if money was tight.", "Date": "April 26, 2007"}], "HotelInfo": {"Name": "Holiday Inn Express Boston", "HotelURL": "/ShowUserReviews-g60745-d121009-Reviews-Holiday_Inn_Express_Boston-Boston_Massachusetts.html", "Price": "$158 - $250*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">69 Boston Street</span>, <span class=\"locality\"><span property=\"v:locality\">Boston</span>, <span property=\"v:region\">MA</span> <span property=\"v:postal-code\">02125</span></span> </span> </span> </address>", "HotelID": "121009", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/19/30/1930c2523252dad30547bc17cce5379e9large.jpg"}}