{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "4", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New Port Richey", "Title": "“Don't be a sucker, this is a time share. If its too good to be true..it is!”", "Author": "Mandy J", "ReviewID": "UR128342793", "Content": "I live about 80 miles from the Orlando area so my husband and I take many..many weekend trips to the Disney area. I've stayed just about everywhere. My friends and I try this one out. Knowing Westgate and being held hostage in their sales pitch I should have known better to stay here. You get \"Florida rates\" just to sucker you in. You have to go to several desks at check in which when crowded can take several hours. Yes, I said hours. They try and sucker you in to their 90 minute resort tour and you get complimentary Buffett breakfast. Do Not Do this. It's where they trap their prey!! It will turn in to hours of them trying to sell you on a timeshare. I didn't do it, because I know their game, being an expert Orlando Traveler and being previously sucked into it. The game room is ok, but the Ice Cream place is so far away that you should drive to it. The deli and sports bar are not impressive at all. I wouldn't even call it a sports bar. They sell drinks at a bar and they have a tv you can watch. I was put in a handicapped room. My husband and I are not handicapped. The shower was so small bc of the fold out seat. The beds were comfortable though. Checking out you have to put all your sheets and towels by the front door & take your trash to the trash closet. Oh did I mention you have to pay $9.95 a day plus a .70 sales, and .60 Resort tax for \"Resort Fees\" They will lie and said its for your Ammenity Card. I hope my review will help some travelers that don't know any better stay away. Look somewhere else. This place really isn't worth all the hassle and harassment you will get. Trust me..you'll find out if you chose to stay here.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "the mitten", "Title": "“Would I stay here again? Yes”", "Author": "from_the_mitten12", "ReviewID": "UR128285152", "Content": "After reading many reviews, some things were spot on....some were not. I was worried abt sales pressure, bugs, poor service, etc...whatever people have commented/complained abt. We exchanged thru II for a spring break week. We checked in on a Friday (May 30, 2012) leaving on Good Friday. Arrived at 3pm and check in was about 30 minutes...after we checked in, ushered to another counter and was asked if we wanted to sign up for a 90 min presentation. ABSOLUTELY NO PRESSUE AT ALL. The girl was very polite when we said no thank you. THAT WAS THE END OF IT...no phone calls, no pressure, like I read. I honestly think those reviews are from people who somehow got a deal and had the presentation as part of their package...well, you dont get something for free - you agreed to the presentation, full well knowing it was a sales pitch. Check out was a bit worse - we decided to check out on Thurs night, cuz we planned to leave very early Fri morning. Two guys behind the counter, about 4 families in line and it took almost an hour to finally get our chance. They should have called for help. Also walked away with our invoice - noticing it was someone else's - the guy must have entered the wrong room number. Got that sorted out and shook our heads as we left. Not the best impression upon leaving. We stayed in the 5600 building..it was near two different pools - Definately recommend pool #13 - and plan to reserve ur chair/table early in the morning (9am ish) cuz if you go later, all the chairs/tables are filled up. We stayed in what Interval listed as a 1 bedroom with LK (Limited kitchen) = translates to Studio.The pictures of the studio on Westgate's website are accurate of what our room looked like. It was a lock off, attached to a 2 bedroom. When we arrived, the lock off door was not locked. Got a glance at the 2 bedroom - it was very nice and we were envious. Called the front desk to ask to upgrade, could not since it was a holiday week and the resort was full and requested they come and lock the door. Someone was there within 10 minutes to do so. The room was decorated a bit dated, but it had granite counters in the kitchen and bathroom. Dishes/silverware/glasses/cups/dish soap/extra paper towel/tissue/t paper were provided, so we didnt have to buy any for the week. Room service showed up on Tuesday with fresh towels and to replace garbage bags/paper towel/tp etc. Would have liked a broom to sweep the floors. Nice screened in balcony = no bugs. Loved hearing the water fountain in the little man-made lake behind our building. No issues with parking. We ate off site every night - plenty of restaurants to choose from. Grounds were nice and clean. The location is one of the best things abt Westgate. 5 minute drive to Disney. About a 40 min drive to Cocoa beach/Kennedy space center. We didnt go to Universal or any of the other parks, but those were close by also. Definately a family friendly resort - so close to Disney and many restaurants.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“A Great Exchange”", "Author": "Hongkonger65", "ReviewID": "UR128220802", "Content": "First off, like so many others, I was concerned about booking this time share property after reading the many reviews on Trip Advisor. We exchanged through the Interval International network for the spring break week and were prepared for 1) big crowds, 2) a time share pitch and 3) a so-so experience. This actually turned out great for us. The resort is HUGE and great for families who are going to the theme parks. Our daughter was playing softball at the ESPN Wide World of Sports and the resort is perfectly situated for that. On entering the main check-in area, we were pleasantly directed to the registration counter and everyone was very nice. We did not wait in line at all (approximately 1:00 pm on a Sunday) and it took only about 10 minutes to get our keys and be handed off to a very nice time share associate. This was very low key and when we said that we would not be available for the presentation breakfast, we were sent on our way to building 4000 (which is newer and close to the main reception area). There appears to be some construction planned for in front of the unit we stayed in, but that did not impact us at all. When you are at the parks, swimming or at sporting events all day, this is not really important. If we wanted a view, we would have selected another vacation destination or property. Our unit was a huge one bedroom (I assume a deluxe) with a full kitchen, laundry facilities in the unit and a large lanai. The flat screen TVs, jacuzzi, separate shower/bathroom and furnishings were very nice. It would have been great to have an extra toilet in this unit (it is obviously a lock-off), but that was our only complaint. We did not have any door bell ringing, but the walls are a bit thin and we heard our neighbors in the morning. As with most condo/time share properties, room cleaning happens once a week. We actually like this for privacy. If you book this property thinking it is a romantic hotel-type resort, you will be disappointed. If you are a seasoned time share exchanger, you may be very pleased (as we were). In addition, if you need transport to the airport, Caesar's is very good - affordable, convenient and courteous. Shuttles to Disney are limited, so a vehicle (especially with the large size of the resort) is a good idea. Parking is free.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Asheboro, North Carolina", "Title": "“Great place to stay!”", "Author": "barzdiprocky", "ReviewID": "UR128042871", "Content": "I stayed a whole week at this vacation spot (timeshares owned and rented also location) with an owner. For the most part I enjoyed my stay at this location! The facilities were modern, beautiful and clean! I was in building 5000 and it was immaculate! The parking was a bit difficult and no luggage carts to use when you need to load and unload your car but we managed to make it in two trips. When we checked in the first day we were ushered to a second employee to discuss a presentation (and since my friend was already an owner she knew the spill so we declined the offer for this presentation). We rested very well in the evenings and nights as the one bedroom unit we had was very comfortable and it was noise free. We did our own laundry while we were there and never asked for room service; if you place your garbage bag outside your unit door the service will pick it up by the next morning. If you ask for anything they offer they will try to acommodate you. The shuttle service to the disney parks could be better to accommodate people who want to stay till the finale fireworks or shows at night. I think it was very inconvenient to have to abide by their times only and enjoy the parks to the fullest. So we paid $14 or $15 per day to park our vehicle at the parks for 6 whole days. Check-out was simple; we cleaned our room as far as placing dirty linens in the laundry room and putting the dirty dishes in the dishwasher and turned it on, and placed any garbage bags outside our door when we left. A great place to stay! Shorts and Sandals was a great place to stop for a drink or food, great service and casual atmosphere. When you order food please prepared for very large amounts of food. It was amazing! Thanks again for a great vacation spot!", "Date": "April 17, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "North Haledon, New Jersey", "Title": "“HORRIBLE EXPERIENCE”", "Author": "miniv", "ReviewID": "UR127831508", "Content": "My girlfriend and I arrived at the Westgate Town Center on the morning of Sunday, April 8th for our 5-night Disney vacation. Let me just preface this review by saying the Westgate Marketing team is full of liars that really know how to stretch the truth. The first major negative of our trip was an unavoidable $65 taxi ride from the Orlando airport to the resort – it would have been accommodating of Westgate to provide some sort of free or reduced transportation to and from the airport for its guests, since the resort is roughly 25 miles away from the airport – but apparently that is entirely too much to ask. So we finally arrived at the (seemingly) beautiful Westgate Town Center around noon on Easter Sunday. Now don’t let the exterior appearance of the resort fool you – the pretty landscape, the large, beautiful lobby, and the sophisticated-looking buildings – there is no denying that the physical appearance of the resort is beautiful. But after only a little time it became obvious that the Westgate people dedicate most of their resources into the appearance of the resort, rather than the happiness and comfort of their guests. Our first grievance with the resort came upon check-in. After we were checked-in by a young lady and given our room keys, we were immediately and UNWILLINGLY shuffled along a conveyor belt to another representative much like a cattle-call. We did not understand why we had to meet with another representative after we had already checked-in and gotten our keys – all we wanted to do was go up to our room and unpack after a long morning of traveling. Now this representative was very charismatic, and slyly talked us into signing up for a “90-minute tour of the resort” on Tuesday morning. We weren’t sure why he was strongly encouraging us to sign up for a tour of the resort two full days after we had arrived, but whatever. We don’t know how it happened, but he then swindled us into leaving a $20 deposit for our tour reservation! And after he rushed us through signing a pink waiver with a lot of fine print (that we did not have time to read), we came to realize that we were signing up for a timeshare sales presentation that we 100% HAD NO INTEREST IN BUYING. We asked some other guests what it was all about, and they urged us to AVOID the presentation at all costs – they told us that it was actually a high-pressure sales pitch to try to sell us a timeshare, and in most cases, the presentation lasted roughly 4-5 hours (not 90 minutes) and involved several managers and higher-ups that applied a great deal of pressure to buy a timeshare. After hearing these horror stories, we decided to skip the presentation and cut our losses, leaving the $20 deposit at the front desk. Our next grievance came with our room (located in building 5200). Let me just say that the architect who designed these rooms did a very poor job and was severely overpaid. Our bedroom wall was actually the front wall of the unit, meaning that our bedroom window was directly next to the walkway outside our front door. Being early to bed every night, we had a lot of trouble sleeping because we heard all the various noises of people and kids walking by our unit. We were also right next to a staircase, so anytime someone walked up or down the stairs, we could hear them right in our bedroom. The ceilings were also paper-thin, as we heard footsteps through our ceilings every time someone walked around upstairs. In addition, when we booked our stay at Westgate, we booked a king-sized bed in our room. However, what we received was a rickety full-sized bed, with a crusty old comforter and sheets as crinkly as sandpaper. The mattress was hard and thin, and gave very little support to a guest who would be walking miles upon miles at Disney parks all week-long. The televisions were old and outdated, the WI-FI was NOT FREE, and furthermore, the leather sofa in the living room area was filthy, with dirt and grime stains all over it. Our room was just flat-out dirty and outdated. But what really ticked us off the most, was after all the inborn cleanliness issues with our room that I just described, housekeeping did not come to clean our room until Thursday afternoon!!!! (again, we arrived Sunday morning). It took 4-and-a-half days for them to bring us clean towels and take out our garbage = GROSS! HORRIBLE SERVICE!!!!! A couple other negatives – the pools were dirty and unkempt. There was a very nasty and impatient young employee named Alexandra that worked the lake activities area (she was quite rude to us). There were no sidewalk paths when we wanted to leave the resort by foot. There were golf carts zooming all over the place because the resort was so large and unwalkable. And finally, most of the clientele that stayed at the resort were not of the highest class (I’ll leave it at that). The lone bright spot of this gigantic resort was the Sports Bar/lounge named “Shirts and Sandals.” The food there was excellent and affordable, the portion sizes were large, the service was impeccable, and the overall atmosphere was friendly and fun. We ate three meals at this lounge and were very happy (and full) each and every time. In closing, I would DEFINITELY NOT stay at this resort again in the future, and recommend that you not either!", "Date": "April 13, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "chesapeake", "Title": "“worst place in the world to stay!!!!!”", "Author": "bill j", "ReviewID": "UR127705410", "Content": "These people lie to you to get you in the door the room we booked was not what we thought. If you are staying here and you are not an owner , forget it!!! the will treat you like dirt...... no upgrades, they have this big cookout , and your not invited, after you paid your money!!! they take your credit card and charge it up front,when the are only suppose to hold it to reserve a room. please do not go to westgate whatever you do. go somewhere else!!!!!!! the movie theater was out of order for a week,cuetomer service was at an all time low,the maids were nice though. I will never stay here again...... vacation ruined!!!!!!", "Date": "April 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Burnsville, MN", "Title": "“Enjoyed my stay. Beautiful modern room. Close to Disney, Restaurants and Shopping”", "Author": "2views", "ReviewID": "UR127630484", "Content": "I did a timeshare getaway vacation purchase for a 2-2-0 (sleep 2, occupancy 2, bdrms 0= Hotel Rm or Efficiency/Studio) at Westgate Vacation Villas. If you plan to visit Disney, this resort is about as close as you can get without being on the Disney property itself. Westgate Town Center is 3 blocks off of US-192, a major road with national chain restaurants and shopping, including SuperTarget, Walmart. I was amazed at the size of this complex. It includes several blocks with 2-level town homes, about 6 huge 8-story tall condo buildings which I estimate have about 720 units each, and the monsterous regal Town Center building which has suites, efficiency and hotel rooms. Additionally, there are various shops, eateries on the complex. Check-in is at the Town Center building. It is stated that earliest room check-in is 4pm. Knowing this, I planned to check in several hours after 4pm to avoid the rush, but as the day unfolded I arrived at exactly 4pm. There are 40 or so parking spots out front, but they were all full, so I continued on to the side of the building and walked to the front entrance. (A previous reviewer complained that there was no parking so he drove for over 10 minutes hunting for a space. There is a huge lot with ample parking on the side of the building. Understand that this is a huge resort accommodating thousands of guests. The front desk and parking area will always be busy. If you get that stressed about not getting the parking space closest to the front door, you definately need a vacation.) Once inside Town Center, check-in counters line the whole back wall of the entry with a maze of theatre-line ropes to coral guests. Unfortunately, there are too few staff actually checking guests in, so there may be a 30min or longer wait in line before making your way to the check-in counter. Once there, check-in was fast (10 min). I did not get approached about timeshare sales or special discount-offer meetings. But, having been to timeshare resorts before, I know better than to agree to these offers. A promised 90-minute max timeshare sales pitch is always 4 or more hours and, when you finally escape, you will feel totally exhausted and angry with yourself for not getting up and walking away sooner. The promised free meals, discount tickets, or other perks, are never worth the lost vacation time spent at these presentations, the stress of sitting through a 4 hr presentation, or the risk that you will be tempted enough to actually buy. (If you are new to timeshare sales, what ever fantastic price they offer, you should know that the same, or similar, units can be purchased from disenchanted owners on the aftermarket for 10% of what you will pay at the presentation.) The room I was given upon check-in was in Town Center #40xx, and for 1 or 2 people, it is perfect. I am posting pictures. Everything was new, spotlessly clean, and the bed was plush, one of the best beds I have ever had. There was a full size frig, 2 burner stove, micro, washer/dryer. They supplied a toaster and blender, too. I typically have blender smoothies for breakfast and margaritas for poolside. Unfortunately, the blender, although brand new, was unable to do any more than stir liquid, regardless of speed. I put a banana, strawberries, juice and ice cubes in the blender and tried all the blender speeds. The blades didn't touch the fruit or cubes, just stirred the juice in the center. (The plastic pitcher is too wide for the narrow blades) I had to shake the blender up/down in the air to force the fruit to find the blades. The free Tue pool breakfast is light continental, juice, coffee, cheap danish, oranges. Didn't appeal to me. The pools get crowded, noisy, and inconsiderate folks reserve pool lounges with towels early in the morning and never show up at the pool til later in the afternoon. The staff should, but don't, discourage this activity, or remove towels from vacated chairs. Unlike Las Vegas resorts, where pool staff are always visible, offering towels and drinks, and cleaning the area, I never did notice any pool staff during my week stay, and if they were there they certainly weren't serving the guests. When all pool lounges were taken, I put my towel on the lawn area next adjacent to the pool and found this to be quite adeqate, as did several other guests. As much as I would like to trust others, when at a hotel or resort, if I am leaving my valuables in the room, I always lock my valuables (cash, creditcards, ipod, camera, etc.) in the room safe. When I arrived, I noticed that the room safe power was out (batteries that control the lock were dead). I called maintenance and they dispatched someone within 20 min. Unfortunately, it was the wrong person, the one who can access your safe if you forget your passcode. She had to call the locksmith. I didn't wait, but took all my valuables to the pool with me. When I returned a few hours later, the safe was repaired. I consider this very good service for quickly handling such a minor issue when in the throughs of mass guest check-in at the front counter. Several reviewers complained about not getting daily maid service. This is not a standard hotel. It states in the material provided at check-in that linen service is provided only 1 or 2 times per week. This is an effort to lower cost for the resort and minimize impact on the environment. Hotels and resorts have been moving in this direction for the past 10 years. Frequent travelers already know this and many of us practice this at home. I don't feel the need to have bed sheets or towels laundered daily, at a hotel or at home. Do some people actually change there bed sheets every day at home? Although I had a rented car, I chose to walk fm the resort to US-192 for shopping and meals. It is only 3 blocks to US-192 and Golden Corral, Ponderosa, Sizzler, etc are only a couple blocks further. I actually walked to Target (about 4 miles away). That was a bit far. Next time I took the car. Check-out for me was at 5 AM. There was no waiting. It was quick and effortless. Overall, I would say that this is a fine resort for a family style vacation, especially if you wish to spend most of your time at Disney and area attraction. The complex is large, safe, has wide open landscaped spaces to walk, bicycles and paddle boats to rent, and a activites center for small children. There is not much to do at the resort but sit at the pool. I spent half my free time at the pool and half at the beach (Cocoa Beach, and Treasure Island). For those looking for a party atmosphere, this resort is definitely not the place. For that, head to the beach resorts, or another orlando resort.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Whispering Pines, North Carolina", "Title": "“Town Center was EXCELLENT.”", "Author": "babydec07", "ReviewID": "UR127626231", "Content": "We were hesitant after reading the reviews of others, but we were very pleasantly surprised and will stay in this resort again. We loved the ammenities the resort offered and everything was beautiful. The kitchen in our unit was very nicely stocked & we were able to cook several meals there. Great value on an excellent resort!", "Date": "April 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Glastonbury, Connecticut", "Title": "“Town Center was a nice surprise!”", "Author": "nwb", "ReviewID": "UR127389484", "Content": "After reading some of the reviews, I was a bit apprehensive about staying here before we arrived but we really enjoyed our stay! We own at Westin and Marriott and have always stayed at one of their resorts. We were pleased with the Westgate Town Center. The Good -The rooms that we occupied were new, spacious, nicely furnished, and the beds were very comfortable. -Complimentary continental breakfasts were served @ the pool on Tuesdays and Thursdays from 8:30-10:30. -Maid stopped by mid-week to see if we needed towels. -We had to leave a day early due to a death in the family and our checkout was expedited. -Little pressure to attend timeshare presentation -Location was excellent, close to I-4 and the Disney Parks. The Not So Good -Checkin took way too long! We arrived on Saturday night at 10 and never expected to wait --30 minutes to get our room assignment. -Walls are thin and some guests were very noisy. -People reserve pool chaises with towels and at times, there were at least 30 chairs with towels on them but unused. This should not be allowed. We are returning in early July with our daughter and grandson for a family vacation.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Louisville, Kentucky", "Title": "“Awful customer service at a nice resort”", "Author": "James K", "ReviewID": "UR127353310", "Content": "Unfortunately this resort suffers from some of the worst customer service I have ever had the misfortune to experience. The property has many amenities, and the rooms are very nice, (although the decor is dated, and the tvs are ancient). Everything else needs serious work. - The directions given by our booking site (bookit.com - beware!) were totally inaccurate and led to our driving around for an hour on the wrong side of the Interstate. This was not the resort's fault, BUT: - Repeated calls to the resort for directions went unanswered, and only resulted in waiting on hold for 20 minutes; it seems impossible to get an actual person on the phone who can help. - The line to check-in was ridiculously long (if you are not attending a timeshare presentation), with only two people working alongside ten empty check-in stations; the resort is seriously understaffed. - Three requests to speak with a manager to resolve serious issues with the property went unanswered. I was told someone would be with me shortly each time, but no one ever came or called our room as promised. - Although we had called before arriving to request a crib be delivered to our room, and were told again at check-in it was on its way, it was not delivered until 9 PM, an hour after our daughter's bedtime, and then only because we finally got ahold of the manager-on-duty. (In case you need it, the manager-on-duty's extension seems to be x45999) - Although check-out is at 10 AM, housekeeping came and knocked at 8:30 and again at 9:30 to see if we were gone, and then started cleaning part of the apartment at 9:50, before we had vacated. This is a really nice place, and very close to Disney, but the terrible customer service was almost unbearable, and I would advise anyone against staying here.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Wokingham, United Kingdom", "Title": "“Unusual location for a business traveller”", "Author": "Berkshire_UK", "ReviewID": "UR127074395", "Content": "Found this VERY cheap deal on Hotwire.com to stay at this \"hotel\". Check-in was a breeze, despite it being peak time on a Saturday afternoon. The check-in clerk was surprised that I was on my own as most other guests were couples or families on vacation, but I guess that spared me the timeshare sell. I was in block 59 towards the back of the property and I had a normal 2 bedded room with small kitchen etc. I was concerned that as everyone else was on vacation, there would be a lot of noise, but once inside the room it was very quiet and peaceful. I didn't use the restaurant or bar but did take the opportunity to walk around the extensive grounds. I also walked to 192 to find a restaurant (of which there are many in the area). Overall, not as bad as some reviews had reported and I had nothing really to complain about. However, it was curious that during my 4 night stay, my room was only serviced twice. I couldn't work out whether that was because I was inside the room at the time the maid stopped by or whether it was because it wasn't a regular hotel. It wasn't a problem to me and I didn't even bother to report it to the front desk. Parking was no problem either at any time, as reported by other reviews.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Wisconsin", "Title": "“Nightmare!!!!! Beware!!!!”", "Author": "bgmeidl", "ReviewID": "UR126944559", "Content": "My husband and I just came home from Florida today and I promised myself I would not skip reviewing this resort. The resort is beautiful at first sight. Don't let this fool you. We were there for four days ans our room was not cleaned ONCE! Not even enough cleaned towels or the bed made with clean linens. When we went to out HIGH PRESSURE timeshare bullying session I mentioned the lack of attention to our room and was told that they give priority to owners. Ya like I wanna own anything there after hearing that. Last I checked we did pay for the room we stayed in. Not to mention I personally witnessed the attendant in the game room make a 12 year old little boy cry---do they save that for owners too? Save yoour time and money and stay somewhere else!!!!", "Date": "March 29, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Ocala, Florida", "Title": "“Never again will we stay here!”", "Author": "Lauren R", "ReviewID": "UR126626429", "Content": "Yikes. My family lives about 90 minutes from Orlando attractions and we visit at least once a month and stay overnight. I thought I got a great deal on travelocity but unfortunately it was a joke! We arrived around 4:00 on Friday and it took 90 minutes just to get checked in. The line of customers was snaked through the lobby waiting to check in. There were only about six front desk agents and at least 15 empty computers. Obviously they are understaffed! I requested an upgrade and was told there were none available. Then we got to our room which was advertised as a studio and turned out to be smaller than a dorm room. Not even a chair to sit on in the room because it was probably only about 250 square feet with two double beds. There are mirrors lining all the walls to help it feel larger, but it only adds to the outdated 80's teal carpet and linens. The room smelled of mold/mildew and even after we opened the window the smell never dissipated. The bathroom was nicely renovated but that was it. After we got home from dinner we decided to take the children to the game room and ice cream parlor. It was quite a long walk from our 5900 building and luckily an employee on a golf cart drove by and we flagged him down for a ride. He told us when we were ready to leave that we could walk to the front desk and someone from the bell staff would take us back to our room. NOT! Around 10:15 we went to the resort lobby and the check in line was still so back up that the bell staff told us they were too busy to take us to our building. So we had to hike with the kids (ages 6 and 3) all they way back to our room. The amenities of paddle boats and mini golf look fun...too bad they closed at 6:00! Pick another resort. This place was poorly organized with unaccomidating staff!", "Date": "March 25, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pace, Florida", "Title": "“Great place if you like being lied to on a constant basis!!!”", "Author": "Kenneth B", "ReviewID": "UR126618697", "Content": "I did one review already for Westgate Villas and then realized that wasnt even where we stayed. After being somewhat nice in that review, I decided to review the correct resort and just tell it like it happened. My fiance and I decided to take a trip to Disney with her sister and two boys (3 & 4 yrs old). We start looking for hotels and I think I have found a good one...Westgate Villas. We agree that this sounds like a great hotel but my future sister-in-law keeps looking and finds an even better deal. We were going to have another person traveling with us and she found \"Westgate Town Center\" with multiple rooms, a kitchen, and living area. This sounds great!!! I go to the website and I see that they have a Florida resident discount of 10%. I am proud for finding a good deal but she calls me a few minutes later and she has found a better deal. If we book early we can get 20% off the same room. The extra person cant make it so we decide on the one room deluxe villa. The more we read about the place, with all of these great amenities, the better it sounds and the price is just what we wanted to spend. So we are sitting around the house a few days later planning out our schedule for the Disney parks and we decide we are going to spend the entire day at Magic Kingdom from 9am - 12am. I make the comment that we were going to be late getting in and it would be nice to have the next day free to just relax. That got the wheels turning and we started looking at what it would cost us to add an extra day. I called and found that we couldnt get the extra day at the same low rate but we could still take advantage of the single day discount of 10% for booking early. So we did it. How did we get so lucky to find this you might ask.... It turns out we only thought we were lucky. We drive through the night and arrive the next morning after spending 7.5 hours on the road. We eat some breakfast and check out Downtown Disney just to kill time until 11:30 when I was told we could try to get an early check-in. We get to the Town Center and cant find anywhere to park. This must be a great place because there are people everywhere. After driving around for ten minutes, I ask a guy riding by in a golf cart where I needed to park to check in. He tells me to find a spot out front or parallel park along the curb. What a great idea, if only I could find an empty spot out front or see the curb to parallel park. Oh well, I just go to the nearest parking lot and park there. I tell the rest of the crew to stay at the car since it shouldnt take but a few minutes to check in based on my previous experience staying in hotels. Notice I said hotel, I was not aware that this was a timeshare resort. So I step into this elaborate lobby and just stand there looking around trying to figure out where I need to go. There seems to be people everywhere and it looks like complete chaos. Normally this is where I would expect someone at the front desk, directly in front of me, to be of assistance. Nope, that is obviously not part of the package at Westgate Town Center. So I proceed to walk toward the back where I see some ropes with a line. I wait in the line for about ten minutes only to be told that I need to go to a different line. So, I move to the other line and I am immediately greeted by a pleasant young lady who asks my name and gives me a sheet with my reservation information. Fast forward about 45 minutes and I finally make it to the check-in desk. Keep in mind that this is on a Sunday at 11:30 in the morning so it is expected to be a little busy. The gentleman at the desk takes care of all of my needs and confirms my resort fee charge of $68 plus the $50 deposit. He provides me with an extra card key and then calls for a guest assistant to help me complete my check in. The guest assistant takes me 20 feet to another desk where a VIP host welcomes me and commences to telling me about the mandatory 90 minute tour of the facility that was part of my vacation package. Funny thing is I dont remember getting a vacation package. I just reserved a room for six nights. Oh, there was some sort of mixup and I was booked as an owner so I am entitled to free amenities (I was told that was what the resort fee was for) and a welcome package. I would also get complimentary breakfast buffet and free meals at the pools. Wow!!! My luck is really good. I spend 90 minutes on a tour of the facility and I get a welcome package, breakfast buffet, and free meals at the pools. Maybe that mandatory tour wasnt so bad after all. So, when should I schedule this tour? On the extra day I reserved for us to relax after spending 15 hours at Magic Kingdom with two young children of course. The only catch is this is such a good deal that I have to give them $20 to reserve my spot but I will get it back after the tour...along with some gift cards. Well, I get it back and I just watched 3 other people somehow get the same great deal so what the heck. Ok, that is all taken care of and its only been 1.5 hours so lets go see the room. Up we go to the room and it is exactly what I expected. Very nice compared to the hotels I usually stay in. Back down to get the rest of the gang and show them how good of a deal we got and tell them about all the great stuff we got because of a mistake when they booked me as an owner of something. Now to check out this free welcome package. Six cookies!!! I feel like my 90 minutes is worthwhile already. After we got back to our \"villa\" after a long day at Magic Kingdom, we found that both the bed and the sleeper bed had been made, we had fresh clean towels again, the trash had been taken out, and everything had been straightened up after the two little tornados we brought with us had swept through the room the previous night. The next morning we attend our 90 minute tour that provides a horrible little breakfast buffet that even the kids wouldnt eat. Things started sounding fishy when some guy stands up and announces that someone had just bought a room and to mark it off the list. Our tour guide, er sales person, then starts laying it out for us. She has a great offer for us and we are so lucky to have been accidently booked as owners because that gives her the opportunity to offer us some special deals. Wait a minute, I am not interested in any special deals, I just want my $20 back and we will be on our way. Wait, we just gave you a free breakfast buffet, just give me a few minutes to explain this wonderful offer. Well, we're even then because we didnt eat your free buffet. Let me ask you, if money didnt matter, would you be interested in staying here at least two weeks every year in a room like we stayed in last night. Sure, it is very nice. Then give me a few minutes to explain. Sure, I agreed to 90 minutes so lets hear it. 4.5 hours later... No, No, and No, I am not interested in buying a timeshare, paying off a timeshare, or prepaying for a week vacation in a timeshare. I just want my $20 back so we can go get something to eat and RELAX. Ok, what price would it take to get you in on this great deal. FREE. Ok, let me go talk to my boss and see if I can work that out. Just forget it, I just want my $20 back now... So much for relaxing the extra day we paid for. As for the rest of our stay, our beds were never made again and the linens were never changed in 6 days, our garbage was never taken out again and wasnt even picked up when we left it outside our door. We ran out of toilet paper and when we called for it after the second day of using kleenex and napkins, they finally got some to us after over an hour. Needless to say, we didnt feel so lucky in the end when we got treated horribly after turning down their great offers. The room is definitly nice and it was well worth the price we paid but with our extra day wasted and the way we were treated afterwards, I would rather have paid twice the price and enjoyed my stay somewhere else.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Stay here for a week....but don't buy a timeshare!!”", "Author": "MamaTraveler1", "ReviewID": "UR126469656", "Content": "OK here is what I would say about this place: stay for a week but do not buy a timeshare. My husband and I bought one here a few years back and upon our very first visit the following year, we regretted the decision. The staff is super friendly and accommodating while you are writing a check and signing the timeshare paperwork. But the minute you are an owner and you have any sort of issue or problem (and trust me, you will have issues and problems) the staff tends to get uncaring and often RUDE. You would not believe how many people I have dealt with there who had me baffled about how rude they were to an owner. If it was a random situation or one person I would never mention it....but SO many staffers there were rude and unhelpful so I feel it needs to be mentioned. Where owners are concerned, there is NO such thing as 'customer service'. None whatsoever. So be warned about that. The place tends to get REALLY crowded during holiday weeks. Yes, I know that can happen anywhere, but this was beyond the norm as far as I could tell. The pool was so crowded that we literally could hardly move around (and good luck finding a pool chair; there was like one chair for every 50 people, if that). My biggest complaint was the lack of someone working there to make sure things were safe at the pool. There were kids (and even adults) acting like animals in the pool, totally rough-housing and jumping off things they should not have been jumping off of. It was very dangerous and twice my daughter got hurt by careless people who were acting like lunatics in the pool. I felt that in those conditions, the place should have one person there to tell people to stop doing things like jumping off the center island into crowds of swimmers and wrestling in the water. We eventually left the pool because my child was hurt (we would have left anyway because it was a miserable place to be....not relaxing or fun at all). In situations like that, it would be nice for there to be an employee watching the pool and taking care of problems. At one point, early after our purchase of the timeshare, we were assigned to an agent who was seemingly very nice and helpful. \"Anything you need, you call me!..\" he kept saying, and he even gave us his cell phone number. We called him about something and he picked up immediately and was happy to help. He also picked up really fast when he was going to meet with us to talk about upgrading our timeshare (THANK GOD we didn't do that!!!). Then we had a problem....a big problem....and we went to management. We called our agent on his cell and....surprise!! He didn't pick up and after several repeat calls and messages to him, he never called us back. Years later, he still hasn't returned our call LOL. So I guess if you are happy, they are happy. If you have a problem, they are useless. We also were promised a lot of things at this hotel that were never delivered....things that were a huge part of the reason we bought the time share.They promised a big waterpark with water slides. Several years later, that park is still nothing more than some ugly poles sticking out of the ground. On our visit last year, they had a big inflatable waterslide but they charged a fortune to use it. So much for getting what you pay for. We were urged to go to \"one of the best dinner shows in town\" and when we got there it was like a converted strip-club. It was gross and smelly. The show was horrible and the food was enough to make me gag. I later found out that they are somehow affiliated with the hotel (perhaps the hotel gets money every time they get a sucker, er, customer, to go to this place?) We felt duped by them and mislead.....but at that point this was no surprise. Oh and their shuttles to the amusement parks? Forget about it. They have hardly any type of schedule (even during the busy holiday weeks, the shuttles hardly make any trips, and far from what would accommodate the amount of guests who want to use this service). The first day we were there we were told we couldn't get on the early shuttle because it was booked up and there wouldn't be another one. Thank goodness we had a car. Lame. They had an \"owners luncheon\" that was SO crowded because they were letting non-owners in (I know this for a fact). Halfway through the lunch they ran out of food. I could go on and on about the problems we had with this place but the thing that bugs me the most is the lack of customer service. We had a lot of issues there with our timeshare (things I can't even get into on here) and they just DO NOT CARE. At one point my husband was on the phone with one of their agents and she kept saying \"mmmHmmm\" to everything he said. She was totally disinterested in talking to him, You will find this from everyone starting at the clerks behind the desks to the top of management. They don't care about you once you sign the timeshare papers. Trust me, we had a lot of serious issues that they shrugged off. It is infuriating. The good things about this place are that it is pretty and it is close to a lot of things people go to Orlando for. It is easy to get to Disney from here. The hotel is very close to a lot of restaurants and shopping (which is a good thing since there are no real restaurants on site). The hotel is lovely in appearance and the rooms are very nice. But other than decor and location, this place is NOT all that great. In fact, the only reason I gave this two stars is because of the location and decor. But if it wasn't for those two things, this place would get one star (only because there isn't an option for less than that).I would definitely book a week here....but if I could go back and do it all again we would NOT buy here. No way. If we could sell this timeshare, we would have done so long ago (don't let them tell you it is easy to sell; it is not). I could go on and on about what I don't like about this place but I'll end it here. I highly suggest not buying here, though. I am not the only reviewer who has valid reasons as to why not. But the lack of caring and customer service (among everything else) makes me mad that we are spending our hard earned money on this place.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "camp creek, wv", "Title": "“Excellent choice!”", "Author": "tlilly01", "ReviewID": "UR126401566", "Content": "Made my reservation and was in a very small room; but talked to the front desk and was moved into a perfect room for our stay. Everything was clean and wonderful! I would recommend this (especially the 1 bedroom - not suite) to anyone!", "Date": "March 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ithaca, New York", "Title": "“Beautiful property!”", "Author": "Mary Beth J", "ReviewID": "UR126253288", "Content": "We were only at Westgate Vacation Villas for one night- but wanted to say how wonderful Libia Rodriguez was to us-she went out of her way to make us feel relaxed and at home-also was a tremendous help with directions to the Orlando airport, and other hotels where family was staying-she was an absolute joy and a wonderful ambassador for your resort-thank you so very much Libia!", "Date": "March 17, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Homestead, Florida", "Title": "“Check in Nightmare!”", "Author": "Ebony G", "ReviewID": "UR126009495", "Content": "After a long day of traveling all you want to do is check into your room and relax right? Well at West Gate you have to wait a little longer. When we pulled into their gates I was impressed at how massive the property was. It seems like they have all types of accommodations but the major problem is they all check- in at one central area. When walking in check in reminded me of checking in at an airport, only an airport would have been much faster. It took us just over an hour to check-in. After you check-in they walk you over to the Time-Share desk and they give you their whole speech. They must have sensed our annoyance as they only gave us one rebuttal and let us go right away. We were in building 6001 which is to the left and behind where you check in. The rooms were very modern, which was almost worth the wait. We requested the top floor, to try and avoid noise, and I must say you could not hear anything in the rooms on either side of you. HOWEVER, we were close to the elevator so in the morning we could hear the noise as people were coming and going.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London, Canada", "Title": "“Timeshare nightmare, rude staff, room and amenities not as promised”", "Author": "Edenfamily88", "ReviewID": "UR125564939", "Content": "We got conned into buying a one week package last year, we were promised all the amenities that an owner would receive ie. Free owner lunch and breakfast everyday. We also were told we would not have to listen to any time share pitches again. There were 3 owner meals the entire time, the agent had lied about everyday. We also had to sit thru another 90 minute time share presentation where we were lied to every step of the way, including them pretending that they held a unit at a wrong low price and what a deal we got. (eyeroll) Even when we complained about the safe not working, dining room light switch didn't work as well as several other problems they just didn't care. We had building 5600 and it was outdated our condo at Caribe Cove was much nicer for hal the price. We were told only owners get the nicer unit. If your trying to entice someone you think they would give you the best of the best? This resort is overpriced for the rooms and if you look around you can find newer, nicer condos for half the price. Drunk parents at the pool was disgusting, one even made his daughter vomit because he got mad and held her head underwater until she vomitted (all over the pool deck) I called security, but by the time they arrived all that was left was the vomit as the family went back up to the room. Its \"ok\" to stay here but you'd get less hassle and better value of your money staying at another condo. I wouldn't recomment this company or resort to family or friends. Stay away from Westgate, alll they do is lie thru their teeth. Do NOT get sucked into this timeshare.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Harrisburg", "Title": "“Another Good Week in Kissimmee - Westgate Town Center”", "Author": "PA-Short-Term", "ReviewID": "UR125461870", "Content": "My wife and I have been owning a mid-Fibruary week since 1999 at the Westgate Town Center. Every time we come down to stay at our unit it is the same experience. The unit is extremely clean and they are supplying everything you need for the week. There is now a sports bar and restaurant newly added this year. They have a limited menu, but what they fix is very good. There is an updated game room and there are now 14 heated pools on the property. The only thing we do not really enjoy is the insistance on a sale presentation every time we check in. We absolutely stead fastly dig in and refuse to go. And they will still call you in the middle of the week a couple of times and beg you to go. But, all in all they have done a very nice job at the Town Center.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great resort with everything you need in one place!”", "Author": "krwshl", "ReviewID": "UR125396009", "Content": "I was worried after reading some of the reviews but wow I was impressed so don't let them scare you. No sales speech ever. Stayed in building 5900 which was very new with a great shower. Pools were heated and there were lots of hot tubs. Two pools have bars at them :-) There is a game room with very very new games, like fruit ninja ... I was shocked. Dvd plaers in room and you can rent them for 3 bucks up front. 3 restaurants onsite, short and sandals is an ok bar but service was poor. Shuttle to epcot and universal was great! Departs at 9 or 12 and comes back at 6 or 9. Make reservations at the vip desk in advance and no worries. Would no hesitate to come back, heard they are building a waterpark soon.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Don't go on the tour!”", "Author": "Klj962", "ReviewID": "UR125260942", "Content": "Such a shame that I couldn't give this place An overall 5. Had such a great experience until we ran into the sleeze ball salesman named Pablo who tried selling us a timeshare. For such a beautiful resort it boggles my mind how they let such scum come in contact with their guests. However, besides that everything was fine. Would have brought my kids here for the next 20 years but Pablo and his slimy sales team ruined that. May or may not come back now.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Millville, NJ", "Title": "“Facilities and Location, Location, Location”", "Author": "HeidiDugan", "ReviewID": "UR125129472", "Content": "We've stayed twice in the Westgate Town Center, once in 2006 and once in 2009. Both times we were in a 1-bedroom unit (not a studio ... a full separate bedroom), once with our two kids (then 4 and 7) and once without. Westgate Town Center is clean and spacious, both the grounds in general and the unit, itself. We used the pool, but didn't make use of any of the other resort facilities. We were in orlando for Disney World and that's where we spent our time. As for the timeshare pitch: We are not owners, but my MIL is and we used her weeks. One our first visit we attended the \"owner's breakfast\" and were pitched buying additional time. We made it perfectly clear from the start that we had no intention of buying and we didn't feel pressured. On our second visit we were asked at check-in to schedule a breakfast meeting and we declined because \"we didn't know what our schedule would be\" and because we would \"be spending so much time in the parks.\" We received one follow-up phone call voicemail, which we ignored. As for the unit: we LOVED having so much space. To be able to actually unpack all of our clothes for the week into dresser drawers and hang items in closets was priceless. Having a full kitchen, we did some minor grocery shopping and saved a ton of money by mostly eating breakfast in the timeshare each morning and by packing snacks to carry into the parks. Plus, on our non-Disney days, we cooked small meals in and enjoyed the space to relax. Sure, the decor looks like a Florida retirement community, but that's kind of the mood we expected -- teal, coral, pink, etc. The kids loved the jacuzzi (it was too cold to use the pool most days) and we stuck them in there in their swimsuits and they had a blast. Possibly the best thing about Westgate is the Location. With our kids, we left the parks each afternoon to return to the timeshare for naps. With our own rental car, we could buzz back from the parks, sleep for a couple of hours, and return to the parks. The resort is only minutes from the South entrance to the Disney property ... especially close to Disney Hollywood Studios and the Animal Kingdom. We love our time at this resort and enjoy having so much space, making use of the kitchen facilities and especially the location!", "Date": "February 24, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Poor Customer Service”", "Author": "Josh3695", "ReviewID": "UR125062527", "Content": "Ok .. this was my first attempt at a timeshare / condo thing. I purchased a week just to give it a shot and boy am i glad i didn't commit to anything long term.So before I left I had talked to a few of my friends and they warned me about the typical things to expect from \"timeshares\" si I called to verify any hidden costs that I might see from their past experiences. One of which was house keeping. While on the phone with the front desk the rep assured me that there was no fees to have our bed linens changed daily. We even called back and spoke to a different rep and got the same answer. So we make our trip down to this establishment and go to check in and were behind about 10 people doing the same. After about an 90 mins of watching 2 staff members muddle their way through the process and 5 staff members chatting behind the counter .. it was our turn. Got to our rooms .. which were very nice and clean and very roomy. We get up the next morning and call house keeping to discover that not only is there a charge for new sheet service .. they will not change them .. they will only deliver them to your room. So we make due with doing the laundry daily until the \"complimentary cleaning\" that is provided in the middle of our stay. After we arrive back to our room we discover that not only did they not change the sheets .. they didn't do anything else ... so much for a \"complimentary cleaning\" Then I get a phone call from the office telling me that because they have changed a lot of the perks from when I first bought my \"package\" that my wife and I had to come back to the office and sign some more papers so that I was informed of my new \"perks\". I bet that they just want to try to sell me some more of their \"packages\". NO THANKS!!!", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“coming home”", "Author": "jameshunter005", "ReviewID": "UR124960703", "Content": "Just back from Westgate after two weeks wonderful holiday, fourth time staying there and it just keeps getting better .Great on-site facilities, really great accommodation and a shower you could spend an hour in.On a nice stretch of the 192 with in walking distance to Sizzlers for breakfast ,all you can eat for $ 4.99, a TGI Friday an Outback Steak House,Wildside for ribs and many more. A short drive to Animal Kingdom and access to all Disney Parks and about 30 to 40 mins along the I 4 to Universal,20-25 to Seaworld and a must ,is a trip into Celebration about 10 mins away, the same distance along the 192 is Kissimmee Old Town great vintage car rally on Friday nights Whole family 8 and a baby had a whale of a,time", "Date": "February 21, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Bait and Switch”", "Author": "Amanda O", "ReviewID": "UR124901690", "Content": "My husband and I just returned from the Westgate Town Center \"Hotel\" which we stayed at from February 12-February 17, 2012. We booked this through a hotwire deal that you couldn't see the hotel you were booking, but it would be a hotel similar to a Hilton, Hyatt, Wyndham, Westin, or similar. We have stayed at these other hotels, so we know what this type of experience should be. After we processed our selection the Westgate Town Center Hotel came up. We had not heard of it, but we were willing to give it a try. We started to do our research, and realized it was a timeshare condo type of place. A hotel in our opinion is much different than a timeshare condo. You know what to expect at the hotel (toiletries, cleaning service, beds, etc.), at a timeshare condo (or Villa as they call it) you have no idea. I made a call to Westgate to find out a little bit more before our trip. The phone number reached an central answering service, not the front desk of the hotel. The person did not know specifics regarding the place we were staying. This was concerning, but we were still willing to give this place a try. She told me we would be booked in a \"studio\" (again, this is not a familiar \"hotel\" type of stay) and the studio had a King size bed and a couch area. I asked if we needed to bring shampoo/conditioner, towels, etc. She did not know, but put me on hold and told me that the first shampoo/conditioner would be complimentary, but we would have to supply the rest. We also saw that we would be charged a resort fee of approximately $10 per night for amenities at the resort. The listed amenities were transportation to Disney and Universal, exercise facility, VIP services, ticket desk, internet, mini mart, game room, etc. (28 amenities listed on the site). At one point, we called hotwire because we felt that this listed as a hotel was not accurate. They said there was nothing that could be done. Now on to the actual trip.... We arrived around midnight because of a late flight. **note bring your itinerary to show the gate person so you can get it. We had ours, but this could make getting access difficult.** The front desk process seemed to go smooth, but the person at the counter claimed not to know anything about any of the amenities and services and said to come back the next morning (this was after having us fill out whether we were satisfied with her attitude in some sort of survey thing they give people). Although we mentioned several times to different employees through our trip that we had never been there, nobody explained any of the amenities to us or where to find things that we had paid a \"resort fee\" for. She gave us our room keys and sent us on our way through the giant compound known as Westgate. We arrived at our room and upon opening the door we found that we had two beds that were maybe full size. The bedding was scratchy, the room looked outdated, there was a mocha colored weird looking blanket, a loud continuous fan sound (the air was off), and a giant window that looked right into the room from the public walkway. There was no couch area. Here is a summary of what else we experienced (off-peak season): - Unfriendly service, no information when we arrived and everyone we talked to at VIP services was rude. - Definitely not a \"hotel\". - Not the same caliber as a Westin, Hilton, Hyatt, etc. - Fridge was broken - Air conditioner was okay, but loud - Walls very thin - Scratchy low grade sheets (I even had a burr in my bed that poked me for 2 nights before I figured out what it was). - Resort fee never mentioned by staff. Just given a fee summary at checkout. Also, they take a $50 deposit in addition to this at the beginning of the stay for incidental. - Cleaning service did not vaccuum. Only seemed to replace towels, which were small and poor quality. Definitely did not wipe down the bathroom floor either. At least not when we were there. Maybe this is the policy. Not sure since nobody ever explained anything about this \"hotel\" to us. - Security staff were the friendliest out of everyone we encountered. - The transportation to the theme parks is confusing. There are limited spaces available and you have to sign up for them ahead of time (at least a whole day) at VIP services. We went and signed up and the girl did not explain where to pick up the shuttle, how to get back (when I called to verify how we get back the guy that answered kept saying \"it's on the sheet\". They circled the departure time, but they did not circle anything for return. There were two times listed and a bus location number, but no directions. On the bus, the driver did not explain either. We found out that you bring your sheet to your departure driver (hang on to it!) and then you bring it with you again when you want to leave and stand at the location indicated on the sheet and show it to the return driver. They will not let you on if you do not have it. - Discount tickets are only available if you are going to a park for more than 1 day. It is worth buying them from hotel though if you do not wish to stand in line at the park. In order to get the discount you will need to sit through the timeshare speech. The ticket salesperson was helpful and nice and did not make us sith through this because we were only going one day. - Pool area near our room in the 5900 building was decent. Needless to say, the experience could have been a lot better. We were told very different things and provided comparisons that were not even close. This place might be decent for families though, but not for a couple looking for an easy get away. We would not do this again.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Pittsburgh", "Title": "“Wonderful facility matched by wonderful services and amenities”", "Author": "MikenPittsburgh", "ReviewID": "UR124899296", "Content": "This was perhaps one of the nicest places we have stayed at. The room was incredible in every way - large rooms, balcony, huge jaguzzu, full service kitchen, comfortable leather couch, and the nicest bathroom area with the greatest shower ever! Every worker on the resort (and there are lots of them) were very friendly and helpful. The food was good and they really catered towards resort owners (discounted food, etc.). we will be certain to check out all Westgate Resorts for future travel, it was that good!", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“Westgate Town Centre & Vacation Villa's”", "Author": "YanchikSiberia", "ReviewID": "UR124662016", "Content": "I have been coming here for quite a few years, in fact I am still here at the moment and I think that its a brilliant place. Sometimes things are a bit funny but go to front desk & they always seem to resolve problems.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "grandmahenry", "Title": "“Wow!”", "Author": "grandmahenry", "ReviewID": "UR124373447", "Content": "We just got home from the Westgate Town Centre and could not have been more pleased. The condo we stayed in there was huge, lovely and even had a jacuzzi for two in the bedroom - which we used a lot. The staff were lovely and helpful. We thoroughly appreciated the full kitchen with dishwasher and garbage disposal. It's close to everything, very secure and clean, clean, clean. Lots of amenities. The Shorts and Sandals cafe was good too. The downside is teh timeshare presentation, although I suspect you don not have to attend, we did and it was confusing; we went back and asked for more clarification which the staff gladly provided. We were not interested in a time share and there was no pressure. We would stay there again and recommend it to others without hesitation. We also had a view of the Disney fireworks every night.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Canada, Kentucky", "Title": "“Poor service unless you attend seminar”", "Author": "Chai T", "ReviewID": "UR124276888", "Content": "Well, it started out nice when we got there, got to the front counter, then was told a representative was coming out to greet me. Well I didn't want to attend the breakfast/lunch seminar where they try and sell you something. They were sooo persistent that it got to a point where the person actually said 'so do you want to stay here or not?'. I won, since I still declined. After I finally got my keys and went to the room, everything was fine. The next day they cleaned my room and all was fine. The days after that though, I noticed they decided not to clean my room or change any of our towels. Hmmm..I guess if you don't go to the seminar, all the amenities cost you money..even the maid service! Not the end of the world. Just not the experience I expected.. Last but not least..my wife found a giant cockroach under her shoe in the closet..oh well. Still had a great trip.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "MIchigan", "Title": "“What a change since 1999”", "Author": "Mike151", "ReviewID": "UR123845002", "Content": "Back in 1999 many things went wrong including not getting the room we requested which cast a pall on the week. We also have been staying at the Marriott Grand Vista on our last 2 family (12) adventurers to Orlando. We had an extra week to use from Interval International and decided to give Westgate Town Center another chance. What a pleasant surprise. Because of delays in Atlanta we did not arrive until 2AM. We had a brief discussion about our past experience with Westgate with the front desk person along with our current reservation. He apologized for our past experience and offered an upgrade to a deluxe 1 bedroom suite for a substantial discount. We were exhausted and decided to take the offer of the upgrade. The room was everything we expected ground floor and away from the pool noise. We had a full kitchen, large granite dining table and matching kitchen counter with eating counter, comfortable living room, king size bed with a Jacuzzi tub and large walk in shower with a waterfall and hand held shower head. Our porch faced a pond and a little used back road, for the most part a nice private quiet setting Our first impression on the way to lunch was the outdoor amenities, the pond with swan paddle boats. the put put golf with prehistoric animals through out and walking paths around the pond. We had lunch at the sports bar that has a great menu and excellent drinks. We walked the perimeter of the campus every morning and noted how well maintained the grounds were. Although we never inspected the two story units we staid in in 99, we were told that they were all in the process of being renovated and updated. There were several pools in our are to pick from but stuck with one for the week. It is a free style pool with a good size hot tub with several jets. You could order lunch and have it delivered to your location anywhere on the campus. We found the resort to be in location that was easy to get to all the attractions in and around Orlando. However on this trip we were not interested in the main attractions. We did go to Universals City Walk and Downtown Disney. Of the two, Disney was the better choice for the number of restaurants and entertainment along the streets. At City walk we ate at Bob Marly's and Disney at the House of Blues and would recommend both. Then the was Joe's Crab Shack on 192 a short distance from the resort. What a fun place to dine and again a great menu and drinks. We are not owners at this resort but noticed most all the activities were free to members along with a 50% discount at the restaurants. Our best advice is to use a GPS voice direction device. We used an app on my cell phone that made it easy to get around with no hassles. Yes this trip to The Westgate Town Center changed our opinion of Westgate and probable will return with our family for our next Disney trip.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Myrtle Beach", "Title": "“Wonderful vacation”", "Author": "Jeanette R", "ReviewID": "UR123697012", "Content": "I recently stayed at Westgate Town Center during the holidays. This was my second time there as an owner and my first time in a three bedroom. I was traveling with my husband and 4 children and 3 grand kids. My oldest daughter had a 1 bedroom in the new building not to far from the building that we were in. We were able to check in early and that made a big difference having the children. The place has improved so much from the last time that we visited. The children loved the bikes and the paddle boats. Being an owner does make a difference, we pay little or nothing for things. My son and his friend loved the new sports bar. My daughter took her kids to the arcade, but decided to go to Chuck E Cheese instead. The arcade is too expensive even as an owner. We had great discounts for breakfast and lunch. Owners got 50% of lunch and breakfast. I was happy with the housekeeping service. If you ask for something, it is brought to you immediately and plenty is provided. I loved the room we were in. We had a three bedroom in building 5000. It was a lock-out unit. My son had the studio unit, which was big the only thing it didn't have was a full kitchen. The two-bedroom had full kitchen with lots and lots of space. My daughter and her husband enjoyed the property so much that they are considering buying.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "3.0", "Value": "1", "Sleep Quality": "5", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Orlando, Florida", "Title": "“Does not measure up to other Orlando/attraction area resorts”", "Author": "120nativeFL", "ReviewID": "UR123624816", "Content": "I booked reservation here through DreamVacations.com, more specifically Condos Direct. I got the 2bdrm for $400+ for a seven night stay. Upon visiting direct website for Westgate Towncenter I saw there was a standard 2bdrm, and a deluxe 2bdrm. Of course deluxe was much nicer, 1200+ sq.ft versus 690 sq.ft for standard. Deluxe had larger kitchen with updated stainless steel appliances, and much nicer furnishings. I called resort directly to confirm reservation, I also asked about possibility to get an upgrade to a deluxe 2bdrm, and how much that would cost. (I was more than willing to pay a reasonable amount for upgrade) Clerk told me she was unable to do that herself, but she would make a note of it in reservation, and if upgrade was available, it would be furnished at no extra charge. Upon arriving at resort, you pass by Westgate Vacation Villas, which look like they have been around since the seventies, granted Towncenter more modern, but maybe eighties, nineties- more modern. When I checked in, asked clerk if I got the upgrade, she looked through reservation, smiled, and said \"you got it\". Upon arriving at room noticed immediately that it was standard room, not deluxe. I called to front desk, and said I was told I would be in a deluxe room, clerk replied, in not a great tone, \"did I pay for an upgrade\" I explained process from confirmation, to check in, and what I was told by two representatives from resort. She placed me on hold to investigate, when she came back on line, she said she did not know why front desk clerk told me that. I could not receive an upgrade, because none were available. Again tone of this person was dismissive, and condescending. I said thank you, and goodbye, and hung up, knowing I would get nowhere with this person. I did not pursue it, as I should have. My thinking was, Westgate clearly is in error, let them step up and acknowledge the mistake, and make good on it. They never did. That one incident soured the whole week stay. I was in building 5500, sixth floor. View was of lake/swamp depending on how you look at it. Ugly power lines, and a road with frequent, and load traffic noise. Plus and minus of the unit: PLUS: Very comfy bed in master bdrm Very nice shower in master bdrm large balcony, nicely furnished granite surfaces throughout MINUS: uncomfortable \"pleather\" sofa in living room kitchen appliances outdated-dishwasher looked antique, and so loud no coffee mugs ceramic tile throughout living area, had grout so dirty that it was completely black in many areas toilet in hall bathroom continuously clogged clothes dryer controls did not work properly horrible view(see above decor outdated-other reviewer here said \"golden girls\" that summed it up quite good Resort grounds were adequate, but could have been so much nicer. Pools were basic, 13, I believe they had. Better to do one spectacular pool, instead of 13 basic. Saw sign for proposed water park, looked promising. I cannot get over not getting upgrade to deluxe unit. If clerk told me upgrade was granted, then grant it. If clerk truly was in error, then offer SOMETHING to make up for her error. Hard to believe though that no deluxe units available, since resort was fairly deserted during my stay 1/07/12-1/14/12. Just an inexcusable failure on Westgates part. In summary, too much of this resort is outdated, and it looks it. There are SO MANY resorts in Orlando/attractions area. Why settle for this?", "Date": "January 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St. Catharines, Canada", "Title": "“Great Place to stay!!”", "Author": "Dominica_11", "ReviewID": "UR123600426", "Content": "We spend a vacation week in Westgate Town Center and I must say I was pleasantly surprised. After reading all the negative reviewes we were hesitant to stay here but I am soo glad we did! The location is great, only 10-15 min. drive to the Disney Parks. ( rental car is a MUST). The property is huge with tons of activities a beautiful lake, game room, several restaurants, bars, shops, spa, 14 pools (all were clean and well maintained). Near the resort we found Sizzler's with all you can eat buffet breakfast for $3.99 per person ( get coupon in resort's comp. magazine). We were checking in a little after 6 p.m. and it took us no more than 10 min. We were escorted to the Resort representative who quickly explained the benefits of attending presentations. We knew far ahead that we were not interested in attending and after saying \"No ,Thank you\" we were never bugged again. We asked the girl at the desk for a higher floor and were given the unit on the 8th level, one bedroom ,spacious and clean. We loved the large balcony and jacuzzi tub in the bedroom. Large flat screen tvs in both bedroom and living room. Rainforest shower, plenty of towels. Fully supplied kitchen and large fridge, washing machine and dryer. Overall the unit acceded our expectations and had a great value, since we got a special timeshare exchange rate. I would reccomend this resort to anyone and when we go back to Orlando this will be our first choice place to stay. Thank you Westgate Town Center.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portage, MI", "Title": "“Can't wait to come back”", "Author": "Pam T", "ReviewID": "UR123390377", "Content": "A few months ago we stayed at Marriotts Grande Vista, and even as a devotee of that chain, I have to say Westgate won me over. Our 1 br deluxe villa is huge, nicely decorated, with high end finishes and amenities. Just being left several packs of detergent for the full size stacked laundry is something that makes traveling light easier, and it's the little things that make or break a vacation. Reading other reviews, I agree that our sleepy, jet lagged brains were jarred a bit by the immediate offer of a timeshare sales presentation when we first checked in. This is a well-oilers machine and you are definitely channeled past checkin to sales. But if you put on your big people panties and say NO THANK YOU, you can bypass all that and be taken by or follow a little tram where a pleasant young person escorts you through the maze of buildings to your room or suite and gets you settled. Very nice. Our suite is immaculate with tiled floors in living areas warmed up with tropical colors and rugs, the kitchen and bath have marble counters, there is a huge dining table perfect for planning a days activities (we always feel like an invading army, with our maps, coupons, and local papers, comparing attractions). The tub is big enough for two and then some and has color changing waterfall fillers and bubblers. A large separate shower and dressing room makes easy to all get ready at once. One way Westgate outshines Marriott is in the activities. There are many to choose from and the only challenge is that the place is so big it took us a while to figure out where various things were. No, we didn't ask, but should have as we missed some fun things like making a stuffed flamingo (I thought that would be a cheesy thing for little kids but the results, which we saw at the activities building, we're comparable to build a bear) and tie dying a t shirt. We did play their mini golf course which was just challenging enough to be fun but easy enough to allow for each of us to get a hole in one at some point. It winds around a lake with paddle boats and swan boats so it's scenic and relaxing too. You can rent bikes there as well We weren't in love with the breakfast buffet at Shorts and Sandals, some things were cold, but it was okay and convenient. The local grocery/gift shop is well stocked and, with a call prior to arrival, will stock your kitchen from your list at prices that aren't outrageous, something harried parents traveling with little ones should consider so they don't waste their first theme park day at Publix. What we thought was a problem with our shower turned out to be operator error. You pull out on the faucet and then have the option of standard, rainshower, or both. Once we reported it, they took care of it (pleasantly showed us how to use it). Only other issue was that the pool was too cool to my liking. The one by our building (there are 14 ) was mostly in shade and a kid told us it was cold. That was enough to keep me out. Summer months are probably fine. Full disclosure...we did buy here. Not at full price, but a deeply discounted unit in the older Villas area (we stayed in the newest building in Town Center). We will be back each March for spring training games and ESPN park is just down the road. The Braves train there so we will see our beloved Tigers training games when they are there and not have to drive to Lakeland. The resort is pet friendly and you see occasional dogs being walked, but I never heard barking or any of the sounds you might expect from so many people nearby. Lovely resort with lots to do (as owners, mini golf, boats, bikes and much more are free; minimal fee for non owners) or do as little as possible. We will be back soon", "Date": "January 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "PA", "Title": "“Beautiful family-friendly resort but heavy time-share sales pitch”", "Author": "dohligee", "ReviewID": "UR123320382", "Content": "This resort is ideally located, just off of Rt 192 about a mile from Disney World. The property is beautifully landscaped and well-maintained. The Town Center buildings are newer and the suites are large, clean and provide plenty of storage. There are numerous pools and other amenities at the resort, which we did not take advantage of. We did have dinner in the sports bar and found it to be a relatively good value. The main problem we have with this resort is their super high pressure time share pitch. We had to meet with, no less than 4 staff members before we were finally able to check in and get assigned a room. Each person had their own sales pitch and were so nice and smooth about it that we were signed up for the presentation before we knew it. We're seasoned travelers (and own several timeshares, tho not this one) so should have known better. I got sold by the free breakfast (ok, I was hungry when we checked in, so any mention of food got my attention!). The presentation the next day was very high pressure and we, again, had to speak with a procession of at least 4 more staff members who did not like hearing that we were not going to buy. My suggestion is Just Say No to all offers and avoid the sales pitch at all costs. The freebies they give you are not worth your time! We wasted an entire morning for a mediocre breakfast and a couple of discount coupons. The other problem we had was excessively long waits at the front gate - there were invariably a large number of cars lined up to get through the security gate, and the guards took their time letting people through. Even if you went to the gate that required only a room key, the back up was often very long. Overall, if you avoid the sales pitches, this is a great place to stay if you're going to Disney World, as it's very easy access to and from the parks. The property is very large, gated with secured entry, and easy to navigate. If you do have kids, there are numerous activities available onsite, and the spacious suites provide a full kitchen, including laundry. Internet is available, but not free.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "canada", "Title": "“Westgate town center - had cockroach in the room-”", "Author": "help50", "ReviewID": "UR123039251", "Content": "Checking in process ok but went to our unit and only there 5 minutes and a cockroach crawled across the dresser. We had a good response from the cleaning lady (suggested we move rooms) but VIP services did not feel the same. THey did not see a problem with staying in the room even though they were going to spray the next day. (they said the spray was orderless!) Finally got a new room. (no compensation for the inconvience.) Another issue was the whirlpool tub. It took 3 calls to get someone up to fix it as it would not work. There was also a leak above the hot tub. (tub leaking above us). Our biggest issue was we were assured that we only need to say we were not interested in buying a time share. (we purchased a vacation week and had already done a tour.) We were over 2 hours telling them NO! They even showed us a nice unit which made the experience more frustrating. We never used the pool as it was a ways from the unit we were in. (4000) On a postive note, the unit was clean and not sure why there was a cockroach. I would discourage anyone from staying here. They were dishonest with us and not the kind of service you want for your vacation...not worth it!", "Date": "January 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "marietta GA", "Title": "“good alternative close to disney parks”", "Author": "marieatta_pman", "ReviewID": "UR122694652", "Content": "This is a timeshare property that rents rooms as well, which means there are some special considerations when chosing this company. PROS: the property is gated and controlled by a guard and keycard, which offers at least some semblence of extra safety, and at the very least, makes it a bit quieter even though it is a large property with multiple buildings, it never felt croweded, even the week of christmass - one of the busiest times of the year in Orlando the \"heated\" pools were actually a very nice temperature multiple pools around the property rooms have kitchens - very helpful for keeping dining out costs down very close to irlo brunson pkwy - whch has many stores/restaraunts/gas the traffic flow and driving time to disney was great - less than 15 min with no traffic problems free minigolf and paddle boats lots of onsite activities (did not participate - spent time at Disney- but looked interesting) the cost (via hotwire) was very affordable very quiet CONS the timeshare pitches check in is slow (also due to sales pitch) all in all, i'd stay here again, and i'd make some time to enjoy the properties amenities.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pembroke Pines, Florida", "Title": "“Recent stay week of Dec 11,2011”", "Author": "Tommy745", "ReviewID": "UR122010024", "Content": "Pretty good vacation place. It is a timeshare. Clean and well maintained plus very close to WD parks", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Randolph,Maine", "Title": "“An extended family vacation”", "Author": "MIkkinJay", "ReviewID": "UR121571059", "Content": "This was a return trip for us to Westgate... we stayed there in 2004 also. We did a timeshare exchange to get a 3 bedroom unit. We stayed in building 5600. This unit was almost identical to the one we stayed at in 2004 and we enjoyed it as much. There are many mixed reviews on here so hopefully this will help people. Our group staying here was myself, husband, 26yr old son, 17 and 16 yr old daughters... we were meeting up with my 24 yr old daughter (she and her husband, 2 children and his sister and parents stayed on disney property) First, I have read about people getting less than friendly service at check in..we were excited to get to the resort after so long and I went in all smiles...yes, I was asked my name by three people (all of them smiled at me and forwarded me where I needed to go)...once I reached the desk (very quickly) I was helped promptly! I mention this because the woman who came in after me made a snappy comment to one of the ladies asking her name \" I've already given it three times!!\" and gave attitude. Now, it was true that we were asked that many times but this is a resort that has many venues... I could have simply booked a room, I could have bought a getaway, or I could have exchanged (which was the case). It stands to reason that there are many reason, including security, that you could be directed differently depending on how you were there. This woman did not have the happy experience that I had because she was not a happy person. Grumpy people make it hard to be friendly...just sayin... I declined the \"breakfast\"/sales event and was not pressured. The bell person was great and helped us take our luggage in. Our room was clean, and exactly as I expected with only a couple small quirks. 1. there was no fan adjustment in the bigger part of the unit (this really bothered my husband) 2. the dishwasher cleaned really crappy...it left a heavy film on the dishes and we ended up washing them by hand. not a big deal but could be to some. The great: there were a ton of towels... plenty of pillows...nice deck furniture... a full size coffee pot... washer/dryer unit...ice machine worked great...lots of space!!...very close to disney. The kids used the pool and found it to be great. They do not enforce the pool closing time which I find great for teens coming back after the parks all day. The only room that was really noisy was the girls room that was right across from the elevator and it did sound like people were in the room with you. After walking all day and then a swim they usually slept with no issues. There is plenty of water pressure and we never ran out of hot water. We went to a walmart (within 10 miles) because the local stores are pretty pricey. The activities are expensive! about $9 per person per time if you don't go to the sales show. we got the wifi for the week $39.95...(for ONE piece of equipment) we only used one laptop and it worked out fine... we were told that the McDonald's up the street does have free wifi, but we were fine with the fee...if the credit card you leave at check-in is a debit they hold $50 for the week, but you can apply your wifi bill to that. If you are using this place as a sleeping stop while enjoying florida it is great!! If you are going here for the \"resort\" itself it might not measure up to all that you are looking for... we would stay again...its clean with a great kitchen and laundry in unit making for a happy Mom. :)", "Date": "December 9, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Disappointing”", "Author": "Marti E", "ReviewID": "UR121225775", "Content": "My husband and I selected this property because it is affiliated with Westgate Vacation Villas. We stayed there 10 years ago and had a positive experience. This stay was pretty much the opposite. After a long drive, we arrived around 9:30 p.m. We did not make it to our room until about an hour later. The check in process was complicated for no reason. First someone prepared our keys, then we were passed off to a concierge-type individual who pressured us to commit to attending a breakfast to get \"VIP\" (owner) benefits. We were then passed on to two (2) additional individuals before actually being taken to our room. We declined the breakfast, not wanting to lose valuable vacation time as we weren't interested in purchasing an additional time share. However, this is the only property where I have been an exchanging owner and was treated any differently than a property owner (and did not get the same privileges, access and perks) and that was disappointing. Our room was on the first floor of the \"town hall\" building where check-in and plenty of other activity occurs. While that limited our ability to relax, we also were called one evening at 10:45 p.m. by the on-site pizza shop three (3) times in a five minute period to see if we'd ordered a pizza. We indicated we had not, yet they kept calling. There are doorbells on the units which are appealing to small children and were frequently rung. The walls were paper thin and we could here the guests in the adjoining unit talk and eat. Every night at midnight, the sprinklers outside our unit came on. Other than the bathroom, the set-up of the condo appears cheap. The televisions are the tube-style, the appliances are bottom-shelf KMart brand, the pullout couch is made of pleather, and the bedroom is appointed in decor that was en vogue in the late 1980's and early 1990's. The thermostat is programmed for cost-savings and would not stay at the slightly lower temperature we wanted, which made sleeping uncomfortable. We did not receive any housekeeping during the week. Apparently this, like other amenities one takes for granted at a 'resort', is at an extra cost. Again, I've not encountered this at any of the other dozen or so Interval International resorts where I've stayed in the last decade. I've always received at least one housekeeping visit, about midway through the week. We left a day early and went to stay with my sister on the Gulf Coast. When my husband opened his suitcase to get his pajamas, a large cockroach came flying out of the bag, an unwelcome souvenir from Westgate.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Boston, MA", "Title": "“A great alternative to the parks for families”", "Author": "poohkin", "ReviewID": "UR121178842", "Content": "My in-laws are owners here so we were given a week to stay in a 3 bedroom. The good: About 10 mins to the Disney parks. Very convenient. You have to rent a car or drive your own but it is really close to everything. The newer units are very comfortable, decorated well and great for families. We had plenty of room and space for our large group. It's great to have a full kitchen to eat meals versus going out to eat all the time. And so nice to do laundry on a regular basis. The bad: Get ready for a sales pitch. My in laws own 5 units and we still are hounded to sit through a pitch when we arrive and at least once during our stay. If you're not in a newer unit, the rooms are very outdated. They look like the Golden Girls' house in 1989. The service is not great. When we checked in, someone drove us to our tower, but didn't help with bags at all and there were no luggage carts to be found. Not a great experience for owners who traveled all day. They have been slow to make updates nd changes. We were sold on new restaurants, water slides and conveniences. Little has been updated in the 4 years we've been going. Lots of talk, little action. Overall, we like how comfortable we are when we stay at a newer unit. The rooms are gorgeous and it's great to have a home away from home when traveling with family. It's close to he parks and a great plce to relax in the hot tub after walking all day.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "1", "Rooms": "2"}, "AuthorLocation": "", "Title": "“I am back again!!”", "Author": "sonicma", "ReviewID": "UR121081704", "Content": "Well everybody knows about my review in July yeah well if westgate sent you a sorry note don't listen to it they just want you to feel better about and come back and give them more money they do not care about your service or anything they care about the money and that's why they hired all those foreign people so that when you tried to complain to them they do the \"I no speak English\" on you I would recommend the other westgate the one before you get to this one thanks for your time!!! :-) :-(", "Date": "November 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New Richmond, Wisconsin", "Title": "“Getting better!”", "Author": "bearpawqs", "ReviewID": "UR120826480", "Content": "We are owners who stay once a year. Our stay this year was better than most. We do find the facilities to be well maintained and clean. We were also treated very well by the staff. I must say though that the sales department does not take no for an answer. As owners we are not obligated to attend the owners breakfast where we are \"updated\" on changes they want to tell us about. Word of warning, this is the hook to get you to listen to the same 90 minutes spiel about buying more! We go during the off season so the check in process is usually fairly quick. I would much prefer to just get my key and go to the unit. We have been there long enough and we know where we are going. We don't need someone to take us to the unit and turn the lights on and off and leave without so much as two words. We also don't need to stop at all those stations and get a welcome packet of brochures we typically just throw out. For first or second timers this is a great service but for us lifers please make it stop! Another word of caution is that in the Town Center buildings there is absolutely no insulation between the units on each side of you or above you. So you can hear every conversation, fight, fart, banging cabinets, and EVERY flushing toilet! The buildings must have been built as cheaply as possible so be warned, if you get noisy neighbors next to you or above you you will hear everything. Specially the whiny, crabby, crying children. You can bet a herd of elephants will be in the unit above you too! Another observation I have made and have seen no improvement on is the fact that pedestrians simply do not have the right of way at Westgate. The place is simply overrun with golf carts. They do not respect the pedestrians. I was almost hit several times. So watch your kids! It sure would be nice if they had at least one of the 14 pools designated as an adult pool, no kids, and no throwing things. Don't get me wrong, it's great to see families having fun together but when they are throwing footballs and frisbees from one end of the pool to the other it is very difficult for others to also enjoy the pool. The vast majority of people sure don't have very good throwing arms! lol. So again, be advised if you are not one of those families who take over the whole pool, find one of the lesser used ones. If Westgate should read this review, please figure out a way to have recycling stations where we can drop of our cans, glass, and plastic recyclables. You also need to have channel guides in your welcome packet or in the room.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tampa, FL", "Title": "“Rocky start with a great finish”", "Author": "DraacoPendragon", "ReviewID": "UR119256078", "Content": "3 Years ago a friend and I went to a timeshare presentation at the Westgate Town Center, \"Taking one for the team\" to get some cheap tickets to Universal. I rejected all of the offers except the last which was very reasonable, a well priced 1BR Villa vacation package with payments over time...I made my reservations and paid the extra $200 for a two bedroom villa so that my father and his best friend could come down as well (he needed a vaca in the worst way) So here's the goods: DO NOT, if at all possible, stay in the older section of villas unless your #1 priority is the 25% more privacy. When I went on the tour they showed me the Town Center rooms (the high rise looking over Disney property). When checking in I was given an older 2BR villa they said was newly renovated with several problems (thermostat broken, lights crooked on the walls, handles from furniture broken or missing...) I was in \"Here we go\" mode, so I called the front desk and asked to be moved to a different property, not expecting much. I was pleasantly surprised at the quick response, and the gentleman who assisted me was very helpful. He showed me 3 different possibilities, all of which were nice, but the one we settled on was the exact room we had toured 3 years ago...from then on it was all thumbs up. The 5th floor high rise villa was fresh, well decorated, and very open (I'm a huge fan of open floor plans). Smaller but well furnished kitchen, mid sized balcony with a table and chairs (View was the best in the place tho phone lines took a bit away from what would otherwise be very nice), and a perfect sized living room with a large sectional and television. Master bedroom was a real treat. King size bed, mirrors everywhere, a large hot tub, dual head shower, 2 sinks, and an entrance to the balcony. Only downside was a very small toilet room. Lighting in the bedroom was on the \"mood lighting\" side, not incredibly bright, but sufficient. Second bedroom had 2 Full size beds, good view of the property, its own TV, and a very nice little shower/bathroom combo. Separate in-ceiling lights for both beds as well. The property is fairly large, featuring 13 pools (which were dead as it was off-season), a few places to eat, and tennis/volleyball/basketball courts. Each building has a pool nearby so you don't need to walk far if you want to swim or hop in the jacuzzi. The food, from two restaurants that we sampled (Having the vacation package entitled us to be \"Owners\" for the week and as such we had a large discount on meals and activities, some of which were free) was very mediocre so we decided not to eat on property. There were various activities that we did not participate in such as crafts, a Dinosaur themed mini golf that was very low skill level but a nice diversion for kids and families, catch and release fishing, paddle-boats, and more. Again, it was off-season so there wasn't much traffic at the resort in general. The resort is very close to Disney, but offers very little in terms of transportation, so if you want to make your own schedule, you will want to plan on driving or getting a cab anywhere you want to go. The shuttle service to Disney, for example, had one bus leaving in the morning which you had to register for. The returning bus could only be used by those who used it in the morning and still only had one departure time at night. Wrapped up...The properties in the high rise buildings are great, activities to suck up down time for the family abound, food is mediocre, staff is there to help, and make sure you plan on doing most of the driving!", "Date": "October 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Service": "4"}, "AuthorLocation": "Michigan", "Title": "“Great, kid friendly resort”", "Author": "aswiss", "ReviewID": "UR117980623", "Content": "We stayed here over spring break for a week with our kids and another family. My friends own a time share with a lockout and we stayed with them in the lockout. All together we had 11 people staying at the condo and did not feel the least bit crowded. The lockout was a good size with one bedroom, a living room with a pull out bed, a small breakfast nook and a kitchenette (fridge, toaster, microwave, coffee pot). There was also a bedroom with a queen size bed and a bathroom with a wirlpool. The main part of the condo was 2 bedrooms, 1 bathroom, a living room with a wrap around couch that pulls out into a king size bed and a full kitchen. There was even a washer and dryer. The ammenities of the resort were very nice. There was a movie theatre and put put golf to entertain the kids as well as bikes, paddle boats and a pool. Over all this was a great place, especially for a family vacation. It was also relatively close to disney and seaworld.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "2.0", "Value": "1", "Service": "1"}, "AuthorLocation": "New York City, New York", "Title": "“Save your money”", "Author": "citygirl_beachlover", "ReviewID": "UR117104973", "Content": "Just visited there with friends. I am a modest person and very down to earth so I tend to not complain about the usual stuff most travelers complain about such as \"not so fluffy down comforters\". With that said let me begin, first of all, the service was less than satisfactory. The people at the front desk and sales reps were so friendly until they got what they wanted from my friends who own a timeshare there. Once they upgraded their timeshare, the service quickly changed and we got an attitude from everyone we tried to get assistance from. Now let me tell you about the resort. It is not the worst but certainly not the best and for the price they are asking you would think that the pools and hot tubs would be clean. That was not the case as they were not only outdated but dirty. Also, last but not least, I had 3 gigantic roaches in my room on separate occasions, one of which ran over my foot (yeah gross!). Do yourself a favor and save your money for a better resort!", "Date": "August 22, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Inconsiderate and terrible service!!!!!!!!”", "Author": "sonicma", "ReviewID": "UR117052828", "Content": "Now I just went to Westgate town center for a week with my family in July I was suppose to get a two bedroom one of the newest villas so I am checking in and they give me room CD so I get to my room and little did I know it was two seperate units so we are suspecting it is right but then we realize that we asked for 2 bedroom so we called the front office and we asked told them that we were suppose to get 2 bedroom and then they said to call back the next day so I did and then they said they would let me know what time the room was ready guess wat they called us 8:00 clock that night when they told us it wont be after 8:00 clock that night so they sent a fake representative and we tried to tell her that 16 hours from Baltimore is a dreadful and we were destined to have a great time I had to go through all of this crap so we couldn't get our money back so they gave a 2 day and 3 night I said wat the heck how is that gonna help I want a room so since we were friends we had to sleep in the same bed which was weird I would NOT recommend they rip people and they want to lie about EVERYTHING hence I had documentation of two bedroom on my reservation form so hell no!!!!!!!!", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "1.0", "Value": "3", "Service": "1"}, "AuthorLocation": "San Jose", "Title": "“Avoid this place!”", "Author": "Biazinha2", "ReviewID": "UR116238187", "Content": "This was the worst place I've ever stayed. Here is why I am saying this: 1. Check in took more than 2 hours. 2. At the sales presentation the sales manager called me a liar when I wouldn't buy. Also, the 90 minute presentation turned into a 3 hour session. 3. There is a common entry between two rooms. I was locked out and it took 2 hours to get me into my room. This was at 1am! 4. My laundry was stolen from the dryer in my unit! When I called security they said \"what do you want me to do about it.\" This review is based on 4 days. I still have 3 more to go...", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Otley, United Kingdom", "Title": "“So good we bought!”", "Author": "ELAINE B", "ReviewID": "UR115954214", "Content": "We first went here in 2008 on a timeshare tour so we could get reduced price tickets at the parks and shows. We loved the place as it had all the individual luxury we enjoy-washer/dryer/walk in showers/full kitchen/ 16 swimming pools/ jacuzzi tub etc. and ended up buying. Go for the tour but do not be pressured into buying-the price drops if you hold out. It is worth the cost though if you add up the price of a week's holiday here compared with the timeshare deal, which you then have for ever (to pass on in a will) to use every year or exchange to any other Westgate property. It is only a couple of miles from the Disney parks and approx half mile from shops, restaurants etc. The only problem we ever seem to have is the check in process, which takes for ever to get to the front of the queue and you are then passed along a \"conveyor belt\" of people all trying to get you to come to the free breakfast which is the time share sell. My word of advice is NEVER do this breakfast the day after you arrive as you need to be fully rested to understand the selling patter that they bamboozle you with. It is worth a couple of hours of your time to get the discounted park tickets but say you will come around day 3/4 of your stay. A great stay every time and because of the washer and dryer you need not pack half as many clothes, leaving space for souvenirs. A spa is meant to be opening (in 2009!!) but in the meantime this service is available at Westgate Lakes which is a few miles up the road. You definitely need a car as nothing is walkable, even for the fittest person, but this is standard for wherever you stay in Florida. It also allows exploration further afield and I highly recommend the towns of Celebration and Jacksonville and the shopping malls around an hour's drive away. You will not be disappointed if you stay here.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Millport18", "Title": "“Great time with friends”", "Author": "Millport18", "ReviewID": "UR115950622", "Content": "We stayed in an upgraded apartment - one bedroom with a small kitchen area and a sleeper sofa in the small lounge area. Very clean and you are provided with plenty of soap, shampoo, washing powder and even dishwasher powder as well. Usual large american bed and good TVs in the bedroom and lounge. The room connected through to the next room, which was also one bed but much larger with a jacuzzi bath and a balcony area. Very useful feature for two families. The sofa bed, although it looked good had a terrible mattress - the same was true of the sofa bed in the room next door - you could feel the springs popping through. 13 or 14 swimming pools dotted around so you could always fiind a reasonably quiet one. The first one we visited had poor water quality but the others were fine. There is a shop on site but it was expensive compared to the stores off site. However, we enjoyed ourselves here and would come back and it was definitely value for the money we paid.", "Date": "July 29, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Dallas, Texas", "Title": "“Room was nice but wouldn't stay here again”", "Author": "neoncactus", "ReviewID": "UR115897059", "Content": "We stayed here for our second week in Orlando after staying at the Marriott Grande Vista. Initial check in was smooth, but then instead of just giving me the keys to our unit, a map and a list of the activities, they made me wait for about five minutes for another representative. That representative then tried to get me to a timeshare breakfast presentation. I was told if I went, we could get a card that gave us free access to the property amenities. If I wanted to make an open ended reservation, they wanted a $20 deposit. We had the week planned at Disney, so the extra property amenities really weren't going to be used anyway, so I declined. However, the whole way they do the check in started the week off on the wrong foot. I got our check in packet from her and then we finally went to our unit. The unit itself was nice, it was a 2 bedroom. The only problem we encountered was a lack of hot water. They had maintenance come and fix the issue and everything else was nice. The resort is huge, they have a lot to do, but we never used their pools or took advantage of the movies, mini golf or restaurants on property. The area around it seems a bit run-down, with a lot of discount ticket sellers. They have a lot of activities but there seem to be costs associated with most of them. After coming from the Marriott, where they included many of their activities at no extra charge, it was a turn off. One thing I did like was that coming out of the resort, it was a direct shot into Disney World near Animal Kingdom and we could avoid Hwy 192 traffic.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "SW Florida", "Title": "“Easter weekend with the Team”", "Author": "WallySWFlorida", "ReviewID": "UR115799879", "Content": "Traveled to play the \"Easter Classic\" Basketball tournament . There were 5 families, we had a variety of room types, one being a 4 bedroom, that ended up being the absolute meeting ,eating, and party site. The facility was all quality, all the families loved the whole experience!! We went back in June and it was equally as good!!", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Miami Springs, Florida", "Title": "“Best Experence Ever”", "Author": "PerezMom", "ReviewID": "UR115795385", "Content": "I was very hesitant about this vacation. Never stayed in a time share resort but from the very beginning it was lovely. The staff was great, the room was spectacular (better than any Disney Resort). The time share presentation was basically a comedy show and no pressure at all. I wish I had the money to buy because this place is A++. The room was huge, clean, lovely, had everything you could possibly imagine. Saved a lot on eating out. We got the VIP package for $50 more and rode bikes, paddle boats, fishing, miniature golf for free. They have so much stuff to do you don't have to leave the facility. very close to all the parks. Stay there you will love it......", "Date": "July 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great space”", "Author": "Mesha4u2011", "ReviewID": "UR115305558", "Content": "Nice 3bdr room condo. Cant beat that price for what you get. It costs us about 550 for 6 days! 3bdr 3bath 2living rooms, 2kitchens, 2balconies, 2jacuzzis, standup shower, washer/dryr, great water view, close to disney, alot onsite, need more????", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Newport News, Virginia", "Title": "“Villas at Westgate Resort were perfect for team and family”", "Author": "tni", "ReviewID": "UR115185332", "Content": "We were in Kissimmee for a week-long basketball tournament and had 4 one-bedroom villas in building MMM. We were with owners and experienced their amenities free of charge. The villas were perfect for our stay. The villas were spacious and had everything we needed. We cooked up to 3 meals a day and utilized their pots and pans and dishes. We shopped between Sams, Wal-Mart and Target. Just remember to bring seasonings, cooking oil, etc in addition to the food. I didnt require any additional pans or other kitchen utensils other than what they provided. We made it work. The washer and dryer were extremely convenient and used daily with no issues. Beds were comfortable and plenty of linens and pillows were available. We were replenished with new towels daily, which I didn't expect in a villa rental. Wi-fi was also good with one access point in the center of each building. Weekly access was $40 for guests. The rest of the resort was conducive for family vacations. Plenty of pools with warm hot tubs. (Pool towels provided in the villa). We used the BBQ grills a couple of times. Tried the paddle boats which my kids enjoyed. The movie theater was nice and golf looked fun. We utilized the basketball courts a lot and they stayed pretty full. Kids loved the game room. All in all, a convenient resort. We utilized the villas like our second home and it fit the bill. The resort provided the nice extras that we took advantage of in our spare time. Location was great off 192 and close to food, shopping, and amusement parks. The reason I don't give this a 5 is because of check-in. Check-in is at 4 but they didn't have all villas ready by then. One of them wasn't ready until 7. This should be better managed and could've been a serious inconvenience if we would've had plans the evening we arrived. After 10 hours on the road, most families would not be happy with waiting 3 hours past check-in time...especially when most of us hope to check-in early. This is apparently a commonality there. Do NOT plan for an early check-in here! After that fiasco, we dealt little with any additional customer service and were left with our villa, which was great. We are considering coming back next year if we don't rent a large vacation home.", "Date": "July 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Massachusetts", "Title": "“NEVER AGAIN”", "Author": "disneyO8", "ReviewID": "UR114946529", "Content": "We arrived In Florida early and decided to go to the resort to see if we could get early check in. When we got there we were told to come back at one because our room was not ready. We left to go to Sea World and came back around five to check in. After my wife waited 20 minutes to check in, she was shuttled from station to station and was pressured to sign up for the resort tour for $20 bucks. ARE YOU KIDDING ME. THEY WANT YOU TO PAY FOR A SALES TOUR. We were so mad. How can they expect to gain new members by CHARGING them $20.00 for their tour. We were told that both adults needed to attend the tour, so that was our out, I REFUSED TO GO so we just blew it off. Now here is the good news if you did go on the tour, they offered the following, Free breakfast, barbeque lunch, use of the bicycles onsite, use of the swan boats and free mini golf. All nice perks but the catch here is the swan boats looked like they were going to sink, the mini golf was something from the eighties, the bikes looked like something they pulled out of the junkyard and as far as the breakfast and b-bq, well I could only imagine. Oh and the Thomas the Train look-a-like has gotta go. We always have gone to Disney and usually stay onsite, so we knew this experience was going to be a major drop-off. This was our first timeshare experience and to say the least it may have been our last. Or not, we were so angry at their sales tactics we decided to go on the Disney Vacation Club tour to see how they approach potential client/new owners. They never asked for anything money wise, they gave us a tour that would knock your socks off and when the tour ended they gave us all ice cream, a family photo and a $75.00 gift card to use at any Disney location. So dinner at the Rainforest that night was on them. That is how it's done Westgate. We were so impressed that we ended up buying a time share with DISNEY. Not something we had expected to do. We usually like to split up our day by spending time at the pool. NOT AT THIS PLACE. The pool area was over crowded, mainly because the pool was way too small for the amount of people using it. So we never swam on our trip. (except at Discovery Cove, which I highly recommend). The good, the one bedroom we had was nice and clean. Our location on the bottom floor, corner room was good (no stairs to climb) and quiet. The linens were clean but the blankets were a little scary. We almost went to Target to get our own but we got over it and made it through the week. The grounds were nice and well maintained. When we needed help with a issue with the safe they responded quickly and the same goes for when we needed towels and TP. My advise, DO NOT STAY HERE IF YOU EXPECT 5 STAR AS THEY CLAIM TO BE!!! 3 STAR AT BEST.", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5"}, "AuthorLocation": "Millbury, Ohio", "Title": "“Would recommend”", "Author": "kelnron05", "ReviewID": "UR112718147", "Content": "We stayed for a week the 1st week of June. We stayed in the 5600 building in a 3 bedroom lock-off. We were a little mislead by the room description so we were a bit disappointed when we arrived. The 1 bedroom lock-off portion did not have a full kitchen, washer/dryer as stated on the phone nor was there a balcony in the 1 bedroom. This was very disappointing to both families that were traveling. The 1 bedroom family had to keep coming into our room to use the balcony. We had no problems with that, but there were not enough chairs and sometimes we all couldn't sit out there. We were a party of 9 and did use the balcony often. Sometimes we just wanted some time with our own family and we couldn't, nor could they. I don't blame Westgate for this, it clearly was the representive selling the room to us for his commission. I will say this is the 4th timeshare presentation we have stayed in the last few years. We went to Westgate knowing we were planning on purchasing a timeshare this time. We travel a lot and this works for us. We went in knowing that Westgate has the worst reputation for high salesman pitches! However, they were no different then any other timeshare presentation we have been on. Our sales guy was great and not at all high pressure! We did purchase, mostly due to the low cost and for the bonus weeks. The owner rooms we were showed were 100X nicer then the one we currently were in. As for the room it was decent. It was clean, full size washer and dryer which was nice. I will say even though the room was nice, it was a tad dated comparing it to the other resorts we had visited in the past few years ... Orange Lake, Mystic Dunes and Vistana. All 3 of those hotels were much nicer. But with that being said, Westgate was still nice. The worst part of our room is that we were outside pool 13 and it was SOOOO loud! One night I called security at 11am and then again at midnight. It was just unbearable. I was annoyed no one came the 1st time and I had to wait an hour for security to show up. Pools on that particular day closed at 10pm. There is a Thomas the Train that circles the property during the day giving rides. The kids are big Thomas fans so that was a pleasant surprise! We used it to go to the overpriced market too. A nice bonus. There a lot of activities on site. We did do several of those and enjoyed it. We did the free owners BBQ one afternoon and it was packed but the line moved quickly and it was good for a free, fast meal. They also served FREE Coke, Lemonade, Water and Beer from 12-2pm. We also did the owners breakfast (both at pool 13) the morning we left. The kids enjoyed it. I would recommend this resort. Go and enjoy your trip!", "Date": "June 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Anderson, Indiana", "Title": "“The Best Trip Ever”", "Author": "aysawyer", "ReviewID": "UR112006686", "Content": "My family visited the Westgate Town Center the first week of April. We had a wonderful time! Our rooms were on the ground floor which was very convenient because we had six children in our party. They enjoyed all of the amenities. We were not owners at the time we visited but decided to purchase because of the great experience. Looking forward to our next vacation. The representative who worked with us was awesome! We have kept in contact with her to schedule our Getaways.", "Date": "June 7, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Florida", "Title": "“Beware!”", "Author": "wdwfan10", "ReviewID": "UR110441660", "Content": "First the good-the resort is beautiful, rooms are newly updated, clean, nicely furnished. The bed was very comfortable. Flat screen TV's. Kitchenette w/ full fridge, dishwasher, washer/dryer. One of the rooms we were in had a large shower with double shower head. Plush linens. Several pools on property and lots of amenities. There is a mini golf course, paddle boats, swan boats, gofl course, restaraunts. The bad--this is a timeshare resort. It took us one hour just to check-in. There were literally hundreds of people in the lobby, which is massive, with several different desks and areas where they try to talk you into signing up for a timeshare sales pitch. I actually booked my room last minute via a secret deal with Travelocity, so I didn't know what I was getting myself into, which I will never do again after this trip. We waited in line for about 40 minutes, then when it was our turn at the desk, they couldn't locate our reservation from Travelocity, so we had to wait another 15 minutes for them to find it. We were given a room that was only part of a larger suite, and doors leading to the other part of the suite (which was occupied by another family) were unlocked. We knocked on one door to let them know, and as we were explaining to the gentlemen that the door wasn't locked, a lady from his party walked into our room from another door that led into our bathroom. This door had been locked on our side, so that we couldn't open it, but it was the door to the toilet, so our \"room\" did not have access to a toilet. The man also told us that they had been in our room b/c they had been told that they had the entire set of rooms. We called to let the front desk know that our room was not secure from the larger part of the suite, then called back to tell them about the lack of toilet. We were placed on hold for over 10 minutes, so we went back to the front desk (which is quite a distance away) and they switched our rooms. All of this took approximately 2 hours out of our one night trip.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "4.0", "Value": "1", "Sleep Quality": "1", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paisley, United Kingdom", "Title": "“angry owner”", "Author": "thommacks", "ReviewID": "UR107392268", "Content": "i am a westgate owner so this review does not please me to write it.that is one of the worse weeks i have ever spent in the states.no friendly welcome,got our room wrong and did nothing to fix it,almost tied me to the chair to buy another week,no friendly staff.had people moved in next door that thought they were the only people in the building,phoned down im still waiting for something to be done about it.and to finish off check out is at 10 door bell rang at 9.30 to almost put us out.they call it 5 starr i have had better at a 20 dollar a night motel.PATHETIC.", "Date": "May 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "kissimmee, Florida, USA", "Title": "“Hope it's going to get better”", "Author": "simonrobbie", "ReviewID": "UR107281012", "Content": "After driving from PA over the last two days we arrived. My wife went in to check in and got schtuped into paying $20 and signed up to a 90 minute presentation the next day to get our \"amenity tickets\" we should get automatically as we are timeshare owners here. We finally got into our room (which is awesome except no free internet and blurry TVs). We looked out the balcony to a large sand pit where the water park is supposed to be. WTF? We went into the main area this morning and after being given the runaround for a while, my wife raised her voice. They called security and eventually refunded our $20 and gave us the amenity card. We left and had a great time at the local petting zoo. Hope things get better real soon. The front desk told us the manager came in at 11:30am and would call us. It's 5:20pm now and no messages on my wife's phone or the room phone.", "Date": "May 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "WV", "Title": "“A Few Cons, but overall very good”", "Author": "muscledfuture", "ReviewID": "UR105338380", "Content": "First we travelled with our daughter, son in law and two small grandchildren the week before Easter. We flew into FLL and rented a minivan and drove up to the resort arriving at 1:30 a.m. Arrival/Service- At that hour one would expect quick service and no delay, but we requested a room on the WDW side of the Town Center so we could see the evening fireworks. Our concierge wanted to please us, but the room was under inspection (at nearly 2 a.m). We waited for 45 minutes and then he wanted to put us in the original ground floor suite - not. He corrected and at about 2:20 we were in. The Room- the next morning we were very happy with our suite. Spacious, clean, great view of Wilson Lake and WDW fireworks. We were near the pool with a snack bar, across the street from the mini golf and swan boats, activity center and fishing. The train stopped out front too- but it was basically a train to nowhere- just ran around the resort with no narration to point out the landmarks etc. There were hundreds of golf cards moving staff and timeshare tours though. AC worked fine and suite had a washer and dryer. The pool towels were small and thin, no tea pot or cookie sheet found, and the dishes were all glass (not my preference)- mugs for coffee small (Irish coffee glasses). We had room 5451 and the last couple of days one of the elevators was broken. They were painting and blowing leaves, planting flowers etc, throughout our stay. Services- They had mid week towel service which was nice but not necessay as the wasker/dryer was there. Service was slow at the pool bar and you had to carry cash as they would not let you charge it to your room. The activities center closed down at 7 p.m., which is way too early as the best time to do some minigolf is after dinner. They should remain open until at least 11. Movies in the theater- same thing. A later showing (9ish) would have been nice. The daily shuttles to Disney were at 9:15 and 12:30, with scheduled returns at 5:30 and 7:30. They filled up fast and we were not able to use them at all. The 30 weekly fee to use the facilities is easy to recoup if you golf a couple of times. Overall, I would rate the service as just average. We had a slow toilet drain one day and though the guy came and fixed it fairly quickly, he wanted someone to wait while he sent housekeeping to \"clean\" . Forty five minutes later no housekeeping and we went about our day as we felt we had wasted enough time. The resort is big- it was very crowded at the pool nearest us. It was really hot too, so the playgrounds were unusable due to the sun. The had a huge water slide-inflatable, but it cost 2 dollars a trip or 10 dollars an hour- direct sun. We opted out. We did not eat at any of the restaurants, but we did get snacks one day at the pool bar. Not impressed by service or prices there. Pools- there were a lot of them. The pool bars serve dark blue napkins, which invariable ended upo in the pool by mid afternoon. Not much shade available and very crowded. The hot tubs were pretty gross with mulch dragged in by folks who couldn't walk around or keep their kids from walking through. The kids'/wading pool with a watering umbrella was cold. Our waterbugs couldn't stay in there long. Pools open late- no lifeguards, few rules. Adults must keep a close eye on their kiddos- many did not. Location- one mile from Disney-as the crow flies- but in reality it is about 7-8. Parking 14 dollars a day at any park. There is not a good grocery story with bakery and deli nearby and the liquor store is pricey. Go once early in your stay to International Drive and get food and snack and alcohol. Plan ahead and you will be fine. There is an Edy's ice cream and discount gift shoppe about 3/4th of a mile from the resort. If you want luxury- skip this place, but if you want roomy, mostly clean comfort for a family, this will fit the bill. There is a good 3G network, so if you don't need a laptop and have an I phone save the ridiculous internet fees. Oddly enough, we were NEVER contacted one time about doing the timeshare tour! YAY!", "Date": "April 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Steamboat Springs", "Title": "“High Pressure Timeshare Pitch”", "Author": "sswsc07", "ReviewID": "UR105253760", "Content": "As a Westgate owner, I was not prepared to have to sit through yet another timeshare salespitch. It was high pressure and unpleasant. The lobby/reception area was unbearable with hundreds of people waiting in massive lines. It was worse than the lines at the attractions. Once settled into our room, which was very nice, we immediately realized that you could hear each and every noise coming from the adjacent rooms, including screaming babies and snoring adults. When the phone would ring next door, we literally thought it was our phone. Smoking was allowed on the patios, which made our patio unusable as the smoke would waft right in. There is no maid service unless you pay for it. There is no recycling program which I found amazing for a resort of that massive size. The pools were extremely crowded and the poolside bars and snack bars were overpriced. The one fitness center was way too small for the huge number of guests. And you had to pay $25/week for internet if you were an ownere. If you were a non-owner it was $40/week.", "Date": "April 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“one of the best places for families”", "Author": "coruna1", "ReviewID": "UR104969837", "Content": "As owners is the first time using the Resort, this review is for building 4000 in the town center. we were given an A & B room which is a 2 bedroom unit with 1 small kichenette and a full size kichen, 2 bathrooms & 2 living rooms, beautiful decoraded and kitchen is fully equipped with everything you need, washer and dryer, screened balcony with a table for four and a launche chair, located on the 8th floor. The only negatives are that walls are thin and people dont have respect for other people(banging doors at odd hours and sometimes talking loud) This building doesnt have a pool but is a short walk to other pools that are share by the people staying at the villas and the palace. The pools are okay, mostly very crowded and lots of people playing rough in the water as there are no life guards, if you have small children this can be a problem. The resort has a grocery store,deli, pizza restaurant and steak restaurant, we only use the pizza delivery which is was great and delicious, employees were nice, the sales men that try to book us for a meeting was deceiving and it was a little difficult to get him off the phone and to top it off he called us again a 8am that was anoying. As an owner we are very please and plan to come back as we have 4 weeks per year.", "Date": "April 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Prior Lake, Minnesota", "Title": "“Loved the place”", "Author": "hotzhouse", "ReviewID": "UR104202880", "Content": "We reserved a studio and were pleasantly surprised. The room was big - bedroom connected to living, dining, kitchen area. The bathroom had a jacuzzi which we enjoyed and was very large. The resort was quiet and the rooms were great. The pool was close by and had a bar connected with it for food and drinks. We'll stay there again and again.", "Date": "April 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sunny Isles Beach, Florida", "Title": "“Excellent Resort with Great Service”", "Author": "ScatmanGL", "ReviewID": "UR102714736", "Content": "Took a weekend trip from Miami and this is the best place to stay if you plan to go to Disney Parks. Excellent accomodations. Excellenet management team who strive to provide great service. Will come again when the weather gets cooler.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Would stay again”", "Author": "DLST", "ReviewID": "UR101739077", "Content": "This was our second time at Westgate. The 1st time we stayed in the Vacation Villas in 2008. This time we stayed at the Town Centre, which is all part of the same complex, the Villas are two buildings, while the Town Centre is 6 to 8 storey buildings. For the most part our stay was fine. We arrived later in the evening on a Monday and check in was a breeze. No timeshare pressure, nothing, although they send you to three different people prior to someone taking you to your room, but still took less than 20 minutes. We had booked a 2 bedroom suite from Expedia.com. The suite was nicely maintained, pretty clean. Two double beds in 2nd bedroom, I think a queen in master room, and pull out couch. Well stocked kitchen. Bathrooms had plenty of towels and toilet paper. The only down fall was that this suite faced a very busy, very loud pool. The first night, since we arrived later and were very tired, we did not call security, but the 2nd night it was even louder, there were lots of young adults in the pool and hot tub. Around 2:00 a.m. I called security. Security claimed that the pool gates were “locked” every night and that the people must have “jumped” the fence. Somehow I don‘t think that the pools are locked, because you can hear the gates slamming shut when someone opens them. But security said they would send somebody and they must have because it did quiet down. The next day (Wednesday) I asked to be moved to a quieter building. They moved us no problem. Second unit was great too. The only issues with that suite was that some maintenance guy rang our doorbell at 12:45 a.m. Saturday night to ask if we had used the hot tub in the past week, and then mumbled something about a leak in the unit below us and left??? Not sure exactly what that was about. We had our infant daughter with us, so I was NOT impressed with that! The 2nd issue was also on the Saturday. New people moved in above us, and it was like a heard of elephants. They were awake until 4:00 a.m, screaming yelling, jumping, running, etc. The walls and floors are very hollow. Sunday night same thing, finally called security about 3:00 am. After that night, they were okay, you heard a bit, but it was manageable. Every morning, housekeeping came by to take the garbage and see if we needed new towels. Everyone we encountered was friendly. We did get a timeshare request late in the day, the day before we were suppose to leave. A man called saying I had to sign a sheet saying everything in the unit was in working order, so I met him at the main club house, and after a few minutes realized it was a timeshare pitch, I just politely declined, stating that we did not travel often enough to invest in a timeshare. Besides, now that we had a baby, we needed to put money into her education savings. He was fine with that and I went on my way. If we ever go back, I will know to decline that phone call. We used several of the pools on the complex. Being March, they were all pretty busy. All of them, except for one were warm. Warm enough so that it was comfortable for our 11 month old. We walked around the complex quite a bit and it was nice. The only thing what would have been nice, would be for Westgate to add a children’s splash and play area, the kind where little kids can sit and stand and play in water not too deep, but I think that they might be adding that when they start construction on the water park. Check out was quick and fine. Although the young girl at the counter had as much personality as a wet dish cloth. To my way of thinking, if you are in the hospitality industry, then you should have people who are friendly and outgoing, especially at the check in/check out desk, which by the way is different from the Guest Relations desk. The Guest Relations people I spoke with were friendly and very helpful. The only other complaint I have, like a lot of other people is that they charge $40.00 for internet for 7 days. Which is expensive. If we were to go back, next time I would request a room in the Villas, which are presently being renovated.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Be prepared to commit half of your precious vacation day to the timeshare speil!!!!”", "Author": "Real_Talk1174", "ReviewID": "UR100931735", "Content": "Not too bad for the price, but they need to truly raise the standards for cleanliness and the 5 HOUR (yes!!!! 5 whole hours) timeshare presentation was \"simply put\" a passive aggressive kidnapping or hostage negotiation. We arrived during spring break. The only time off that we have during the year. We were excited to stay with Westgate because we had vacationed there with my father the year before at the Westgate Lakes and loved it! So, we booked a 4 day/ 3 night, 4-br/ 4-ba condo to accommodate the 12 ppl in our party. The price and amenities were awesome ($190/ day for 4-br/ 4-ba) & couldn't be beat! The staff were extremely courteous (as I changed rooms twice because of noise and lack of view). However, when we did settle into our rooms, you could tell that the room inspection meant (check for beds made, fresh towels, and clean tubs-only) because no one had wipe down any of surfaces or even attempted to mop the floor or clean the mirrors or wipe down the grime on the doors. Notice, I keep saying \"wipe down\" because that's all that it took, had someone \"inspected\" the room like a guest and not an employee with sub-standards for clean. We spent the next hour doing what housekeeping should have done. Other than that, no other issues with the resort. Let me add, the kitchen was immaculate! The location was wonderful, just a short drive to Disney and there were other stores and restaurants nearby that made for ease of travel. So, why isn't my rating a bit higher?!?!? Two-words, Timeshare Presentation!!!!! Now, don't get me wrong, we already knew before coming to FL that we were probably gonna purchase, if the price was right. We even told the \"used car salesman\" type, \"Joe\" that he wasn't gonna have to work to hard, just show us a 2 br villa like my Dad's and let us know how much? So, Joe ignored our request and went in for the \"hard sale\". Again we told \"Joe\" that all of the \"pitching\" was unnecessary and to give us the bottom line, how much?!?! But being the passive aggressive, tunnel- visioned, \"used car salesman\" he was, he just kept going. Finally after having heard all about the owner, who he knows, \"Joe's\" personal testimony, every inch of the resort, being asked to wait for over 20 mins and given the whole \"deed\" speil, we finally figured that we had to match his aggressiveness with some of our own and demanded to know HOW MUCH?!?! (Not realizing that we have been there for four hours. We started at 7:30 am, it was now 11:30 am.) So finally, (after seeing that we were irritated and ready to say, we will do this some other time), \"Joe\" and his supervisor began with the \"bait and switch\" show about slashing payments and preferred weeks and upgrading to a 2 br w/ loft villa. Before we closed on our deal, we had been there 5 HOURS. So, instead of being excited about our purchase, we were tired, angry and irritated that half of our day was gone! Folks, our timeshare presentation started at 7:30 am, we were not released until 12:45 pm, and \"Joe, the used car salesman\" was so aggressive that even after the sale was OVER, we finally had to MAKE him leave us alone by complaining about how long it took and how we told him we wanted to buy, but he DRAGGED on forever. Once we got outside, it truly felt like we had been set free or released from some kind of jail or maybe even Hell. I wish that I could have made this shorter for you. But I wanted to give an accurate review. By the way, we decided that we needed to wait a year before purchasing, after all. So we opted to cancel our contract four days after being home. The timing for us just wasn't right and our contract had a 10-day cancellation option in it. Let's hope everything goes smoothly with it...I would hate to have to call the State AG's office, as I would one day in the near future truly wish to become an Owner at the Westgate Town Center without being held hostage by a desperate salesperson, that is.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“We were thrilled with our total experience at Westgate”", "Author": "smadden11", "ReviewID": "UR100363226", "Content": "Having read a number of the reviews here we didn't know what to expect, but everything exceeded our expectations. Check-in was quick and easy. Once we said \"no thanks\" to the time-share breakfast we never heard about it again. Our \"efficiency\" unit was more like a one BR suite - big living area, balcony, BR that could be closed off, 2 TVs. As an \"efficiency\" there was no stove, but full size refridge, microwave, coffee maker, flatware, plates, dish towels etc. Resort provided lots of activities on-site and was very convenient to all Orlando attractions. As someone else noted, there are signs that there are plans for new restaurants on-site. For the size of this resort (huge!) it seemed strange that currently there are no restaurants. That said, the deli was fully stocked and very convenient and there are loads of restaurants in the area.", "Date": "March 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Virginia", "Title": "“Second stay just as good as the first”", "Author": "brianbva", "ReviewID": "UR99183659", "Content": "We stayed here two years ago and had a great stay. This time was just as good. We actually had two 2br units (friends stayed in the second one) just a few rooms apart from each other in the 5700 bldg facing the lake in the middle. We traded through Interval for one and used a bonus week for the other. I did the pre-check-in in at noon, rooms weren't ready, but that was expected. When I returned at 8pm to get the keys I was in and out in less than 3 minutes. Minimal timeshare pitch pressure, I just declined and was never asked again. Good: Very clean, granite countertops and table, fairly new furniture, comfortable beds, HUGE jacuzzi tub in master bath. Two issues that we had (safe and dvd player) were taken care of immediately, and staff followed up to make sure everything was fine. Bad: Nothing really bad, just differences between this and top-class places. Like: **a couple beer bottles and cans on the ground that hadn't been picked up yet; **DVD players are total junk (Really, they must cost about $5 each - no pause, ffwd or rewind - just play and stop; any scratches and it won't play at all). If you plan on watching lots of movies and you're driving, bring your own DVD player. You won't regret the decision. **Also, only about half the jets in the hot tub at the pool worked. **Tv's and stereo need a tech refresh. Still tube tvs in the bedrooms. The unit we stayed in last time had all flat screens, so I imagine they just haven't gotten to this bldg yet. Disclaimer: We didn't spend much time in the room overall and used very few of the services. We were at DW most of the time. Observation: There's a sign advertising a coming water park and new restaurants on property.", "Date": "March 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great stay...would go again!”", "Author": "1951merc", "ReviewID": "UR98149385", "Content": "Really liked this hotel from the moment we arrived. Very beautiful. Very nice staff. Already have a timeshare with them so wasnt bothered about that. Very helpful with finding good area restaurants. Helped to set up free shuttle to disney which you book in advance. (Shuttle was about 30 min late and very full though). Stayed in a 2 bedroom condo and one of the doors was broken but they immediately fixed it. Very clean and very nice room. Nice few of the fireworks at disney and lake. Very nice place.", "Date": "February 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Beijing", "Title": "“Ok place but very dated”", "Author": "ChrisMac17", "ReviewID": "UR97756942", "Content": "We received a bonus week for banking our Marriott timeshare week early and this was one of the places available. We usually stay only at other Marriott properties. The check in was a bit tiresome because we were taken to a desk to be given a card, then got in line and saw the front desk person, who then gave our keys to another person who signed us up for the breakfast and timeshare speil, (we did it for the free breakfast, disney gift card and discount park tickets, and free access to mini golf, swan boats, and sports equipment on site.), then we went with yet another person to show us where our room was. It took about 45 minutes and there was no line. Our room was very dated and there were a lot of mirrors in the bedroom. We were in the CCC building. It was sort of clean. There was what looked like coffee and leaves in the kitchen sink. There were lots of towels and pillows. The beds are a bit hard and the kitchen was a bit tight. There are a lot of pools at this resort and there was one right across from our room. However the pools by the towers have a kids splashing pool and are much more up to date so we drove over there and used that one after the first day. There is also a train they told us that would take you around but it runs very limited hours and after about 2:30 it really only does a loop from the front to the employee building for them to get off and on. Also the shuttle to the disney parks runs only two times in the morning. It is very close to the parks and several places to eat. There is also a super Target close by that is great for stocking your room up. The time share pitch was ok. We had a guy named Joey who did all the normal things like tell us about his personal life to make him seem like our friend. But he talked fast and his spiel was over quickly. Also when the guy was brought over to give us the price and my husband said no he tried a bit to get him to change his mind but did not get too pushy. He was obviously a bit annoyed but it was not too long. He also told us about the other building that they normally take people who are not staying at the resort he said you don't want to go there. (this was during the golf cart tour of property) so after we went to the gift room to get our stuff and they offered us a bonus gift of discount tickets to a dinner if we went to another presentation that was an hour long in that building. We declined. Overall it was an ok place to stay not fancy but we were at the parks most the time and it was free for us. I would stay there again if it was with a free week but otherwise I would go to another Marriott property.", "Date": "February 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Port Saint Lucie, Florida", "Title": "“Not so stellar start... a bit scary...but improved in the end”", "Author": "pslgrl", "ReviewID": "UR97523715", "Content": "We checked in on Friday night about 9, check-in was busy, so it took about 30 minutes. After checking in we were escorted to the \"other\" desk where they attempt to get you to take in breakfast or brunch to sell you a timeshare. We are from Florida and know the whole gammit so declined....but then we were told we would be escorted to our room by another employee! I thought to myself, WOW, they are really trying to sell these units! (not a bad thing...that's how they grow) We arrrived to our building and the escort couldn't locate our room (on the first floor). The key and room number on his sheet didn't agree. He was persistent to get us settled and tried every room on the floor (he tried everything AND we were saved from the sales pitch to attend the timeshare presentation). Apparently the check in host didn't program the key. So, tired kids in tow, we loaded up and went back to the main building at Town Center. Since he had to re-program the cards, my husband suggested we get a higher floor because of noise, etc....they accommadated us and we proceeded once again (tired kids in tow) to find that they assigned us a room with only one bedroom, we booked a 2. We go back to Town Center and they told us we booked a 1 bdrm. They call a supervisor and instead of speaking to me (I'm right next to our ESCORT) she tells him our reservations state a 1 bdrm. I look her in the eye and explain that we are very tired, it's now 10:15 and we will pay the difference if we have to, whatever...get me to bed! She says that the room has to be cleaned and inspected and it would be an hour before we can access...ok we'll go to grab some stuff from the store..cranky kids in tow (6 & 8). Come back at 11...different escort...very nice and helpful settling us into our room, he helped unload our bags and refrigerated purchases. My daughter goes to her bed to lay down and shrieks ROACH! A big one daddy! The escort was still there and saw it in her bed! He sat down immediately and phoned the front desk...yes we live in Florida and palmetto bugs live here too...but not in our beds! So here we go again, this time gathering all of our unloaded stuff, everything! Quickly! (so we don't have any hitchhikers!) The escort spared us the pain of going back to Town Center Hall to move rooms...he opened our new room in the 6000 building, and after a thorough check we were ok with it..he left and returned with our new keys within 20 min. Stellar service (from the escorts) at this point. So I mentioned earlier they said we booked a 1 instead of 2 bdrm...we had to pay an additional $84...even though it was their mistake. Well, since we didn't offically get a room until 12:30 Saturday morning you bet I was calling another manager. After notfying her of our experience she refunded us for the night...good move because word spreads quickly. Overall - It was a scary place to sleep for the first night, no roaches or issues the rest of the stay (3 nights). I would say if we didn't go through the first night the way we did, it would have been a diffrent experience. First impressions are lasting. One other key thing - we were not the only ones complaining. There were several people that we heard complaining of ants in their bed, etc...this is Florida and there are bugs - but ROACHES in the bed..NOOOOO. The premises were kept well (should focus that effort on interiors as well). The staff, except for the first supervisor encounter, were customer service oriented. We survived. I would not recommend this place to anyone I know though.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Want the REAL deal? Read my review!”", "Author": "Keinika", "ReviewID": "UR93226663", "Content": "So, honestly, the Westgate Town Center is the BEST place for families with kids to vacation in the Orlando-Kissimmee area. Especially if you don't want to got bankrupt at Disney! I will be honest...I am an owner of this timeshare, sort of, however, I'm not biased to them because I am also a travel planner so I look at everyone. Im only 28 years old and I have vacationed in the Orlando-Kissimeee area about 8 to 9 times in my lifetime so I know what I'm talking about! I'm gonna break this down in parts: RESORT - IT IS A TIMESHARE!!!! So, YES, they are going to try to get you to go on a timeshare tour! Depending on your vacations needs it might be worth it. We went on a timshare tour and we saved about $50 (maybe more) or our Disney tickets! For me, that was a good deal. I took that $50 I saved to the outlet mall and got some killer shoes and beautiful earrings! Anyway, if you don't want to take the tour then just say no. BE CAREFUL WHEN BOOKING! Certain rates you book require that you go on the timeshare tour, some don't. (Contact me and I can help you with that!) Anyway, the resort is AMAZING! Everyday there was a boat load of stuff to do! Free Disney movies, fishing, paddle boats, golf, BBQ's by the pools and a daily list of activites. They keep you busy so you don't have to spend all your cash at the parks. The resort is large but there's transporation to take you around if you don't want to drive your car. Or you could walk! We walked and the scenery was awesome! There was Pizza Hut and grocery store with deli near our villa but I heard there was another restuarant on the property. They are in the process of building a waterpark there too. It was ready yet so they've rented a HUGE water slide until its ready. ROOM - I didn't want to leave! We had a 1 bedroom villa with a patio. My husband and I's bedroom had a jacuzzi tub that was sooooo relaxing! The bed had dozens of pillows, mirrors over the headboard with some soft lighting. The bathroom had 2 shower heads, regular and rain shower. Double sinks were a blessing! We had a flat screen TV in our room and our room had its own entrance to the patio. The living room had a leather sofa sleeper and love seat. We put those two together to make beds for our then 6 year old and 3 month old daughters. They also had their own flat screen tv, DVD player, and music sound system. There was also a full dining table for 6 and a breakfast nook type table on the other side on the kitchen counter. The KITCHEN! Oh, how I LOVED that kitchen! Electric stove with oven, dishwasher, garbage disposal, microwave, appliances, refrigerator with icemaker, washer AND dryer, and all the cookware and dishes you need! They even provided detergent for the laundry and dishes! There was also a safe, broom, mop, laundry basket, iron with ironing board and all the regular and pool towels you could ever need! LOCATION - Disney was literally around the corner, I'm serious! It took us 5, maybe 10 minutes to reach the parking lot gates. We were 2 minutes for the main strip with all the restaurants, shopping, and WALMARTS!!!! And everything was a quick hop on the expressway. Airport was about 15 to 20 minutes away. SERVICE - They gave us such great service that I mailed them some customer reviews when I got back home. We had some issues with our room and everytime they came right away and fixed what needed to be fixed! One issue was with our toliet and they were having some trouble fixing it so they were going to move us (themselves) to a better room! They eneded up fixing it and it stayed fixed the entire time! Everyone we encountered helped us so much. Hmmm, I don't know what else to say! If you have any more questions, let me know, message me and I can answer them!", "Date": "January 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Madera CA", "Title": "“Just OK”", "Author": "DebbieMaderaCA", "ReviewID": "UR92109941", "Content": "We exchanged a 1 bdrm timeshare for a week at Westgate in a 1 bdrm, 2 bath villa. We rented a car and drove straight from the airport. We arrived around 6pm. Check-in was fast and easy. An employee provided us with an envelope full of stuff and told us about the free breakfast and bar-b-que and free activities. I suspected this was a timeshare presentation and immediately told him, \"Not attending either.\" He said activities would not be free, but nobody asked us again. An employee accompanied us to our room. That was nice. At first sight, we were disappointed in our villa. We have owned for only 3 years and have exchanged 3 times. This exchange has been the least elegant we have encountered. I didn't realize that the villas were the oldest accommodations. And, ours did not have a patio or a balcony! The decorating was cheezy and dated. The TV's were tube-type. Our previous exchanges all had new, slim LCD TV's. Furthermore, the internet cost $40/ week. We have always found internet to be free. My husband had his \"card\" with him so we could use the laptop in our room. Westgate provided a \"computer center\" in which you could load a card and use it to access the internet ($.20/minute, $.75/printed sheet). Using that card I accessed my e-ticket to print my boarding pass for the next day. I ended up spending $12 to accomplish this. Frustrating and ridiculous!!! That said, the villa was clean and quiet and spacious. We were in building SSS and the pool/jacuzzi area was hardly used the week we were there. The pool water was a perfect temperature the jacuzzi clean and hot and bubbling. The grounds were beautiful. We bought a couple of things from the market. We bought most of our groceries from a nearby Super Walmart. The benefit of buying at the market is smaller sizes. We didn't consume all the meat we purchased or use up the condiments. Probably would have paid the same money for smaller versions--but, I hate to waste food. We were not provided with a TV Channel Guide. I called and was told I would have to go over to the Welcome Center and pick one up. Why wasn't that in the envelope full of stuff? There were a couple of channels that were not listed on the guide. Another aggravation was a couple of pools advertised \"happy hour\" 5-7. We went over on Saturday night to one pool and the bar was closed. We were directed to another pool. That one was close to our room and was open. We returned to that pool on Tuesday (where a sign advertised food and happy hour) and the bar was closed. It was sprinkling and we didn't feel like walking to the other, more distant pool to check it out. Some consistency would have been nice! My experience with villas and timeshares is there is no daily cleaning and we put out our own trash. That was true at Westgate. Clean towels were provided half-way through our stay. That was nice. The queen-sized bed was comfortable, but a hallway light just outside the bedroom window interfered with our getting a good night's sleep all week. Black-out drapes over the horizontal blinds would have helped. Loved the security gate on the property. The resort is also very centrally located to many attractions. If we return to the Orlando area, I will probably research other resorts.", "Date": "January 7, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New Richmond, Wisconsin", "Title": "“Nice place but know what you are getting into!”", "Author": "bearpawqs", "ReviewID": "UR91116177", "Content": "We have been owners here for 5 years. While the resort is very nice you need to know what you are getting into when you stay here. Our visit this October was less than stellar and we have made our experience know to management so hopefully they will do something about the customer service and attitudes of some of the staff. My first piece of advice is unless you know you want to buy a timeshare, don't go to the sales pitch. It is very high pressure and when you say no the pressure intensifies. Each time you say no they bring out someone higher up the food chain. After saying no to three different people their attitudes shift and they become rude and unprofessional. If you are really serious about buying a timeshare, shop around first. We actually prefer to stay in the Villas. Yes they are older but they are quieter and more our speed. The high rises in Town Center are cheaply made for what you pay for. You can hear your neighbor’s conversations and you can hear the people above you walking, running, jumping, or moving furniture. There can't be any type of insulation or sound barriers. We requested a unit on the top floor but in so doing we had to wait four hours to be checked in. The front desk was not helpful and the customer service skills that day were pathetic! The staff at the Deli/Store was fabulous. They greeted us with smiles and welcomes and the Deli staff remembered our preferences and our names! They were great. The grounds are nice enough. Very neat and clean. If you have children just be aware that the grounds are really not set up for pedestrian traffic. What look like sidewalks are not sidewalks but golf cart highways. They will run you over if you aren't watching. Just another reason why we prefer the Villas. (Shh, don't tell anyone) The maintenance crew was also excellent and johnny on the spot with things that needed fixing. What we really like about the timeshare is having a full kitchen to make our own meals, we can do laundry as we need to and actually do it before we leave instead of having to do it all when we get home. Plenty of room to relax and close enough to Disney to enjoy what they have to offer. So why would I not recommend this place to those I care about? The high pressure sales, staff copping attitudes, poor customer service, and Westgate has not proven to us that we made a wise choice! Oh yeah, their internet service is basically non existent. It has been for 5 years. Excuse after excuse.", "Date": "December 30, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Farmington, New Mexico", "Title": "“Great home away from home”", "Author": "MarkandBonnie", "ReviewID": "UR89271713", "Content": "We read a lot of negative comments about this place. We had already traded for this time-share and were stuck with it for two weeks. All our fears were for nothing…. The property was wonderful. The staff was terrific and right on time every time we need something. This is a Time-Share property so the room gets a touch up mid-week and a thorough cleaning once a week. We got a three bedroom suite. The rooms were big, clean and comfortable, the grounds were beautifully kept, pools were awesome. The only draw-back was that check-in was chaotic - sending you to this person then that person all a ploy to schedule you for a timeshare spin, which we kept turning down. We finally were taken to our room by someone who said he was our (rep) (short for Salesman). On a guise that he was checking the maintenance of the room he scheduled some time with us, after explaining (several times that we had enough time-shares) we finally had to walk out on him and his supervisor. But again the Property was great and if we go to see Micky Mouse again we will try to stay here. Did I mention we could see the Fireworks from our room. Really close to WDW.", "Date": "December 7, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Lingering disappointment”", "Author": "carijudy", "ReviewID": "UR88943744", "Content": "This was my second stay at a guest of an owner and while the majority of the stay went off without issue, the customer service we experienced was borderline terrible. First off, we arrived with a later check-in and were told our rooms were not ready. It turns out they were, but needed to be unlocked, while this key was went and got or this person needed to go and unlock the doors to the attached rooms. It was just too much chaos for the us and several of the children we had with us. Then, as I went to get into bed that night and pulled the covers back the sheets were covered in all kinds of I don't know what. It looked like little spots of blood clustered near the top and lots of little dark brown specs of dirt. At 10pm, after a long day, quite exhausted, my mind immediately went to bed bugs. I was upset and furious and called to get new sheets. While waiting, my sister and I scoured the bed and frame to see if they were bed bugs, and were relieved that we didn't find any. After waiting over 30 minutes for the sheets, the doorbell rang and we were handed a plastic bag. It was ridiculous that we then had to try an make the bed with the wrong size sheets! We were too exhausted to call down for another set, and I just slept on top of them. The next day we got clean sheets, but again had to put them on the bed ourselves. After this annoying first night, I resolved to just relax and let it go. Am glad I did as the rest of the trip stay there were no more problems. That is until we left. We had several children with us and as you can imagine, it was a bit loud getting everyone's things together and out the door. Well, a watch got left behind. It was noticed almost immediately that it was left so we called and were told to leave a voicemail with the lost and found department. I very explicitly described the watch, where it was left and that it could have possibly fallen behind the headboard or the desk. No once called us back after a couple of days so I called again and was told to leave another voicemail which I did. While we were there, the building we were in was fairly empty, so I assumed it may have taken a couple of days to clean the room. So I was giving them the benefit of the doubt. But again, so response, so I called again. Nothing. The fourth time I called, I tried to let the receptionist/phone operator know that I was tired of leaving voicemails as no one was calling me back, but was told that that was the only department I could deal with for a lost item. It's quite upsetting that I still haven't heard anything...not even a courtesy call to say they looked for the watch and couldn't find it. Was it possible I left it someplace else or something like that. But no contact from the at all. There was a lot of sentimental value for this watch and it’s a bit disturbing that I couldn’t even get a call back. Even at the least starred places, I never been ignored when I’ve had an issue.", "Date": "December 3, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Deptford, New Jersey", "Title": "“Doesn't get any better!”", "Author": "sunlover649", "ReviewID": "UR86626713", "Content": "We just returned from our 3rd trip to Orlando staying at the Westgate. Each time our stay gets better. We had a top floor with an amazing view of fireworks from Magic Kingdom and Epcot. The resort is beautiful and so comfortable. It is so nice to have room to stretch out and have some privacy. We also shopped at Target for snack foods and breakfast foods which was convenient and saved a few dollars. It was also great to have a washer and dryer. This resort is right next to World Drive and so easy to get to all the parks including SeaWorld and Universal which are 20 mins. away. This time we had one day to relax and enjoy the resort property. The pool with the bar and arcade was so great with the beautiful lake view behind it. The room was immaculate, the grounds are beautiful and everyone we encountered couldn't be more helpful. I would highly recommend Westgate Town Center to anyone. I just wish we could afford to purchase because it just doesn't get any better than this!", "Date": "November 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Clearwater, Florida", "Title": "“Nice Studio Room - only if you don't settle for less”", "Author": "kitchenchemist", "ReviewID": "UR83953360", "Content": "I was originally booked at the Westgate Vacation Villas studio room and when I checked online, as previously stated by another guest, it was a two bedroom hotel room. I called and spoke to a supervisor and asked to be changed a Town Center studio, which is a one bedroom, living area/kitchenette room. I was in 5356B, a newer building. Nice vestibule entering into apartments A & B. Clean room, couple minor maintenance issues, fixed quickly, lots of fresh towels,lot of pillows, nice bed linens, sofa bed ok. Big bathroom- with separate shower enclosure, big soaps. Shampoo, conditioner, full coffee pot, with one pot service. Pool, mini-golf nearby. Sales people everywhere desperately wanting to seal a deal- it is a timeshare complex. They do hold onto your keys and give you the pitch before you get to your room. Huge complex. Plenty of things for families to do. No free wifi. I paid $59+ (but remember I was upgraded upon request.) Got an early (11 AM) check-in upon request also. A $50 deposit required at check-in - refunded, if not used at check out. See my photos.", "Date": "October 18, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Kingston, New York", "Title": "“Westgate Town Center has everything we desire for a great vacation in Florida.”", "Author": "Alfie45", "ReviewID": "UR83060521", "Content": ".We enjoy staying at Westgate because of its convenient location,roomy accomodations,ammenities,and friendly staff. We particularly love the huge columned hot tub in the master bedroom.There is something for every age here from theme parks to playgrounds,paddle boats, shopping and great dining. The pools and fitness center are well maintained. Families and couples of all ages would enjoy this resort.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Miami, Fl", "Title": "“not as advertised...”", "Author": "FlThrifty1", "ReviewID": "UR83054291", "Content": "Just came fro staying at Westgate Town Center, we had booked a suppossed studio unit, which in all other places I have booked that type of room comes with a small table,chairs,a small living room with a pull out sofa, and a partioned or separate bedroom. Not so here, all you get under this type of room is a bedroom with two double beds, a small fridge, a microwave, and plates and utensils.No, you do not get a table to eat whatever you have cooked, or even a couch to sit in, no chairs either unless you count the one chair for the small desk next to the tv. Also, there is nobody at the pools to monitor the signs that they have telling people that there are no unsupervised children allowed, or no diving into the pools, or glass cups allowed. All in all very disappointed, having stayed at other timeshare units that provide better accomodations, and better supervision of common areas, allowing their guests time to relax, and enjoy their vacations.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Tampa, FL", "Title": "“Reviews almost scared us off!”", "Author": "metfanatic11", "ReviewID": "UR82725223", "Content": "After reading reviews on here, we were nervous upon arrival. Our minds were put at ease very quickly. I can't comment on the sales process because we are using it as a guest of a timeshare owner so we didn't receive any sales pitch at all. We stayed in the 5400 building in the town center and we couldn't be happier with the room. Cleanliness could be a little better but nothing major. The grounds are very well kept and the service staff that we've been in contact with have been very nice. I would definately stay here again.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NJ", "Title": "“Great stay close to Disney”", "Author": "ENj", "ReviewID": "UR81194472", "Content": "I was a little skeptical about staying here due to other reviews I have read on this hotel. Once we arrived I was sure it was going to be terrible as check in took an hour on line and then off to staff trying to schedule a timeshare tour. I declined and they didn't have a problem with it. One of the staff members escorts you to your room and shows you around, nice personal touch. The property is HUGE and is maintained well and very clean. Our room was HUGE. We traded in our two bedroom timeshare for this property. It was two floors a master bedroom with a master bath, kitchen, living room with sleeper sofa, 2nd bedroom with 2 beds and a bathroom, nice kitchen, dining room, laundry room, and 2nd floor had 2 twin beds also unit had a private balcony. Safe area and parking lot and there is security at gate making sure everyone who is getting in belongs there. Drive is not to far maybe 10 minutes from the Disney parks and area attractions. They have pools throughout the property, also childrens park area and mini golf. Would stay here again!", "Date": "September 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Perfect for our needs! Totally flawless!”", "Author": "Mike_and_Nicky", "ReviewID": "UR80396764", "Content": "We are a young Scottish couple, and have just spent the most amazing two weeks in Orlando. The hotel being one of our biggest fears (due to negative reviews) turned out to be one of the highlights! It was amazingly clean, the maid attended with fresh towels every morning, there were enough facilities for us to have breakfast before venturing out, the hotel was not only close to the parks, but also to the 192 where you can find lots of other attractions and restaurants. It was great to come back at night, open a beer and watch a movie (the tv had a good choice of channels including hbo movie channels). Just another small thing, but it made me smile everytime. When you drive up to the security office on the way in, expect a smile and a salute from the extremely pleasant and efficient security staff once they get to recognise your car. Honestly, if you are a young couple out to have a blast in Florida, this place will fit your needs perfectly. No complaints whatsoever!", "Date": "September 21, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "5", "Service": "4", "Location": "4"}, "AuthorLocation": "Beaumont, Texas", "Title": "“Stay was OK for the price”", "Author": "nedburfle", "ReviewID": "UR76234482", "Content": "Got room on Hotwire for $49/night. Was worried about all the negative reviews, but loved the price! Room on Hotwire was listed as a \"suite\". It would have been very small for 4 of us - two parents and two teenagers. Fortunately we got upgraded to the next bigger size suite because they screwed up our reservation. Observations: 1. Cleanliness - no problems. Room had a little bit of a musty smell, though. The grounds are well kept and pretty. 2. AC - didn't work very well. Room would get up to 79 by end of day (mid-August).. Two ceiling fans helped and we weren't ever in the room until after 7:00 p.m. 3. Registration - staff was friendly and helpful. It was a slow week they said. Pressure to \"meet for breakfast and tour the facilities\" so they could try to sell us a time share was not too bad. We brushed them off easily. 4. Parking was good, close to room. Pool was good, but loud at night. We stayed on 5th floor and it was still loud until it closed at 11:00. Fortunately, we travel with ear plugs! 5. Bedding - king bed in room was ok, but sofa couch was lumpy. We put the mattress on the floor and slept there. 6. Bathroom - great! Had good water pressure in shower and the bathroom was big 7. Security - you have to go through a gate to get in and there was always someone on staff driving around the area. We felt secure. Overall, ******for the price*******, it was a good deal. We spent most of our time out of the room and just needed a place to sleep and shower and this was sufficient for that.", "Date": "August 21, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Winston Salem, North Carolina", "Title": "“Warning! Wolves in Sheep's Clothing”", "Author": "nascar141984", "ReviewID": "UR74377368", "Content": "Okay, it was mine and my wife's first vacation experience at a Westgate resort and it will most definitely be our last! If we knew what kind of lies and junk we were going to have to put up with this week, we would never have chosen this place. The facilities were adequate, however, management and staff were often inconsiderate and rude especially when we declined their offer to purchase a timeshare. If considering Westgate PLEASE be aware that they are EXTREMELY pushy and do not hesitate to use pressure and other unethical means when presenting their timeshare information. Despite our repeated adamant refusals they continued to push their sales presentation on us. When we again refused to purchase they became downright rude and one representative made several sarcastic remarks to us. We were naturally very shocked and disgusted and could not wait to leave. We also were not told that all our payments on the vacation were put into an escrow account towards the PURCHASE of one of their villas!!! We were then forced to sit through another sales presentation before we could sign off and leave!! I could continue but I will finish with this-- before leaving to go on our Westgate vacation, we read many other reviews (mostly negative I might add) and figured the negative reviews were just posted by whiny and negative people and couldn't REALLY be all that bad. It is a cruel irony that I find myself posting yet another negative BUT TRUE representation of this place!! STAY AWAY!!!!", "Date": "August 8, 2010"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Rooms": "3", "Service": "1"}, "AuthorLocation": "", "Title": "“WOULD NEVER COME BACK!”", "Author": "Iverson1407", "ReviewID": "UR73769964", "Content": "Ok quite frankly, the rooms were below average to average being that they were pretty outdated with old TVs, horrible beds, and dirty showers. The lobby was pure CHAOS with all the WG employees trying to pressure any and everybody into a highly overrated timeshare! It was like they were 'herding sheep', it's ridiculous. The customer service absolutely sucked as well because the employees are LIARS, to say the least. LASTLY, I would advise anyone who visits Orlando to just pick another place to stay. Period.", "Date": "August 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Spring, Texas", "Title": "“Bait and Switch”", "Author": "donttrustWG", "ReviewID": "UR72895544", "Content": "I purchases a week vacation at the Westgate Town Center for $1295. I called several times to make sure my reservation was for the Town Center and not the Villas. The Villas is the old section. Anyway, I even talked to a WG rep on the way to the resort to make sure my room would be in Town Center. When I arrived, I was told that the Town Center was full and I was placed in the Villas. Instead of staying in a 2 bd room at the TC, I stayed in a 2 bd room loft in the Villas. Of course I was very disappointed because I verified my reservation in TC more than once. And I was not trying to get something for nothing...I paid $1295 for the week. The difference between TC and Villas is like night and day. The TC was built somewhere between 2006 - 2010 (depending on the building), wheras the Villas was built around the 1970's. I was told by WG reps that the company who sold me the VOA week for $1295 was found to have engaged in deceptive practices and was discharged by WG earlier this year. I also forgot to mention that I purchased this VOA week during a timeshare tour at the WG TC last year(2009). Seeing that I made my reservation in Oct 2009, and verified the reservations several times this year, I didn't think I should suffer for the deceptive practices by company that was representing WG on their property. Because of this bait and switch, I would not trust WG again.", "Date": "July 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Greenville, SC", "Title": "“Great room, great view, relaxing vacation”", "Author": "scmami", "ReviewID": "UR71186213", "Content": "We stayed here from July 13-18,2010. I have stayed at several Westgate properties over the years. We traded through Interval International about two and a half weeks before our stay. The only rooms available in Orlando for our trade were all \"studio/hotel\" sized. Which meant NO full kitchen, washer/dryer, or separate living area. We were traveling with a 10,7, and 3 year old so we were concerned. However, when we checked in, we had a pleasant surprise! Our room was a one bedroom with a queen sized bed, a separate living room with a sleeper sofa, full sized fridge, and microwave, and a balcony! Much better than we expected. We also lucked out and got a first floor end unit which was great for the kids. We were in unit 5617B. The bathroom was granite and had a jetted tub that we never did get to use because it takes like an hour to fill up. Anyway there were paddle boats, bikes to rent, Disney movies in a mini theater (seats maybe 100 ppl), and activities every day. We loved the location as we usually stay off 192 anyway. Best Westgate yet. Oh, btw try to stay in the TOWN CENTER not the Villas because I think those seem to be older according to the reviews. Also friends of ours stayed at Westgate Lakes......(loved them as a kid/teen...as an adult...no way...they really need to update). We had a view of the lake and the giant water slide which the kids loved. Would book this one again!!. Pros: See above PLUS only asked about timeshare breakfast once Cons: Guard at entrance was rude, sugar ants got into the kitchen, no broom in suite although most floors were tile.( But I asked, and they brought one immediately).", "Date": "July 16, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Lake Charles", "Title": "“I'm not a review writer normally, but please take time to hear me...”", "Author": "CLBeckTAMU", "ReviewID": "UR70940318", "Content": "Normally I'm not one to throw my 2 cents in. But, I have to in this situation. For those of you (like me) that don't think reading any of these negative reviews would ever happen to me, please take all the negative reviews about this property into consideration. I'm so frustrated with this stay I'm still here on vacation writing this review. For those of you like me that work hard all year for a nice vacation with your family, you really can't afford for it to be a bad one, because you won't get another one until next year. This property has a very long check in experience. We were already tired from travelling, we really didn't want to wait in line for 1 hour then go thru a \"special\" tour as a cover-up time share marketing piece. Fortunately, we've learned the timeshare sales pitches by now and already own one and are happy with just one. The pictures of this property do look great, but it's like looking at a Big Mac picture, you really don't get what you see. Rooms are very small and cramped. Even took my empty suitcases out to the SUV to conserve space in the room. The room was very hot upon check-in. The AC really wasn't sufficient enough to catch up and cool it off until the next day. Leave it on the whole time if you want a cool room in mid-summer. The bathtub wouldn't drain and I had to get a maintenance man at 11pm out to unclog the tub. That can happen anywhere, but it just seemed like the straw that broke the camel's back to me. There were only 3 rags in the room for us (family of 4 staying for a week), so I requested about 8pm that those be brought to us by housekeeping. It's a mystery where they are located at so you have to request things be brought, you really can't just go to them. At 11pm when I requested the tub be unclogged, I also cancelled my request for the extra rags to be brought since we decided to just deal with it the next day. Maintenance guy was very nice and unclogged the tub about 11:15pm. At 1230am I'm awakened by a knock - housekeeping bringing me my extra rags. What a night, very frustrating. Then the real trouble starts the next day. At this point we've decided we are going to spend as much time away from the resort as possible because it's not really a resort, it's just a bad situation we want to stay away from and only sleep there because it's the roof over our head for the week. A new party is checking in next door. A girls basketball team playing in a regionals tournament i believe. They are mid-teens. This property has a common exterior door leading into a common area with an A-unit and a B-unit. It's really too close for comfort. I know that I'm in Orlando and it's not the mountains where you can have peace and quiet. But, being the team player that I am, I'm not the type to complain until it gets ridiculous. After 12 am I politiley knocked on their door, and the adults in the room were very rude and irresponsible. I could smell alcohol, which really concerned me for those teenage girls, I even saw 2 men come and leave at one point very late at night.. I immediately lost the being on vacation feeling and back to the real world feeling. I complained to security and front desk of the noise, door being left open and music playing loudly. Front desk is no help at all, security is very nice and tries to do their job, but really, what can they do?? It finally went quiet about 3 am every night. We are leaving 2 days early to have a nice weekend back at home before work starts back. There is nothing special about this place, please stay away for your family's sake. If I've discouraged one family from coming here, I've done my job. The management at this property really only has two concerns - keeping it booked up and timeshares being sold. Best wishes in your vacation.", "Date": "July 14, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Chattanooga, Tennessee", "Title": "“Don't waste your time or money! STAY AWAY!”", "Author": "TurnerRN", "ReviewID": "UR68735700", "Content": "This is supposed to be a resort, but it offers very few anemities. Internet usuage costs .20cent/minute. The deli closes very early. The pizza hut on the property charges double what the pizza hut up the street from the property charges and they will deliver to your villa. Most activities like bike riding and the paddles boats are not available until 12noon, right in the heat of the day. The staff is very rude, especially the timesshare salespeople. One went so far as to tell us if we were not going to buy, then we needed to get the hell off the property. When we asked him not to speak to us that way he basically said why don't you hit me if you don't like it. It took us 2 days and at least 3 calls to corporate office to be able to speak to a manager. Everyone kept giving us the run around. We told them no one should be spoken to that way. The corporate office kept telling us to talk to the hotel manager and the so-called managers kept telling us to talk to corporate. It was horrible. The place is very unorganized and we will never stay there again. They are a bunch of liars. We were told that we did not even have to hear a sales pitch, yet they tried to push one on us anyway. You will do much better staying at the Sheraton Vistana Villages, Marriot Residence Inn, or a Disney Resort. We have never had a problem with any of these places and they have much better anemities.", "Date": "June 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "chicago", "Title": "“I loved it here!”", "Author": "mallgirlfrg", "ReviewID": "UR67202911", "Content": "Here a lot of negative things about this place,but I don't have a negative thing to say about it.When I checked in I had no wait,and everyone was very nice.I did get asked about the time share deal,but when I said I was not interested i was not pushed into it.i had an awesome room on Swan Lake.I asked for a studio,but I believe I may have gotten a one bedroom.It had a private balcony and was very spacious.i was there by myself,so I had plenty of room,but 4 people would have been comfortable.I did not drive ,so they took me to my room in a golf cart.I also needed to go to the market on site,and just called transportation and they drove me there and waited for me and drove me back.I hear people complain about their room,I was in room 5722 in building 5700 and was very happy with it.I look forward to staying there again,although it is not as close to Disney as they say.Yes Main gate is a mile away ,but anyone who has been to the Magic Kingdom knows it is another 4 or 5 miles to the parking lot.Maingate does not have a shuttle,so you either have to rent a car or take a cab.That was the only downfall.", "Date": "June 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cockeysville,MD", "Title": "“Stay in West Gate was a delight.”", "Author": "skodiyal", "ReviewID": "UR67107149", "Content": "Had a spacious room with a king bed and plenty of space. The kitchen was awesome with all the amenities. The best part was the swimming pool and hot tub.", "Date": "June 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rockmart, Georgia", "Title": "“***Great Place to Stay***”", "Author": "deems774", "ReviewID": "UR66567033", "Content": "We loved it. We wish we could have stayed in the room a little more. Had plans for Disney all week. Room was very spacious and very clean. Very very nice place. We checked in really late and it check in was very quick and easy. We did not have to do the presentation we booked ours through interval international. Check out was also a breeze. It took about 5 minutes. We would definately stay here again. If we come back this is where we will stay everytime. I just can't say enough about how nice it was. I did ask for one of the newer rooms. We had a washer and a dryer in the room which was very nice. We loved it!!!", "Date": "June 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "west palm beach, fl", "Title": "“Great place for families!”", "Author": "busyathome21", "ReviewID": "UR64393751", "Content": "We stayed here for five days with our boys, 2 and 4 years old. We can't say anything about the value because a friend lent us their timeshare. We loved it. The rooms were big and large. There was a HUGE jacuzzin in the master bedroom. Kids thought it was a pool. We usually stay on property at Disney. Having the extra space was wonderful. The resort had so much to offer for familes. The pool near our building was a good size and never too busy. They have Disney movies shown in a theatre for the kids. They even have a tram that looks like Thomas the Tank engine that takes you from place to place around the resort. The customer service was on top of their game. We checked in mid week and it was quick. We had a bell hop escort us to our room and make sure the keys worked. He was very friendly and helpful. One of the sinks in the bathroom clogged up. They had it fixed within 30 minutes of our phone call to guest services. The location was also perfect. It took us about 10 minutes to get to any of the Disney theme parks. Loved this resort!", "Date": "May 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“ENJOYED!!!”", "Author": "Increase2", "ReviewID": "UR62772546", "Content": "Check-In: Unfortunately, it did take some time to check-in but it was not due to being harassed into buying or upgrading a timeshare. It was due to lack of knowledge of the person checking us in. Room: We were in 5200 building. It is not a nice as some of the new areas, but it is okay. It lacks the flat screen tvs, tub/shower combo in guest bathroom and granite counter tops. On a positive note, it is in walking distance to most of the onsite activities. Dining: There is no more breakfast in the main building (even though it is advertised on westgate channel in the room), but on some days, a continental breakfast is offered for owners. The onsite food places are average. Therefore, I recommend renting a car if it is in the budget. Also, please beware of local restaurants that offer the very cheap rates for breakfast. All I can say is that you get what you pay for. OnSite Activities: There are paddle boats, bicycles, putt putt golf and a train. Unfortunately, all of these close rather early (about 6pm), considering it is still daylight until almost 8pm. According to the brochure given at check-in, the train stops at 3pm. The main problem with the train is locating it. Yes, there are train stops located throughout the resort, but no times are listed. I witnessed guests just flagging it down and getting on. Figured I would try it as well (whenever I saw it) and it worked fine. It was refreshing to ride around the resort to get an overview of all that is offered. Also, drinks served at pool 1 and 13 were pretty good. The games and music during smash burger days were entertaining to say the least. Internet: Wireless is available but at a cost -approximately $50 for guests and $25 for owners. The cost would not have been nearly as bad if the internet was not running at toad speed. When viewing the available westgate connections, approximately three show up. Depending on location, only one can be used. The one dedicated to our building had two bars associated with it and was not reliable.", "Date": "April 29, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Buffalo Grove, IL", "Title": "“OK but probably wouldn't go back”", "Author": "Nofibgb", "ReviewID": "UR62750172", "Content": "We stayed at a two bedroom that overlooked the lake and the mini golf course. Overall, we were a little disappointed. Some of our disappointment had more to do with the people than the place itself. I'm not sure if they get a lot of visitors doing the 3 night promo stay or what but there seemed to be a lot of teenage or early twenties couples. This place is pretty loud and I'm really glad we were on the sixth floor as I don't know if our kids (5 and 1) could have slept with the noise if we were on one of the lower floors. I don't know if the pools are open all night but there were people at the pools really late. The rooms are pretty outdated. There are mirrors all over that reminds you of some place from the 80's. Didn't like the tile floor throughout the place. Carpeting is more comfortable and don't have to worry about a toddler falling on it. The dishwasher must have been twenty years old and we were too afraid the racks would fall when we put the dishes in to use it. There are a lot of pools but they aren't very big so some of them get pretty clogged up. We didn't like the area of Orlando it was in either. If you think of the cheesy gift shops and neon t-shirt places, this is it. Overall, the grounds are very nice but the place is just so big with so many people that we never got the \"relaxed, on vacation feeling\" that you have at other places.", "Date": "April 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Michigan", "Title": "“Would not stay here again.”", "Author": "paohmi", "ReviewID": "UR61010357", "Content": "Did not get the timeshare unit we were promised upon making reservation. Instead was put in the \"TownCenter Unit 5000\" facing Swan Lake. Big disappointment. This was a very small one bedroom studio with a lumpy king bed and a pull out sleeper sofa in the living/kitchen area that was the pits. If it would have been my sofa bed it would have been out with the garbage! Very lumpy and no padding. Impossible to get any sleep due to the swimming pool across the lake. Apparently the sliding glass doors in bedroom are not very good because noise came right through them. Pool did not shut down at 10:00pm like they said it did. Noise until 11:00pm or later. Plus three different nights parties where going on at all hours of the night. Third night I called security to quiet the party which they did. A/C is hooked up to shut down upon opening a door so even though we would set it down when we left the place in the morning thinking it would be very cool when we got back it wasn't. It hadn't even ran....place was always hot, stuffy and humid. It would take hours to get it comfortable. Don't expect clean towels or bedding everyday. Only gave us clean towels mid week not clean sheets. Plus there is limited places to hang wet towels, etc. The bathroom had a separate toilet room but it was so small our knees hit the door when you closed it. Then my son wanted the high speed internet they advertise. Big mistake. Doesn't work everywhere. Not enough routers in the buildings. My son had to go next door to the lobby of the place every evening to get connected. Very disappointed in our week's stay. Would not recommend wasting your money.", "Date": "April 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "SPRING HILL FLORIDA", "Title": "“Excellent Experience!”", "Author": "steve34609", "ReviewID": "UR59684143", "Content": "We purchased annual passes to Disney this year so I did quite a lot of research on hotels,motels,resorts and suites in the Orlando area.This included price,location,floorplan,amenities and reviews.We wanted to have a \"home base\" for exploring all of the parks that would not cost us an arm and a leg,but would be of above average quality.Westgate Town Center fulfills those needs for us.We will be returning again and again.Our pleasant experience began with the price.We found a website that cut more than 1/2 off retail.A good start.Watching the weather we booked inside the website's cancellation period and were rewarded with sunny days.We arrived early and were allowed to check in a full FOUR HOURS before the official check in time (based upon available units).Our \"studio\" was actually a small apartment with a balcony.It had a limited kitchen (to save big $$$ over eating at restaurants while in Orlando) with a coffee maker,toaster,microwave,standard refrigerator,sink,utensils,cutlery,plates,glasses,bowls, and even a corkscrew.The unit also had a table with chairs for four people,a real leather pull out queen sleeper sofa,a table and two chairs on the SCREENED balcony cable TV.That's not all.In the shared bath (that has two locking entrance doors...one into the master suite and one into the common room itself) there is real granite,a triangular jacuzzi tub/shower a hair dryer and all necessary toiletries.The master bedroom has another locking door (both may be locked for privacy from the kids) another TV, a safe, bureaus, vertical blinds,a queen sized comfy bed and an alarm clock/radio.Tile throughout.There is even an ironing board.The property has community laundry facilitiees.The studio has no washer/dryer but larger units likely have them.Amenities include putt putt golf,eight swimming pools,kiddie pools,outdoor jacuzzis and tennis.There are also paddleboats and activites co ordinators/programs.In the future,there will be a full service spa for the ladies, a huge waterpark for the kids and an improved clubhouse for everyone.In the registration building there is a bistro style food service operation as well as a movie theater (free) that shows Disney films.Express checkout consists of calling the front desk,settling charges and dropping off the key as you leave.There is NO full service restaurant but that is common in other types of resorts.This is a timeshare resort.People go there, or buy there to,among other things, save money cooking in the units.You WILL be offered a timeshare presentation when you check in,in exchange for freebies. That's your call.Not mandatory unless you previously agreed to take one.All staff members that we encountered were friendly,helpful,courteous,efficient and knowlegeable. I give this resort four stars on a one to five scale.The amenities are there,or coming soon (waterpark,spa etc...) for a five star resort.The units were new and immaculate,spacious and quiet (cinder block construction). However, it did not \"feel\" five star.It did not shout \"luxury\" (along with the high prices) but it is solidly respectable, attractive,clean,updated and affordable.One main drawback is the lack of free wireless internet.The pay plan was too expensive as well.", "Date": "March 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Falls Church, VA", "Title": "“Ok Hotel, but Location is Misleading”", "Author": "DayTripper247", "ReviewID": "UR59383146", "Content": "We stayed in a studio room in this hotel complex in mid-March 2010. Our room was decent but small. Our refrigerator didn't work, but when I called the maintenance staff, they came within half an hour to fix it. After they determined it was indeed broken, they brought in a new refrigerator within another half an hour or so. On the other hand, we also found some of the hotel staff to be a bit pushy - the cleaning lady knocked on our door well before check-out time, asking when we were leaving, and the bell hop insisted on following me into my room and pretended to \"check on things\" until I produced a tip. My main issue with this hotel is that the location is not as close to Disney as it says it is. It might be around a mile from some part of the Disney Park complex to this hotel, but it is much farther than a mile to the Ticket and Transportation Center. Moreover, I didn't rent a car because I figured we could catch a cab for a small amount of money given the short distance; instead, it costs $50 round trip to go from the hotel to Disney. You can take the public bus (you have to take two buses and switch lines), but that can be a bit of a pain. Overall, the resort is not friendly toward those who don't have a rental car - it's a mile walk to get from the back of the resort out to the main road.", "Date": "March 23, 2010"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Colorado Springs", "Title": "“Terrible Customer Service”", "Author": "BabyNelson", "ReviewID": "UR58041920", "Content": "We haven't even gotten there yet, but when I have tried to call and ask a question, I have never had a telephone hold time less than 25 minutes without any check from an operator. Today I called to make sure our suite was handicapped accessible for my father. When the operator put me through to the room assignments people, I started my kitchen timer and looked at the clock on my computer. Twenty-five minutes later, I hung up and called back. Get this - the operator accused me of LYING about my wait time, because she had put someone through 5 minutes earlier who also needed a handicapped room. Based on the difficulty in reaching any kind of customer service representative and the ensuing disappointment once I reached them, I would never ever book a vacation at this resort again, no matter the price or convenience.", "Date": "March 8, 2010"}], "HotelInfo": {"Name": "Westgate Town Center", "HotelURL": "/ShowUserReviews-g34352-d1210925-Reviews-Westgate_Town_Center-Kissimmee_Florida.html", "Price": "$89 - $149*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">4000 Westgate Boulevard</span>, <span class=\"locality\"><span property=\"v:locality\">Kissimmee</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">34747</span></span> </span></span></address>", "HotelID": "1210925", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/dd/38/dd389af7c7af25ace8d46a4d2ff70a371large.jpg"}}