{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Good, but don't use the bathrooms.”", "Author": "102Paul", "ReviewID": "UR134082103", "Content": "Stayed here, July 2012, business trip. The hotel was OK, the room was reasonable. The bathroom however... Was atrocious. I had the bathroom door closed when I went to bed, and woke up in the middle of the night to use the loo. I opened the door and the smell coming from it was the nastiest I'd ever smelt. If you had to ask me to describe the smell, take garbage, mixed with vomit, sprinkle a little cleaner on top and that's about as best as I can describe it. It was enough to almost make me throw up, and was VERY overpowering. I had to go to the window and air the room out it was that bad.... The bath had brown water stains, the bidet was brown and rusted, and I'm sure this is where the smell was coming from. Breakfast was ok, staff were friendly at the check-in desk.", "Date": "July 11, 2012"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Milan, Italy", "Title": "“very bad”", "Author": "alecaro9", "ReviewID": "UR102465517", "Content": "In the hotel averything was of the '70, dust too. The furniture is very old, the floor was dirty, and you can' t eat before 10 P.M. The kitchen was quite good and abundant. Is cheap so is frequented by the guys on tour with school. I won' t go again there. I hope that now something has changed. But i remember that the breackfast was very good, this is a good thing", "Date": "April 1, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hove, United Kingdom", "Title": "“be told !!”", "Author": "cohende", "ReviewID": "UR95517464", "Content": "In a nut -shell: average value for money , the building has known better times. However, if you find the radiator in the toilet never heating up, you better bring your coat to the loo rather than report it. They can take 48 hours just to bleed that radiator and in the meanwhile each time the lift inevitably stops in front of reception they will look at you like: you are not welcome anymore! Need is to say to honour the truth that the cleaning in the room is impeccable.", "Date": "February 4, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Clearwater, FL", "Title": "“Absolute dump - you've been warned”", "Author": "FlCracker", "ReviewID": "UR85365830", "Content": "This was beyond awful. The building and lobby area made me nervous enough, but I was still optimistic that the room might be serviceable as most places in Spain tend to be... We had a room on the 6th floor which had not been renovated since the hotel was built - probably in the early 60's. I think staying in a jail might have offered a cleaner and more comfortable experience. What to expect: bare, dirty floors peeling paint on walls old linens, curtains and threadbare towels beat up furniture a tiny tv poor WIFI that must be paid for by the hour general filth and years of dirt encrusted in a tiny bath at least 2 kinds of mold that I could identify in the shower I had to check for bedbugs, but the sheets appeared clean at least. Not that I slept that night, given the tv noise and smoke wafting in from another room. The staff seemed friendly, but this can't make up for the egregiously poor conditions. I think you get the point - consider yourself warned.", "Date": "October 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Excellent value for a 3* Hotel”", "Author": "Malitz", "ReviewID": "UR57636995", "Content": "I stayed at this hotel for 2 nights (Feb. 26-27) and I felt that my money was very well spent. The hotel satisfied and somewhat exceeded my expectations. WHAT TO EXPECT: - A clean room. - Excellent service. WHAT NOT TO EXPECT: - An aesthetically pleasing room. THE BOTTOM LINE: You will be very satisfied if you stay here and expect nothing more than a clean room and good service. When I arrived, the receptionist (Juan José) was extremely helpful. He gave me a map of the city, explained how to get to my destinations and what my travel options were, then assisted me with planning my trip back to the airport via the metro. Late that night, I was woken up by a noisy neighbour, so I called Juan and he immediately took care of the problem and ensured that I got a good night's sleep. I felt that he was genuinely concerned with ensuring that I had a good stay, which is better service than I have received at some 5-star hotels. If you don't come here with illusions of grandeur, then you will be pleasantly surprised. Please let me know if you have any questions. I hope this helps and wish happy travels to all!", "Date": "March 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Gmr", "Title": "“To sleep... Ok!”", "Author": "L_JGmr", "ReviewID": "UR52480398", "Content": "We had stayed here for the new year´s eve. The hotel is ok. It´s old, but clean. The bed was not very comfortable, mattress very very old. The bathroom was clean. The staff wasn´t very friendly, but they always say hello. When you arrive to the hotel you always have to pass throw the reception because the elevator always stops there, whether you want or not… They never change the sheets, the bed is made every day, but they only switch the towels and make the bed, nothing else… Not even put more shower gel, even though we didn´t had any more… The location is very good, the subway is just in front, and it takes about 10 minutes to get to the Gran Via (the center) and it has a shopping center just in front. The breakfast very poor, and the toaster very very very old!! We had paid 220euros for 3 nights with breakfast; for that kind of prices, you get a better hotel in Gran Via or Puertas del Sol, much more central… But book early, because hotels in Madrid quickly became full and that´s why we booked this hotel… In general, not so bad, but definitely not a 3 star….", "Date": "January 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Paris", "Title": "“Cheap and convenient”", "Author": "condensedfizz", "ReviewID": "UR51543967", "Content": "I was in town for a conference and I needed a cheap place to sleep and shower. The hotel is right outside the Principe Pio metro station, which is very convenient for a newcomer. The staff was very courteous and helpful, my room was clean and comfortable. Breakfast and wireless internet are not included, but other, more expensive hotels in Madrid seemed to have the same situation, as my co-workers found out, so 6 Euros for 24 hours of wireless didn't seem like a bad deal. My only complaint would be the paper-thin walls, which may make things difficult for light sleepers. If you're visiting Madrid on business, this place is a very affordable alternative.", "Date": "December 20, 2009"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Rooms": "1", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Not good at all!”", "Author": "enigma475", "ReviewID": "UR38792997", "Content": "This hotel was booked for our group by the travel agency. As soon as we walked in, just by the smell of it, I knew it's not going to be any good. There is no lobby as you walk in, so you need to use the elevator and go down to the -1 floor for your check in. The room was dark and had no air conditioner. The paint on the walls in the bathroom was chipped. The towels had yellow stains on them. This hotel is in a desperate need for renovation. I don't know how they can be qualified as a three stars -- even one star is too much for this horror.", "Date": "August 25, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Harrisville, Rhode Island", "Title": "“Never Again”", "Author": "dwebb", "ReviewID": "UR15387406", "Content": "Before I begin, I would like to point out that the only reason I stayed here in the first place was because it was where I was booked by a tour group. To put it simply, this hotel has barely changed since it was built, and is in great need of an update. The rooms are of a good size, but are very old. The sheets on my bed had small rips in them and have obviously been used for a few years too many. Lighting is fairly poor. The television was very small, lacked a remote, often lost sound, and had a very limited number of available channels. The rooms (and linens) had a bad smell as well. The bathroom was also quite old and dark, though had no big problems. One of the biggest problems I experienced while staying here were the paper-thin walls. We could easily hear the television program in the room next to us. The fact that many of the floors are made of stone doesn’t help this situation. While I did not experience this problem myself, many in my group had some of the planks supporting their beds randomly snap in half! The room where breakfast is served was actually kind of new, but the breakfast itself is nothing to write home about. The selection of foods was fairly poor, and even the breakfast was dirty. For example, some of the butter packets were covered in melted chocolate. There is absolutely no reason why this should happen. I can't comment on the public restaurant in the hotel. No free Wi-Fi, though there was one (albeit slow) public computer for Internet access (1 Euro for 10 minutes of service). The hotel is across the street from a subway station which is convenient, but perhaps the only good quality I could find here. Do yourself a favor and don't stay here. I have no idea why this qualifies as a three-star hotel.", "Date": "April 26, 2008"}], "HotelInfo": {"Name": "San Antonio De La Florida Hotel Madrid", "HotelURL": "/ShowUserReviews-g187514-d1211109-Reviews-San_Antonio_De_La_Florida_Hotel_Madrid-Madrid.html", "Price": "0", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Paseo De La Florida 13</span>, <span class=\"locality\"><span property=\"v:postal-code\">28008</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "1211109", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/73/37/7337c4ffba93e868b7052135df3856f82large.jpg"}}