{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Monterosso al Mare, Italy", "Title": "“Good enough for short stays!!”", "Author": "tellmemary", "ReviewID": "UR123418601", "Content": "I've been in the hotel for quite a few nights. At first I had a room that I didn't know it was a triple. I was on my own and that space was probably just enough for me! Furniture and bathroom very modern, a big shower. It all depends on the kind of trip you're doing. I won't suggest it for sure to people coming from the opposite side of the world, with big heavy luggage as there's not even space where to put them. It could be fine for a couple staying for a few days only, for a weekend, expecting not be able to walk around the room!!! Kitchenette is fine for 2 people, to have something light, to have breakfast. The triple studio has got a full double bed+a single bed pushed together. The double studio has a bed which is slightly smaller than a double. It's about 74 inches long so be ready to have your feet out at night. Drafts of air passing through the window but you can low the curtain and usually rooms are warm enough even if heating doesn't seem to work properly. In the first studio the heating control panel displayed EE, that, written just below it, meant there was an error. Same thing for the second studio, but the one in the bathroom was not working in this case. BUT, as I already wrote the room was always warm enough. A lot of soap and towels provided such as glasses and dishes etc... Fast Wifi also provided even if when it was out of order and I just went to ask the secretary if she knew it was having problems she didn't even look at me saying that nobody complained about it..... Same thing when the lift was temporary stuck on floor 1 as I have been waiting for a while, she just told me that probably somebody was getting off on that floor. She didn't care at all. If you have problems try to talk with the man that is at reception, much worthed!!!! Good good location, just a few steps from 3 lines of tube and from beautiful Hyde Park. Last problem could be that the fire system works in all building, in each single room. So each time some smoke reaches it in any way, you'll have to wake up and run downstairs and nothing happens....I think fire system is very useful but this way I had to run 3 times, twice at half past midnight and once at 9 in the morning. Annoying if you're sleeping. I would suggest it anyway to those who can adapt to possible small inconveniences.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Johannesburg, Gauteng, South Africa", "Title": "“Certainly no magic in this stay”", "Author": "Alan S", "ReviewID": "UR123189783", "Content": "The 3 bed studio was the size of single hotel room with a single bed squeezed up against a double with no access to the double from either side. the room as so small that we could not get all the luggage and ourselves in. The room (not a studio) was totally inadequate. The hotel staff could not care less. The kitchen facilities were very poor, certainly not adequate to self cater for 3 plus there was no where to eat and the TV microscopic. I moved out immediately, but so far despite emails and calls have received no response from the hotel nor any offer of a refund.", "Date": "January 17, 2012"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Comfy and clean”", "Author": "russ m", "ReviewID": "UR119180833", "Content": "Didnt know what to expect , will not be staying in a London hotel again. This place is clean and comfy. Its a little small but for a few nights its great . All i want is a comfy bed , no noisy neighbours and a nice powerful shower in the morning. I will be booking again for next week.", "Date": "October 11, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "London", "Title": "“Failed to live up to web site promises”", "Author": "WWB1705", "ReviewID": "UR115152331", "Content": "My single suite was disappointing with nothing like the kind of kitchen facilities promised on the web site.", "Date": "July 8, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Appalling service.”", "Author": "AlanK_11", "ReviewID": "UR103825551", "Content": "The rooms were ok if a little small, but we returned for our last night at 10pm and were told we had been moved to another hotel because of a plumbing problem. The other hotel when we finally arrived after 2.5 hours was disgusting, the staff at both 39 suites and the other hotel could barely speak English, and were incredibly rude and disinterested. Avoid this place at all costs.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Barnsley, United Kingdom", "Title": "“Ideal location for work”", "Author": "Debs_86", "ReviewID": "UR101941078", "Content": "Booked to stay for 7 nights for work reasons. Chose an apartment rather than hotel because of value for money & the fact could use the little kitchen. Check in was really simple, didn't really see any staff for the rest of our stay as been in the apartments there were no need. Had a double suite which was cleaned everyday. The room had everything we would need. The bathroom is very modern with excellent shower. Ideal location for work & shops/restaurants nearby so easily got the essentials for breakfast & snacks. Would have no problem returning back here.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“nice location to stay”", "Author": "Europe_Lover_90", "ReviewID": "UR94600872", "Content": "It is really convenient, cheap night rates. Room small but nice designed and clean. 5 minutes walking to Quensway station of subway. wi-fi area free but so slowly. On the same street as the subway station, there are tons of restaurants that open late (indian, malaysian, thai, chinese, pub, fast food).", "Date": "January 27, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“nice place to stay”", "Author": "1maya", "ReviewID": "UR86189033", "Content": "This place is in very good location, near tube and many bus stops. Hotel staff didnt speak very well english, but they were very nice and helpfull. Our room was very clean at our arrival and cleaned every day. Unfortunately, double room was not very spacious, far too small for 2 people, but we did manage. Very nice, spotless and shiny bathroom. Kitchen was just ok. Well,it is hidden in the wardrobe so u cant really cook a big meal. It is fine for cooking something quick and small. Good news, they fixed the lift just 2 days before our departure, which was 3rd November :-)) I read few complaints about the noise as well. It is an old english building so well u can hear your neigbhours sometimes, so they will hear you probably. Not a big issue really. In conclusion, I would recommend this hotel and I would stay there again. Wish you nice stay.", "Date": "November 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "brussels", "Title": "“Disturbing sewer pipe sounds”", "Author": "hotelreviewpvs", "ReviewID": "UR58648027", "Content": "This hotel is rather clean, with practical but rather cheap furniture. The cleaning is okay, but the reception service is not so good. They are not very communicative. But the worst is the terrible and disturbing sound you hear in the room. whenever someone is taking a shower, washing their hands, flush the toilet you can hear a sound from sewer pipe which tremblates trough out of the room. You can't fall a sleep, in the morning you are wake as soon as someone gets out of bed and uses the bathroom. We had a terrible time and were very happy to leave. The problem is they ask you to pay in advance, so you wouldn't take an other hotel, whoch is really a necessity for your rest. Sorry to be write such a harsh review, if they would fix this problem this would be an okay hotel on a rather good location.", "Date": "March 15, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "San Francisco, California", "Title": "“Small, Noisy, Average Price, but Convenient”", "Author": "YoyoMar", "ReviewID": "UR49300992", "Content": "The room reminds me of a hotel in Hong Kong because it was really tiny. Check in was fine at 43 hotel next door. Staff was not giving everyone the cold shoulder, as if they do not care whether you do business with them or not. Not that we paid a lot, but $150 a night is still not super cheap. Bathroom looks modern, but plumbing sucks. Everynight we would have to turn on the water, wait for 5 minutes before any water would come out and for it to warm up. As for the bed, it's a really really cheap bed and very uncomfortable. First two nights, I couldn't fall asleep because of that. Also another weird thing is that the hotel room does not even have a phone. Which hotel in the 21st century does not have a telephone??? The walls are super thing too. There was a young Italian backpacker next door and I was able to hear every word they said. That said, a couple pros. The linens and towels were clean. They also have free wifi. It is also convenient as it'll take 2 blocks to walk to the subway (Queensway station). On the same street as the subway station, there are tons of restaurants that open late (indian, malaysian, thai, chinese, pub, fast food).", "Date": "November 16, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Rhodes Town, Greece", "Title": "“Cunning trick!”", "Author": "Catherine70", "ReviewID": "UR48391265", "Content": "This hotel, although recently renovated, hides a terrible secret: unbearable pipe noise which is heard whenever you or ANY OTHER GUEST OF THE HOTEL open the tap, takes a shower or flashes the toilet!!! The noise can keep you awake the whole night. And the hotel management of course knows this so they oblige you to pay when you arrive (although this is not mentioned in the reservation page) so that you can not escape. Yes, it is conveniently located but with such good transportation you can stay somewhere a little bit away from Oxford street - try Kensigton or City or Westminster area. Also, instead of using a third sofa bed, they gave us an air mattress which was horrible to sleep on. What is more, we had to ask them for sampoo or shower gel the 5th day as they hadn't replaced the ones that had finished the 3rd day.", "Date": "November 3, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "UK", "Title": "“Unreliable & Irresponsible”", "Author": "BlessedMandy", "ReviewID": "UR34398142", "Content": "I went through a lot of trouble booking this hotel before I embarked on my europe trip. This hotel confirmed my booking weeks before my stay. However I had been travelling around and had no internet access. Just the night before I arrive london, I had internet access and found out from my email they cancelled my booking 1 week before without any prior notice. They offered no alternatives, never made any effort to contact me in person via phone or whatsoever! I had to look for accomodation the night before I travel to london. It made it worse as it was Wimbledon weekend and there was concerts in london. They were very unreliable and totally irresponsible", "Date": "July 10, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“The best thing about this apartment was the location.”", "Author": "BigBird65", "ReviewID": "UR34252920", "Content": "I knew I was doomed from the start when I got to Queensborough Terrace, checked in at No. 43 and they didn't have my reservation. I had booked the 39 Suites through a third party site, central-london-apartments.com. They had phoned me the day before I was supposed to be there to tell me that the credit card had declined when 39 Suites had tried to authorise a night's stay prior to my arrival. I must admit I gone a little crazy with it that week (it being my birthday, the reason for this weekend away) so I wasn't suprised. I gave central-london-apartments another set of credit card details which went through fine, and they sent me an amended reservation. That was Thursday 25th. As I say, I got there on the Friday 26th and reception couldn't find my reservation. It turned out that when they received the same amended reservation with the new card details they had cancelled it instead. After much to-ing and fro-ing, them calling central-london-apartments.com then telling me that they were fully-booked and that there was nothing they could do, they finally find my amended reservation, with the word \"cancelled\" through it that one of their staff had done. They realised it was their mistake and miraculously found me a studio, what I had originally booked. I was given room S15 on the third floor, just behind the lift. The rooms aren't very big and it really is only suitable for one person, two is a squeeze. I don't know if it was just my room or what, but where to start. The closet/wardrobe was a tall thin unit, with a mirrored front which was cracked and broken. It was unsuitable to put your suitcase in. There were no shelves and it contained maybe two hangers. It did have a safe inside which was handy. The bed, although fine mattress-wise, had no mattress protection cover on it that you get at most hotels, just one thin flat sheet that kept on coming loose as I slept. So you can imagine all the bed bugs inside the mattress. All the faucets were loose from their fittings. The shower faucet, the sink faucet and even the little kitchen sink faucet. The blind at the window was broken so I couldn't raise or lower it if I wanted. Luckily it was a hot weekend so I didn't mind having the blind down to keep cool. You can tell the apartments were hastily made and put together with cheap labour and fittings. There were also dark water stains above the door and along the exterior wall. Not brilliant. Even one of the spotlights in the ceiling was coming loose. And don't laugh, but the toilet was too high off the floor. It's one of those more contemporary built-in toilets, not a traditional one with a cistern, so it was built too high into the wall. I was actually perched on tippy-toes when sitting down, if you know what I mean. And I'm 5ft 10ins so that's saying something. The location was fantastic. Around the corner from Hyde Park with the nearest tubes being Queensway (Central line) and Bayswater (Circle and District line). Queensway was very handy for going shopping at Westfield Shopping Mall, Bayswater was handy for the Museum of Natural History and the Victoria and Albert Museum. Lots of shops, restaurants, bureau de changes nearby. The little Tesco's directly across the Bayswater tube was very handy. I didn't let the state of the apartment deter me though. A bit of shopping, a bit of culture, plus music (Glastonbury) on the telly and I had a fantastic weekend on my own. All in all, I loved the location, not too impressed with the apartment. I'd stay in the area again if I want another weekend away from home, but I won't stay at 39 Suites. There are lots of other serviced apartments in the area to choose from.", "Date": "July 8, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Singapore", "Title": "“Terribly irresponsible”", "Author": "AnnoyedTraveller123", "ReviewID": "UR33835031", "Content": "Cancelled our reservation through email on the 26th June 09 when we were due to check in on 4th July 09 for 3 nights without any valid reason and alternatives, not even q phone call to warn us. Found out 1 day before arriving. terrible experience", "Date": "July 3, 2009"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Montevideo, Uruguay", "Title": "“They cancelled my reservation 1 week before trip!”", "Author": "tessiebird", "ReviewID": "UR33265420", "Content": "April 2009: Made my reservations through PropertyIndex.com, paid my deposit and received my reservation confirmation, all very smoothly. Check in date: July 4th (Wimbledon finals and Maddona in London weekend) On June 26th PropertyIndex.com sends me an email informing my reservation at 39 suites was cancelled and that I would get my deposit refunded because the agency stopped working with this hotel. This is 7 days before I start my trip. Just imagine the mess if I had already started my trip somewhere else! I checked through other reservation sites to find out if 39 suites had gone out of business and I found not only that they have rooms available but that they are charging almost 300 pounds above the fee we had settled in April (for a one week stay). Of couse IÂ´m having a hard time finding suitable accomodation at a reasonable price, considering weÂ´re checking in while Madona is in town and Wimbledon finals are taking place. So far, PropertyIndex has contacted me informing they are trying to provide alternative accomodation, but iÂ´m quite hesitant to trust them again...what if they cancel the day before I travel? 39 suites has not contacted me so far to explain or appologize for the inconvenience. IÂ´ll keep you updated to so you can make an informed choice should you decide to consider 39 suites for your stay.", "Date": "June 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Melbourne", "Title": "“Clean convenient small suite, suitable for 2 people, great location.”", "Author": "Blues95", "ReviewID": "UR31407161", "Content": "My daughter and I stayed at Apt 5 on ground floor, very clean and quiet. Cleaned every day, it was in a good location near Queensway and Bayswater stations. Plenty of restaurants/take aways close by. We had a great time in London.", "Date": "June 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Great location in relatively quiet side street”", "Author": "Dobwalls", "ReviewID": "UR28602553", "Content": "This hotel has an excellent location, with the Central line and Circle & District lines all within a 5 minute walk from the hotel. The rooms are small, but comfortable and well fitted bathrooms. The small kitchen is perfectly adequate to make small snacks, with a microwave, fridge and a couple of hot plates. All in all a comfortable stay and not a bad price for London.", "Date": "April 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Very good value, great location”", "Author": "viverparaviagar", "ReviewID": "UR27289669", "Content": "My husband and I stayed in this apartment hotel in the Bayswater area of London in March. I had been a bit nervous because of a couple of the reviews I read on this site. We had no problems at all. We arrived early and although we couldn't check in for a few hours, we put our luggage in a cupboard that was locked. The room was large enough for two, had a small kitchenette in a cupboard, and was very clean. The cleaning staff came in every second day, changed towels as needed and cleaned the room. (I should say that we only wanted it cleaned that often.) The bathroom was very small, but there was always hot water and even a heated towel rail! There was a small safe in the room, instant coffee and tea available. One night someone was playing a guitar till midnight or so, but that was the only noise. The view was just another building, but we weren't there very much. The wireless internet worked the entire week as did the elevator. On the whole, a great little place if you're not looking for frills. As a bonus, the area is very convenient while out of the hustle and bustle of Soho/Covent garden area.", "Date": "April 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Holland", "Title": "“wonderfull”", "Author": "kootjes", "ReviewID": "UR27169316", "Content": "Excellent location for public transport, restaurants, shopping, walking in the park. The suite itself was very clean and efficient (small cupboard kitchenette with everything you need) and safe.", "Date": "March 31, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Mornington, Australia", "Title": "“Comfortable, fantastic location”", "Author": "Megan_Chittenden", "ReviewID": "UR24544893", "Content": "We booked at 39 suites on LateRooms and were very happy with our choice. The apartments are a few minutes walk from both Queensway and Bayswater underground stations, which was really convenient. They were brand new, meaning everything was still nice and clean and new. The apartment we stayed in was more of a room - it was really small - but absolutely fine for us since we didn't plan to spend our time in London in our hotel room. The room did have a little kitchenette (in the cupboard!), with a fridge, microwave, kettle and stove. We didn't really use the kitchen for much other than tea and coffee, but it was nice to have the option. It was quiet, clean and comfortable, and great value for London, in a fantastic central location.", "Date": "February 13, 2009"}], "HotelInfo": {"Name": "39 Suites", "HotelURL": "/ShowUserReviews-g186338-d1216965-Reviews-39_Suites-London_England.html", "Price": "$125 - $1,582*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">43 Queensborough Terrace</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">W2 3SY</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "1216965", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/d5/0a/d50abb66cf69dda17e95ed324e0a0eec1large.jpg"}}