{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Zuerich", "Title": "“Good location, expensive city.”", "Author": "canswiss", "ReviewID": "UR122880948", "Content": "This hotel is slightly off the main path in the center, but that makes it more interesting ...and more of a \"find\". The area is best explored on foot, as most of it is lanes and pedestrian streets. The hotel is on the edge of the gothic \"old town\", in an area that is getting a bit more touristy each time I go to Barcelona. The location is good, in that it is only a couple blocks away from some excellent bars, tapas places and great street life... but the couple blocks also mean that the hotel is quiet enough. The hotel is on a main street, so it is wise to get a room on an upper floor if possible - just to avoid the street and pedestrian noise The rooms are newly renovated, and the windows are quite good for soundproofing. The rooms are furnished in modern (but somewhat cheap) style, but they are comfortable and spacious enough - rare in expensive downtown Barcelona. The hotel has WiFi (included) and also a PC station on the 2nd floor - both very convenient for the business traveler. The restaurant downstairs serves an (included) buffet breakfast, and the quality and selection is very acceptable. I also hear the (asian fusion) food is good for dinner, but given the proximity of tapas and spanish places nearby I have always wanted to \"go local\". The staff are helpful in a proficient manner. The service has always been very professional. All in all... the price / value / location / style balance is very good, and I will not hesitate to go back again for either biz or personal travel.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Geilenkirchen, Germany", "Title": "“Great spot to stay!”", "Author": "darlene_ray11", "ReviewID": "UR122745388", "Content": "Was quite impressed with this hotel ... very clean, staff is friendly and helpful, location is great and the room was one of the largest I've seen in Europe. Didn't notice the \"paper thin\" walls, but there was a considerable amount of noise to be heard from the street. Mind you, this was Christmas Eve on a Saturday night -- apparently the Spaniards like to be out and about (not like North Americans who gather inside each other's homes. All in all, I would totally recommend this hotel!", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago/Germany", "Title": "“Considering other options, great value and location”", "Author": "00annette00", "ReviewID": "UR121114618", "Content": "I really enjoyed my three night stay at this hotel, I agree with other reviewers that the walls are paper thin, but most hotels in Barcelona are not well equipped for a quiet night's rest if located anywhere in popular tourist locations. For the price and location, it's a great value. The breakfast was plentiful and varied. Coffee service is difficult if you're there during a busy time because each person makes his or her individual cup and there are only two machines. The location is excellent. I've stayed at other similarly priced hotels in the region and also rented apartments. This was a good choice despite the minor issues like thin walls and poorly situated mirrors. The room was spotless (even the corners of the bathroom), they offer all guests endless bottles of water for free, and the location is wonderful. Oh, and there's a lovely rooftop terrace with a pool and lounge chairs. It was a bit too chilly for this trip, but in the warmer months, I imagine this would be an excellent spot to unwind after a long day of touring about or working.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“paper thin walls”", "Author": "Tania M", "ReviewID": "UR119666494", "Content": "While this was a lovely hotel with great staff and good overall facilities it was blighted by the fact that the walls were paper thin. We could hear the person next door coughing - as if they were in our room. Anytime anyone went down the corridor of our floor we could hear everything they said and when they opened the door to their room its seemed like the whole floor shook. I'm pretty relaxed about noise levels most of the time and appreciate that if you're staying in the centre of Barcelona you might hear people on the streets - but for the price of the hotel and its overall swankiness - skimping on wall thickness was a bit of a mistake.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Belgrade", "Title": "“theft in a hotel room”", "Author": "jovici", "ReviewID": "UR30394130", "Content": "My colleague was robbed in that hotel. Someone entered his room with a card while we were all out, and opened a safe box (with an electronic code). His net book, camera and a lot of money are gone. Hotel manager and staff were incredibly unconcerned. They called a police after half an hour arguing that my colleague should wait till morning. The manager told us - it happens sometimes. They just waited us to leave. Despite their words that they have a system which registers every entry in the room, they didn't bother to check who used a card to open that room in a precise period o time while we were all out. No one ever mentioned anything about refunding, although hotel statement is that things in safe boxes in the rooms are their responsibility. Recommendation: don't go there if you have any other option. If you go, bring all your values with you when you leave your room.", "Date": "May 20, 2009"}], "HotelInfo": {"Name": "Ciutat Hotel", "HotelURL": "/ShowUserReviews-g187497-d1217520-Reviews-Ciutat_Hotel-Barcelona_Catalonia.html", "Price": "0", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Carrer Princesa 33-35</span>, <span class=\"locality\"><span property=\"v:postal-code\">8003</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "1217520", "ImgURL": ""}}