{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hong Kong", "Title": "“Excellent location, modern and cozy”", "Author": "QQM", "ReviewID": "UR122545555", "Content": "We stayed at Deluxe triple room for four nights. The hotel location is just great! It is modern and very clean. The room and the bathroom were both large. We travelled with 3-year-old boy. When we arrived the room, there was a small bathrobe on the extra bed with bed rail. It's really sweet to see this. We love this hotel very much and will recommend it to our friends.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cyprus", "Title": "“Location, comfort and reasonable prices (for Venice)”", "Author": "Scordis", "ReviewID": "UR122522836", "Content": "This hotel is not cheap but for the extremely expensive Venice standards it represents great value. The location is perfect (5 minutes from St Marks and a bit more for Rialto), the rooms are huge (we got a triple room as we took with us our 6yo daughter) and quite luxurious and clean, the breakfast is reasonable and there is even a small spa (sauna, jacuzzi and steam bath). The staff are personable and helpful. The one major disappointment relates to the spa as you can only use it by reservation and then only for 30 minutes (!) each time which is patently too little time.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Loved Venice”", "Author": "Sapphireprincess065", "ReviewID": "UR120583899", "Content": "We had two wonderful nights at Palace Bonvecchati! Our room over looked the canal, and you could hear and see the gondola's going by! There is a GREAT restaurant on the other side of the hotel, and it also has a very good breakfast buffet. Well that is if you like sitting outside and watching gondolas go by! This is an ideal location too, in the middle of Point Vecchio, and St. Marks Square! I would go back, and recommend this hotel to anyone who goes go Venice!", "Date": "November 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Expensive but worth the extra money”", "Author": "MatthewCachia", "ReviewID": "UR118458674", "Content": "This hotel is fantastic. Close to the attractions and beautiful. The only downside is the price. All I can complain about is that the late check out time could be extended till at least 2pm as we had a long wait till our evening flight. The breakfast was Aldo brilliant - a buffet with all you can imagine!", "Date": "September 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "oradea", "Title": "“good location but unjustified big price.”", "Author": "ovigalea", "ReviewID": "UR116558036", "Content": "PLUS: We booked at PALACE BONVECCHIATI a triple deluxe for 2 adults and 1 child in august 2011. Room very clean, and clean sharp at time. Room size and amenities adequate. Very comfortable king bed. Reception staff polite and helpful. Fax in room, and private international phone number. Ceilling air conditioning very well working, very silent and the fan good setted in order to not disturb. Carpet alteranates floor tiles in a good way. MINUS: Not a design hotel. The room furniture doesn't seem to be recently refurbished in an old fashion style. Rather seems to be a really OLD one. SEE PHOTHOS. There are 2 brothers hotels in connected buildings: bonvecchiati - the cheaper one, and PALACE bonvecchiati - expensive one. Breakfast is served in the same place, in a crowded restaurant, same food and drinks. Poor breakfast for a FIRST CLASS 4 stars hotel. No selected food, you ussually find in, let's say, a french first clas 4 stars hotel. No free wireless connection in room. When complained, receptionist jocked to me: \"air only is free in venice\". Hard to understand, after we stayed this holliday in Monte Carlo 5 stars and Provence 5 stars hotels, where no one receptionist could afford such an answer !! But we have no complain regarding this. We have humour everywhere. Comparing prices with 5 stars luxury hotels and 4 stars first class boutique hotels in monte carlo and france, or in rome, and lugano, or in wien, I think this hotel is overpriced for what they offer. Our score for palace bonvecchiati : 8,5.", "Date": "August 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Cluj-Napoca, Romania", "Title": "“Great location - lousy room assignment”", "Author": "gmsmithsf", "ReviewID": "UR103864339", "Content": "It's hard to beat the location - midway between Rialto bridge and San Marco plaza. The hotel is beautiful and well maintained inside and out. The staff was very pleasant, knowledgeable and spoke/understood English very well. The buffet breakfast was excellent with a wide variety of items and excellent wait staff. All things one would expect from an expensive 4 star hotel. We arrived on a very early flight and were in the hotel by 9a.m. As expected, it was too early to get a room. We were told the hotel was fully booked and our room would be ready by noon (2 hours before normal check-in). We left our luggage and toured. At noon we were taken to our room. It was a very small handicapped equipped room. So small that the bed was pushed up against the wall such that one person had to crawl over the other when getting in bed. The bathroom was outfitted with so many bars and rails that you felt you were running an obstacle course. The shower (no tub) was simply a small space by the toilet. All very practical and forward thinking for handicapped people, but we are not. Since the hotel was full I saw no use to complain about the room. I suppose someone has to be assigned to less comfortable rooms when the hotel is full. Upon check-out, when I mentioned that I didn't like the room, the gentleman asked if I asked to be changed upon check-in. I said no, as the hotel was full. He remarked that was true but we could have moved the following day to a different room. We didn't book an expensive hotel in a 'deluxe room' so that we could repack and move to a different room after one night of a 3 night stay. Since I booked the room many weeks in advance and was very early to check in, I can only assume that we were assigned what has to be their worst room because we didn't book directly through the hotel. Booking.com was used. All said, I would recommend the hotel IF you demand a decent room.", "Date": "April 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Matlock, Derbyshire", "Title": "“Fiftieth birthday Special Treat”", "Author": "Visitor-to-Italy", "ReviewID": "UR45427013", "Content": "This hotel exceeded our wildest expectations in every way. Atmosphere, furnishings, service, hospitality, food, beverages, etc. were outstanding.", "Date": "September 29, 2009"}], "HotelInfo": {"Name": "Palace Bonvecchiati (deluxe Rooms)", "HotelURL": "/ShowUserReviews-g187870-d1217953-Reviews-Palace_Bonvecchiati_deluxe_Rooms-Venice_Veneto.html", "Price": "$326 - $660*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">San Marco 4680</span>, <span class=\"locality\"><span property=\"v:postal-code\">30124</span> <span property=\"v:locality\">Venice</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "1217953", "ImgURL": ""}}