{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Penticton", "Title": "“Super nice staff! Great location”", "Author": "Sammy T", "ReviewID": "UR128308616", "Content": "Great location. Really nice front desk staff. Nice clean rooms loved the king size bed!!!!", "Date": "April 22, 2012"}, {"Ratings": {"Overall": "5.0", "Service": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“I haven't even stayed there yet....”", "Author": "Em2324", "ReviewID": "UR127897141", "Content": "I haven't even checked in yet and the service has been fantastic. There was a bit of a mix up with the rate I was quoted when I had called the first time, when I called back to book they had no idea what I was talking about. I ended up explaining what had happened to Michelle, the Sales Manager, and she was awesome. I really can't say enough good things about her, I have had to call her a couple times since too with questions regarding my dogs staying with me and she has dealt with them immediately. I am looking forward to our stay in May and just wanted to say thank you Michelle!", "Date": "April 14, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Rude, unhelpful, locked out of my room!”", "Author": "andrewDublin_Ireland", "ReviewID": "UR127831770", "Content": "I booked & paid for 3 nights in this hotel through a well known online travel agent. Upon arrival at 4pm I was told they had no knowledge of my booking. I presented them with the confirmation document I recieved and was told I must contact the travel agent and ask them to send confirmation to the hotel. In the mean time I was told I could check in as normal. I thought this strange since I had the document but duly emailed the agent (based in Europe). The following morning I went out for breakfast and when I returned to the hotel I found my room key wouldnt work. I went to reception to be told that I had been locked out of the room as I had failed to contact the travel agent and that the hotel had contacted them and hadnt got the booking confirmation either. I demanded to speak to a manager and informed him that at no time was I told I would be locked out of my room, that not even 24hours had passed since I checked-in, and given an 8 hour time difference with Europe it was likely the office was closed when I emailed. After spending almost an hour on the phone to the agent, I was told they had recieved no communication with the hotel and that the confirmation I had should have been sufficient but they would contact the hotel directly to confirm this. I found the entire thing to be extremely upsetting to be locked out of my room. The staff including the manager were rude and unhelpful and I would never stay here again. Oh and the noise around the hotel due to construction is AWFUL", "Date": "April 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Fort Benning, Georgia", "Title": "“Needs Renovation, but Staff and Location are Great”", "Author": "brianmcmurry", "ReviewID": "UR127674876", "Content": "We stayed here for three nights in April, 2012 using Choice Privilege points. The best thing about this hotel is the staff (Christopher, especially) and the location. The negatives include the need for renovation, the construction noise around the hotel, and no continental breakfast. Parking was an issue for us as well because our Kia Sedona wouldn't fit under the low clearance of the parking garage without first removing the roof rack. For those with large vehicles, parking outside of the secured garage is possible, but not recommended due to the high risk of vehicle theft/entry in the area. The parking in underground garages at this hotel is tight! Leave your full sized vehicles at home. Parking cost us $16/day. The lobby of this hotel is very nice, if modest. We did not try the restaurant or bar there. The hallways and rooms are dated though and need renovation. There is major building construction going on to the front and rear of the hotel but it did not bother us. The room had a nice flat-screen television with a clear HD picture. The hotel does have WiFi, but we could not get connectivity due to a weak signal (We stayed in room 402 which was at the extreme end of the hotel, so rooms closer to the middle might have better luck). I wish I'd realized that there was no continental breakfast offered... just a single serving coffee pack in the room. I've come to expect that continental breakfast is pretty standard in Choice hotels and did not read the hotel description very carefully on this. You can buy breakfast in the hotel restaurant or there are many nice and unique restaurants in easy walking distance. It was loud outside on the weekends and I was awakened by revelers in the streets late at night (that's Vancouver though). Location is the best part about this hotel. It's an easy walk to the Aquabus to Granville Island and every other place (Gastown, Chinatown, Stanley Park, etc) is within walking distance too. I recommend walking up to Davie Street, turning left and finding one of the many restaurants there. The hotel is pet friendly (for a fee) and there are many dog parks in the area. Overall, it's an OK place to stay. If they'd renovate the rooms and add a free breakfast, I'd certainly come back again. I hope you find my review to be helpful.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Hay River, Canada", "Title": "“Great spot, great service and awsome price!”", "Author": "christian b", "ReviewID": "UR127500413", "Content": "Stayed for 4 nights with wife and newborn and everything was great: food, poximity to bus stop, rogers center, downtown, clean, quit, 89$ a night, and awsome service (very helpfull). If you are looking for a nice place to sleep, for some good food at the hotel, and great service I stronlgy recommend this Hotel. We did not have a car so verify the parking if driving here.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Hamilton, New Zealand", "Title": "“Noisy”", "Author": "Waikatosflyingkiwi", "ReviewID": "UR126462598", "Content": "Stayed here 1.5 years ago and forgot about the road noise. Its pritty bad for a Wednesday and Thursday night. Perhaps a room on the other side of the passage may be better. At present construction accross road but did not spend daytime hours in room so no noise issue that time of day for me. Room quite dark, bed comfortable. Bathroom small. Decor becoming a little warn and dated. Reception very helpful, even printed out a detailed way to get to destination way out in the suburbs to factory outlets. Business centre if you dont have a computer.Walk to Yaletown not to far away and its many restaurants, worthy as is the Yaletown Brewhouse with its wonderful Brown Ale. Perhaps a walk down the hill to a little ferry which goes the short distance to Granville Island. Location far enough away from the busy citys foot traffic, so beggars and dodgy sorts not an issue. Town was very tidy last visit being just after the Olympics but now the beggars and others are in your face. Not good.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Bad customer service”", "Author": "Cori L", "ReviewID": "UR126402029", "Content": "The customer service is horrendously terrible. We inquired about a lost iPod and were put on the phone with the 'lost and found administrations' and were immediately treated rudely. The woman on the phone would not listen to us and would not give us straight answers. She interrupted us with ever word we uttered. Upon me asking whether or not she could check right now if there was an iPod in the lost and found, since we had friends going through town, she replied sarcastically \"Ma'am you stayed here on the 17th, and you are just calling now? I can't do that\" Yes we are just calling now because we just realized it was missing. I am not recommending this hotel to anyone for the reason that running a hotel is about customer service, and they have not showed us any. Thank you for nothing. I will be talking to the manager as soon as we can get a hold of someone other than the two unhelpful people we had on the phone.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Milton Keynes, United Kingdom", "Title": "“Vancouver Holiday February 2012”", "Author": "ellen4516", "ReviewID": "UR125656576", "Content": "This hotel was recommended by a freind and now I recommend it to anyone reading this.Its location is within walking distance to the main city.Its about a ten minute walk from the train station,two minute walk to the aquabus to Granville Island.The bedrooms are very stylish and we were also able to stay in a suite including a small kitchen.The hotel was very clean and all the staff we were able to meet were very friendly and helpful in both giving directions or recommending places to see and where to eat.We also ate at the hotel and this was well priced and delicious! There is still construction work being done opposite starting about 730am,we were up anyway so it did not affect our stay. If i was going to Vancouver again I would definately stay here .", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Whistler, Canada", "Title": "“My choice over all”", "Author": "JO P", "ReviewID": "UR125397052", "Content": "A fantastic hotel and fantastic staff. I have used this for personal visits, business and recommended it to friends visiting from the U.K. and have always had great feedback. Just a 5 minute boat ride away from Granville Island and a 10 minute walk to Robson Street what more could someone want. The bar is friendly and the food is great.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Whitby, Canada", "Title": "“Highly Recommended”", "Author": "Lisa L", "ReviewID": "UR125156938", "Content": "I thoroughly enjoyed my stay at the hotel. My room was clean, comfortable and to high standards. I was within waking distance to places and people that were important to me on this visit. More than anything, the staff members, from each and every front desk person to the people in the dining area, were courteous and kind and went out of their way to ensure I had all that I needed. I will definitely come back to this hotel and will highly recommend it to others. Thank you!", "Date": "February 24, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Oklahoma!", "Title": "“Not too impressive”", "Author": "YourNextGuest", "ReviewID": "UR125142518", "Content": "I stay at a lot of Choice Hotels. This one didn't impress me much. I understand paying for parking at downtown locations, but the parking area of this hotel was EXTREMELY small. I was afraid my rental car would get damaged and I'd be the one responsible for fixing it. The rooms were dated and needed to have items replaced. To top it off, the staff was less than courteous. Next trip to Vancouver, I'll be looking for a different Choice hotel to stay at.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chase, Canada", "Title": "“great stay”", "Author": "econospan", "ReviewID": "UR124729380", "Content": "stayed for a week, older hotel, but clean rooms and very friendly staff, breakfast included in price and was very good. very good value for the money. staff was very helpful in getting our truck in the parkade, which was a close fit. beds were comfy. will definately be staying here again.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Portsmouth", "Title": "“Vancouver Christmas and New Year 2011/2012”", "Author": "RedPig", "ReviewID": "UR122734173", "Content": "We stayed at the Inn at False Creek between Christmas Eve and New Years day. The hotel was clean and tidy, the rooms were made up daily to a high standard and provided a good breakfast. The staff were polite and helpful, even making arrangements for us to eat at a resturant on Christmas Day, before we even arrived in Canada (special thanks to Leanne and Stephen). The beds were firm & comfortable and the hotel was well positioned to explore Granville Island (via aquabus), Davie St eateries, Robson street & the malls at Pacific place, Sears, China Town, Gas Town and Stanley Park - all best done on foot, but not at the same time. Highlights - Aquarium at Stanley Park, Seaplane flight - just do it, Granville Island (eclectic mix of arts & crafts). Lowlights - it rained on 7 days out of 9, but it was not unexpected. Good Eating - Characters Resurant on Davie (best Lamb Kleftiko you will ever taste and great hosts), Joe's Grill on Davie (great breakfast, coffee and welcome).", "Date": "January 7, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Sidney, Canada", "Title": "“Won't ever be staying here again”", "Author": "Zala D", "ReviewID": "UR122298473", "Content": "Just checked out. Not only were the staff rude to me, they were rude to a very nice guest and a person who called in. The rooms are extremely dusty. Looking for my hotel key card under the nightstand, I saw so much filth I couldn't believe it. Obviously no attachments on their vacuums. The cups were dirty, the bathtub was obviously not cleaned and there was no housekeeping on Christmas morning. A simple, courteous \"heads up\" would have been nice, rather than the rude \"it's Christmas, of course there's no housekeeping\" response from the staff.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "vancouver island", "Title": "“tired hotel”", "Author": "vicriver", "ReviewID": "UR121873424", "Content": "The staff were very friendly and accommodating. We had an issue when checking in with the discovery of a bed bug and were immediately moved to another room and they were on the problem. Carpets and furniture were not clean and the bedding and towels, although clean were tired. The place could use a \"do over.\"", "Date": "December 19, 2011"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Most uncomfortable beds”", "Author": "MaxxMontreal", "ReviewID": "UR121685418", "Content": "This is a very average budget hotel. The beds are the softest and lumpiest I've ever slept in; though I couldn't get a decent night's sleep. The windows let in so much noise it sounded as if they were open. Otherwise the place is ok and pretty clean; could do with a paint job though. Staff is helpful; I was even able to check in early. Free wifi; but very slow. Great location.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "North Vancouver, Canada", "Title": "“Great Stay”", "Author": "shawn b", "ReviewID": "UR120936536", "Content": "My husband and myself had one night away from the kids, so we picked this hotel due to its location, and how close it was to the restaurants and shops in Vancouver. The front desk staff were VERY friendly and helpful in helping us pick a restaurant for dinner, which was about a 10 minute walk..very convienent!!. Our room was nice and clean had a warm cozy feel to it. Overall our stay was very pleasant and will return whenever we get a night away from the kids again!!!", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Huntsville, Alabama", "Title": "“great way to end cruise”", "Author": "mac658", "ReviewID": "UR120801756", "Content": "so close to everything, clean, safe, nice views. walk to the ferry to granville island, go to a shakespear play on the beach.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Victoria, BC", "Title": "“Misleading advertising”", "Author": "HeftyMiguel", "ReviewID": "UR120667738", "Content": "We booked into this hotel because my wife had to have eye surgery so the reasons for picking this hotel was for the location it was close to the hospital, it was a good name and because of the surgery and not able to get around for a day and a half the restaurant. It is advertised on the web it has menu's in the rooms the front desk upon check in gave us no indication that there was no food service THE RESTAURANT IS ONLY OPEN ON FRIDAY & SAT. so if they won't tell this will. There response to this is to hand you a hand full of take out menu's mostly asian food which I like but what are we to do for Breakfast and lunch with a wife who is bedridden. Thanks Quality Inn at False Creek", "Date": "November 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Okanagan, British Columbia", "Title": "“Great Location, good value”", "Author": "sawmill9", "ReviewID": "UR120083089", "Content": "We stayed in May, 2011. Room was basic but had everything we needed. Check-in/out was smooth and friendly. Great location close to everything downtown, plus water taxis to Granville Market nearby. Pool was closed due to the chilly weather. Not fancy but decent accomodation.", "Date": "November 2, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "london", "Title": "“Nice staff but needs a bit of updating”", "Author": "praianowedding", "ReviewID": "UR119443148", "Content": "We stayed here for 2 nights, it was in simple terms...OK. Nearly gave it 2 stars compared to some other hotels we have stayed in. Good points - The room was a reasonable size with 2 double beds and the room was clean and tidy. Staff at the desk were friendly and helpful. Not so good points - It is a bit tatty around the edges and could really do with a little updating. Also there is construction taking place both sides of the hotel, so you will be in for a 7.30 wake up call - it is very loud!! It is not in the best location within Vancouver, although Van is very walkable it is away from the main part of the city for eating our and shopping etc.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Great Value & Location”", "Author": "Darl D", "ReviewID": "UR119237584", "Content": "Good clean and well equipped rooms. An excellent location just 1 block off Granville Street at the corner of Drake and Howe. A few blocks from False Creek and water Taxis to Granville Island with its shops, Market and restaurants. An easy walk up Granville to stores, restaurant and Rolston st. (shopping Mecca). Its a stop for the major Hop-on-Hop-off tours. Great Value...Stephen L. at the front desk is a great source of info on Vancouver and goes out of his way to help and make you feel welcome", "Date": "October 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Worcester, Massachusetts", "Title": "“Average hotel - fine to stay at for the price”", "Author": "tripcares", "ReviewID": "UR119149265", "Content": "We stayed here for three nights in a queen suite. Our room had a full kitchen, small eating area, living room (with a sleeper sofa), and separate bedroom with a closed in part that likely used to be a balcony (but that made getting fresh air in and overall temperature control a challenge). Our room was towards the end of a hall and it was very quiet. It was plenty roomy for a family of four that included two small children (ages 2 and 6). Staff was very nice at check in (Jacob at the front desk was fabulous - we thanked him when we saw him again at check out). Even though many were waiting, they found us a room at 10 in the morning as we had a very tired 2 year old. For the rest of our part whose rooms were not ready, they easily stored their luggage. The hotel was fine. It would benefit from an update of the rooms. Our dining table was wobbly and furniture and decor were not terrible, but a bit tired. The elevator was a challenge. The doors would close as soon as everyone unloaded but before anyone else could get on and then would leave - pushing the up button again did not reopen the doors. And there are not enough elevators for the number of guests, so it actually can be a pretty lengthy wait to get up and down if you cannot use stairs. We had a stroller so had to depend on the elevators. The location was a bit removed from most of what you would want to see in Vancouver. We really like to walk and walked to most things, but the only close walk was to the ferries to go to Granville Island. Everything else was a lengthy or very long walk. In other words, you get what you pay for and in Vancouver, much of that is about location.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "NW Ohio", "Title": "“Good value for location”", "Author": "scottr", "ReviewID": "UR118894863", "Content": "We stayed at the Quality Inn for one night precruise. Our room was small but clean,and the beds were very comfortable with nice linens. Ice machines are on alternate floors. I would like to recognize Jacob at the front desk for providing excellent service. He gave us directions to the Aquabus to Granville Island,and also arranged a taxi at a specified time for our group to the cruise port. I see from other reviews that there were complaints about the restaurant in the hotel. We did not avail ourselves of the hotel restaurant. We ate dinner that night and breakfast the next morning at the White Spot restaurant,which is one block east of the Quality Inn(see review).", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Saugus, Massachusetts", "Title": "“Good hotel with pleasant front desk people”", "Author": "dtiger", "ReviewID": "UR118719858", "Content": "The hotel was fine with pleasant people at the front desk. There was a business center on the second floor which worked well. The hotel was nothing fancy. I was dissapointed though that a cup of coffee was $3.60, they exchanged American money at only .90 cents which I didn't encounter elsewhere in Vancouver.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Barkerville, Canada", "Title": "“The Wedding!”", "Author": "Deborah M", "ReviewID": "UR118367048", "Content": "Almost all friends and family from out of town stayed at the Quality Inn at False Creek. It was most enjoyable, from the arrival to departure..great front desk folks (esp. Al, who had a sense of humour to cheer everyone). The rooms were very nice. The price was right. The location so perfectly central in Vancouver. We all had a fantastic wedding holiday and the Quality Inn added to the experience. The only downside was the construction happening on both sides of hotel (I had earplugs, so it was ok). The suites were quiet because of their design.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "San Diego", "Title": "“Great location, but hotel is in need of renovation”", "Author": "wainiha", "ReviewID": "UR118136233", "Content": "Good value for the location; luckily we were upgraded to a suite and found our room to be roomy and convenient for our needs. I used the small pool for a wake-up swim, although major construction on both sides of the hotel was unnerving (no fault of the hotel). The hotel could use a face lift, but the proximity to Granville Market and downtown made this a pleasant stay.", "Date": "September 15, 2011"}, {"Ratings": {"Location": "4", "Overall": "2.0", "Value": "4", "Service": "1", "Rooms": "3"}, "AuthorLocation": "Tofino, Canada", "Title": "“Bad day for front desk?”", "Author": "gmauj", "ReviewID": "UR118021911", "Content": "I haven't explored much of downtown Vancouver and decided to take advantage of a weekend wedding in the area to do so. I had booked the room a few weeks prior to my arrival with some friends. On the day of arrival we did call in advance to check-in earlier. This was told it was not a problem. I found the man on the found to be polite and helpful. Once at the inn, this was a completely different story. The woman at the front desk did not greet us (no smile, no friendly greeting). When we told her we were here to check in, she just sneered and said \"Not possible\". Excuse me? Her co-worker was luckily in the know and informed her that we had called in. She them proceeded to slam our keys and parking permit on the desk. Completely unpleasant. And un-called for as we were all being polite and friendly towards her. I work for this industry and I was completely APPALLED by this behaviour. I make reservations for people visiting from all over the world and if THIS is what I am booking them into, then I must say, I am embarrassed. I have to say, I have had bad days working in tourism. Perhaps this was the situation. Whatever it is, SMILE. Always smile. No matter how crappy your day is. Anyways, I hate writing these and hopefully this was just ONE bad day for her. That little incident didn't make us feel very welcomed. Other then that, the rooms were nice and clean. Location was good.", "Date": "September 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Catering staff trained at Fawltey Towers.”", "Author": "Hugvic", "ReviewID": "UR117923922", "Content": "Although room was comfortable the whole place is rather tired and in need of a refurbishment. The catering is a bit of a joke. From an inedible dinner to a long wait to get a seat for breakfast and an even longer wait to get breakfast, this hotel needs some serious management attention on the catering side.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“Location. People.”", "Author": "vicf00die", "ReviewID": "UR117846485", "Content": "I visit Vancouver quite frequently and it can easily be said this is my favorite Vancouver hotel. It's perfectly located. Only a short walk to major shopping areas like Robson St and Pacific Center Mall yet far enough away from the clubs and bars that it's quiet. I also like to visit Granville Island while in Vancouver and it's a short walk to the Aquabus which is the best way to get to the island. Have you ever tried to find parking there? Impossible! The staff are always friendly. I've never encountered the snobby treatment you get from some of the boutique hotels I've stayed in.Would definitely recommend (and do) to friends and collegues whether travelling for business or pleasure.", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York, NY", "Title": "“Good location, good value”", "Author": "RHefley228", "ReviewID": "UR117757648", "Content": "My wife and I stayed here for five nights August 30-September 4 and found this to be a great place to stay. It's one short block to Granville Street with its bus transportation, restaurants, etc., and a block and a half to Davie Street (even more restaurants). There's a liquor store nearby, as well as a 7-11 where you can buy discounted bus tickets. Although it was a little cool during the day, the heated pool was very comfortable. The front desk was very friendly and quick when we checked in; they offered us a complimentary upgrade to a King suite, which we unfortunately weren't able to accept (snoring and tossing and turning issues). There's free wi-fi, and two computers in the lobby available for very reasonable rates. We ate in the hotel's restaurant twice while we were there, and found the food and service to be excellent (try the Yorkshire Pudding and the halibut). We were on the front and, yes, there is construction noise at times, but it wasn't terrible and we weren't in the room much anyway. Would definitely stay here again.", "Date": "September 6, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good value”", "Author": "CJ1920", "ReviewID": "UR117498104", "Content": "This hotel proved to be excellent value for money with a good sized room and facilities. I was somewhat daunted by the location - opposite motorway bridge out of downtown Vancouver - but as we were at the back of the hotel there was no noise. The bathroom could do with a little work but we could not fault anything else. The location was good for exploring Granville Island and we walked to most places in the city. Stanley Park is well worth a visit and we enjoyed the bus tour. The White Spot restaurant one block down from the hotel was good for breakfasts - and cheaper than the hotel option.", "Date": "August 31, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“big noise problem august onward”", "Author": "jolery", "ReviewID": "UR117327582", "Content": "Just back from Vancouver having stayed at this hotel. There are major buildings works going on in neighbouring plots at both the front of the hotel and at the back!. If you dont want to be out of the hotel before 8am and may want to be back before 5 then give this a miss for a while. The hotel staff were fine, as was the room- but the noise was very very loud.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "London", "Title": "“It was alright, not worth coming back to”", "Author": "LovelyLivix", "ReviewID": "UR117315127", "Content": "I went with my family and we were not expecting anything to amazing, and it was not very nice. The interior was very dated.We asked for three beds and were given a very rusty old sofa bed. For a family it was very crampt, however if a couple went then it would be just fine. Otherwise we had a very pleasent stay.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Seattle, Washington", "Title": "“Not what I expected...”", "Author": "coffeelver", "ReviewID": "UR117292014", "Content": "I was disappointed at this hotel...First off, the front desk was not approachable or helpful upon check-in. There were two guys behind the front desk when I got there and no one was in front of me. One guy was on the phone (it did not appear to be a work-related call based on his body language) and the other was on the computer. Neither of them bothered to look up to acknowledge me while I stood there waiting to be assisted. Not a great first impression from the front desk clerks. Once I got help, the check-in process was fine. We got a room on the 4th floor behind the Quality Inn sign. The view was great from that side of the building, but as another reviewer mentioned the lights from the sign were very bright from inside the room at night. It was distracting but not a big deal since there were blackout shades available. Sadly, I found a tiny bug in my bed on the first night and the air conditioning didn't work. We dealt with it because it was not worth our effort to switch rooms at that point. The next morning we told the front desk (different clerk this time) and she gave us a new room on the 5th floor right next to the ice machine which was MUCH better as it seemed to be newer & nicer than the first room. I actually enjoyed having the ice machine directly outside of our room. It was convenient and any noise from the ice machine was not noticable. Switching rooms, however, was a bit of a pain point because only one elevator was working and it was jam packed. People were trying to start their day so we had to wait for several trips just to go up one level. Folks who were trying to go down to the lobby actually rode UP the elevator with us just so they could make it down. Housekeeping was also sharing this one small elevator with the rest of us, linen bin and all. It was a bit of a cluster. Lastly, the underground, secured parking was very limited. Both nights we parked there it was completely full. I got the last parking space the first night because I have a small car and could fit in the spot. Two other cars were out of luck and had to ask the front desk where else they could park. There were no spots open downstairs on the second night. The front desk advised us to park in their open lot right outside which was convenient. I got the LAST space in that lot.... As another reviewer mentioned, they gave us a sign to put on our dashboard indicating we removed all valuables so that thieves would be deterred from breaking in. That was a little unsettling, but I was glad/thankful the hotel made us aware that we needed to take extra precaution when leaving our cars parked overnight in the open lot. Here are the things I was happy about: Great proximity to Granville Island Public Market (just walk a few blocks and take the ferry for a small fee to get to/from the Public Market) and Granville Entertainment District Beautiful, welcoming lobby area Nice water-pressure and temperature in the shower Free wi-fi", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Seattle, WA", "Title": "“Would definitely stay here again!”", "Author": "Travelinggirl1968", "ReviewID": "UR117243383", "Content": "My 11 year old daughter and I stayed here for two nights. Upon check-in, we were surprised to be upgraded to a king suite! Wow! We loved every minute...the hotel is nicely located a few blocks away from Granville Island (and a water taxi) and Granville Bridge...what a view! The pool was nice and refreshing after a long hot day, and the apple pie ala mode room service was sooo yummy! I also was thankful for the secure underground parking!", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "2.0", "Value": "1", "Service": "4"}, "AuthorLocation": "California", "Title": "“Never again”", "Author": "ParisLondonTraveler", "ReviewID": "UR117101749", "Content": "When you arrive the parking is confusing to find. Entrance through an alley in the back. Parking area very tight and short-yes short for an SUV. The lobby is very nice. The hallway very dark and the room not so inviting. Upon entering the room we smelled an odd odor. The window was open -facing the alley way-so we closed it put on air conditioning hoping it would remove the smell. The decor was allright. But everything in the room, t.v, dresser, carpet-appeared to be worn. The bathroom is in need of a huge makeover, rust and grime everywhere. My 16yr old son would not take a shower. One of the most important places in a hotel room is that the bathroom feels, and looks clean and is taken care of . Who wants to clean themselves in a room that makes you want to run out of. Please train your housekeepers how to clean a bathroom once you remodel them and maybe it will stay looking new. The location of the hotel is great if you are looking to spend a lot of time on Granville Island or Robson Street and even Granville street. But I didn't feel particularly safe walking late evening.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Oxford", "Title": "“A bit depressing”", "Author": "originsteve", "ReviewID": "UR116972050", "Content": "The hotel was not in a bad location but the surrounding area was run down. The rooms were dark and depressing and a bit shabby. However, the staff were pleasant enough and the rooms were clean and so for a value stay in Vancouver it is not a bad bet.", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Moscow, Idaho", "Title": "“Terrible Experience”", "Author": "jo-ke-812", "ReviewID": "UR116948434", "Content": "This place is a joke. The front desk staff is distant, incompetent, and uncaring. They put me on hold and forget about me. They could not figure out our reservation; they tried to put us in rooms other than those that we booked; they overcharged-- charging us for parking for two cars when we only had one; they locked us out of the garage prematurely so we could not get our car; the food is WAY overpriced; and the list goes on. PLUS, there was construction right outside our window the whole time, tarting at 7:00 in the morning, and they offered no compensation for this huge inconvenience.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Portland, Oregon", "Title": "“Disappointed”", "Author": "NinaOMailia", "ReviewID": "UR116912680", "Content": "When I first checked in I was greeted by Al-Noor who was not pleasant nor helpful. He charged almost $600 on my credit card without explaining what the charges were for. When I disputed the charges he was condescending and rude. I was part of a wedding party and we were suppose to get a \"deal\". My reservation was for 3 nights. The room had 2 double beds. Old air conditioner that was very loud. Old, large TV (no HD or flat screen) and no refrigerator. Bathroom was very small. There is only one ice machine with water and it is on the 5th floor. The hotel has 7 floors. Construction was going on all around the hotel so by 7am I was awoken. No free breakfast like most \"Quality Inn's\" in the US. This place is called Quality HOTEL, but has the same type logo as Quality Inn so it makes you think your getting the same type of services. You will not get the same services as the US. If fact you will get less services for more money. BC was VERY expensive to eat/drink out, therefore a small fridge would have been great. My sister asked me to purchase a bottle of Grey Goose before coming to Canada because it was $70 instead of $35. Parking cost $15/day. Al-Noor made me park outside and place a sign in my window stating that all valuables ahd been taking from the vehicle (high vadalism area). My family members got to park in the secure garage. A friend of the wedding party had his truck window broken out and his $2000 GPS stolen while parked at the hotel. Pool. Everyhting about the pool was great. It's outside, so not sure how guests would use it in the Winter other than it's heated. Front desk provided towels. No hot tub. Overall, not happy with Hotel. Not a fan of how expensive things are in Canada. Not a fan of Vancouver, BC.", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“What a deal!”", "Author": "Jennapar", "ReviewID": "UR116559872", "Content": "I've stayed in several hotels in Vancouver and surrounding area and have always felt they were overpriced for what they offered. This time on my travels I thought I'd try Quality Hotel - Inn at False Creek. From the outside it does not look too impressive, but upon entering you are greeted by very friendly front desk staff and a very cozy, comfortable lobby area. Once in my room after a very easy check-in, I was completely impressed with the decor (great bedding - no itchy gross comforters) and cleanliness of the place. The location is great because it is so close to everything on Davie Street, just across the bridge from Granville Island and down the road from the new Canada Line Skytrain. The only issue I had was that my room was at the front of the hotel and the outside lights were quite bright. Just had to make sure the triple layer curtains were completely closed. This is the perfect place to stay if you are on somewhat of a budget... or even if you aren't!", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "carteret,nj", "Title": "“hanging out before disney alaskan cruise”", "Author": "benko", "ReviewID": "UR116018397", "Content": "very nice place, had a suite,7th floor, only views were of buildings, but still nice. The staff were marvelous and funny. Thank you. always there to help. Everything in walking distance, and shuttle bus right at front door, if you wanted to explore farther places, (stanley park,chinatown, etc.,etc.) I had a very nice stay here before my cruise. also restaurant right in hotel, very convienient. out door pool also, but did not use.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Slightly dated but clean and friendly”", "Author": "ramsay_street93", "ReviewID": "UR115756268", "Content": "Staff were friendly on arrival and the reception and lounge were small, but clean and friendly. Similarly the restaurant and bar were quite snug, but the food was very good and came quickly despite being told there would be a delay due to a big party reservation.   The rooms were slightly dated and looking a little worn, but on the whole perfectly comfy and clean. The corridors however were very dark and were desperatly in need of a hoover!    Even with the windows closed, the sound of traffic and the city outside was noticably loud but didn't hugely affect getting to sleep.   The hotel is within walking distance of the centre of downtown and only 5-10 minutes to Granville Island and English Bay on foot. We didn't get a chance to try the pool, but this is certainly a great hotel for families on a short stay of Vancouver.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Reasonable for downtown Vancouver”", "Author": "FromTOR", "ReviewID": "UR115541002", "Content": "If you're on a budget and want a clean, friendly place to stay in an otherwise very expensive city, this is for you. You're only 20 minutes' walk at most from most of downtown or the West End, or you can catch one of the very frequent buses on nearby Granville or Davie. It's also only a couple of blocks from the Aquabus to Granville Island and other points on False Creek, one of the most fun forms of urban transportation anywhere! Other likes - mini-suite with good kitchen; short walk to food shops and restaurants; good internal soundproofing Dislikes - choice of road noise or loud AC/fan didn't make for great sleep; pool was cold (but I swam anyway)", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "sydney", "Title": "“Exactly what I was expecting”", "Author": "kritch", "ReviewID": "UR115232036", "Content": "We booked this as we were going to a wedding in Vancouver and didn't want to spend $$$ on a hotel that we weren't going to be in much. This was fine, clean, the staff were very pleasant and helpful and it was close to everything. If you in Vancouver to sightsee this is exactly what you need. P.S for dinner one night we went to a Mexican joint on davie St, El Taco. Hands down best Mexican, reasonably priced and tasty. It may look a bit sketchy but the people in there are awesome and the food is great!!!!", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Overcharged me and still waiting for a refund”", "Author": "dragons62", "ReviewID": "UR115230456", "Content": "Room did not have a fridge or a safe , charged for carparking , and at that cost poor value. They made a mistake of the account, cancelled the first charge and credited that amount and charged the correct amount. Only trouble is\" I got hit' with the foreign currency charge which they didn't refund.", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Silver Spring, MD", "Title": "“Quite dated, but clean”", "Author": "2PickyTravelers8", "ReviewID": "UR115156649", "Content": "Somewhere I'd read the hotel had been renovated; our 1 bedroom suite was worn out and when I asked about an updated room, I was told only 'regular' rooms were updated. We examined it carefully; everything worked and we felt it was clean, so with 2 adults and 2 teens, we kept the suite for our 3 night stay. Reasonable location on the fringe of downtown; we were there for the 7th Stanley Cup playoff game - close enough to smell the tear gas, but far enough to feel safe. Walk to ferry to Granville Island. Drive and park at Canada Place to use complimentary bikes to tour Stanley Park; stop for wonderful lunch at the Teahouse in the park. Internet worked fine and quiet enough, even with a front room facing the street/highway entrance. Balcony was a plus.", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Yellowknife", "Title": "“It was \"fine\"”", "Author": "tdugg", "ReviewID": "UR115126158", "Content": "Our stay was nothing spectacular, but at the same time I don't have anything really bad to say. The beds were comfortable, there is a small pool, the front desk staff were nice, I found the area convenient...close to shopping, transit etc. The only bad experience was with the Restaurant server who i also believe was the manager. We had a visa/debit card and for those who have one would realize that if the company is not set up for visa debit- which they were not, it needs to be processed as a regular debit. Well no matter how hard we tried she insisted she needed to process it as a Visa. She would not listen. She insisted we were wrong, and she was right. This is our bank account, this is what we use day in and day out. She annoyed me beyond belief. Other then this situation we had a good stay.", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fabulous and walkable distance to all of downtown/Stanley Park”", "Author": "hellobayo", "ReviewID": "UR114804851", "Content": "Just returned from the last leg of our Canadian road trip. The Quality Inn at False Creek certainly rounded off our holiday nicely. After checking in and dropping off our hire car near Canada Place (20-25mins walk), we settled in to our rooms. The rooms are a decent size and had a king size bed in the middle which provided me with the most comfortable sleep from our entire trip. The bathroom was slightly claustrophobic and the small hallway from front door to the main living around was tight to manoeuvre our large suitcases. Apart from that our room and the rest of the hotel was very clean. I liked the exposed brickwork and our maid did a great job at keeping everything clean and tidy during our stay. The ice machines are in the middle of the hallway on floors 3 & 5. The machines are very loud and the rooms aren't well sound proofed. We had room 601 which was next to a fire exit facing the back of the hotel (views of hotel car park and what looked like a collection of council flats) but it was quiet, apart from other people slamming their doors in the morning. Our parents had room 619 which was bigger than our room and faced the front of the hotel & the motorway. Unfortunately they were kept awake by a barking dog on one night as the dog owners did not return until late. They were then woken up very early one morning by a neighbouring room's husband banging on the bathroom door trying to hurry his wife out for half an hour. Our experience with WiFi was good. Signal was strong and we had no problems in checking emails and going online to check out tourist attractions & restaurants nearby. I used the swimming pool which I found to be adequate. Request pool towels from front desk. The pool is slightly heated, clean and is fairly small, just long enough for short laps. I didn't have a chance to use the complimentary Steve Nash Fitness Centre about 2mins walk from the hotel though, but it looked good with fitness classes and ladies only area. There are a huge number of restaurants, bars and cafes nearby. Tim Hortons coffee shop is right next to the Steve Nash Fitness Centre, Nando's & Subway are also 2/3mins walk away. However Davie Street is where the action is, it starts from Burrard Street junction about 5 mins walk from the hotel! It's supposedly the gay street with rainbow flags on the lampposts, but we found it swamped by families at dinner time. The Quality Inn has a 25% discount at a Greek Tavern called Characters on Davie Street, so we gave that a try one day. Glad we went, the delicious portions were generous and the owners friendly & informative. We shopped till we nearly dropped on our last day (Robson Str & Pacific Mall) and I dropped into a massage place on the way back, on Burrard & Davie 2mins walk from hotel. Best $42 I spent in Vancouver! It was relaxing and set me up for our flights home. There is also another massage place which I didn't try called Mango Bay Spa on Howe Str 1 min from hotel. These aren't high end Aveda type spas, so don't expect 5*. We were able to walk to all of downtown (Yaletown, West End, Coal Harbour, Gas Town, Chinatown & Granville Island) within 30mins stroll from the hotel. We walked over the bridge to Granville Island and returned via the Aquabus ($3.25 one way, $5.50 return) which stopped 2 blocks from the hotel. We used the dedicated phone line to book our airport transfer using Black Top Cabs. Our driver turned out to be a reckless driver (near collision with city bus as he was punching in number into his cell phone) and demanded over $12 more than meter price at airport. So use MacLure's or other cab companies instead! To sum up, the hotel is solid Quality Inn standard with genuinely helpful staff. Any questions or issues were dealt with immediately. Will definitely return if coming to Vancouver again.", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "london", "Title": "“Overall this is a good hotel”", "Author": "docklie", "ReviewID": "UR114624663", "Content": "I recently stayed there for 4 nights and although at first it felt quite out of the way it is in fact not that far from the city centre. I walked from the hotel to Canada Place in half an hour and to the Hudson Bay building in 15 minutes. Both city tour buses stop right outside and it is conveniently located for Granville Island. The room was comfortable, the bathroom although small was good. Wi-fi though was very slow. I gave up trying to access my emails after about 2 days. It is free though. There is a pool at the back which I did not use but looked fine. There is an art house cinema 5 minutes walk away which had a decent selection of films on. In my book this is a middle of the road hotel made that much more pleasant by the people who work there. Nothing is too much trouble. I would recommend this hotel to anyone.", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“OK for business trips maybe…”", "Author": "oribie", "ReviewID": "UR114579560", "Content": "The hotel is situated at the entrance of downtown Vancouver, right in from of the Granville Bridge. Not the most romantic place. The look of the outside building is rather uninspiring. Our room was just above the main entrance and it was quite noisy with traffic and people going in and out of the building. The AC was incredibly noisy too so I didn’t sleep properly for the 5 nights I stayed there. Due to its location you need to walk at least 15 to 20 minutes to get to the nearest restaurants. The hotel has a bar and a restaurant serving from 5pm to 8pm so you have to be an early bird to eat on site or walk. The room itself was a good size and very nicely decorated in a stylish rustic look. The bathroom, however, was very small. Overall, the hotel felt more like a place for business men to spend the week. Though the hotel offers free wireless the signal is almost inexistent and makes web browsing almost impossible. I absolutely adore Vancouver and would definitely come back, but not in the Quality Inn…", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Vancouver", "Title": "“Smaller than expected”", "Author": "flipflop22Vancouver", "ReviewID": "UR114377028", "Content": "Have stayed before but surprised our room was not as quoted in the confirmation. Didn't complain as it was comfortable enough & clean, WIFI worked fine. Will definitely stay again. Just be prepared for a bit of a walk from downtown.", "Date": "June 19, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Tokyo, Japan", "Title": "“Noisiest room ever”", "Author": "spriggan", "ReviewID": "UR112334152", "Content": "Originally I didn't intend to stay at a budget class hotel like this one. But when I planned the trip, all upper-class hotels were completely booked somehow, so I decided to look for a budget hotel room. I thought I did my homework properly by researching various hotels on this web site. The rating of this hotel was quite high and feedback was generally favorable, so I decided to reserve this hotel. However, I found it one of the worst hotels I've ever stayed. I know I'm a bit spoiled by number of luxurious hotels I stayed in the past, but this is my honest feedback. <Pros> - The room was relatively clean. - The bed was comfortable. - The shower poured out plenty of hot water, which was relieving after a long day. <Cons> - Extremely noisy. - Email correspondence was awfully sloppy. - No welcome atmosphere or smiling on the face of front desk clerks. - Low security. - No in-room fridge. - No in-room safe. <<Sloppy Email Correspondences>> After making a reservation via local travel agency, I inquired the hotel if they can provide me with a room with an in-room fridge. I didn't get a reply for a week. So I sent another inquiry via their online contact form. This time I got a short reply, saying \"the rooms with fridge are scarce so you need to book it asap\". So I sent a reply right away to request the room. But I didn't receive a confirmation or whatsoever. At this point, I gave up communicating with the hotel online. <<No Smile>> When I arrived Vancouver and checked in to the hotel, I felt no sense of welcome atmosphere from the front desk clerk. No smiling, bar none. But I didn't care as long as he did his job of checking me in. One glitch was that the room booked for me was the one without a fridge, as suspected. I asked the clerk for changing the room to the one with a fridge, but he said that only suite rooms have fridges. So, the clerk and the reservation staff told me different stories, but I didn't argue anymore because I was exhausted after a long flight. <<Dated Facility>> The facility was generally quite dated. If you've ever stayed at one of dated Aston condos in Waikiki, this hotel is dated just like them. This won't be a big deal considering the price range of this hotel. And the room I stayed was relatively clean and the bed was comfortable. <<Extreme Noise>> The room I stayed was on the second floor, right in front of the staircase with heavy firedoor, and storeroom for cleaning staff. Because it was second floor, most guests were going in and out through the staircase. Each time they opened the firedoor, the door automatically closed with explosive noise \"BANG!\". While staying in the room, I was harassed by that loud noise every so often, making it impossible to relax. In addition, during daytime the cleaning staff was opening and closing the storeroom's door all the time, making the noise even worse. Meanwhile, because the room was facing to one of arterial streets in downtown Vancouver, there was considerable traffic noise for 24 hours. I was lucky enough to bring a pair of ear plugs. Otherwise I could never sleep well. Because of this noisiness, I became hesitant about staying in the room. So I tried to cruise around the town as long as possible even after finishing my business appointments. <<Security>> There's no in-room safe. And anyone can enter into the guest room floors bypassing the front desk, by going through the parking lot door and the staircase (all unlocked). So your room door is the only security between your valuables and people on the street. <<Wireless Internet>> Regarding the complimentary services, the hotel provides free wireless internet access. However, the connection speed is very slow, so I recommend you to prepare an alternative method of internet connection, if it's vital for your trip. I measured the connection speed via several web sites and the average was around 370kbps. Meanwhile, my Novatel MiFi 3352 scored around 3,700kbps in the same room. <<Bottomline>> All in all I had poor experience staying at this hotel. I will not stay here again. I will not recommend this hotel to anyone I know.", "Date": "June 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brooklyn, NY", "Title": "“I wouldn't recommend it for a business trip. But for a casual stay, it would be fine.”", "Author": "Chrisk609", "ReviewID": "UR111497375", "Content": "PROS: The staff is wonderful. They are all friendly and helpful: from the front desk, restaurant staff, housekeeping, IT to management they could not have been more wonderful. They have free wi-fi (but see my comments below) They are more reasonable than most of the decent/name hotels in this city. They have a complementary breakfast, not just continental but a full meal, at a table, with a wonderful wait staff. Eggs, choice of meats, potatoes, fruit, toast, juice.. and a full carafe of coffee on each table! There are stores, restaurants, buses and Davie St/West End (with many eclectic shops and restaurants) about 2-4 blocks away. And the (on - off) tour buses stop right in front of the hotel. CONS: The wi-fi is free, but it is frustratingly slow. I wasted many hours trying to access websites and emails. Eventually, their IT people (yes, also part of great customer service) gave me a Ethernet bridge and it was manageable, but still slow. The room itself was acceptable. I was supposed to get a king suite with a kitchenette, but when I got there they only had one with just a micro/fridge available. They did, however, take some money off my nightly fee (again, good customer service). The suite was a good size, with a bedroom and sitting room, both with TVs. They were clean and very comfortable. The king bed was too firm for me, but that's a personal preference. The bathroom was very disappointing. It was tiny, cramped and looked like it was added on as an after thought... the door from the bedroom into the bathroom couldn't even open all the way. So, if you're going to be out of the room more than in and don't need to be 'connected' for 2+hrs a day.. it will be perfect.", "Date": "June 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Co Antrim Northern Ireland", "Title": "“Great Staff.”", "Author": "sentosa54", "ReviewID": "UR111434808", "Content": "A little tricky to find, but we got there!! Room was quite large with two beds and all usual amenities. Bathroom was a little dated although clean as was the room,but the decor was not to my taste, didn't like the brick wall, but we were not there to sit in the room!!! Reception staff were very friendly and helpful and had lots of good advice for tourists. Hop on Hop off bus stops just outside the hotel, reception will book tickets for you and you get a free ice cream! Restaurant was busy and a little slow, seemed to just have two staff serving and looking after the bar. Free Internet was much appreciated Once you get your bearings, the hotel is quite central and it is easy to get around. Check out was easy and staff had no problems getting a large taxi for us and all our luggage. A good value hotel, would stay again.", "Date": "June 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Florida", "Title": "“Great Hotel”", "Author": "Mmmgr2", "ReviewID": "UR108719951", "Content": "We stayed at the Inn at False Creek for two nights before boarding a cruise ship . It is a great hotel . Room service was delicious and reasonably priced . The rooms are spacious & clean and close to everything .The staff were always ready to answer our questions with a smile . I will definetely recommend this hotel to others.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Whistler, Canada", "Title": "“Very clean, super friendly staff”", "Author": "Scott9911", "ReviewID": "UR107165477", "Content": "I visit Vancouver on a regular basis and my hotel of Choice is \"The Inn at False creek\" It is very clean, the staff are friendly and you can not beat the location.", "Date": "May 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "calgary", "Title": "“Great dog-friendly hotel with friendly staff and nicely decorated rooms. Excellent value.”", "Author": "NomadicCalgary", "ReviewID": "UR107003836", "Content": "My husband and our 20 -something daughters stayed one Sat night when we were attending the Cavalia (also great) performance in Vancouver. Our choice of hotel was driven by location near the event, but also the ability to bring our Havanese Chico as he he had recently had surgery and a kennel was not an option. Our daughter has stayed there several times with her pet and recommended the Inn at False Creek. We were so happy she did. We were so happy she did! The rooms are nicely furnished with a brick accent wall and actually look just like the picture on their website. As you may know, this can often not be the case when you rely on internet pictures to choose a hotel. While not flashy, the hotel was clean and convenient to downtown. A bonus was the very friendly and funny man at the desk when we checked in. Free WI-FI and a very nice lounge restaurant downstairs made it a wonderfully convenient place to stay. You can pay a lot more in Vancouver for a lot less! There is underground parking and a reasonable fee of $15 for our pet stay. I would highly recommend this as a family or pet-friendly alternative in Vancouver. Hint: The location is a bit tricky to find without a GPS or Google Map - but worth it!", "Date": "May 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Berkhamsted, United Kingdom", "Title": "“You get what you pay for”", "Author": "PatFromPottenEnd", "ReviewID": "UR106809405", "Content": "Comfortable hotel with bored staff. Location is great for getting out of Vancouver and also for Granville Island. Easy access walking to Vancouver sights and shops. Don't expect to be wowed by this hotel - it is acceptable, but no more than this.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Olympia, WA", "Title": "“Worst hotel experience EVER!”", "Author": "Marrissa99", "ReviewID": "UR105111831", "Content": "I've stayed at this hotel in the past and it was one of my favorite hotels until this last trip. At check-in the desk clerk, Chris, was rude and embarrassed me in front of a group of people (there was a long line and check in was slow.) After he handed me the key to my room, I asked about breakfast and he informed me my room did not include breakfast. I explained that I had booked the \"Stay and Eat\" package and he informed me I did not. Then he said my room was only $89 a night and that if I wanted breakfast I could pay an additional $20 for it. I told him that I wasn't paying extra for something that was included in my package. Suffice to say, it was not the best start to my vacation. Chris told me if I could show him my reservation confirmation and PROVE TO HIM that I actually did book the package he'd give it to me...he even offered to allow me to use the business center FREE so I could get this information to him. After dropping off our bags I returned to get the key to the business center, but Chris was still busy checking in people (who looked at me like I was some sort of moron trying to get free stuff.) I asked a young woman behind the front desk if she could provide me with the key to the business center and explained that I needed to prove that I had booked the \"Eat & Sleep\" package. The young woman told me that they've had quite a few issues with the new reservation system and said that she didn't think it would be necessary for me to look up the reservation. She went to Chris and told him that she was just going to give me the breakfast coupons. He seemed quite annoyed with her, but didn't argue - which was good because at this point I was ready to check out and find a hotel where they wanted my business. The hotel accommodations are decent. The value fair. However, next time I go to Vancouver, this hotel will be off the list of options. It's kind of sad for me as I've stayed at this hotel probably more than ten times in the past and it had always been great. Must be new management or something. Chris was well dressed, but I sure hope he's not a manager - his people skills are horrific. I wonder if he's the person the other reviewers commented on. On the bright side, the hotel restaurant is great. The service for the morning breakfast was wonderful and the food yummy. Too bad the rude hotel clerk ruined the rest of the experience for me.", "Date": "April 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Victoria, Canada", "Title": "“Poor service and Rude Manager”", "Author": "PrinceAli08", "ReviewID": "UR99730947", "Content": "Right as we entered, they were rude and condescending towards me and my friends. The managers were very rude on the phone and charged us additionally for not \"Cleaning' the room after we left. They kept their condescending tone every time we spoke to them. Decent location but if you want a hotel get book any other. Also the hotel manager did not return my call till a week later and after me calling the 3rd time and hung up on me rudely.", "Date": "March 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "N. Atlanta", "Title": "“Just fine for a quick trip to Vancouver”", "Author": "eng311", "ReviewID": "UR95130286", "Content": "I had never been to Vancouver, so I was looking for economical place for 1 night trip up from Seattle where I was on business. This was the lowest price 4/5 rated motel. Looking at \"solo traveler\" it had no \"terrible\" rating, so I booked it. Staff was friendly and helpful. Only one elevator was working. I parked my rental in the secured parking and went out to see the sites. Very close to Granville Island, would like to have seen more of it. A bike or knowledge of public transportation and good walking shoes would be helpful to see all of Stanley Park. Great People watching along the seawall trails. The room was quite and comfortable, as much as I could expect for the price. Breakfast at the hotel was good and nice portion. Met others staying there and no one mentioned a complaint or problem. Overall good for a night, maybe 2.", "Date": "January 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great location, great staff, great value”", "Author": "Trishian", "ReviewID": "UR95012917", "Content": "We stayed at the Quality Hotel - Inn at False Creek during January 2011. We found the facilities very good, the Riverside Lounge very comfortable for a drink before dinner, the staff were excellent extremely helpful for bookings, taxis, etc.. The breakfasts were yum. We would recommend this Hotel to others - but we would ask next time for a room with a fridge!", "Date": "January 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Australia", "Title": "“Good place to stay in the centre but not in the centre”", "Author": "AusiDoyle", "ReviewID": "UR94806851", "Content": "Good option for us as it was the cheapest in the city without being dodgy. Standard room and hotel recepetion. Good location one street up from the main drag that all the trams use. One bus from the West Georgia sky train stop. Free wifi was a huge bonus. Ate breakfast on the last morning before catching the tram then train to airport. Was good but the prices on the drinks are very steap. We walked everywhere to explore and found it quite relaxing to come back to a celan queen bed. No fridge/mini bar meaning we could not keep milk for tea and hot chocolates.", "Date": "January 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great Stay, Would Recommend”", "Author": "leungk115", "ReviewID": "UR88699804", "Content": "Great stay at this great value hotel. Room was clean. Location was great. Walking distance to Yale Town where there are a lot of good restaurants. Also 1 block from Granville Street, where you can take a cross-town bus to: Chinatown, Gas town, Robson Street, sea bus terminal where you can go to North Vancouver, connection bus to Stanley Park etc. There are many buses that go across the city, so you don’t have to wait long. In addition, 1 block to Tim Horton’s where you can pick up breakfast and 1 block from 7-eleven to pick up an unlimited transit pass ($9) or snacks/water. Staff was very friendly and helpful. I booked online through the Quality Hotel website, where you can prepay to get a discount. One minor negative was the hot water in the bathroom sink takes a while to get warm. Overall, would recommend.", "Date": "November 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Vancouver", "Title": "“Great stay !”", "Author": "flipflop22Vancouver", "ReviewID": "UR86898543", "Content": "Our king room was great ! The most comfortable bed - WOW !!! Nice having a fridge in the room as well. A bit of a walk from downtown but we're walkers so not a problem. A bit \"petty\" charging AHRT, HST on AHRT & DMF on the room which I wasn't told about beforehand. Definitely will stay here again", "Date": "November 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Good value, friendly staff, great breakfast”", "Author": "LJV1515", "ReviewID": "UR86096483", "Content": "I stayed with friends recently at this hotel. Very good value for the location. Staff was pleasant and helpful. The room decor was a little strange but that certainly did not affect anything. Bed and pillows were comfortable. Slept well, no noise problems. Breakfast was not included but we did have breakfast in the restaurant - the best eggs benedict I have had in a long time. Service was excellent.", "Date": "November 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Abbotsford, Canada", "Title": "“Comfortable, great location but somewhat noisy”", "Author": "getaway031", "ReviewID": "UR85778680", "Content": "I enjoyed our stay, service was great, the room was great, we were upgraded to another room as it was our anniversary. The location was excellent for what we wanted to do, we were able to walk where we needed to go. The only downside was that we found it noisy however, I used ear plugs and that solved it! It was good value for money!", "Date": "November 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“quality experience”", "Author": "travelculture123", "ReviewID": "UR84553579", "Content": "This mid-priced hotel has a good downtown location. Staff helpful. Room spacious, well appointed, and well insulated sound-wise. I stayed on a top floor on the street-facing side and had no noise issues. Windows are \"open-able\". WiFi is included and worked well.", "Date": "October 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Arbroath, United Kingdom", "Title": "“Well positioned for Granville Island but Average everything”", "Author": "Vinegarhill", "ReviewID": "UR83828102", "Content": "I think average is the best way to describe this hotel, theres nothing to dislike or highlight for the better. Its an average hotel, with average staff, average location and average price so all in all no complaints.", "Date": "October 17, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Shrewsbury, United Kingdom", "Title": "“Top Location”", "Author": "LynnF1", "ReviewID": "UR83740008", "Content": "My friend & I stayed here for a 2 night weekend break. It wasn't cheap, as the price didn't include breakfast, but it was one of the lower priced options in this area of Vancouver. The location was great for us ... 5 mins walk from lots of bars & restaurants, shopping centre & the beach area! The room was spacious & clean with all the usual amenities, & the staff were very helpful. The food offered in the on-site restaurant was fab & not too expensive. Would definitely stay here again!", "Date": "October 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great moderately priced hotel in vibrant Vancouver”", "Author": "Person25", "ReviewID": "UR83257662", "Content": "We stayed at the Quality Inn at False Creek for a family weekend get-away. The hotel was very nice and was reasonably priced. We had breakfast one day in their restaurant and it was delicious. One of the neatest things about the location is that it is just a 3 minute walk from the Aquatic Center which is this absolutely gorgeous huge pool in this very nice neighborhood. They also had a pool for small children. Walking a few blocks towards the water and then going north takes you on a beautiful walk to Stanley Park, and going south takes you on an equally beautiful walk around False Creek. We took the Water Taxi to Granville Island, and while it's over in a blink of an eye, it's fun for little kids, as is Granville Island. On Davies street very near the hotel there are a lot of eating possibilities--tapas, French Bakery, Tim Horton's, Greek/Italian restaurant, etc.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Yorkshire", "Title": "“Comfortable and good value”", "Author": "CarrigeenYorkshire", "ReviewID": "UR79637156", "Content": "We checked in very late at night, and the staff could not have been more helpful. I asked for a quiet room and we had a very pleasant room at the back with an outlook over the pool. Comfortable beds, fairly basic room, with pretty dull furnishings, but for one night, it was a very a reasonable price. The main lobby and dining area are very well decorated. The location was great for our sightseeing endeavours , and the reception were very helpful in storing our bags for the day, until we were ready to move on to the airport. Lovely breakast room, and good menu. (extra cost)", "Date": "September 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Exceptional detail to service”", "Author": "AngelladyCarol", "ReviewID": "UR78712591", "Content": "Our stay was for a week and we requested an accessible room for a person with disabilities. The room meet all our needs, making our vacation much more enjoyable knowing that small things that made life easier were there for us. The staff went beyond their duties, greeting us each morning, offering help getting taxis, asking about our stay and our days, etc. We had stayed in the same room a year earlier, and I had made a suggestion to make an item easier, and this year when we attended, I noted that the item had been acted upon. We would definitely stay in this hotel again, as we are treated like invited friends more than paying guests.", "Date": "September 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "North Vancouver", "Title": "“Very Comfortable sleep”", "Author": "Jasony58", "ReviewID": "UR78555675", "Content": "I ended up needing a last minute hotel room in downtown Vancouver and happened to come across the Quality Hotel by accident--I'm glad I did. The hotel staff were very friendly and checked me in with no reservation ,and the rate seemed fair. I was given room 208 which, although has no view at all,it was clean and had a very comfortable bed and everything you need for a one night stay such as coffee maker, kettle, etc.. The room was quiet considering it is a downtown hotel and I had a great sleep, which was needed after my stressful day. Thanks.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southsea", "Title": "“Ideal Location”", "Author": "092610i", "ReviewID": "UR78357298", "Content": "This hotel was ideal as just a short walk down to waterside - to get the little aquabus to Granville Island - which is a must. Everything walkable from hotel, but a bit of a trek to downdown. Hotel staff very informative, particularly guys on front desk - who had great sense of humour. Rooms kept very spacious and cleaned every day. Only problem really was early hours when dustbin lorries came to empty bins and also I suppose the general city noise which was a shock to the system again, having travelled through the peaceful Rockies!! Once you get your bearings, everything is walkable, art galleries, Stanley Park, Downtown to gastown etc. Whalewatching trip is a must!!! Thanks again to all staff at Inn at False Creek. S John", "Date": "September 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kenmore, Washington", "Title": "“Stayed Before,Good Place to stay”", "Author": "donall1", "ReviewID": "UR72416471", "Content": "We stayed in rm301 ,It was located on the back side over looking parking lot,room was very clean.Due to the fact the bed bugs are a growing problem everywhere.I Checked in the spots that they hide. I'm happy to report NO BEDBUGS!!.I was able to sleep in peace.The only problem we had was with the sliding window which made squeaking noise when someone else on the floor opened their door.I didn't reported it ; I doubt if they can do anything about it.but what I did was open slightly but still be closed. It didn't make as much noise now.Service was good.", "Date": "July 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Good Value and location”", "Author": "kesamice", "ReviewID": "UR70220429", "Content": "Stayed 2 nights at this hotel on a stopover on my way to Asia. Took the skytrain from the airport and hotel was within walking distance (uphill) from station. Was pleased to be given an early check in around 10;30 am. Room was comfortable nothing more nothing less. Only annoyance was that i was never notified that I had a package delivered to reception.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wales", "Title": "“Very Friendly and Welcoming”", "Author": "tugflorida", "ReviewID": "UR70138899", "Content": "We always stay here, the staff are very friendly, helpful, and go out of their way to make you feel welcome and to assist with any query, the rooms are comfortable and the location is close to everything in Downtown Vancouver. Most places within walking distance ie Yaletown, Granville St., Granville Island, Robson Square, Art Galleries and shopping. We highly recommend this Hotel to anyone whatever age group.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Daytona Beach, Florida", "Title": "“Quality Inn exceeded my expectations”", "Author": "Postcardtraveler", "ReviewID": "UR69960294", "Content": "Through a recommendation, I booked my 3 night hotel stay at the Downtown Quality Inn in Vancouver. I was somewhat hesitant from my conception of this chain and a previous stay many years ago. My biggest concerns were the very late night arrival and the quality of the room. To my surprise, I had encountered no problems at check in. The room was smoke free and had lots of room for the 4 of us and the luggage. The bathroom was exceptionally clean and even had a recycling bin. The front staff was very helpful in planning our couple of days there. They suggested dining options, sites to see, shopping areas and how to get around. You don't need to rent a car to get around in Vancouver. The transportation system in Vancouver was great and inexpensive. The hotel has a dining room, but seemed a bit expensive for breakfast. There is a Tim Horton's down the street which serves doughnuts, English muffins, muffins, bagels and wonderful coffee. The hotel is conveniently located near bus stops and there are just a couple of quick dining places in the area. The room was spacious and we had a great night sleep for the 3 nights we were there. The only thing to watch out for is to be careful and vigilant when it gets dark. I needed milk, so went to the 7 Eleven down the street late at night. A couple of people loitering near the store made me a little uneasy.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent Time staying at this hotel”", "Author": "tariqkhan413", "ReviewID": "UR69198028", "Content": "Clean and modern decor, friendly staff, perfect location as it is right in downtown in the middle of everything, walking distance from restaurants, shopping, sky train and business centres. Full service restaurant and lounge on site.", "Date": "June 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Victoria, Canada", "Title": "“Walking distance to everything”", "Author": "JWBS", "ReviewID": "UR68220149", "Content": "A wonderful stay. Staff were great and the hotel provided us with what we were looking for - a central location. The rooms were comfortable, great breakfast and good value for money spent. Only a 7 minute walk to the Canada Line train that connects downtown with YVR and the ferries. We will be back.", "Date": "June 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Haifa, Israel", "Title": "“Ok hotel, not for light-sleepers”", "Author": "Ns_Zs", "ReviewID": "UR68031857", "Content": "This hotel was fine. Not more then this and not less. The price we got was Ok, but there are all kind of taxes that are not included so it was more expensive then we thought. The hotel itself is in a pretty good location for sight-seeing and in a bit less good location for sleeping. I'm a very light sleeper so when they gave us a room in-front of the high-way i didn't even try it. We got a room on the other side instead, which was a bit more quiet, but you can still here the main road, the garbage trucks and alarm of cars starting to work at 6am. Also, the cleaning ladies are shouting in the hall early morning - not very fun... Parking in the hotel is pretty expensive - 14 dollars a night. There's a bus and a small store near by. Rooms are big and the free internet was nice. It was a good hotel for what you pay for, but as a light sleeper, not sure if i'll come back.", "Date": "June 20, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Nice try.”", "Author": "bigleemo", "ReviewID": "UR67949911", "Content": "While checking in, a friendly staff member suggested a rear suite(for light sleepers) rather than facing the traffic bridge at the front. And while the 1 BR suite was spacious, the trade-off was punctual trash trucks picking up dumpsters at the stroke of 7AM the two days I was there. Their write-up promised both wireless AND wired high-speed Internet(complimentary); NOT having access to the latter, I experienced the utter failure of the former, that of a weak/non-existent wireless signal which is probably poached on their unsecured network making it impossible to work by computer except to write a novel. Their first suggestion?...bring my work down to the lobby where \"the signal is guaranteed to be strong\"; yes, I dragged it down there and indeed, it did find and connect to their network but signal strength was spotty and irregular.so it was frustratingly slow at best. Finally, there was no end solution after a call from the technical department, so I did the next best thing by giving up and going elsewhere.", "Date": "June 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Victoria, Canada", "Title": "“A Home Away From Home”", "Author": "OnTheGo039", "ReviewID": "UR67650078", "Content": "Great Stay and the perfect location for my first Visit to Vancouver. The staff are the best, my room was perfect for what I needed. walking distance to all the downtown fun. I'll be back !! Jodie", "Date": "June 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Thunder Bay, Canada", "Title": "“a great place to stay”", "Author": "njmill", "ReviewID": "UR63341907", "Content": "this is a clean, affordable and comfortable hotel. The staff is friendly and accomodating. It has a restaurant but is within walking distance of a varied choice of restaurants, coffee shops, convienence stores and shops. Would gladly stay here again.", "Date": "May 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Perth, Australia", "Title": "“Good value”", "Author": "GilesnGiles", "ReviewID": "UR62367762", "Content": "We booked this hotel post-Olympics on a stay 4 nights, pay for 3 deal. The hotel itself is close enough to walk to most of the main attractions in Vancouver, if you don't mind walking for 15-20 minutes. Whilst not particularly modern decor-wise, our room was clean and comfortable. There were two double beds in the room, however neither bed seemed to be of normal 'double bed' size- I am 5'4\" and my husband is 6'2\" and both of us had our feet hanging over the edge- the beds definitely were smaller than standard size. However, for the price we paid we were very happy with this hotel. There is an excellent tapas restaurant, La Bodega, less than two minutes' walk from the hotel- definitely give it a try if you stay here!!", "Date": "April 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Bedroom was smelling - go to Cascadia Hotel!”", "Author": "lucianab", "ReviewID": "UR62028445", "Content": "Our bedroom was smelling urine and we had to change to another one. It was very cold at that time and we found it weird when we arrived and the windows were open, but we found out the reason why when we close it and got back a few hours laters. Room is small and dark. Bed is not comfortable. It shouldn't even be a 3 stars. You can pay a little bit more and getting an excellent 3 stars hotels by staying at the Cascadia Hotel. Do not stay here!", "Date": "April 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edmonton", "Title": "“The real meaning of hospitality lies here”", "Author": "Mishmashmeister", "ReviewID": "UR60842935", "Content": "My spouse and I needed a room for a couple of nights on the way back from Mexico. We wanted to hit the Yale to listen to some Blues, and found The Inn at False Creek a stone's throw away. From the time we entered the hotel, to the time we left, we had a great time. Not only were the staff professional and friendly, but knowledgeable and very helpful. While there was a litte unavoidable street noise from the early morning rush hour, the room itself was fantastic. We had breakfast in the morning, and the food and service there were also great. We are already booked for our return trip!", "Date": "April 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Makati, Philippines", "Title": "“It was a good, fair deal. Location was a plus.”", "Author": "stephenco", "ReviewID": "UR59884547", "Content": "We booked a 2 double-bed room for three adults and one child for $100+ (taxes included) through Expedia.com. It was a good value at that price. The lobby was very accommodating and comfortable. The front desk staff were affable and knowledgeable of local information. The restaurant/ bar was decent. I agree with other travellers that the rooms and halls need some renovating. My main complaint is the noise from the streets during the night. I slept beside the window and I could hear every passing car. I don't know if it's the jet lag but I keep waking up in the middle of the night. On the other hand, the location was a big. It is located at the southern portion of downtown Vancouver there is quick access to Granville St, the Aquabus station at Hornby St. and English Bay. We were even able to walk to the Waterfront Station which is on the other side of downtown Vancouver. Taxi to Stanley Park cost $10.50. While I would mention it when asked by friends, I might say that there are better hotels out there if they could afford it.", "Date": "March 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Burlington", "Title": "“Decent value if you can get it cheap”", "Author": "BurlingtonJamie", "ReviewID": "UR59621313", "Content": "This hotel is badly in need of renovation. Looks like they did the lobby and elevators, but rooms and halls are very outdated and worn looking. Room had adjoining doors to other rooms, so noise travelled easily between rooms. Parking (secure underground, $14) was full, so had to park on surface next to dingy alleyway. Smash and grabs are obviously a big problem here, as they warn you to leave nothing in car, and actually give you a full page printout saying vehicle has no valuables in it, so junkies will be less likely to break in. Still, it was a decent place for the price I paid on Priceline (I wouldn't want to pay more than $60-70 a night here). Location is excellent, and it had free (but slow) wifi.", "Date": "March 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Penticton, BC", "Title": "“Please! Do not book if you have small children! Dangerous windows with no screens!!”", "Author": "Scorpion1024", "ReviewID": "UR59101188", "Content": "PROS: - location was close to everything - booked with priceline.com and got a great deal! - beautiful lobby CONS: - moist/damp humid rooms. We all woke up with sore throats which were gone by noon after check out. - no parking available. I got there 1 hour after check in and was told the parking was full. I kind of laughed and said \"umm where am I supposed to park?\" She said \"find a spot in the alley if you can\" WHAT??? - small rooms - tub was stained or dirty - girl at front desk had ZERO personality. Men were awesome to deal with!! *** IF YOU ARE TRAVELLING WITH SMALL CHILDREN BEWARE: The windows do NOT have screen and open very easily!! They could easily fall out of the window! SOOO scary! I could barely sleep and closed the curtains so that nobody got any ideas!!! SO DANGEROUS!!! I got what I paid for when I booked. $50!", "Date": "March 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Stay, but don't eat or drink here”", "Author": "SallyFoodie", "ReviewID": "UR50299758", "Content": "Relatives booked this hotel. We paid a rate of $99 per night, plus, what seem liked, copious amounts of taxes. The hotel is dated and the rooms are small. It was quiet and parking was convenient at $12 per night. The towels were thread bare and the sheets had holes in them from wear. I did not research hotels in Vancouver or the area, so I don't know what this compares to. We were close to most everything, however and the staff was very, very nice. Breakfast was approximately $15 per person and cocktails were about $7...a bit steep for the atmosphere.", "Date": "November 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Victoria, B.C.", "Title": "“Great deal on room with full breakfast!”", "Author": "ColumbiaRM", "ReviewID": "UR49934171", "Content": "We got a room on Howe St. location and a full breakfast for two with each night stay at only $80 (taxes, all in) through Travel Zoo. Everything was within walking distance for shopping and False Creek. This would be an ideal place if you are going to the VANCOUVER INTERNATIONAL BOAT SHOW APRIL 8–11, 2010.", "Date": "November 23, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "BC", "Title": "“Never Again”", "Author": "littlehippo", "ReviewID": "UR48722768", "Content": "This was the worst hotel I've ever stayed in. First of all the staff at night were terrible, second of all one elevator was out of order and the second elevator was super sketchy and it took FOREVER to get anywhere and when you were on the right floor it took 15 sec to open up. The rooms in the picture looked great and when we got there you could tell there has been NO improvments in the last 10years at least, the bathroom was Discusting, looked like it had been tidyed but was discusting! Never again will i stay there it was a rip of at $70/night", "Date": "November 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Calgary, Alberta", "Title": "“Comfortable beds, clean, quiet, and close to all the action”", "Author": "jillallington", "ReviewID": "UR48363259", "Content": "The reception desk staff offered great tips on nearby restaurants and were very courteous. The lobby was clean and comfortable as was our room. The bed was very comfortable and I appreciated the fan and the ability to control the room temperature easily. The breakfast at the restaurant adjacent to the lobby was healthy and delicious.", "Date": "November 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Halifax, UK", "Title": "“Good location”", "Author": "Riflerangeblues", "ReviewID": "UR46469861", "Content": "We stayed for two nights. The accommodation is fine - clean and rooms are large and have good facilities. If I was to be picky, I'd say they are getting a little dated, but it didn't affect our stay at all. Reception was efficient and pleasant, but I wouldn't say it was warm or informative, but we weren't really that bothered. Overall, a good hotel for a city break and only 10 mins walk from the sea wall and ferries to Granville Island.", "Date": "October 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "london", "Title": "“Great hotel”", "Author": "tuck96", "ReviewID": "UR45898360", "Content": "we stayed 4 nights prior to a alaska cruise - the hotel kindly upgraded us free to a suite which was great - very comfortable bed and despite being right next to the lifts no noise at all. Very clean room and good decor. Great location for walking either to Granville Island or Robson st for the shops - great restaurants within walking distance and taxi rank opposite for any other places. Internet access in the foyer was very helpful and the bar was very welcoming. The only problme came when hordes of people came in on a bus and the staff could not cope too well but then did feel bad that some of my fellow brits were quite rude to them. Would definitely stay there again.", "Date": "October 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Cold Lake, Canada", "Title": "“Fine hotel in downtown location”", "Author": "Markus N", "ReviewID": "UR42856901", "Content": "We have chosen this hotel mainly for its price and the central location. It is one of those typical locations where people check-in for the night arriving in Vancouver or before their departure. We noticed a fair number of tourists in the lobby, which, by the way, looks quite nice and is occupied with professional and very friendly staff. It is a bit tricky to get to the hotel. I definitely recommend reading the \"how to get to/ map\" page of the hotel's website. If you like to use the underground parking they charge an additional nightly fee. The room itself has a good size and gives no reason to complain at all. The beds are comfortable and the room cleaners do a fine job. I would certainly go back.", "Date": "September 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Swadlincote, Derbyshire", "Title": "“Great value and location for first night after flight”", "Author": "TheGaskins", "ReviewID": "UR39708207", "Content": "We selected this hotel for value and location as we wanted somewhere not too far from the airport after a 10 hour flight with some where to eat in walking distance. It took 20 minutes to get here from the airport and we payed to park in the underground carpark $12. We walked down the road 5 minutes and caught the aqua bus over to Granville Island where we looked around the market and ate in the food hall. The hotel is not in a great area of the city but was perfect for our needs. At no time did we feel unsafe. Breakfast was very good, buffet or cooked to order. Staff very pleasant and helpful. Good stop over hotel.", "Date": "September 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "British Columbia", "Title": "“Great value and clean”", "Author": "atlasttime2travel", "ReviewID": "UR38448593", "Content": "We just wanted an overnight getaway to Vancouver that didn't cost too much; and we found it because at $129.00 plus 16.5% taxes the Quality Inn was great value. The room was pretty typical for a Quality Inn. It was clean and everything worked. The location was good with Robson Street and Granville Streets an easy walk and the ferry across to Granville Island was a ten minute walk down the hill. Parking was $12 under the hotel. The fare included breakfast which turned out to be in a nice looking restaurant off the lobby. We did not stop to eat but the staff was super about getting us two coffees to go. Next time we will stop for breakfast.", "Date": "August 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Huddersfield, England", "Title": "“Great location, fantastic customer service”", "Author": "AMJ1977", "ReviewID": "UR38155200", "Content": "Had a very pleasant 6 night stay at this hotel in August of this year. It is a 3-star hotel but a very good one at that. Nothing was too much trouble for the staff on reception and they were there to help with any questions or advice needed whilst staying there. Got upgraded to the suites as it was our honeymoon so cannot comment on the standard rooms. The suites are nice and worth the upgrade cost. Very spacious and clean. Had the biggest bed i've ever slept in in my life! A kettle in the room as well as a coffee maker. Very powerful shower and the addition of bath robes being a very nice extra. Location is spot on, short walk to the aquabus where you can get across to Granville Islands which is well worth a trip. There is a Tim Hortons and a 7-11 nearby which proved very useful. Only a short walk to Robson Street for all the shops! The bar in the hotle is nice for a quiet beer after a hectic day. I would definitely recommend a trip to Whistler (on the rocky mountaineer train) and a gentle cyle right around the bay - costs about $20 for 5 hours. This hotel was a great choice and it was a pleasure to stay here.", "Date": "August 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Whistler, Canada", "Title": "“Quiet room, cheerful service, very clean hotel, great location...all round great”", "Author": "quilchena", "ReviewID": "UR37416897", "Content": "The good news: - Rosette efficiently took our reservation, then later gave good restaurant recommendations, even suggesting taking the boat taxi over to Granville Island ($5 return trip per person). - Front desk clerk Frank Grant's great smile was a welcoming bonus upon our arrival, and his friendliness extended when we crossed paths the next day on a nearby busy Vancouver street. - The restaurant staff were most attentive, and genuinely friendly. - We requested a room at the back as we were sleep deprived. Bonus was that the room was beautifully bright during the day and extremely quiet during the night. - Our room was very very clean, and very comfortable. The best news: Price was right. Place was great. Would highly recommend it for service, location and value. I felt very safe walking alone in the neighbourhood while my husband and sons were away doing their thing during the day. It is about 15 minutes to walk to Robson Street for dinner and shopping. Buses are just outside the door, and 7-11 are nearby for buying day passes.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Phoenix, AZ", "Title": "“Great Hotel and Staff”", "Author": "Moncana", "ReviewID": "UR36044476", "Content": "We spent 3 nights at this hotel and had a very pleasant experience. The hotel is centrally located, within walking distance to many restaurants and false creek, where you can catch the 'aquabus' to Granville Island. The rooms were clean and spacious. The hotel staff was very nice and helpful when we asked about directions and places to eat. There is a sushi place right around the corner (on Pacific St.) that is really good and has great prices. There is also a White Spot restaurant, also around the corner (on Drake St.), great place for breakfast and very kid friendly!", "Date": "July 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "alabama", "Title": "“Great staff”", "Author": "bill52647", "ReviewID": "UR33246087", "Content": "We stayed overnight before taking a Northbound Alaska cruise. Although this is an older hotel, it is well kept and in a great location. The staff, especially Stephen, went above board in helping us find things to do, places to eat, etc. The morning of our cruise, we were able to check out and the hotel staff stored our luggage until we returned from some more touring of town. They were then very helpful in getting us a taxi to the ship. Even though we only stayed one night, we felt that we were longtime guests by the way we were treated.", "Date": "June 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Southampton", "Title": "“'Safe Haven'”", "Author": "Raymondclose", "ReviewID": "UR31629152", "Content": "A very comfortable hotel where all the staff were efficient and helpful. The rooms/beds very comfortable. Breakfast was well presented and served. The bar staff very friendly. Ideally situated to get to Granvilles Island and walk to Stanley Park. Will certainly stay again should we be in Vancouver.", "Date": "June 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "sfo", "Title": "“Good Value & Good Time”", "Author": "RedLadySanFrancisco", "ReviewID": "UR30187479", "Content": "We booked this hotel through Expedia and it lived up to our expectations. The friendly front desk, especially Leanne, was extremely helpful in providing information to us. They also assisted in booking our bus trips to Victoria and to Seattle. We had a good visit. Housekeeping was also friendly and accomodating - we needed more coffee and non allergetic pillows. Although we did not eat in the restaurant, we did visit the bar which was clean and service was friendly. Weather did not permit us to take advantage of the pool. This hotel is located in Downtown and close: within walking distance to restaurants which were very inexpensive and good tasting.", "Date": "May 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Toronto", "Title": "“TRULY EXCELLENT SERVICE”", "Author": "3100", "ReviewID": "UR28401858", "Content": "I am in in the \"customer service\" industry, myself and am very respectful of the people who carry out the jobs of delivering EXCELLENT customer service in whatever job it is that they do. When I travel I am very low profile. I make my own bed. I re-use the towels! The FRONT DESK staff were exceptional. They loaned me their stapler without the least hesitation! ( that can be a VERY big deal!) . They came up with a very suitable vase for my parrot tulips I picked up from a street vendor. The ice bucket was not doing them justice. I think \"catering\" was involved too. Thanks. I experienced a taxi driver dropping off a \"found article\" left in his cab the day before by an unknown lady who he had dropped off at the hotel. The front desk knew all about the incident and thanked the driver on the lady's behalf. Very gracious. Concierge Service. The room was large and pleasant. Great bed. Everything was just fine. All the TV channels! VANCOUVER is a great city. No matter which way you walk you'll find water. Turn \"right\" for FALSE CREEK or turn \"left\" and keep walking until you get to Burrard Inslet. Great location. Honest. It's a great little hotel.", "Date": "April 20, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Toronto", "Title": "“Clean room in older building, great location”", "Author": "teedotTraveller", "ReviewID": "UR28117576", "Content": "We stayed here for 3 nights after finding a great rate on Travel Zoo. The hotel is well situated and only a couple of blocks to some great breakfast places, trendy restaurants and bars in Yaletown and the ferry that we took to Granville Island. Though it's on the edge of the island, it is still within walking distance to Robson and the downtown core. The building is a little older and in need of some updating, particularly the hallways. The rooms are of a decent size and our king size bed was comfortable. The bathroom is a bit small, definitely only one person in at a time. The water pressure of the shower was great, but the bathroom fan didn't do anything but make noise and the true age of the hotel showed most in this room. Our room faced Howe St. so it was nice to see the city, but there is a steady stream of traffic going towards the Granville bridge and the windows don't do a whole lot to keep the noise out. I never heard any TVs or anyone talking, but I could hear doors opening and closing in the halls and even heard our neighbor's 6am wake-up call (which they missed multiple times). Good points about the hotel: the rooms are clean, there are ice machines and water dispensers in the hallway, the underground parking is cheap and convenient with in-and-out privileges, the front desk staff is helpful enough, local telephone calls are free, wireless internet was easy to access, good location and great price. Some cons about the hotel: rooms aren't soundproof, bathroom is small, decor is dated, heating/cooling system is quite loud and elevators are super slow (especially when busy). At the same price ($69/night), we'd definitely return to the Quality Hotel if ever in Vancouver again.", "Date": "April 15, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "mission", "Title": "“bad customer service”", "Author": "mom12312", "ReviewID": "UR27265250", "Content": "Went there because I found a deal on Travelzoo and my daughter had a sporting event out there. Regular rates are over 130 per night. Room very small, but fine for a place to sleep when you get the room for alot less than regular rate!! When it got terrible was when I went to go to sleep and realized both beds were broken! My daughter was already asleep so I thought I could get comfy and sleep, but didn't sleep all night. I tried climbing in with her and that is when I realized her bed was broken too! I spoke to the manager about it in the morning, he came up and looked at it and told me there was nothing he was going to do for me because I should have asked to move rooms - even after my daughter was sleeping!!! He saw that they were broken and not good to sleep on. We went out there so she could get a good sleep - you think they would understand why I didn't want to move rooms in the middle of the night. Things happen - I understand that, but you would think they would offer at least to not charge us for parking or something - or a credit for another stay - but nothing was offered. It was too bad so sad. I was very dissapointed.", "Date": "April 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Seattle, Washington", "Title": "“OK, but you can do better”", "Author": "cya", "ReviewID": "UR27207243", "Content": "Stayed here for a get away weekend. After years of always staying on or near Robson we decided to try this area. Thought not far from Yaletown and Robson businesses, it was still far enough away to make it inconvenient. The area wasn't as nice and there was not a whole lot around except the Granville Bridge. The hotel itself was OK not bad but hardly exceptional. Except for the WSU Lacross team passing through, the bar was empty on a Saturday evening. Breakfast was boring but service and staff were good. I guess the major source of our disappointment was the name. The Inn at False Creek was just an average Best Western under a bridge.", "Date": "April 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "New Orleans, LA", "Title": "“Great location, value, staff”", "Author": "JustForFun23", "ReviewID": "UR26681757", "Content": "I was highly, highly impressed by this hotel. Front desk staff was more attentive than at most luxury properties. They eagerly: called a cab for me several times, gave me sightseeing advice, coupon books, granted a last-minute late check-out, stored baggage, and exchanged currency with a smile on their face. Hotel restaurant/bar a decent value for hotel food. False Creek area is absolutely beautiful. The only caveat is to be careful if you're alone at night. You can hear a lot of street noise and you may run into a beggar or two. But I never felt that my safety was at risk. Would definitely stay again!", "Date": "March 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Whistler, Canada", "Title": "“Really Nice Hotel Great Staff”", "Author": "Brats", "ReviewID": "UR23420798", "Content": "Christmas shopping trip we stayed just one night it was really nice much better than expected even though all the reviews were great , So read the reviews and trust them our room was high on the road side ( pretty quiet ) with fantastic night views,walking distance to Robson for great restaurants . We really enjoyed our stay at the Quality Inn Downtown Free Internet parking is $12 a day but this is downtown its to be expected.", "Date": "January 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Summerland", "Title": "“Home away from Home”", "Author": "grayce58", "ReviewID": "UR23327291", "Content": "Great hotel, wonderful staff, make you feel at home when you are on the road as much as I am. Comfortable rooms and a nice friendly and welcoming lounge. Highly recommend if you are in Vancouver working.", "Date": "January 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "England", "Title": "“Excellent service and waterside location”", "Author": "CreepingBeauty", "ReviewID": "UR23324109", "Content": "I would definitely recommend this hotel. The service was excellent, the staff were very helpful and knowledgeable when I asked about local attractions. When I wanted to confirm our onward flights to Toronto, I asked where how to use the pay phone and the gentleman at reception made the call for me from the reception phone, therefore costing me nothing. We had a suite on the top floor with a beautiful view out over False Creek and the city looked amazing at night. It was very well equipped and a good size. with seperate kitchen, bedroom, balcony , bathroom and lounge The closed-in 'balcony' was lovely to sit in on the warm evenings with the windows open. The location was good too, right on the side of False Creek which was nice to walk to in the mornings after breakfast before setting off for the day. There was a little boat port right at the bottom of the road the hotel is on, so we hopped over to Granville Island every day to make the most of the huge market selling all sorts of fresh food, that we took back to our suite and enjoyed for dinner. Getting into the heart of the city is about 5mins walk up the road, where you will meet Robson Street, the main road of shopping and restaurants. Everything was within walking distance, the only time we used any form of transport was for the airport and to go to Grouse Mountain on the North Island which is much to far to walk, you have to go by boat and then a bus the other side. I can not wait to return to Vancouver, it's an amazing city and I would stay at False Creek again.", "Date": "January 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "UK", "Title": "“Hated it”", "Author": "zduk", "ReviewID": "UR22389820", "Content": "really disappointed in this hotel.It was billed as a \"boutique\" hotel, however, on arrival there was no evidence of this. The hallways were dark and dirty, reminiscent of a scene from the Shining with the maroon colour. The rooms were outdated and shabby, with poor quality finishes and very dark. The only redeemable feature were the staff, although the front desk person was also the maintainance man.", "Date": "December 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Auckland-NZ", "Title": "“Cheap & Cheerful”", "Author": "Franklinross", "ReviewID": "UR22110409", "Content": "A good basic 2.5 star hotel in Downtown Vancouver. Easily access buy YVR Airporter bus. www.yvrairporter.com . Rooms a little tired but very adequate and clean and well serviced. We stayed 7nights and got a free upgrade to one of the suites. Perfect for long stays as it has a full kitchen with stove, oven, microwave, fridge/freezer, pots and pans, cutlery and a bit more room. FREE wirless Internet is the big bonus for us as we run a business and worked quite a lot from the laptop in the room. Staff very helpful and pleasent. Eaisly get to main CBD in 10-15mins walking and Canada Place (Harbour) in 20-25mins. Central Vancouver is Flat (no hills).", "Date": "November 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Totally better then I expected!”", "Author": "Prime-image", "ReviewID": "UR21262943", "Content": "I stayed at the quality in as part of a stagette weekend. 4 other girls and I had an awesome stay at this hotel! It had a great location - within walking distance to granville island, and Robson street. As a local to the area I know most of the hotels in Vancouver, and I do have my favorites, so when this hotel was chosen for me, I was not too happy. BUT, it turned out to be awesome!! They have 2 parking garages, which is a major plus for Vancouver. From our room, (#514) we could see false creek and had a great view. The beds were SO comfortable!! I usually hate the rock hard hotel beds that most cheap hotels have, but these beds were heaven! The feather fillows and comforters were awesome too! I also had a chance to have a sleep on a cot for a bit, also VERY comfortable. The room was big (big enough for 6 girls to get ready in) and the hotel itself was very clean. I didnt see a single problem with the hotel. And I loved the shampoo and conditioner provided by the hotel, as well as the lotion- something I usually steer clear of in hotels. The price was AWESOME for a downtown hotel. The area is great, close to GM place, and everything you could want. It was very quiet, I never once heard someone in the hallway or on the street. The staff were friendly and helpful. I definitely will be staying here next time I need a hotel and will totally be recommending this place to anyone I know from out of town.", "Date": "October 27, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“A Great \"Home Base\" in Vancouver”", "Author": "delphi11", "ReviewID": "UR20094958", "Content": "We spent two nights at the hotel with our two young children. The room was large and clean, and the hotel overall was quite quiet. It was excellently located for our walking tours of downtown Vancouver. We especially loved Granville Island, which was only steps away. We would definitely return to this hotel in the future.", "Date": "September 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Manchester", "Title": "“Good value hotel”", "Author": "harbincity", "ReviewID": "UR19860061", "Content": "My wife and I stayed for 3 nights and found this hotel to be fairly priced for Vancouver (expensive city). Comfortable, good breakfast and very helpful staff. Would definitely stay again.", "Date": "September 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Ideal”", "Author": "mPDX", "ReviewID": "UR19068248", "Content": "Our four night stay was great. Ideal location for walking to all the downtown sights, walking along the bay, taking the mini ferry to Granville Island, really enjoying this wonderful city. Nice room, very clean, friendly and efficient staff. Good, secure garage. We wished the bed was less hard, and the wireless was stronger, but those are minor. Best value for money downtown. We'll certainly return.", "Date": "August 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Northwich, United Kingdom", "Title": "“Good location”", "Author": "Whitec", "ReviewID": "UR18878150", "Content": "This hotel has a good location a short walk to the aqua bus which takes you to Granville Island and the tourist trolley bus stops right outside the hotel. The staff are very friendly and helpful we had a mix up with the dates we had booked and the staff sorted the problem straight away with no extra charge. The rooms are big and clean. Parking is extra but there are plenty of spaces. We would return to the hotel.", "Date": "August 12, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“good value”", "Author": "fiona229", "ReviewID": "UR18356117", "Content": "Booked this directly with the hotel. The familyroom was a decent size with two double beds in the bedroom, a sofa bed and a kitchenette. Got a good deal for breakfast and had the full Canadian which was fine. The swmming pool was not particularly attractive but after a very hot day was fantastic. The hotel is very conveninet for down town and for the ferries to Granville island. I think it is very good value for money and would recommend it to any families travelling with teenagers.", "Date": "July 28, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Nice room, good location, helpful staff, but a little bit noisy.”", "Author": "FiftyNiner", "ReviewID": "UR17662986", "Content": "This hotel seems to be listed twice in Tripadvisor, as Quality Inn At False Creek and as Quality Hotel Downtown. As far as I can make it out they refer to the same hotel. I stayed there in the end of June 2008. I like this hotel. They've got nice, comfortable and clean rooms. The staff is friendly and helpful, and it is a nice and central location at the edge of Downtown Vancouver. However, the rooms facing Howe street gets quite a lot of traffic noise. ---- My first impression was it was very impersonal, as it tends to be in a chain hotel of this size. However, as soon as I got to the room the impression was; What a comfortable room! The room was absolutely spotlessly clean and very comfortable, with a nice comfortable armchair to cuddle up in, and a comfortable bed. As well as the armchair there is the standard hotel little writing table and chair. Plenty of huge drawers and a closet to put your clothes and stuff in. Nicely decorated, probably very recently, in some kind of modernized mexican colour scheme, with rich brownish colours. The decorator has somehow managed to do this without making the room look drab or dark. The bathroom was not quite as newly redecorated, but was spotlessly clean. Not very big, but adequate. --- The hotel is just beside the Howe street ramp to the Granville street bridge, meaning the rooms at the front of the hotel do get quite a lot of traffic noise. And the view is not exactly beautiful, but interesting. ---- OK, so one or two of the buildings immediately around the hotel are not exactly brand new and well kept, but the area seems quite nice and most of the surrounding buildings are quite new residential buildings. If you walk a few blocks down the street in front of the hotel, you are down by False creek, in a nice residential area with a very nice walk along the water, with boats, the tiny ferries across False creek, a view of Granville Island, some green patches and residential buildings, and lots of people taking their evening stroll. A few minutes along this walk and there is a beach continuing all the way to Stanley park. A few blocks walk the other way is Downtown. -- I found the front desk staff to be very friendly and helpful. The restaurant is friendly and serves good breakfast, many different options. But for sure you can get breakfast at a lower cost if you walk just a few blocks away.", "Date": "July 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Derbyshire", "Title": "“Well located & great value”", "Author": "DerbyshireJethro", "ReviewID": "UR16921545", "Content": "Stayed here for the last night in Canada, chosen specifically for its close proximity to the Yale blues venue. I love it when I get lucky! Although our rental car was too tall for the underground parkade, they were happy for me to use the staff car park. On getting to our room we found we had been upgraded to a suite, (we had prepaid the room months before so it turned out to be a free upgrade) The rooms were extremely well equipped, the bed was full king size & hugely comfortable. The staff were really friendly and helpful and the only thing to mar the experience at all was beyond the control of the hotel. I would thoroughly recommend this hotel, but if you're staying (anywhere) in Vancouver in the next year or so, be prepared for lots of construction noise from dawn to dusk, as the city readies itself for the 2010 Winter Olympics.", "Date": "June 14, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "westcoast_canada", "Title": "“Right Place at the Right Price”", "Author": "westcoast_canada", "ReviewID": "UR16852272", "Content": "Stayed at this property for one night and received an online rate of $107.00. The hotel was very adequate for the price paid, the rooms were clean, comfortable, well decorated and staff were very friendly. The hotel is only seven storys high so you do not get too much of a view. The location of the hotel is on the outskirts of the downtown core, about a 10 to 15 minute walk to Robson St. shopping, 30 minutes to GM Place and probably a 45 minute walk to Stanley Park and the aquarium. I did not use the pool although it looked clean and well maintained although small. I do recommend this property to others who are looking for a more reasonable priced hotel downtown.", "Date": "June 11, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "canmore", "Title": "“horrible”", "Author": "jazzyjaz79", "ReviewID": "UR16673574", "Content": "small rooms no microwave or fridge pool is in a BACK ALLEY--where bums rummage through the bins. and they can just sit there and watch you swim. NOT a good place for kids to stay--walls are hollow. Front desk new nothing of where to go for a grocery store.. when i complained about thier photos on website being deceiving( ie-pool in alley) they were not phased. 230 a night-- for what?! so that my 6 foot tall husband can crouch over to get under the showerhead? Parking sucks and you have to PAY! View isn't very nice either... i could go on..", "Date": "June 4, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Bournemouth, United Kingdom", "Title": "“Great Location & a Decent Hotel”", "Author": "cricklewood", "ReviewID": "UR16415820", "Content": "A three night stay at the end of our journey from Calgary across the Rockies other hotels visited were · Sandman Hotel Calgary · Mount Royal Banff · The Thompson Kamloops · Amethyst Jasper Journies end. Well-located hotel a few minutes walk from the city centre & the river with the ferries to Granville Island. Nice reception, with restaurant off, rooms on floors above. A swimming pool to the rear. Bedrooms were a good size & comfortable, bathrooms clean with change of laundry each day. Staff pleasant – in short the hotel does it 's job without fuss – a perfectly good location to either finish off your tour or to do business in As for food & supplies – there is a store across the street, a 7/11 round the corner, in the evening we dined at the Yaletown Brewery – a vast pub with a good micro brewery attached, and at the both the Boathouse ( good value & great views) & Rain City Grill ( a bit pricey) in English Bay a 20 minute walk down ‘Pacific’ from the Quality. For Breakfast if you have time take the $2.5O aqua-taxi ride to Granville Island you will not be disappointed. The Quality is a decent hotel in a good location that does what it says on the tin.", "Date": "May 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "East of England", "Title": "“Well located hotel.”", "Author": "sproutandthebean", "ReviewID": "UR16287765", "Content": "Stayed at the Quality Inn for a couple of nights before returning to the UK. It is well located at False Creek, to either visit Granville Island or walk to the shops or other attractions. Good bus routes nearby. Pretty similar standard to other Quality Inns we have stayed in. The front of house and waiting staff are all helpful, the restaurant food is good and good value for money.", "Date": "May 21, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Los Angeles, California", "Title": "“Absolutely wonderful experience”", "Author": "dave6503", "ReviewID": "UR15089313", "Content": "From arrival to departure the stay was wonderful. The staff is the best, very friendly and helpful. I cannot say enough good things about the staff or the hotel. The rooms are very clean and bright. The hotel is right in the middle of everything. Davie Village is a two minute walk. Granville Island is also a short distance. It seemed like a very safe neighborhood. The rooms are so affordable. You definately get more than what you pay for here. I will stay here each and every time I return to Vancouver.", "Date": "April 16, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Zuerich", "Title": "“Okay, but know the downsides...”", "Author": "Eclipse2008", "ReviewID": "UR13987442", "Content": "Upside: 1) Relatively cheap with their 3 nights for 2 offer. 2) Quiet (at rear of hotel) 3) Oven/grill 4) Free Wi-Fi internet access from room Downside: 1) The hotel misrepresents itself - there is a prominent picture of a waterfront location/building in the front page of the hotel website at http://www.innatfalsecreek.com/ but it turned out that this is NOT the hotel (or the hotel's location), despite it being the only outside shot, and no other picture on their site to counteract this misleading impression. Instead it is an oldish building on a major road in what seemed a run-down district. 2) The name is Inn at False creek - this would support the waterside location implied from the photo above, but is also not the case. It is not AT False creek, although is relatively near. 3) The first impression of the hotel / room was so different from that implied/imagined from the photos on the hotel website we were minded to check out immediately. The room is (apparently partly refurbished) in a very old fashioned style, and gives a dowdy run-down hotel impression. The kitchen and bathroom fittings were old, scratched and dirty, adding to this impression. 4) Coming from Europe we did not know/expect that the fan unit on the wall was the only source of heat - we thought it was an air conditioner and left it alone(off), especially as the scale just said 1-10 with 10 as cooler. We were VERY cold in the night (I caught a chill/Cold which lasted our whole holiday). When we found out it heated and was the only source of heat, we used it only to find it far too noisy and dry for comfort. There was no temperature setting (Degrees or Fahrenheit) - just the scale from 1 to 10 to experiment with each night. It also never shuts off.", "Date": "March 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Great Location”", "Author": "KittiekatBrooklyn_NY", "ReviewID": "UR12990238", "Content": "Hotel is in great location, just across the water from Granville Island. There's also a 7/11 and a little grocery store only one block from the hotel. The rooms were very nice for the price. I paid a little over $300 for a double for 4 nights.", "Date": "January 25, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "stockport", "Title": "“A caring Hotel”", "Author": "fishpieStockport", "ReviewID": "UR10023233", "Content": "I arrived with my wife in late August 2007 on a Travelsphere holiday. My wife was taken seriously ill- the holiday abandoned and I remained at the Quality hotel for 29 days. The staff - room cleaner - barperson - manager - everyone were absolutely brilliant. THEY CARED. After 12 days I was moved into a suite - wife still critically ill - hotel could not have been better. Rooms clean, well serviced, efficient staff. Hotel food is excellent - tasty - brilliant sould, excellent fish and ships ! and chef's salads. front desk brilliant, esp. Al and Leanne, but unfair to name but 2. Some of the back roome suffer from eaarly morning 7am) noise, but that linked to a city workers strike (9/07). arooms - spotless ; linen similar; desk - amazing; lounge - great with its own 'Cheers' type group of locals. who care.l Would we come back ?- depends upon my wife's frame of mind. Would we stop here - absolutely. SO LONG AS YOU ARE NORMAL, UNSPOILED AND DONOT EXPECT SOMETHING MORE THAN YOU PAID FOR. - BRILLIANT VALUE FOR MONEY - FOR MY MONEY -UNACCOUNTABLE. Vyner mates (UK) - 9/07.", "Date": "September 30, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Devon", "Title": "“Good Hotel - Excellent Position”", "Author": "Bruluec", "ReviewID": "UR8875554", "Content": "We stayed at this Hotel as part of a tour organised by Travelsphere. The rooms were tastefully decorated, the bathroom was on the small side but stilll adequate.The staff were very friendly and helpful and the hotel is in a very good position - just a short walk from the water to cross over to Granville Island. The restaurant in the hotel was excellent. A good all round Hotel ideal for touring the city.", "Date": "September 24, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Glasgow, Scotland", "Title": "“Nice Hotel and Good Location”", "Author": "alaska07_7", "ReviewID": "UR8827430", "Content": "This hotel is located about a 15 minute walk from Robson Street, so its a good location. The price was not bad for downtown vancouver either, though breakfast was not included and was a little pricey for what you got, I would suggest have breakfast downtown it would be cheaper and you would get more for your money. The rooms were nice, clean and comfy bed. Would recommend it.", "Date": "September 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "seattle wa", "Title": "“good place for family and a dog”", "Author": "radarsmom", "ReviewID": "UR8518719", "Content": "This is a good hotel for a reasonable price. Nothing fancy but the room was clean (abeit a bit small for a family of 4 and a dog) and nicely appointed. We were on the alley side which was quite quiet. The free internet was very very slow. The best part was that our dog was able to stay in his crate in the room while we attended a wedding (some hotels won't let you leave your dog in the room unattended no matter what!) We didn't have time to try out the pool but it looked fun although quite small. This is a great place to stay if you are not planning on spending a lot of time in the hotel.", "Date": "August 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Frederick, Maryland", "Title": "“Great!”", "Author": "gburg2000", "ReviewID": "UR8218857", "Content": "This hotel is centrally located, well-appointed, and an overall great place to stay. It is a few blocks from both the Granville Island ferry and Yaletown. The rooms are nicely decorated, large, and some overlook the water. Parking at $12/day is reasonable and secure(plus, you get in-and-out privileges). The double-decker tour bus stops just outside the front lobby. Plus, it is within easy driving distance to all Vancouver attractions (you'll just have to navigate the city streets). I highly recommend this hotel.", "Date": "July 23, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Seattle, WA", "Title": "“Great location!”", "Author": "mistress_clove", "ReviewID": "UR8193036", "Content": "The Quality Hotel - Inn at False Creek is a clean and comfortable place right in the very heart of downtown Vancouver! It's not fancy in any respect (the main entrance is right on an access road that turns into the overpass of the Granville Street Bridge), but it's well-kept and quite adequate for a weekend getaway to BC. We stayed at the hotel over the Canada Day weekend -- got a pretty good price through one of the Vancouver tourism websites. As part of the online deal, I couldn't pick the size of bed, and we ended up in a room with two doubles. Although I would have preferred a queen bed, the mattresses were very comfortable, with foam tops and good support. The hotel staff was friendly and our room was very quiet. There's even an underground parking area right at the hotel (although I think there's a parking fee). The hotel is just blocks away from the Vancouver waterfront and many downtown neighborhoods. You can even walk right out the front door and across the bridge to Granville Island. If you're looking for fancy, this isn't it. But if you're looking for convenience and a comfy place to crash for a few nights, try the Quality Hotel - Inn at False Creek!", "Date": "July 19, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Isle of Wight", "Title": "“Great value hotel in good location”", "Author": "PurdyIsleofWight", "ReviewID": "UR8139824", "Content": "Stayed two nights and thoroughly enjoyed it here. Hotel is very busy with tour parties but the front desk staff are very pleasant and helpful and the room was clean and quiet. We chose the location after reading reviews of other hotels a lot of which seem to be in quite seedy areas of the town so have no complaints about it being a bit quiet, certainly didn't hear any of the traffic on the nearby roadbridge to Granville Island. Stanley Park is a very pleasant 30 minute waterfront stroll away and Granville Island is absolutely delightful and reached by a tiny bathtub looking ferry minutes from the hotel. We loved Vancouver and will definately return.", "Date": "July 17, 2007"}], "HotelInfo": {"Name": "Quality Hotel - Inn at False Creek", "HotelURL": "/ShowUserReviews-g154943-d1220072-Reviews-Quality_Hotel_Inn_at_False_Creek-Vancouver_British_Columbia.html", "Price": "$102 - $227*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1335 Howe Street</span>, <span class=\"locality\"><span property=\"v:locality\">Vancouver</span>, <span property=\"v:region\">British Columbia</span> <span property=\"v:postal-code\">V6Z 1R7</span></span>, <span class=\"country-name\" property=\"v:country-name\">Canada</span> </span></span></address>", "HotelID": "1220072", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/92/91/9291fd6f1c9f3a451025dd567ad011435large.jpg"}}