{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Winston Salem, North Carolina", "Title": "“Yikes! Not what I expected!”", "Author": "EvlMcgyver", "ReviewID": "UR126194520", "Content": "After a recent stay, I have to confess it was worth less than I paid for it. I made my decision online, reviewing the photos provided but they must have been at least 10 years old as the place has certainly AGED since they were taken. Granted, the room was not overly expensive and they do have an indoor pool, hot tub, exercise room, and business center but they each have problems. Couldn't tell that the pool was chlorinated or not - not a good sign for it or the hot tub either one. There are not towels there either so you have to recycle the ones from your room. In the tiny exercise room, over 50% of the few pieces of equipment there, do not work. The same is true for the \"business center\". One PC that is broken doesn't make for a business center. There are no microwaves in any of the rooms that I saw, so forget popcorn, and there are distinct signs of damage where it appears the doors between the rooms have been kicked open and only partially fixed. The patch isn't very cosmetically appealing, even though it may be functional. The bathroom commode was nasty too, as though it hadn't been flushed in a very long time. Although they offer free wireless, the connection will automically adjust (for no real reason I could see) and my connection would run from 56MB to 1MB (yes, that is a single \"1\")! On the plus side, the bed was comfortable and the non-smoking room didn't even vaguely smell like smoke as I frequently find is the case. The staff was also courteous and friendly. The overall experience was like stepping back in time and seeing how the facility has aged from it's once \"glory\" days..", "Date": "March 16, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Memphis, Tennessee", "Title": "“this is worst ive ever experienced”", "Author": "amy p", "ReviewID": "UR125060561", "Content": "Please dont stay here. Smells, dirty, cable didnt work, pool was out of order , ice machines dont work and did I mention it smells......Good location next to restaurant.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Savannah, Georgia, United States", "Title": "“Home for the Holidays”", "Author": "Timothy H", "ReviewID": "UR121870060", "Content": "I made a last minute trip home for the Holidays to visit family & friends. I was offered opportunities to stay with those I was visiting, but, I opted to stay at a local hotel. I could not have made a better choice than staying in the Clarion at 6101 Shelby Oaks Dr. It was a great, safe location that was close to local attractions, shopping, & restaurants. The room was quiet & the bed was extremely comfortable. I am very pleased with my week long stay at this awesome establishment. I will definately stay here when I visit my hometown in the future.", "Date": "December 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Elvis & Memphis”", "Author": "mark h", "ReviewID": "UR120955060", "Content": "I am a visitor from Japan. Mine & 2 other families from Osaka, Japan had planned an Elvis Presley-Graceland tour. We were picked up by Hotel shuttle van, from Memphis airport on time. Checkin & registration went very smoothly. Our rooms were excellent, kids loved the heated swimming pool, it was cold outside Shuttle van dropped us to Graceland & other tourist sites every morning. The driver also picked us up after dinner from Beal street & other points. Hotel staff were friendly & helpful, since we were new to America EvlisJapon", "Date": "November 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Vancouver, WA", "Title": "“A good value”", "Author": "mrob1515", "ReviewID": "UR120361824", "Content": "We used a coupon we found In a coupon book at a rest stop on the freeway that gave us a $10.00 discount. We got a small nice room for $60.00. The front desk clerk was very helpful. The continental breakfast was one of the worst we have ever experienced. The manager was a strange creature with an even stranger friend hanging around. He (the manager) parked his car in the port corchere where customers arrive. Seems like he would park somewhere else so his guests could use the space. Okay place except for the pitiful breakfast.", "Date": "November 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“We,the Willis family reunion enjoyed our stay. If in the area again we will return.”", "Author": "us201164", "ReviewID": "UR115550110", "Content": "The Clarion hotel has ideal location. The staff is friendly and tries to accommendate you. We did not pay 4-star rates and did not expect a 4 -star hotel. There were a few rooms with air condition problems but all of our guests rooms air condition problems were fixed or given another room. Thanks for a great weekend. Willis family reunion", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Oklahoma City, Oklahoma", "Title": "“A really bad place to stay.”", "Author": "ladycaer", "ReviewID": "UR114769681", "Content": "I think this may be the worse hotel I have ever stay in. It looks like it should be rented by the hour instead of the night. Paint knocked off the doors, stains on the carpet, dirt around the base boards. I wouldn't recommend staying here if you are going to memphis.", "Date": "June 26, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Dallas, Texas", "Title": "“Wouldn't if I were you”", "Author": "tex10517", "ReviewID": "UR113771042", "Content": "After checking into the Clarion Hotel my husband and I went to settle into our room. While trying to look past the fact that the hotel looked abandoned we attempted to settle into our room. I was completely disgusted by a toilet that seemed to have fecal matter stuck to it. I, of course, did not attempt to prove whether it was or was not. We were also very worried about the cargo bag we had on the top of our car as the parking lot was not lit very well at all. We went to get dinner and decided on the way we didn't want to stay at the Clarion. We checked in at the La Quinta and then went back to the Clarion. Because we didn't immediately tell the front desk that we didn't want to stay there they would not give us a refund. Changing rooms was not an option for us as the hotel's lack of being clean was unbearable. The manager and receptionist were not understanding at all of the situation. I used to work at a hotel and I can tell you that people got their room refunded by something as little as when the elevator bothered them all night... so that just shows you how much this hotel needs the money. After a long trip from Dallas to Memphis where we spent 4 hours in a car shop getting our car repaired I would say this hotel experience just topped off one of the worst days.", "Date": "June 16, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“You can't make a silk purse out of a sow's ear”", "Author": "HappyNow524", "ReviewID": "UR101180314", "Content": "The Good: mattresses were soft and very comfortable, the carpeting, window treatments, sheets and duvet were very attractive and appeared new, the towels were fluffy. Free parking, and prime location for our business needs. The Bad: old building which had been renovated - poorly. Visible wear in public hallways and rooms. Poor workmanship on the renovations - it appeared to have been haphazardly done with no supervision monitoring quality workmanship. No functioning iron in the room, one bar of soap for use at sink & shower, a single bottle of shampoo, no conditioner or lotion provided for guest use. The Ugly: the first room they put us in inexplicably there was a puddle of water in the carpet between the first bed and the wall. They quickly moved us to a new room following a phone call to the front desk. In the second room the desk provided for guest use wobbled so precariously we refused to place any of our belongings on it for fear it would result in the demise of the desk. The air conditioning was feeble at best, it was not that warm, but rather just \"stuffy\" in the room and we were using it to cool the room only a couple of degrees which by morning it was blowing warm humid air. There were no wash cloths provided in the room; when we asked the front desk for wash cloths we were told that housekeeping was behind and were given hand towels for washing in the shower. Speaking of the shower, they had renovated the bathrooms in granite, including the shower surround. The problem is that housekeeping did not clean well (in either room) and I could see places on the granite that looked like it needed a good scrubbing with a granite friendly solution. Additionally, in the bathroom where the tile met the wallpaper there was no border/transition and the wall paper was beginning to peel and turn black in places that you could see while in a sitting position in the bathroom.", "Date": "March 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Union City, Tennessee", "Title": "“THE HEATED POOL MADE THE STAY A DREAM!!!”", "Author": "TAMTAM11", "ReviewID": "UR100310899", "Content": "My husband took me out for my birthday and I got this room on line. I noticed it had good rates and a pool and hot tub. We got there and there and the staff was nice, the hotel seemed clean, and the room was clean. The best part was the heated pool. We stayed there most of the time. The hot tub was great too!!", "Date": "March 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Wish I had a bed at home that comfortable!”", "Author": "Sunshine77829", "ReviewID": "UR99733813", "Content": "The large, plush king bed was SO comfortable, I wish I had one at home. It felt incredibly luxurious. Since our stay was going to be so brief, I had booked the single king for my 6'3\" son and myself, and it worked out great. We slept soundly, having plenty of personal space, fluffy pillows and crisp linens. The parking lot is a bit shabby, and initially made me unsure it was safe to stay here, but everything went fine. There are several other hotels on the same road, and a Cracker Barrel next door. TV worked great, bathroom was a little dated and sloppily renovated, but clean, and that's what counts. Staff was very friendly and courteous. There appeared to be renovations going on just 2 doors down from us (plastic curtain blocking the hallway), but we didn't hear anything. Barely heard any noise from the interstate just outside our window, too.", "Date": "March 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“good for the price but nothing special”", "Author": "febardin", "ReviewID": "UR86788402", "Content": "we stayed at the clarion because they were running a group rate for a wedding. the facilities are nice but the rooms aren't anything special. they had a new receptionist so it took forever to check in. the bed was comfortable which is a plus. my main complaint is that there was a free continental breakfast but there weren't a lot of good food options. even worse... i used their individual packs of dairy creamer in my coffee, and one of them was rotten/molded which i didn't notice until i was drinking the coffee and got what felt like a marshmallow in my mouth. spit it out and found a molded glob of creamer. i was sick the rest of the day!!", "Date": "November 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Memphis, Tennessee", "Title": "“Old location working hard to please patrons.”", "Author": "suse0104", "ReviewID": "UR76694813", "Content": "I recently had the pleasure of working with the hotel staff and attending a function held at the Clairion. I cannot adequately express the many ways this hotel staff went out of their way to accomodate the function & our guests. This is an older hotel undergoing renovations but there were no major glitches in our event. A few guests did not receive the type or floor of room requested but that was due to a sprinkler malfunction the week prior. For the most part, we felt like we had our own private hotel for the event which was attended by over 100 people.", "Date": "August 24, 2010"}, {"Ratings": {"Overall": "1.0", "Location": "3"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Didn't even make it an hour”", "Author": "Torgy20", "ReviewID": "UR71083978", "Content": "I chose this hotel because of Trip Advisor recommendations. I wish I could have read the current reviews first. We checked in and then went around to another door that was closer to our room. There was dried vomit on the door entrance. We weren't sure the elevator was going to make it to the fourth floor as it creaked and groaned. When we got off the elevator, the hallway was very warm. We went past many doors...some that had masking tape with the room number written on it, some with padlocks on the door, some with the peephole missing. We couldn't find our room number. We went back down to the lobby and were told that we must have gone to the wrong wing and the manager offered to show us the correct place to go. By that time we had already gotten a distaste of the hotel and so just demanded that our money be refunded. The manager quickly complied. Since I booked through the main Clarion site, I will need to contact them to make sure we were not charged for the room. From what I'm reading on the other reviews, the other wing isn't all that great either. I'm glad we decided not to stay.", "Date": "July 16, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Edgerton, Wisconsin", "Title": "“Barely stayed an hour here!”", "Author": "paulbahr", "ReviewID": "UR69742618", "Content": "I booked this hotel via the Choice Hotels website and picked it because of the pictures and the price. How misleading!! When we pulled up to the property, The first impression was that it was tired on the outside. I checked us in (my wife stayed in the car) and the lobby was pretty nice with travertine tile floors and nice decor. We got back in the car to find an entrance closer to our room and drove around the back of the bulding. HOLY COW!! It looked like it was an abandoned building on the back end. There were significant weeds growing up through the cracks in the asphalt and our opinion started to nose dive. We ended up right back in front because none of the other entrances looked like they were usable. My wife suggested we only take a bag or two 'cause she wasn't sure about this place. We came to the entrance door and it said that it was locked 24x7 and that you needed your room key to access the door: it opened right up with no key. First red flag! When we got to our room in this non-smoking facility, it had clearly been smoked in recently and not cleaned very well. There were stains on the linens and the caulk in the bathroom was disgusting. Our room's \"view\" was of overgrown hedges that severely needed grooming and that was through the slashed on mud/tar/something that was all over the dirty windows. We grabbed our bags and headed for the front desk. We demanded a full refund and, after checking with the manager because \"they don't usually have this happen\", we walked out without charge. STAY AWAY from this place unless you like staying at dumpy hotels!!", "Date": "July 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bryan, TX", "Title": "“OK, but nothing special”", "Author": "jkeyser", "ReviewID": "UR67548563", "Content": "Overall, the hotel felt lke a large, somewhat older hotel, for which parts (but not all) have been renovated. It seemed OK, but there was nothing that stood out as particularly good to me, and some parts felt as though they still needed to be renovated. We stayed here overnight while traveling through Memphis. We arrived very late (after midnight). We were given a room number and ended up on the wrong wing (which did not look to be in great shape) seeing as there were no clear signs identifying room locations, and had to return to the front desk to get directions. When we finally found the right area and made it to our room, the handle to the door was broken and we couldn't get in. Another trip all the way back to the front desk and we were given another room (adjacent to the previous) for which the handle worked - sort of (it would open, but needed to be lifted up, not down like every other door handle). Honestly, it was a pretty minor thing overall, but when arriving after midnight with two tired young kids, it was all pretty annoying. The room was fine, though nothing special. We didn't get to try the breakfast. The pool looked nice, but we also didn't get to try it. Checkout was smooth. I worried a bit about car safety in Memphis, but when I was unloading my car, I noticed a police car patrolling, so it seemed to be secure enough. The atrium area (not near the front desk) was large, and it looked like the kind of place that could host decent-size meetings, so I would expect that sometimes the hotel will be filled with meeting-goers. At night, though, having to walk through that deserted atrium while going to our room felt pretty weird. Altogether it was an average place with a minor annoyance. I'm borderline on whether I'd stay there again, but given that it was OK, and it wasn't a bad price, I'll lean toward the positive end.", "Date": "June 15, 2010"}], "HotelInfo": {"Name": "Clarion Hotel", "HotelURL": "/ShowUserReviews-g55197-d122504-Reviews-Clarion_Hotel-Memphis_Tennessee.html", "Price": "$57 - $90*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">6101 Shelby Oaks Drive</span>, <span class=\"extended-address\">6101 Shelby Oaks Drive</span>, <span class=\"locality\"><span property=\"v:locality\">Memphis</span>, <span property=\"v:region\">TN</span> <span property=\"v:postal-code\">38134</span></span> (Formerly Memphis Plaza)</span> </span> </address>", "HotelID": "122504", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/77/e9/77e97fbb242d366f07fad210a24ca1956large.jpg"}}