{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“WiFi doesn't work here”", "Author": "whatevers2010", "ReviewID": "UR125710253", "Content": "If you need WiFi while staying at a hotel, this is NOT the place for you. You're lucky if the WiFi is active one hour per day. Aside from that, the hotel is ok and the staff is friendly. But i stayed here once before and had the exact same problem with the WiFi, and can now see that the management just doesn't care about fixing the problem. I wouldn't stay here again.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "", "Title": "“So-so”", "Author": "fitR99", "ReviewID": "UR125289261", "Content": "I've stayed at Ramada properties in the past and have been pleased with it. Hence, my reason for selecting this particular property as I was important for me to be in close proximity to the LA Convention Center where I was attending the Fit Expo. However, upon checking in. I felt great because the lobby looked great and the Building's apprearance...especially outside looked great. Well once I got to my room i was just too annoyed. Furnitures were soooooo old, worned out and shaken....even the table where the tv sits...was broken. Only sensible thing was the bed. Room looked like something from the 50's. I was like ARE YOU KIDDING ME??? For the price they charge the properties ought to be better. I know its not a 4 star property but still. I called the front desk immediately. They were very nice.!!! that's the only positive thing I can say about this property. The front desk staff....(whether male or female) were super courteous, warm and helpful. Back to my issue.. The front desk then changed my room immediately then placed me in the another room...which was a little better but still has this strange touch.. GRRRRR....by now I was a bit tired and couldn't take another move....cause this was all after a 6 hour flight and coming from the east coast to the west coast with the slight time difference I was getting sleepy... and needed to get some sleep. So I just took the other room the front desk rep gave me...which was a little better but could still use a face-lift. All in all....I can't say that I'd stay at this property again if I'm in the L.A. area. I'd search for other low cost hotels in the area that is sure to offer a tad bit better amenities.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Would not stay here again”", "Author": "N_M495", "ReviewID": "UR124043770", "Content": "I've read a lot of reviews on here that mention ants, or bugs, however I did not find any of that. The room was very clean, no issues with that. However, I did have a major issue with the apparently free WIFI in the rooms... the issues was that it doesn't exist. When I got to the room and tried to get on the internet, I couldn't even find the Ramada WIFI option (I could, however, find the option for the motel across the street -- so maybe stay there). When I called down the the front desk to ask about it, they informed me that this is just the way things are there, that the WIFI doesn't really work in any of the rooms, but it does work in the garden area. Therefore, for me entire stay, if I wanted to use the internet (which I had to, as I was there on work), I had to go outside my room and sit in the garden area. I would recommend staying anywhere but here, if only because the staff offered no help when I was having a problem with the interney.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Hong Kong, China", "Title": "“Pretty good hotel, but check your bill carefully”", "Author": "HK_Observer", "ReviewID": "UR123021173", "Content": "This is a fairly nice motel-type place. The room was reasonably large, and reasonably clean. Parking lot was small. Location is nothing exceptional -- despite the name it is not really near the Convention Center. Free Wifi worked well. When I arrived I was warned the aircon was not working in my room, which was not a problem in early January. (My room was quiet, even when I opened the window to take advantage of the cool evening air.) But the customer service.....ooooooo! On checkout I was presented with a bill about $80 over what was confirmed on my online reservation. When I informed the front desk staff of the error, they looked up the reservation, hemmed and hawed, and said I had to present them with a printed copy of my confirmation. I SHOWED them the confirmation email on my computer, but they demanded a printed copy before they would honor the quoted rate. I then had to go to their business center, log in by webmail, and print off a copy of the confirmation -- all to get the rate that the company had promised me. So in essence, THEY made a mistake and made ME spend a half an hour to clear it up. Not acceptable.", "Date": "January 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "la, ca", "Title": "“Seriously??!!??”", "Author": "eap1307", "ReviewID": "UR118853745", "Content": "PROS 1. Hotel lobby is beautiful. Nice fountain and seating areas. 2. Good location for downtown area. 3. EXTREMELY NICE & HELPFUL FRONT DESK AGENTS & MANAGER 4. Flat screen TVs in all rooms & looks like the bathroom area has been remodeled. 5. GET A ROOM W/ POOL VIEW (GIVES YOU A PRIVATE BALCONY) OR A ROOM THAT OPENS OUT TO THE GARDEN AREA. absolute must have rooms to even enjoy the hotel. CONS! 1. OUTRAGEOUSLY ANNOYING PARKING SITUATION. They have limited cover parking; if that's taken up, you have to park across the street in a parking lot. You have to have your room key to even access the damn parking lot. (safety first , i know but jeez). The worst part - The damn \"parking security guard\" harasses you constantly. Even though he knows you stay at the hotel and you MUST have your room key to access parking lot across the street, he still watches you & questions you like a little kid (what room you are in, how long you're staying, you're full name, where you parked, etc.) He didn't do anything with the information he was requesting- just wanted to be nosey. I have a feeling he was a bit raciest as my husband is black and i'm white && the parking guy seemed to watch us and question us like we committed murder. This was soo annoying, I even complained about him. 2. Hallways are extremely smelly. Either fishy, urine or too much cleaning supplies. 3. once again, there was a language barrier with pretty much all staff but all in all, they were friendly (except for the damn parking guy). 4. In order to use the in room phone you have to pay to have it hooked up. Then, the staff doesn't even know the charges to use the phone as they are not even the ones who bill you. Highly advise you just use cell (if you get reception) or use lobby pay phone. 5. Make sure you don't want a late night snack. They lock up the little snack store they have in lobby and you have to ask them to unlock it, wait for them to open up register, then buy your night time snack. 6. ANTS ANTS ANTS. I complained to the manager; she hardly understood what i said but stated that 1 time a year, they have ants. She gave me her card and told me to contact her if i were to stay there again; buut she didn't take my name down- so how would she even know it was me?? annoying!!! ALL IN ALL, I'D SAY THAT I GIVE A 2.5 STAR RATING. (TRIPADVISOR DIDN'T GIVE ME THAT OPTION WHICH IS WHY I PUT 3.)", "Date": "October 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dallas, TX", "Title": "“Decent option for a downtown LA stay”", "Author": "Spankytoes", "ReviewID": "UR118371192", "Content": "Just finished up a 2 night stay at this hotel. Location: The location is actually pretty decent. It’s on the outskirts of the downtown area in the heart of Korea town. There is a 7-11 and several fast food options in the immediate area. I don’t know if it is fair to call this a Convention Center hotel though. It’s a good mile away from the Convention Center and they don’t offer a shuttle. If you were to walk there, you would be going underneath the 110 overpass, which is always dicey. The area itself was safe but there is absolutely nothing to do there for the English speaking world. The only cabs we saw were dropping people off from other areas. Of the hotels/motels in the immediate area, this looked to be the best. I liked that the highway was a half a mile from the hotel as we were exploring areas outside of the downtown area. Staff: The staff had a pretty lax attitude with us. Nothing was very memorable at all. They never greeted us or opened doors and didn’t seem to be knowledgeable about the area. We asked the lady at the check-in desk about a recommendation for a good Korean restaurant in the area and she suggested a place down the alley behind the hotel. When pressed, she simply printed out a map of the area and tried to navigate the places for us. She thought that Beverly Hills was within walking distance until I pointed out that we are in downtown LA. We made due, but it would be nice if they explored the area for their guests. Their on site restaurant was never mentioned, which we took it as a sign for the quality and never tried it. Hotel: The hotel was in better condition than I expected after reading the reviews here. The lobby was small but quaint. Our room overlooked the courtyard on the 2nd level and was big enough for our purposes. However, I did have several issues with the room itself. First, the energy saving light bulbs are annoying. It takes about 3 minutes after turning on the light for it to reach its maximum brightness. At night, when it’s pitch black, that makes it a little difficult to navigate through the room in a makeshift night light. The second was the pillows. On a Queen sized bed, you are given 4. But they are literally a 2X2 in size. The sheets are also paper thin and you only get two of them. I’ve had better bedding at a youth hostel personally. The room itself has a distinct musty smell that lingered so long that we had to open up a window to air it out. The TV channels were probably 50% English, 40% Korean and 10% Spanish. I believe that they have Encore as your movie channel option. Was an LCD TV, but no HD in the room. Perhaps the biggest gripe is the parking. Yes, it is free. But that parking garage was designed by a blind man. What should only hold 15 cars max holds 30. More often than not, we had to have the hotel valet move the cars so that we could back the car up. There is one entrance and exit and you had to be a professional driver to navigate around the pillars and other cars to avoid contact. The parking lot across the street is a much better option…but it wasn’t working as intended. You are supposed to open up the gate with your room key but it was never a problem for anyone to pull in. Price: I utilized Wyndham’s Best Rate Guarantee to get my price down to $60.00 per night. This was a pretty fair price for what we got. I wouldn’t pay anymore than $80.00 per night though. All in all, it was a good hotel for the price, but don’t expect to be wowed.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "4", "Overall": "2.0", "Value": "2", "Service": "4", "Rooms": "2"}, "AuthorLocation": "jcsfla", "Title": "“Out dated rooms. AC literally stopped working. Musty”", "Author": "jcsfla", "ReviewID": "UR118157525", "Content": "I stayed at this hotel twice for a total of 6 days. To the staff's credit, they were very nice and attentive. The hotel simply is past its prime and it needs a total remodel (which I was told is in process). The room was musty, the windows were dark bc of an exterior tint, the ac broke on me... Ramada's are top tier hotels but my review was calibrated for what I expect from a Ramada. They definitely fell short.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "4"}, "AuthorLocation": "Prince George, Canada", "Title": "“If you like black widows...”", "Author": "Cleanfreak17", "ReviewID": "UR115449960", "Content": "If I were rating the service, the gift shop, and the entrance, this hotel would easily get a 4-star review. However... our room smelled horribly musty, the carpet was absolutely filthy, ants were crawling everywhere, and my husband found 3 black widow spiders! Sends shivers up and down my back even now. I'm an easy person to please, but I do expect exceptional cleanliness, sanitary conditions, and no creepy-crawlies! Therefore, this hotel rates a solid 1. Don't stay here unless you love 6- and 8-legged creatures! :-( Disgusting.", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Fort Myers, Florida", "Title": "“Disappointed”", "Author": "Lisasuzie", "ReviewID": "UR114853619", "Content": "First of all, I was extremely over-charged for the quality of the room and the cleanliness. The first room we got had bad mold/(green/pink&black) all around the shower...it was disgusting. I did call the the desk and they did lower my rate and moved us to another room which I did apprecieate. Although, I still feel they are overpriced for the quality of this hotel as in the 2nd room the carpet was filthy and the comforter was all ripped up is in actuality what we settled for. I was told it was only a mile from LA Live which is why we were there, my sons film was in the LA Film Festival and it was almost 2 miles so we had to cab it, but we got free parking so that was a plus and not normal for this area. I had also asked was it a safe place to where we could walk around and they said yes and then when we arrived, we were told not to walk around at night. Really????? The restaurant was nice (Spot), but it got closed down by the LA Health Dept. so we really don't know what happed there, but it has the potential to be a really nice place and actually the food was good. The free interenet was extrmely slow and the TV channels.........there were 12 channels and most of them were Asian & Spanish....so if you are american and couldn't understand Asian/Spanish there wasn't much to choose from re: watching TV", "Date": "June 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“nice decent hotel”", "Author": "SamirDewan", "ReviewID": "UR97747589", "Content": "Clean rooms, amazing staff willing to help and make you feel at home....have lot many food joints near the hotel, we had a large room with 2 double beds. Some of the rooms have no air conditioning, but the staff are honest and asked our choice of ac or non ac so if u book, check in early a bit and grab the air conditionied rooms as they go off quickly especially in summer....the hotel is although not in the best of the locality, but then its abt 10-15 mins walk to the nearest tube station, you can not expect everything...all in all, good clean rooms - spacious, good , attentive staff and what else you need....glad i stayed here...and guest what - they dont even charge you for internet :)) Thanks Ramada LA :)", "Date": "February 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Los Angeles, California", "Title": "“Get what you pay for.”", "Author": "john2298", "ReviewID": "UR96259193", "Content": "I was dissapointed with the location. Nothing safe within walking distance. Need to take shuttle or taxi; convention center hotel is false advertising, it is not near staples or convention center. you get what you pay for; so if you are on budget I guess it is an option, but likely not going to come back.", "Date": "February 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "San Francisco Bay Area", "Title": "“Reasonably priced option”", "Author": "ReisenistmeinHobby", "ReviewID": "UR94656854", "Content": "This place was a pretty good option, considering that I had waited almost too long to book a room in LA. It is not exactly AT the Convention Center; it's about a mile away, but both a public bus and taxis are readily available. The room was OK; the front desk personnel were welcoming and helpful. The hotel shop was closed, and the Spot restaurant was OK but not great; service was a little slow despite the place being nearly empty every time I saw it.", "Date": "January 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Reasonable rates, good location.”", "Author": "Jason60097", "ReviewID": "UR92585670", "Content": "Room was as expected with a Ramada chain. Very nice bathroom, with fridge and microwave in room. TV channels rather limited - only about 20 total and half of those in spanish or chinese. Would stay here again - only 1 mile from downtown LA - and sure beats the $200 plus a night downtown. Were disapointed with restaurant connected to hotel - \"SPOT\". Even though smoking is not allowed, smelled very smoky inside restaurant. There are a number of tours that depart directly from hotel whice is very nice, and you are just 3 blocks from Route 200 bus line.", "Date": "January 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Powell River", "Title": "“Travel with the Grandboys\"”", "Author": "Lindao", "ReviewID": "UR82612868", "Content": "My grandsons and I spent a week in this hotel in Sept. 2010. The rooms were good, large enogh for the 2 boys and myself. There was no noise in the hallways and even outside it was quiet and we faced the street. On evey floor there is a laundry, 2 wshers and 2 dryers. As well you can purchase your soap and dryer sheets if you need them. A little pricey at 2.00 each but if you need it it is there. The pool area is great, large enough for the boys to get some exercise but not too large to keep an eye on them. The waiters in the restaurant were great, by the second day they knew what the boys would have to drink for breakfast and often what they wanted to eat. The youngest boy was allowed to eat off of the childs menu as long as I ate, for free. In the hotel itself is a kiosk for purchasing tickets for the bus that would take you to Disneyland. The cost was 4.00 per adult for 24 hr. and 2.00 for each child, also for 24 hours. The front desk staff were great, always cheerful and ready with an answer for any question. In all I would stay here another time, great location, service and overall just a nice place to stay.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Los Angeles, California", "Title": "“Free parking - otherwise terrible”", "Author": "doug8888", "ReviewID": "UR82237333", "Content": "Our room was reasonable size and fairly well equipped however was crawling with ants. We complained to the reception desk and they made a note of the problem - no concern, no apology, no ........ The ants were even in our bed, and got into our hair and clothes!!!! The breakfast was $6 for an all you can eat buffet - however the buffet had almost nothing on it. All in all - a cheap hotel that was not worth the price", "Date": "October 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Coffs Harbour", "Title": "“Great place to stay!”", "Author": "SammyinLA", "ReviewID": "UR78561687", "Content": "All over a great pleace. Staff great, concierge very willing and eager to help. No problems at all with my 2 nights there. Beds so comfy, room clean, The only thing I didn't likevery much was the location...would have prefered much closer to everything, but still easily accessible using public transport, bus stop just around the corner. 7 11 across the road, gas station within 100 metres, and great fast food (El Pollo Loco) just across the road. Would definitely recommend this motel.", "Date": "September 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Diego", "Title": "“Everything was fine and uneventful, until the last day.....”", "Author": "SanDiegoFito", "ReviewID": "UR72044843", "Content": "This hotel is a great value if you are on a budget and you need to go to Staples Center, the Convention Center, Nokia or the Financial district... all these places are really close, for a non-Californian I would say they are within walking distance, but Californias don't like to walk. We planned this small getaway just to go to Universal Studios and the Medieval Times, but we also did some sightseeing in Santa Monica, Venice Beach, Griffith Observatory, Chinatown, El Pueblo de los Angeles and Hollywood. I traveled with my wife and two teen daughters. I read the reviews here on Tripadvisor and found some of them terrible, talking about bedbugs, unsanitary baths, etc... but I didn't find anything like that; rooms are pretty decent. They seemed to be recently renovated, good bedding items, kind of new drapes, room is nice. It has great towels & pillows which is a big plus for this hotel category. Room and premises are really clean. Including the pool. Pool is supposed to be heat (and maybe it is), but being like 80 deg. it could be a little chilly for some people. Staff in general is polite and friendly; basically Mexican (or latinos) and Koreans. They have breakfast but not included in the price, so you have to pay $4.99 per person, so if you are on a budget and traveling with family you should consider this to decide against a Holiday Inn Express or a La Quinta, where breakfast is normally included. Also, they advertise to have WiFi; but the service they have is pretty lame. Makes look dial-up a thing of the future. I called the reception and they blamed on the large quantity of guest who carry a laptop nowadays (which it could be truth). This is a good option in general but something happened the last day. I went to the pool with my two daughters; I stayed there for a few minutes and went back to my room to take a shower and check out. My daughters stayed in the pool; minutes later my oldest daughter came back and told us a \"chinese\" guy had told them to get out of the pool because they were not guests. I guess it was a Korean, since it is in Koreantown and I saw many things in Korean in this hotel. He was super-rude with my daughter demanding the room number and last name, my daughter told him the room number but not the name, he was all pissed screaming. I called the front desk and they explained to me that there are some apartment buildings around the hotel and kids sneak into the pool all the time; well, it's understandable that they try to enforece security, but there are polites ways to treat guests, especially when they are minors. My daughter told me he was the owner, that's what he said. I guessed he was the GM. The guy at the front desk told me he was the supervisor , and apologized. Well, not enough. I will write a complain to Choice Hotels. I am in the Hospitality Business, I know about these things. If this guy is indeed the GM, I don't know how he manages a hotel, he has no basic education.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Nashua, New Hampshire", "Title": "“No services”", "Author": "Soxxfan99", "ReviewID": "UR68316324", "Content": "The shower had no hot water for the first day of our stay. Several calls to the front desk later, they sent a person up who was able to remedy the problem. Upon getting \"hot\" water, the water itself was only ever warm at best and came out of the shower with such little pressure that I actually had to wash my hair in the sink. The AC was broken and, upon calling the front desk, we were laughed at. Five calls to the front desk later (on one call they actually told us to check our television for the AC), someone came up and finally helped solve the problem. The supposed \"high speed internet\" costs and additional 19$ per day and does not work. This was actually the first problem that we ran into and called the front desk about. Upon calling, they gave us a tech support number which we could not call because the phone only worked for calls within the hotel. It took three more calls to the front desk and about 20 minutes to get the phone working and another 4 hours and seven phone calls before we gave up on ever getting internet. 19$ a day for nothing and when we asked for a refund, the clerk literally laughed in our faces. And the ants. Oh, the ants. Ants, spiders, bugs, every night, all over the place. We ordered a pizza from the nearby domino's (which was delivered to us quickly according to the domino's place, only a 90 minute wait, though that is hardly the hotel's fault) and overnight lost that and any other food we brought with us which wasn't sealed as if for a camping trip. If you are wondering however, it was the proximity to the dominos The hotel layout itself was terrible. We had to take something around 4 left turns into sub-hallways in order to find our room and each hallway had its own distinct aroma ranging from decomposing trash to stale urine. I'll leave it at that. As you can tell, the service was beyond awful. Having three people and only receiving two beds and not the extra bed we were promised because \"the two extra beds are in use\", we requested a cot only to discover that they had no cots either. So someone was forced to sleep on the floor or get closer to a friend. We were forced to make somewhere around 20-30 calls to the front desk and another seven to the tech support number just in the first night. If you are planning on going out for the nightlife, I would avoid this place like the plague. The people nearby were downright mean (several of them requesting money or just plain telling me to *expletive* off or they would shank me, a threat which I believed them capable of backing) and we did hear a shooting take place and several police cars getting involved. Not my kind of nightlife. I love to go out and have fun but I sadly cannot check the nightlife box as, after the first night and hearing the shooting, I barely felt like leaving my room the next morning. It was only because the room itself was so bad that I was able to get myself out of it. This was a horrible experience and I would never recommend it to anyone. I hope that someone reads this and decides to avoid this experience as it is the worst I have ever had in a hotel. I've stayed in two star motels before around Yellowstone national park and even they shine in comparison.", "Date": "June 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Stockholm", "Title": "“This is a bad hotel”", "Author": "tomarcStockholm", "ReviewID": "UR67853379", "Content": "Even a budget hotel has to be able to do some things right. We had booked and got confirmed a room with an extra bed. When we arrived we could not get the extra bed because Housekeeping had left and wasn't coming back until 7am next morning! Next morning it turned out that the hotels two extra beds where already in use.... The so called \"high speed\" Internet was a very slow Internet, you had to restart the internet every 5 minutes. The surroundings are more not nice. One night ther was shooting outside the hotel and a police helicopter came with searchlight.", "Date": "June 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Concord, California", "Title": "“Pleasantly surprised”", "Author": "AkamaiGuy", "ReviewID": "UR66553409", "Content": "I picked the Clarion Hotel Downtown because it was the best deal for the downtown area. Hotel is centrally located and actually borders Koreatown. I chose the Clarion over the Rodeway across the street because Clarion had a free room safe and sufficient free parking, and Rodeway did not. Clarion parking consists of spaces under the hotel and across the street in a secured lot. Small elevator is cramped, but there is a wide, open stairwell next to it. The Japanese restaurant appears to be out of business. An American breakfast buffet is available for $8. McDonalds and El Pollo are located 1 block away. Our room, overlooking a courtyard, was clean, quiet, and comfortable. I'd definitely return. 2 thumbs up!", "Date": "June 5, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "perth western australia", "Title": "“Ok Hotel in good location for staples centre”", "Author": "cycobomber", "ReviewID": "UR38209343", "Content": "Wife wasnt too keen on staying here (bit fussy) but she was happy with the hotel and i thought the hotel was good too. its a 2* so nothing flash and probably wouldnt stay here for a week but for 1 night to go to staples centre and lay our heads was fine. Staff were pleasant and helpful. Area around the hotel is a bit weary walked to staples and felt a little unsafe so cabbed it back after the event.", "Date": "August 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Bellevue, WA", "Title": "“Our room was overbooked - Can you believe it?”", "Author": "eggwhite", "ReviewID": "UR34907057", "Content": "We reserved this hotel due proximity to USC graduation and upon check-in discovered that the hotel overbooked the suite we reserved. The clerk offered 30% off our booked rate for a king bed room with a Jacuzzi which incorporated the shower without a shower curtain. Luckily, the bathroom was oversized to accommodate the spray on the floor. We parked across the street in a gated lot and the hotel had a security guard on duty. The room was small but dark and quiet for a good night's sleep.", "Date": "July 16, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "4", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Houston", "Title": "“Creepy Crawlies”", "Author": "Jake085", "ReviewID": "UR32483452", "Content": "I stayed in two rooms during my trip. The first was infested by ants. The second infested by ants and I saw a large cockroach. When I realized the whole building was infested I decided to check out. Neither room had been cleaned in days as I noticed a lot of dirt under beds. TV also didn't work properly. Whoever is running this place does not care about anything but taking your money. The manager was supposed to call me to apologize but she still hasn't. DON'T STAY HERE!!!!", "Date": "June 16, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Sydney", "Title": "“Good value for money, bad customer relations”", "Author": "webbo123", "ReviewID": "UR28843556", "Content": "Well, we arrved from Australia and we were booked in for 2 days, which was OK, the rooms are reasonable and clean and very good value for a downtown hotel, then went up the coast for another 2 days and then return to L.A and stayed at the clarion for a further 3 days.This was all booked prior to coming to L.A. and the room cost was approx $81 per night. Our schedule had changed and we ask management more that 24 hrs prior if we could stay another night and they said the tariff would be $154 + taxes for the extra night. I sort off took a step back and said WHAT, YOUR KIDDING, managements reply was that the hotel is very busy and that will be the rate, yes they did have spare rooms available. Anyway I was really pissed off and there was no way in hell that I was going to pay that, and the rooms are not worth that anyway. This left me very angry, and is NOT the way you treat a returning customer. So I went up to the Wilshire Plaza and they were full and they recommended the JJ Grand Hotel in South Harvard Blvd, was a little more expensive $114 + Taxes but a far superior hotel. the rooms were very, very good, and extremely clean. Clarion get your act together, do treat your customers in this fashion..", "Date": "April 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "San Francisco", "Title": "“we are going back!”", "Author": "rcabodeely", "ReviewID": "UR27617227", "Content": "my girlfriend and a i visited for two nights from san francisco, and we have decided to stay here again when we visit l.a. this summer. the rooms were clean, the hotel is quiet, the area is close to everything, they have parking avaliable and they have free high speed wireless internet. what more can you want.", "Date": "April 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "4"}, "AuthorLocation": "Brisbane", "Title": "“Nothing amazing, but decent”", "Author": "Inkblotspot", "ReviewID": "UR25475578", "Content": "We found it very hard to find reasonably priced accommodation in LA. We didnt have any specific agenda for our time there, so we just picked a hotel that seemed ok for the price. That's pretty much what the Clarion Hotel Downtown was. The room was nice, the bed comfortable, and everything was clean, but like the majority of hotels we found in LA, was overpriced - especially for the area it was in. It's really not in a very nice location at all - very dirty, very old and run down, and not filled with the nicest people. There is public transport nearby, but I wouldnt recommend using it - like everyone says, you really need a car in LA, and I think had we listened and hired one, the location of the Clarion wouldn't have been so important because it would have just been our base, as opposed to the area that we were mostly confined to. So all in all, decent hotel, not bad for the price - but if you're going to LA to experience the glitz, glamour or even just a friendly face and a semi-clean city...this area probably isnt for you.", "Date": "March 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "MUNSTER", "Title": "“Pleasant, easy-going, friendly hotel”", "Author": "MENDOZA039", "ReviewID": "UR24267991", "Content": "I stayed in this hotel because of it being affordable and because it seemed to look respectable too. It was between the Rodeway Hotel and this hotel ( The Clarion ), both are across the road from each other. I booked through Hotels.com the day before I arrived and had no problems checking in, everything was in order. The guy at the front desk (Sam) was helpful and courteous and gave me some helpful tips. I liked the feel of the place, and the room was good, shower, basin, sliderobe where you could hang your clothes and this also contained a safe which you could enter a 4 digit PIN number to open & close, came in very handy. The bed was fine and I had a TV and a desk with chairs, I even had a fridge and a coffee machine. Everything was clean and functional. If you are going to the Staples center or The Convention center this hotel is about a 15 to 20 minute walk, I wouldn't advise walking at night, better to take the bus, I used the No. 29 which ran very regular and only cost $1.25. I walked during the day but if you are tired its nice to know a bus is on hand if you need it. If I was to suggest something to the owners to change, I'd say move the fridge away from the bed to the opposite side of the room, it can buzz a bit at night and if you are a light sleeper it might annoy you a little. Aside from the fridge suggestion, if you don't want to pay \"Ritz\" prices and want a decent hotel within short range of downtown LA, I'd definitely recommend the Clarion Hotel, I would stay there again if I ever revisit LA. Tony", "Date": "February 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "California, Central Valley", "Title": "“Great for the Price”", "Author": "erac87", "ReviewID": "UR24221849", "Content": "My family and I have stayed here twice and is one of our favorite hotels when it comes to watching our budget. The Hotel itself was really welcoming and worth the price. It is in a Convenient place really close from downtown which makes it a plus. It is close to the freeway, restaurants in like every corner and location is decent. The only bad thing that happend at my stay at this hotel was that In our second visit it was in mid May of 08 and it was a pretty hot night and the AC at first would not work but then after messing with it for a while (30min) it started working a little. It just took a while to kick in but other then that no complaints everything was great and I will stay there again on my next visit.", "Date": "February 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tel Aviv", "Title": "“Good service, great facilities”", "Author": "TikiWanderer", "ReviewID": "UR23127435", "Content": "True, Downtown Los Angeles is a dodgy place to stay, but if you must be in the area, Clarion is a good choice. We went to see a show in Club Nokia and chose this hotel due to its close proximity to the venue and the cheap price (I work in the travel industry and after my employee discount the price was rediculously low for an L.A accomodation). We had initially planned to walk to the venue, but the receptionists advised us against it an booked us a cab. The hotel might be old but well-maintained. Public facilities are clean and pleasant. Room was big, equipped with a TV set, refrigirator and coffee making facilites - none of which we used, but all looked clean. Bathroom was spotless, water in the shower pipping hot and with high pressure, bathroom amenities of better quality than what you find in most places. There's free parking for hotel guests, which is a great advantage. Will book there again if needed.", "Date": "December 31, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "California", "Title": "“Could be great if they cared, but Not”", "Author": "2_Travel_Smart", "ReviewID": "UR22978577", "Content": ">This hotel could be wonderful but the service is terrible and the desk staff is rude when there is a legitimate issue. It is a shame because this hotel does have great amenities. Off the lobby there are shops and a restaurant which thankfully are not managed by the same people as the hotel. The hotel itself is older but seems well kept and the parking garage is a great asset in L.A. However the absent communication between the desk and housekeeping equates to dirty rooms and violations of guests peace and privacy. Worse, when these deficiencies are pointed out the staff responds with rude behavior or empty promises. My experience with this hotel began well and then went down hill. Unhappy with the location of the original hotel I had booked I called Choice Hotels for an alternate location and found this hotel. Unfortunately they were not able to complete the reservation because their computers were down and my WiFi was not working so Choice gave me the number and I called the hotel directly. The young lady who answered was very pleasant and I booked a room. Upon arrival I found a very well appointed older hotel and was pleased with the value and the service of the young lady I had spoken with who was at the desk. The service made me smile and look forward to a pleasant stay. That is until walking into the room. The door was ajar when I arrived and it became apparent the housekeeping had not completed their tasks. Pillows were missing from the bed, the linens had not all been replaced, and the room had not been vacuumed. Later I found the refrigerator had a spill which was leaking out. Seeing the condition of the room I called the desk for another but they encouraged me to stay in the room when I asked to do it later because I was running tight for an appointment and needed to take a shower and change. They offered instead to send housekeeping if I called when ready . It seems the desk never contacted housekeeping because as I stepped wearing only a towel into dressing area the housekeeper came in to the great embarrassment of both of us. She hurriedly dropped a few towels and left. While I understand her angst she never returned to finish cleaning though I again called the desk and they apologized and said the room would be made and the Manager would call me the next morning. I came back late that evening to find the room in the same state. By then food and liquid left in the fridge had begun to seep out and I used the few towels I had left. The air conditioning had been off so there was an odor. I called the desk and again they would not offer another room, nor would they provide pillows or towels and the desk clerk was very rude. He said if I did not like the room they had a \"satisfaction guaranteed policy\" and the manager would refund in the morning. Notably this never happened The stench in the room was unbearable so I cleaned the mess they should have then opened the window and turned the air conditioning on to ventilate and cool the room and went out so it could air. As I passed the desk the clerk was in an animated conversation with another man using colorful language. Later I returned to my room and called down for a wake up call and a late check out. No wake up call came and I missed breakfast. I woke because housekeeping walked in again though there was a Do Not Disturb on the door. The clerk had not put in my late check out. I called the desk to complain again and and had a difficult time getting a late checkout though it is a benefit of the the rewards program I belong to with the chain. They did finally give me the late checkout. Though polite at this time, and though they did acknowledge the legitimacy and seriousness of my complaint the staff said they could do nothing to assist me and I needed to talk to the manager who was off property. Later I found this was not true. I asked for housekeeping to clean my room when I went out to eat and they refused saying I was checking out that day. Apparently clean rooms are not part of staying at this hotel. After an early lunch I finally found the General Manager. He was very polite gentleman from Korea I believe and shared a few nice stories about his homeland. He said how embarrassed he was about the terrible service, though in retrospect he seemed more concerned about an unauthorized person being behind his register with the night clerk than my problems. I explained how the clerk had said rather than deal with my problem I could ask for a refund but what I had wanted was the room clean and right not the money. He did offer to refund the room but suggested as it was a business stay and really did not benefit me, he offered a return stay. He was so gracious I honestly I felt this service was an anomaly and accepted his offer. \\The reason I accepted is the hotel is in a great location and the attached Japanese restaurant is outstanding. I ate there three times and enjoyed every meal and the extraordinarily good service. Sorry I cannot recall the name but if you do take the trouble to find it, try the lunch special. It mixes tempura sushi and sashimi and while not cheap is great food at a great value. There is also an unusual store there in the form of a quaint mountaineering and sportswear store. They staff there is very friendly and knowledgeable. I really enjoyed it and bought a few things. >When I left I felt my visit had been a trial but fairly good about the hotel because of the graciousness of the Manager. It seemed that he would make it irght. However it was a placebo, and apparently not an effort to do the right thing. A week or two later I called seeking to give them another chance as the Manager had requested and offered. As a matter of fact I was optimistic I attempted to book a weekend which would have resulted in two paid days in addition to the one he offered. The staff was very rude. Desk Managers represented themselves as the General Manager. One woman I spoke with said yes she was aware of the problem and would offer me a minor discount off of rack rate which amounted to significantly more then either my AAA or Choice Privileges would provide me.I called Choice Hotels and they offered me a contact and finally a transfer took me to to the business office only to miss the GM. I did reach the accountant who was a nice guy and promised to give my number of the General Manager. No one called. Had I booked through Choice I would have a recourse. Unfortunately I was not able to. Needless to say I would not recommend this hotel. > > --------------------- >", "Date": "December 24, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manteca, California", "Title": "“Boutique Style Hotel near Downtown LA”", "Author": "on-the-journey", "ReviewID": "UR21452297", "Content": "Some of the reviews here had me hesitant to try the Clarion. I'm glad I stayed there. The building is fairly old, but it has been updated nicely. My room had very nice bedding and furnishings. The hotel has an amazing Japanese restaurant, and is close to some other Asian restaurants as well. Probably not a great walking neighborhood after dark, but the garage has security and it felt very safe. Fairly close to the convention center and Staples Center. Only complaint was pretty minor -- there were a few ants in the bathroom.", "Date": "November 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Northern California", "Title": "“Shhh, keep this one a secret”", "Author": "inflatabill", "ReviewID": "UR21176616", "Content": "I read all the reviews, and took a chance. And I'm glad I did. I was working an event at the Nokia theater and needed to be within walking distance of the venue. The hotel is on the same street, about a mile away, which is close enough for me. OK, so the TV channel selection was limited, but I didn't go to LA to watch TV in my hotel room. It was still good enough to unwind before going to bed, and catch up on the news while drinking morning coffee. The underground parking lot was small, but the hotel's lot across the street was never full, even though the hotel was fully booked. The neighborhood wasn't Beverly Hills, but I never felt unsafe, even when walking 2 blocks to Rodeo (which I recommend) for late night Mexican food and margaritas. The room was clean and spacious, and the staff was excellent. I was there for three nights, and every time I went to the desk, they were friendly and professional and made me feel like they really cared about me. They even allowed me to check out late, after having car troubles. I will definitely stay there again. It's my new second home in downtown LA. Did I mention the staff was excellent?", "Date": "October 24, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Roanoke, VA", "Title": "“Enjoyed my stay!”", "Author": "garyDLIvp", "ReviewID": "UR20474871", "Content": "I was a little worried after I booked my room at this hotel and read some of the reviews on Tripadvisor. I guess that just goes to show that you can't (and shouldn't) believe everything you read. My stay was very good. I was lucky enough to reserve a king suite, which was actually two seperate rooms, a living room area and a seperate bedroom. Both rooms were quite spacious and both had a large LCD tv. I stayed at this hotel for 4 days and each day my room was cleaned to near perfection. My only suggestions would be to add a clock radio in the bedroom of the two-room suites and have maintenance change the HVAC filters. I did notice the front desk staff lacked uniforms and name tags and many of them seemed to be new employees, lacking some guest relation skills one would expect in the hospitality industry. The area is a mix of Latino and Korean cultures, but I found it to be quite interesting. There are many native restaurants in the area that served very good food. I did not see the adult porn businesses others have described and I felt quite safe walking around the area during the day and early afternoons. The hotel is only .8 tenths of a mile from the LA convention center and downtown LA. My rate was extremely lower than most of my friends rates staying in downtown at the high rise hotels. As a matter of fact I had a MUCH larger room than a friend had at the Marriott and my rate was over $100 less than his. In other words, I saved over $400 by staying a little up the road from the \"excitement\" of downtown. If I ever return to the LA area, I would not think twice about staying at the Clarion Downtown LA hotel. Thanks for making my first trip to LA a fun time.", "Date": "September 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Springfield MA", "Title": "“VERY GOOD--Will stay there again”", "Author": "ReviewTeam", "ReviewID": "UR19317321", "Content": "Having read the reviews on TripAdvisor, I was a bit worried about staying there. However, it was 1.5 miles /2.4 Km from Westin Bonaventure Hotel, at 404 S. Figueroa St., Los Angeles, where I was attending a convention (8/2-8/9/08). Also, I often stay at other Clarions and Comfort Inns. I took a chance and was satisfied. Though the Olympic Blvd area is a combination of Hispanic and Koreatown, the people staying there are families, business people and others on a vacation. I did not go walking in area as I used my car to get around. The Clarion Hotel Downtown, 1901 West Olympic Blvd. Los Angeles CA 90006 (213) 385-7141 is two blocks east of S. Alvarado St. It is mostly on Bonnie Brae Street. That is the entrance that you enter (or thru the parking garage). Unfortunately, there is only one marked handicapped parking space. There is some under the hotel parking (if you're early in) and the rest is across the street in a fenced parking lot which is well-lighted (your key controls gate). The parking lot is between an apartment building and another motel. And, there is a Korean church beside the hotel. There is a Korean restaurant on the corner and a Sushi restaurant beside the front entrance on West Olympic Blvid. Bonnie Brae Street is a quiet street. There is a night guard on duty in the hotel's parking garage and he has two video screens to watch the outside parking lot, the parking garage (he's right next to the indoor one), all of the halls, pool area, two large patios, lobby, etc. I felt secure. I was impressed that there were usually three hotel personnel at the front desk most times. And, the manager was nearby. It is a Korean run hotel. They are pleasant and always kind. When someone parked their car too close behind mine in the parking garage, two women from the front desk kindly directed my backing out of the space. I found the Clarion clean, nicely decorated and the beds are great for sleeping. There are two elevators for the three floors. That's nice if one is not working properly, which can happen anywhere. My room had a wide screen tv [although, not all rooms have wide screens], a 1100 watt microwave with a turntable, an excellent refrigerator, coffeemaker, iron & board, a gas-lift high back business chair with arm rests, a desk lamp and two phones (one on nightstand with dual lamps & AM-FM clock radio). Fortunately, they had used an extension cord that one would plug in the refrigerator and microwave or coffee maker. That way, the freezer was not iced up as it would be if it were constantly on. I wish some other motels would defrost their refrigerator's freezers! The fluorescent lamps (14 watts) need more wattage in the bulbs. They equal about 50 watts which is not enough to easily read by. 23 watts=100 watts which would be better. (Hopefully, they'll use cool white bulbs, not the warm ones, which are yellow. Note: 3500 K temperature rated bulbs are bright white without having the ultraviolet rays of full-spectrum. Those would be perfect). My room overlooked the pool area. There are some rooms with a balcony, chairs and a table overlooking the pool. There are also two other areas that have large patios with chairs and tables in a courtyard on the 2nd floor. I did have trouble connecting with a cell phone tower due to being in the pool courtyard. It is always good to carry a prepaid phone card to use with the land-line... The air filter was clean! The only complaint I have is that the heating system is central, although you can turn on/off the air conditioner which is above the entrance way in your room. Althought this was the first week of August, the nights were 67ºF/19ºC cool to cold depending upon you metabolism. I turned off the AC and the thin comforter kept me somewhat warm. The hair dryer turned on and placed on the upside down metal trash basket was my heater. And, for those who'd like some fresh air, the sliding glass window can be opened; although, there is no screen. The water from the faucet was very hot. They could turn it down 30 degrees and still satisfy everyone, while wasting less energy. Fortunately, they used a easy to figure out shower control. Throughout the Choice Hotels chain of 11 branded hotel/motels, the shower heads vary and can be confusing. I wish they would standardize them with a handle and face plate that shows blue color for cold with an increasing combo of blue & red color for warm then, red for hot. There is no free continental breakfast. You buy your breakfast there...or elsewhere. Local calls are free and internet access is free although, the computer in the lobby is $3.00 for 30 minutes.", "Date": "August 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“a great place to stay near downtown L.A.”", "Author": "Steve_and_Oonagh", "ReviewID": "UR18814471", "Content": "It is hard to find a good hotel near downtown L.A. that doesn't cost $300+ per night. I was pleasantly surprised to find this Clarion to be as nice as it was. Parking was easy and secure, the staff was friendly, the rooms are nicely equipped with good beds, comforters, two kinds of pillows, a quiet refrigerator, microwave and central air conditioning. The good-sized pool area was clean and the water warm. There are two courtyard sitting areas surrounded by the building. The room was quiet and the location is less than a couple of miles from downtown, Staples center and the convention center. They even have a breakfast buffet area ($7.99 per person extra). There are fountains and waterfalls in the lobby area and free, easy, fast internet access (but only in the lobby area). I recommend this hotel for families on vacation or business travelers needing a nice place to stay near downtown L.A. and the price is right, too!", "Date": "August 10, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Brisbane", "Title": "“Hotel was fine”", "Author": "weisken", "ReviewID": "UR16895589", "Content": "Found it very hard to get quality, affordable accomodation in LA. Location wasn't great, but was handy to food/shops and a (longish) walk from down town and public transport. Hotel was clean, staff were fine, bed very comfortable and spa a nice surprise.", "Date": "June 13, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Yuma, AZ", "Title": "“Great Price - Nice Stay!”", "Author": "kekai922", "ReviewID": "UR15485954", "Content": "We stayed at this hotel with much reluctance due to the reviews on this site. However I was pleasantly surprised after our first night. Hotel was reciently renovated and looks great once inside. Staff speaks many languages and was very helpful with directions to resturants, ect. PROS: Clean, quiet, inexpensive, Private secure gated parking with security guards. CONS: Small parking garage(private lot owned by hotel across the street), small bathroom, bed is not so comfertable, dresser looked a little old, not too many channels on TV, and NO free breakfast! All in all, great bang for your buck!", "Date": "April 30, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Leicester", "Title": "“Don't do it!!!!”", "Author": "JoanneLeicester", "ReviewID": "UR12771895", "Content": "Dreadful doesn't do it justice. Awful. Landed in LA for a stop over at the airport before commencing our tour of the Western US. Hotel is very close to 'adult' shops and the only dining in the location is Subway and MacDonalds. We arrived early evening and the reception staff were young and stood gossiping ingnoring us on arrival. No concierge's on site that I could see, lift was dismal, unclean. We were several floors up and when we arrived at our floor the doors opened to reveal trays on the floor in the corridors with half eaten dinners that had not been collected. I can only assume that due to the poor facilities most people used room service. There were trays piled on the litter bins. The room doors resembled prison doors, stark grey with peep holes. The decor was peeling, fraying, tired and dreadful. Our first night in the USA and I wanted to cry and leave. Appalling service, decor and facilities I would definately not stay again - Zero out of 10, the worst hotel I have ever stayed in.", "Date": "January 18, 2008"}], "HotelInfo": {"Name": "Ramada Los Angeles Convention Center", "HotelURL": "/ShowUserReviews-g32655-d1225375-Reviews-Ramada_Los_Angeles_Convention_Center-Los_Angeles_California.html", "Price": "$82 - $184*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1901 West Olympic Boulevard</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">90006 </span></span> </span> </span> </address>", "HotelID": "1225375", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/b7/44/b74463c971916194b4e5d75e8db0e8c03large.jpg"}}