{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Moscow, Russia", "Title": "“Good for 1 or 2 nights”", "Author": "fortuna7-7-7", "ReviewID": "UR125388054", "Content": "This hotel is good for 1 or 2 nights. It has good connecting with airoport Tegel - just 25 minutes by bus, that way I choosen it. It also good for people, who going to shopping, because there are a lot of shop nearby, including KuDaWe - the most famous department store of Berlin. Room was not too big, but OK And it was a little bit cold at the night.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "lancashire", "Title": "“Great location, good value for money”", "Author": "wayulooktonige", "ReviewID": "UR125118308", "Content": "Stayed at the Hotel Boulevard for three nights in February 2012. Personally, I could not have asked for a better location - U-Bahn station on the doorstep, Zoo Station just five minutes walk, Europa Centre and Ku'Damm shopping a short stroll away. Room was average and somewhat dated. Breakfast was great except we had to go round the corner to another hotel to get it. Most staff were reasonably friendly. Given its location, the price we paid was extremely reasonable.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Warsaw, Poland", "Title": "“Good hotel for one night”", "Author": "dentart", "ReviewID": "UR124442738", "Content": "Helpful staff. Small but clean rooms. Perfect localization. No parking.", "Date": "February 11, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“Good location, but noisy rooms that have seen better days.”", "Author": "Dub38", "ReviewID": "UR124383256", "Content": "The location of this hotel can't be beaten - it's on the popular Ku'damm just a few minute's walk from Bahnhof Zoo station. The rooms, however, are different matter - they need a total refurbish as does the carpet in the corridor.The noise from the street prevented me from getting a full night's sleep too. We had a breakfast in the Boulevard's sister hotel, the Azimut and it was excellent. Great buffer with lots of choice. This was the only highlight however.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Great location, hot room”", "Author": "Jellona", "ReviewID": "UR119944824", "Content": "The location of the hotel couldn't be better in (West) Berlin!! S-Bahn and metro stations are just next to the hotel, as well as a direct bus line to Tegel airport. Kurfürstendamm is the best shopping street in Berlin, and the biggest department store of Berlin (and Germany?), KaDeWe, is just a couple of blocks away. A lot of nightlife around, too... The room was clean, but there was maybe a slight smoky odor inside... A word of warning, though: The room was really hot on sunny days, even in October! No air condition. That wasn't a major issue for us, since during daytime we were walking around the city, and by night you was able to cool down the room by opening the window (probably impossible in summer). Staff was friendly, even though a bit slow at times. Breakfast buffet wasn't worth the money... but there are plenty of nice cafes nearby. Wireless internet didn't work. In short: Good value for money and great location.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great location”", "Author": "ChrisatSydney", "ReviewID": "UR119458528", "Content": "Location is great, on the Kurfurstendamm near the Kaiser Wilhelm Memorial Church, and also handy to U-Bahn (subway) stations and the Tegel Airport bus. Location can noisy, but the double-glazed windows block out most of it, and this light sleeper slept very well. Some guests may prefer a room that does not look out onto the street The breakfast is a hearty continental European buffet in a choice of two very pleasant rooms. Staff speak excellent English and are very friendly and helpful. The Boulevard will be my first choice for my next visit to Berlin.", "Date": "October 18, 2011"}, {"Ratings": {"Location": "4", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "2"}, "AuthorLocation": "St. Petersburg, Russia", "Title": "“bad experience”", "Author": "Daniel A", "ReviewID": "UR118258060", "Content": "tiny room with two beds was reeking chemicals used for cleaning, and the walls were dirty. no ventilation not to speak of air conditioning, and opening a window to noisy Kudammt was no help - it didn't bring much air. with my asthma couldn't stay even a night and had to leave. wi-fi didn't work so I had to go out in the rain to find wi-fi and get myself a room in a different hotel. really bad experience. wouldn't recommend to anyone. there are better hotels in this area for similar price.", "Date": "September 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Carlisle, United Kingdom", "Title": "“a pleasent hotel”", "Author": "fineman31", "ReviewID": "UR115740798", "Content": "this is the second time i have stayed at the hotel boulevard,the advantage of the hotel is it is centrally located in the kudamm.The breakfast is good and there was a good choice of selection,however the hotel could do with air conditioning as it was warm outside,also there was a lot of noise from the street below,but the staff were freindly and helpfull and i would recommend this hotel", "Date": "July 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ayr, United Kingdom", "Title": "“fantastic!”", "Author": "LorRod2011", "ReviewID": "UR103781055", "Content": "staff were lovely, couldn't have been nicer. food good, location fantastic. I would agree the hotel had a strange layout!!", "Date": "April 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "UK", "Title": "“Good for shoppers and zoo lovers!”", "Author": "marktheevildude", "ReviewID": "UR102922738", "Content": "Just got back from 5 nights in berlin at the hotel boulevard, chosen due to a good deal, and reasonable reviews. As mentioned before, the hotel has an odd layout, withe the reception and bar on floor five and the rooms floors 2-4. The rooms were average, they do need updating, with retro 80's decorations and fittings, but all seemed clean. Bed was ok, amenities were reasonable, the bathroom compact, with a step up into the shower which caused issues for me having a bad knee, Small TV on far side of the room from the bed, and mini bar with not stupidly priced drinks cheaper than the bar! Heating would be an issue, we had a hot few days resulting in widows having to be left open at night, and although we didn't have the noise of the street pidgeons and the area below with industrial noises meant it was easy to be woken, a/c definately needed. The welcome on the first night of the stay was very nice and helpful, but after that staff were more restrained, there's a nice rooftop terrace overlooking the shopping street below with the kurfurstendamm church memorial to one side, there was only a couple of times where other guests were about, which was a shame, as it could be a nice social point. The hotel seemed safe, although corridors were very dull and the lifts small and jerky. Outside is the berlin version of oxford street, lots of big retailers, so busy in the day, theres not a lot to do round the hotel other than the zoo and the history of berlin exhibition, few restaurants and bars, and its quite a while on the u-bahn to mitte with its bars and clubs. The hotel is write by the entrance to Kurfurstendamm station, with the U1 line(currently undergoing work), but zoologischer garten station has an entrance 30ms away and is served by the U2 and U9 lines with better connections zoo S-Bahn station is 10 mins walk away and is a much quicker way to get round the city. There aren't many supermarkets near, a small shop at zoo u-bahn, and a bigger supermarket at zoo s-bahn station for supplies. I would stay there again, but would chose to go for a more eastern area to be closer for sampling the night life without a huge trek back.", "Date": "April 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“Excellent”", "Author": "pastisbilly", "ReviewID": "UR101775299", "Content": "Incredible value for an hotel in such a central position. Two underground stations within 30 seconds walk, and the Zoo S-Bahn station a few minutes. All the shops of the Ku-damm outside the hotel. Comfortable rooms, lovely breakfast room and roof garden, patio-style, with views of the city. Can possibly be somewhat warm, but windows can be opened, and little inconvenience for the price of the hotel and its situation in the best part of the huge city. Please note that it can be a little difficult to find initially. The reception is six floors up, as is the breakfast room and bar. It is approximately directly across the Kudamm from the big store Karstadt, and a few yards from the entrance to the U-Bahn station Kufuerstendamm. I will certainly be returning in the autumn.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Somerset", "Title": "“excellent location, friendly staff”", "Author": "greenbank54", "ReviewID": "UR86251094", "Content": "The hotel is in an excellent location and we found the staff extremely friendly and helpful. As someone has already pointed out, the traffic noise is rather disturbing in rooms that overlook the main street - and the handle was missing from one of our windows which made opening and closing it difficult. another pillow would have made for a more comfortable night and was surprised to find no soaps or shampoo in the bathroom, rather awkward for anyone relying on it. However superb walk in shower. Breakfast excellent. Pick up an 'hop on hop off' bus just opposite the hotel entrance to get easily around the city. For location and reasonable price would certainly use the hotel again.", "Date": "November 7, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Newcastle, Australia", "Title": "“Not Recommended”", "Author": "rapture_74", "ReviewID": "UR85224615", "Content": "We had prebooked and prepaid for a room at this hotel, however we are unable to comment on the rooms, breakfast, etc, since when we arrived during the second week of October, there were no rooms available. We were transferred to another hotel of lesser quality - an arrangement that they have with Hotel Panorama. Apparently this is common practice for the Hotel Boulevard, and therefore I believe that the relevant Hotel Regulator should be notified with the view of terminating this particular business.", "Date": "October 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Irvine, United Kingdom", "Title": "“superb central location”", "Author": "iain2453", "ReviewID": "UR79958534", "Content": "We stayed here for my freinds stag doooo. The hotel does not cater very well for a stag do which is quite acceptable as it means the hotel can be the freindly place you would expect. The staff and location can not be faulted and it was clean and freindly and even over helpfull to the English speaker. Anyone with a need to find more about Berlin would find it hard to find a more central hotel with freindlier staff and a great location....... PS try the bar on 6th floor, bet you cant get a better veiw than the blue church at night....", "Date": "September 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sweden", "Title": "“Seen it best days!”", "Author": "1globetrotterSweden", "ReviewID": "UR76413537", "Content": "Great location with reception on sixth floor, This hotel has seen it best days, It feels quite tired and not too clean. I paid just 30 euro for my double room so I'm satisfied but I wouldn't stay more than a couples of nights. Nice beds though!", "Date": "August 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Aberdeen, Scotland", "Title": "“GREAT VALUE - EXCELLENT LOCATION”", "Author": "LynneM71", "ReviewID": "UR70974922", "Content": "We have just returned from a 4 day / 3 night stay at the hotel boulevard in Berlin. I cannot fault this hotel at all. We got a great deal and were not expecting that much to be honest so we got a nice surprise. The rooms are big and clean and the hotel staff are very friendly and really helpful. We had breakfast included and for a continental breakfast it was really good and had lots of choice. The only downside was that Berlin had a bit of a heatwave and with temperatures up around 38 degrees with no air con the rooms were very hot and stuffy. I don't think this is an actual fault as the averg temp in July should only be around 25 degrees so it was a bit of a freak occurance. We got a great bargain and would stay there again when we go back.", "Date": "July 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“location and price”", "Author": "brit-oz-lin", "ReviewID": "UR63666778", "Content": "For a budget-conscious leisure trip to Berlin this hotel is hard to beat. Location is great - lots of shops at the door and just around the corner from the Zoologischer Garten station from where you can get trains, buses and tours to just about anywhere, including Schonefeld airport. The rooms are fairly basic but adequate. We followed earlier good advice on this site and requested a room at the back. This meant avoiding the smokers rooms and the noise from the busy Kurfurstendamm shopping street. Unfortunately there is building work going on at the back of the hotel too (as with much of Berlin) and work went on throughout the night. Breakfast was expensive at 14Eu but plenty of cheaper options right outside the hotel. Just around the corner is a nondescript-looking Chinese restaurant called simply 'China Food' I think. We had a very tasty chinese meal there for around an incredible 5euros each - complete with complimentary apple schnapps to finish.", "Date": "May 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Weiden, Germany", "Title": "“Great stay, would happily return”", "Author": "Krisjand", "ReviewID": "UR52287301", "Content": "We were re-directed here after our initial choice of hotels was over-booked. However, once we arrived, we were pleased with the swap. The hotel is not large, but comfortable and quiet. The reception and cafe are all on the top floor, providing a great view of the area around, including views towards the Tiergrten area. We stayed for New Years and breakfast was lengthened to accommodate late-rising party-goers. The staff is friendly and accommodating and speaks very good English (helpful for when my German fails me). The only reason it is not an excellent is that our room was quite small and lacked obvious temperature control. Rather than a full/queen bed we had two twins. To be honest, the beds were very comfortable and my wife and I both slept well. This was made up for with a comfortably sized bathroom and a great view of the Kufuerstendam from our window. The roof-top cafe is also very good. and an excellent place to sip coffee and read a paper.", "Date": "January 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Omer", "Title": "“great location, good value”", "Author": "Rayush", "ReviewID": "UR51378962", "Content": "A nice, clean and centrally located (West Berlin area). The only drawback was the lighting in the room: simply not enough! Electricity savings? Otherwise - very good.", "Date": "December 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Bristol", "Title": "“A good location but noisy”", "Author": "CalBristol", "ReviewID": "UR51055976", "Content": "A short walk from the Zoo Station, the hotel has an excellent location at the start of the Ku'Damm and couldn't be better placed for sightseeing with the metro station right outside. However, the location does have its drawbacks; my room was located at the front of the hotel which meant 24 hour traffic noise which even got through the double glazing! It was also a smoking room (even though a non smoking had been requested) and therefore there was a nasty smell of stale tobacco smoke; the only way to get rid of the smell was to open the window (there is no air conditioning in this hotel) which meant even more traffic noise! The non smoking (and quiet rooms) are at the rear of the hotel so if you make a booking, specify that's where you want to be. The reception, bar and breakfast room are on the top floor; the breakfast room overlooks the rooftops of Berlin and there is a small roof garden for use in warm weather. Breakfast was good with plenty of choice and very good service. The rooms are basic but quite spacious with plenty of storage space, mini bar and safe (mine wasn't working) but the lighting is poor. There are no tea and/or coffee making facilities. The tiny bathrooms are marble lined with a good size shower cubicle. A good basic hotel for exploring the city but you'll only get a good nights sleep if you get a room at the back!", "Date": "December 11, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Australia", "Title": "“Nice basic hotel in reasonable location, but small room and couldn't get internet connected”", "Author": "Gandalf321", "ReviewID": "UR47078269", "Content": "POSITIVES. We liked the location. It is on a major shopping street, Kurferstendamm, very near the Kaiser Wilhelm Memorial Church (which is left bombed out as it was, as a symbol of the consequences of war). There are lots of interesting shops and restaurants nearby. We really liked the Marche restaurant that was almost next door. All the food is set out buffet like, and you can select what you want. The hotel basics were fine: the room was clean, warm enough, the breakfast buffet was adequate (nothing special) and the beds were comfortable. We had a room in the back of the hotel and it was very quiet. NEGATIVES. The room was small, with only one chair even though it is a room for two people. One problem was how the hotel was unable to deliver on the free internet it claimed it provided, and was unhelpful with our problem of not being able to get connected. At first one person at reception simply replied “I don’t know” when I said how could we get the internet working. I tried another person who insisted it must be our equipment’s fault, because he had no other complaints. I responded that our laptop PCs picked up the wifi at every other hotel we’ve used without any trouble, but nevertheless if it is a problem with our PC setups can you tell us how to fix it. He said no, he couldn’t help us, because they couldn’t handle customers’ computers. I would have liked them to have a printout stating how to connect, but they didn’t. It also would have been nice if they had one desktop PC in the lobby that hotel guests could use, as some of our other hotels have had, but they didn’t. For us in this day and age we highly value internet connection, so we would not stay in this hotel again. For someone who got a good price on this hotel, liked the location, would be out of the room all day, and didn’t require internet, this would be a good place to stay.", "Date": "October 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Liverpool UK", "Title": "“Location, Location, Location!”", "Author": "jeremiahLiverpoolUK", "ReviewID": "UR40888756", "Content": "Great place to stay - everything on your doorstep. Great transport services nearby. Numbers 100 and 200 buses make sightseeing tours unnecessary. Plenty of quality fast food and pastries nearby. Hotel excellent. Great breakfast and service. Good secure rooms.", "Date": "September 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "ireland", "Title": "“Great Hotel”", "Author": "happyaslarryIreland", "ReviewID": "UR32911001", "Content": "This Hotel was excellent. The staff were extremely friendly and they all spoke English perfectly. It is only a five minute walk from the zoo train station. The Zoo located across from the rail station is well worth a visit. The express train from the Airport stops at the Zoo train station. There is a fantastic lunch trade restaurant located two doors from the Hotel. It is called Marche (there is also one at the Berlin Airport so it is probably part of a restaurant chain.) We came upon a lovely Italian restaurant a few blocks away from the Hotel, it is called Doro ( Restaurant, Cafe, Steakhouse) Turn left on exiting the Hotel and cross the road it is maybe the second or third turn to the right. We also went on one of the History tours with Chris ( Berlin Walking Tours ) this was the highlight of our 5 day trip. We went to Sachsenhaussen Concentration Camp outside Berlin. We went on a Sunday, they meet at 10.00 a.m. outside the Zoo Station. They are very reasonably priced and you also need to buy a day rail ticket ( the tour guide will show you where to buy it I think it cost around 7 or 8 euro). I would highly compliment Chris the tour guide, he made the tour very very interesting. Berlin is a fantastic city and I would recommend it. The 7 Storey Ka- Da -we shopping complex is a must to visit .The sixth floor food emporium and top Storey restaurant floor have to be seen to be believed.", "Date": "June 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Casteau", "Title": "“Good deal, Clean and Great Breakfast”", "Author": "Mainstr11", "ReviewID": "UR31958772", "Content": "A solid Hotel in a great location! Stayed there for exploring Berlin with visiting family. This is a quality place; clean, safe, and reasonably priced.", "Date": "June 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Reliable Choice”", "Author": "freekicker", "ReviewID": "UR26432288", "Content": "Right in the center of West-Berlin, facing the famous Memorial Church. Zoo rail-station nearby is good for transport to airports as well as within the center of East/West-Berlin (S-Bahn, U-Bahn). Excellent value considering the central location on Kurfürstendamm / Zoo. Friendly welcome (reception in 6th flor / elevator), carefully attended hot buffet breakfast, delcious pastries in the afternoons, drinks with a view in the evening. Rooms would need some redecoration, but you get all you need. New Azimut chain bought this place in 2007 in order to relaunch it as middle class-budget hotel. Owns also Belmondo hotel on Kurfürstendamm.", "Date": "March 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Belleville, Illinois", "Title": "“Great Location!”", "Author": "Luvs2laff", "ReviewID": "UR25082482", "Content": "If you’re looking for glitz and glamour then this probably isn’t the hotel for you. However, if you’re just looking for a decent hotel in a great location and an even greater price then this may be for you. The Hotel was very easy to find from the airport, we took the S9 from Schonefield and got off at the Zoological Station and the hotel was just a short walk from there (maybe 5 minutes). Also, this is not a Best Western, but I think it use to be as you can still see the outlines of what use to be a Best Western logo. The reception and restaurant is located on the 6th floor which is different, but check in and check out was easy. This hotel is old, but overall it was very clean and served its purpose. I wouldn’t recommend staying here if you plan to spend a lot of time in your room. The location is phenomenal! Close to the U/Sbahn and you are right in the mix of shopping and great places to eat. I highly recommend visiting the Irish Pub located in the Europa Center-we ended our nights there every evening and had a blast drinking and listening to the band. We had a double room which was very spacious and offered the basics. The bed was comfortable. The room was extremely warm so we had the window open a lot. The room has a mini bar as well with reasonably priced drinks and snacks. The breakfast is a traditional European breakfast with cereals, cheese, meats and breads. They also had eggs, sausage and bacon and a few other things – just don’t expect a smorgasbord and you’ll be fine.", "Date": "February 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Great location excellent value for money”", "Author": "Spainshdreamer", "ReviewID": "UR22389887", "Content": "just returned from Berlin & stayed in Boulevard hotel. It was in an excellent location, the rooms were clean (if a little warm), nice breakfast, friendly & helpful staff - could not ask for more for a short break, we got a special offer when we booked '3 nights for the price of 2' would defintely stay here again", "Date": "December 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Manchester", "Title": "“Good Cheapish Hotel”", "Author": "NathanGunn", "ReviewID": "UR21980595", "Content": "Just returned from a 3 night stay at the Hotel Boulevard. Our party had 1 double room and 1 twin room booked. Our double room was big and spacaious whilst the twin was very small. My review may have changed if we had stayed in the twin but luckily we didnt. Check in went fine, great location near the Zoo station with access to the S and U Bahn. Rooms clean, reception very friendly breakfast OK. No complients from me. Would go back to the Hotel Boulevard.", "Date": "November 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bangalore, India", "Title": "“Very good Hotel indeed !”", "Author": "vinn_2k", "ReviewID": "UR21618171", "Content": "Stayed at the Boulevard from the 25th Oct -28th october. Booked it through my travel agent here for EUR 83 . The hotel was great value, superb location and I really enjoyed my stay here. Here are my views in favour of the hotel and not in favour of.. In favour: -Superb location, walking distance from the Zoo Station ( 10 minutes),on the main shopping road where everything is just 2 minutes walk away. Karstadt the department store is opposite and the upmarket KA A VE is just 5 minutes away. Its right next to Kaiser Wilhelm memorial with lots of food stalls around, so no problem absolutely for food. -The hop on hop off tours bus starts right in front of the hotel -Very comfortable rooms, very good toilet, and absolutely nothing to complain about. Tv, safe and minibar in the rooms. -very polite staff at the reception. My tv and safe were not working initially, and they had it fixed by the time I returned from my tour without a second reminder. -Housekeeping services were commendable -great breakfast, no compalints here too. -There is a One Euro shop on the road behind the hotel, just beside the Kaiser Wilhelm memorial with some good buys, I got a couple of red and white italian wines for just a Euro ! A very good Chinese takeway too nearby with a large portion of chicken fried rice or noodles for Eur 2.50 each. Not in favour.... -the very slow moving lift, and a tiny one at that -very soft pillows... but except for the minor hickups, I think this is a great value hotel in a superb location !!!!!! An oh, Berlin is a fabulous city. The best amongst all of those I visited - Frankfurt, Cologne, Dusseldorf, Bonn and Munich.... I fel 3 days just wasnt enough to see the sights...", "Date": "November 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cumbria, England", "Title": "“Boulevard Hotel - you're welcome”", "Author": "ICEll", "ReviewID": "UR19786092", "Content": "We recently stayed in the Hotel Boulevard, Berlin for 1 week. The location is brilliant. For transport, it is near to the Zoo train station, bus stops, and underground. The hotel is very clean and comfortable. The staff are extremely helpful and friendly. They arranged transport for us and even set out a special breakfast table when it was my wifes birthday. The reception, breakfast room, and bar are situated on the 6th floor. They offer an excellent buffet breakfast which sets you up for the day. When you return from your day out, you can sit out on the rooftop terrace and have a pleasant drink and look down over the square at Kaiser Willhelm church. Our room was on the 2nd floor at the front of the hotel. The room was very spacious and was kept very clean by the hotel. The beds were very comfortable. There was a stocked minibar and security safe in the room. When we return to Berlin (because you cannot see it all in 1 week) we will definitely stay at this hotel again. I would recommend it to anyone", "Date": "September 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Essex", "Title": "“Great Location”", "Author": "stevie70", "ReviewID": "UR17026135", "Content": "A great location, close to Zoo station and the 100/200 bus which is better than a tourist bus ride through Berlin. The rooms are small and clean, apart from the carpets which have seen better days. Breakfast was good and can be had on the roof top terrace. The staff were very helpful. However... no Air Con in the rooms and we arrived on a very hot day which led to a sleepless night. The room was on the main Ku'Damm and with the window open was very noisy because of the traffic and 'street entertainers/drunks/boy racers. That said, in the morning the reception staff were very helpful and moved us to a room at the back. Overall a clean and convenient place to stay.", "Date": "June 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "warrington, england", "Title": "“loved this hotel”", "Author": "cazjacko", "ReviewID": "UR15408396", "Content": "we booked this hotel for its location. it is right in the middle of the centre of berlin, you could almost touch the church and zoo station is one block away, from where you can take a train to anywhere in germany. as soon as we arrived we were met at reception by the most friendly smiling man [sorry i didnt get his name] he spoke great english and was most helpfull. the room was great with views onto the main boulevard. the windows were large and opened fully so although there is no air conditioning you can open up the massive windows if you want. the room was clean, it had a mini bar and in the bathroom there was a hairdryer and power shower. the hotel has a 24 hour bar if you want it, and the all you can eat buffet breakfast was great. especially sitting out on the rooftop terrace in the sun watching the world go by below. they had a special of 10 euros while we were there for breakfast which was good value. this was my third visit to berlin and this was the best hotel yet. i cannot fault it. for what we paid [approx £50 a night for the room} if i could go back next week i would. we loved the hotel boulevard! and we loved berlin!", "Date": "April 27, 2008"}, {"Ratings": {"Cleanliness": "2", "Overall": "3.0", "Value": "3", "Service": "5", "Rooms": "2"}, "AuthorLocation": "New York", "Title": "“OK Hotel in great location”", "Author": "Mary42", "ReviewID": "UR5462364", "Content": "I stayed in this hotel for 2 nights recently. The staff could not have been nicer and the location was very good, central to everything. However, the rooms are very basic and in need of updating, there is no AC and rooms on the front of the building are very noisy. Breakfast is available for 15 euro but not worth it.", "Date": "July 13, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "England", "Title": "“great hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR5078935", "Content": "I stayed there for 4 nights during my visit to berlin and where it's situated is perfect, right on kurfustendamm and situated right next to the kaiser wilhelm church, sitting on the roof balcony on a night having a glass of wine looking over onto the busy street is lovely. i thought the room was quite nice and spacious for a standard 3 * hotel and the bathroom was well equipped as well, it also has a safe as well, so you can put your valuables in there when you go look around the city. the bed was also a quite comfortable as i went with my fiance and shared a double bed. when getting around berlin i mainly used the buses when i was there and it's very reliable and cheap to use, they also come every 10 minutes so that was very good. however i thought on a night time, there wasnt as many nice restaurants, as i saw some on potsdamer platz, so you may have to travel in order to go to someplace nice. but overall i thought the hotel was very nice and i would definitley go stay there again.", "Date": "May 16, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "London", "Title": "“Disappointing”", "Author": "A TripAdvisor Member", "ReviewID": "UR4997028", "Content": "Well located next to Zoo Station and in the best shopping district of Berlin. Unfortunately that is where the benefits end. The hotel advertised and guarnteed on the booking confirmation that the two rooms we booked would have 'king size beds' only to find that they clearly promise everyone this and both of our parties were both left with twins. The lift from ground level can only take 3 people with no luggage. Clearly a large inconvenience having sometimes lengthy waits for the back-log to clear. The rooms are small and pokey, shower gel was never replaced and daily cleaning was well below par. With so many hotels in this area it is hard to recommend anyone give them their custom.", "Date": "April 23, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Ireland", "Title": "“Enjoyed my stay at The Best Western”", "Author": "dipso", "ReviewID": "UR4020840", "Content": "The Hotel is centrally located next to a metro stop and about 400 metres from Zoo Station. The rooms are a good size and are equipped with all the standard features of a three star hotel. The buffet breakfast was very good and included a full range of hot and cold foodstuffs together with a good selection of fresh fruit and drinks. I stayed in the hotel early September and found the lack of airconditioning a problem. The problem was resolved when I moved to the rear of the building which didnt take the heat of the sun. I stayed for five nights in a double room with breakfast for £237. If you obtain a similar offer I would definately accept.", "Date": "October 13, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Irvine, CA", "Title": "“helpful staff”", "Author": "A TripAdvisor Member", "ReviewID": "UR2326101", "Content": "Nice hotel located in the center of formal west Berlin. Very convenient to take bus 100 or 200 to all the major points of interests. Also close to S-ban and U-ban. Excellent buffet breakfast included in room rate. Very helpful staff brought us a fan and crib. Very quiet if window is closed. Only drawbacks are 1. without air conditioning it can be hot. 2. Parking garage is not attached with hotel.", "Date": "July 28, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Voelklingen, Germany", "Title": "“stay in the middle of the middle”", "Author": "A TripAdvisor Member", "ReviewID": "UR1153441", "Content": "A perfect place to discover the city. Excellent breakfast buffet with a fantastic view down to the main street Kurfuerstendam. Public transportation nearby. A foodwalk away from KaDeWe (Mall) and the Europa Center. Rooms are just standard but clean.", "Date": "July 30, 2003"}], "HotelInfo": {"Name": "Hotel Boulevard", "HotelURL": "/ShowUserReviews-g187323-d1227337-Reviews-Hotel_Boulevard-Berlin.html", "Price": "$56*", "Address": "<div class=\"amenFloat\">", "HotelID": "1227337", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/c7/8d/c78dcf3e463a90b54fc2a1066ee1113b4large.jpg"}}