{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“great for a brief sleep over...”", "Author": "jayman224 Posted by an Accorhotels.com traveler", "ReviewID": "UR128353966", "Content": "A great location and spot for a quick sleep. The rooms whilst not much bigger than a shoebox are very well appointed with separate bathroom. The front desk service was good. the hotel is so compact that my bag was stored for me before checkin in the disabled toilet.", "Date": "April 22, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Rotorua", "Title": "“Central and clean....”", "Author": "JaxxRotorua", "ReviewID": "UR128214624", "Content": "Room was small but you expect that with the ibis. Was clean and tidy and so central to everything.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“A cupboard, not a room!”", "Author": "Jackie J", "ReviewID": "UR128199875", "Content": "We could not believe the size of our \"standard\" room. With a lovely foam queen mattress, we had about 8 inches spaces either side of the bed, with the ensuite so close to where we slept that we could have touched the toilet with our legs if the door had not been there. Such a very small room, with no ventilation, could not wait to leave. Staff friendly, services good, but size of room has to be seen to be believed.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Excellent stay, close to everything!”", "Author": "AGaussie", "ReviewID": "UR127972343", "Content": "What a grea hotel to stay in for some great time away in Sydney! So close to the harbour with great restaurants. Great reception staff - very helpful - and fabulous, new, clean rooms. Highly recommended.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Townsville, Australia", "Title": "“Stay in Sydney”", "Author": "Juany63 Posted by an Accorhotels.com traveler", "ReviewID": "UR127913119", "Content": "Really enjoyed the stay at the hotel. Staff were really friendly and helpful! The room was a tad small but for my needs it was great.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Luganville, Vanuatu", "Title": "“Just what we needed”", "Author": "SouthSeasAmerican", "ReviewID": "UR127809240", "Content": "The location is the main thing. My wife and I had important business to do in the Sydney CBD, and this was in walking distance of the offices we needed to visit. It is also three blocks from the train station and one block from King Street Wharf on Darling Harbor. The room was small but clean. The desk lamp did not work but I did not want to interrupt my paperwork to get it fixed. The staff helped me resolve a credit card mix-up and they helped me get some photocopies made when I needed them late at night. They did not charge me extra for my infant daughter. It seemed to be one of the best values in the very high-priced CDB. I give them a 3 for facility but a 5 for service and a 5 for location.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Palo Alto CA", "Title": "“Good enough for a night or two”", "Author": "BruderLustig", "ReviewID": "UR127566951", "Content": "Stayed here for 2 nights in December; yes the room was small but kind of cozy; despite the tightness there was still room for a coffee/tea maker ; like it. Can't complain about the location ; very central and within easy foot walks to either harbour area. Nice restaurants/ delis around in the neighborhood for breakfast/lunch or diner. so overall, pretty good value to explore this expensive city.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canberra", "Title": "“Start of a Cruise”", "Author": "Monegeetta", "ReviewID": "UR126989880", "Content": "We stayed one night before going on a cruise to NZ. The rooms were small, clean & comfortable. Breakfast was $20AU for all you could eat, very good value and the range is excellent. The Hotel is close to everything, shops, Darling Harbour and the rail network. This is the 3rd Ibis we have stayed at and so far we have not been disappointed. I booked and paid online and luckly brought a print out showing I had paid for the 3 rooms as the young lady on the front desk tried to say we had not paid. I gave her the print out and left her to correctly read her computer screen whilst we went and enjoyed our Cruise on Holland America. Steve", "Date": "March 30, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Well priced, but a little noisy”", "Author": "esmari3", "ReviewID": "UR126717473", "Content": "We stayed here for 4 nights in March 2012. When we checked in, we had a \"touristy\" question and the person manning e desk didn't know much. It was a little disappointing. The room is small, but clean and has everything you need for a short stay. We stayed 4 night and although the towels were changed, the bed was never made properly and the sheets not changed once. I'm not sure how long you have to stay for before that happens? The hotel's location is absolutely wonderful - easy walking distance to Darling Harbour, The Rocks and Circular Quay, but it is right next to the freeway flighover and after spending the first night with little sleep, I bought ear plugs on day 2 and had a much better sleep. Every sound is also heard from the rooms above and next to you, so ear plugs are recommended. All in all, we'll probably recommend people to stay there since it is very affordable.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Alcie Springs, N.T.", "Title": "“Out to see the big smoke”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR126517836", "Content": "Wonderful location in the city, central to everything. easy walking to the harbour and Darling Harbour and the Monorail.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“Don't expect a great night sleep”", "Author": "aussietraveller12323", "ReviewID": "UR126481475", "Content": "The location was good and the rooms were what I expectec (with an amazing shower). However if you have a room along the on-ramp for the freeway, don't think you will get much sleep. Request a room on the opposite side and your experience may be more enjoyable", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Compact rooms but great service!”", "Author": "whiteduck", "ReviewID": "UR125670193", "Content": "Room was compact, modern and clean. From arrival through to departure we cannot fault the front-desk staff and restaurant manager; special thanks go to Patrick and Belinda for helping tracking and forwarding my driving licence. Well situated close to Darling Harbour (5 minutes) and a great coffee shop next door.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great value”", "Author": "Royzer79", "ReviewID": "UR124944111", "Content": "Some people make me laugh, hotel really nice has everything you want, normally when people stay in hotel your either there for holiday short brake in sydney, your not going to spend the week in your room or weekend, end of the day once the room is clean and bed is comfortable wat more can you ask for, a lot of people that leave bad reviews here I think they should stop look at \"keeping up appearances\" hyacinth and Richard ha ha ha ha ha ha", "Date": "February 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“best ibis ever”", "Author": "patrickjamins", "ReviewID": "UR124724334", "Content": "i stayed in few ibis hotel in my life but this one Wow!!! perfect nice room,friendly staff, big rooms, very clean, ipod duck, nice vue on darling harbour( still small windows) but very cosy the only down side will be the charge on wifi and some tv channel.over all i relly enjoyed my stay there", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Excellent staff, modern and clean rooms - great location!”", "Author": "Brendan M", "ReviewID": "UR124692147", "Content": "I stayed at the Sydney Ibis Kings Wharf in November 2011 on a business trip. The hotel is in an excellent location, just a 30 second walk away from many restaurants on Darling Harbour. The rooms are not very big (but perfectly adequate), and very clean and modern. The bathroom was also perfectly fine. The staff were excellent and all my questions were answered with a smile! I would happily stay here again.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Geelong, Australia", "Title": "“Small, small and oh did I mention small!”", "Author": "SorchaOS", "ReviewID": "UR124592045", "Content": "I chose this hotel due to it being new, good location and reasonably priced. I wasn't disappointed with the location, it's very easy to get around from here, there are buses all around and it's literally a 2 minute walk to the Darling Harbour precint. However, for me that's where the positives stop really. When I arrived, the guy behind reception was very welcoming and polite, I cannot fault him for that. However what I can fault is how he told me I was \"lucky\" that they had rooms available when he could not find my internet booking. I had a booking confirmation therefore I get a room. Whether your computer system is \"synced\" correctly or not is not of my concern and I don't really think it was an appropriate way to address the issue. He also repeatedly kept asking if it was \"just\" me for the room. It felt very pointed, and when I got to the room I realised why for there is no possible way that there is a smaller room in that hotel to the one that I was given. I did know going in that the rooms were compact but for someone that is staying more than one night I couldn't understand why you would put them in the smallest room? I have seen pics on their website and not all rooms are that small. There was barely room to put a suitcase down and manouver around with any ease or comfort. I found the actual room to be quite grubby. For some reason there was always dust on the floor in quite big clumps and I hate this new lazy thing hotels seem to be doing of just putting a sheet over a doona with no cover, it feels very unhygienic to me. When the room above me used their bathroom, a very high buzzing noise would echo throughout my room at any time of the day or night, at first I thought I was going crazy!! Also my room was right outside a door that was marked 'staff only', which apparently must have been some kind of garbage room as at 7am one morning someone was outside there rustling and crinkling plastic bags to within an inch of their life. Small issues yes, but as a collection they all contributed towards bad nights sleep in this hotel. Be warned, they do not have room service - if you order any food or drink you have to go down and pick it up yourself!! And if you want to store your luggage after check out they will charge you $7 for the privledge, either that or leave it for free in an unsecured corridor....The whole place just gives the impression that customer service is not their first priority. I won't be back.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Leicester, England, United Kingdom", "Title": "“Stay at the other ibis in Sydney!”", "Author": "Fairycake58", "ReviewID": "UR124538277", "Content": "On a recent holiday to Australia, we stayed at all Ibis hotels in Adelaide, Melbourne and Sydney. This one spoilt the last leg of the stay. The room was apparently a 'Queen'?Well, I'm glad I didn't bring my cat to swing round....We overlooked the huge office blocks and we could see them and they, us. The window was depressing in size, maybe 2 foot by 6 foot, with no view other than the office workers. The cleanliness was very poor, we were not hoovered for the whole 6 days! The manager was very patronising in manner, although other staff, more friendly. The only good point is that the location is good for the harbour, but I would advise paying more and staying at Darling harbour. My advice, if you're staying for one night, okay, more than that, find a park bench...", "Date": "February 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "CAIRNS", "Title": "“Great Location, Small Rroms, very,very clean”", "Author": "Travellor69", "ReviewID": "UR124414082", "Content": "If you need to be near King St Wharf then this hotel is great...I loved that the floors were not carpeted....the rooms are small but very functional. I can't believe I paid almost $300 for a night here - but that's what supply & demand is all about...! Would I stay again...? If I needed to be in this part of the city, then absolutely YES...!", "Date": "February 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Canberra", "Title": "“Handy city centre sleepover”", "Author": "Beckham63Canberra Posted by an Accorhotels.com traveler", "ReviewID": "UR124398827", "Content": "The hotel is very well located in the city centre with several good coffee shops around the corner and wide variety of restaurants within five minutes walk on Kings Wharf. The rooms are small but very clean and quiet and adequate for a solo business overnight stay.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Warwick", "Title": "“Enjoyed our stay in Sydney”", "Author": "diddleydi", "ReviewID": "UR123510712", "Content": "Ibis was a great base for our stay in Sydney, we were within walking distance of so many things and the staff on the front desk were very helpful. The room was compact but we were not in it much, and the shower was the best one of our whole trip. There is also an airport shuttle they can arrange for you for $14, wish we had known about this and not taken the smelly/dirty train from the airport for $15 - so bear this in mind if you are flying in and staying. Would definitely recommend if you just want somewhere clean, comfortable and close to everything.", "Date": "January 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "canberra", "Title": "“Ibis King street wharf.”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR123136810", "Content": "Good hotel. Good rooms, although I miss a comfortable seat where you can sit and read. Good value breakfast. Bit of a shock to have to pay to leave cases after checkout. I assume this is learned off the budget airlines.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Perth", "Title": "“Clean Hotel at a Reasonable Price”", "Author": "Freoshocker", "ReviewID": "UR122849344", "Content": "This hotel is ideally located a short walk fron Wynyard Railway station so is easy to get to from the airport and a short walk from King Street Wharf, Darling Harbour and The Rocks. The hotel whilst basic (as you would expect from an Ibis hotel) is clean and a spacious bathroom. Breakfast is available, there is a limited bar but with numerous eateries nearby you are spoilt for choice for eating.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Perfect Location”", "Author": "Tony S", "ReviewID": "UR122737429", "Content": "This is a friendly and very welcoming place to stay. All staff were friendly and helpful. The rooms were very clean and well maintained. Two streets back from the King Street Wharf and a direct route to the ferry station. Very convenient to the Darling Harbour precinct and the casino. An easy walk to the Rocks, Circular Quay and Opera House. Outside noise was not noticeable and the bed was comfortable.The price was very reasonable and represented good value for money as opposed to the outrageous prices at other establishments. We look forward to staying there again.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Great Location”", "Author": "mundo61", "ReviewID": "UR122424599", "Content": "My wife and I stayed here for 7 nights over the Xmas and New Year break. The location is great, very close (less than 200 metres) from everything Darling Harbour has to offer. The city centre is also close, well within walking distance. The staff were very friendly and helpful, check-in and out were a breeze and they were happy to help out with any enquiry that we had. A fairly typical Ibis property, but the rooms including the bathroom were smaller than any I have encountered before, broom cupboard size. The cleaning of the room left alot to be desired, a coffee spill on the bedside table was still there 2 days later and was only cleaned cos we did it ourselves and the floors were often not cleaned. The sheets weren't changed for 6 days and we had to ask to get them changed for the last night. I found this disappointing as the daily charges for the room varied significantly. The first few nights Dec 26 - 29 were the standard rate of around $108.00/night, that price climbed to over $230.00 for the next night and to $480.00 for NYE and back down to $230.00 for the last night of our stay. For $480.00/night I expect clean sheets and a cleaned room. I rate the value as poor because of the price gouging over NYE", "Date": "January 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Bridge Climb Stay”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR122042805", "Content": "Nice motel in central location. Room was particularly small although clean and modern. Window was obscured by building next door but had two roller blinds which gave filtered light and no light- a novel idea. Parking our car was expensive, however we made use of the full 24 hours as we went shopping before checking out. Check out time was 11am which is a brilliant idea.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Avarage”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR121863645", "Content": "The hotel staff were very friendly and helpfull at all time the room a bit small cleaning was avarage handy to most things and handy to the places I had to get too the bed a bit small may you should consider some king size beds as people over 6 foot hang over the edge overhall its nearly the same as Formula one but cheeper than Mercure wich is double the price in some instances", "Date": "December 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New Delhi, India", "Title": "“good value for money”", "Author": "shar_mihir", "ReviewID": "UR121754225", "Content": "Excellent location, friendly staff. Small room is made up by helpful staff and awesome location next to Darling harbour... all major locations / offices at walkable distance. Breakfast is quite expensive though for its actual menu, hence didnt have any", "Date": "December 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "darwin", "Title": "“Compact and clean”", "Author": "RockyDarwin", "ReviewID": "UR121511671", "Content": "Rooms are very small but clean. Love that they don't have carpet. Dining options in darling harbor close by. Service nothing special but just okay. Bit of traffic noise but would stay again.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Sydney, Australia", "Title": "“GROSS!”", "Author": "michelle n", "ReviewID": "UR121375477", "Content": "my room was disgusting, there was dried up vomit on the bathroom door and crumbs under our bed, a bit of a walk from darling harbours main attractions.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "wyee point", "Title": "“christmas party stay”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR121230571", "Content": "Room was modern and clean. How ever the breakfast was far from what I would expect especically the sausages which had a wite fatty substance ozz out when cutting them and it squirted over my clothing. After seeing both my self and Wife no longer felt hungrey. It was not advertised that it would cost an additional $40 for parking over night.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Gurgaon", "Title": "“Great location spoilt by shoe box size room”", "Author": "ansh9899", "ReviewID": "UR121060908", "Content": "Stayed at this hotel with family - wife and a teenage son. Good things first - the location is the best one can think of in Sydney. It is right at Darling Harbour, very close to Wynyard Railway station, walking distance to Opera House and Harbour Bridge, Curcular Quay and City Centre. The best locations that Sydney can offer, IBIS Shelley Street has that. The staff is very courteous and helpful. Many of our requests were complied with promptly. The check-in and check out was a breeze. The problem starts with the rooms.The rooms are very small size. The only choice for beds is Queen or single. The rooms are more like shoe boxes.The bathroom is pathetically small - so small that if you wish to scrub yourself and therefore move your hands in the process, you are most likely to get scratch marks on your elbows because they will invariably brush against the walls of the bathroom, it is so small !! The location is brilliant but is spoilt by a narrow slit of glass which is qualified as a window. You barely get to get one eye into the slit to see outside the room. The slit does only one purpose - it allows the light to waft into the room, making your sleep quality poor. Then we get down to breakfast. The charges for full breakfast at AUD 20.0 doesn't do any justice to breakfast spread. And to top it all, the charges for the room were AUD229.0 per night, which is astronomical by any standards.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "newcastle", "Title": "“Bad experiance”", "Author": "keithNewcastle Posted by an Accorhotels.com traveler", "ReviewID": "UR120984494", "Content": "On our arrival we ended up in the building next door. due to the only car park was available at that end of carpark.We were locked in that building for 20 minutes till security gard came allong and let us back into your building.He was not cranky with us but very cranky with IBIS as he said this had happened several times before. Room was very small and parking expensive $315:00 for this accomodation was far to expensive. Could have stayed at Wentworth for this ammount Not value for money. I have been an ACORR member for 11 years and certainly would not stay in that hotel again.", "Date": "November 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“ooh so convienient”", "Author": "SAINT58 Posted by an Accorhotels.com traveler", "ReviewID": "UR120756664", "Content": "Ideally situated acouple of blocks to Central station ,block from Darling Harbour precinct and an easy walk to the city centre. Great staff and very helpful - suited to business travel Many coffee shops and eating establishments close by", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Newcastle, United Kingdom", "Title": "“Sydeney and Perth Trip 2011”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR120705238", "Content": "Was a fantastic hotel location and the front desk staff couldn't have done more, especially Rob who was invaluable when it came to knowledge of the city. Furthermore he was a fantastically genuine and nice guy. Thanks to all the other staff too who were equally brilliant. Cheers!", "Date": "November 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Convenience”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR120365999", "Content": "Great location to stay if you are going on a harbour cruise, helpful and friendly staff. Parking a bit of a challenge, however subsidised parking was available across the road. Breakfast was good value especially if you belong to the advantage plus club. Would definitely stay at this hotel again.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Israel", "Title": "“excellent location,very clean small room,fair price”", "Author": "dieuwke", "ReviewID": "UR120141557", "Content": "We needed an overnight hotel in Sydney while we were there,walked passed the hotel,liked the location and decided to stay.The room is small but contains everything you need and very quite.It is a great location close to everywhere by ferry or walking distance.They have a parking rate of $40 but the same carpark asks for $80 for 4 hrs,so it was a good deal afterall.The reception staff were very friendly .Definitly a good place to stay,", "Date": "November 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Clean and compact!”", "Author": "Juno1988", "ReviewID": "UR119817703", "Content": "I stayed here in Septeber 2011, the rooms a tiny however they are clean and more modern then most. the breakfast is reasonable. This hotel is 5 mins from city centre and there is plenty of city information in the lobby. For the price of this hotel it is good value for money!", "Date": "October 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Great Position, clean rooms.”", "Author": "jordan-ashleigh Posted by an Accorhotels.com traveler", "ReviewID": "UR119643664", "Content": "Great basic hotel in a convenient location to both Darling Harbour and the CBD. Breakfast was basic but was also affordable. Staff were very friendly. Would recommend if you just need some where to sleep- a great base to explore sydney.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New South Wales", "Title": "“Ibis Hotel King St Wharf”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR119572408", "Content": "Very friendly and helpful staff at this hotel. The Location was excellent for either shopping in the city or dining at Darling Harbour and close to alot of attractions like the Sydney aquarium. The rooms are not that big but very clean. We would stay at this hotel again", "Date": "October 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Hotel Room”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR119545509", "Content": "Room and hotel was good great location and room was tidy and clean. would use this hotel again due to positioning and cost. Service was good and breakfast was nice plenty to offer the travelling business man or a traveller with not much to spend", "Date": "October 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "", "Title": "“Excellent location”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR119339163", "Content": "Excellent location, easy walk to Darling Harbour and just a step to the Aquarium and the Wild Life Park, we took a ferry to Circular Quay and the wharf was behind the hotel. They have a friendly staff.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Koh Samui, Thailand", "Title": "“Small but Perfectly formed”", "Author": "shound1030", "ReviewID": "UR119281214", "Content": "Relatively new Ibis ,very small rooms,clean. Close to the Lime street bar precinct. Would be a squeeze with a couple and long stay luggage.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Olympia, WA", "Title": "“Friendly staff, small room, OK for 1 night”", "Author": "mdcwa", "ReviewID": "UR119278919", "Content": "We arrived at the hotel at 10AM after a 14 and 1/2 hour flight from LAX. Check in time is 2PM, but our room was ready and we were allowed to check in. Dagmara at the front desk was very helpful and courteous. The room is small, about 15 by 10 feet. We had a queen bed, a small desk, and a closet about 2 feet wide. The bed was firm and comfortable. However, only about half of the closet can be used for hanging clothes as there was an ironing board in the closet and the other half was taken up by shelves. There was a refrigerator, luggage stand for one suitcase, and a safe in the room. The bathroom is about average size with a shower, but the sink is very small. Soap, shampoo and conditioner were provided. Two bath towels , one wash cloth and a bath mat were provided. We asked for hand towels and were told that they did not have them, and would send up a wash cloth and a bath towel. What arrived was a wash cloth and a bath mat. We booked this hotel because it was close to Barangaroo Wharf 5 Passenger Terminal for cruise ships (about a 10 minute walk to the terminal, but we used a cab which was out in front of the hotel-$10). For one night the room was OK, but for an extended stay the room would not be acceptable. The hotel is next to the Western Distributor Highway-about half the rooms face this highway. Road noise at night was not too bad, but increased as dawn approached. Wall are also thin as we heard our neighbor leave at 4:45 AM. The hotel is convenient to Darling Harbour and about 2 KM from Circular Quay. Full breakfast is $20 and a continental breakfast is $15. We opted not to use the hotel for breakfast. There are coffee shops in the area and there is a convenience store across the street (also has an ATM). Internet is available for a charge.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“GREAT LOCALE - BUT DONT THE CARS REST?”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR119202158", "Content": "The Ibis is a simple, friendly hotel in a great location, easy walking distance to all the major CBD attractions and a few minutes from the rail networks. The room was clean and comfortable and staff welcoming and helpful. Also, the suppply of information about Sydney services and attractions good. It was unfortunate that sleep was occasionally disturbed by passing heavy vehicles; a fact of life of major cities but annoying. The hotel may not suit a family but for the solo traveller or short-stay couple it is fine.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Maleny, Australia", "Title": "“Sydney stay”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR119058369", "Content": "This Hotel was within walking distance to the wharf where I was to board the cruise ship and it was also within walking distance of Darling Harbour and the city centre. Just a short walk to the Opera House.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Thousand Oaks, California", "Title": "“Neat, functional rooms in a perfect location to explore Sydney”", "Author": "globalfish", "ReviewID": "UR118669769", "Content": "The room was compact but made good use of the space, It was quiet and clean (although the floor should be dry mopped every day as it gets dusty) and the bed was comfortable. It is sort of Ikea-chic. When I was planning my trip from home, I was worried it would be out of the way from the main sights, but the location is really fantastic. King Street Wharf has pubs and restaurants and is on Darling Harbour. The ferry to Manly and Sydney Harbour dock is a 1-minute walk from the hotel. The CBD is right there and you can walk to Sydney Harbour and the Rocks in 15-20 mins. There is world class shopping about 4 blocks away and Chinatown is about 15 minutes walk, too. Pros: Good value, clean, quiet, location Cons: WiFi not included and over-priced0", "Date": "September 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Ibis King Street Wharf”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR118521644", "Content": "We always stay at this hotel each year at the end of the Dawn Princess World Cruise because it is within easy walk from the wharf - even when each of us is pulling 30kg of luggage. So we will continue to stay here since we can enjoy the Sydney CBD and Darling Harbour during our stay.", "Date": "September 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Batemans Bay, Australia", "Title": "“everything was awesome except . . . .”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR118508018", "Content": "Customer Service was Outstanding - they helped us with every query we had, recommended things to us, location was great - a short walk to sydneys cbd and darling harbour, meals were yummy - great on the go meals (ham and chicken filo I recommend :). The only thing we didnt like were the beds - but who doesnt like a bed that isnt there own. But everything else was awesome :) Loved the personal greeting on the tv :)", "Date": "September 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Gosford, Australia", "Title": "“DISAPPOINTED WITH THE ROOM SIZE”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR118137874", "Content": "the location of the hotel was great, however the room size was very disapointing, hardly room enough for two people to exist, nil passage way via bed and bathroom, a view of the freeway guard rail was also a problem, the air conditioning was all over the shop and no room to sit without using the bed as a lounge, i am not trying to sound to crictical but i was very dissapointed with the stay, should you want to discuss this futher my number is [--]", "Date": "September 15, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Melbourne", "Title": "“Great Value for Money”", "Author": "mmij", "ReviewID": "UR118089386", "Content": "Stayed here for a work trip. Very basic amenities but very clean and very close to great restaurants and transport. Room had a queen size bed, flat screen TV and a huge bathroom!! I would definately stay here again both for either work or pleasure. Is definately VERY good value for money especially in Sydney!", "Date": "September 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Wollongong", "Title": "“Overnight stay”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR118060444", "Content": "Hotel was comfortable but room very small and basic. Reception staff very helpful. We stayed here to go to show at Theatre Royal it was about 10 min walk to theatre plenty of restaurants close by at Darling Harbour.", "Date": "September 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "gold coast, australia", "Title": "“Great Location”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR117892456", "Content": "Was very convenient to walk to Darling Harbour - especially the night they had the fireworks! The staff were all very helpful & pleasant with all of our requests during the stay - loved the way they greated you each time you came in/went out of the hotel - so friendly!", "Date": "September 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Terrigal, Australia", "Title": "“Ibis stay”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR117743238", "Content": "The guy who took my call and answered questions on how to get there and parking and also checked us in showed great customer relationship skills. He even recommended places to dine where we could charge back to the Hotel. The room was clean and comfortable. The location and price were excellent for proximity to Darling Harbour and Theatre Royal. Thank you for providing the accommodation.", "Date": "September 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sydney", "Title": "“Disappointment”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR117568368", "Content": "After many years as an Accor Advantage Plus member through my wife and individually, my expectations were definitely not met. No record of my booking, had to produce my copy of the confirming email. Dirty towel protruding from under bed. Breakfast wasn't ready at declared time. Requested payment when I had previously paid upon booking.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Northolt, United Kingdom", "Title": "“Great hotel, excellent location”", "Author": "nirajay", "ReviewID": "UR117483339", "Content": "We stayed here in Aug 2011 as a part of our Aussie trip. Location - The hotel is situated steps away from Darling harbour. with a 5 mins walk, you are at Ferry, Rail links. There's a bus stop just behind the hotel so transportation wise you cannot fault the place. If you love walking, then CBD area is <10 min walk. The shopping area, Town Hall, is less than 1km walk. Overall location wise, it's perfect. For the price, you cannot find a better hotel with equally good location. Hotel amenities / Staff - The hotel is perfect, though the room size can be slightly small. The staff are very attentive to your needs. Facilities wise they are great. Negatives - Only one - The only problem with the hotel is the fact that a whole day's internet costs AUD25 which doesn't make any sense. We live in an era where a month's broadband costs < Â£15 and it just doesn't make any sense to charge the same for a day's usage. However, this is a practice used by hotel chains all over the world so cannot single out Ibis alone for this. Overall, a great hotel with a great location. Surely can recommend this place for anyone visiting Sydney.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great location”", "Author": "girlfromOz25", "ReviewID": "UR117387650", "Content": "I noted what previous reviewers had said about the size, but from doing research on location vs. cost decided to give the Ibis King St Wharf a go and I'm glad I did - my fiance and I had to travel to Sydney for a wedding and wanted to be near the venue but not pay an arm and a leg. Although the room didn't have much room, it had a huge comfortable bed, was very clean and have to reiterate how great the position was - only one block back from Darling Harbour and walking distance to the CBD, The Rocks etc. The staff were all courteous and friendly too. No complaints - great value for money. Our room didn't have a view, but again for the price I wasn't expecting much. It was surprisingly quiet given that it looked out over a busy road.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Practical and sensibly priced. Clean and clever.”", "Author": "sdwylie", "ReviewID": "UR116604696", "Content": "Once you accept that the Ibis King Street Wharf is designed for practical, sensibly-priced travel, it's easy to see the clever value of this hotel. The hotel is basic - don't expect luxuries like designer soaps or a pillow menu in this one. But you will find a reasonably comfortable bed, and very clean, modern interior. A significant benefit to this Ibis hotel compared with any others in the chain that I've stayed at, is that the hotel has been designed with a higher quality fit-out - the bathroom, in particular, is of a high quality standard, with proper ceramic basic, quiet, clean showers, and a toilet with a nice soft-closing lid. The TV system is first-rate, out-doing many of the dated systems you'll find in older 5 star hotels - the system includes all the expected movies, messages, and channels, but in a great HD interface that's responsive and well tuned. The rooms include a work desk with adequate space and connectivity. The food options are basic, but again they're adequate - some simple heated food is available for collection from reception 24 hours, and the cafe is open for breakfast, and offers a good value take-away option - where you can make yourself an espresso coffee and take a tray of food (yoghurt, toast, fruit etc). The parking is limited but has always been available when I've stayed here. The floors in the rooms are an easy-to-clean wood-finish laminate, and the bed is actually a mattress elevated from the floor on a floating wooden base - fairly unique for a hotel, but allows for easy cleaning - and I can't fault the cleanliness of the rooms. For those quick \"bed and bath\" business stays, this hotel is ideal - and it's located sensibly for CBD work.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Campbelltown, Australia", "Title": "“Great Location - recommend for singles and couples”", "Author": "Duyfken", "ReviewID": "UR116601727", "Content": "Rooms are modern, excellent bathroom, clean, each room has a safe which I was looking for. Parking costs $40 per day so make room for that in your budget. Ibis management listened to my mild criticisms and have fixed the problems. Eg. radios no good - Ibis replaced ALL the radios in every room. Lamp wouldn't go - replaced immediately. No wholemeal or multi-grain bread - couldn't fix immediately but took steps to ensure that it wouldn't happen again. Get the full breakfast - the $9.95 continental hardly worth it. Plenty of restaurants close by for dinner and lunch. However, they do have room service. Don't forget to organise with the motel your car parking before you leave to obtain the $40 a day or else you will be up for a bill for hundreds of dollars. The staff were friendly and responded immediately to any concerns. I would have preferred a better deal on the internet usage. Once you log out, you have to pay the $25 per day service again. However, the work desk was good and the bed was comfortable. I would recommend this for a single person or couple that would like a comfortable motel close to all attractions in the city and don't mind dining out.", "Date": "August 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Sydney", "Title": "“Definitely not a place I would want to return too!!”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR116517351", "Content": "I thought that the site could have told you, would need to pay for parking at this motel, the staff were helpful, polite, approachable, excellent in every way. I would have been very annoyed if I had actually paid the going rate for this motel, the accomodation has nothing to sell it dark brown fake wood floors, no view, windows look directly across into what looks like a call centre, so blinds up no privacy even from the 6th floor, I paid for the upgrade queen room which was squashy and tiny so I would really have hated to see what the basic was like, the online ad for this motel depicts it is on the water front not stuck behind another building, We had to pay to park at this site which is not advertised on the website for this motel and it wasn't even the motels own carpark it was a public parking station across the road which they had discount rates to allow motel patrons to use. I would have to say the hotel was the worst aesthetically I have been too yet.", "Date": "August 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Goulburn", "Title": "“treat for my daughter and my self”", "Author": "chunky51 Posted by an Accorhotels.com traveler", "ReviewID": "UR116472237", "Content": "The Ibis hotel was very comfortable, staff were friendly , good for a night or two stay if you have got something on in the city, close to darling harbor ,restaurants hotels etc, they upgraded us to a king bed, which was great and had a great sleep as very quite, breakfast was a full buffet or continental if you like, served til 10:am, we would stay there again, great price too . lovely.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "NZ", "Title": "“everything is EXTRA..aud25 for internet! $40 for breakfast..clean but TINY”", "Author": "r s", "ReviewID": "UR116456706", "Content": "First the good; early check in was allowed as our flight came in and we were tired after a15 hour journey. room was clean and bed was comfortable, shower worked well. black out curtains and good sound insulation. Not so good: one small towel per person, no hand towel or flannel. shower was small, but the ROOM? it was TINY! one luggage rack for TWO people with a bag each=unsatisfactory. we are not large people but kept bumping into one another = unsatisfactory. Really dodgy? how about aud25 bucks for a day to use the internet on one's own laptop= unsatisfactory. $40bucks for cooked brekky for 2 is steep.went round the corner to a nice cafe for $12. Average rating because it's a great place to SLEEP.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Lake Macquarie", "Title": "“Good comfortable stay in a great location”", "Author": "Austravel25", "ReviewID": "UR116101519", "Content": "We chose the Ibis for its convenient location to Cockle Bay and Darling Harbour, and we were not disappointed during our 2 night stay. The room was smallish, but was quiet, very clean and well presented. The bathroom was very clean and functional, and the privacy and blockout curtains are a good idea. There is parking on-site or just over the road, with reduced rates available through Ibis compared to the usual parking rates. Reception staff were smiling and helpful. The location is excellent, being close to several eateries and bars and a fairly easy 10 minute walk to all the activities in Darling Harbour. Close proximity to the King Street Wharf means a ferry ride only takes 20 minutes to Circular Quay and The Rocks. Certainly recommend the Ibis for a relatively low price stay in the heart of Sydney.", "Date": "August 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hobart", "Title": "“Great Location”", "Author": "AnnieK131 Posted by an Accorhotels.com traveler", "ReviewID": "UR115467820", "Content": "We stayed at this hotel while attending a conference. The location is fantastic, restaurants at the doorstep. It is about 50m from a ferry terminal so getting around is easy. The rooms are a little on the small side but have everything you need in them. The service provided was excellent, the staff were very friendly and helpful", "Date": "July 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Sleep Quality": "4", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Very Basic”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR115349338", "Content": "Venue location was great. This was an Accor free night so I guess I was given the cheapest room. Even for a budget room (211), the room size size was small. The TV location was a joke it couldn't be turned tyoward the bed it faced the side wall. The breakfast was over priced for what was available, even though could eat as much as you wanted. Staff interaction was good. I will tell friends what I found. Regards Mick Fogarty", "Date": "July 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Warwick", "Title": "“Sore Backs!!!!!”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR115135389", "Content": "The location of the hotel was good. The cleanliness of the room was good. What we had a issue with was that the size of the room was extremely small, the bed was so uncomfortable that we were waking up with backaches every morning from sleeping on a wooden base, & you couldn't get pressure from the shower nozzle.", "Date": "July 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Charlestown", "Title": "“Great Stay”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR114915084", "Content": "Fantasic location, the staff were friendly and helpful. Our room was complimentary however considering that it was just right for our needs. We will stay again and recommend it to our friends. Food was plentiful and atmosphere in dinning area was comfortable with seating variations.", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Montreal", "Title": "“Two different rooms, two very good stays.”", "Author": "Stinz3", "ReviewID": "UR114578222", "Content": "We had two stays in this hotel, at the beginning and end of our Australian trip. The fact that we went back to this hotel speaks volumes about how good it is. Despite all the wonderful things I am about to say, I will make one disclaimer: this hotel is located next to a highway. On our first stay we got room 514, which faces the highway. The room has a double-paned window, which severely reduced the noise coming from the road, but the truth is that we could still hear the occasional heavy truck and motorcycle. That being said, as heavy sleepers we still had two good nights of sleep and were impressed enough that we booked a room for our subsequent visit to Sydney. For our second stay, we got room 305 which was away from the highway and this just made our experience even more brilliant. In this room we did not hear any noise from outside. If you are a light sleeper, you should insist on a room away from the highway. That being clarified, this hotel is fantastic on all levels: The staff was kind, efficient and clearly had a commitment to excellence. The room was comfortable, clean, well appointed, well lit, comfy queen bed, desk, small sofa, nice bathroom with ample shelf space and good water pressureâ€¦and had awesome â€œblack-outâ€� blinds that made the room completely black at night. However, you have to pay for internet access. The room service menu is very good and affordable; however the breakfast was a little expensive (there are plenty of affordable cafÃ©s in the area). The location is fantastic. Steps from Darling harbour with its cafÃ©s, restaurant and shops. You are a 10 minute walk to The Rocks, there is a ferry stop (that goes to/from Circular Quay) steps from the hotel and the train that goes to the airport is only 3 blocks away. The rooms aren't huge but aren't tiny either, itâ€™s got a bit of a business hotel feel lacking a little warmth, and if they offered better towels and free wi-fi that would put them over the top. Overall, the quality of this hotel, its magnificent location and its reasonable price trumps the small items I mentioned and I would definitely stay there again.", "Date": "June 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Canberra, Australia", "Title": "“Friendly staff and a well priced basic room.”", "Author": "Aaron_from_Canberra", "ReviewID": "UR113770401", "Content": "The front desk staff were friendly, professional and very helpful when called upon. Rooms were basic but everything worked and was in good to excellent condition. Bed and bedding were moderately comfortable. Parking is well lit and secure. Wi-Fi was readily available throughout the hotel.", "Date": "June 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Clean Basic Room at a Great Price with Great Service”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR112979541", "Content": "Service was fantastic. Rooms where basic, but served their purpose well (carpet would have been preferred over the mock hard wood floor). Bed was firm and comfortable to sleep on, but it felt like a double bed when i had booked a queen. Great range for breakfast, but was a little cold when i ate it at 7:30am. Overall a good, clean hotel that is great if you just need a bed to sleep in for the night.", "Date": "June 12, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "sydney", "Title": "“Bad experience”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR111960652", "Content": "The breakfast was very limited and was not fresh. The receptionist was not very helpful with no communication or customer service skills. We booked a superior room; it was very small and nothing special; very ordinary", "Date": "June 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Good rate, New Hotel.”", "Author": "Sparky2509", "ReviewID": "UR111314380", "Content": "We stayed here for one night at the end of our vacation. Got a good cheap rate online and found the hotel to be quite new and very clean. Were helped out with a very early check-in after a long flight so was happy with the accomodating staff. Only critisism was the cost of a beer, well overpriced! Good location, great staff, if you can get a good rate then I reccomend this hotel....but drink somewhere else!", "Date": "June 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mount Isa", "Title": "“Great Stay, Thank :)”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR111201746", "Content": "It was great & we enjoyed our stay it was rather handy for us as we were getting on a cruise at the wharf so it was great to be so close. The staff were great and very helpful. We arrived before normal checkin time and it was fantastic to be able to get our room early.", "Date": "June 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Location Location”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR109893370", "Content": "Location It's just a step away from one of the best location in Sydney. Right on darling Habourside,where everything is just a step away. Lovers, family, and friend would find something to do there. Ibis hotel was very pleasant ,clean and comfortable to stay in. I would go back time and time again. The staff were very helpful in helping you to get around Sydney.", "Date": "May 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Disappointed”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR109873376", "Content": "On arrival at the Ibis Kingswarf I was initially disappointed when directions to the parking area ,lift and acess to my room was not clearly explained ,the result being an approximate 250 meter walk with all my luggage back to reception, the check in and pleastiness of the staff was more than acceptable with the staff explaining in detail our location and nearby establishements of interest,my dissapointment came when I accessed my room which was so small that it was not possible to be in the room apart from sleeping,luggage space was virtually non existant and there was no room to sit comfortably and complete any work or notes that you may like to complete,an extremely small window was the only outside view which overlooked the up ramp to the Harbour Bridge approximately 8 meters from my window.Had this been explained or detailed on the Hotel's website then this may be accepatable but in my opinion the website was not a true indication of the Hotel's accommodation.", "Date": "May 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "adelaide", "Title": "“small but effective”", "Author": "jojozwp", "ReviewID": "UR109741029", "Content": "we stayed at the ibis for 4 nights recently pre cruise with friends. The hotel was chosen based on location (darling harbor, 10 min walk to CBD and access to P&O cruise dock). Price was also a big factor. The rooms are very small, but we had no intention of spending a lot of time looking at 4 walls. The amenities of the hotel are limited, but with such a vast selection of bars, cafes and restraunts on your door step, this was not an issue. The rooms although small, were very clean and quiet. The friendly staff at the Ibis were more than helpful especially Brendan, who went out of his way to make us feel welcome and accomodate our requests. If you want luxury, or spend lots of time in hotel rooms, this probably wouldn't suit, but for location, price and friendly staff you can't beat it.", "Date": "May 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "brisbane", "Title": "“good to stay at Ibis”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR109635115", "Content": "overall, it was good, and the location is convenient. the room is a bit small compare to other hotel with the same rate. such as holiday inn. the bathroom is not very clean. I saw some hairs on the ground when I first enterd the room. the bed is not really comfortable. service is very good, staff are keen on help with any request.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“IBIS Sydney King St Wharf May 2011”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR108728871", "Content": "This hotel is well located, good value, very good service, clean & presentable. The rooms are smallish but ok for a single traveller. The reception & office staff were very helpful. Breakfast options were good and the small bar handy. AG", "Date": "May 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "2.0", "Value": "4", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Farnham, United Kingdom", "Title": "“Don't let the bed bugs bite!”", "Author": "dawnio16", "ReviewID": "UR107550906", "Content": "We stayed here for 2 nights and both mornings I woke up bitten on the ankles after sleeping in the bed. The room was very small and also quite dirty. On the plus side the reception staff were really helpful and friendly", "Date": "May 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wollongong", "Title": "“Ideal place to stay”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR107414949", "Content": "The hotel is situated in an ideal position in Darling Harbour with easy access to and from it and is located close to many of the attractions throughout Darling Harbour. The staff were very friendly and assisted with my special requests without hesitation. i have stayed here a couple of times now and will defintiely be coming back. the overall experience is very pleasant and i feel very comfortable staying here. some places make you feel like you don't belong there, but not this place.", "Date": "May 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“The other IBIS Darling Harbour”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR107228272", "Content": "Small rooms but quite fresh and new. Finally an IBIS where the powerpoint is somewhere near the bed (sort of) Good location right between Darling Harbour and the city. Will definitely stay there again without hesitation.", "Date": "May 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“weekend in sydney”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR106929115", "Content": "We arrived friday afternoon and conveniently parked in front of the hotel and got directions to the car park which was a little hard to find as the entrance was around the back.We booked in and the staff were very helpful and obliging.While my wife and our friends were settling in I took a walk to Martin Place to do some business. Saturday morning we had a lovely breakfast at the hotel and then walked to the markets at the Rocks.After spending a few hours at the market we walked to Circular Quay and caught a ferry to Manly where we had lunch.We spend the late afternoon in Darling Harbour shopping and enjoing the scenery. The position of the Ibis is perfect as you can see by the above that it is walking distance to everything that you want to see.", "Date": "May 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Excellent location and clean tiny room”", "Author": "Magic1121", "ReviewID": "UR105365739", "Content": "I spent 3 nights in this hotel in April 2011. Service: Excellent! Front-desk girls are always ready to help more than you request. If you have any serious issues, please sort out before night shift as night shift team is not effective as morning team. Room: tiny but clean. It is so good for one person to stay. Two people will reduce the comfort but if you spend most of day outside, it is not a big issue. Water pressure for shower is the best I have ever known. You need to bring you own body wash if you do not mind to use soap. Location: Fantastic! One minute to King St Wharfâ€™s restaurants and bars. The must-do things, such as, City sightseeing Sydney & Bondi: bus stop on the left corner of hotel; Captain Cook Cruisesâ€™ stop is very near from hotel for night sightseeing and gold dinner; 10 minutes to Sydney Aquarium; 5-10 minutes to Sydney Tower & Skywalk; 15-20 minutes to Sydney Harbour Bridge climb; 15-20 minutes to central station; 5 minutes to George Street for shopping. The location of this hotel is 5-star. Food: I only tried the buffet breakfast. Good but not impressive as expected. Just normal food you would have everyday in your living place. I mean if you are a real tourist, you would like to try different food but not the food you can find in your kitchen. To be honest, this Hotel is really good and I would like to recommend it to my friends and family if they travel to Sydney for leisure.", "Date": "April 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "GUNDAGAI", "Title": "“2 night stay”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR104211302", "Content": "We found the staff at the Ibis excellent. Check in was dealt with quickly and efficiently. We were a bit disappointed with the size of the room and it's bathroom. It looked bigger in the advertising. However the room was clean and fresh and looked newly appointed. Which upon enquiry I learnt that this Ibis was only about 2 years old. We ate breakfast at the hotel, it was well presented and substantial. The position of the hotel was excellent and was a prime contributor to our choice of where to stay while in sydney. The bed was perhaps a little hard for our liking but everyone is different in this respect and you can only aim to please the majority, you will never satisfy everyone. Given that we were using accor free nights it was definitely value for money, but if i was paying i would perhaps think that given the size of the room it wasn't value but then given position that is worth alot, it is difficult to make a judgement here. Overall other than the size of the room we were very happy with our stay.", "Date": "April 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Coffs Harbour", "Title": "“Great location”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR103667392", "Content": "This is a great mid priced motel for sydney, if you are going to Darling Harbour. The king St Dining precinct is high quality. The location is a short walk to trains and ferry's. Darling Harbour offers great walks around the area. the rooms for quite and modest, the breakfast area was sufficient.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mandurah, Australia", "Title": "“Great \"little\" hotel”", "Author": "JP724", "ReviewID": "UR102394227", "Content": "I'm glad I wasn't travelling with the children this time, as the rooms are very small. The bathroom was also small with nowhere to put your clean clothes (except on the floor) and it's surprising there was no extractor fan (but there is another mirror in the room if the bathroom one is too steamed up for applying make-up). Having said that, I couldn't fault the service and everything was very clean. We didn't spend much time in our rooms anyway (too busy sightseeing) so the size wasn't really an issue. I'm glad we arrived by shuttle bus though, as parking outside the hotel (to check-in) would be next to impossible, with busy traffic lights right outside. Apart from that, the location of the hotel was excellent; a few minutes walk to Darling Harbour, shops, restaurants etc. Easy access to public transport. A Seven/11 convenience store over the road. Breakfast prices add up (as they do anywhere else): $15 continental, $20 cooked, and an express takeaway at $9.50 an option. This is where the hotel excelled - the room was exceptionally clean and there was a good choice to suit everyone, well laid out and labelled. The service from the chef (who appeared to be working by himself) was outstanding; if you got stuck trying to work out the coffee machine for instance, he was there in a flash. We weren't planning on eating breakfast here every day (because of the cost), but ended up doing so, because it was convenient and pleasant.", "Date": "April 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Wollongong", "Title": "“Not very happy”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR102243711", "Content": "i recently stayed at your ibis hotel at King street warf Sydney. i was very dissapointed with my stay here. i booked using an accor girft card i had received and was charged $300 for one night for my room. We also had friends stay in this same hotel who also booked through accor and were only charged $170 for the exact same quality of room and on a higher level. i think it is awful that i was charged so muchh extra just because i had a gift card where in reality you were still paid the full amount of $300 there was no discount for you. We stayed at another Sydney hotel the night before which was 5 star and we only paid $245 which included car parking and an upgrade, along with breakfast. I would have had no problem paying the higher amount at you hotel if i had recieved a much better room then my friends but this was definately not the case. i will not be staying with accor in the future. Nichol", "Date": "March 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“Ibis King Street Wharf \"forgettable\" accommodation.”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR102097541", "Content": "The photos on the website don't show true size of rooms. We were in a shoe box overlooking the underneath of a car overpass. The filter/air conditioning vent above the toilet was so filthy you could not see through the holes. The bathroom had a sign in it to keep the door shut when having a shower as the steam will set off room smoke alarm. - no exhaust fan in the room. We wanted a late night drink and the chap kept trying to upsell 2 drinks for my hubby not just the one we asked for.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canberra", "Title": "“Perfect location”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR100540433", "Content": "The hotel is on the doorstep of Darling Harbour, which is awesome. On arrival we headed down for a Jet Boat ride, got back saturated so the closeness of the hotel was appreciated for a quick change of clothes. The location was perfect for us as we were doing the Harbour Bridge Climb the next morning, that was a 20 minute walk. The room was spotless and fresh.", "Date": "March 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "England", "Title": "“Pleasant and very acceptable”", "Author": "female-tourist", "ReviewID": "UR100366921", "Content": "This Ibis is close to Darling Harbour and very convenient for access to public transport -including 5mins to the ferries. Also many attractions around the harbour are walking distance. My room was nice, clean comfortable. There was a room safe, but it was a small box on the floor at the end of the sofa and difficult to reach. Alicia and Nikki were very helpful staff, with planning my trips and departure arrangements. There is a breakfast room, but no other meals. But you are only 5 mins walk to Kings Wharf which has bars & restaurants, and 10 mins further to Darling Harbourside which has a good selection. My only problem was with my departure arrangements. I had a late night flight, but had to check out by midday and could not stay in the room as the hotel was full that night. I investigate the lockers in the basement. They are stacked 3 high and the computer decides which one you get. No way could I lift my suitcase that height to level 2 or 3. Lockers cost $7 for the day and $1 each time you open the door. I left my luggage in the corridor near reception. But the hotel does not have any shower or changing rooms either. I feel that hotels in a city with an international airport should make provision for guests who have late night flights. Nevertheless, this was a lovely hotel, with helpful front desk staff and I would be happy to stay there again.", "Date": "March 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nottingham", "Title": "“Location...Location...”", "Author": "padgoj", "ReviewID": "UR98808366", "Content": "We stayed at \"The Ibis\" for 4 nights in Feb and found the hotel perfect in every way, we booked in with no problems and had a nice room on the 6th floor, yes the rooms may be small but we found this no problem. We had a full English breakfast every morning which was very nice. All the hotel staff were very helpful and knowledgeable, we had a problem with the safe in our room and it was sorted out with in 15 mins. The position of the hotel is with in walking distance of all Sydney's sites and great restaurants. The hotel arranged an airport shuttle bus to take us back to the airport $14 each, we also stored our 2 large cases in the hotel lockers $7. We had no problems with this hotel and for the price we paid we would certainly come back one day.", "Date": "March 3, 2011"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Townsville", "Title": "“No quilt covers used”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR98589439", "Content": "I have found with the two IBIS hotels i have stayed in in Sydney and Melbourne - both do not use quilt covers. The room smelt of mould but was clean in appearance. Shower amenities were clean also. Bed was comfortable.", "Date": "March 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Great location”", "Author": "Kman45", "ReviewID": "UR98159241", "Content": "Everything was very good, only negative is the room size. If your on a quick business trip, I highly recommend.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“A Night In Sydney CBD”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR97908691", "Content": "Met with a smile that went through the whole experience. Please make sure that your find out that parking is available (and it is) and all will be OK. The room is decent for the stay I was envisaging (a single night) but could be OK for a few more nights. Close to the CBD and a walk to Sydney's attractions.", "Date": "February 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Detroit, Michigan", "Title": "“A new Ibis in sydney is very good.”", "Author": "debstant", "ReviewID": "UR96198325", "Content": "The newest Ibis Hotel in Sydney very good at the usual ibis standard. very handy location to the city. enjoyed our stay", "Date": "February 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "2", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Clean tiny rooms, good location, good breakfast.”", "Author": "GlobetrotterGal56", "ReviewID": "UR95414029", "Content": "Problem: Upon my arrival at the hotel my private room was not ready for me as the hotel had given away my room to another traveler without my prior consent. While I was able to use the room that night, I was unable to do so when I needed it or wanted it after my 22 hour flight from NY to Sydney. Very unprofessional. Since the hotel was sold-out, the only thing the hotel could offer me was for me to change my clothes in the hotel's public bathroom!. Hardly the treatment I expected with a prior reservarion. This was totally unacceptable but I had to make due.", "Date": "February 3, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“major problems with Accor pre-booking”", "Author": "MikeT2000", "ReviewID": "UR95218145", "Content": "I had prebooked 3 rooms and prepaid via my Accor Advantage membership.The Hotel refused to accept the validity of my prepaid booking and I had to pay for 2 extra nights that were bonus nights with my booking. For 30 minutes they argued that I had not prepaid for the breakfasts inspite of my having a printed receipt from Accor.They said Accor make many mistakes(they have never in my long experience).The whole check in took forever as every point was argued. This hotel should not be part of the Accor group. The hotel is well located ,but rooms the smallest I have ever experienced and those on the motorway side(about 2m away) were noisy. I would never never stay there again", "Date": "February 1, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sydney", "Title": "“Holiday at King Street Wharf”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR94909543", "Content": "Very well situated. Very clean and compact. Great for families with teens. Very nice breaky. Would definately stay again.", "Date": "January 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "melbourne", "Title": "“convienient & excellent”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR94172064", "Content": "well located for both business and liesure excellent restraunts close by and walking distance to shops and many attractions", "Date": "January 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Value hotel”", "Author": "Glas166", "ReviewID": "UR94018316", "Content": "Stayed 2 nights and was quite happy with the stay. The location is excellent for central Sydney and Darling Harbour. The hotel is economy so you dont get the added frills and services of other more expensive places. Our room, although small was all we needed this weekend, it was clean and quiet and provided good value. This is the first time I have stayed here, and would do it again for a similar type weekend.", "Date": "January 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Adelaide", "Title": "“Ibis King Street Wharf Sydney”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR93273816", "Content": "Location was great, staff helpful, very clean, room was a little on small size would be perfect for a solo traveller.", "Date": "January 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Canberra", "Title": "“Sail away”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR92839852", "Content": "Location was great. It is a short walk from Darling Harbour and wonderful restaurants. The staff were friendly.", "Date": "January 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "melbourne", "Title": "“Night in sydney”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR92461444", "Content": "Friendly staff in a central location to Darling Harbour and the Rocks. Room small but clean.", "Date": "January 10, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sydney", "Title": "“Good for an over-night stay!!!”", "Author": "Sydney_Australia_11 Posted by an Accorhotels.com traveler", "ReviewID": "UR91775038", "Content": "The Kings Street Wharf Ibis provides good rooms at reasonable prices. On the downside, it seemed to be short-staffed on the day we checked-in as the process took over an hour. Also for Sydney-siders planning on driving into the city, the parking is located down the street, which is good value but would prove a problem for ppl with lots of luggage. The location is good - just wear sensible shoes if planning to walk down to the Harbour. The hotel to Pyrmont Bridge/Darling Habrour is about 15 min walk.", "Date": "January 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Adelaide", "Title": "“stay in sydney”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR90861495", "Content": "As a 1st timer in Sydney I didn't lnow what to expect. I found the hotel more than met my expectations & I will certainly rebook if returning to Sydney and recommend it to friends & family.", "Date": "December 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Helensburgh", "Title": "“Over-rated dog boxes”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR90706011", "Content": "The rooms are no more than over rated, over inflated, dog boxes. We woke the next morning to find that we had just slept with a doona covered in red and yellow stains. The reason that we did not see that before going to sleep was because it had been conveniently laid with the stains face down. Also, the Ibis has limited parking. We were required to find parking at a different location. I WILL NEVER RETURN TO THIS HOLE! And I USED to be an Accor member. Never again!", "Date": "December 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Wollongong", "Title": "“Some improvement opportunities”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR89693144", "Content": "Shower door did not close properly and water on the floor was an issue especially considering there was no bath mat provided. Good location but would have liked a few extras for the $ spent - will most likely stay at the Mercurie Broadway as opposed to the Ibis next time as they have a pool and gym for the same value. Reception very courteous, brekfast room small and impersonal but servcie and food OK Not too bad overall perhaps location to Darling Harbour tends to make hotel attractive.", "Date": "December 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“Visit to Sydney”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR89551752", "Content": "Enjoyed our stay very much. Very convenient location", "Date": "December 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "sydney", "Title": "“excellent beginning to a wonderful holiday”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR89386958", "Content": "We were delighted with the service, the cleanliness of the rooms, the convenient location as we dined at Darling Harbour.Thank you also for the 5% discount towards our dinner at Nick's Seafood. We will definitely recommend this hotel to all our friends and we will stay with you again.", "Date": "December 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Europe", "Title": "“Centrally located, and resonable priced”", "Author": "werli Posted by an Accorhotels.com traveler", "ReviewID": "UR88122036", "Content": "Don't expect the world at the Ibis King Street Whart. But expect regular Ibis quality = nothing fancy, but a good bed to sleep and whatever else you can expect from a discount hotel chain. On top of this you get an excellent location 5min walk from Darling harbour and 15min to the Opera house. So if you don't plan on spending to much time at the hotel, and most of the time in the city, this hotel is perfect.", "Date": "November 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Ibis King Street Wharf no frills”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR85807535", "Content": "Ibis King Street Wharf doesn't disappoint! For an easy in, easy out, no frills stay, it's great!", "Date": "November 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Halifax, Canada", "Title": "“Need to Clean Up Your Act”", "Author": "CanadianAdventurers2", "ReviewID": "UR85638284", "Content": "Room was very small but this was expected from reading other reviews and was not a problem. It has a good location and was fairly quiet. However, the room itself was very dirty. We had prepaid for 5 nights, otherwise we would have left after one night. Our socks were filthy from walking on the floors, who knows when they were last cleaned and definitely don't look too close in any of the corners, etc.- something might be living in the dirt. The bed linen did appear to be quite clean and although it was to be changed every day unless you told them otherwise, I had to leave a note on the bed pillow after the third night requesting the linen to be changed. The hotel does have some pluses - Too bad someone isn't supervising the cleaning a bit more closely.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Small rooms - rude staff at check-in”", "Author": "AussieBumsSydney", "ReviewID": "UR85199949", "Content": "We were in Sydney for a Birthday. Stayed at the Ibis King Street Wharf. The rooms were tiny and you had to be the size of a jockey to have a shower. Our room faced the on ramp to the Sydney Harbour Bridge. Very little sleep due to the noise from passing trucks and cars. Breakfast was lovely and service in the eatery was great. The staff at check-in were very rude. The two staff were talking about what they were going to do over the weekend and had to wait to be served. I have never checked-in at a hotel and not spoken too - not even a hello & good bye", "Date": "October 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Small but great staff and location”", "Author": "TravellingTex", "ReviewID": "UR84016325", "Content": "We booked our room through Qantas Holidays as a two-night package, but added a night. If we had booked the third night not with Qantas we would have no doubt gotten it cheaper, but nevermind. Patrick checked us in and made us feel very welcome. We parked in the garage next door and accessible to/from the hotel by elevator - very painless ($30/night). The room was not roomy, but served our purpose. It was clean and modern, and even though our window faced a busy street, the windows were thick and kept out the noise. Our package included breakfast on the Sydney Harbour Bridge with the breakfast provided by the hotel. We were overloaded with food - muffins, croissants, fruit, a baguette, smoked salmon, yoghurt, juice, milk, and small meat pies. Alicia at the desk spent quite a while trying to help us find a laudromat that was open on a Sunday to no avail, but it was not due to a lack of trying. And we could check email for $2 for 20 minutes. No complints. We thoroughly enjoyed our stay.", "Date": "October 18, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Auckland Central, New Zealand", "Title": "“Worse Nitmare of Customer Service”", "Author": "losilosivale", "ReviewID": "UR81423732", "Content": "Booked through a travel agent. This place was misrepresented by picturesque photos of Darling Harbour and the travel agent (Flight Centre) personnel. The worse nigtmare was dealing with the manager that was not helpful at all. Five times I have to confront him with the issue over the room and it wasn't till 1am in the morning he came to the party; thats when I couldn't find a nearby hotel to move to as they were all full. The room I was given was at the rear end of the hotel, precisely too small to move around, and only half a metre from the edge of the highway - making a lot of noise with the passing traffic. Yes, i was finally moved to a better room at after 1am in the morning. My main complaint was the issue of the room was not dealt with at the time. I was constantly ignored even I offered to pay more if that is reqired to rectify the matter.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Looked a lot better in the ad-very small-misrepresented location”", "Author": "MarkF54", "ReviewID": "UR80981389", "Content": "Quote from ad, \"Hotel Ibis, enjoying pride of place on the waterfront.\" Well it's not on the waterfront, it's back a block. The ad has pictures of big wonderful big rooms which is misleading, they are the smallest rooms I have every stayed in. They also say it's a vibrant hotel, again not true, it was very boring. In truth the the rooms are small, clean, OK front desk service and the location of the hotel is handy. If you are after a room NEAR King Street wharf this one is OK but only if you go there to sleep. Don't pay top dollar, it's not worth it. I would only stay here again at the right price.", "Date": "September 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nha Trang, Vietnam", "Title": "“Mixed feelings”", "Author": "MLANT", "ReviewID": "UR80895309", "Content": "I arrived around 10 am after a long flight. A friend of mine passed by the hotel the day before and was confirmed my room would be ready however I was told it was not. The receptionist was very cold and just told me to come back after 2 pm. I told her that I was confirmed a room but she ignored and did not double check. I went to my friend office to wait and asked his staff to call the hotel to let us know when the room would be ready and the hotel said the room was ready... Very bad start! Rooms are what you would expect from an Ibis, clean, small but well designed. There are big discrepencies in the staff attitude and service mind, Some are welcoming and nice but others are very cold. The breakfast is quite good. Location is great.", "Date": "September 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "leeds", "Title": "“Great Location”", "Author": "thenorage", "ReviewID": "UR78728699", "Content": "Very good hotel very near Darling habour and 20 minute walk to the Rocks. Rooms very clean and new at the time of our stay. Stall friendly and keen to help.", "Date": "September 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Excellent Hotel”", "Author": "ANNGC", "ReviewID": "UR76357037", "Content": "For a hotel of 3 / 4 stars is great. It's new, has been recently remodeled. The price is appropriate. It is well located (near the Darling Harbour). The internet is not free. The employees are very friendly. I recommend!", "Date": "August 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "glasgow", "Title": "“OK but nothing special”", "Author": "GlasgowSiobhan", "ReviewID": "UR74721457", "Content": "We stayed here for 2 nights. Location is great. Right next to King Street Wharf. 5 mins from Wynward Station. Rooms were clean and modern but tiny (i did expect it to be small). There was barely enough space for 2 of us and 2 cases! Bathroom a nice size and modern. There was a big highway going past the hotel but it was well sound proofed as I didn't hear any traffic at all. The staff were always friendly and helpful. There is a bar/cafe where you can get breakfast/drinks but we didn't use it so I cant comment on that. NEGATIVE: On the morning we were leaving we wore woken but someone knocking doors (over and over agin) and shouting \"houskeeping\". It was 8.15 AM!....... This went on for over an hour. If i had the energy to get out of my bed I would have went out and told him to shut up............ I appreciate that rooms need cleaned but at this time in the morning staff should be quiet. We could hear the hoover scraping over the wooden floors and there was a big bang as he put down the mop bucket in every room........ This meant that we were then knackered as we were flying through the night to Hong Kong. I could have done with the extra 2 hours sleep that I didn't get. Also, $7 to keep your bag for a few hours is quite mean. Would I stay here again, I'm not sure. Maybe if we had a much larger room and gagged the housekeeper!", "Date": "August 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Auckland Central, New Zealand", "Title": "“Convenient”", "Author": "tr1ppy", "ReviewID": "UR73525900", "Content": "This hotel is simple, it has few (read NO) extra features, the rooms are small and clean, the beds are well made, the air conditioning works, water pressure is good. I must admit I was a little disappointed when we first walked into the room...mostly due to its size, however, it's convenient location made up for the initial lack of enthusiasm I had for the hotel. Booked the hotel online as part of a package deal (flights/accom) and paid a very reasonable price, so all in all, I would say that I am a satisfied customer There is a 24 hour mini-mart store and a bottle store across the road. Couple of minutes walk to Wynyard Station Did not have breakkie there - the cafe next door was better value and had great pastries and coffee. We wanted to eat in on our last night..the room literature advised that food could be ordered and the picked up from the reception...what we did not find out till we tried to order is that it is essentially dial-a-pizza from an outside provider. It was good pizza, though it did take an hour to arrive.", "Date": "August 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Crawley", "Title": "“Value for Money.”", "Author": "GillnBuck", "ReviewID": "UR67267063", "Content": "Having pre-booked the Ibis some time back for $130 a night we really did get value for money. The Hotel is very central to everything from, walking to the Botonic gardens to the waterfront & the Opera House, Kings Wharf & Darling Harbour. Even the Tour Bus stops outside more or less. Rooms are modern (quite well thought out in design) and clean with drink facilities & fridge. Slightly more spacious than what we thought they would be and the staff were friendly, helpful if requiring any information, always happy to keep you topped up with tea bags too. Car parking was $30 per night but this is very resonable for city centre parking. Finding the car park entrance was a bit tricky , a shared underground car park with no signs as such but again, the staff will guide you in. My only slight moan was....there are no towel hooks in the bathroom. Other than the small towel rail left of the sink, there was no where to hang, towels or a dressing gown. Just a minor detail?", "Date": "June 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Very handy to wharf if boarding cruise ship”", "Author": "CyndySue18", "ReviewID": "UR64250086", "Content": "We stayed in this hotel for one night before we boarded the cruise ship. It is conveniently located to the wharf with a short walk of 100 metres. Also very close to Sydney city where you can walk into town. Room was clean and tidy but very small. No outlook except into office buildings, but it suited us for the position. If I was boarding a cruise ship, I wouldn't hesitate to stay here again. Staff were helpful when asked questions. Lots of restaurants in close vicinity.", "Date": "May 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "new zealand", "Title": "“very enjoyable stay”", "Author": "smithNewZealand", "ReviewID": "UR63711900", "Content": "my husbabd and i had three nights stay at the Ibis sydney street Wharf motel. we arrived to find a very helpful giril on the desk that was very nice and helpful her name was Alicia i must say that everyone that we came across who worked there was very good at their job even the young guy who was on the desk at 6 oclock when we checked out on the sunday the 9th of may sorry i forgot his named. we felt very welcomed to be a guest staying there. The Room was so very clean the first night we had a standard room and it was bigger enought for the two of us we were planing to be out all day sight seeing and shopping anyway we were on the 5th floor over looking the road and it was very quite which was quite amazing for been near the road. the next two night we were able to up grade to a bigger room for it had it on our ticket stating we could it was good too it was much bigger with a couch to be able to sit on instead of sitting on the bed. the floors were wood but it didnt make it cold the service was good we got up and left our bed unmade and when we return the bed was made and the pyjamers were neatly folded up on the bed i have never come across that in any other place we have stayed well done and thanks to the person who did it ,it made us feel pampered. Ibis is close to every thing you want to go to the Aquarium,Darling harbour,Star city casino restaurants and Bars shopping its all in walking distant the transport system is great you dont need a car when staying at Ibis you can get all day passes that have the buses trains and ferrys all on it. that you just get on one and get off and catch another form be it a bus, train of ferry . we will be definitely staying at Ibis Sydney king street again when we come back to Sydney thank you we had a great time .", "Date": "May 10, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Sydney", "Title": "“It's not the Ritz but top marks for great location at a good price”", "Author": "Tavare", "ReviewID": "UR63702653", "Content": "I was surprised to read some of the reviews of the Ibis mentioning that the rooms are small. That's what Ibis hotels provide...what do they expect, a 60 sq metre suite? I've stayed at many Ibis hotels around the world and they are much the same - compact rooms but with everything you need, good locations and good value rates. That's what you get at an Ibis, if you want big rooms and fancy services go to the Hilton and pay three times as much. I find it quite incredible how naive some travellers can be. If you want fancy, you pay for fancy. I booked my brother and his children into the Ibis for three nights and joined them for one of them. My wife and I were upgraded to a King harbour view because we are Advantage Plus members but it was still basically a slightly more fancy Ibis room. The important thing, though, was that it was new and clean, had a great bed, flat screen TV, and just about everything we needed (internet, ironing board, tea/coffee etc) and had very friendly staff. We got one of the best locations in Sydney for under $150 for the night. Up the road at the Hilton I would have paid $350 and it's nowhere near as good a base for a holiday as the Ibis. Instead we used the money we saved to have a great meal at Eleven on King Street Wharf, take a harbour cruise on the Magistic and visit Sydney Wildlife World. Everything was less than five minutes walk from the Ibis. Yes, it wasn't the Ritz, but I didn't book the Ritz, I booked the Ibis!", "Date": "May 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Australia", "Title": "“Great value if you get an advance booking internet rate”", "Author": "ThinController", "ReviewID": "UR63407489", "Content": "I stayed one night in May - booking online a month in advance the room was $116 per night and hot breakfast $20 per day (the rate increases if booking less than 30 days in advance as it was much more expensive when a colleague enquired). My room was on the Eastern side of the hotel on the 5th floor, and was similarly furnished to other Ibis' I have stayed in (i.e. rather austere) and very clean. One \"surprise\" was that instead of carpet the floor in the room had a wood grain style vinyl. The bed was comfortable, and the double blinds very effective at keeping the room dark in the morning. I note other contributors have commented on the breakfast. I thought $20 was reasonable for the hot breakfast, which included baked beans, bacon, scrambled egg, breakfast sausages, hash browns and mushrooms, but $15 for the continental breakfast selections is a bit steep. As other contributors have noted the hotel is a short walk to Darling Harbour, Wynyard and Circular Quay. I noted the hotel were advertising airport transfers for $12 and hire lockers for $7 per day, although I didn't use either facilitiy. The only problem I encountered was that the morning check out was a little slow as they only had one staff member on the desk and they were also handling telephone enquiries. Overall I consider that Ibis King Street represents excellent value for money if you get an advance booking internet rate. TC", "Date": "May 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Vijante mundial", "Title": "“Don't come here”", "Author": "MigueAngel", "ReviewID": "UR62994536", "Content": "Tiny rooms, as small than you can barely open your cases. Besides a highway so expect just noisy nights. Everything is charged, a simple bottle of water, to keep your luggage the day you leave, parking, late checkouts, internet, they overcharge the breakfast,...everything overpriced. They don't let you even take a shower the day you leave after being wandering through Sydney the whole day, they don't mind even after you spent a lot of money at the hotel. False fire alarm in the middle of the night making all wake up and nothing in return, not even an apology. They don't care customers, they just make cash.", "Date": "May 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cairns Queensland", "Title": "“Good basic hotel close to darling harbour”", "Author": "baalamb", "ReviewID": "UR62442655", "Content": "Stayed at Hotel Ibis King St Wharf for 2 nights. Originally booked a superior room but on check in was upgraded to a king harbour room. These rooms are bigger than the standard rooms & have a partial view of the water so the space was adequate for our needs (2 adults & a 3yr old) even with a rollaway in the room. King size zip bed (breaks into a twin) was fine but the problem always with these zip beds is the zip in the middle being not very comfortable should you roll onto it -this is a fairly common thing in hotels though and I just wish hotels would invest in some matress toppers which would alleviate this issue. Being a newer hotel everything is still fairly fresh, bathroom does the job, shower cubicle is small but water pressure & heat are good. Air con worked really well and was adjustable in room. The hotel is in a good location to easily walk to all the restaurants of King St Wharf and probably a 5-10 minute stroll along the water to cockle bay wharf/darling harbour main area and monorail station, so this gives you pretty easy access to the city. The hotel has wooden floors which though they look good do allow noise from above rooms to travel easier. Found the staff to be friendly and professional on check in/check out. Parking at the hotel or at their offsite carpark is $30 a day -something that seems fairly common for hotel parking in sydney, so if you want to save some money do your homework, on the weekend you can park at the cockle bay wharf wilson carpark for $9 day -you will have to walk further but if you want to save some $ then worth having a look at the surrounding carparks for their rates. All in all our stay was good and if you are after a newer hotel room with the basics then this is a good hotel for the price.", "Date": "April 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ashland, Oregon", "Title": "“location, location, loc......”", "Author": "JacquiKay", "ReviewID": "UR60759286", "Content": "yes the rooms are small but the bathrooms were quite ample. we had no view but we didn't stay in our room very long anyway. we were able to get our room early but they have storage lockers for luggage if you cannot check in when you arrive. the staff was very cooperative. we were in walking distance of the harbor and the many fine restaurants. we were near a metro stop but never used it as we walked everywhere. the bon bon cafe a few doors down has great coffee and free wi-fi!", "Date": "April 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Redding, California", "Title": "“Like the Pictures, Only Smaller”", "Author": "Blackbirds", "ReviewID": "UR59881038", "Content": "We spent a week at the Ibis. The rooms are clean but very small, definitely not for families. The service of the staff depends on who you get. The hotel is nearby many Darling Harbour restaurants but most of them are on the pricey end. Public transportation is not easily accessed. Internet costs are $10 per day if you get the weekly plan. The bus transfer stations are at least 5 hilly blocks away so you end up walking a lot. Overall, it met our needs.", "Date": "March 29, 2010"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Stirlingshire", "Title": "“good location”", "Author": "weeclairey", "ReviewID": "UR57418523", "Content": "this hotel is in a good location, just a 2 minute walk to darling harbour. As per some of the other reviews, the hotel rooms are not that big, but hey, you don't go all the way to oz just to sit in a hotel. Didn't have any breakfast as there were other cheaper cafe's etc near by. Again, no free wi-fi access, just like most hotels in oz, however there is a internet station just next to reception which is cheaper than the one you have in your room.", "Date": "March 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Auckland", "Title": "“Welcomed like family”", "Author": "HolidayVibes", "ReviewID": "UR57221368", "Content": "We've stayed at Ibis, King Street Wharf 3 or maybe 4 times now. Staff are so friendly that they greet us as if we were family or friends. They chat with us, recalling previous conversations yet they never relax on professionalism, such as when phoned at 2am about the aircon (yes it is noisy and a little difficult to set just right) they clearly explain how to set it; when asked for directions or help with deciding transport options to the airport or how to get right out of town to Glenmore Park (near Penrith) they are quick to help. Sydney has very expensive hotels with poor service from our experience and Ibis is like a \"breath of fresh air\". Our four nights stay from 30th Jan seemed expensive but was priced less than other comparable hotels. Welcoming, quiet, safe, clean,great location, helpful staff, what more can anyone want? The staff are human enough that sometimes things don't go according to plan i.e a forgotten towel or pillow and I much prefer this to the stuffy proper-ness of some other establishments. We didn't eat breakfasts as although these are inexpensive we found them lacking in variety (no gluten free and no muesli on a previous stay) but there's a cafe next door and a 24hour store across the road, and of course so many restaurants on Darling Harbour. For good food that's less expensive than most we recommend Wagamama (on same street as hotel). Our sincere thanks to Ibis King Street Wharf. We will stay with you again but as our son has now moved to Sydney we'll stay with him sometimes. Did I mention we were upgraded to a superior room on this visit! Thank You", "Date": "February 27, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Connecticut", "Title": "“Clean, well located, but service is awful”", "Author": "ConnecticutCatlady", "ReviewID": "UR56612778", "Content": "We stayed in this hotel two separate times - at the beginning and end of a cruise. The hotel is clean and very well situated to the Aquarium and the wharf area. The rooms are small, beds comfortable and have basic bathroom amenities. My main complaint is the lack of service and the less than warm reception we received. Our friends asked for more pillows. They were told they would be right up with them - they were never delivered. Our TV was not working. We told reception on our way out in the morning. We were told they would have someone up to fix it while we were out for they day. No one ever came to look at it. We prepaid our stay to secure the internet price. When we were checking out, we were told that we had not paid. Even after showing them the computer print out we made of the transaction, they insisted \"their records\" did not show that we had pre-paid. I would recommend bringing the copy of the credit card statement with you to prove that you have paid. We had to pay them again and take care of the double charge with our credit card company when we got home. FYI on internet use - there is a charge of $11/hr if you use your computer in the room. There are 2 computers in the lobby that charge $2 for 20 minutes.", "Date": "February 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Amsterdam", "Title": "“Overprized. Hotel charges an extra fee when paying with credit card. Avoid”", "Author": "damaAMSTERDAM", "ReviewID": "UR56179941", "Content": "This hotel is very expensive considering the size of the rooms and the fact that everything extra (e.g. internet) will cost you a lot of money. Even paying cost you money as there is a surcharge for credit card payments!!! This is ridiculous for a hotel from a chain like Accor. Front desk staff is clumsy and not well informed. Due to bad advise of the front desk in connection with the airport pick up service we arrived 2,5 hours before departure at the airport (in the very early morning!) instead of 1 hour (which is required for domestic flights). Never again. Sydney offers much better (and cheaper) options.", "Date": "February 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "ShellsO", "Title": "“Tiny but perfect for a cheap night”", "Author": "ShellsO", "ReviewID": "UR54973628", "Content": "These rooms are very small, and the window even more so. HOWEVER, if you are after a new, clean room in an easily accessable location (great for King St Wharf, Darling Harbour, City shopping, The Rocks, Circular Quay, and transport) then this is a great option. Staff were efficient and helpful. It is super close to the freeway but the rooms are whisper quiet, no need for concern re noise. As a Sydneysider, this is the perfect hotel for when I need a bed for the night and am not interested in the romance of the big/beautiful hotels. Would stay again for that price. Great work Ibis.", "Date": "February 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Perth", "Title": "“A basic hotel but clean and comfortable - excellent location and very good value.”", "Author": "MRDAV64", "ReviewID": "UR54466010", "Content": "Stayed for a week in Jan. Clean, comfortable and quiet - the double glazing meant that the freeway outside my window was no problem. The location is fantastic and the staff were very helpful and courteous, particularly the young lady who seemed to be working just about all hours of the day and night. The only (slight) criticism is that the room was on the small side - great for one person but would have been a little cramped for 2, and I did find the shower a little cramped.", "Date": "January 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Auckland", "Title": "“Exceed my expectation...”", "Author": "traveluvee", "ReviewID": "UR54126750", "Content": "I've booked to stay at IBIS King Street Wharf for 9 nights after reading all the great reviews in here. The staffs are all extra friendly and we've had very good feeling about the service the minute we first walked in and were greeted warmly. We arrived at around 12-ish and were managed to checked into our room right away as the staff told us that it was cleaned and ready for us. I was impressed in their flexibility on that as many other hotels I've stayed at always made us wait till the check-in time. We had a standard room and I've read the review before making the booking so we were prepared for the size of our room. However when we walked into our room, we were so happy with the cleanliness that we have forgotten about the size of the room. It sort of made up for it as our first priority in hotels is cleanliness plus no rust can be found in the bathroom. The room is very modern and clean so we didn't mind about the small size at all. It's really not as small as what I've expected. Besides, we spent most of our time traveling outdoor anyway. We just need a very clean room to go home to at the end of the day to sleep and rest. The air-condition was having a malfunction one night and we couldn't sleep at all as it was very hot in Sydney at the time and staying at 7th Floor made it worst coz the heat raised from bottom to top. We went to the front desk to complain about it at 2am after trying very hard to sleep but failed and I was having headache at that time. A staff named Vanessa was wonderful as she tried her very best to look for a room with cooler temperature for us and in the end, we were moved to a superior room at 1st Floor for the rest of our trip (2 nights left). We were very very impressed with IBIS King Street Wharf by that time for being treated fairly and with great ethic. Were given a complimentary 'continental breakfast' which was so-so but it's free so there's nothing to complain about. I won't pay for a breakfast here however as they are with very few selection and does not look appealing. I've been to many hotels and tried many buffet breakfasts so I know the difference when I see one. However, that is a very minor problem as I'm sure the Hotel will do something to improve that as they are still a very new Hotel. Anyway, I will not hesitate for even a second that I will stay in this hotel again the next time I travel to Sydney. Thank you all staff at IBIS King Street Wharf for the great hospitality an we shall see you again.", "Date": "January 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Sunshine Coast", "Title": "“Stay here Pre-cruise”", "Author": "gkjacob", "ReviewID": "UR54084837", "Content": "We stayed the night prior to our Princess Cruise departing Wharf 8 Darling Harbour. The rooms are small, but clean, modern and adequate. For those travelling from Wharf 8 the location is outstanding. In the morning we just wheeled our suitcases downhill a short way and we were at the cruise terminal. Close proximity to King Street Wharf and only a short stroll to Daling Harbour. Cruise travellers will not be disappointed!", "Date": "January 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Perth, Australia", "Title": "“Great location and good value for money”", "Author": "Ajawa", "ReviewID": "UR53989356", "Content": "Stayed here for 3 nights in December 09. We caught the train from the airport to Wynyard Station and had a bit of trouble finding the hotel walking from the train station. The map provided on the hotel's website wasn't very clear. However we did get there in the end and although the room was small, it was very clean and quiet. Being on the third floor our window looked directly out onto a highway, but with roller shutters on the window we could hardly hear it. Great location for walking to the CDB, Circular Quay or Darling Harbour, though there are a few hills to climb. Price is very good value considering it's in the heart of Sydney. Definitely would stay here again and would recommend it to others.", "Date": "January 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Excellent location, but not up to normal Ibis standard”", "Author": "JiEmiraten", "ReviewID": "UR53762519", "Content": "After staying with Ibis in Europe, Middle East and Asia we have become very fond of the concept: No frills with small but decent rooms with good bed and toilet, and quite nicely designed comon areas. This Ibis has a perfect location, around the corner from Darling Harbour and close to many nice places in the CBD, and we found the price very decent. However, compared to other Ibis hotels, we felt this was below par (very much highlighted as we came straight from the very excellent Ibis in Singapore): The common areas, like restaurant, lobby and hallways were relatively small. As the rooms in Ibis are small by default, the size of these common areas is quite important for the general feeling about the hotel. The air in the room did not smell fresh upon arrival, not very surprising as we then found that the window could not be opened! Internet connection was way too costly, a bit strange as there are two internet cafes across the street charging less than half the Ibis price. Luggage storage came with an extra cost - however, when we protested, the kind staff let us use their office.", "Date": "January 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "2"}, "AuthorLocation": "line up", "Title": "“good position. tiny rooms.”", "Author": "nakazava", "ReviewID": "UR52945365", "Content": "good value for money. perfect position, close to downtown while on a quiet area on darling harbour. rooms are too small, but no problem if you don't have many luggage and only stay in to sleep.", "Date": "January 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Boston, MA", "Title": "“this place was just fine”", "Author": "jeanfrombos2n", "ReviewID": "UR52663438", "Content": "We really liked the Ibis King Street Wharf. We also arrived at about 10 AM after a long trip from the US and the room was ready. Quiet room even on the second floor. We loved the firm platform bed; it's what we have at home too. Yes, the rooms are small, but very well appointed and efficient and clean. I'd stay there again; good price for Sydney, which we found very expensive, and good location--we walked everywhere. And only about two blocks from the train from the airport.", "Date": "January 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Co Armagh", "Title": "“Great value for money”", "Author": "ChrissieK", "ReviewID": "UR52003403", "Content": "My 9 year old son and I stayed here for two nights at the beginning of December. We arrived at about 9am in the morning but were allowed to check in immediately. We really appreciated this, having spent the previous day and a half travelling from the UK. I found every member of staff to be polite and helpful. The location was perfect for us, being near to Darling Harbour for Sydney Aquarium and Wildlife World and the hop-on, hop-off tour bus that stops right across from the hotel. We walked to the Aquarium after dark and I felt that the area was very safe. The previous reviews are correct with regard to the room size and the no frills decor but we didn't spend a lot of time in our room except to sleep so it didn't bother us. We also found the bed very comfortable and the room was spotlessly clean. I had chosen a deal that included breakfast and we were more than happy with the variety of food on offer. All in all, I thought it was excellent value for money and would definitely stay there again.", "Date": "December 28, 2009"}, {"Ratings": {"Overall": "5.0", "Service": "5"}, "AuthorLocation": "Nashville, TN", "Title": "“Management helpful and receptive”", "Author": "Frenchbo", "ReviewID": "UR51860339", "Content": "I had an unfortunate change in my plans, and management were very receptive to making the changes I needed.", "Date": "December 25, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Atlanta, GA", "Title": "“Room so small and sparse it reminded me of a hospital room!”", "Author": "100kmilesperyear", "ReviewID": "UR51036358", "Content": "Why a hospital room comparison? Room was tiny and stark with all cold white decor and a TV mounted on wallmount with wires dripping everywhere. There was absolutely no warmth or charm or anything worthwhile about it- this hotel ruined the end of my trip, actually, as the surroundings were so depressing. I stayed in a standard queen room alone (#710) and it is a good thing as there was not enough room for two people to even pass each other in the space- one would have had to step in to the miniscule bathroom or sit on the bed for the other to walk around easily. Decor is modern, but on the very sparse side. Like others noted, the matte finish white paint must pick up smudges and scratches easily as mine was scuffed in several places. Bed is a platform style (i.e. no boxspring or mattress foundation) and very HARD as were the dreadful hard-as-a-rock pillows. ugh. Service was scattered at check in, but they did end up accomodating my request for a higher floor room as I was originally assigned to the first floor and for safety reasons, I do not like to stay close to the ground floor when traveling solo. Nothing at all to recommend about this place except for location, quite close to King Street Wharf string of restaurants and there is wifi throughout entire property- including each guest room- but there is a charge fo $24.95 a day.", "Date": "December 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Hertfordshire", "Title": "“excellent location - modern well equipped - small room”", "Author": "MuchTravelled3", "ReviewID": "UR50304088", "Content": "Hotel was only one year old and was located 2 min walk from Darling harbour. Efficient and friendly staff. Room adequate but quite small with limited hanging space for a couple. Secure baggage drop in own locker ( had to pay ) which was very useful. Extra charge for breakfast, pay either for hot or continental - but it was very good", "Date": "November 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Melbourne", "Title": "“Very convenient”", "Author": "fionarMelbourne", "ReviewID": "UR48382047", "Content": "Was very nice place to stay and very convenient close to station and short walk from attractions. The room although small was quite adequate and clean, but did require a little more attention to detail as there were dirty fingerprints on the bathroom door and dirty marks on the wall.", "Date": "November 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Troon, United Kingdom", "Title": "“The best location!”", "Author": "nthomson", "ReviewID": "UR47998442", "Content": "We have just come back from a 4 night stay, and thoroughly enjoyed our trip. The hotel's location really is fantastic, just a short walk to Darling Harbour, which was jumping on Fri and Sat night. However hotel is located just far enough away that this does not interfere with a good night's sleep! We found the rooms to be compact, but when in Sydney I don't think that matters, as we hardly spent any time in the room. The rooms are also very clean. The only small negativ point was the lack of toiletries. Our shampoo wasn't refreshed by housekeeping and we had to ask at reception for a new bottle. But that was just a little thing. Overall I would highly receommend this hotel to those people looking for a clean, friendly hotel in an ideal location, that won't break the budget.", "Date": "October 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Great location, 2 mins walk to Darling Harbour”", "Author": "londonjp101", "ReviewID": "UR47099138", "Content": "Great hotel, very reasonaly priced considering the location. 2 mins walk to Darling Harbour (King Street Wharf), 15 mins walk to Circular Quay, 10 mins walk to Pitt/George Street. 5 mins walk to ferries, monorail and cityrail (Wynyard Station). The hotel was very clean and facilities in-line with the price. Rooms on the smallish side but very adequate. We had a room overlooking the busy road, but never heard any traffic noise...ever. Staff very friendly and always helpful. If you want to be close to all the attractions that Sydney has to offer but don't want to spend a fortune, stay here!", "Date": "October 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Melbourne", "Title": "“Great value and very quiet”", "Author": "dr_rob80", "ReviewID": "UR46796520", "Content": "Stayed here for a night on business. Despite overlooking the freeway, the room was unbelievably quiet thanks to the double glazing. Bed was comfortable, bathroom was fine, and the room itself was compact, but quite workable. Check-in staff was quite nice, helped us out answering questions. The real highlight was breakfast. I had a \"pay $1 for breakfast\" deal, which made it super value. Im not sure how much breakfast normally is, but the spread was quite good and the quality was high. Location was good, close to King St Wharf restaurants and Darling Harbour, and a short walk to Wynyard station the business end of Sydney. Recommended for the solo traveller or short stay couple; not really workable for families or long stays.", "Date": "October 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Germany", "Title": "“Nice hotel, good location, highway next door”", "Author": "geromat", "ReviewID": "UR46520891", "Content": "I stayed at the Ibis hotel for four nights. The hotel location is excellent with easy access to Sydney CBD and Darling Harbour. Arriving from the airport by train the hotel is close to Wynyard station. The hotel itself is nice and clean. The rooms are quite small but this did not matter too much to me. Drawback: The window of my room pointed towards the highway. In only a few meters distance the cars and trucks were passing by. Thanks to some isolation there was not too much noise though. Staff was nice and very helpful in getting my bag repaired which had been damaged by the airline.", "Date": "October 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Standard vs. Deluxe Room”", "Author": "clu488", "ReviewID": "UR46394332", "Content": "Stayed at the Ibis for 4 nights. I booked the standard room but upon arrival I found it quite small in room size (compared to other standard rooms I've stayed in). The standard room is ideally sufficient for one person; but if you're staying with another person and bringing in large luggages, then it's going to be very tight and inconvenient. The main difference between the Standard and the Deluxe/Superior rooms is the floor space. There is much more walking space in the Superior room. Saxon was kind enough to upgrade us to the bigger room when it was available. Rooms are simple and modern, and the hotel is conveniently near the ferries and Darling Harbour. Great value, just be aware of the room size before you book ahead.", "Date": "October 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "uk", "Title": "“Excellent, all you need!”", "Author": "claramanda", "ReviewID": "UR45869727", "Content": "We stayed here for 3 nights and got a good room rate. After 24 hours of flying from the UK, we arrived early in the day with the intention of storing our luggage until check-in time later in the day. However, our fatigue must have been visible and after a couple of hours we were checked in early and given a bigger room that was available. Excellent customer service form start to finish, extremely efficient and helpful staff, nothing was a problem. Breakfast was very good, with everything available regardless from whatever time you appear. Clean and central hotel, 10 out of 10, keep up the good work! Wish we could remember the names of 2 particular members of staff who stood out with their excellent and efficient manner, one being the young lad on the desk on the morning we checked in (13th september, think he said he was from Manila!)and the chap who topped up the breakfast constantly! Thank you for making the start of our holiday a great experience!", "Date": "October 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Very impressed”", "Author": "Petal57", "ReviewID": "UR44534961", "Content": "This was a pleasant surprise- although the rooms are tiny, they are well planned and have everything you need. AND they are spotlessly clean. As others have mentioned, the location is amazing. I found the service to be fantastic- so helpful and friendly- much better than some of the 5 star hotels I have stayed in lately. At the price, this is an absolute bargain.", "Date": "September 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Holland", "Title": "“Excellent value”", "Author": "Hugo75", "ReviewID": "UR38835629", "Content": "We stayed for 3 night at Ibis King Street Wharf for a great promotion at whotif.com of 81 AUS$/night. We really enjoyed our stay and the excellent service that was provided by the staff. It got very close to the service you can expect in Asian hotels, which is very rare in Australia. I had sent an e-mail on the central Ibis website requesting a cot for our baby, because they donâ€™t provide individual branch e-mail addresses under contact information. For those who know how French systems work (I worked 3 years for a French multinational, so I know what I am talking about ï�Š) it is no surprise the e-mail never arrived at Ibis King Street Wharf. Maybe this was our luck, because apparently the normal rooms are too small to place a small cot (which really makes me wonder how small they are?) so the woman at the reception arranged room 307 for us which is normally for disabled people who have to enter with their wheelchair and thus is much bigger. The rooms are Ibis style (simple, no frills, clean) but this hotel is very new which made it the best Ibis I stayed in so far. My only comment would be that additional service are too expensive, even for Sydney. Breakfast was around 20 $/person, internet 25$ per night and we were charged 30 $ per night for hotel car park. All together, I would surely recommend this hotel.", "Date": "August 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Singapore", "Title": "“Value for Money”", "Author": "JDWJ", "ReviewID": "UR38115284", "Content": "Staff was very helpful in all ways. Rooms were cleans and made up when we were our venturing everyday. The aircon/heaters were functioning well. Beds were comfortable and a welcome sight after hours of walking. Rooms are small but good enough for travelers that want a comfortable bed to sleep on after sight-seeing the whole day. Also do not expect good views from your hotel windows. The hotel is well located in the city. It is next to Darling Harbour and two or three blocks away from Wynyard train station. For gamblers it is 15mins walk to the Star City Casino! Tip: If you are exploring Sydney for a few days get the RED PASS ticket from any train station. It lets you travel for 7 days on the public ferry, buses and trains for AUD38. The ferry is just a block away from the hotel which takes you past the Opera House and under the Sydney Harbour Bridge.", "Date": "August 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Adelaide", "Title": "“I will be coming back”", "Author": "agisthos", "ReviewID": "UR28045706", "Content": "A new Hotel is always an interesting experience. This one is furnished very nicely, the design is great, and it is on the waterfront. Rates are relatively cheap too. I got no ego from the staff, which is how a hotel should be run.", "Date": "April 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "adelaide", "Title": "“Second stay as good as first”", "Author": "bradlinski", "ReviewID": "UR27787645", "Content": "Stayed second time. Still good. Great location for me as 2 minutes from our sydney office.", "Date": "April 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Adelaide", "Title": "“Great value, great location, great experience”", "Author": "Woody_076", "ReviewID": "UR27732898", "Content": "I stayed at the Ibis King Street Wharf during a 4 day trip to Sydney in March and thoroughly enjoyed every aspect of the hotel and service received. The rooms are new and therefore in great condition, very clean and comfortable. The staff are fantastic, very friendly and always remembered my name, even when I couldn't. I had to make a last minute change to my booking and they were very accommodating to my needs. The hotel is situated in a great location, a few seconds walk from King St Wharf itself which has some great restaurants, and a short stroll from the very heart of the great city of Sydney. Whilst the rooms are not huge, they are comfortable, with the bed, linen etc.all of good quality and offering a great nights sleep. I thoroughly enjoyed all aspects of my stay at this hotel and commend the staff on a great job.", "Date": "April 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Perth", "Title": "“Nice clean and new but very small”", "Author": "balazsd", "ReviewID": "UR27262382", "Content": "I travelled with my 2 small kids and other family members, we stayed on the 7th floor and the staff were excellent and very nice. The rooms were very small as well as the shower, but if you are a traveller that stays there only to sleep then it is ok. I had a great time and it is very centrally located. The only issue I probably had was the room being so small and with 2 toddlers they kept hitting there heads on the glass table and the vanity in the bathroom. Overall though a very nice place to stay.", "Date": "April 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Adelaide", "Title": "“Compact but shiny and new”", "Author": "KimandJames", "ReviewID": "UR27210912", "Content": "As other reviewers have said Yes the basic rooms at the Ibis King Street Wharf are 'compact' but I knew that before booking and it was important for me not to have to endure a ' well worn ' room. I took my 5yo daughter and it was fine for the two of us, but we only had one suitcase (there was room under the bed for more I guess) The decor was lovely, as was the bathroom and there was nothing missing AND everything was shiny and new!! We had room 611 and this faced the freeway and into some other buildings which was kind of pretty at night - I was impressed at how well the double glazing on the small window worked. One of the \"Sydney\" websites suggests there is a restaurant - it is only for breakfast but the small bar is open late and I believe it has 'snacks'. There is a convenience store across the road, and only a short walk to all the cafes/restaurants of Darling Harbour. We utilised the King Street Wharf ferry, but you can get there via Wynyard Train Station. I wouldnt try lugging luggage back up to Wynyard though (weekend access limited) We took the ferry around to Circular Quay, then caught the train from there back to the airport. I booked direct on the Ibis website, as there wasnt much difference between that and the usual last minute booking sites. (it was a Saturday night)", "Date": "April 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Friendly staff and a Great Location”", "Author": "cookieUk", "ReviewID": "UR27052512", "Content": "My fiancÃ© and I stayed here over the Mardi Gras weekend. Although it was a busy weekend in Sydney the rate we got was really good. Yes the rooms are a little small but why go to Sydney to hang out in a hotel room! The room was extremely clean and quiet. The location is excellent with everything we wanted to see well within walking distance. The staff were very friendly and when I left my Blackberry charger there it was promptly returned to me â€“ thanks Benjamin! The breakfast was great with a selection of fruit, cereal and warm food. It was a good start to the day! Next time I am in Sydney I would be more than willing to stay here again. I highly recommend it!", "Date": "March 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Christchurch", "Title": "“Great New Hotel in Sydney”", "Author": "mhnstr", "ReviewID": "UR26091199", "Content": "We stayed here for two nights in March and were really pleased. The hotel is only a few minutes walk from Darling Harbor and about 20 minutes from the Opera House. The surrounding area includes some 24 hour convenience stores and a few restaurants, but most of the restaurants are in Darling Harbor or Pitt St, only a few minutes walk away. Our room was clean and comfortable. We had a rollaway bed in our room which was nice and not at all as bad as one might fear. Overall, we were very pleased with the room. The breakfast is from 6 to 10 and has a lot to offer. It is worth adding if you choose one of the room bookings with breakfast. The staff are a real benefit of staying here as well. They are friendly and courteous and helpful. They knew our names when they saw us in the morning and could give advice regarding sites to see. In all, a very good experience. I would not hesitate to stay here again or to recommend it. One word of advice if you are coming from the airport. If you take the train, get off at the Wynyard station and walk to the hotel (about 10 minutes depending on which door you exit). However, this is a really bad way to get to the hotel. Save money, time and walking by taking one of the shuttles from the airport to the hotel for less than the cost of the train.", "Date": "March 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Lovely Hotel, great location...but the rooms are tiny”", "Author": "Opanook", "ReviewID": "UR24932353", "Content": "We just arrived back from a weekend in Sydney with friends. Three couples all staying at the Ibis Hotel King Street Wharf. The hotel is in a good location - a few blocks walk from Wynyard Railway Station and a block from King Street Wharf/Darling Harbour. Checking in to the hotel was no problem with the staff friendly and welcoming. Our friends were already checked in and after mentioning this to the receptionist, she changed us to the same floor. Nothing seemed to be a problem. We phoned later to get a bottle opener and it was delivered very quickly with no fuss. Would have been nice to have one in the room though. When we entered our room, we were a little surprised to see how tiny it was. Just enough space for the bed, mini fridge, small table & chair and bathroom. My 5ft 11 boyfriend slept with his feet hanging over the end of the bed. We had to shuffle around each other which was a little annoying. For a one night stay, that was ok, but a few days of this would have driven us nuts. The bathroom (shower & toilet) was also on the small side but ok for what you had to do in there. Was also surprising to see timber floors in the room - was fine, but something I hadn't seen before. The room was clean, tidy and the bed comfortable. The hotel is new, so everything is still looking and feeling lovely. It was quiet with double glass windows (also small) considering we had a major road going past our window. Checking out was fine and handled professionally but felt a little sorry for the receptionist as it was right on check-out time and the foyer was packed. He handled it well and everyone seemed ok. No cranky people or yelling. A good sign. We did hear from a few of the other guests in passing who had had issues with a mistake with the parking charge, elevators that couldn't find the basement levels and a room that smelt like cigarette smoke (a unconsiderate previous guest who didn't follow the rules obviously!...which is out of the control of the hotel). We thought the hotel was affordable, clean, tidy, in a good location with friendly staff and would definitely consider staying here again for a night. My only other recommendation would be to larger, taller people - you may need to consider somewhere else with more space.", "Date": "February 22, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "York", "Title": "“Great location, watch for the parking charges”", "Author": "Ambra60", "ReviewID": "UR24070917", "Content": "The hotel had only been open for 15 days. The reception staff were still learning and so were slow. Parking is a problem. The hotel has a small number of sapces in an underground unit at the back of the Hotel. We only paid $99 dollars for one night accomodation but were charged $30 dollars for parking! No mention of this when we booked in or arrived, only when we wanted to leave. The rooms are small but well equiped. Wireless internet is available free. It is just a short walk across the road to Kings wharf and into Darling Harbour. There is also a great cafe outside the front entrance for breakfast.", "Date": "February 1, 2009"}], "HotelInfo": {"Name": "Ibis Sydney King Street Wharf", "HotelURL": "/ShowUserReviews-g255060-d1230651-Reviews-Ibis_Sydney_King_Street_Wharf-Sydney_New_South_Wales.html", "Price": "$144 - $324*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">22 Shelley Street, King Street Wharf</span> | <span class=\"extended-address\">Corner Erskine Street</span>, <span class=\"locality\"><span property=\"v:locality\">Sydney</span>, <span property=\"v:region\">New South Wales</span> <span property=\"v:postal-code\">2000</span></span>, <span class=\"country-name\" property=\"v:country-name\">Australia</span> </span></span></address>", "HotelID": "1230651", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/56/90/32/standard-queen-room.jpg"}}