{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "1", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Istanbul-Jeddah", "Title": "“Great decor, well furnished and enjoyed it”", "Author": "Review_Investigator", "ReviewID": "UR126513725", "Content": "sharing my 8 day experience: i was satisfied for what i paid, they got good prices. I didn't like the location at all, i spent alot on taxis that barely knew the Hotel. CONS: -no free wifi , you have to pay a ridiculous amount of Dirhams to get a 24hr access to net. - no business centers, so you cant even do a quick email check or fax or anything. - staff kept me waiting an hour for check in, but they apologized for it. - the sofa bed was impossible to sleep on, so don't depend on it at all, rates for an extra bed is expensive. - reception does get busy to a point they wont answer your help calls, its just annoying not so important. - I never used the pool because no one showed me where it is. - if your room is on the street side it will get noisy by cars passing by, so i recommend you to request a room away from the noisy street, PROS: -I'm an architect, and i say the interior design was 4.2/5 alot of space and good quality finishing, nice furniture and functionality. - all accessorizes were working great e.g. the fridge, washing machine, LCD TV's. - Room cleaning service was fast and basic, they make sure you get what you want. - Ordering food from outside is possible just ask for the MFC menu. - A good place to stay for couples. Must improve: The sofa bed and Internet access come on we are in 2012. Like my review please.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Jeddah, Saudi Arabia", "Title": "“Fabulous front of house staff!”", "Author": "Morjen", "ReviewID": "UR125787906", "Content": "Three of us stayed in a two bedroom apartment over the month of February 2012. The apartments are very spacious and the beds very comfortable. We had a nice balcony and the apartments are fully equiped with everything you should need. There are also many shops near the hotel for foodstuffs and the mall is easily walked to over the winter months. The hotel is also extremely close to the metro with which you can get around Dubai easily or taxis are easily come by. Taxi drivers in Dubai though to us seem rude and they drive very badly, they are also unwilling to take you short distances, but surely that's still their job?! We much preferred the metro as our source of travel and it is much cheaper than the taxis anyhow. Dubai taxis can be very expensive. After one of our friends left there was only two of us so we moved to a twin studio room, these rooms still have eveything that you need but are smaller. Unfortunately though, there was a horrible smell coming from the drains at night, but the hotel did say they would look into that after we left. Overall therefore, this hotel is great value for money. The rooms are spacious and comfortable and the pool on the roof is great along with a small gym. The staff on the front desk are friendly and helpful and the concierge also. We would like to mention Lyndon on the front desk, he helped us with the change of room and a late check out and he was always friendly, smiley and welcoming to us. We were very surprised at how hard he works, he never seemed to have a break and some days he was there 12-14 hours, always with a smile! Well done! We would also like to mention Ronald from the concierge. He again was always smiley, friendly and extremely helpful, he showed us rooms as we requested, helped store our luggage and was always welcoming with a little compliment or other which made us smile. He even noticed us walking one day whilst he was off duty and stopped for a chat! Really excellent staff. Downsides to this hotel: the internet is not included, the tv channels are very bad and there was no dvd player in the apartments. It was also very noisy and some nights we would have to call down to reception to mention that we were being kept awake by parties and voices etc. The housekeeping staff were also a little slow, some days not cleaning our room until 3 or 4pm. There was also a bad drain smell in room 502. We also thought the swimming pool would be better if only a little of it was covered, not the whole thing. However, we would definately stay here again and we would reccomend this hotel as a good value stay in Dubai.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "London", "Title": "“Spacious, Comfortable & Good Value”", "Author": "LWCLondon", "ReviewID": "UR125013703", "Content": "I spent 4 nights at the Coral Al Khoory Hotel Apartments and although a bit isolated (near to Mall of Emirates - but not walkable - nothing much is) , it was central enough to get a cab and get around Dubai - although Dubai Cabs are expensive for what they are. The bedroom, bathroom, guest toilet, lounge/dining area and kitchen were all large rooms and the amenities provided were excellent. No views to speak of however. The Reception area is totally inadequate and dark and can be overcrowded at times. The breakfast although acceptable is not great. The pool area is however quite good. If you are looking for affordable, comfortable, roomy accommodation this apartment hotel fits the bill. Nothing special but fair value - but dont leave booking to last minute as prices increase dramatically for short dated reservations.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Elmer, New Jersey", "Title": "“Will stay again!”", "Author": "fixureyes81", "ReviewID": "UR123531445", "Content": "After driving around for an hour and looking at 4 other hotels, we were so glad we found this hotel!! Our room, 317, was way bigger than the suite the Rotana had to offer and a much better price. We loved how modern the place looked, and all 3 of us said we'd like to live there! Beds were comfortable, people at the reception desk were very nice, the balcony was huge, you get discounted breakfast if you pay in advance, etc. Definitely stay here if you are traveling to Dubai with friends and/or family. Not far from Mall of the Emirates, and you can take the metro from there to the Dubai mall and Burj Khalifa.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Abou Dabi", "Title": "“Desappointing!”", "Author": "ladivaAbouDabi", "ReviewID": "UR122580012", "Content": "We booked this executive room, 607 one of the rare hotel available in Barsha area of Dubai for the nights of New year Eve, close to Arabian Ranches were we had the party. The hotel is near a metro station.but not easy to find. They say close to Emirates mall,( 10 to 15 minutes) by car but even taxi drivers did not know the hotel.. Expensive, maybe normal considering the date. Breakfast 70dhs not included. You have to add the 10% city taxes to the initial rate. The space and decoration of the lobby are very desappointing. The dining room of the suite is spacious with separated equiped kitchen .The bedroom was much smaller. The bathroom even more but with 2 bathroom sinks. Nice. Bed very confortable. Room Relatively quite. not very clean. Big balconny, but you have to ask the key at the reception to open windows and balcony. The smell of the room was very cigaretty. Pity. The breakfast very poor.You have sauna, rooftop swimming pool. Too cold.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "chennai, India", "Title": "“Comfortable and close to the Mall of Emirates”", "Author": "motheroftwoin", "ReviewID": "UR120604093", "Content": "We booked this apartment because of the price. It was quite good value for money but there was a little lack of knowledge in the central reservation staff.More on that later. The rooms were very clean and came with a small kitchenette which made life easy for us as there was no breakfast available in the hotel itself. The bathroom had a very nice shower. The bell desk staff were extremely helpful and only too ready to hail a taxi or bring the bags up etc. There is grocery store just round the corner which sold basic grocery items. The Mall of Emirates was within walking distance, but with the heat being what it is, we would only take a cab to get there. It was easy enough to get a cab with only a couple of minutes wait. The decor was very typical of the region but it was basic and clean. Now on to my peeves. In this day of the internet, it is hard to manage without being constantly in touch with the world. My husband had business to attend to as well. To make sure, I called their central reservations to check if there had wireless connectivity in the rooms or if it was via a wire. They specifically told me that they had WiFi in the room. Only after that did we bring the ipad instead of a regular laptop. After checking in we were informed that there was no wireless in the room. It was quite disappointing. Secondly, we had requested for a late check out while making the reservation itself, but that instruction was also not passed down. Even after reconfirming this on check in, they did not make a note of this and on the day of check out, it ended being a small issue which was resolved quite easily but an issue nonetheless. There was enough on the television channels to keep us up to date. Overall it was a comfortable stay in a clean and well equipped room.", "Date": "November 15, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Muscat, Oman", "Title": "“Good Value”", "Author": "Farsy", "ReviewID": "UR118104735", "Content": "The hotel was quiet good with a modern design. Also the hotel is near to one of the biggest shopping malls in dubai (( Mall of the Emirate ))", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“for people who are seeking (practical)”", "Author": "ibnbattota", "ReviewID": "UR116915006", "Content": "this hotel is not fancy, however, it has many facilities and services near it which are the following: beauty salon, supermarket and lots of arab and pakistani resturants. you can easily find a taxi , it costs 6 dirhams to emirates mall. i would visit it again and i recommened for people who have set a low budget", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Espoo", "Title": "“Don't stay here”", "Author": "FinnTalsi", "ReviewID": "UR115907777", "Content": "Location is good, by the MOE, but that's pretty much everything what's good about the hotel. Rooms are big and ok, but cigaret smoke and noice all over the hotel. Noice get's bed at the lover floors around 23.00, don't know why. We waited for baby's bed for four days and when we got it, it smelled so bad that we could't let our 6-month-old sleep in that.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Houston, Texas", "Title": "“Ok Long Term Lodging”", "Author": "gnordin", "ReviewID": "UR113175676", "Content": "I stayed here off and on for business for about a year. Overall the staff is good. Service in Dubai is lacking overall but this is due to training rather than capability. Decent location in Al Barsha with many restaurants around. Size of rooms are good, especially in the apartments. Room service is lousy, definitely look outside for food. Conveniently a very short walk to the train and only one station away from Mall of the Emirates. You can also walk there but it is a decent walk, plus its just too hot. We had a corporate rate so the value was very good for us. Swimming pool closes too early.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "abu dhabi", "Title": "“superb value for money”", "Author": "gaurav797", "ReviewID": "UR109190534", "Content": "this is a great hotel apartment, i have stayed here many times and must say it is fantastic value for money. i have been very impressed with the space of the rooms at the rate that i get them. there is a pakistani restaurant below which has phenomenal rolls however, it may be spicy for the western traveller. on the whole, highly recommended,", "Date": "May 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Lewes, United Kingdom", "Title": "“Enormous appartment, ok location, great quality for a short stay”", "Author": "jazpops", "ReviewID": "UR103777012", "Content": "This was a nice place, it is surrounded by sandy car parking areas so the views are not spectacular. You can see the Mall of the Emirates' (ski slope) from the balcony (which you needed to get a key from the reception desk to open) or from the roof. The mall was a short 5 -10 minute walk away. The roof pool was fabulous; large and warm with views, a sun sail and a lifeguard. There is a separate children's pool area (beware of slightly sharp tiles when sitting on the walls), towels and a few loungers with shades. It was never busy when we were there. The appartment was a 3 bedroom affair on the top floor, it was very large with a sitting room, TV kitchen, iron and ironing board, fridge, washing machine, loads of storage, three toilets and two bathrooms. Beds were comfy and no noise, very slightly jaded round the edges but nothing major and clean, we were very happy with it. Apart from the Mall of the Emirates you would need a taxi (or bus tour) to get around. (There is also the train / metro at the mall), however, taxis are cheap. Hail them from the street it is the cheapest way. From the airport expect a 30 minute ride or so and it will cost you about 75 Dirham (plus tip). The beach and a number of other areas cost around £5 (30 Dirham) for five of us. In that sense the location is not perfect but it is relatively close to everything so it is a good location and getting about is easy. We took an open top bus tour which was about £40 each but it took all day and went everywhere, I would fully recommend this for day 1. Get it from the Mall of the Emirates on the ground floor near the Carrefour entrance There are some minimarkets in very close proximity for milk, water, cheese. breads, cornflakes etc, you won't need to pay expensive breakfast prices as you have a kitchen. The restauant looked nice and cklean and bright but we didn't use it. The one negative was about the staff. When you saw them, they greeted you etc they were great (one lady particularly helpful) and friendly, however, we rang down for a few things, 'please open the patio door', 'needed another towel', 'broken clothes horse' etc. On the first occasion we had to ring again after an hour and on the last occasion they simply never came! Overall, liked it a lot, good value £480 for 3 nights for 5 people, good quality like a home from home. Not quite 5 star but decent 4 star I'd say and I would stay there again, even the father-in-law thought it was good!", "Date": "April 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Tenerife", "Title": "“1 week with family, very nice for The price.”", "Author": "johntenerife", "ReviewID": "UR101687088", "Content": "1 week with 2 children. Helpsome and very friendly staff. Nice, quiet pool on the rooftop. 800 m to The Mall OF Emirates. 200 meters to The metro. DId not try The hotel restaurant, but just outside The hotel was Kebabhouse, which had nice food, for a good price. No alcohol at The hotel, but 4 min. Walk to hotel which serve. The only negative was The price OF internet, 50 AED pr. 24 hours. A bit pricy!", "Date": "March 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cape Town", "Title": "“Good value for money”", "Author": "explorerCapeTown", "ReviewID": "UR93235491", "Content": "We stayed at the this hotel for 5 days. Excellent value for money. We booked early and payed the lowest rate for an ambassador suite. The hotel is conveniently situated, approximately 300 m form the Sharaf DG metro station. The trip from the airport via the metro was 30 minute. If dsembarking from this station, the hotel cannot be seen, only the side view is visible. Just ask for directions as people are extremely helpful. Check in and check out was efficient. The staff are very polite and gave helpful advice. The apartment was enormous with three bedrooms and four flatscreen TV's . Rooms were bright and modern. This hotel is within easy reach of most of the tourist attractions . The mall of the Emirates including Ski Dubai is, in my opionion about 900m away, but if you are not keen on walking, the mall is the next metro station away.", "Date": "January 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“lovely”", "Author": "Aka186338", "ReviewID": "UR89719366", "Content": "Just had three wonderful nights at this hotel. I was suprised for what we got for the price. A junior suite which is literally like a one bedroomed, modern aparment. Separate sitting area, fully equipped kitchen , 1.5 bathrooms, 2 flat screened TV's Very spacious more than enough for the two of us. The area is very quiet with a few empty sandy plots probably waiting to be developed. There was no building work around the hotel. A few minutes walk will take you to the mall of Emirates with eating places, skii dubai and lots of shops. There is a big carefour supermarket nearby for all your groceries.The metro station is 5 minutes walk away making travelling to the other parts of Dubai easy. You can take a metro to Dubai Marina and then take a taxi to Jumeira saving you on cab money. But generally the taxis are cheaper than in england. Its best to grab some alcohol in the duty free for home consumption before you hit the bars as its very pricey there. I had stayed at a more expensive luxurious five star hotel the previous night but now I dont see the point not much difference. afterall you spend most of the day out. Check out was a bit slow and beds slightly small but I will definately go back . Thanks Coral Al Khoory for my stay", "Date": "December 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Ashgill, Scotland", "Title": "“Fantastic value”", "Author": "AndyMc1976", "ReviewID": "UR84670464", "Content": "Stayed here for a week with my family (5 of us in all). Didn't know what to expect as got a really good deal. The lobby was bright and modern and we got checked in straight away without hassle. On arrival into our room, we were all blown away by the sheer size of the living space. This was great for my kids as they had plenty of space to play. Great kitchen, 2 bathrooms and a seperate WC and a huge living/dining area plus 2 large rooms. Beds were incredibly comfortable and the locale around the hotel is pretty quiet, so good night sleep had by all. Room service everyday, would question how thorough they cleaned under beds etc but not an issue. Hotel had a rooftop pool, supermarket around the corner and the Mall of Emirates only a 5 minutes walk away. As there was a full kitchen in the apartment, we never used the hotels restaurant. Our family had a brilliant holiday and the Coral Al Khoory was a great base. The area around the hotel is still under development so don't expect beautiful surroundings. Taxis were always plentiful but be careful if you only want to go a short distance, they aren't keen. I found jumping in the taxi, closing the door and then telling the driver where we wanted to go worked a treat. Everyone has a different experience but I would find it hard to see how someone can say this hotel was poor or terrible. A definite thumbs up from me.", "Date": "October 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Muscat Governorate, Oman", "Title": "“Wow......superb place to stay”", "Author": "docshakib", "ReviewID": "UR78472821", "Content": "I booked the hotel online for 1 night, and fortunately since i was traveling on a weekday, so got very competitive rates. For the price i payed and got top notch facility. The location is great, with neighboring Mall of the Emirates. There is a gr8 Pakistani Restaurant below the hotel, offering a wide variety items for iftar dinner these days for just 60 AED. The Junior suite i booked was super clean with all the facilities that any one could imagine. Bed were very comfy and the overall atmosphere was chic and stylish.The next best thing was the free underground car parking facility. I surely recommend this. Keep up the good work guys at Coral", "Date": "September 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "newcastle upon tyne", "Title": "“Pretty good value”", "Author": "jaynewcastle11", "ReviewID": "UR75798079", "Content": "Stayed here for 7 nights & quite happy with nearly everything. Very modern looking reception & so nice to get into the air-conditioned foyer off the street. The reception staff were excellent & always available & happy to chat. The Junior suite was spacious & good value (by Dubai standards), good modern bathroom, modern facilities throughout the room (but no iron), with large fridge/freezer, 2 burner hob, microwave, & washing machine in the kitchen area. Filled the fridge with my own food, water & beer, no problem at all. 32\" Flat-screen tv, 49 channels with a couple of sports channels. Its a new 7 storey hotel/apartment block, built a couple of years ago, still surrounded largely by empty land/potential building plots, with no construction work/noise at all during my stay. There was no access to the room balcony during my stay, but I wouldn't have spent any time out there at all, as no view from the smaller rooms balconys.There is no grass/vegetation surrounding the hotel, despite the pictures used to advertise it, just sandy lots, waiting to be built on. Used the roof terrace & rooftop swimming pool a lot, always very quiet & relaxing place to hang out. Peeked into the gym once, looked impressive. Also had a sauna room but never used that as well. Didn't use the restaurant/room service, but prices were not bad at all really, per the menu. Location is good, 10min walk to Emirates Mall, or a 4 minute 10Dhs taxi ride, taxi's were always available outside & never had to wait. Large Carrefour supermarket at the Mall, is next to the taxi pick-up point, so not far to walk with any shopping, never had to wait for a taxi here as well, though a couple of drivers weren't happy with just a short journey to the hotel.. Plenty of cashpoints & places to buy food around the Mall as well. The Metro station at the mall gave quick/cheap access to the rest of the city, although the metro stations aren't yet all open. The only thing I didn't like, was that there was little soundproofing in the rooms & various noises were easily audible in your room, especially at night time. I was woken up at least once, every single night of my stay. You could always hear the large heavy doors shutting as people came & left their rooms, along with their voices as they talked in the corridor. Had a baby in the room next door for 2 nights, & on the last night, had several people in the room across the corridor laughing & shouting until 2am, unfortunately I had to get up at 4am for the taxi to the airport.. Apart from the noise, everything else was good, apart from there being no bar at all :(", "Date": "August 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "midlands", "Title": "“Relaxed, Modern, Young Apartment”", "Author": "candy_xyz", "ReviewID": "UR68036919", "Content": "As in many of the hotel apartments in Dubai, this one also has everything you need including microwaves, washing machine etc. There is not washer dryer and for some reasont hey do not let you have the key to some balconies, so your clothes will be drying in the apartment! I have stayed here twice now as well as having friends that live in this apartment, and rooms vary greatly. I have stayed in one room where the bedroom was super king size (5 of us slept in it after a night out - don't ask!) and was easily 40ft wide, to another that was about20ft wide and could just about fit the smaller bed in it! This hotel is very 'relaxed' as i have seen on more than one occasion, men bringing 'lady friends' back to the hotel..... It is only 5 floors, which those of you with vertigo will be glad to hear, and has a rootftop pool and sun lounging area, which is great for the sun lovers! Staff are always friendly and helpful, everything is clean and modern, there are a number of takeways and restaurants in walkign distance including one next door, and then there is always room service, so food is not problem. In addition to that McDonalds and KFC deliver in Dubai......say no more..... This is also in walkign distance (5-10 mins) of Mall of the Emirates, the mall with the ski slope as well as it being the more manageable mall, the other mall, the largest one in Dubai Mall (im wondering if i have go the two Mall named mixed up there??) is so big, even someone that loves shopping like me can get sick of it, and fed up with trying to find te shops you are lookign for!) As with many places in Dubai there is a lot of building work going on around it, so i am unsure what the lovely rooftop pool will be like with other buildings around it, if they do plan to do this. Woudl recommend this hotel to anyone, the prices are also very reasonable, as Al Basha 1 where this is is not the trendy side of town like somewhere like Jumeirah Lake Towers, but don't let the price fool you into thinking you are getting much less, except for a few different fixtures and fittings! It also has a great gym...better than the one in the more expensive and trendy Bonnington in Jumeirah Lake Towers (where i ahve also stayed) may i add!", "Date": "June 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Great Place to stay”", "Author": "SERENITY143", "ReviewID": "UR64036527", "Content": "The staff is very friendly and helpfull. The rooms are clean and spacious. Close to Mall of Emirates. Breakfast buffet is good. An excellent value for money.", "Date": "May 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Shiraz, Iran", "Title": "“Pretty Good!”", "Author": "camelshiraz", "ReviewID": "UR59830580", "Content": "Stayed at Coral Al Khoory Hotel Apartments in Dubai for 8 nights. We booked a studio with a King-size bed online (without breakfast). We requested twin beds and called them to make sure they would give us twin beds and the answer was 'Yes'. Seems like all studios with twin beds are only on the 3rd floor. We were happy with the hotel. It was clean and the staff were friendly.The room was spacious and nice. They give you a complimentary bottle of water, some tea bags, coffee, and sugar the first day. Everything functioned well. Although the water drainage had a little problem in the bathtub the last couple of days. But nothing major. Also, there was no DVD player in our room. Our room was cleaned by housekeeping everyday and all our dirty dishes were washed every morning. The only thing that was annoying was that every morning housekeeping would ring the doorbell to ask what time to come and clean up! One thing we forgot to do was to hang the \"Do Not Disturb\" sign at night, but all the same, they should just wait for the \"Please Clean My Room \" sign instead of ringing the doorbell !!!! The view from the hotel was nothing special. The hotel was walking distance from the Mall of Emirates. It took between 7 to 10 minutes to get there. However we did take a cab a few times since it was hot or late at night. Taxi to the mall was less than10 Dirhams but we would always round it up and pay the driver 10. The Metro station was in the Mall of Emirates so it was quite convenient for us to get to Dubai Mall or other places. A silver card for the Metro was 20 Dirhams, which has 14 Dirhams credit on it. It could be used for both the Metro and Buses. I would recommend this hotel apartment to friends since it was quite good for the price you pay.", "Date": "March 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "estartit", "Title": "“Why stay in a hotel?”", "Author": "billym", "ReviewID": "UR59428283", "Content": "We stayed for 8 nights in a 1 bedroom apartment and will definitely return on our next visit to Dubai.Large spacious apartment with independent kitchen , large batheoom and separate toilel.Equipped for two persons so 'invite any guests! The apartment as well as having washing machine, ironing board etc .etc. had 2 large flat sreen TV's , ideal when one of you is russian and the other from UK. The pool area although not glamorous was great although the chilled pool was almost too cold.There was also an exercise room and men and ladies saunas.The Indian restaurant on the ground floor is also very good value. Great value for money!", "Date": "March 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manama, Bahrain", "Title": "“Quiet hotel, reasonably close to MOE”", "Author": "JJRae", "ReviewID": "UR55604802", "Content": "The reception is a little 1970s, but the staff were very helpful, and check in was quick. The room was very nice, large TV and I love how there was an iron and kettle, and the snacks were not over-priced. They say they are walking distance to the Mall of the Emirates, which they are, but it took about 10 minutes so could be difficult in summer.", "Date": "February 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Excellent Value, Location, Size, Amenities and Quality!!!”", "Author": "Ehsan A", "ReviewID": "UR54894344", "Content": "I'm 30 years old, travelled with wife and a 3 year old. Found this place online. It's located right by the Mall of Emirates, 10 minute drive to the Burj Al Arab (most luxurious hotel in the world), 15 minute drive to Jumeirah Beach and Burj Khalifa (tallest building in the world). Chose this place because it was one of the lowest priced for the location. Wasnt expecting much, but it was EXCELLENT. It seems like its brand new. Huge apartment with wood floors, travertine bathrooms. Big kitchen with washer/dryer. Right next door is a very cheap pakisani restaurant open till midnight. Around the corner is a supermarket, which helps save money because we would buy milk/cereal and keep it in the apartment for breakfast. Staff is very nice and helpful. I've travelled the world and stated at 5 star hotels, and even cheap 2 star motels. If I didnt read up on this place before hand and just showed up, I would assume it was 4 stars and probobly very expensive to stay.......and the best part is it was very reasonable priced for all the quality and location and amenities (full kitchen with dishes, daily cleaning, very nice rooftop pool with a view, gym ). OVERALL RATING: 5 STARS!!!", "Date": "February 1, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sydney", "Title": "“Handy location for shoppers”", "Author": "wisdom_of_others", "ReviewID": "UR54552129", "Content": "This hotel is just a few blocks away from the Mall of the Emirates. You could practically walk there - only in the UAE nobody walks ;). So if you are in Dubai for a shopping trip this location is great, also because you can catch the metro from the Mall of the Emirates to travel to the next station to the biggest mall - the Dubai Mall, which again is next to the tallest building in the world: the Burj Dubai (also known as Burj Khalifa). Although close to Sheikh Zayed Road, the main artery of the city, the hotel is quiet. We stayed in a junior suite, which had a kitchen and bathroom. Very comfortable rooms and modern decor. My husband loved the Sony Bravia. Small but nice rooftop pool. Service a bit slow, but friendly. Has an underground carpark. And not too pricey. Had a really good time there.", "Date": "January 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Beautiful, Comfortable and Affordable”", "Author": "MarJohnson", "ReviewID": "UR48556048", "Content": "Having stayed in a few hotels in Dubai over the years and having lived in dubai for 5 years I feel I'm quite well qualified to comment on accomodation in this amazing city. Coral alkhoory Hotel apartments is the one of the best in the city. However as far as rooms and service goes it's excellent. The rooms and beds are very large clean and well serviced. My room had a huge walk in shower as well as a bath with a second shower over it. Also there were tea / coffee facilities, an in room safety deposit box and a good sized wardrobe. Internet access was included and worked without problem for the whole days I stayed at the apartment. The hotel is located in easy walking distance (10 minutes) of the Mall of the Emirates and is about a 15 minute walk from the Mall of the emirates METRO station. Also within easy reach of the hotel are supermarkets (there's one below the hotel),", "Date": "November 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Munich", "Title": "“Definitely NOT a four star, more like a three star”", "Author": "WorldWideTraveller88", "ReviewID": "UR43364251", "Content": "I stayed in the Coral Al Khoory for 3 weeks and my first impression was that I walked into a hotel built in the 1970s. The furniture colors were terrible shades of browns, yellows, greens. How can this be a new hotel?? The smell in the lobby reminded me of wet dog, however it seemed to get better rather than worse during my stay. The staff are your typical Yes Sir, Yes Ma'am sort of robotic types who were friendly enough, but unable to multi -task and check in took ages. During my stay I actually witnessed and argument between 2 of the staff which was quite very unprofessional. It also seemed like the Arabic guests got priority a better service than I did being a Western Male. The pool is new but fairly small. There are a lot of screaming children which made it difficult to read and relax. They gym is pretty basic and all in all everything is quite clean. I think for Dubai there are much better 4 star hotels, for example the Al Manzil in Old Town.The Coral Al Khoory should be a 3 star. Would I stay at the Coral again? NO.", "Date": "September 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Doha", "Title": "“Good Choice”", "Author": "khalid606", "ReviewID": "UR33624720", "Content": "This is a brand new hotel apartment in Dubai (open Jan 2009) It has studio, 1, 2 and 3 bedrooms apartments. It’s suitable for families. The location is good, near Emirates Mall. The rooms are spacious, and all of them have LCD TV in it. The hotel has a lot of facilities, like car parking in the basement, swimming pool, and gym The only disadvantage is that the internet is available only for a fee.", "Date": "July 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ferney-Voltaire", "Title": "“Perfect”", "Author": "noll02", "ReviewID": "UR28665981", "Content": "I choose this hotel for the price and the location and it was a really good thing; the hotel is just few minutes by walk from the Mall of Emirates. You need to take the taxi (that you find very easily) to go in the city but it's really cheap (15 dirhams to go to the Burj Al Arab and 30 to go to Jumeirah Beach Park). For now on there is no construction around the hotel (on its block). The swimming pool is really nice and there is always someone to help you around. I had a studio which was very clean and big enough for a person. The employees are really nice to you Just that if I go back to Dubai, I would choose this hotel back without doubts", "Date": "April 24, 2009"}], "HotelInfo": {"Name": "Coral Al Khoory Hotel Apartments", "HotelURL": "/ShowUserReviews-g295424-d1231330-Reviews-Coral_Al_Khoory_Hotel_Apartments-Dubai.html", "Price": "$81 - $279*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Sheikh Zayed Road</span> | <span class=\"extended-address\">P.O. Box 6237</span>, <span class=\"locality\"><span property=\"v:locality\">Dubai</span></span>, <span class=\"country-name\" property=\"v:country-name\">United Arab Emirates</span> </span> </span> </address>", "HotelID": "1231330", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/81/1d/811d0b0cb4e43e91e51b3824f1c3ff746large.jpg"}}