{"Reviews": [{"Content": "Congratulations Iberostar! If lucky enough to be enjoying the Ibersotar Grand Hotel's beach, you will be inevitably asked by many, What hotel is this? Is it new? Well, I fully understand the curiosity because Iberostar has raised the bar for Punta Cana and especially all-inclusive resort here and throughout the Caribbean.They truly understand what luxury is... simple, clean, soothing, spacious... all that describe this 299-room hotel that could so easily have accommodated another few hundred rooms. Fortunately for us, they didn't! The difference, here, is they have provided an openness and abundance of space, allowing you to skip the buffet chaos or beach and pool chair wars!The hotel has obviously spent much time and money on design and finishes to truly put their guest at ease... it shows! The minute you disembark the travel transfer bus from the airport (30 minutes away), you realize that you have arrived at something and somewhere special... not the norm. The finishes are truly that which you would expect of a palace: ceremonial hallways, objet d'arts, varying reception areas, large expanses of water, marbles and rich thick carpets, etc. Butlers are assigned to each room, but admittedly, they are scarce after the first day. You'll see them every so on, but so far their is not consistency in when or who will assist, if required. Our room/suite was more a kin to being in Europe than in the Caribbean. Although not huge, they have an ante room which shield from any unwanted noise outside your door. Here are located the closet, safe area and mini-bar... they even stock your favourite premium liquor of choice! The room itself has a king bed or two doubles, a dining table for two, chaise lounge, LCD wide screen TV and have been simply and elegantly finished. Each room has a verandah with wood / teak-style floors, a couple of chairs and a small couch. Bathrooms are very bright and airy. Ours had a jacuzzi, glass shower stall, two granite sinks and separate toilet area. The jacuzzi looks over your verandah with electric shades to allow more light and a better view -- note other can see in too! Even the hallways at this resort are worth a mention. Rich cushy carpets, columns, art pieces and architecturally pleasing four storey vaulted open spaces with skylights... very cool! The pool area is something out of a CondeNast or Travel  Leisure magazine. Beautiful free form pools with plenty of chairs, beds and even some chairs partially immersed in the pool. Yes, of course, the requisite swim-up pool bar is here too! The have uniformed servers, a pool cabana with concierge to help with any requests: dining reservations for example. They have a choice of recent periodicals and a variety of suntan lotions compliments of the resort. Even at full capacity, I don't imagine they will run out of spots for their guests. The beach is absolutely gorgeous! Set back from the turquoise waters, the powdery white sand beach has plenty of palapas, chairs and beds... they even have beach service for drinks and room service, etc. For those whom are looking for a more traditional, active and happening beach / pool scene you'll have to seek out other resorts... no pushy actvities staff and limbo dances here... although they do offer yoga and salsa lessons on the beach. They have lots of equipment for volleyball, darts, games, activity pool etc. and Star Friends are there to assist and if you want, join you in a game or two! Food is a highlight at the Grand Hotel. Four themed restaurants (Le Tourbouillon, Japanese Teppenyaki, Le Gourmet Surf  Turf and Italian), three bars (Mirada, Pool Bar and Galleon), a large buffet restaurant and 24 hour room service! We did not have a bad meal on our stay. If fact, each meal was delicious. Yes, it is a new resort, so staff have still not mastered the Italian or Japanese restaurant protocols/courses, but otherwise very impressive: white glove service, good wines included, a staff that truly want you to enjoy. In fact, on New Year's one of the courses was so good I asked if it would be served again during the week. They answered... let us know when you want it and we'll make it for you! Now I am sure that is not their standard, but a huge change from the formula based institutional kitchens so common at all-inclusive resorts. The most impressive libation spot is the galleon. It's a real sailing sloop. You can drink up on deck or go below where they spin music with LCD screens all around you... somewhat club like! They even built a lake (pond) for it to sit in.Note that when staying at the Grand Hotel and only for IB Grand Hotel guests, they offer access to all other three (3) other IB resorts: Punta Cana, Bavaro and Dominica. We ate at Pagoda (Chinese) at IB Punta Cana. Well worth the extra effort to head over.Oh and one last thing... no kids! No children running around without supervision, parental or otherwise, adding to your relaxing time away!This resort may not be for everyone i.e. families, those whom want a more active vacation, etc. ... here, the higher more formal (Dominican style) level of service, quality and amenity are truly a welcome change.", "Date": "Jan 3, 2009", "ReviewID": "UR379334382", "Ratings": {"Service": "5", "Business service": "1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "kph"}, {"Content": "Not ready yet       room doorway", "Date": "Dec 29, 2008", "ReviewID": "UR688823298", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "senduawaycom"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g147293-d1233228-r23220177-Iberostar_Grand_Bavaro_Hotel-Punta_Cana_Dominican_Republic.html", "HotelID": "1233228", "Price": "Unkonwn"}}