{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great find in a spread out city!”", "Author": "NJGirlvTheWorld", "ReviewID": "UR125445141", "Content": "I was having a tough time finding a good hotel in Berlin because the city seemed so spread out and I wasn't sure what part of town I should be on to maximize my time there. I'm a solo female traveler on a budget. So what I typically look for is: WALLET FRIENDLY, safe neighborhood (particularly at night), close to train/mass transit, free wireless internet and my own bathroom. This hotel had it all!!! I arrived early from Brussels and my room wasn't ready. But the front desk said they would rush to get it ready for me and offered me complimentary wine while I waited. I think the gentlemen saw how tired I was from traveling (this was the 3rd stop in my 5 city tour). Within about 30-45 minutes my room was ready. The room was spacious, clean and had everything I needed. I didn't sleep well while there but it had nothing to do with the bed. The bed was comfortable, I think I was starting to get a little sick and was trying to fight it off. I was still a bit confused by the U/S bahn system when I arrived but after spending less than 5 minutes with the front desk I was on my way. They were incredibly helpful with my travels and all questions I had. There isn't much in the area as far as sightseeing (O2 World arena) but the train is about a 5 minute walk and a few stops to the city center & most attractions. The hotel is in a very quiet, low profile neighborhood. I saw women out walking with their children and just normal everyday activities going on. I would often return from sightseeing at night and felt 100% comfortable. I walked past a few bars that looked like a good time but was too tired to stop in (and was trying to fight off a cold). The front desk arranged a cab for me since I needed to get to the airport very early in the morning (5AM). No one was at the desk so they told me what do to with my key and packed me a breakfast which I kept in my fridge in the room until it was time to go. I stood outside for about 10-15 minutes waiting for my cab at 4:45AM in the dark and felt completely comfortable. I found this hotel very last minute after booking a different hotel and I'm glad I did. It was absolutely a great find. It met all the needs I stated above and was very budget friendly!", "Date": "March 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bury, manchester", "Title": "“Great location as a base in Berlin”", "Author": "Brian96", "ReviewID": "UR121544983", "Content": "Reading some of the reviews you would think we should never book his place. But i did anyway. We stayed 4th to 7th December 2011. As mentioned its a short walk to both the U and S bahn train services that can get you to all the main places quickly. Breakfast was fine with a good selection of cereals, cold meats and bread, eggs and sausages. Staff, we never experienced any of the poor service mentioned in other reviews - perhaps its all about what attitude we as customers have as well!!!! The room had all you need, a bed, a TV, a shower and toilet - its a room folks, you sleep there! We could have done with another two days to take in more of the city and will probably come back in spring or summer - and no reason not to stay here. One tip. We did teh bus tour the first morning which is fine but on the second day we did a walking tour with www.insidertour.com its a 3 1/2 to 4 hour walk with a break and gave us so much more information and knowledge. Its not hard work and i can guarantee your interest will be maintained, plus of course you can ask questions as you wander. They do a number of tours and if we had extra time we woudl have done a couple more - try it instead of the bus and see it all up close.", "Date": "December 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Paris, France", "Title": "“great realy 4 stars except for matress and too much light”", "Author": "rozi509", "ReviewID": "UR115759683", "Content": "clean. great breakfast..freindly service.7minutes to train ,quiet,modern", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Wokingham, United Kingdom", "Title": "“Ideal for our 3-day Berlin itinerary and we would stay there again”", "Author": "Automorph", "ReviewID": "UR114885065", "Content": "Ideal location for walking to the O2 arena and the Berlin Wall East Side Gallery. Also very quick links to central Berlin via nearby S-Bahn and U-Bahn station. Surprisingly spacious room, comfortable and clean. Good buffet breakfast that included hot and cold food - set us up well for a day's sight-seeing. Quiet and relaxing neighbourhood. Friendly, helpful staff, all of whom spoke good English. We want to go back to Berlin soon and would definitely stay here again.", "Date": "June 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“Lovely hotel tucked away from it all!”", "Author": "Pammi0203", "ReviewID": "UR94937537", "Content": "We arrived earlier than check in and the very friendly staff were more than happy to look after our cases. The hotel is about 5 mins walk from the train station and if anyone is going to the O2 Centre it is about 15mins walk away. The bedroom / bathroom were very clean and tidy and because bedrooms face on to an inner courtyard, a totally silent night was enjoyed. The breakfast at 6euros was probably the best we have experienced for a while. Lots of fresh fruit / yoghurts / cereals / eggs and sausages plus continental breakfast choices. Lovely choice of hot drinks, which were topped up as required by the very attentive staff. Supermarket a few mins walk away and plenty of cafes / restaurants locally.", "Date": "January 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Friendly, cheap, great facilities, good location.”", "Author": "PeterN62", "ReviewID": "UR94522560", "Content": "Thoroughly recommended, especially the large single loft rooms. Based on the price and location I really cannot praise this hotel highly enough.", "Date": "January 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“great hospitality, very rich breakfast and good sleep quality”", "Author": "lior14", "ReviewID": "UR92507606", "Content": "We liked very much the staff of the hotel, their hospitality and kindeness. They gave us a very good homefeeling. The hotel is equiped with all the facilities needed. The rooms and the public areas ars very clean. We liked our stay at the hotel and will come back on our stays in Berlin", "Date": "January 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Frankfurt", "Title": "“great hotel, perfect value for money”", "Author": "arnsch", "ReviewID": "UR75421926", "Content": "We stays at the nu-hotel and enjoyed every minute of our stay. The location is in a very quite neighborhood. Acess to public transport is an easy 10-minute walk. Supermarket (open until midnight) also very close. The staff was very friendly and helpful at all times. The room as clean and perfect for our needs. Breakfast was good, nothing special, but perfect for a city-tour and included in the room rate. Will definitely come again !! Very good value for money.", "Date": "August 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Steiermark", "Title": "“Gem hidden in a courtyard”", "Author": "Austriacus", "ReviewID": "UR71226106", "Content": "After more than half a dozen stays in Berlin in the course of the last three years I was a little suspicious when I learnt that nu hotel Berlin would offer three-stars service for a room rate typical of Berlin's two-stars accommodations. I booked this hotel despite my distrust and have not regretted that. The entire little hotel is situated in a court. Thus, none of the rooms is affected by street noise. The hotel is only about one year old, so it is mostly in perfect shape. The rather small room where I stayed as a solo-traveller was equipped with a king-size bed. I suspect that it is also used as a double-room. For a couple the room would be very small indeed and cupboard space would be scarce. What I missed in the modern and minimalistically designed room was a piece of furniture where to put the suitcase in order to unpack and pack it. You have to do this on the floor in order to avoid laying the suitcase on the white bed-sheets. Apart from that all the essentials are there, even a desk with a decent lamp and a comfortable chair. What I appreciated most was the comfort of the bed because this is something I am always looking for but rarely find in hotels. In nu hotel Berlin one can even get special pillows on request. Although my stay coincided with a terrible heat wave and nu hotel Berlin is not air-conditioned, I was not kept from falling asleep since it was possible to leave the window wide open due to the tranquillity of the place. A bit of a nuisance was the poorly constructed swivel door of the shower cabin. It required hard pulling and pushing to open and close it. Since it opens to the outside, the floor of the otherwise cleverly designed albeit small bathroom becomes wet when one leaves the shower. In my three attempts I did not find a successful technique to avoid that. The young staff was friendly, helpful and especially attentive at breakfast. I did not miss anything at the breakfast buffet. There were even fruits, freshly prepared fruit salad and scrambled eggs. The U-Bahn and S-Bahn stations of Warschauer Strasse are not just around the corned but in short walking distance and provide excellent connections. An enormous plus of the area is the huge number of restaurants of any kind in and around the nearby Simon-Dach-Strasse. All summed up, I can recommend this hotel without any reservations to solo-travellers since it offers good value for astonishingly little money. For couples, however, this may be a another matter.", "Date": "July 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great value for money”", "Author": "villarosie", "ReviewID": "UR36541244", "Content": "We stayed in a double room for four nights, and couldn't be happier. Having arrived early, they were more than happy to mind our luggage and even take it up to the room for when we returned later. We had booked a small double room, but turns out the 'small' is surprisingly spacious! The double bed was clean, as was the large and well lit bathroom that looked brand new. The tv even had satellite channels in English, a nice extra we weren't expecting. Buffet breakfast was included and despite saying it was continental only, they did serve eggs and sausages, along with plenty of bread, cheeses, spreads, fruit and pastries. The staff were more than happy to take a tea and coffee order as well. The hotel is located near a train station, as well as a tram line. The area didn't look very safe at night, but with the long summer days it was never an issue. We assumed the great value for money comes from the questionable location. Still, it's a short walk away from the Berlin Wall, 02 stadium and the trendier student suburbs, and there are plenty of shops along the way. Definitely recommend a stay here, the friendly staff and beautifully clean room made it a great stay.", "Date": "August 3, 2009"}], "HotelInfo": {"Name": "nu hotel berlin", "HotelURL": "/ShowUserReviews-g187323-d1308958-Reviews-Nu_hotel_berlin-Berlin.html", "Price": "$72 - $114*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Gubener Strasse 46/47</span>, <span class=\"locality\"><span property=\"v:postal-code\">10243</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "1308958", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/dc/c3/12/getlstd-property-photo.jpg"}}