{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Turku", "Title": "“Nice, clean place to stay.”", "Author": "HannaVTurku", "ReviewID": "UR122721314", "Content": ".It was easy to travel with bus or metro to city. The rooms were nice and tidy. Bathroom just renovated. There were some small shops nearby in order to get some snacks or drinks to rooms.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Verwood, United Kingdom", "Title": "“Good value hotel”", "Author": "TripperBH", "ReviewID": "UR121120223", "Content": "We stayed here for 3 nights and although our room was not very big it was very clean and looked as though it had recently been refurbished. The staff were very friendly and helpful and breakfast had a wide choice of continental and hot food. The location was great as the 109 stops right outside. Travel around Berlin was very easy, buy a day ticket and you can use the bus, tram or train as many times as you like. had a wonderful time and would definitely stay there again.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Very good hotel”", "Author": "kirsi n", "ReviewID": "UR119758658", "Content": "Very good value for money. Breakfast very delicious. Room very clean and nice, everything worked!!!", "Date": "October 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Riyadh, Saudi Arabia", "Title": "“good value for money”", "Author": "abujasim", "ReviewID": "UR119438731", "Content": "I stayed in this hotel for a total of 6 nights. Room was very small but comfortable. The location is very good, you can find the supermarket just opposite to the hotel and you can take the bus from the station near to the hotel. The hotel is about 10-15 minutes walk to the ICC center and the the norde messe train station. you can find a buitiful lake just near the hotel. I would not book this hotel again if I go with family because the rooms is very small but I would certanly book there if I go alone..", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "blackpool", "Title": "“Fantastic Xmas Markets in Berlin & Great Hotel!”", "Author": "BlackpoolSharmlovers", "ReviewID": "UR91336546", "Content": "We stayed here for 4 nights in Dec 2009 with my mum and her husband. We came for the Xmas markets. The Hotel was lovely, clean and comfortable, reception staff speak english and can give you a map of Berlin. The breakfast was continental but they did have some German bits and bobs that you can eat (sausages, Lamb kofta bites?, Egg, Beans) The Underground is very near the hotel ( go out the door, turn left and then turn left again, to the top of the street is the underground) You can use the underground to see all the sights in Berlin, an all day ticket is 6 Euros but you can get on and off the under ground and over ground train, we used this to get back to the airport! so dont use a taxi there more expensive. The maps for the underground are very easy to use and understand. They dont seem to have any English tea anywhere in Berlin apart from McDonalds! so had a few trips to get mums brews from here, they are pretty much everywhere. The Xmas markets were fantastic! they all sell the same things, most of which we didnt want but they still looked fab! (gingerbread hearts, hand carved xmas toys,lampshades, mulled wine etc) The foods stall are excellent, we ate lots of sausages! Bratwursts are lovely! also they have some doghnut balls with iced sugar on them that are just awesome! The markets are very attractive to see and it feels very christmassey when you see them. Eating out can be a tad expensive in restaurants etc. We stuck to the street vendors and Mcdonalds etc. We found a great Itallian place that serves great pasta dishes that are quite cheap. It is situated on the same road as the hotel -Neue Kant Straße about 15 mins walk down the street. We went to all the attractions, the Berlin wall & Brandenburg Gate are a must and Alexanderplatz and Potsdamaplatz both have lots to do. There are some great shopping centres here if you want to shop. All in all we had a Magical time here and we would def go back.", "Date": "January 1, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "mumbai", "Title": "“Ideal hotel for Messe Berlin”", "Author": "satana66", "ReviewID": "UR90196024", "Content": "I was there for IFA, the second largest show for consumer electronics, and wanted a hotel close to the Messe Berlin and also reasonably priced. During trade shows hotels increse their rates almost 4-5 times, making it unaffordable for the common man. I was happy that I got Ivbergs Hotel Charlottenburg. Theres another Ivbergs from the same group - The Ivbergs Berlin Messe, so be careful while booking. The hotel is just 10 minutes or 2 stps from the Messe. The rooms are modern, air-conditioned rooms with free Wi-Fi. Transport connections from airport are good. They have breakfast for an additional Breakfast 9,00 EUR. For Indians theres is a good Indian restaurant within walking distance.", "Date": "December 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Good comfortable hotel at a reasonable price.”", "Author": "tumbuna", "ReviewID": "UR75391081", "Content": "This hotel is slightly out of the centre and about a 5-10 minute walk from the station but has buses to Tiergarten directly outside. The breakfast is quite healthy and fresh fruit is available. WiFi is available in the rooms and is quite fast. Reasonable priced restaurants around hotel. Good quality rooms with new appliances and cleaned daily.", "Date": "August 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Berlin, Germany", "Title": "“Nice rooms, great price, recommended!”", "Author": "GermanKatze", "ReviewID": "UR70649593", "Content": "Stayed at this hotel while waiting for our apartment to be ready and were very impressed. The room was brand new and very tastefully decorated. The hotel also allows pets at a reasonable rate which was very helpful for us since we were in the middle of our move to Berlin and needed a place that allowed pets that was actually nice. Highly recommended!", "Date": "July 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Ayrshire", "Title": "“Great Hotel in Upmarket Location”", "Author": "LDunlop", "ReviewID": "UR61220538", "Content": "Just back from a five night stay at the Ivbergs Charlottenberg Hotel. We found the hotel lovely and clean with friendly staff. The breakfast was very substantial and consisted of hot and cold dishes, bread, rolls, fruit etc. The area in which the hotel is situated is quite upmarket and we never felt threatened in any way during our visit to Berlin. Although you are a wee bit away from the main sights, public transport is excellent. However, we walked to the Brandenburg Gate, which took about an hour and thereafter into the centre of the city. There is a lovely restaurant across the road from the hotel called the Pula Grill and this is very reasonable and the food very good. Free salad and apperitif.", "Date": "April 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Edinburgh", "Title": "“Very comfortable and friendly hotel in a quiet district but very close to public transport.”", "Author": "ian2010Edinburgh", "ReviewID": "UR56141287", "Content": "Just back from a short break to Berlin. 3 nights at the Ivbergs. Warm, comfortable and generously sized room with good ensuite. Good selection at buffet breakfast. Handy for public transport to main areas of Berlin. Staff very welcoming and helpful. Should the weather be as cold and the pavements as treacherous, recommend the Pula Grill opposite the hotel for evening meals. Good range of food from fish, chicken to meats. The steaks are particularly tasty and all at a reasonable cost. Liked the aperitif and the salad presented free as part of the meal.", "Date": "February 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Belgium", "Title": "“Good Hotel near the Congress Center”", "Author": "BrusselsSprouter", "ReviewID": "UR47406584", "Content": "The hotel was basic but perfect for our meetings at the congress center which was only 10 mins by foot. We were only a bit annoyed that the bathroom was right NEXT to the bed and the vent kept turning itself on and off during the night and one could hear it even with the door closed. Breakfast was for 9 Euros, but I chose instead to go for the yummy bakery goods and coffee at the supermarket across the street. Good wifi connection. Parking is available in the back for 9 (?) euros if you can't find a spot on the street. No complaints other than the forementioned bathroom vent hums during the night.", "Date": "October 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Moscow", "Title": "“excellent for the price, but far from center”", "Author": "Thefall", "ReviewID": "UR35927758", "Content": "+ very cheap (I paid 140 euro for 3 nights, DBL room), maybe because it's brand new + excellent rooms for a 3* star hotel, all new, spacious and clean, nice bathroom + nice breakfast + quiet area, no street noise - far from center and U-bahn (subway): 5-7 minutes walk to Sophie Charlottenburg U-Bahn station, then 4-5 stops to Zoo", "Date": "July 27, 2009"}], "HotelInfo": {"Name": "Ivbergs Hotel Charlottenburg", "HotelURL": "/ShowUserReviews-g187323-d1378963-Reviews-Ivbergs_Hotel_Charlottenburg-Berlin.html", "Price": "$67 - $218*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Neue Kantstrasse 2</span>, <span class=\"locality\"><span property=\"v:postal-code\">14057</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "1378963", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/47/db/47db605dea1c98a7a1d000cfb0dff13d2large.jpg"}}