{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location and price”", "Author": "Beakette", "ReviewID": "UR126766317", "Content": "The area directly around the hotel is a little grimy but the location is really great for the price. The staff were really helpful, the price includes good wi-fi in the rooms and breakfast and the hotel is pretty new so our room was spotless. It's only a 10 minute walk to Soho and Greenwich Village and even less to the Lower East Side. There are plenty of restaurants and bars within walking distance and the subway is one block away. It's a good choice if you want to be near Soho etc but can't afford to stay there.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nova Scotia", "Title": "“Good Budget Hotel”", "Author": "deweybelle", "ReviewID": "UR126466174", "Content": "Here are my random thoughts on this hotel: Initially, we walked right by it as the name is written in Chinese. I later noticed that when it's near check-in time, a sign with the logo and name in English is put out at the entrance. Staff was wonderful, ready to help when needed. We arrived at the hotel way too early for check-in and they kept our bags in a designated room. Like many rooms in New York City, the room was small. For example, the chair for the desk was right against the bed. When not using the desk, though, there was a spot for the chair which didn't impinge on space. There was also an easy chair in the room. The bed was as high as Mount Everest so had to actually climb onto it. Once in the bed, it was extremely comfortable. All the lamps had easy to use buttons so no fumbling in the dark. One lamp had 2 extra outlets attached to the base. Wifi was free. Grand Station for the B and D lines was a 3 minute walk. Bowery Station for the J and Z lines was a 5 minute walk. Both of these were just off Chrystie Street. Breakfast was from 7-10 AM and had the usual stuff. The tables were spread throughout the floor. My favourites were the ones by the window. Chinatown is very busy outside on the sidewalk. The chinese buses depart from about a block away. Have patience when walking. Everyone on the sidewalk was polite but it was crowded. We enjoyed our stay at this hotel.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Buderim, Australia", "Title": "“Convenient location, good value, modern facilities, free breakfast”", "Author": "bangforbucktravel", "ReviewID": "UR126163005", "Content": "We stayed a total of 8 nights and we were on the 7th floor, just high enough to have a partial view of the bridge. If possible request a higher floor. The rooms are cozy, I guess this is NYC style. The bathroom was quite a generous size and very clean, modern shower head and facilities. Good hot water, water pressure and drainage. Nice, clean and firm bed only issue with ours was that it had a broken plastic mattress protector, so the corner of plastic kept jabbing my partner, nothing major though. The free breakfast was pretty good, often got a little too crowded, we always went near closing time though, so it's to be expected. Very close to Grand Street station, walkable to Canal Street station which has some different Metro lines. Towards the end of our stay we were a bit concerned about the constant smell of cigarette/cigar smoke, the hotel is 100% non-smoking so we spoke to the front desk about it, they said they would investigate. The smell did still hang around, but the lady at the front desk was very nice and she did seem genuine about investigating for us.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Albany, New York", "Title": "“Great deal, great view”", "Author": "Kim T", "ReviewID": "UR125589959", "Content": "Fun location to explore Chinatown and Lower East Side. Traveling alone and never felt unsafe, stayed 2/26-2/28. Hotel staff were very friendly and helpful. I booked a loft room which was clean and comfortable and had an amazing view of the Manhattan Bridge. Very good value.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great location!”", "Author": "LittleMissTravelBug", "ReviewID": "UR125243328", "Content": "I come to NY every couple years and i'm always looking for a cheap and clean place to stay in the city. I was told that this hotel is relatively new and decided to give it a try - good thing i did! It was clean, the staff was courteous, and above all location - location - location! This hotel is located between Chinatown and Little Italy. Within a short walking distance, there are several places to eat (Chinese, Italian, fast food places, etc), a couple of different subway stops, and steps away from the foot of the Manhattan Bridge. If you're a foodie there are several great restaurants, and famous ice cream & gelato places to try! This hotel includes a decent continental breakfast and wifi is available throughout. I would recommend this place is you're looking for a clean & well located place to stay. Hope you enjoy the big apple!", "Date": "February 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Milan, Italy", "Title": "“Very good value for money, clean and comfortable hotel; but...DO NOT ACCEPT their costly car service to the airport”", "Author": "simo2512", "ReviewID": "UR123927341", "Content": "The hotel has revelead a very good choice: the position is really convenient (located near the lines B and D and, some minutes away, even the brown lines J and Z), safe and almost quiet (though you certainly have to realize that it is not as fancy as the 5th avenue!). Rooms are comfortable and very clean, as the whole structure is. As other recensors were pointing out, morning breakfast is complete but you have to be patient for a table, especially if you come down at \"rush hour\" (around 8am). Wi-Fi is included. Staff is kind and helpful, and the hotel also gives you the opportunity to store your luggage after check-out (which is at 11am) until you leave for the airport. Only con I encountered: if on your check-out date you need a taxi to the airport, do NOT accept the receptionist offer (which is indeed a sort of rental with driver, and not a taxi service): it costs you 60$ while with a normal cab you would pay 45$ (fixed price of ANY New York taxi on any ride between JFK and Manhattan). When the last day I asked to call me a taxi at the reception, I was told that the service would cost me 60$. Being really late, I accepted without questions, but when I got home I found out that with a normal taxi I would have paid 45$! There's nothing illegal, of course: 1) I was told in advance the price and I accepted (although I had explicitly asked for a taxi, they said \"yes\" and instead I was sent a \"for hire vehicle\" with no taximeter, no taxi sign on top of the vehicle or on the doors, in short a different - and more expensive - service) and 2) I was given a normal receipt, with the name of this normally registered company. But still..this means taking advantage of me being new to the city, and throwing in the toilet 15$ though obtaining exactly the very same service! But apart from this final point, the hotel is really worth the price.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Great Value Hotel”", "Author": "MrAWill", "ReviewID": "UR123915139", "Content": "This was my first time staying here and I really enjoyed it. We opted for one of the loft rooms that overlook the Manhattan bridge; I highly recommend this upgrade, it made for a unique experience (unless you have kids, lofts only have one queen bed). Hotel is very clean and modern and practically in the middle of Little Italy and Chinatown which was quite the cultural experience with a plethora of wonderful foods to try. Hotel is very accessable to the subway and within walking distance (within 30-40 min walk) of the Manhattan Bridge, World Trade Center, Brooklyn Bridge, and Battery Park (where you get on the boat for Statue of Liberty). Travel Tip: You will be in the heart of Chinatown where many of the small family businesses do not accept credit cards so keeping a small amount of cash is a good idea.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Watford, United Kingdom", "Title": "“Great Hotel, would recommend to all”", "Author": "fordred89", "ReviewID": "UR123455090", "Content": "This is a great hotel. You'll definitely get more than what you pay for here. The hotel appears to have just been refurbished, and the rooms are amazing. The are large, clean, and have great views. I was lucky enough to be given a corner room on the 8th floor with a view of the Manhattan Bridge from one window, and the Financial District in the other direction. I cannot fault this hotel at all, and I'll definitely be recommending it to others that want to travel to New York.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "coatbridge", "Title": "“great time at comfort inn”", "Author": "chellybop", "ReviewID": "UR123267226", "Content": "forgot to review this when i got back - went for st patricks day 2011 for 7nights - had a fab time hotel was great clean comfortable bathroom spotless and room size was fine - stayed on 14th floor which had great views of the bridge - the free breakfast was great and a fab way to start of ur day in the big apple - loved the free wifi as it allowed me to keep in contact with family for free - we arrived at 1pm and got checked in straight away and when we were leaving they kept our bags for us and organised a private taxi to take us to the airport - great hotel at a fantastic price wld defo recommend to friends and family and would return", "Date": "January 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Great location but not so good service”", "Author": "Kartos", "ReviewID": "UR122978054", "Content": "This hotel is conveniently located near Manhattan bridge and Grand subway. It's located right amidst the Chinatown markets and inter-city bus agents, making it quite crowded nearby. Breakfast offered was good although I've had much better service in much economical hotels. My wife and I wanted to have a quick 3 day view of Manhattan and this was totally worth the money.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Decent hotel for the price”", "Author": "lenusvyat", "ReviewID": "UR122377405", "Content": "Decent hotel for the price although very odd location", "Date": "January 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Virginia", "Title": "“Better Than Expected”", "Author": "luv2go2day", "ReviewID": "UR122288982", "Content": "Packed between buildings in Chinatown, this hotel was nicer than I expected. Clean, larger rooms (for NYC), nice comfortable bed, spacious shower. It even had a little table and desk with a chair. Perfect for my daughter and me as it was her first trip to the Big Apple. The streets around the hotel were a little dirty as debris from the produce markets would spill out onto them. The staff a the hotel were very kind and helpful, especially Ivan, who escorted us to the roof of the hotel for some amazing views of the city and a great photo op. The Grand Street Subway was an easy walk and Little Italy was also located close enough for walking.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Belgium", "Title": "“Very Enjoyable Stay”", "Author": "BrusselsSprouter", "ReviewID": "UR121653120", "Content": "I chose this hotel based on price and Tripadvisor reviews and I was not disappointed! The location is perfect for exploring Chinatown and Little Italy, and the staff was ultra-friendly and helpful. Breakfast was very generous. I've stayed at Comfort Inns before and have always had a nice experience and this stay was just as enjoyable. I very much appreciated having a view of the bridge and what seems to be a community center where festivities were taking place with fun sounds and music. Safety was never an issue - I felt perfectly comfortable walking around in the evenings. I would've loved to have stayed longer to explore Chinatown and eat more dim-sum, but I had to move to Times Square to be closer to work meetings there.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Montpellier, France", "Title": "“Good value, great service”", "Author": "Hikingirl", "ReviewID": "UR121524888", "Content": "This pleasant hotel is located near Chinatown, a safe and lively district. Several subway stations are within a walking distance : Bowery J line direct to Jamaica (JFK airport), Grand Street D line leading to different attractice places (Greenwich village, Times Square, central park) and Canal Street with several lines to downtown and uptown. The hotel is 100% non smoking, a real asset. The staff is professionnal, polite and helpful. Checkin and checkout are fast. The hotel offers free services such as in-room Wifi, left-luggage, adaptor plugs, 2 laptops with printer are available at the front desk. The room was clean, well equipped with coffee making facilities, an iron and ironing board, flat screen TV, safe. It overlooked Manhattan Bridge. The bathroom was large and modern with a powerful shower. The shower curtain needed to be cleaned. Suggestion : for hygiene reasons, curtains should be replaced by glass shower panels. They serve a basic complimentary breakfast : juice, fruits, coffee, tea, sliced bread, muffins, waffles, yogurt, eggs, cereals. The breakfast room is very small and not cosy at all. It is the only weak point about this very good value hotel.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Pittsfield, Massachusetts", "Title": "“decent”", "Author": "Joan M", "ReviewID": "UR121377970", "Content": "Hotel itself is clean and comfortable. When you walk outside onto the sidewalk, it smells of garbage. Only 1.5 blocks from subway is very convenient. Continental breakfast is same as all other hotels with stale supermarket pastries/bagels, strange vat of hot food (discs of egg and sausage in perfect circular shape), waffle maker. I have a hard time eating that when there are so many great bagels to be had in NYC!", "Date": "December 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Zeist, Utrecht, Netherlands", "Title": "“Nice hotel”", "Author": "Fried B", "ReviewID": "UR121310432", "Content": "Comfort Inn Manhattan Bridge is a nice and friendly hotel. It's located in Chinatown, with Little Italy just around the corner. The tube is only 100 meters from the hotel. Breakfast is great and the personnel is very hospitable. Only, the room could be a bit bigger, but hey, it's New York.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Las Vegas", "Title": "“Could not ask for anthing better”", "Author": "DayTripping77", "ReviewID": "UR119914580", "Content": "I am so glad we found this hotel. Our average daily rate was about $175 which is very hard to find in the city. All other hotels that we looked at online in this price range had mixed reviews and we were very nervous about staying at them. When we found this hotel on Trip Advisor we saw that almost 100% of the reviews were overwhelmingly positive and decided to book. We now see why the feedback is so favorable. This place is no joke. Our room was spotless, quiet, comfortable, and even had a view of the Manhattan Bridge. We were located right across the hall from the elevator but were never once disturbed by noise. The hotel offers FREE in-room WiFi which is invaluable. Try finding that in your average hotel. Staff was friendly and helpful. The location is great as your are just a block or two from the nearest subway and you can walk to Little Italy in just minutes. The surrounding Chinatown neighborhood has a million restaurants and is bustling with activity. There is nothing sketchy about the neighborhood at all. The large bathroom had a spacious tub/shower combination and appeared to have been newly remodeled. When you picture the bathroom of a budget friendly NYC hotel you picture something like a broom closet and expect cracked sinks and leaky faucets. This bathroom has immaculate and could have been something out of a four star hotel. We took advantage of the free continental breakfast each day -- another big amenity given how expensive it can be to dine out in the city. If we find ourselves back in NYC in the future we would stay here in a heartbeat. Thank you to the whole staff for making our trip economical and enjoyable.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Rochester, New York", "Title": "“Just what we were looking for”", "Author": "breederqueen", "ReviewID": "UR119799632", "Content": "My husband and I traveled to NYC for my 30th birthday. When I initially started looking for places to stay I had a difficult time finding anything that was within our price range. Boutique hotels had boutique prices. The corporate hotels were charging boutique prices as well. Then I decided to check out the Comfort Inns in NYC since we've had positive experiences with them before. While still pricey (but hey, it's NYC) I came across this Comfort Inn at Manhattan Bridge. Of course I turned to Trip Advisor to get the scoop and was impressed with what I saw. So I booked the hotel and I'm so glad I did. The this Comfort Inn is located right in China Town. While on the smaller side it was huge on value, location, cleanliness, and service. We got into the city earlier than our check in time but the gentleman at the front desk was more than happy to hold our bags till check in. We were greeted with a warm smile and much welcome. In fact every employee we dealt with was beyond friendly. When we did get into our room we were highly impressed with how clean and well kept it was. I mentioned before it was on the smaller side but it was still bigger than our bedroom at home, so we actually felt quite comfortable and cozy there. The bathroom was pristine and I have to mention that the shower was great. The water was the perfect pressure and the hot water adjusted well. (I often find hotel showers to have either weak pressure or way too hard of a pressure. And sometimes the hot water can be spotty in temperature adjusts. - I know, a minute detail but I think worth mentioning) I will admit I was nervous when we got to our room because it was smack dab in front of the elevator. After the first night my worries were laid to rest. We never once heard the comings and goings of other patrons. In fact we were wowed at how quiet the hotel was. We didn't even hear the common hustle and bustle of the NYC streets. While complimentary breakfast was offered we didn't take advantage of it because vacation means sleeping in for us and sleeping in means just beginning to stir at 10 (which is when the breakfast ended) The location was great. We were only a short walk to the subway and a lot of times we just walked instead of taking the subway because the weather was great and there was so much to see around us. The neighborhood was safe even late at night when we were coming home from the bar. Never once felt threatened or weary. We loved this place and were happy to have stayed there. We definitely got our money's worth and look forward to staying there again in the future. While it wasn't anything super fancy or posh it was clean, well kept (the furniture looked brand new), friendly, and perfectly located for us. Oh and it had free wifi that worked like a charm! (Always a plus!) This was just the right place for us. Keep up the great job guys!!", "Date": "October 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Alexandria, Virginia", "Title": "“Modern and Clean”", "Author": "Moonlightkiz", "ReviewID": "UR119532355", "Content": "Stayed one night at this hotel and was surprised at how clean and modern the room was. I had a horrible experience with a previous Comfort Inn thus I did not have any high hopes for this place. However, after reading reviews on TripAdvisor, I decided to give it a try. The room is small but cozy. The bathroom is clean. The bed isn't as comfy as other hotels I have been but nevertheless the sheets were clean. I didn't get the best sleep possible since the bed became unbearably rough. The location is very conveniently located in Chinatown and is right off of Manhattan Bridge. It is about a 10 minute walk to SoHo and is also near a metro. If you drive into the city, there is a parking garage connected right next to the hotel ($30.00 parking for one day). All in all, I would stay here again.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Little Gem”", "Author": "TraveljohnsonJ", "ReviewID": "UR118809068", "Content": "Rooms may be on the smaller side; but, the rooms offer everything you could want, The rooms are stylish and super clean. This hotel has exceeded my expectations. You better hurry because once the masses discover this hidden little gem, the rates will most certainly skyrocket.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Stratford, New Zealand", "Title": "“Wouldn't hesitate to stay again!”", "Author": "Gavin D", "ReviewID": "UR118439811", "Content": "My wife and I stayed at the Comfort Inn twice within a two week period in July of this year either side of a 5 day stint in Canada. We were looking for budget accommodation in New York with a self contained bathroom....all other hotels in the same price bracket were half the size and had shared facilities which we weren't keen on. I selected the hotel based on the reviews I'd read on tripadvisor.com, and although my wife was aghast at what she saw when we arrived at 1.30am after a late incoming flight, the place was everything I'd hoped for. Our first two nights were spent in a corner room overlooking Manhattan Bridge which was a magnificent view. On the second stay our room overlooked some neighbouring roofs which weren't very attractive, but everything else about the place was so good it didn't matter. The air conditioning worked (although the maids turned it off whilst we were out for the day as our stay was in during the horrendous heatwave), so by the time we got back the room was hot again and took a little while to cool down. The bathrooms were well equipped and nicely decorated. The beds were a little unusual being quite high off the floor, but comfortable nonetheless. Internet access was free, the single lift spacious and quick (and had been certified a couple of months before we arrived) and the free breakfast was convenient and enjoyable, especially the waffles which we don't have in New Zealand. The staff were all friendly and very helpful. The place does stand out from the untidy buildings around it that are typical of China Town, but it was a great base to experience New York with easy access by either walking or the subway. China Town was a wonderful experience, especially getting to see the families spending time together in the adjacent park, Grandparents, parents and grandchildren all spending time together, teenagers playing basketball or handball. Not something we're used to seeing back home. No gangs, no patches, no wayward youths, no boy racers, but the occasional homeless person going through the bins looking for food. The streets were a little smelly in the extreme heat, especially when the rubbish bags were out on the footpaths, but we quickly got used to it. Never once did we feel threatened or unsafe in any respect.....all my concerns about protecting ourselves from pick pockets were completely unfounded. I would'nt hesitate in the slightest to go back to China Town and the Comfort Inn would be my accommodation of choice.", "Date": "September 22, 2011"}, {"Ratings": {"Location": "3", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Brasilia, Brazil", "Title": "“Very good experience”", "Author": "Souzaac", "ReviewID": "UR118327697", "Content": "I just came from NYC and I had a very good experience in this hotel. I stayed there for 15 days with my wife and my three-month baby. I got there at 9:30am and check in time was 3pm. At 10:30am, as soon as maid cleaned up an available room they allowed us to live in. So We could enjoy NYC. Staff was very friendly and helpful. They arranged a crib as soon we asked for. Room are modern, well furnished and clean. I think that hotel was open two or three years ago. It has a good matress, a 2-door wardrobe with a safe where fit a laptop, coffee facilities, desk, wi-fi internet, flat panel TV. Bathroom is great. At front desk there are two complimentary computers and printer. They serve a basic breakfast. ItÂ´s not that breakfast but enough to hold untill lunch time. And itÂ´s complimentary! Breakfast was apple, bagels, waffle, oatmeal, corn flakes, muffins, pastries, sliced bread, hamburger, sausage, yogurt, coffe, milk, tea, boiled eggs, cream cheese, butter, maple honey, orange and apple juice. Hotel is located in Chinatown. ItÂ´s closed to Grand Station (one block) and Bowery Station (three blocks). Within a walking distance from Soho, East Village, Ground Zero. About 10 minuntes. Canal Street is right there. I recommend car service to airport. I paid $ 65 for a Lincoln, with tax, to Newark. Almost the same price of a yellow cab but more convenient. I would stay there again.", "Date": "September 19, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Couldn't ask for anything more”", "Author": "360flip", "ReviewID": "UR118212610", "Content": "Stayed for 5 nights Sept 8-13, $237/night advanced purchase directly through their website. Our flights arrived early and left late in the day and it was great that they held our bags for us. Every staff member I came in contact with was friendly and helpful. The room we stayed in was 1012, which is on the SW corner of the building. Very quiet room. Everything was clean and modern (you can tell it was recently renovated). Breakfast was included every morning which consisted of oatmeal, juice, coffee, tea, english muffins, bread, bagels, fruit, hard boiled eggs, waffles etc. It was nice that they had whole wheat options. Would definitely stay again.", "Date": "September 16, 2011"}, {"Ratings": {"Location": "4", "Overall": "3.0", "Value": "2", "Service": "4", "Rooms": "3"}, "AuthorLocation": "UK", "Title": "“Great Location if you want to be near Chinatown, Little Italy and the Lower East Side”", "Author": "JenniferCM", "ReviewID": "UR118077384", "Content": "There were 3 adults travelling to NYC over Labor Day weekend. We booked a bit late and had great difficulty finding a room with 2 double beds for 2 nights. The Comfort Inn was the least expensive we could get - and the cost was over $700 for 2 nights !!!!! For me the location was great - right near Manhattan Bridge, Chinatown, Little Italy and within walking distance of the Memorial site for the World Trade Center. Also close to Battery Park for access to the Statue of Liberty and Ellis Island. The hotel is very small. The double bed room was at the back of the hotel so it was quiet, however it was VERY VERY small for 3 adults with luggage (even without luggage). But we basically used the room for sleeping and showering - certainly couldn't sit and have a cacktail together. The staff were very good - the front desk was most helpful with ordering car service for us (which was good) and also helping us with tours. Breakfast - yogurt, cereal, juice, hard boiled eggs, toast, pastries, coffee, juice etc. I wasn't expecting any more so I wasn't disappointed.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Playa Blanca, Spain", "Title": "“Great value”", "Author": "tyhe", "ReviewID": "UR117789207", "Content": "We spent about ten nights here during the end of august (even during the hurricane Irene). The hotel is very clean, rooms are nice though they are pretty small and breakfast is decent. Connections from the hotel by subway are good and its very close to the nearest station. Locations is good in China town but also one can get fed up with the smells etc that may be characteristic to this area (no smells/sounds on the hotel street though). The personell are very friendly and helpful and we would recommend this hotel to everyone.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Budapest", "Title": "“Very good, enjoyed the stay here”", "Author": "vk_hu", "ReviewID": "UR117577242", "Content": "We have spent two weeks in this hotel with friends and it was a good choice. The room was clean and spacious (which is rare in NYC) with direct view to the Manhattan Bridge. We asked for a quiet room and got one in the 7 th floor, so there was no noise coming from the streets. Towels were changed every day, sheets were clean and there was coffee and tea available in the room. The safe deposit box is also available for free. Breakfast is included in the room rate, but it is really basic breakfast. Bagel, cereal, muffins, fruits and fresh waffles can be a bit boring after two weeksâ€¦ but for a short stay it is OK. The staff was nice and helpful, gave us additional blankets when we asked for it. Before arrival I was a bit nervous about being in Chinatown, but we never had any bad experiences. The area is safe even in the night. Subway is near, you can be in uptown or downtown in 15 minutes. The streets are a bit smelly (thereâ€™s a fish market at the next corner), but you canâ€™t smell anything in the hotel.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Good time”", "Author": "Justin W", "ReviewID": "UR117361291", "Content": "New York is truly the cit that never sleeps. The wife and i were pleased with this hotel and recommend it to others. The location and convenience to restaurants and shops. It was also near my aunts which made it even more appealing. Clean and generous in space.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Manchester, England", "Title": "“Great value for money”", "Author": "Rick1981", "ReviewID": "UR117060116", "Content": "Not the best hotel in the world but excellent value for Manhattan. The room was fine. Nothing amazing but clean, adequate bathroom, good A/C. We were on the 8th floor so were away from the traffic noise. The hotel is two minutes walk from Grand St Metro, which is then ten minutes ride from mid-town Manhattan (Times Sq, Central Park etc). From the hotel door you're within a few minutes walking distance of Little Italy, and can walk to Battery Park in not too long. You're also right in China Town and near to the Lower East Side Tenement Museum / Katz Deli. Buffet breakfast in the morning. Again, not sensational but perfectly fine - cereal, pastries, muffins, fruit and juice etc. Also free internet for guests. If people want luxury, don't go here, but if you want a good and affordable base, it's perfect.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Mississauga, Ontario", "Title": "“Great hotel + location”", "Author": "Liz D", "ReviewID": "UR116472015", "Content": "Stayed here for my second trip to the city. The location is great, near the Manhattan Bridge that you can walk and see it, as well as great proximity to a subway on a good line. Rooms were always cleaned, AC worked fine, and bathrooms looked like they'd been renovated recently so everything was just what we needed. When you stay in NYC you're rarely in your room anyways, so as long as you have comfortable bed, clean bathroom and good TV you don't need much else. The breakfasts were simple but always filling and just what we needed to fuel us for the start of the day. Overall, a good hotel, great location [if you can ignore the typical Chinatown smells, etc] and just what we needed.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Chapel Hill, NC, USA", "Title": "“Affordable, decent hotel in lower Manhattan”", "Author": "Frugal_Traveller", "ReviewID": "UR116285950", "Content": "Stayed for 2 nights over Memorial Day weekend. Hotel and room were clean, staff efficient and courteous. The building has 10 or so floors, with only 2 or 3 rooms per floor. We were on the 8th floor in a corner room with 2 Queen beds and an office nook with desk. Plenty of space for one couple, maybe two. We had nice views of Manhattan Bridge and lower Manhattan from our windows. The only drawback is that the room was very warm and we had to run the A/C even at night, which was kind of noisy and blew cold air right on the bed. Bed mattress very firm, which I like. Pillows were very thick, which I don't like: it elevates my head and bends my neck too much. Bathroom was very clean and looked recently remodeled. Complimentary breakfast was so-so. No fruit or eggs, but the basic bread, cream cheese, cold cereal, instant oatmeal, waffle maker, coffee, juices.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "bonn", "Title": "“Gutes Preis Leistungsverhaeltnis”", "Author": "panasiagirl", "ReviewID": "UR116081210", "Content": "I remember I spent two nights at this hotel a very very moderate rate for NYC. The room was decent and big enough. Bathroom very clean. Bed was comfortable. Location was at the center of China Town - so it really depends on whether you like it or not. For me I had huge fun to live near the China town because I was grown up in China as well. This hotel also offered a free breakfast - very limited quality and quantity, aber if it is free, I would say it was not bad :)", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Charlotte, North Carolina", "Title": "“Glad I Picked This Hotel”", "Author": "Cent_Ingrid", "ReviewID": "UR115362533", "Content": "Yes the hotel is between Chinatown & Little Italy. But once you walk through the door, you will be impressed. The staff is so helpful, especially Bryan. They recommended places to eat and directed us to many of the major attractions. We stayed in a room with a loft and we loved it. The bathroom is very modern and updated. We had a view of the Manhattan Bridge from our window. You can't beat this place for the price. Little over block to the subway station (Chrystie & Grand St). We walked to Battery Park (Statue of Liberty) and passed Ground Zero on the way. Centrally located to many attractions...", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Elkin, North Carolina", "Title": "“The Big Apple”", "Author": "mlscomm", "ReviewID": "UR113149463", "Content": "Excellent location next to Chinatown and Little Italy. Spacious room with great view of the Manhatten Bridge from the loft, especially after dark. Excellent housekeeping. Continental breakfast with Belgian waffles. One short block and a half from subway. This is our hotel of choice for New York.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Coventry, United Kingdom", "Title": "“Excellent Value for Money”", "Author": "Mrsmob", "ReviewID": "UR106884447", "Content": "We stayed at this hotel for 4 nights, it is an ideal location away from the hustle & bustle of uptown NY, it is only one block away from the subway at Grand St which takes you to the main area's eg rockefeller centre, 5th avenue etc. Breakfast is included in the hotel which consists of cereal, fruit, toast, english muffins, bagels, muffins, danish pastries, waffles {which you make yourself}, definitely enough to keep you going all day. No complaints about breakfast, can get a bit crowded but we always managed to find a seat & always managed to get something to eat, the staff are always replenishing the bagels, muffins pastries etc. Room was very clean & tidy, beds a bit high but very comfy. As we were going for my sister's 40th I emailed the hotel to request a room with a view of the manhattan bridge, & that is what we got, we were on the 9th floor so the view was brill", "Date": "May 4, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“DON'T STAY HERE”", "Author": "misanthropist", "ReviewID": "UR105212181", "Content": "I reserved a room with a credit card. When I arrived I was told there were no rooms available and that I was out of luck, although my credit card was charged for the room! No attempt at all was made to find me a room at another hotel! After two hours of haggling I finally got the \"manager on duty\" to find me a room at another hotel, which he had to put on his personal credit card because his boss, Lawrence, wouldn't authorize him to put me in another hotel where they could direct bill Comfort Inn! Total fiasco, total waste of time, total morons.", "Date": "April 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cheshire", "Title": "“Comfortable And Clean”", "Author": "Boswell90", "ReviewID": "UR104381608", "Content": "A very comfortable room, very clean and well serviced. The area could get a little noisy first thing The location (in Chinatown) might not be to everyones taste but its very convenient for the subway with three stations close by. Wonderful eating places on the doorstep and \"Little Italy\" five minutes walk away. If there is a fault its the breakfast area which just isnt big enough. Had to wait for a seat on a couple of mornings. No problems with breakfast itself, more than adequate.", "Date": "April 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Luxembourg City, Luxembourg", "Title": "“Nice stay. Close to the subway. Did not like street where the hotel is located.”", "Author": "pgranja", "ReviewID": "UR103010249", "Content": "We had a nice stay in Comfort Inn Manhattan Bridge. The rooms are comfortable enough. We asked in advance for a room with a view over the Manhattan Bridge and our request was attended. The closeness to the subway station was a positive. This will permit you to be in the center within a 10/15 minutes ride. What we did not like was the garbage in the street left by the chinatown market.", "Date": "April 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hong Kong, China", "Title": "“Great Location @ Reasonable Price”", "Author": "ngrowena", "ReviewID": "UR102644705", "Content": "This hotel is located at Chinatown with easy access to Little Italy, Soho and financial district and even Brooklyn. Hot breakfast is avaliable for every start of adventure. Love free in-room wifi. Price is quite reasonable providing NYC is pretty expensive. Good to save money for other parts of the trip. Room is pretty small but acceptable.", "Date": "April 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“Good value for your money”", "Author": "JacobBlues", "ReviewID": "UR102490901", "Content": "stayed at the comfort inn manhattan bridge for 7nights in february this year. check in went smoothly, there was no problem with our early arrival. before our arrival i requested two rooms with a manhattan bridge view, and we got what we ordered.. :) Room size was, compared to other manhattan hotels, quite big. Beds were comfortable and the rooms we properly cleaned. The hotel staff was very friendly and helpful and I'd like to mention especially Grace at the frontdesk. Fantastically serviceminded with a decent flirting ;) there should be more receptionist like her out there! keep on going! The location of the hotel is perfect as well. Soho, Little Italy, Bowery, the Financial district and of course Chinatown within walking distance. The underground is just outside the hotel, and it won't take you more then 20minutes to get to the central park area.. A small minus for noise from the hallway i could hear in my room (but just a small minus :) ) and the breakfast, which was nothing special (american standard i guess.. :P ) but there are a lot of cool breakfast places close to the hotel. All in all a perfect stay, I really enjoyed my time there. I'll be back ;)", "Date": "April 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Good value and comforable rooms”", "Author": "ev_on_holiday", "ReviewID": "UR101725334", "Content": "Very good value for money for very presentable rooms with comfy beds, good heating / cooling and decent sized recently refurbished bathrooms. Staff are friendly. While the hotel is a little away from the main attractions, it is good for Chinatown and the Lower east side, and is within a 15minutes walk to a series of subway lines that will take you to Times Square and the like. Don't rely on the free breakfast - the space is small and often really crowded.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Canada", "Title": "“A great choice - value, service and comfort”", "Author": "Canadagrrl", "ReviewID": "UR95439790", "Content": "I'd rate this a 4.5 if is was possible. Stayed for 4 nights in late January, on a trip with a girlfriend. We had a room with one queen bed, and while it was not spacious, there was enough room for us to store our things and move around without problems. Bed was comfortable, linens of decent quality. The bathroom was a good size (though a shelf in the shower would have been nice!) The room, bathroom, hallways, elevator and lobby were clean, and the staff were very good - we were able to check in 4 hours early, and housekeeping was great about fulfilling small requests (extra towels, giving us conditioner as well as the provided shampoo.) Breakfast had a limited selection but was adequate - basic fruit, hard boiled eggs, make-it-yourself waffles, bread, bagels and muffins, juice, coffee and tea. I've definitely had worse in better hotels. Free wifi. Well located for subway access to midtown or DUMBO in Brooklyn, and an easy walk to the Lower East Side, Chinatown, Nolita and Soho. The streets are very busy in the day, and fairly quiet at night, but well-lit enough to make me feel safe even without a lot of people around. Best part about the room were the windows - a long and a short wall with floor to ceiling windows, facing south and east (no balcony access, but it was January!) During the day it was sunny and let us see the Manhattan bridge and Lower East Side, while good curtains blocked out street lights and the morning sun while we slept. No troubles with noise floating up from the street. The biggest problem we had was with the heater - I usually had to get up in the night and turn it off, since it got quite warm, but then again, we usually had it on high. We paid $80/night (taxes in), which was incredible value for what we received.", "Date": "February 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Prague", "Title": "“Superb deal in Chinatown”", "Author": "pivko", "ReviewID": "UR95311602", "Content": "It is generally very hard to find a good yet reasonably priced hotel in Manhattan. Comfort Inn Manhattan Bridge is one of notable exceptions. Hotel is very nice and clean, rooms are comfortable and spacious (by Manhattan standards), front desk staff nice and breakfast ok. It is within walking distance to several subway stations, but Grant Street is the best choice as the express train to Times Square and upper Manhattan goes from there. Chinatown, bustling with shops and superb Asian restaurants is just around the corner.", "Date": "February 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Italia", "Title": "“Good place for a week-end in NYC”", "Author": "Activetravell3r", "ReviewID": "UR95223050", "Content": "It's been a excellent(!!!) deal considered cost/benefit ratio. Due to low season (stayed at the end of January 2011), my rate was $70+taxes per night per room including breakfast. Breakafast was very good with a wide choice, and I disagree totally with negative other travellers' opinions on minimal breakfast offer. One negative side is the small breakfast room. Hotel is located very conveniently close to two different subway stops (J and D lines), it is easy to reach any location of the city, and very important: one of these lines takes directly to JFK. It is in the colorful Chinese town and at short walking distance from Little Italy. SoHo is also very close for your shopping time. Room and bathroom are both large, but unfortunately, there's a door dividing your next-room neighbor. If he's a noise guy, well...you can hear him very well. People at reception are extremely kind and available to help. They allowed me to get the room at my arrival in the morning some hours before the 3pm check-in time, they were flexible because the room was available and maked up. WiFi in the room and locker-room in the lobby are offered as a complimentary service.", "Date": "February 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“Great value for Manhattan.Clean and very comfortable”", "Author": "bubwal", "ReviewID": "UR94830666", "Content": "The hotel was great value considering all NYC hotels are over priced. We had a room on the front of the hotel looking out on to Chrystie Street and Manhattan Bridge. Despite this and only being on the 5th floor, it really was not that noisy for an NYC street and you could sleep comfortably. The area is pretty quiet late in the evening too. The hotel is in Chinatown, which is certainly not the prettiest part of New York, but that certainly should not put you off staying here. There are plenty of supermarkets, places to eat and little Italy is literally one block behind the hotel. The subway is a 2 minute walk and within 10 minutes of walking you can be on Brooklyn Bridge, getting terrific views of Manhattan. Included in the great price was a simple buffet breakfast, which consisted of bread/muffins/bagels/doughnuts, juice, coffee and a waffle maker (the batter to make the waffle was only available one day however during my 5 night stay, despite the waffle maker being on). The room was very comfortable, with queen sized bed, spotlessly cleaned every day and also had a coffee maker (which you could make tea in also). The only negative I have about the room is that there was no heater/towel heater in the bathroom and as temps during our stay were as low as -22C, it did feel cold in the bathroom. You had to put the room heater on full heat/fan in order to warm the bathroom up. Overall, good value, clean and comfortable and I would happily stay here again.", "Date": "January 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "England", "Title": "“A nice hotel”", "Author": "tinkerbell59England", "ReviewID": "UR89177733", "Content": "After working through the hotels with the best review ratings, this was the first that had a room available within our price range. We booked 5 nights via Expedia. We found the staff to be friendly and helpful. The room was clean and comfortable, if small. It had tea and coffee making, hairdryer, and an iron. There is a laundry service. We were on the 7th floor (same as 5th in UK) and had a view of the top of Manhattan bridge and the tops of some downtown buildings. The complimentary breakfast bar consisted of cereals, toast, waffles, donuts and drinks. It saved us a quite a bit during our stay. There's also free wifi, and a couple of laptops to use in reception. Around the hotel there is a diner, a fastfood place and of course plenty of chinese restuarants. We walked to Brooklyn Bridge one morning, which was nice. Its easy to get to midtown, just a short walk to Grange St. subway,then a 15 min ride to 34st (Macys and Empire State) 42nd St (for Times sq.) or the Rockafella Ctr. (the Tree)", "Date": "December 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "2", "Rooms": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Hotel spot on, pity it couldn't be moved somewhere else”", "Author": "Glentoran99", "ReviewID": "UR86971983", "Content": "Hotel itself was great, staff very helpful and breakfast was fine, apart from the tiny area, one comment on the hotel was there is no bar or restaurant or room service, but then we were hardly in the hotel. The hotel was a bit out of the way and had to tube or taxi to go anywhere, would have been nice if there was somewhere nice within walking distance, I wouldn't stay here again simply due to the location being out of the way, of what we wanted can't complain about the hotel or staff though,", "Date": "November 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "BrasÃ­lia", "Title": "“Great Value for Money in NY”", "Author": "Averbuch", "ReviewID": "UR86871238", "Content": "The location is not attractive (Chinatown), but the hotel is very close to subway (which carry you for the main attractions of the city) and there are some good shops in a walking distance. The rooms are small (this is NY...), but the hotel look like new. Clean, safe and with a very helpful staff at the front desk. Breakfast pretty basic. No parking, but if you consider to pay the parking prices in NY, there's a parking side by side with the hotel.", "Date": "November 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Good location, great hotel”", "Author": "Entente-cordiale", "ReviewID": "UR86485508", "Content": "We were a bit unsure of the location at first, but thought it'd be fun to stay somewhere different in Manhattan. In the end, we were realyl happy with our choice. The hotel is brand new, and the rooms are very comfortable. And a room like this in Times Square would have been way above our budget! They also offer free breakfast in the morning, including eggs and waffles, which was a bonus. The hotel is a 2-mn walk to the nearest subway station, and 5-mn walk to another line, so it makes it incredibly convenient to go anywhere in Manhattan. The fact that it is located in Chinatown is quite fun too, and it allowed us to have a lovely chinese meal late upon our arrival! I'd defintely consider going back there.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Great Find in NYC!”", "Author": "kkstraveler10", "ReviewID": "UR82800395", "Content": "What a great hotel! My room was on the 9th floor, and had a beautiful view of the Manhattan bridge. There was enough space to walk around without tripping on luggage. The bathroom was updated and stylish. I never had a problem with the fire alarm going off. The room also had cathedral ceilings, which was a nice touch. Housekeeping did a great job, the room was always clean. Breakfast was good enough for me, I'm not a picky eater. I loved the location of this hotel, only 2 blocks to the subway and walking distance to Chinatown, Little Italy, and LES. Great price for an updated hotel in Manhattan!", "Date": "October 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Elkin, North Carolina", "Title": "“Couldn't Be Much Better”", "Author": "mlscomm", "ReviewID": "UR82296049", "Content": "Excellent service, including housekeeping. Clean rooms. Very good continental breakfast. We had belgium waffles every morning. Hotel has only been open about a year. Good location. About two short blocks from Subway going uptown and downtown to Brooklyn. Very near Little Italy and China Town.", "Date": "October 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "La Giettaz, France", "Title": "“Great value for Manhattan, in a great location”", "Author": "ChaletLaGiettaz", "ReviewID": "UR82287308", "Content": "We spent 4 days in New York at the start of October 2010, on a short break from the UK. Overall, we really enjoyed the Comfort Inn. It is great value compared to other Manhattan hotels of similar standard: the rooms are, by New York standards, comfortably spacious and very clean and the staff are friendly and helpful. We were originally given a room with a connecting door to another room, through which we could hear some noise at night. We asked to move the next morning and this was done straight away, with no problem at all. The location was important to us as we wanted to be downtown and within easy reach of Williamsburg, so the Comfort Inn was absolutely perfect for that. It was fun being in the middle of Chinatown, Little Italy is 4 blocks away and you can be on the Lower East Side, Soho, Wall Street or Greenwich Village in less than 15 minutes' walk. The subway is 2 blocks away if you need to go uptown. We walked across the Williamsburg Bridge and were on Bedford Avenue within an hour of leaving the hotel (it's also a short subway or cab ride away). The breakfast is slightly disappointing but not a huge problem when you can walk 5 minutes to Little Italy for a great coffee! I would certainly recommend the Comfort Inn to people planning a short stay in NYC and aiming to spend most of their time downtown, but not wanting to spend $300+ a night on a hotel.", "Date": "October 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Great hotel in lively location”", "Author": "zotar", "ReviewID": "UR80015501", "Content": "What a great hotel! We were in NYC for 5 days and found this place in China town. It is easy to get to on various subways and although not 'midtown' is in a really vibrant area of the city. Loads of great , cheap eats are nearby. The great thing about staying somewhere like this is that you see the 'real' NYC not just midtown. We felt safe all the time in the area and had some great meals just down the road.", "Date": "September 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Stafford, UK", "Title": "“Fantastic, clean room, attentive staff, brilliant!”", "Author": "daveconnects", "ReviewID": "UR76268151", "Content": "I rarely write reviews but I have as we enjoyed this hotel so much. The hotel feels very new and I am sure it must be. Rooms Rooms of course aren't massive but I must say the room was bigger than I would have expetected. Very, very cleaning - excellent maids obviously. Really big, high bed so you profit from the views (ask for a room with a view!), very comfortable indeed. The bathroom was modern, like a wet room, clean and very well designed. Breakfast Breakfast was what you would expect in American hotels - selection included donuts, bagels, breads, honey, jams (jelly), peanut butter spreads and best of all a pancake maker so you could make yourself a hot, fresh pancake. Coffee is served all day in the breakfast area - nice to be able to take one out with you in the morning as you head out. Service We were so pleased arriving at the hotel to be greeted by such a lovely Receptionist. She couldn't have been more helpful - similarly the staff who kept the breakfast area filled and clean and thethe maids who were just brilliant. Location The location is why you may get a good price as it is in Chinatown and here is the one minus - food and rubbish does tend to pile up on streets in the area - sometimes there can be a slight odour in the air! But once you are through the hotel doors you could be anywhere.. And as for the subway, this is only 2 minutes from the hotel (Grand St station). With a change you can be in Times Sq.. probably 15 mins so so. Cost if you don't know is $2.25 per ticket or $8 for 4 if you block pay. Summary So in summary, would I return? Certainly. Would I be happy to recommend to friends, family and business colleagues? Yes, without hesitation. Choice Hotels in the USA are typically good and this is probably above even other Comfort Inns in the USA. Enjoy!", "Date": "August 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Amarillo, TX", "Title": "“Couldn't be better, unless it was cheapter”", "Author": "fsu23phd", "ReviewID": "UR69114137", "Content": "It's expensive to stay in Manhattan. That's my only complaint. The hotel is pretty new, very clean and everything is in good shape. We had a loft (a queen bed and a bathroom on the first floor and a second bed on a second floor). It had two new remote controlled AC units, 2 flat screen TVs. The breakfast room was small, but the breakfast was about the same as what you see at other hotels. It is two blocks from a subway station, it was pretty easy to get to the statue of liberty (from Battery Park), central park and times square from this train station, although there were a few transfers. The hotel is on the edge of Chinatown, which we enjoyed. We had a great view of the Manhattan Bridge from our room. The hotel was attached to an underground parking garage ($30/day) and we just left our car there for 3 days. The staff was awesome, happy to give us directions and advice, very friendly and professional... not at all what I would expect in NY. I believe the woman who dealt with us the most was named Kirsten. Wireless internet was fast enough. We had 3 adults and a baby, even with the two stories, we felt a little cramped, but in NY, what can you expect. Overall we enjoyed the stay, and if we go to NY again, we will definitely consider this hotel first.", "Date": "June 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Providence, RI", "Title": "“Very Good Hotel and Value”", "Author": "garyLS", "ReviewID": "UR67346505", "Content": "This newly constructed (or newly rehabbed) hotel is very nice and certainly a great value by New York City standards. The staff was very courteous and always available without waiting. The room were clean and and well appointed albeit small, which almost goes without saying for NY hotels. It's located in the heart of Chinatown and Little Italy, and right by the bridge to Brooklyn; a great location if that's the part of town where you want to be. The Grand Street subway station is about a 2 minute walk. Highly recommended.", "Date": "June 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Tampa, Florida", "Title": "“This Hotels was affordable, clean and near many Great places !”", "Author": "NYJD52010", "ReviewID": "UR65606328", "Content": "This hotel was a very Good stay...It was clean and cozy. It was located near the Manhattan bridge which gave us an opportunity to be near the train (Canal Street station) and local cab services to the many tourist attraction. We took the train to everything we wanted to see. It took us about ten to fifteen minutes to Central Park , 42nd street Ect. The staff were very helpful, They provided us with maps and suggestions for dinners in the area. The Hotel is located around the corner from Little Italy and in the heart of China Town. There was a breakfast provided in the lobby which gave us enough to start with for the day, Such as Fresh coffee , cereal , waffles, breads , muffins , fruit , all condiments and fresh juices.The rooms were very clean and the beds were comfortable. We also had plenty of pillow, blankets and towels.The color of the room was earth tone given a home like feel. We slept well with no noise interruption during the night. Our room over looked the Manhattan Bridge which was a Beautiful site to see, especially during the evening. Room service clean our rooms while we were out. There was also a safe in the closet that you could secure some of you minor things while your out of the room.There were also computers connections in your room and use of a Computer and a printer in the Lobby. *The only one little thing is that it would of been nice to have more counter space in the bathroom. At departure.. the manager assisted us in getting a local taxi service to Penn station. I would stay at this Hotel and would refer it to friends and family. It was affordable and in a private location that was unique and fun...Great for a lover getaway! New York is New York...I was pleased in having a safe place to stay when we returned from our long day excursions.", "Date": "May 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Antonio", "Title": "“Great Value”", "Author": "SAfirefightersGirl", "ReviewID": "UR61345305", "Content": "We stayed here in early December and loved this hotel. Other hotels were way over priced or had no bathroom in the room. Size of the Room I'm from Texas so the size for me was quite small but for New York standards- huge! I stayed at a La Quinta Inn in the financial district the year before with three girfriends, the room was so tiny we didnt bother unpacking and walked around the room by jumping from bed to bed. The room at Comfort Inn was by far bigger the bathroom was a good size and the price half of what I paid at La Quinta. Location Its located right off Chinatown and Little Italy but so convienent to subways. Which makes sight seeing a breeze just get accostumed to the subway map, oh and note that some lines are closed on the weekend. Cleanliness Our room was clean throughout out stay. The eating area for breakfast is very small but they have a nice selection of muffins, bagels, toast, fruit, cereal, and yummy freash waffles. Overall I was very impressed and best of all during this trip I got engaged!! My fiance purposed at the \"Top of the Rock\"! It was an AMAZING trip!", "Date": "April 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "RI", "Title": "“Staff honest and friendly, facility immaculate.”", "Author": "Ashansmom", "ReviewID": "UR60166614", "Content": "On our recent stay, we had adjoining rooms. One room for one night only and the other for 2 nights. After checking out of one room, one of our party realized hours later that he had left his wallet with credit cards and money as well as his cell phone tucked away in the back of the desk drawer. Not to worry! Someone from the staff had apparently found everything on a walk-through before the room was even cleaned. The valuables were waiting at the front desk. Hours after that when I checked for messages on our home phone, there was a message from the hotel with this information as well. Everyone was extremely helpful. When I made the reservation, the clerk answered my long checklist of questions patiently and professionally. Convenient location, updated facility, good price and a garage next door. You can't go wrong.", "Date": "April 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "toronto, canada", "Title": "“Not a single complaint”", "Author": "Redress", "ReviewID": "UR56350252", "Content": "For a reasonable price we got a small but very good room - great bathroom, comfy bed, clean. Neighbourhood is not that quiet at night - we always saw people around- and was the perfect location for us. We don't care for Chinatown, funny enough, but one block north begins the very cool neighbourhood of the lower east, and further up is the East Village - cool shops and restaurants abound. A free not-too-junkie breakfast gets your day started. Computers in the lobby help to choose your destinations for the day. Subway close. Staff is nice enough.", "Date": "February 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Good hotel for a very good price”", "Author": "travelmonk", "ReviewID": "UR54044506", "Content": "Stayed at the Comfort Inn in January for three nights. We had 2 rooms with a connecting door. -Check-In: Very friendly and efficient. -rooms: Clean and comfortable with free highspeed internet (wifi) and flatscreen tv. Rooms had coffee maker, hairdryer, telephone, alarm clock and big enough safe for a laptop. Beds were very comfortable. -bathroom: good shower but no storage possibility for shower gel in the shower. One room had a window wich was nice. -Service: Free internet and computers with printer in the lobby, free luggage storage after check out, vending machines in lobby. -breakfast: Standard (but free) american breakfast (pastries, bagels, toast, waffles and fruit, coffee, tea and juice). breakfast area quite small, but there is an extra room with tables. location: chinatown begins right at the doorstep, walking distance to the LES and Soho. Next Subway 3 minutes walk, very convenient for JFK by Taxi. Area is quite secluded after dark, but never felt unsafe. All in all, nice hotel for a very good price. Would stay there again.", "Date": "January 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "5"}, "AuthorLocation": "London, England", "Title": "“Comfortable, quiet and smart, but area is quite secluded after dark”", "Author": "Britgoddess", "ReviewID": "UR53199093", "Content": "I stayed at the Comfort Inn Manhattan Bridge for one night in September 2009. I had a late check-in and a very early morning check-out and both went smoothly with reception staff, who were kind and courteous. The hotel's well located, in that it's in the centre of Chinatown, so if you like hustle and bustle, it's great. Downside is that when trading hours are over, the area is quite desolate and empty, so you may find yourself alone on the street at night: not great if you're a woman travelling alone, like me. Saying that, it's right next to Soho and the LES, which you can reach by walking, or a short hop in a cab; you're near to all the restaurants and nightlife you could wish for. The double-aspect room I stayed in - on the fifth floor - was smart, very clean, and nicely presented. The bed was comfortable, the room was quiet, and the (free) WiFi worked smoothly and at high-speed. I also had a view of the Manhattan Bridge (which the hotel is practically adjacent to), which was lovely. I understand that the hotel offers free breakfasts, but I didn't get the chance to try one, because I left for the airport at 5am. All in all a nice hotel, reasonably priced (my room was $161), and quite well located (aside from the points I made above). Recommended for both leisure and business travellers.", "Date": "January 11, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Rooms": "4", "Service": "5", "Location": "4"}, "AuthorLocation": "montreal", "Title": "“Good Value for the money”", "Author": "belleretraite", "ReviewID": "UR51525526", "Content": "We spent 2 nights in mid-december at the Comfort Inn Manhattan Bridge and we enjoyed our stay . Coming from a Trans-Atlantic cruise, we did appreciate the size of the room and mostly the bathroom . The location,close to the Little Italy and at the edge of the China Town is quite convenient if one wants to do some sight-seeing . There is also a Metro Station close to the hotel . Breakfast (included) is good if you do not mind self-service. Staff is ++,very courteous and helpful ! The bed,once you get used to the height, is quite comfortable and the room we had,with a great view over Manhattan Bridge, was not noisy (9th floor). The only minus: only paper cups ; wine does not taste as good in those !", "Date": "December 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Amsterdam", "Title": "“super hotel voor a cheap price”", "Author": "adpatatje", "ReviewID": "UR51358218", "Content": "The hotel was fantastic. Big rooms, clean, big badroom, flatscreen TV, free WIFI at the room and free internet at the lobby and friendly staff. The hotel is very close to a metro station so you are in 10 minutes at all hotspots downtown and midtown. Neighbourhood is also safe at night (is our experience). Breakfast simple but allright. Ver cheap price. I would choose the same hotel by a next visit!!!", "Date": "December 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Swansea, Wales", "Title": "“Fantastic little gem in Manhattan”", "Author": "Jess-B80", "ReviewID": "UR51351125", "Content": "Have just come back from this hotel and have nothing but good things to say about it. The location itself is very safe on the lower east side near a subway line and in the middle of the hustle and bustle of china town which is vibrant place to be, its also provides easy access to little italy and the shopping mecca of broadway withing walking distance. The hotel room is quite large for a new york city hotel the bed although extremely high is comfortable and there is quite enough space for two, with the added bonuses of coffee machine, iron and hairdryer. The hotel cleaners did a fantastic job with clean towels and toiletries every single day. The breakfast in the morning was a fantastic addition and great for fueling up for the day ahead - the choice wasn't massive but enough to satisy even the most hungry of hotel guests. Although the breakfast area was busy in the morning we never had any problems finding somewhere to sit. All in all had a really good stay in this hotel and would definately recommend the hotel to people to stay in while in new york.", "Date": "December 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Norway", "Title": "“Excellent value for money”", "Author": "eodberg", "ReviewID": "UR50289829", "Content": "Stayed six nights at the hotel for a price of approx. 140 $/night. With a bathroom, and with a simple breakfast. Of all the times I've been to NYC, this is by far the best value for money. The location is excellent, and a very good starting points for walks around in the city. In addition, the nearest subway is pretty close. Absolutely nothing to complain about. The room was (by my experience with NY standards) large, it was clean, and the service was good. Excellent WiFi connection.", "Date": "November 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Orlando, FL", "Title": "“Great value”", "Author": "RedbirdFL", "ReviewID": "UR48173115", "Content": "My husband and I stayed at the Comfort Inn Manhattan Bridge for a couple of nights in early October. We get a corporate discount through Choice Hotels and were able to get this hotel for a rate well below other hotels in Manhattan ($120 per night). The hotel just opened a few months ago, so the room was very clean and nice. We got a room with a queen sized bed and thought the room was big for NYC standards. The bed was really comfy, but high, and there is a nice flat screen TV in the room. The bathroom is plenty big and we didn't have any problems with the fire alarms as some of the others have. The continental breakfast suited us just fine. There are plenty of choices and it was a good start to our day before we headed out to explore the town. The location is good. Our room overlooked the Manhattan Bridge and an area park. It was fun to look out the window every morning and see the locals walking around the track! We loved being in the Chinatown area, which was an area where we'd never stayed in NYC. Two different subway stops are just a few blocks from the hotel, so it was pretty easy to get around town. One night, on our way home, we got takeout from a couple of places that had been recommended on TA - Excellent Dumpling House and Dragonland Bakery. Yum! We would have preferred to be in the midtown area, but would definitely stay at this hotel again for the difference in price.", "Date": "October 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“Location, Price and Rooms- made the trip great!”", "Author": "eliza81", "ReviewID": "UR47259306", "Content": "After researching multiple hotels in NYC (many with complaints of bed bugs) I found this Comfort Inn. The reviews were all great and add to that the newness of the hotel I was sold. The hotel is on the edge of Chinatown so you'll get the full experience driving to it. The staff is great and knowledgeable about the area and directing you to subway stops, etc. The hotel is very clean and well managed. The rooms as expected were small but it was enough space for the two of us. They are nicely decorated, bathroom with modern fixtures and a divine shower head I would have taken home if I could. The only complaint I have would be the fire alarm that would go off at random times. It wasn't the full blown alarm and not terribly loud- never woke up my husband. Also, our window over looked Chrystie street which made it really loud but I also expected it to be loud in NY all the time so can't really complain about that. You get used to the honking and car alarms after a while. The price was exactly what we wanted to pay as well. Under $200 which was also a hard find in NY for a hotel as nice.", "Date": "October 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Utrecht, The Netherlands", "Title": "“Great value for money at a not-everyday but very safe location!”", "Author": "Nielsch", "ReviewID": "UR47092959", "Content": "The location of this hotel is in Chinatown. While not as glamorous as Midtown, the area is an excellent starting point to explore the whole of Manhattan. The hotel lies central to areas like South Street Seaport, Financial District, Greenwich Village, Brooklyn Heights and Union Square which can by easily reached by subway. Midtown and Upper Manhattan also take relatively short metro rides to reach. Chinatown itself is a busy, hectic and sometimes smelly place, but all in all very safe and packed with cheap restaurants which serve great food for not much money. Trick is to go where the locals go and not let the exterior and interior of those places put you off. A ten minute walk will also get you to SoHo where you'll find great shops and good restaurants (must-go for pizza-lovers: Lombardi's). I'd advise everyone to not let the location put you off whilst deciding whether to book at this hotel. Chinatown is safe, central and cheap! Our room itself was very good. It wasn't too big but certainly not tiny either. The room was cleaned very well on a daily-base and the private bathroom was spacious and modern. The flatscreen TV also worked really well. The bed was a bit too soft for my liking, but that's personal of course. We experienced the already described \"fire-alarm\" problem once, though we must admit it was our own fault. The complimentary breakfast exists of muffins, donuts, bread, bagels, waffels, eggs and cereal. While not extremely varied, it gives you a good base to explore the city till lunchtime. The breakfast area was a bit small, but we never had to wait for a place to sit even though the hotel was fully booked on almost all our nights. The service by the hotel employees is the only thing I can think of to complain about. Except for one nice door-guy who opened the door for us and wished us a good day, we were never really recognised by any of the staff and were only greeted after we greeted them. Some of the door-guys were often found to be on their cell-phones or on the free-internet computers instead of next to the door. The girls behind the reception seemed very shy and incapable of saying hello unless triggered by our greetings. All in all, this hotel is great value for money and I would definitely recommend it. We paid $900 (including all the taxes) for 6 nights. We feel that this amount was really worth the visit.", "Date": "October 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Kansas City", "Title": "“Good Value”", "Author": "Jayhawk_9", "ReviewID": "UR46775825", "Content": "New building. Clean hotel with nicely appointed rooms, comfortable beds, flat-screen TVs, lots of cable channels (inc. HBO), great shower, etc. Two computers available in lobby with free Internet access. Friendly and helpful staff. Typical free Comfort Inn breakfast--lots of carbs (pastries, waffles, cereal, etc.) and not much else. Location in Chinatown was very interesting, but the dirty sidewalks and occasional trash might be off-putting to some. My only complaint was that the subway was about a 20-minute walk away. Overall, an excellent value and I'll stay there again.", "Date": "October 13, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Easy to access..”", "Author": "ChiaHY", "ReviewID": "UR46449425", "Content": "Convenient locoatio, easy access to China town, Little Italy, and subway.", "Date": "October 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "milwaukee, WI", "Title": "“Great Hotel, Great Price, Great Location!”", "Author": "ssokocat", "ReviewID": "UR46245892", "Content": "The hotel was a great price. I totally shopped around and this was by far the least expensive. My room had a great view of the beautiful Manhattan Bridge. It's right in Chinatown, a few blocks from Little Italy & near a subway. Rooms were very clean & new and complimentary breakfast with a huge variety of food.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Aalsmeer", "Title": "“Good hotel, not so great neighbourhood”", "Author": "AliceAalsmeer", "ReviewID": "UR46024495", "Content": "Comfort Inn Manhattan Bridge opened in 2008 and is, at this time of writing, still new and clean. It's a small hotel (60 rooms) with 12 floors in China Town. The only facilities are the reception, a breakfast corner and 2 \"free to use\" computers. It's an affordable hotel in New York. Breakfast is included, but there are only 4 tables (and 2 more available, no lie, in a utility room). If you'r satisfied with coffee, juice and some breadproducts, you'll be fine. Rooms are, compared to New York standard, pretty spacious. 1 or 2 queen size beds (comfortably high, I think) and a coffee/tea making facility. Advice to book a room from floor 8th and up, due to outside noise and a possible blind wall. Disadvantage (personal experience) is the neighboorhood China Town you'r in. Busy and unclean and not being directly \"downtown\". But (2 blocks down) you'll find metro B en D nearby. +/- 20 minutes from i.e 5th Avenue/42nd Street. Restaurant TIP: Tick Tock Diner, 24/7 open underneath hotel The New Yorker (8th AVE/34 Street, metro A C E). TIP: Step away from Manhattan and visit Brooklyn! Only 1 metro stop from the hotel to reach Brooklyn. Get off metro Clark Street en walk to the Promenade, BEAUTIFUL view of downtown Manhattan!. Brooklyn has historic homes en gives you some positive small town feeling. Walk further down to Montague street (end of the Promenade). Walk back to Manhattan over the Brooklyn Bridge, nice experience. Left side of the bridge you'll find South Street Seaport: shops, boat tours en and some nice restaurants.", "Date": "October 6, 2009"}], "HotelInfo": {"Name": "Comfort Inn Manhattan Bridge", "HotelURL": "/ShowUserReviews-g60763-d1383001-Reviews-Comfort_Inn_Manhattan_Bridge-New_York_City_New_York.html", "Price": "$215 - $363*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">61 - 63 Chrystie Street</span>, <span class=\"locality\"><span property=\"v:locality\">New York City</span>, <span property=\"v:region\">NY</span> <span property=\"v:postal-code\">10013</span></span> </span> </span> </address>", "HotelID": "1383001", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/0b/8c/0b8c6ba3e56ce13c08d36baece3c616b4large.jpg"}}