{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maldives", "Title": "“Great Location but Average Service”", "Author": "PriyankaMaldives", "ReviewID": "UR126485877", "Content": "Okay the positive points first:- - very very good location. bang on the main road - metro about 10 mins walking distance. so commuting is never a problem - very near to a lot of restaurants on the street - breakfast is good - housekeeping service is good - we were upgraded on arrival to a one bedroom apartment from a studio which was really a sweet gesture and we are very very thankful of the same - there is a washing machine in the room and spinney's is just next door. so you can buy a small packet of washing powder and have your clothes washed at the hotel itself.that's good. the negatives:- - internet damn slow although they charge for it.when complained said that no other room has this problem as if i am a liar - during breakfast, there is practically no service at your table. the staff is only concerned about refilling the buffet - when asked the staff at reception to deliver a copy of the print out that i had e-mailed them, they said to come down and collect it. they apparently have no staff to deliver it to the room.had to call the director of sales to complain and then it was delivered to my room within a few minutes time. - had asked for a late check out and was told that they cannot give. when we packed our bags at 12 noon and asked for the baggage collection, we were told that we can now use the room for another one and a half hour. duh!we are ready and have packed everything. what's the point of late check out now and also what kind of communication is this? nobody told us that we can keep the room for some extra time. All in all, a good hotel and value for money but service standard needs to improve.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dar es Salaam, Tanzania", "Title": "“What you spend is what you get!!”", "Author": "AnwerDhalla", "ReviewID": "UR125790379", "Content": "well to be honest, i cant complain much about the hotel/apartment - i have stayed at the hotel twice now, its a reasonable hotel (what you spend is what you get), nice spacious apartment. service is on a low though. we had asked the reception to help call us a Taxi cab i got an answer \"yeah no problem, you can get a lot of Taxi outside\" lol well of course i know that, but i didn't want to spend 15-20 mins in the heat to look for a cab that's why i told you \" Call us a Cab\". Breakfast hall is quite small - only few waiters, Note- don't be late for breakfast. Location - about 15 mins walk to the nearest metro station, and highway, restaurants near by (15-20mins walk). Not bad overall- an Average.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tehran, Iran", "Title": "“Value of money”", "Author": "Elena T", "ReviewID": "UR125335313", "Content": "the location of this hotel is very good especially for passengers want to use Metro. the room services are excellent . as I work in travel agency , book this hotel for my passengers who want to stay in Bur Dubai .", "Date": "February 28, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "doha, qatar", "Title": "“Just ok”", "Author": "e219r", "ReviewID": "UR124961542", "Content": "Booked a studio & got upgraded to a 1-BR Unit which was excellent. However, furnishings were a little run down & the room smelled of cigarette smoke--not good. Had to ask for room freshener to counter the smell. Bed was very comfortable! Towels were changed daily which was great but I was wondering why there were no face towels included. Little stuff but sure counts to guests. Breakfast was so-so, but I must mention that their egg omelette was excellent.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Great stay for families with little ones”", "Author": "OliviaGS8", "ReviewID": "UR124034800", "Content": "We stayed at Belvedere basically we are familiar with Dubai and used to live near the area. The hotel is in a very good location considering its proximity to Spinneys supermarket, metro, Karama....and if you are driving, quite accessible to a lot of destinations. We got the ne bedroom unit as we have a 1.5 y/o toddler with us. The space was great for her to run around. The dvd player was a big help to keep her busy and the kitchen was really convenient. Downside during our stay was that over the 11 nights we stayed, we did not get the cot we requested for. The bathroom is in need of some update and house keeping will need to vacuum everyday if you have little ones. Sound insulation was very good so our baby slept in the room peacefullly while we entertain guests in the living room. Staff was very friendly and helpful even if they were running a full hotel since it was Dubai Shopping Festival time. Breakfast was okay since it came with our room package. Very basic food and buffet selection doesnt change much...i am not complaining about it but hubby got tired of the food. Thankfully, Spinneys is just round the corner and they have McDonalds, Fiesta Cafe and Max's Restaurant. We rented a car and found out that they do have very good free parking space at the hotel basement. We always managed to get a slot right next to the entrance. Friends who visited us also got to enjoy free parking. Overall, i will stay in this hotel again but will request for a unit with better bathroom.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Value for money”", "Author": "gujidaughterinlaw", "ReviewID": "UR122017530", "Content": "It was a pleasant 3 day stay. The location is fantastic- close to th Al-Kharama metro - which can take you to just about anywhere - not expensive at all. Spinneys - the hypermarket is close - which is a real bonus and Burjuman shopping centre is a good walk and further on you can still take a good walk to the Indian sector - Meena Bazaar. The double studio room we had was lovely- neat and clean - the washing machine and tumble drier - worked so well for us. The breakfast spread - is lovely and all is so well-co-ordinated by the breakfast room supervisor/manager( Manav). The one thing that irks me is the entrance through to the reception area - they have 2 old red carpets that is fraying and the threads hanging out - that is the first thing that is seen when you enter-'first impressions' . The support staff are exceptionally obliging and they render excellent service - duly meeting all requests promptly and eficiently. Overall a stay good value for money", "Date": "December 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent location, big rooms, friendly staff, reasonable price”", "Author": "seema60", "ReviewID": "UR121120368", "Content": "We stayed for 3 nights at a reasonable price with breakfast included. It is right opposite the Karama tube station, close to Spinneys and a big mall. The 1 bedroom apartment was large with a sofa bed ( very comfortable but on floor) in the outside room. We had to ask for a working iron and kettle but the staff was very helpful and friendly. The breakfast was filling and had a good variety of food.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lisbon", "Title": "“Good hotel, but could be better”", "Author": "Lora V", "ReviewID": "UR120696841", "Content": "Stayed for nearly ten days in November 2011. Good location and parking. Big rooms and pretty comfortable beds. We asked for a no-smoking room, but got a smoking room. After traveling for 24 hours, we were too tired to request for another room. A couple of good TV channels. Bathroom tiles around bathtub area were grubby and could do with a bit of elbow grease -- also bath tub curtain was grubby at the bottom with mold spots. Can be pretty noisy as when we stayed there, children and parents were running around and shouting/screaming/talking at the top of their voices. It would have been nice for someone from the hotel to have told the guests not to disturb other guests but no such thing. Our flight was at 2am the next morning and we very kindly requested a late check out (normal check out was 12 noon). We were told we could \"have\" 20 mins more. Note: the hotel was pretty empty and not even half full. Housekeeping staff were outside our door at 11am, so we felt pretty uncomfortable. All other hotels we have stayed at have always been very accommodating, but for some reason the hotel staff (especially front desk/reception) lack that warm personal touch. This was a business/pleasure trip for us. Remains to be seen if we stay there again.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Abu Dhabi, Abu Dhabi, United Arab Emirates", "Title": "“excellent hotel with good food”", "Author": "bhavinuae", "ReviewID": "UR120484293", "Content": "good hotel , good food , good location. very good services and good hospitality. very economic rates to stay at this hotel. The hotel is at karama area where u can find good restaurants at the nearby area of the hotel. U can also find a metro station at the walking distance of the hotel.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Spacious and Clean”", "Author": "sbhatnagar", "ReviewID": "UR120101189", "Content": "Excellent location , bang on opp tube station, spinnies hyper maket and malls right behind. excellent large rooms , stayed in a 1BHK appt, huge, clean with a fully equipped kitchenette. got a fridge, gas, micro,utensils etc. large bed room , 2 toilets and 1 bath, plaza tv in both rooms. excellent house keeping and great breakfast. Reception staff v helpful and alert specially Satish.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, England, United Kingdom", "Title": "“Comfortable and convenient for people travelling with children”", "Author": "Sarah680", "ReviewID": "UR119937509", "Content": "We have just returned from our trip to Dubai and stayed at Belvedere. The hotel has all the facilities you would want with a young family including a fully equipped kitchen, microwave, toaster etc. It is conveniently located near a large supermarket (great for picking up milk for the kids late at night!) and there are several restaurants and fast food outlets within walking distance. Our apartment was clean and spacious and the staff were incredibly friendly and helpful. My only complaint would be that the room smelt a bit musty and the kettle didnt automatically switch off once boiled! But overall a very good experience and I would stay there again.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Surfers Paradise, Australia", "Title": "“Little out of the way, but great service, HUGE rooms”", "Author": "Bumblebee2306", "ReviewID": "UR118788460", "Content": "The stand out point for me at the hotel was he friendlyness of the hotel staff. You were greeted each morning and they all went out of their way to help your out. I stayed on the top floor, and the rooms were gigantic. It felt like a small unit. I also had breakfast included in my stay which was was really good. A great range of foods! There is a number of fast food stores, supermarket, mall & metro station located less than 10in walk away, but the hotel its self was quite far from the \"action\" of Dubai.", "Date": "September 30, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "2.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“not up to a 3 star rating”", "Author": "pal410", "ReviewID": "UR117777260", "Content": "Arrived late. the Jug did not work. toaster did not work. the washing machine did not dry clothes. Very noisey, people in corridors, people in room next door,no sound proofing. The Bedroom and bathroom were very good", "Date": "September 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Perfect for family”", "Author": "YusufsFromFRA", "ReviewID": "UR114988955", "Content": "Can just say superb ... Our second stay and was very pleasing ... Simple B'fast but very sufficient", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London", "Title": "“As good as a 4 star property. Excellent Value for Money”", "Author": "JJ13London", "ReviewID": "UR114979332", "Content": "I have been staying at the Belvedere for the last few years and must say that the standard is as good as I stayed there the very first time. All the staff is very helpful and always willing to help. Breakfast is excellent and caters for all the tastes. Rooms are very spacious and are always very clean and well maintained. The moment you walk in it gives a feel of a 4 star property . Mr. Ali the credit goes to you and the staff for providing the excellent service all around. Very convienient to get around too as the metro is nearby. Highly recommendedfor a family or a business visit. J. Jain London", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent- Planning to return”", "Author": "Bharat_Jain", "ReviewID": "UR114891577", "Content": "I have just spent a few days at the Belvedere Court whilst on Business in Dubai and I must say that I was pleasantly surprsied at how excellent the hotel is. The room size was magnificent and all facilities provided including a DVD player which although not required on this trip is great for kids. We had 1.5 bathrooms so this was useful, safe is available and beds are comfortable. The breakfast was plentiful and catered to all. The staff are extremely helpful and always have a smile. I have small kids so will definitely be back as feel that it will provide with all we need in a central location. It has plenty of restaurants both Asian and non-Asian nearby. It is located near a supermarket- Spinneys which is really handy and the Burjaman Shopping centre is a 10 minute walk away. The station Al Karama is also about 8 mins walk. You can easily get taxis outside and there is a bus stop also available. Well done Ali & the Belvedere Team- keep up the good work!!!!!", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Very comfortable and conveniently located”", "Author": "dipeshgala2004", "ReviewID": "UR111387577", "Content": "We were booked into this hotel apartment by a friend. It has spacious rooms, very neat, and clean. The bed was really huge and very comfortable. It has all the amenities which a hotel apartment should have, like fridge, washing machine, safe locker, iron, hair dryer, toaster, etc. The apartment is very conveniently located near the metro station, and it is close to the gold market too. The service was also good. It has parking space in the basement. We used to have our breakfast there, and they had a lot of varieties and was just OK. It is a nice place to stay for huge groups as they have many rooms. It gave us a homely feel.", "Date": "June 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "New Delhi, India", "Title": "“Great Hotel with Best Prices!”", "Author": "uditsawhney", "ReviewID": "UR111263597", "Content": "On a Holiday, accommodation should be very selective. It can either make or ruin your holidaying. We visited Dubai in January 2011 and stayed at Belvedere Court, Kuwait Street, Bur Dubai. Highlights are as follows: >>The staff is very hospitable. >>Location is excellent. Only 20 min drive from International Airport. >>5 min walk from Burjuman Shopping Centre. >>They have a fitness, sauna and steam room. A roof top Pool :) >>Dubai Mall very nearby. Burj - Khalifa can be seen from Hotel Apartment window. >> Great buffet breakfast and lunch. Prices are really affordable. >> Sukh Sagar restaurant (must for tourist coming from India) only 2-3 min away. >> Taxi is easily available. Just outside hotel.", "Date": "June 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“this hotel is worth in this price range.. good location and clean rooms”", "Author": "rajgandhi", "ReviewID": "UR97979328", "Content": "This hotel was booked by our company for group picnic to Dubain from Abu Dahbi. Earlier to this also i been in hoel many times with family. The best part of this htel is its very economical with big rooma dn other amneties. Hotel is new, so the room and its interior is very good. Apart from this the best part is its location as all the restaurant are in the nearby area in Bur Dubai. There is a big shopping Mall BurJuman on a walking distance. Another thing is this is purly a family hotel, there is no non sense night club in it, so no music disturbance.Metro railway station is just 200 meter away.Taxi availabilty is 24 hour. Hotel is having its own parking. I highly recommend this hotel for the family , who want a nice pleasnt stay in dubai. Staff is very friendly and helpful. Thanks a lot for making our stay so comfortable and pleasant.", "Date": "February 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Espoo, Finland", "Title": "“Excelent location”", "Author": "Miikab", "ReviewID": "UR96683040", "Content": "Wery nice and quiet hotel in good location. Near Karama and Bur Dubai. Good connections by metro and busses. Really good choice for people who want to see more then just a tourist areas. By metro and buss you can wisit all the areas you want.", "Date": "February 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Very good, if not excellent!”", "Author": "Sinppu", "ReviewID": "UR85525012", "Content": "We stayed for 6 nights at the Belvedere Court and we liked it a lot. The studio was very nice and spacey. The bathroom was modern and the kitchen utilities wonderful. We thought the location was excellent, two metro stations at a walking distance, a lot of fast food restaurants nearby, an impressive supermarket Spinneys around the corner and many taxis easily hailed from Kuwait Street. Staff was friendly, helpful and polite. The breakfast buffet was more than adequate for us, although some mornings there was a bit of a wait to get a table. The cleaning staff was quite creative, we never knew how many towels or water bottles were waiting for us when we came back. The internet connection is not efficient, but manageable. We do recommend this hotel, as it is quite a bargain and no big issues or problems. We are pleased with our stay.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Average”", "Author": "Bettestep", "ReviewID": "UR79123408", "Content": "Given the good deals in Dubai, I would stay elsewhere. Hotel caters mainly to Indians. Whereas breqakfast was not a big buffet the selection was still fine for us but quality of the items was very low. Scrambled eggs contained lots of egg shells. Studio \"apartment\" was smaller than expected. More like a good sized hotel room. Booked a double but was given 2 twin beds. Put them together, which revealed that the floor under bed had not been cleaned for many months. Shower water was almost to hot to shoer although only turned the cold tap on. Pool supposed to open at 8, but was still locked at 10 so we had to go down to call and wait for them to open.", "Date": "September 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“The best hotel I have ever stayed in”", "Author": "Madda_Bella", "ReviewID": "UR68635121", "Content": "I stayed in room 610 between 24 and 30 May 2010. At a first glance in entrance it looked like a luxury Hotel. Marble entrance with a glass lift and eye-catching design. Reservation staff were quit helpful especially the Indian bellboy. My room, single one, was about 60 squre meters with a huge comfortable double bed, excellent A/C, 42 inches BenQ Plasma TV and a DVD player. Fourtunately, no club inside so you can rest without any disturbance. The best part was that you can cook for yourself and left the dirty dishes for service staff. When you left your room they would eash your dishes, clean bathroom, change towels and so on. A well-equipped kitchen with Microwave, refrigerator, tea maker and bounch of plates and bowls as well as an Iron help you feel at home. There were a gym, swimming pool and jackozi on the top floor. All in all, with 270 Dirhams per night (including tax and service charge) you can not expect anything more. Having talked about positive points, let me mention 2 negative points as well. Firts, The Tv channels were limited. Only 40 channels that half of them was Indian and Arabic. Famous channels were MBC ACTION, MBC2, CNN, BBC, ZDF. Secondly, there were no slipper in bath room; so you have to bring your own. Don't forget this one. Nontheless, This hotel apartment is the best one. Don't miss it.", "Date": "June 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nottingham", "Title": "“Nice suprise”", "Author": "abduli06", "ReviewID": "UR64755563", "Content": "I came accross this beautiful hotel while looking for a cheaper hotel than where i was staying (golden sands 5).As soon as i went in i fell in love with the hotel design, It was actually more expensive than GS but i was fed up and we needed a change. we decided to stay for 2 nights to try it out while we look for an alternative. we ended up staiying for awhole month. The rooms are spacious with everything you would need. The view from the window wasnt good. the rooms on the front have better views you can see burj Khalifa. The staff are helpful from the housekeeping ( nabin) to front desk (sumeet, praful,sandeep ) restaurant (bernard) and Ali the sales manager. every one was friendly ad treated us well and respected our privacy. There is a small pool on the rooftop sauna and a well equiped gym. The location was convinient for me only about 15 dirhams Mercato mall. easy to go to the gold souk and Dubai mall. Several mosques nearby one just across the road. There is a supermarket (spinneys) just few minutes away not far from Burjuman Mall. I enjoyed the fresh salad and fruits selection. Theres is macdonalds and pizza restaurant as well.Yes all halal. my favourite restaurant for food lovers like me was ibrahimis palace. They do buffets for 50 dirhams and you can eat as much as you want from a large selection of food. tasty food. They also deliver to the hotel. I think the internet is a little pricey though the connection is good (there was an access point in our room)", "Date": "May 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London, UK", "Title": "“An Excellent 3* Apartment Hotel in the heart of Karama”", "Author": "travel4love", "ReviewID": "UR51120927", "Content": "Overview: We stayed here for 3 nights in November. A 3* Hotel-Apartment which is well maintained and in an excellent location, close to mega supermarket Spinneys and Centre Point. Location:. Located on Kuwait Street, this Hotel Apartment is right behind Burjuman Shopping Centre (A good landmark to mention to cab drivers). The back entrance of this Apartment Hotel leads you to a short walk where shops such as McDonalds, Pizza Hut, Baskins, Centre Point, Burjuman Shopping Mall, Spinneys and various other restaurants within a easy reach. Room: We had booked a studio apartment as had our 1.5 yr old with us. A cot was provided and the size of the room is large and spacious. As you enter the room you have a basin, cupboards and 2 hot plates on your left. There is a washer-dryer machine as well as small fridge freezer and a microwave-cooker. On the right of the corridor is the wc/bathroom which has a shower. Bathroom was clean and not exactly new but clean nevertheless. The room itself contained wall-ceiling storage cupboards, a king size bed, a huge 32' flat screen on the wall, dressing table and 2 sofa chairs with a small table. Plenty of drawer space and Ironing Board/Iron provided as well. A very impressive range of various cutlery from plates, bowls, mugs etc are provided for light cooking only which came in handy for us to make some boiled vegetables for our toddler. A window that looked out to nearby buildings and could also be opened up if needed. AC/Heater had various settings and separate hot water switch controlled hot water for the room. Washing machine/dryer was perfect and came in handy to get all our clothes cleaned before going back home as we just ran it while we were out and about. A good size electronic safe was also inside the room which was very useful and had easy password pin protected number facility. Room is cleaned daily and towels also changed daily if kept on the floor. Pictures of the room are uploaded. Breakfast: Breakfast was provided daily at the ground floor from 7AM to 10:30AM. Breakfast was a modest affair but more than adequate. A tea/coffee machine was available. Masalla tea or tea bags/hot water available. Bread, croissants and cakes available with butter/jam and a selection of fruit such as apples, oranges and bananas. A commercial toaster to toast bread was available but you had to out you bread twice to get it toasted properly. Other hot food available such as boiled eggs, scramble eggs, chips, beans, roti, French toast and at times curries (yes.. for breakfast to cater for the Indian guests) The best part of breakfast was eggs could be ordered as required i.e omelettes, sunny side up, omelettes with vegetables would be made fresh in the kitchen and brought out within a few minutes. We were told porridge was also available. We were a little surprised that no high chairs were available which is something we found in other hotels - so we could not make our little one sit with us and that annoyed him. Summary: Hotel was in an excellent location in Karama, a stone throw away from Meena Bazaar and Burjuman Shopping Centre. 20 mins away from the airport and cabs charged us 22 dirhams. Distance to Bar Dubai Gold Soukh was long but only due to crazy traffic. I am told they are in the process of extending the Dubai Metro train to the Gold Souk but will take time. It was a relief to walk for 7 mins and have Spinneys which practically contained anything you could get in the UK at UK prices! It also contained several other shops with all sorts of services such as laundry, clothes and food halls/restaurants.", "Date": "December 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Brisbane", "Title": "“Clean and friendly hotel”", "Author": "aultj", "ReviewID": "UR49163834", "Content": "The hotel room was quite spacious and clean if a little tired with a well-equipped kitchenette with microwave, small hotplate and appliances such as toaster, kettle, etc. Close by was a good supermarket with Waitrose branded products!!! There was also a washing machine although I did not use it. The ensuite was quite acceptable. The staff were friendly and always helpful courteous. It was close to a future metro stop and within a moderate walk to an open station near the Burjuman Shopping Centre. For a budget hotel it was good value for money.", "Date": "November 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Pretoria", "Title": "“Great Value”", "Author": "Yum1", "ReviewID": "UR37322992", "Content": "I stayed for 7 nights at the Belvedere Court Apartments from 18 Jul - 25 Jul 09. It was offered to me by a Dubai Tour Operator and after reading reviews on tripadvisor regarding this hotel, I didn't think twice about booking it. It was affordable, perfectly situated ie close to Karama Shopping area, Beach and Spinneys Supermarket is also within walking distance. Service was excellent, although having said this, I think that the restaurant staff could do with a little more training in that on at least 3 occassions, there was a shortage of glasses for the juice, and the hotel wasn't that full at the time. Guests had to ask for the glasses. What I also found a little unprofessional was the fact that the porridge was re-filled into the bowls in full view of guests .... would have been better if the waiter took the bowls into the kitchen, filled them there and then brought them out again. Other than this, I'd definitely recommend this hotel, rooms are spacious and the bed is HUGE. Every room is equipped with tea/coffee making facilities and a little kitchenette which includes microwave, fridge, cutlery & washing machine. There's also a bus stop across the road .. bus trips are cheap and buses come along frequently on this road. Alternatively, if you're returning from somewhere, you should ask the bus driver to drop you off at Big Spinneys (there's a few and we weren't aware of this until a taxi driver dropped us off at a different Spinneys) or Burjuman Centre....these are the landmarks close to the hotel from where you can walk.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Française à Dubai", "Title": "“Perfect !”", "Author": "jinx4384", "ReviewID": "UR26365280", "Content": "I've been in Dubai since January for business and will stay until end July. I bumped into this hotel by luck as I wasn't especially looking for an hotel appartment... Service here is always great, and even though it's an hotel, rooms are furnished enough to look like it's home ! And location is very convenient: close to the beach and to main roads, & neighbourhood is full of restaurants and local souqs, So, strongly recommended either for business or leisure ! =D", "Date": "March 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Lake District", "Title": "“jewel of a place”", "Author": "chutneymonster", "ReviewID": "UR25640805", "Content": "Came accress this place by accident on the internet and what a little jem it is. Entrance hall all marble and brass with a glass elevator. I had a room with 2 double beds,cooker,fridge,microwave and washing machine and giant TV. A/C was very efficient. Breakfast was served in a lounge and plenty were having it but I had breakfast meetings all week so did not indulge myself. No room service but the reception had take away menus which you could have delivered to the room. Very nice pool on the rooftop with sun loungers. Good and clean and reasonably priced for Dubai at $154 for a room that would sleep 4 Burjuman Mall is only 5mins walk as is Spinneys supermarket", "Date": "March 5, 2009"}], "HotelInfo": {"Name": "Belvedere Court Hotel Apartments", "HotelURL": "/ShowUserReviews-g295424-d1384399-Reviews-Belvedere_Court_Hotel_Apartments-Dubai.html", "Price": "$75 - $201*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Al Kuwait Street</span> | <span class=\"extended-address\">Burdubai</span>, <span class=\"locality\"><span property=\"v:locality\">Dubai</span></span>, <span class=\"country-name\" property=\"v:country-name\">United Arab Emirates</span> </span> </span> </address>", "HotelID": "1384399", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/d6/aa/d6aa5893a5f5c4534f66e9a4c102bc4f3large.jpg"}}