{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“Could do much better”", "Author": "lolobkk", "ReviewID": "UR125061041", "Content": "Was obliged to book a hotel quickly for a short notice trip to Dubai and my usual hotel were full .. The hotel is ok but the service is absolutely lousy even if some staff are nice but a total lack of management I suppose. No Internet wi fi in rooms , just in lobby ... The room is fine nothing special , large bathroom .. I could even see the plane take off from my bed so it's a bit noisy but not so much. Overall I won't return , I cannot say its bad but it's between good and so so ..", "Date": "February 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Limassol District, Cyprus", "Title": "“Nice Rooms”", "Author": "boobie3", "ReviewID": "UR124674612", "Content": "Stayed in the family room with my husband and 2 young boys and found the room to be very nice, clean and spacious. Did not like the rep that sold us our city tour. He kept insisting that we take the private one instead of the group tour which at the end our tour guy finished the tour in 2.5hours instead of 4. We would have been better off taking the hop on hop off bus. Also we were not given new towels and had to request them. Probably will stay at a different hotel next time I visit Dubai.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tehran", "Title": "“Clean & Comfortable”", "Author": "sh m", "ReviewID": "UR124070375", "Content": "The Hote was clean and comfortable. Hotel's facilities such as swiming pool and gym were nice too. But there was two negative points: There was sounds everyday in early morning from the mosque close to the Hotel and too much niose in the restaurant when the Hotel is crowded. However, we generally enjoyed it.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Karachi, Pakistan", "Title": "“Best place to stay in very affordable price”", "Author": "Farrukh M", "ReviewID": "UR123679431", "Content": "People wrote that they saw a lot of stranger, well you are going to a different country obviously you will see strangers!!!, in my stay I did not see a single suspicious activity in the hotel like you see normally in other 4 star hotels of Dubai that strange girls are coming and other non-ethical things. The only thing I found bad was the business center that is not good but as a replacement lobby is great. I stayed there in October 2011 and going again on March 8, 2011. I am doing software development from Pakistan for some USA clients and they come for the meeting in Dubai every year and stay at 5 star hotels, I ask them that why they spent this much of money while there are other hotels where we can stay good as we have to do meeting all day in the lobby/business center and then go out to malls and then come back to room to sleep, he asked me to select a hotel and I selected City Seasons hotel Dubai just by reading info from the internet and you know what my client said he will always stay at this hotel. City Seasons hotel has great room honestly if you compare the room with a 5 star hotel’s you will find no big difference. The washroom is excellent with all accessories, beds are awesome, LCD big screen TV, 24 hours free of cost internet both wired and wireless in the room (5 star charge you a lot for internet and they give wireless only in the lobby). The hotel is well situated very near to the airport a 3 minutes’ walk and you are at the metro station and city center mall, behind the hotel there are other great mall, a 4 minutes’ walk and you have Garry’s Danata office if you are an emirates traveler and need something. Food is excellent and the dinner/lunch buffet charges are very low but the food is excellent both in taste portion. Gym is good swimming pool is small but acceptable. Lobby is excellent and 24 hours room service is on the top. Above all the staff, I felt that I am the president of this hotel when the staff talked to me. You will love the staff for how they talk and care for you. I say that City Seasons hotel is the best place to stay if you have a business trip to Dubai or even you are coming with your family for vacations. This is an alcohol free hotel and the hotel surrounding is great you will not see any bad stuff around the hotel which you see around other 3 and 4 star hotels in Dubai like pimps and prostitutes. City seasons hotel is great from every aspect and from every point of view.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Tehran, Iran", "Title": "“terrible hotel i ever seen”", "Author": "navid_shakourian", "ReviewID": "UR122076127", "Content": "we were stayed there from 19 DEC 2011 till 22 DEC 2011. this hotel is full of strangers that are not guests . reception is usually angry and didn't like to answered us. worst of all : one morning at 4.15 AM we heard someone screaming . we woke up and ran out. and saw a girl lay down behind the one of rooms and just scream... and no one was there to help.. after 5 or 6 min the security (a thin small man) come and couldn't do anything to make her quiet . the girl was still screaming. terrible terrible terrible. I NEVER and EVER come back there.....NEVER", "Date": "December 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Vienna, Austria", "Title": "“Business and close to airport”", "Author": "Mikes3103", "ReviewID": "UR121371910", "Content": "We stayed in this hotel for 3 nights and really liked it, the room spacious, internet access, close to airport and basically between Dubai and Sharjah and nice access to road, we had a rental car and easily got around, the only setback is that it is a bit secluded and nothing really outside the hotel, so if you have no car you need a taxi to get around, The staff is friendly and helpful, (I had some medical problems and they got me a doctor within 30 minutes, excellent!!) for sure I will stay there again", "Date": "December 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cuba,NY", "Title": "“The City Seasons is a very good choice”", "Author": "travel_savvy_NY", "ReviewID": "UR121242044", "Content": "We stayed in this hotel for four days and found it to be a very good choice for value and service.The staff is attentive and friendly. I immediately felt very welcome, The room was clean, spacious, and tastefully decorated. Internet access is included in the price of the hotel room which is not always the case in Dubai We also had a large balcony to enjoy the warm breezes of the gulf. Within walking distance, (about .05 miles) is the City Center Mall which also has a Carrefour where a vast array of everything from fresh fruits to inexpensive Arabic style clothing and household goods to electronics can be found. Also, if needed, there was always a taxi around to take you wherever you want to go. My only criticism is that the location does not lend itself to some of the beautiful views from other hotels but who wants to stay in the hotel and look out the window when there is an exciting city out there to experience! I will stay here again and would recommend The City Seasons Hotel to friends. As an added note: While I was traveling to Dubai I twisted my knee and had to use crutches. The staff at the hotel were kind enough to let me use their wheelchair the whole time so I could go to all the attractions and fully enjoy myself despite my mishap.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Florida City, Florida", "Title": "“Good Hotel to Stay”", "Author": "Ravi K", "ReviewID": "UR120606658", "Content": "I happened to stay long in Dubai, I found City Seasons Hotel a very convinent place to stay. The rooms are very good , well maintained ,tidy and the stay thorughout was very comfortable at a reosonable price. . The staff made me feel a special memeber of their family and they went extra mile to meet my special requirements with a smile and i would say it was like my home.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Nice Stay”", "Author": "Reza F", "ReviewID": "UR119703948", "Content": "Our stay at City Seasons Hotel was very good. The shopping centre is very near... meto is walking distence and the hotel services very good. Staff polite and ready to help. Wanted an adapter at 02.00 am and took only three minutes for the delivery.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Iran", "Title": "“Excellent”", "Author": "Sabbase G", "ReviewID": "UR119583672", "Content": "I stayed at City Seasons Hotel last month and found the hotel to be excellent. Rooms are spacious and the services are on the top. Staff was very helpfull and we are planning to stay at the same hotel again after three months.", "Date": "October 22, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Tehran", "Title": "“Not recommended to foodies”", "Author": "Bluemerrow", "ReviewID": "UR118098167", "Content": "Stay: 18th August 2011 - 22nd August 2011 Very near City Center Shopping Mall, City Center Metro Station Shuttle Buss to Dubai out let mall Spacious Room A nice Big TV with various Channels Clean Bathroom Excellent Room Service Free WiFi in the Lobby Nice and Friendly Staff Very Helpful Concierge Restaurant Staff very nice Food ... sorry to say not that great.", "Date": "September 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "uk", "Title": "“fantastic....too good to be true for such good money!”", "Author": "putakum", "ReviewID": "UR104910784", "Content": "a nice small cosy hotel, where me and my family were welcomed very warmly. we were served fast and effiecently at the reception desk, and were offerd juices. rooms were exceptionally clean and extremly spacious... we were offerd inter-connecting rooms which was really nice... pool was lovely, it was often quiet and not buzy so me n my family luvd it. room service was not expensive and cud order food without a problem. taxi was easily avalable from outside the hotel. it was a 10min drive to the airport. lobby was simple but nice. we were always greeted by the staff. it was 5-7 min walk away from the city centre, so very convenient. we stayed for 6 nights...it was awsome. DID NOT LIKE THE BREAKFAST IT COULD BE IMPROVED. IT WAS TOO BASIC. Apart from that the hotel is 10/10", "Date": "April 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“great hotel, quick service, lovely staff”", "Author": "lovemyholidaysalot", "ReviewID": "UR95612834", "Content": "i stayed in this hotel the last week of january 2011. i have to say it was a pleasant stay and i was happy with the service they provided. staff were helpfull when i was stood alone waiting in the lobby waiting for a friend to collect me they asked if i was ok and needed help thats how helpfull they were. the service was very quick everytime i called room service. the bell boy was very helpfull and prompt. when i needed a taxi they were happy to get one for me and give the taxi driver instructons on where i wanted to go. the free wi fii was very good. my room was spacious and the bathroom was a nice size. it had everything i needed. i would be more than happy to stay here again.", "Date": "February 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Fantastic”", "Author": "BM2759", "ReviewID": "UR91607622", "Content": "* great service * knowledgeable staff * affordable accommodation * Shopping mall nearby * Great food quality Our stay here was wonderful. Highly recommended", "Date": "January 3, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“If you are a dog with a disability you might like this place”", "Author": "Sandst0rm", "ReviewID": "UR87779315", "Content": "How many design flaws and service faults can a hotel display in a single night? I’ve only been here for four hours so far but here goes. There is supposedly “valet parking” but you would have to drive up two levels of curbs and bust through some poles to get to the door, instead you have to park your car yourself (fine) but then the guy inside offers to go and repark it for you… for what purpose? Check in was fine but the room smelt like wet dogs have been living here for the past week. Was too tired to change rooms, in retrospect I should have because it only got worse. My room had no room service menu, no internet cable, and a dresser which hadn’t been wiped down from the last guest who had clearly eaten off it. Strawberry jam, it seems. All of the TV channels are listed incorrectly compared to whats actually on the TV, the only channels on the list which I know are vaguely entertaining were nowhere to be found on the telly. The time on the clock in the room was also wrong. Called to request the room service menu and the internet cable and followed up twice over the next hour, finally I issued a ten minute ultimatum before I would leave the hotel. The menu turned up straight away but not the internet cable. Still with no internet and no television I have decided to calm my frustration with a glass of wine from the mini-bar. No alcohol. In the entire hotel, apparently. Have finally ordered room service, they apparently couldn’t manage a baked potato, only mashed potato which makes me wonder what the mash will be made of… room service arrived and was fabulous, great steak. I’m shocked. Noted spyhole cover is broken. The bathroom is a disabled bathroom with safety bars everywhere which gives me that queasy feeling of being in a hospital. There’s no toilet lid, and it stinks! Perhaps that’s handy for the thirsty wet dogs of last week, but I don’t like a gaping toilet and had to cover it with the shoe basket while I had a shower. The plughole doesn’t work so the bath fills up while you shower and the curtain is too short so water got all over the floor. If there had been any wine in the fridge I would have easily slipped over and ended up needing the safety bars after all. There is a loud band playing even though its now after 10pm on a school night, internet guy turned up 4 hours late to “check” that I honestly didn’t have a cable, reeking of cigarette smoke so badly it mingled with the dog smell and lingered in the room, he then took another 20 minutes to return with the cable itself. The cable is only long enough to reach from the back of the telly (where the port is) to the front of the telly so I have to sit awkwardly right in front of the television to do any work. The room might be bigger than a normal 4 star hotel and it’s a fairly good price I guess, still, these are really basic, annoying faults which ruin your stay and would be so easy for them to have sorted out. I haven't even gone to bed yet, god knows what else will go wrong! Unless you’re a teetotalling canine with a disability, there are much more comfortable options in Dubai.", "Date": "November 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "rasht", "Title": "“great holiday”", "Author": "fatimayas", "ReviewID": "UR80121859", "Content": "great rooms and staff with a friendly atmosphere but terrible food for iranian taste,", "Date": "September 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hyderabad", "Title": "“Very good hotel with great location”", "Author": "Prabhakar G", "ReviewID": "UR65239547", "Content": "It is located in the best place. close to Airport and shopping centers. Good big rooms. Spacious rooms with all aminities. I really enjoyed the hotel stay.", "Date": "May 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bucharest", "Title": "“Comfortable Stay”", "Author": "silivestru_sandu", "ReviewID": "UR64181673", "Content": "hotel is very clean, people are frendly and foods a fresh and tasty. good A/C system and easy acces to the city shops. Value for money hotel.", "Date": "May 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "4", "Location": "2"}, "AuthorLocation": "toronto", "Title": "“Terrible place to stay”", "Author": "shabnamhori", "ReviewID": "UR62608807", "Content": "Well we stayed for five nights. The double glass windows need to be check definitely since you could hear the air plane noise & construction noise nearby. During our stays never had the bathroom clean properly or better yet the room. We had problems in our bathroom, every time when we open the water; the bathroom stank like there was a dead animal there. The smell was so intolerable but did anybody care. Not even the hateful front desk people. The cleaning staffs were just making small talks and try to be nice but no cleaning service what so ever. The rudest front desk ever & charged us $100 US for deposit. They say free wireless internet but far from it. The internet connection was very poor. The restaurant been busy all the time if you weren't presented certain time no place to sit down and very noisy.‎I wouldn't recommend it. It has been my eight visits to Dubai so far couldn't find a decent hotel in Deira area. What a shame!", "Date": "April 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "bangalore", "Title": "“A good Hotel- in a very good location- very good staff”", "Author": "brprakash", "ReviewID": "UR59015025", "Content": "City Seasons is hotel located just next to Dera City Center, Dubai. Infact I found this to be the very convinient location for shopping in dubai. Each room has a Kitchen with good standard crockery. All the standard requirements are taken care of. A washing machine, A microwave, refrigerator, Iron box, Two TVs for each room, one in the seating area and one in the bedroom. The TV is of limited use as you will not be able to see any thing other than two-three indian channels. The Staff are very good.", "Date": "March 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Tehran", "Title": "“casual luxury”", "Author": "kaveh1982", "ReviewID": "UR52312080", "Content": "It was my first trip to dubai and i found city seasons a nice, clean and comfortable place to stay with good access to major dubai shopping centres. the rooms were clean and spacious and furnitures were modern and new with a very comfortable bed... the only negative point was relatively limited variation of foods. all in all i recommend this hotel to all travelleres specially those with families who need a quiet and clean place to enjoy...", "Date": "January 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Nottingham", "Title": "“Good Hotel for a Short Break”", "Author": "Mike1986", "ReviewID": "UR45876831", "Content": "Stayed at the Hotel for 8 Nights nice big room big bath as well 32\" tv, high speed internet in the room not wireless though cable only. not much of a mini bar but it is a dry hotel. Not a great choice for breakfast but does the job if you want a simple breakfast the location is not the best 5 minutes from the Deira City Centre Mall which has a wide selection of shops. Problems with taxis being able to find the hotel as there is another one of the same name. But is the suites instead and the hotel is down a quite road out of the way. Nice pool on the roof not busy at all carparking in the basement if you hire a car out. Only problems with the hotel was unstanding each other and on checking out tryed to charge us for breakfast when it was included due to another guest putting breakfast on are room but was corrected when the signature put down for breakfast did not mach mine and the name was not correct on the room. All in all had a great time and would go back to the hotel next time am in Dubai.", "Date": "October 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "lugano", "Title": "“Very good hotel, great service, best location”", "Author": "Ele1508", "ReviewID": "UR38772542", "Content": "The hotel is brand new, the rooms are big and comfortable. The service is great, staff is kind and welcoming. The clealiness of my room was impeccable. Breakfast is very good and offers a wide variety of choice.", "Date": "August 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Annecy, France", "Title": "“Great location close to airport, very good hotel but very poor reception staff”", "Author": "Evmasson", "ReviewID": "UR35269797", "Content": "The city seasons hotel is a10 mns drive from the airport and so very convenient while on a stopover. It is a modern, comfortable and convenient hotel. The rooms are spacious, clean and comfortable. They are not cheap but I got a very good last minute deal on opodo.co.uk- 50 euros instead of full price of 350 euros, I think. The location is great for the airport but then it s kind of in the middle of nowhere... The closest attraction is Deira shopping center, otherwise it s just building-finished or under construction but that s Dubai... The only think I didn-t like is the coldness of the receptionist who was telling a colleague off while checking me in... Not very welcoming. However, the people at the entrance were very friendly. As I stayed for a few hours only, I didn-t use any of the facilities and therefore cannot comment on them. All I know is that there is a gym and an indoor pool.", "Date": "July 20, 2009"}], "HotelInfo": {"Name": "City Seasons Hotel", "HotelURL": "/ShowUserReviews-g295424-d1390312-Reviews-City_Seasons_Hotel-Dubai.html", "Price": "$123 - $817*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Al Maktoum Road, Port Saeed, Deira</span> | <span class=\"extended-address\">Airport Road</span>, <span class=\"locality\"><span property=\"v:locality\">Dubai</span> <span property=\"v:postal-code\">182002</span></span>, <span class=\"country-name\" property=\"v:country-name\">United Arab Emirates</span> </span> </span> </address>", "HotelID": "1390312", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/18/fe/18fefe43a4f7b7af20c6eb07ade9f6617large.jpg"}}