{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Isle of Man", "Title": "“Bargain rate on the net”", "Author": "manxcat55", "ReviewID": "UR139071178", "Content": "We had a stop over here on our way home recently. The room and bathroom were modern and clean with a great walk-in shower. The fridge had a couple of bottles of water which we were thankful for as the bar/cafe did not open until 7:30pm and it was a stonking 35 degrees outside. Tried to watch TV but very few English channels - not even CNN. We sampled the cafe when it finally opened and food was basic but ok and not expensive. My only complaint was that the complimentary bus to the airport only goes on the hour so we had no choice but to take the red-eye special in order to get there in time. Good news though was the price - we booked online and it was a real bargain...£49.", "Date": "September 1, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Early morning flight? B.Y.O.B. (Bring your own breakfast)!”", "Author": "JeffinPrague", "ReviewID": "UR136959522", "Content": "We stayed here for a night between flights in and out of Madrid. No complaints about the location or the hotel itself. The only thing that bothered me was their breakfast policy. A hotel that claims to be a transit hotel should recognize that people have flights that leave early in the morning. Breakfast starts at 7 am, which for a lot of travellers is too late. They do provide a few snacks (pastries in cellophane wrappers) and tea and coffee, but when I asked if I could have some milk for the kids or some juice, they refused, saying that the waiter doesn't start till 7. Is it that difficult to have a pitcher of juice and milk out for people to have? For them it was, and it ruined my experience at this hotel.", "Date": "August 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Alekulla, Sweden", "Title": "“Good Place for a layover”", "Author": "Amy B", "ReviewID": "UR135448746", "Content": "Spend a night at the Tach hotel on a layover and the hotel was good for that purpose. The free airport shuttle was great and very helpful and the being only a few minutes away from the airport helped with the early morning flight. Rooms were basic, but clean. The hotel is perfect for layovers, but wouldn’t stay here for an extended period of time.", "Date": "July 26, 2012"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Rooms": "5", "Value": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Between Arrival & Departure”", "Author": "Mirene-Mirene", "ReviewID": "UR133280717", "Content": "This hotel is a really nice choice if 1) you need to sleep somewhere between two flights, or 2) you’re for a short stay in Madrid with inconvenient time of arrival/departure, or 3) you’re on a tight budget but sacrificing comfort is not your thing and you don't mind spending some time on the way to the centre. The location very close to Barajas Airport and free 24-hour transfer from and to the airport (reserve in advance!) together with very reasonable price makes this hotel convenient for the above mentioned categories of travellers. I really liked its comfort and design, and it’s good value for money. Breakfast is optional and for 6 EUR is quite OK. There’s also a bar and a restaurant at the hotel, as well as computers with printers at your disposal (at a charge). The facilities include efficient a/c, a fridge, a safe with a digital lock. The bed is comfortable, the curtains are thick (you can make it really dark in the room if you want to sleep at the daytime!), there’s a good choice of toiletries. The windows are soundproof, the door is not, but if you don’t have too noisy neighbours it’s not a problem. The metro station (Barajas) is about 7 minutes on foot, the district is very quiet and safe, the metro is also safe so don’t worry about coming back late. Remember that the way to the centre of Madrid takes about 35 minutes by metro (with 2 changes), about 50 minutes to Atocha (railway station) – it doesn’t seem too long, but for a comfortable exploration of the city and neighbouring towns this hotel is not the best option. But if you're one of those travellers listed above, this hotel is what you need.", "Date": "July 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "", "Title": "“Good for an early morning flight out!”", "Author": "Lisa B", "ReviewID": "UR132245728", "Content": "We had an early morning flight time and the hotel provided a free shuttle, brilliant! But we had trouble finding a decent meal away from the hotel and the restaurant didn't open til 8pm, which is late when you are up early, and the food was basic. Our last meal in Spain could have been better.", "Date": "June 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Reynoldsburg, Ohio", "Title": "“neat hotel close to the airport”", "Author": "Karrie C", "ReviewID": "UR132237906", "Content": "This hotel is close to the Madrid Barajas Airport and even offers a free shuttle service to and from the hotel. The staff was very friendly and the rooms were quite large and clean. My husband and I even had a balcony with a table and chairs while my mom's room had a large window from which she could see the airport in the distance. Breakfast was included and was a simple selection of coffee, milk, juices, yogurt, fresh fruits and toast. We ate dinner in the hotel because we arrived so late and the food was decent but I'd rather have eaten in a local cafe for better food and lower prices. I only really have 2 complaints- the shuttle service from the airport took over an hour to arrive and we had no way to call since our phones don't work outside of the U.S., also the lighting in the hotel made the hallways seem creepy and it was somewhat hard to see in the room (although the lighting in the large bathroom was more than adequate). If I ever need to just pass through Madrid again, I would definitely stay at this hotel.", "Date": "June 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Peterborough, United Kingdom", "Title": "“Good location”", "Author": "MrsJonesJnr", "ReviewID": "UR132107573", "Content": "We picked this hotel for the free airport shuttle and Metro location. Although we had a wee wait for the shuttle, check-in was quick & easy. Sergio on reception was most helpful for directions to the Metro & providing the city maps. He was also a star the next morning by reuniting us with our directions for our onward travel plans.... Top marks to him!! Saw previous reviews regarding the breakfast, but can honestly say that it was absolutely fine & more than adequate. Agreed, it is not a hot buffet, but there was an array of pastries, fresh sliced bread, fruit, yoghurt, tea, coffee, juice etc There was also a toaster to toast your own bread & tomato paste for tomato toast, which is typical Spanish breakfast fayre. There are also plenty of amenities extremely close by, such as shops, bars & restaurants. All in all, we would use again & recommend it to others.", "Date": "June 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Nice overnight stay by airport”", "Author": "Jencolem", "ReviewID": "UR131788584", "Content": "Had an early flight and decided to stay at this hotel. Free p/u at the airport had me waiting 20 minutes so that's not bad. Check-in was seamless. Had vending machines for salads/sandwiches which was nice. Rooms were just like the pictures. Bed was comfortable. Shuttle to airport easy. Give this place a try.", "Date": "June 11, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Too far from any interesting place in Madrid”", "Author": "JohVan", "ReviewID": "UR130678777", "Content": "Nice rooms, new, modern; bathroom suberb. Distance to nearest metrostation : 5-10min walk, BUT it takes at least half an hour (and more) to get to the city center with the metro (goods connections, but it is far). Breakfast (extremely little choice) to avoid, disgusting coffee and juice, awfull baked croissants, very unpersonal design of breakfast room. Good price. Relatively quiet hotel.", "Date": "May 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Berlin", "Title": "“Good busines hotel”", "Author": "sherwivi", "ReviewID": "UR129446376", "Content": "The location is super - close to the airport and the feria. The staff were very helpfull and recommended a pleasant restaurant near by. The rooms are clean and nicely designed. I totally desagree with teh previous review. The price is very reasonable and you get a decent standard room for that with a standard 4* breakfast.", "Date": "May 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Belgrade, Serbia", "Title": "“Not satisfied!”", "Author": "Sofijana", "ReviewID": "UR129414828", "Content": "Close to Barajas airport, quiet neighbourhood, good connection with city centre via Metro. Good Internet connection (but not for free). And that's all that is good. Upon arrival - one large towel was missing. Next day, the bed sheet was taken and not replaced with new one. Blanket covers are dreadful - we had to take them off just to discover dirty blankets! Small room with dirty windows, only one chair in double room, generally poor lighting, no mini-bar, no toilet brush. Breakfast was a complete joke - no cheese, no eggs, nothing made of meat, just bread, butter, and some silly sweet things (jam, fruits...). Compared with several other 4 star hotels in Spain and Italy, this one certainly deserves 3 (at the most).", "Date": "May 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Good hotel”", "Author": "danandrei", "ReviewID": "UR128572851", "Content": "The location is good, 5 minutes from the Metro Station. The free shuttle is perfect and the price is low. The hotel looks new with a modern design. The soap smells nice and it's orange like everything else around. :) It is a good 4*hotel at a reasonable price. The breakfast that cost 6 euro/person is in fact a coffee and a croisant. It should not be named breakfast. If we call it breakfast it's the simplest breakfast I've ever eaten in a hotel. The wireless internet should be free. The problems with the hotel are in fact: the lack of the breakfast and of the free wifi internet. Otherwise it's ok.", "Date": "April 25, 2012"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "matagorda", "Title": "“nice hotel”", "Author": "henb71", "ReviewID": "UR126648096", "Content": "we stayed here on our way to and from france we had a pleasant experience on the night we arrived, it has a nice bar with snack food , burger king and the high st is 5 min walk, rooms were clean and comfy and the girls on reception were v nice and helpful but on way back we had a guy on reception who wasnt v helpful and rude and not v professional however next morning a v nice girl on reception apolagised about the mix up the previous night .", "Date": "March 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "southampton uk", "Title": "“overnight stay”", "Author": "SouthamptonUkSandy", "ReviewID": "UR126489000", "Content": "close to the airport, shuttle bus there immediately. good reception at the hotel. Bar snacks good and price very reasonable. Rooms clean and comfortable, breakfast basic but adequate and no waiting for the shuttle to the airport, would recommend.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Colombia", "Title": "“Excellent hotel for a Madrid stop-over”", "Author": "Sascha F", "ReviewID": "UR125977256", "Content": "Over the last couple of years I always stayed at Hotel Tach when I fly in from South America to Europe. Usually I only stay for one night to catch my connection flight the other day. If you pre-book in advance through their website you get very good rates and a six Euro voucher which you can use for breakfast or Internet. The shuttle service is fast and reliable and works 24 hours but only leaves every hour from the hotel. The hotel is just a 15 minute drive away from the airport in downtown Barajas and a short walk from the metro station which makes it convenient if you want to visit the center of Madrid. To Sol (the center of Madrid) you might have to change two times the metro and it can take between 45-60 minutes. I wouldn't recommend the hotel if you just want to visit Madrid - then you should book something more centrally located - but it is a perfect hotel if you are connecting flights through Madrid and also want to visit downtown the day of your arrival.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“over-rated”", "Author": "Barbara B", "ReviewID": "UR125944421", "Content": "This hotel is OK but extremely basic and in a pretty crummy neighborhood. It is well-located for proximity to the airport and the metro, the reasons we selected it, but it wasn't very comfortable, and certainly what I expected for the number of stars it has been awarded. At the very least it could have more lighting in the hallway, not to mention the rooms. It would be much more acceptable if there were fewer stars associated with this property, but to us, the only thing going for this hotel was its proximity to the airport. Most everything else was barely OK and not multiple stars-worth.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good surprise”", "Author": "Chus_Gijon", "ReviewID": "UR123935374", "Content": "This was a nice surprise. I had a very brief stopover in Madrid so I just wanted a room for some few hours and free shuttle to the airport. This economic four star hotel had all of it and also the room is excellent, with a big and comfortable mattress. Breakfast buffet is quite basic, but at least they only charge 6 euros.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Great and convenient hotel near Madrid Barajas Airport”", "Author": "sonrisa18", "ReviewID": "UR123614618", "Content": "I stayed at the Tach hotel before two of my flights out of Madrid Barajas Airport and had a very pleasant stay. Their free airport shuttle is very convenient, especially if flying out very early in the morning. The rooms are clean, modern and comfortable. The hotel is located within walking distance of Barajas metro station, so getting to it is easy enough. The area is quite and I don't recall hearing any sound of planes. I would stay there again if I had to fly out of Madrid.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Excellent hotel near Madrid´s Airport”", "Author": "William N", "ReviewID": "UR123530469", "Content": "This hotel provides an excellent value for your money. It is located in downtown Barajas, some 300 meters from the subway station and less than 10 minutes from the airport. If you don´t mind riding the train to the center of Madrid, do yourself a favor and save money by staying at this hotel. It is a hotel that looks and feels new. Ample rooms and lots of amenities. It provides airport pick-up and drop in service.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“perfect location near Barajas airport”", "Author": "marc t", "ReviewID": "UR122681823", "Content": "We really enjoed to stay at this hotel, with a excellent standard for service and confortable mdern room . free airport shattle P:S there are some restaurants just near the hotel(\"Timon streat) \" be carefully they are very expensive\"", "Date": "January 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Offenbach, Germany", "Title": "“Reasonably priced and covenient to the airport and moptorways”", "Author": "IJS63065", "ReviewID": "UR121132005", "Content": "We wanted a hotel with parking near the airport and taeCH suited this perfectly. The staff were very helpful and the price was extremely good -Eur98 for two nights. The room was bigger than we had expected and the large walk-in shower was definitely a plus point. It would also be good for families as there is a children's play area right outside the door. A ten-minute walk takes you to a main street with bars and restaurants, as well as a Metro station. The only negative was the breakfast which was very basic although it only cost EUR6.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tangier, Morocco", "Title": "“excellent for an overnight stay between flights”", "Author": "eirlys55", "ReviewID": "UR120390155", "Content": "This hotel provides everything you might need if you have to spend a night in Madrid between flights. It is a pleasant modern hotel, very clean, quiet and in good condition, located, not out in the wilderness, as so many of the hotels advertised as close to the airprt turn out to be, but in the small town of Barajas, which is fine for whiling away a few hours or more - plenty of choice of restaurants, bars, shops on the doorstep, and an attractive square lined with hostelries to sit in with the locals till late at night, if you feel like it.. The hotel offers a very good value breakfast, and there is a vending machine dispensing sandwiches, snacks, etc and a microwave you can use if you happen to arrive at the wrong time of day or night. If you have time to go into Madrid, the metro station is just down the road. Best of all, the free shuttle which goes back and forward to the airport every hour - no need to call when you land, just wait at the collection point, and once at the hotel you can ask the desk staff to book you in on the most appropriate shuttle back. Everything seems to work like clockwork. We did have one problem when the shower was running hot and cold late at night, but after we phoned a member of staff was at the door in a couple of minutes and since the maintenance staff were not available they simply gave us another room (larger and better equipped). Really excellent value for money - have paid much more for much less in the past, but now I will be going back to Tach Hotel.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Excellent hotel BUT you need to follow some simple tips”", "Author": "serokisa", "ReviewID": "UR120384746", "Content": "I have stayed at this hotel 3 times, last time a few days ago. It remains to maintain excellent standard for rooms and services. Concerning the shuttle bus from the airport: you MUST wait outside the terminals at Hotel Bus Stop designated spot. And yes, you need to call the hotel when you are there. And the bust will come in 10 mins max, I tried it several times and it indeed works! There are A few bars 10..15 mins walk at Barajas plaza are conveniently offering simple food. AND book at hotel website, you will get some perks not like thru booking.com -))", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Amsterdam", "Title": "“Good and conveniently close to the airport”", "Author": "Havedone7continents", "ReviewID": "UR120207124", "Content": "A good choice for travellers who need a place to stay close to Barajas Airport in Madrid. Very affordable, modern and clean hotel. Very friendly staff. Free airport shuttle, only trouble was getting the shuttle fróm the airport to the hotel, ended up taking a taxi.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Great hotel, bad noise!”", "Author": "lrossouw", "ReviewID": "UR118627973", "Content": "I would have given it 5 stars. Except that they had a large get together of locals from the neighbourhood outside right below our rooms. This was a Friday night. It was noisy with kids screaming, people shouting, drinking etc. until well after 23h00. Not really good for an airport hotel especially if you had to get up at 3am for a flight! I'd say stay away from here over the weekend. Otherwise everything was good for this hotel. I", "Date": "September 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Long Beach, California", "Title": "“Beyond expectation - awesome, cheap and modern”", "Author": "ianatbragg", "ReviewID": "UR118510794", "Content": "I did not expect this hotel to be this good so close to the airport. We booked it really cheap and was not expecting much. Shuttle passed by our terminal (Madrid-Barajas airport) when we arrived at 10pm. We didn't even need to call although the email said that we should. Wife and I were amazed by the room and the facilities. The room was modern with ample amount of lighting. Bed sheets and pillows were comfortable. Toilet and showers were clean and had the complete toiletry kit. TV had English channels and we even had a balcony. Curtains were really dark. There was a microwave by the front desk and some vending machines. I also saw a desktop computer for internet access by the front desk and it was a minimal fee to use it. There was a bar, tennis court and outdoors eating area for breakfast. We missed breakfast so I couldn't tell you if it was any good. Hotel was only about 5 min away from the airport. We walked around the neighborhood and it was safe. The front was a school and the hotel was next to a park. Burger king was 5 min away (closed at 1am) with a few bars and restaurants that looked like it was full of locals. They were still open and it was almost midnight. There was a convenience store behind the burger king for water and junk food. I will stay here again when in Madrid airport.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“great modern hotel near Barajas airport”", "Author": "LellaSS", "ReviewID": "UR118379699", "Content": "If your flight is very early in the morning and you wish to have a great night's sleep, you wouldn't miss the chance to spend the night at this hotel. Great value for money, huge rooms, comfy beds, modern bathroom with a mini fridge and complimentary water. It also provides a shutte bus service every hour to take you to the airport. It's not that far from the Madrid City centre as you can easily reach it by underground ( by changing two or three lines). the nearby area is very quiet although the small village of Barajas is right in the middle of Terminals 1,2,3 and Terminal 4. Highly recommended", "Date": "September 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Malaysia", "Title": "“Good hotel for overnight stay near the airport”", "Author": "becksangel7", "ReviewID": "UR118350506", "Content": "Booked this room for one night as we were flying off first thing the next morning. As soon as we reached the airport, we called the hotel for the shuttle and waited for about 5 mins at the hotel bus stop. It was another 8 minutes drive from there to the airport. The hotel was in a small and quiet neighborhood. A few cafes and a grocery store within walking distance. Also a burger king. It was 5 mins walk to the Barajas metro station. And it's approx 30 mins train ride into Madrid town. Staff were friendly enough. The corridors and rooms are furnished in dark colors. Only con was the aircond was not cool enough even til the next morning. Bed was comfortable. The next morning we took the 5 am shuttle to the airport. The shuttle runs at every hour and be sure to tell the receptionist the day before if u need the shuttle.", "Date": "September 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "1.0", "Service": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“Poor room insulation, I won't come back”", "Author": "Carlos R", "ReviewID": "UR117909950", "Content": "The room has a great degree of noise filtration from rooms either side. I stayed in the hotel because I was flying early next morning. My neighbours on both sides, which seemed to be of the same party, were up till late. I went to bed very early but because of the noise problem I was not able to sleep. When I called reception, they told me that hopefully they will go to bed soon. Although the hotel is very close to the airport, I would not recommend this hotel if you need a good rest prior to your trip. The rooms are not properly insulated, and the staff were disorganised(room alocations) and unresponsive.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "UK", "Title": "“Airport Shuttle covers more than one Clement hotel”", "Author": "snowdrop5", "ReviewID": "UR117856400", "Content": "On arrival at terminal one there is a board listing the phone numbers for the airport hotel shuttle buses, called for the shuttle and it arrived promptly. In our half asleep state it wasn't obvious that the shuttle calls at two hotels. We got off at the first hotel (Clement Barajas Hotel) presuming it was the correct hotel, it had paper notices outside relating to the Tach. I assumed rebranding was in progress and the driver didn't have enough English. It was then a twenty minute wait for the dark blue shuttle bus to return. Room was good, staff were good, for a hotel that was four stars the breakfast buffet selection was poor, no cereal, no meat, no cheese, but it was constantly being replenished. Easy walk to Barajas metro station in the morning.", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Montreal", "Title": "“Very convenient for airport”", "Author": "younggaycouple", "ReviewID": "UR115684790", "Content": "Our plane was leaving Madrid Barajas airport in the morning, so we spent our last night near the airport. This 4 stars hotel is very convenient for this: 5 minutes walk from the Barajas subway station and with a free shuttle to the airport. It is an excellent hotel: clean, courteous staff, spacious rooms, spotless bathroom, etc. But it is also rather impersonal: the design of the rooms and corridors is dark and we feel like we were anywhere in the world without being in a definite place.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Oakland, California", "Title": "“Ideal hotel near Madrid airport”", "Author": "Geonev", "ReviewID": "UR111160933", "Content": "The taCH was excellent in every respect. The shuttle was prompt and easy to use, the room was comfortable and well-equipped, and the value was excellent. This is a low-frills option close to Madrid airport, but a cut above most airport hotels. I recommend it without hesitation. My only criticism is that the breakfast was a little on the skimpy side, though still perfectly adequate. Do note that in order to summon the free shuttle upon arrival at the airport terminal, you will need a telephone (or use a pay phone at the airport -- sometimes not easy to figure out after a long flight).", "Date": "June 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bern, Switzerland", "Title": "“exemplary airport hotel”", "Author": "riehen", "ReviewID": "UR108073417", "Content": "It is the first time I get such a quiet hotel so near to an airport. There was absolutely no aircraft noise. For an airport hotel, the price is unbeatable too. The rooms are a bit on the dark side (black bed covers and curtains) but the bed is OK and the window blinds close tight. The breakfast buffet is limited to the \"continental\" items. In addition to the airport shuttle, the airport terminals are only one metro station away. The metro station Barajas is a 5 minutes walk from the hotel.", "Date": "May 13, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lyon, France", "Title": "“Cheap and Practical”", "Author": "comillasmand", "ReviewID": "UR107491004", "Content": "Very Cheap. Due to a very early flight I took this hotel that has shuttle buses to the airport every hour. the convenient aspect is that it is a short walk from the Barrajas metro station and they drop you off at the terminals (on request 24h before hand and confirm on arrival!) Room was great. Service in the restaurant was rather terrible with a waitress that was opening swearing and grumbling about clients. Shame because the food is good.", "Date": "May 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lisboa, Portugal", "Title": "“A good choice to stay overnight between flights”", "Author": "Fleurete", "ReviewID": "UR99508814", "Content": "It's a modern hotel, near the metro. We had a flight to catch the next morning so we arrived late at the evening, we took the metro and walked about 7' to the hotel - it was ok. At the morning we took the hotel bus to drive us to the aeroport ant it was on time. The room was big and cozy and the bathroom modern; i found the pillows very high. We took breakfast at the hotel but it was really poor: on that day, there wasn´t no corn-flakes, cheese or ham, yoghurt, just bread in pieces to toast. Trivial stuff although the price charged is the cheapest of the hotels on that area . I recommend to take breakfast on the hotel only if you're catching the hotel bus early in the morning . We found a coffee near the hotel which opens at 06h30 and serves breakfast (on that day we didn't had the time).", "Date": "March 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Switzerland", "Title": "“Great for airport overnight”", "Author": "ThomasSwitzerland", "ReviewID": "UR98528134", "Content": "Fantastic for an overnight stay. The bus to and from the hotel was great, and the room was very nice; we wish we could have caught our flight later to enjoy it more. The bed was one of the best in hotels I've slept in, and the pullaway bed and crib for our daughter and son were good. The room was large and the ceilings high. There was a leather couch and a big flatscreen TV--and all (for us) below 100 euros.", "Date": "March 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bedford, United Kingdom", "Title": "“Good, functional, especially shuttle bus”", "Author": "Steveie B", "ReviewID": "UR94975886", "Content": "We looked for a hotel with late night shuttle bus as flight arrived at 11pm. Tach advertised it and they came up with the goods perfectly. We called hotel after collecting bags at airport and only waited 5 mins for shuttle bus. Returning to the airport was also efficient but you must book the hourly bus or walk 10 mins to metro. Breakfast is reasonable for the price (6€). We would use this again as an airport hotel but if arriving/departing at reasonable time, I suggest using Metro into the centre.", "Date": "January 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Lisboa", "Title": "“Good and Bad Together”", "Author": "MarMourinho", "ReviewID": "UR93742521", "Content": "The room is quite good, modern and comfortable, no frills like mini bar or bath tub. There are free shuttle to airport and to Campo de las Naciones every hour which is very nice. The Subway is 2 min walking distance. There are is a restaurant, for some snacks, don't expect gourmet meals. There is nothing around, so if you are traveling to know the city it's too far from the rest. It's a good and cheaper option to come for working in Campo de las Naciones/FIESA/Barajas.", "Date": "January 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Great Experience”", "Author": "Natalieonwabash", "ReviewID": "UR84880232", "Content": "This hotel just fit all of our needs. Very clean, English speakers at desk and very helpful, free and quick shuttle to airport, within 2 blocks to subway access with one transfer to the middle of Madrid, quiet, black out curtains so we could sleep in and nice neighborhood. The bar was hopping but we were too tired. I wish they had some breakfast items in the vending machine.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bucharest, Romania", "Title": "“very good hotel close to the airport”", "Author": "vevita", "ReviewID": "UR84566984", "Content": "We chose this hotel because its proximity to the airport. We stayed here only for one night between the flights. The hotel is also close to the Metro. The room was very clean and comfortable. We left very early in the morning so we didn't have the breakfast. The reception staff was very helpful. There is a free airport shuttle bus that operates 24 hours. The location is excellent for one night sleep between flights (especially if you have an early morning flight) but it's ok also for visiting the city (30 - 40 minutes to the center of Madrid by metro).", "Date": "October 23, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Seville, Spain", "Title": "“Good but there are better”", "Author": "Moises78", "ReviewID": "UR77137803", "Content": "Nothing wrong with the hotel. The staff can be better, they are to passive. I stayed in room 109 with two others but I can garantee you that there was an extra invisible person. Good shuttle service and nice restaurant/bar yet the breakfast could use an makeover and the roomservice menu aswell.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Europe", "Title": "“Excellent airport hotel”", "Author": "OanaB", "ReviewID": "UR74429981", "Content": "extremely clean, new design, new furniture, very helpful reception team", "Date": "August 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“Nice place”", "Author": "PGA2", "ReviewID": "UR71546019", "Content": "Stayed here for one night only waiting on an international flight. I booked it based on the Trip Advisor reviews and the location near the airport. They really are located near the airport too. We later discovered the hotel metro exit is sandwiched between two different airport exits. We arrived Madrid and made our way to the hotel bus area. I called the hotel and the bus was soon there. I think they make regular runs but only once per hour. The hotel was very stylish with a 'W' feel to it. Dark hallways. Bed was comfortable and the room was totally dark with the curtains closed. Nice for late sleepers. Breakfast was on the weak side. Not much to offer. We used the nearby metro station to go to the central city in about 30 minutes. Its an easy walk. I liked this hotel and if you are over-nighting near the airport its a good choice. The front desk staff was very helpful and pleasant.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Handy for the airport”", "Author": "lu_rvs", "ReviewID": "UR70721652", "Content": "I stayed at this hotel because it was close to the airport. It's a modern and clean hotel. The metro is only a few minutes away but they do have a free airport shuttle service on the hour (24 hours). The staff I dealt with were very friendly and i didn't have any issues there. There is a bar downstairs which is good for a drink but I wouldn't rate the food. I didn't get to try the breakfast but it did come with the price of the room. Overall I would recommend the hotel and would stay there again.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Colorado Springs, Colorado", "Title": "“The perfect hotel for Madrid airport transfer.”", "Author": "dcc7", "ReviewID": "UR65582498", "Content": "Very clean, nice facilities extremely close to the airport and to a metro station. Great value! Only complain would be the extra charges for internet and parking.", "Date": "May 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "long island", "Title": "“Pleasantly surprised!”", "Author": "naturewoman", "ReviewID": "UR64270571", "Content": "I really didn't know what to expect as the price we paid was $78 US. The hotel was a little difficult to find (we had a rental car) but I loved the fact they had underground secure parking for an additional fee. It is very close to the airport, the staff at the front desk very helpful, and the hotel itself very clean and comfortable. Not too many food options within walking distance but an ideal place to stay if you need a place close to the airport. I would stay here again and would recommend this hotel to others. This is a quality hotel at a reasonable price.", "Date": "May 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "SF Bay Area", "Title": "“Great hotel!”", "Author": "MGorgoner", "ReviewID": "UR62786346", "Content": "What a great place! The price is very reasonable. Subway station is 5 minutes away, and if you arrive by car, there is a lot of street parking. Free shuttle to the airport. Rooms are large, nice and clean. Free internet. Printer in the lobby if you need to print your boarding pass. This hotel was absolutely perfect.", "Date": "April 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Midwest USA", "Title": "“Convenient to airport, modern, and quiet”", "Author": "SeeAndalucia", "ReviewID": "UR59378689", "Content": "Cool room! Shuttle to airport ran hourly and was on time. We enjoyed the modern decor. We didn't like the modern controls for the shower (flow on left, temperature on right). Required extra time to shower. The room was large and comfortable. We had a triple room, the third bed was a pull-out sofa but comfortable enough for one night.", "Date": "March 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Israel", "Title": "“Comfterable hotel to catch an early flight”", "Author": "niro12", "ReviewID": "UR57023951", "Content": "We stay at TACH with our baby, between flights. after landing we call for shuttle, and it arrive 10 min. later. the hotel was clean, nice stuff and nice hi'tech style room. On the down size there is no food service after 23'30 only snack macine and a microwave.", "Date": "February 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "South East", "Title": "“Clean, modern but a couple of little moans!”", "Author": "globeman235", "ReviewID": "UR55592390", "Content": "Stayed at the hotel for 3 nights during a business trip and overall, it was a nice hotel although there are a few things that could be improved (listed below). On arrival I was surprised at how mordern and contemporary the hotel was. The check-in staff were friendly and spoke good english. Room was very clean with air conditioning (easy to use!) ,mordern earthy colours and wooden floors. Bathroom had large walk-in shower, wc/bidet and there was plenty of towels. And now for the little gripes - - As the hotel is rated 4* it would have been nice to have had some complimentary water in the room and also perhaps a minibar instead of having to trapes down to the main lobby vending machine each time. - The television didn't appear to have any English channels. - Breakfast was very limited i.e. bread/toast, preserves and coisants with tea/coffee. it would have been nice to have had ham/cheeses and perhaps cereals (although I do appreciate that the breakfast was only €6). - Corridoors on each floor were very dark with what seemed like 'mood' lighting. I was looking for the main corridoor light switch for about 30 seconds when I exited the lift but then assumed that it was supposed to be like that. - The restaurant didn't open until 8.30pm and on the evening that we did venture down at about 8.45pm it was still in darkness and we were told that only bar meals were available. We ended up having to go out when all we wanted to do was really just chill after a hard dark. Overall, I would have rated the hotel as 4 instead of 3 had it not been for above gripes. It is well priced but personally, I would rather pay a little bit more and have a few little luxuries such as a minibar and water instead.", "Date": "February 9, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "1.0", "Rooms": "1", "Value": "2", "Location": "3"}, "AuthorLocation": "belgie", "Title": "“Bad service, lousy bed, but modern and clean”", "Author": "Artflolo", "ReviewID": "UR52555778", "Content": "We only stayed one night in the hotel and selected for the 24h shuttle service from the airport. Due to a flight delay we arrived late in the night. When we contacted the hotel we were informed that there was no shuttle service. Including the telephone call in a foreign country and the taxi this means that an extra cost of 20 Euros has to be taking into account. The taxi will not be reimbursed. Furthermore the beds were of lousy quality which made the stay quiet annoying.", "Date": "January 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Tampa, FL, USA", "Title": "“Perfect for an airport hotel”", "Author": "andy705", "ReviewID": "UR47814099", "Content": "We only stayed one night, as we flew in from Paris around midnight and had to leave Madrid around 10:00am the next morning. When we arrived at the Madrid airport we chose to take a taxi rather than try to connect with the shuttle since it was so late and we did not feel like waiting around. I'm glad we did, as I overheard another guest complaining to the front desk associate that the shuttle never showed up to the airport to pick him up, and he waited for an hour. We did book the shuttle to take us to the airport in the morning, and it was great. Very punctual, and free. The room was very spacious and modern. There was a nice flat screen TV, but no English channels. My only complaint about the room was the shower. It does not have a door or curtain, and I was cold because the hot air does not get trapped in. Overall, I would stay again if I needed to be close to the airport.", "Date": "October 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "gmr", "Title": "“Very Good aeroport hotel”", "Author": "ffiffas", "ReviewID": "UR46010430", "Content": "Perfect for travel by plain because is near aeroport and have a free shutlle. Good to visit the city because is near metro that taker 20m to the city centre. Very Good and confortable rooms for the value. Should have breakfast options to early travellers and the bar/snack should be open in the afternoon.", "Date": "October 6, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Santa Monica, CA", "Title": "“Great hotel - if only they were all like this!”", "Author": "SadyeP", "ReviewID": "UR34840659", "Content": "I traveled with my mother and my two children. We had uneven experiences in Spain in general. But the Tach, which we used for the last night of our stay, was our favorite room of all. We rented Room 310, which I highly recommend - it is really large, as is the bathroom. It is all brand new - and nicely designed. The downsides: the restaurant staff isn't so great, and you have to pay for wi-fi. The kids loved this room so much they didn't want to come home. VERY quiet - my number one concern! Shuttle to the airport Terminal 4 took about 5 minutes and comes on the hour. Helpful staff. A few blocks from the Metro, very easy to get into town for dinner with friends. If only it had a swimming pool...", "Date": "July 15, 2009"}], "HotelInfo": {"Name": "Tach Hotel", "HotelURL": "/ShowUserReviews-g187514-d1436963-Reviews-Tach_Hotel-Madrid.html", "Price": "$60 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">C/ Timon, 35</span>, <span class=\"locality\"><span property=\"v:postal-code\">28042</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "1436963", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/7d/ee/7deeeb88db70961b51902b52883dfcfd3large.jpg"}}