{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Essex UK", "Title": "“Excellent hotel”", "Author": "Chalky118", "ReviewID": "UR128371975", "Content": "Extremely central to all the sights and good walking distance of many of the attractions of Barcelona and it's many restuarants which are good value. Tourist buses which are a must to take in all the sights within easy walking distance. Clean, safe, modern, very friendly staff and this hotel is everything the reviews say it is. Thoroughly enjoyed our stay and would definitely go back to the same hotel as Barcelona is a wonderful place to visit and so much to see.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manila", "Title": "“Perfect hotel for a first timer in Barcelona”", "Author": "Leanne J Posted by an Easytobook.com traveler", "ReviewID": "UR128255577", "Content": "I loved Hesperia Ramblas!! The location was very central. It was walking distance to the metro, theatre, shopping streets (paseo de gracia) and restaurants. The room was very clean and the people at the front desk were very helpful. I love breakfast and I like eating healthy food, so I love the breakfast spread! It didn't come with our room but u just had to pay an extra 10euros per breakfast if u booked it during check-in for the entire duration of your stay. They had a very good spread of organic yogurt, fruits, fresh fruit juices, breads, etc. but also had very good pastries and hams", "Date": "April 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Nice hotel in the heart of Ramblas”", "Author": "Dive, Ski, Travel", "ReviewID": "UR128202559", "Content": "Very nice, modern, clean hotel in dynamite location - just around the corner from Ramblas. Rooms are tiny (by American standard), not much bigger than your bed, but this is Europe, so no complaints. \"La Boqueria\" just 300 feet or so away! If you arrive by car - there is a private parking garage on the left, 100 feet down the C/Hospital. Park there before you get to the hotel, otherwise it'll take you half an hour to maneuver through maze of an one-way streets to get back to the garage, and forget about street parking.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Perfect Hotel”", "Author": "TheGirlsNY", "ReviewID": "UR128181528", "Content": "I stayed at this hotel alone for 2 nights before meeting up with friends for a cruise. It was within walking distance to many places. The hotel is less than a block to La Boqueria (in fact you can take a short cut without having to deal with the crowds on Las Ramplas), a block from Las Ramblas and the Metro and just a few blocks from the grocery store and Placa de Catalunya. The bed was comfortable, the tv had many channels and the bathroom was perfect. Nice amenities and great water pressure. There was a dinging room downstairs which was lovely and very clean, but I didn't eat there. As a female traveling alone, I felt safe and comfortable at this hotel. I plan to return next year and will stay here again.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Park City, Utah", "Title": "“An excellent hotel right next to the Ramblas!”", "Author": "B H", "ReviewID": "UR128114769", "Content": "This is a great property in an exceptional tourist area. Just off the Ramblas, but far enough to be quiet. Right by the metro lines, so easy access to anywhere in Barcelona very quickly. Rooms are small, but you don't vacation to Barcelona to stay in a room. The property was very clean and kept up well. Staff was multilingual and VERY friendly and accomodating. Breakfast buffet for 12 Euro was spectacular and well worth the money. Beds were a bit uncomfortable, but everything was clean. Views from the windows on the upper south-facing units were AWESOME! The only negative was the temperature of our room - we like to sleep cold, and with us being on the top floor with 50's at night, the lower level heaters kept our AC from being as effective as it could be. For the price and location, it would be hard to beat what Hesperia Ramblas offers. I would highly reccomend it.", "Date": "April 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Perfecto!”", "Author": "Charlie0959", "ReviewID": "UR128078708", "Content": "It's wonderful to stay in a hotel in the centre of Barcelona, one minute from the Ramblas... And one minute from the famous market Boqueria! This hotel is places in the middle of Ramblas and it' perfecto because it's \"away\" from the noise In the night. When you arrive at the htl, you have to ring the bell, and hen they open the door, so that no stranger do not come in... On saturday night we saw aldo a guard that was staying outside.. Felt in a secure place. We had room no. 301, looking down in calle l' Hospital, and bathroom was big, shower included. The room was confortable and we had enought space. This is a new hotel, from 2010, and the team was at disposal for any question or information that we required. Good cooperation and interest in what we were looking for. A very good three stars hotel, for us the best... Perfecto! Ps. We didn't include breakfast, as going in the ramblas in the morning and having coffee and fresh croissant in he old cafeteria it's much more fun and living the place completely!", "Date": "April 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lexington", "Title": "“Perfect for a one-night Pre-cruise stay!”", "Author": "MPiening", "ReviewID": "UR128030963", "Content": "We stayed at this hotel the night before our cruise set sail. It was our first time in Europe, and this hotel was very centrally located and easy to find. It was within walking distance to many of the sites we wanted to see, (I recommend going to the Market nearby). The hotel was very clean, and had an AIR-CONDITIONING unit that was much appreciated because I was pregnant at the time. The Complimentary breakfast was also nice in the morning. This hotel was perfect for a one night stay and I would definitely recommend it to cruisers, but it might be too small for a lengthy stay.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Penarth, United Kingdom", "Title": "“A good city-centre hotel”", "Author": "MrChrisJ", "ReviewID": "UR127473177", "Content": "This hotel had lots of good points. We arrived early - way before check-in time; but our room was ready, so it was great to be able to have a shower and put luggage away before heading out for the day. The room was good; simple, but well-appointed. The only problems were that the hair dryer did not work, and the heating could be a little noisy (although it didn't wake me up). The bed was comfortable, the bathroom small but clean, and the shower powerful, with plenty of hot water. The room was re-made every day. Although at the back of the hotel, there was no noise from the nearby Boqueria Market. The location meant that an excellent breakfast could be had at the Market - much better in terms of quality and price than that on offer on the Rambla. Also very near to Liceu Metro Station, from where you can get pretty much anywhere in Barca fairly quickly; or you could just walk. The staff were also very helpful; on arrival, we were given a letter with the services which were included (or at least, suggested we may want to ask from the staff) - not only purchasing tickets (a Barca Card was a very good buy), but also booking restaurants, etc. Occasionally a little difficulty with language, but more than made up for by enthusiasm. You need to ring a doorbell to get into the hotel - although I've never had any trouble in Barcelona, it was reassuring to see how careful they were with security. All in all, I'd stay here again.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver", "Title": "“Wonderful location, great desk staff”", "Author": "AMLinVan", "ReviewID": "UR127338338", "Content": "This hotel is located about 100m off the Ramblas and the Liceu metro station. It is within walking distance of the Barri Gotic, the waterfont, Placa Catalunya and even Passeig del Gracia. The hotel desk staff are very friendly and helpful - eg telling you the best metro routes rather than what is in the guidebook. The style of the hotel is modern and minimalist, almost to the point of looking cheap. The rooms are adequate and well appointed. However, the hall to our room on the second floor was covered with carpet tiles that were not well laid and were coming up at the edges. While the room was kept clean, we had an issue with soap, shower gel, clean glasses etc being supplied without asking. Cannot comment on breakfast as we did not have it at the hotel - there were cheap alternative continental breakfasts close by.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Best Location”", "Author": "Afshan7", "ReviewID": "UR126594263", "Content": "We have just spent 4 days in Barcelona - got back last night! The Hotel is based in a great location just off La Ramblas. The hotel is small neat and clean excellent for the price! Modern decor! Check-in was quick and before time too! Staff very friendly and helpful! Wi-Fi is free but you have to pay for internet use downstairs.. Buzzer system for day and night time entry. The toiletries are provided but no shampoo and the body wash in a dispenser. The metro station Liceu is very close to the hotel which is very convenient. Also around the corner is great food market Boqueria - lots of fresh fruit, fruit juices etc. This hotel is ideal for a short break Buy the T10 card which gives you 10 trips on metro, bus and rail – cost 9:25 Euros and a couple can use the same card. From the airport we bought the T10 and used it for renfe train into Passeig De Gracia, then got the green metro line L3 to Liceu – Thanks to a Trip Advisor Reviewer. Negative- No tea/coffee making facilities in the room and the heating system was not working. TV channels in English were BBC News and a documentary channel.", "Date": "March 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Todmorden, United Kingdom", "Title": "“Good location”", "Author": "Joyen", "ReviewID": "UR126532392", "Content": "The hotel is just off La Rambla, about halfway down and good for exploring La Rambla, the gothic quarter and the hoho bus. It was clean and nicely decorated, I was staying alone and had a room at back of the hotel with a king size bed. The room was warm so I slept with the window open, it wasn't really noisy except for one night when I was woken by the sound of someone violently throwing up! Found out a couple of days later that it is in a bit of a dodgy area, don't turn right when you leave the hotel, especially at night. The staff all spoke good English and were helpful when you needed advice. I stayed for 3 nights and had breakfast, which was fine and to be honest at 9 euros, it was better than traipsing the streets in search of breakfast. There was plenty of choice, the usual cold meats, cheese, fruit, bread, etc, and i noticed on the second day there was a hot choice of scrambled eggs and bacon. Excellent coffee! On the whole I would give it 3 and a half stars, it was clean and comfortable, fine if you need somewhere in a good location to rest your head. Tea/coffee making facilities would massively improve it though!", "Date": "March 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Not special and a bit pokey”", "Author": "fatmacsgrillshack", "ReviewID": "UR126361260", "Content": "It's your basic hotel, not many facilities, staff were very shabby and generally unhelpful. The room seemed clean but on closer inspection wasn't fantastic - we even got flea bites on the last night. Close to the market and quiet which is great as you're on top of the Ramblas. All in all didn't live up to previous reviews. Next time won't be here.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Birmingham", "Title": "“Hidden gem. Excellent location”", "Author": "mini1978", "ReviewID": "UR125600184", "Content": "We booked to atay here for 3ngts. Check in was quick, staff are very friendly & helpful. I needed some hot water as i was not feeling to well & reception staff kindly helped to get me some from their meeting room. The location is perfect, its about 100 yards off La Ramblas where the metro station Liceu is. We were able to walk everywhere from here. This is not our first visit to Barcelona so we were happy to walk around and even strolled to Sagrada Familia, port olympic & manjuic fountains. The room is a tad on the compact side but its OK but the bathroom is spacious, its very clean & tidy. I would definately stay here again!!", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wassenaar, The Netherlands", "Title": "“Super Location!”", "Author": "Reisgenote", "ReviewID": "UR125266774", "Content": "Upon our arrival at 10 o'clock in the morning our room was ready! This was really a pleasant surprise! Indeed it was a good Tripadvisor suggestion to ask for a room on a high floor, because of the deliveries to the nearby market early in the mornings. We got a room on the fifth floor which was excellent.The breakfast is really abundant.The free wifi is also a plus of this hotel. It makes you wonder why other hotels charge you for it! The location a few steps away from the Rambla is very handy. Nearby Carrer de l'Hospital (where the hotel is located) on the Rambla, you can have a good cappuccino or a fresh orange juice in Cafe de l'Opera, a very nice cafe with a really spanish atmosphere. Within a few minutes you are on Plaza Catalunya with many nice shops. I can really recommend this hotel. It's just what you need for a city trip.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "milano", "Title": "“Excellent hotel”", "Author": "didina75", "ReviewID": "UR125227636", "Content": "I have just returned from a long weekend in Barcelona with my boyfriend, and our little boy (6 months) we absolutely loved this hotel. It was very clean, modern, quiet and in an excellent location you can go everywhere on foot.The rooms are very clean and the design is very good. The staff were very friendly and helpful. I could use 2 a day the microwave to prepare the food for my baby and this has been fondamental for us! This is a good four stars hotel.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Hidden Gem!”", "Author": "missrichens", "ReviewID": "UR124818522", "Content": "I have just returned from a long weekend in Barcelona with my boyfriend, and we absolutely loved this hotel! It was very clean, modern, quiet and in an excellent location! The rooms are not that small, but we did not spend much time in the room anyway! Close to the port, with it being a ten minute stroll away, close to Placa de Catalunya, also about a ten minute stroll away. If coming from the airport, get the Aerobus, it drops you off at Placa de Catalunya for 5.30 each & only takes about 20-30 minutes. You can then walk down Las Ramblas or get the metro, but it is only about 10 minutes from the square to the hotel. We were able to check in at about midday, which was very handy! The man who checked us in was very abrupt, but the staff in general are very helpful. You have to buzz to get into the hotel, which makes you feel very safe, and the staff always say hello. If you are thinking of going to sights like Sagrada Familia, Camp Nou, Park Guell etc have a look at the bus tour. You can get on and off at these sights, and if booked through the hotel you get a nice little discount book that was very helpful to us, with discounts on Sagrada Familia, Camp Nou, the zoo, the aquarium, places to eat etc. We had a room overlooking the passage way to the market, and with the window open there was a bit of noise, with the window closed, couldn't hear a thing! There are people's apartments the other side of the walkway, but - net curtains! The road the hotel is on is a little bit iffy at night, but no more than anywhere else. We had no problems, and the hotel is not that far down that it was a problem. Overall...would definately recommend as the proximity to everything is great, and the rooms themselves are lovely! Our room was exactly as the pictures showed, and was very clean too!", "Date": "February 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ripon, United Kingdom", "Title": "“Great location”", "Author": "treacle1234", "ReviewID": "UR124403406", "Content": "Our stay in this hotel was lovely, very small but clean room, clean bathroom with a small selection of toiletries, wi-fi was slow, no coffee making facilities but you are 30 seconds round the corner from the market. Right on the main street for restaurants and bars. We wanted to travel by public transport from the airport so emailed the hotel to ask which train/metro combination we should use, but no reply to 2 emails which was a let down (Get a T10 card and get the renfe train into Passeig De Gracia, then get the green metro line L3 to Liceu). The hotel is just down the side street right opposite the meto station. Be warned, if you come out of the hotel and turn right, it doesn't feel too safe at night! The hotel is right on the Rambla and a 10 minute walk down to the port, it's a good half an hours walk round to the main beach though. Definately take a map as it's easy to get lost down the side streets and invest in a T10 card. We bought ours at the airport, they are 7 (ish) Euro's and you can use them for 10 journeys on metro/bus/renfe train to and from the airport. You can just buy one to share and use the 10 journeys up between you, so travelling from the airport you would use 4 journeys for a couple (2 on the train, 2 on the metro). Simples!", "Date": "February 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“Excellent hotel!”", "Author": "ann_2708", "ReviewID": "UR123959377", "Content": "The hotel was great, there was nothing I did not like about this hotel! The location is perfect! Just off busy La Rambla, around the corner from a great food market, close to many many shops and just a walk away from the beach. The staff were very friendly and helpful. At the time of arrival the Spanish receptionist was speaking French with the customers and then with us he started speaking very good English. The rooms were nice and clean. I would not say they were small, maybe their size varies. The only thing is that we had a corner room and the wifi connection was poor, but we could get it sometimes. Some reviews said that the location is not safe. But it is not the location of the hotel, it is Barcelona. I heard that you need to be very careful everywhere so we were and thankfully everything was fine. Just don't leave your things unattended and don't start opening your wallet in the middle of the street.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Clean and Close to the Market”", "Author": "Logan T", "ReviewID": "UR123835209", "Content": "I stayed here with my parents for 4 nights - it was very clean & the staff was super nice. But it was kinda one of those hotels where everything was a little bit broken or off. Examples: -The bed looked super clean and comfortable but was rock hard with cheap thin pillows. -The toilet flusher thing on the wall looked really cool and modern, but mine was broken and fell off the wall. hahaa! -The WiFi internet works for like 20minutes or something and then you have to log back in with the code. Which stopped working for my iPhone by the second day. super annoying. -They give you an umbrella if it is raining - but you need to leave a $10 deposit. But it is located in a great place. I didn't feel like it was scary or like I would get robbed - like some of the other reviews said. But I live in NYC and am aware of stuff like that. The Market is right in the alley & you are right near the Metro. I liked the hotel cause it was clean and in a good area. My parents didn't love that there was no comfortable lobby to read & drink coffee in. Good hotel, a great choice for the money.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Location & Value”", "Author": "atllocal", "ReviewID": "UR123262140", "Content": "Booked 5 nights here and recently returned... For the money you cannot top this place. The rooms are commodious (again, for the money) and included a mini fridge. The only faults I would cite are that the room was hot and we couldn't open the window b/c of the street noise (which is 100% blocked out when the windows are closed) and the matresses a bit on the hard side. The staff was friendly and I felt very secure as they had a guard on duty after 11 pm in addition to the front desk buzzing you in, etc. I never ever felt that security was an issue. The location, as others have cited, is ideal and right around the corner from the Boqueria which made access to quality, inexpensive snacks (fruits and the like) easy. The metro system in BCN is also very modern and efficient and puts NY's to shame (which most do... sadly). I would recommend this hotel to anyone who is looking for an economical hotel without sacrificing on space, cleanliness, and location.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Convenient central location yet unsafe”", "Author": "Jojo M", "ReviewID": "UR122368540", "Content": "We just returned from a two night stay during the year-end holiday. The location is very convenient next to the old quarter and the nightly \"action\" on the Ramblas avenue. The action here unfortunately has double meaning: the first night as I was returning to the hotel two North African men tried to mug me right at the entrance to the hotel. I managed to escape inside and asked the hotel personnel to alert the police which they did. Nobody seemed to care much, however, and the hotel staff actually seemed used to these thugs hovering around the hotel prying for victims. Aside of this, the room we got was thoroughly dirty with what seemed like dust from construction. The staff was only able to clean it the next day. Given the high price and all this trouble and risk, next time we will go to a different hotel in this wonderful city.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great location, lovely rooms, ideal base at great price”", "Author": "Leeandlaura1", "ReviewID": "UR121881851", "Content": "Just got home from a 3 night stay here. Our room had a great ambiance, the hotel was perfectly positioned and it was a great base for exploring the city. Pretty much everything was in walking distance from the hotel and the staff were very helpful on the front desk. The maids came every day and replenished towels, bedding and toiletries. The hotel check out time is 12pm , we ran slightly late but reception only called at 12.30pm to remind us which was nice. no complaints about this hotel, we loved it and it looks exactly as it does on the pictures!", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fort Lee, New Jersey", "Title": "“Great Hotel, Great Location!”", "Author": "amelen", "ReviewID": "UR121460537", "Content": "Great hotel, located right off the center of the Ramblas. It's just one block from the subway line and right in the center of the Ramblas. The hotel was very clean and very secure. There was a camera security check before you could even open the door to get into the hotel. The rooms were very clean, included a mini-fridge and had an excellent a/c and heating system. The only downside was that the rooms were on the smaller side - which is typical in this area.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Northampton, United Kingdom", "Title": "“Excellent location, no complaints”", "Author": "nicci5", "ReviewID": "UR121319050", "Content": "We have just returned from a 2 night trip to Barcelona and I have to say I can not fault this hotel. The location is central to Las Ramblas, and right next door to the market where we ate breakfast both mornings. The rooms are an adequate size for a 2 night stay, and everywhere is spotlessly clean. Overall I would thoroughly recommend this hotel!", "Date": "December 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newton Aycliffe, United Kingdom", "Title": "“Modern hotel in great location”", "Author": "AdelheidSutty", "ReviewID": "UR121092616", "Content": "This modern hotel is just off La Rambla. It was bright and clean and ideal for a short break. The rooms were warm and the air con made all the right noises but didn't cool the room. It may have been a problem in high season!", "Date": "November 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Great location”", "Author": "jouluhauki", "ReviewID": "UR121003012", "Content": "Spent three night at Hesperia Ramblas. The room was rather small, but one usually doesn't go to Barcelona to stay in the hotel room. Location of the hotel is excellent, on a side street of Ramblas, no more than 100 meters from the metro station of Liceu.The staff speaks very good English, and they're also happy to speak castellano, which always isn't the case in Barcelona :)", "Date": "November 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "N.Ireland", "Title": "“Fine off peak, not so sure about high season”", "Author": "N_IrelandFranco", "ReviewID": "UR120952468", "Content": "Convenient location just off the Ramblas. Room was modern, clean and compact but contained everything we needed, eg safe and mini fridge. The shower room was quite big but the shower temperature difficult to control. We had to keep the window open at night as it was still quite warm. Would dread to think what the heat in the room would be like in summer. We were just about able to suffer it in November. Didn't get bothered too much by street noise. If you just want somewhere to sleep this hotel is fine.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Aachen, Germany", "Title": "“Great location and value”", "Author": "geegas", "ReviewID": "UR120951597", "Content": "If you want to be in the centre of the action but also enjoy a quiet night's rest then look no further. The hotel offers also an excellent breakfast with a great selection of fresh juices and organic yoghurts. Apart from las Ramblas being 1 minute away on foot you are connected to the fresh produce and fish market via a side street so you can go and enjoy the excellent tapas and seafood by walking maybe 100 metres. Free wi-fi too ...", "Date": "November 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Limassol", "Title": "“Ideal for short visit”", "Author": "jinxmix", "ReviewID": "UR120798669", "Content": "A neat and minimally decorated hotel. Seems recently renovated. Rooms quite compact but adequate for a short (2-3 nights) stay. Super location (just off La Ramblas and near Liceu Metro station). Has free wi-fi (albeit extremely slow!)", "Date": "November 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Good location, hazardous bath”", "Author": "Michael G", "ReviewID": "UR120628910", "Content": "Although the near-Ramblas and food market location is great, there were serious issues. The shower is on the same level as the rest of the tiled bathroom and is dangerously slippery when used. My wife fell and banged her head. I would not return or recommend it on this count alone. There were no draws of stands for the luggage. The bathroom supplied no facial tissues and one inch square bars of soap, and the wall light in the bedroom could not be turned on. It is over-the top modern design, The rooms had no view, which was not a problem, since we were only there after dark. The free internet was a good feature. The staff tried to be accommodating and could speak English well. You needed to push a buzzer to enter, The bed was comfortable. The issue of pickpockets on the city cannot be over-stated.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Doha, Qatar", "Title": "“Blink and you might miss this find!”", "Author": "stooksk", "ReviewID": "UR120581170", "Content": "Blink and you might miss this find off of Hospital near Ramblas. We arrived in Barcelona via the airport shuttle to Placa Catalunya and had a quick 10-15 min. walk down Las Ramblas to the hotel. It’s quite easy to find – at the Liceau Metro station turn right and the hotel is on your right before the first street. The hotel buzzes you through the front door. The location was IDEAL – so close to Ramblas and La Bouqueria Market. We had breakfast every morning in the market and also had lunch there (Kiosko Universal) that we’d recommend. The location was also great for walking to most of Barcelona’s sights. We rarely took the Metro! As far as the hotel, we had room 407. I will echo previous comments that the hallway rug tiles were filthy, but as I was not walking barefoot on them it was only really an eyesore. The room was similar to NH rooms we’ve stayed in – faux wood floors, contemporary furnishings. We had two twins pushed together. The tv only had one English channel – BBC News. There was a mini-bar, closet and desk. The mini-bar had enough room for our own drinks to chill. The room and bathroom were large by Euro standards. The bathroom had no towel rack for hand towels or tissues – just minor oversights on their part? We enjoyed the free wifi. We saw the breakfast room every morning but we weren’t sure if it was included/free so we never attempted it. If it is free, they need to do a better job of letting guests know either at check-in, in the room or with signage. All in all, the location can’t be beat and we enjoyed our stay.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Big hotel chain--tiny property”", "Author": "EliasJ", "ReviewID": "UR120380592", "Content": "I have traveled into Barcelona at least 14 times during the last 8 years, it is one of my favorite port destinations and a diverse and fun city to visit. The name Hesperia was familiar to me from my previous stay at the Hesperia Hotel in Madrid a few years ago and it brought back memories of a wonderful high end hotel while in the capital city of Spain. Trusting the name which since has merged with NH hotels of Spain (also a very respectable hotelier chain) I prepaid and reserved 3 nights at this location. The place is not bad but one needs to go into it with realistic expectations. The front is managed by one person, during my arrival this one person was also the front office and reservations manager, quite pleasant indeed but totally overwhelmed with the arrival of numerous passengers from the early morning flights and of course, all the rooms were occupied the night before hence one had to wait a couple of hours to get into the room, this is not unusual with international travel into Europe. The location is perfect if you want to see action and Las Ramblas, the hotel is 150 feet from Las Ramblas on a very safe side street adjacent to a wonderful open food market (La Boqueria). As an added safety feature Hesperia Las Ramblas has a security guard at night and the main door is always locked and controlled by the reception via a remote--- similar to an automatic garage door opener. Upon arriving, Mr. Bosch kindly placed all our luggage in a secured locked area, which gave us the opportunity to wonder into La Boqueria for a cup of coffee. The rooms at this Hesperia are tiny. My king size bed more like a queen could have used a better mattress but it was bug free, the floors are synthetic wood as opposed to carpet which gives you the feeling of being less bacteria impacted. The bathroom albeit small was modern and clean. The room had the most minimal amount of everything, one chair with arms, not practical to put your suitcase, but we were not looking for a fancy room, just a clean and safe to sleep and we got it. As stated, by prepaying the reservation we saved some money although under this program its not refundable, the breakfast offered for additional Euros its not worth it, you can do much better at La Boqueria. The street is narrow and a taxi cannot park next to the hotel for a prolonged period of time so loading and unloading baggage requires some gymnastics and logistics but its not usually a major issue. A big plus at this hotel is the free wireless internet throughout the entire complex, in Europe this is worth around 10-15 euros per day depending on the hotel, rarely gratis. Would I stay there again?---definitely, good value, clean and safe rooms, excellent staff. If you need a \"bellman\" to help you with your luggage in and out this place is not for you, remember one front desk person does it all--answers phone, stores your luggage while your room is becoming available, opens the main door and answers to the numerous questions of arriving and or departing guests, at first sight it looks crazy but they are pro's at this.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Saint John, Canada", "Title": "“Clean and Great Location!”", "Author": "Kevin B", "ReviewID": "UR120049787", "Content": "We thought we had reservations at another Hesperia hotel in Barcelona only to find out they didn't have our reservation and that hotel was booked. (Could have been hotel's fault or the travel agency, don't know) But the staff at the hotel was very helpful and got a room for us at Hesperia Ramblas and paid for our cab to the new hotel. The hotel's location is great, close to the Boqueria Market, las Ramblas, the Barri Gotic and the subway stop. Our room was very clean and modern. Staff was very helpful. Didn't eat breakfast at the hotel for no other reason than the Boqueria Market is only minutes away. . Overall, very pleased with this hotel and would definitely recommend it.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Smack bang in the centre”", "Author": "smartinez48", "ReviewID": "UR120045136", "Content": "This hotel was fantastic for a short city break as it was right in the heart of the city centre, a couple of minutes from the lively and colourful Bocqueria food market behind the hotel from the little alley way. The hotel decor is very modern, it was very clean and the service great. The people on the front desk were helpful and indicated us a very good Catalan Tapas restaurant just minutes away from the hotel. I loved the modern decor. The room wasn't very big but great for 2-3 nights. It had a walk in shower en suite and considering how central the hotel was, it was very calm at night. Air conditioning system could be a bit noisy but at least it was cool. We didn't have breakfast in the hotel as it was a bit overpriced 10-12 euros whereas you can eat fantastic food in the bocqueria market, drink fresh juices or enjoy delicious tapas. I would definitely recommend it, it is in the middle on the city centre midway through Las Ramblas.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cumbria", "Title": "“Excellent location and friendly helpful staff”", "Author": "JaneCumbria", "ReviewID": "UR119980819", "Content": "Stayed at this hotel 3 weeks ago on 10 0ctober 2011 for a one night pre-cruise stay. Excellent location just off las Ramblas. Reception staff very helpful and security conscious. Room very clean and modern although a little on the small size particulary for a pre-cruise stay with luggage for a two week holiday as there is little space for storage. For a short break this hotel is excellent and we would stay again", "Date": "October 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Manila, Philippines", "Title": "“Good location but...”", "Author": "slao", "ReviewID": "UR119886834", "Content": "Good location on a side street from las Ramblas. There's a back alley that goes directly to the back of La Boqueria market. 10 minutes walk to Catalunya Square for the hop on/off bus. Clean room on the small side. Lost our 20 euro luggage lock in the room. No aircon in the lobby.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Good hotel”", "Author": "aPod1", "ReviewID": "UR119782882", "Content": "Stayed here recently for 3 nights. The hotel is situated on a street just off La Ramblas (about half way down) making it very convenient to get around. There is a metro station around the corner which connects to the airport, via 1 change. With the hotel's position we were able to walk nearly everywhere. The famous La Bouqueria market is pretty much next door too. The room was clean and functional. The only disappointment was that we found the bed very hard and so woke up with sore joints. I would recommend them introducing a better selection of TV channels but its not really a complaint. Breakfast was 12 Euro's, or 10 if booked in advanvce. Decent enough. Overall a good trip and would be happy to stay there again.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "UNited kingdom", "Title": "“location,location,location.”", "Author": "sparky0", "ReviewID": "UR119659648", "Content": "This hotel is a very modern and somewhat sterile hotel,its almost akin to walking into an Ikea showroom.The rooms are small but spotlessly clean with a good shower facility,the bed was comfortable and the aircon was fine.There is no coffee/tea making facility but there is complimentary tea/coffee in the lobby.The breakfast is adequate with a decent selection to meet most tastes.What makes this hotel is its location which in all honesty cant be beaten.It is 100 yards or so off the ramblas and 5 minutes walk to Plaza Catalunya,right in the centre of things.This hotel is ideal for a short break but you may wish to consider somewhere else for a longer stay if you prefer a few more facilities.If coming here dont bother with a taxi from the airport,look for the light blue bus shuttle marked Plaza Catalunya,its 5 euro,use it coming back also.If you use the metro get off at Licieu,the hotel is a 2 minute walk down C/Hospital which is off the Ramlas next to the Bouqueria market.Feel free to email me if you wish.Good Luck.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Minneapolis, MN", "Title": "“Good location”", "Author": "Kathybax", "ReviewID": "UR119350626", "Content": "We stayed here from September 13-16. The location, near Las Ramblas, is very good, but we were less than thrilled with the tiny room and the bathroom with a glass door. If you went into the bathroom at night, it was like shining a spotlight on the bed. I travel a great deal for business in the USA, and the first sight of the room was seriously depressing. The staff was pleasant and helpful, however, and the rate was within the realms of reason. But I would not stay here again.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "singapore", "Title": "“Unbeatable Location”", "Author": "superbova", "ReviewID": "UR119347796", "Content": "Barcelona is a wonderful city and La Rambla is where it all happens. The Hesperia Ramblas is right in the heart of the action but off the main artery just enough for some peace and quiet. The greatest thing is that it is right next to the colourful La Bouqueria - a marketplace of raw and cooked food. Go there for cheap eats and to soak in the atmosphere. The rooms are decent with comfortable bed and a good sized toilet. This is no five-star establishment but a real value for money, no-frill alternative. The staff are helpful and friendly. The metro is just a stone's throw from the hotel. I will stay there again, without a doubt!", "Date": "October 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bratislava", "Title": "“the best location for the Opera and La Rambla”", "Author": "RolandToth", "ReviewID": "UR119298035", "Content": "I was happy to find this hotel after two hours on the tripadvisor. For 129 EUR - i booked the hotel 1 day before arrival, the hotel was a good choice. (plus 10 EUR for OK breakfast) Reception: OK, everything well done. Room: i had a room Nr. 106 with very nice street and little park view. Very clean, with nice shower bathroom, OK bed. laminate flooring, what i liked.I paid for the taxi from airport 22 EUR, from the hotel to Barceloneta beach only 8 EUR. Only one negative thing: the WIFI connection, which was offered gratis not worked. For 15min Internet i paid 3 EUR.", "Date": "October 14, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "NJ", "Title": "“Major security issues - 2 thefts in 10 minutes”", "Author": "Larry P", "ReviewID": "UR119188449", "Content": "My family and I took a cruise and spent one day in Barcelona before our return flight to the US. After leaving the ship, we took a taxi and arrived at Hesperia Ramblas at about 10:00 AM. We unloaded all of our luggage from the taxi, and rang the buzzer to be let into the hotel. We were buzzed into the hotel, and I began to check in while my wife, mother-in-law, 4 kids and all our luggage were within about 15 feet of me in the lobby. All of the sudden, my 7 year old says \"that man took the black and white bag\". Someone in the lobby had stolen my wife's purse (which was on top of one of the suitcases), and ran out the door. I ran to the door and looked outside for a few minutes, but could not find the thief. I returned to the lobby and began complaining about the security, when my 13 year old daughter screamed out that someone was stealing my mother-in-laws purse! This was about 10 minutes after the first theft. We were able to catch this thief and recover this purse, but my children were really upset by what had happened (can't blame them), and our day in Barcelona was pretty stressful for them. When I spoke (complained) to the person at the desk, he pointed to a sign which said \"watch your possessions at all times\". I understand the need to be vigilant, but once you are in a locked hotel lobby that requires a button to be pushed for entry, you expect to be able to relax a bit. Major security issues aside, the hotel and the rooms were reasonably nice and the location was good. But if I have to worry about the safety of my family insider the hotel, everything else is unimportant. There is no security at this hotel, and we are lucky that all we lost were a few possessions and that no one was hurt.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ireland", "Title": "“holiday stay”", "Author": "IrelandTraveler1", "ReviewID": "UR119008696", "Content": "Having traveled from Ireland and arriving late at check in we found the reception staff very friendly and helpful. The hotel was of very high standard and spotlessly clean. The rooms were serviced every day .Cleanliness and friendlyness is the gospel of this hotel. If your in need of good information for a good restraunt always ask at the reception we got great advice", "Date": "October 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great location, clean, modern hotel”", "Author": "rkatao", "ReviewID": "UR118538007", "Content": "We stayed at the hotel for 3 nights prior to a cruise from Barcelona. The room was barely bigger than the cabin on our ship but totally functional. The hotel is half a block off Ramblas about at the mid point of the street. The Boqueria Mercat is also very close. Breakfast was excellent. High quality meats, cheeses, fruit and pastries. The available items did not change much but there were always a few different things. It was very hot and humid when we were in Barcelona. The lobby was a cool relief from sight seeing. Knowledge of attractions or even the tours that could be booked at the front desk was totally dependent upon who was on duty. Some were very helpful, others not so much.", "Date": "September 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excelent hotel”", "Author": "Bogdan73", "ReviewID": "UR118170736", "Content": "Beautiful room, very good breakfast, excelent location", "Date": "September 15, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "UK", "Title": "“Great Location-average butvery clean hotel”", "Author": "leuca", "ReviewID": "UR118099092", "Content": "I agree with other comments on here regarding security and cleanliness- a great place to stay and if I was coming back to Barcelona I would definitely consider this hotel again. the rooms are very basic but very clean. The minibar is nicely priced at a couple of euros/drink-water or beer . i would have liked tea/coffee making facilities in the room,ecause the Hotel is so well located it is easy to pop back during the day for a rest and a cool off and a shower before going back out again so the ability to have a cuppa in your room would have been a boon-but that is a minor niggle.Aircon keeps the room cool during the dayas it was 30 degrees but we turned it off at night as it was on the noisy side but room stayed cool enough to sleep well, room quiet too no noise from Ramblas which could be a problem for those staying in hotels located directly on the main street. We asked for a quiet room and were given one on the fifth floor-very quiet but did not have such a great view! but we didn't come to Barcelona to look out of my hotel room window so no problem for us. if you want a clean comfortable hotel with a good location then this will suit you fine.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cairo", "Title": "“Would definitely come back”", "Author": "MeshmeshCairo", "ReviewID": "UR117935272", "Content": "Very clean and central hotel. very nice and friendly stuff, the receptionist recommended us a restaurant to eat tapas which was great, and gave us a free drink. Booked a double room + 1 child free of charge and were very kind to give us an extra bed with no charge. would definitly come back.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“A great place in the hustle & bustle of the city”", "Author": "My_suitcase_and_I", "ReviewID": "UR117376871", "Content": "The address in our confirmation stated the wrong number on the street (27 instead of 26), however, upon arrival, we were pleased to see a modern, clean hotel. We checked-in ahead of the check-in time, but they were able to find us a room right away on the 4th floor. The room was a good size, with 2 twin beds pushed together to make a king. The washroom was modern and clean. Storage safe available for use in the room. The air conditioning was fabulous, since some hotels in Europe don't have it. We did not have continental breakfast buffet at the hotel (additional charge). It is located mere steps away from the Liceu metro stop on Las Ramlas - very convenient. In the early evening, the noise from the street could be heard in our 4th floor room. By midnight however, the noise subsided. Upon checking out, the front desk called a taxi for us, which arrived within minutes. We were quite pleased with the hotel and would stay there again.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great location, clean hotel, felt safe”", "Author": "SABRI_LT80", "ReviewID": "UR116865943", "Content": "We recently stayed at the Hesperia Ramblas and selected the hotel due to it's location and comments on Trip Advisor. It was walking distance to everything! The rooms were nicely decorated and very clean. The beds were comfortable. The front desk staff were helpful in answering our questions. We really felt safe with the intercom system. We felt relatively safe exploring the streets at night as a group in such a high tourist area. There are many great places to eat on Las Ramblas. The Gothic area nearby had really great places as well and were filled more with locals. However as tourists visiting the Gothic area after dark, we were warned by some locals to hide our belongings. Overall we had a pleasurable experience staying in this hotel and visiting the area and the sites.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5"}, "AuthorLocation": "Turku, Finland", "Title": "“nice and budged hotel close to las ramblas”", "Author": "lomalainen007", "ReviewID": "UR116472762", "Content": "We found this hotel thru internet. We stayed 4 nights. The location was perfect, close to placa de catalunya and just a block away from las ramblas which is the heart of bcn. So friendly stuff, clean and spacious' rooms, nice bathrooms. In other words everyhing you need from the hotel for a city-break.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Denver, CO", "Title": "“Great price, wonderful staff, nice room”", "Author": "willi348", "ReviewID": "UR116269493", "Content": "The price for this hotel given it's location right off of the Ramblas cannot be beat. The room was nice although a bit small. That seems to be standard for Europe, though. The staff here were fabulous! Everyone went out of their way to be helpful right down to the staff in the breakfast room who were so kind as to even advise my husband about tea bags for my eyes (I had an allergic reaction that had nothing to do with the hotel). The rooms were updated and modern and the beds were comfortable. I loved the recently renovated bathroom, too. We wouldn't hesitate to stay here again.", "Date": "August 4, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Monterrey, Mexico", "Title": "“Excelent location and very spacious rooms”", "Author": "aguerramx", "ReviewID": "UR116269228", "Content": "We stayed a couple of nights. The location is excellent, a block from the Ramblas Street. Rooms are large and compfortable. Breakfast was very good. Very convenient to enjoy your time in Barcelona", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Southern England", "Title": "“Clean, tidy, if rather bland”", "Author": "Mark_and_Nicky", "ReviewID": "UR115983289", "Content": "We stayed here for three nights in May for a city break. The room was fine, modern, some might say bland, but that didn't worry us. The shower was difficult to regulate the temperature of, we'd just about perfected it by the time we left ! Front desk staff were friendly and efficient. We didn't have breakfast there, it felt too much like a business hotel, with its basement area. Just 100 metres off The Ramblas, so we opted to have breakfast in street cafés in the area. Don't turn right out of the hotel, you rapidly end up in a dodgy district ! Hotel offers discounts for 'travel cards' for the bus and tube services. No stunning view from our room window, or we don't think from any window, the place is hemmed in amongst other buildings, our room looked straight into a bicycle repair/rental shop 5 metres away. Despite all of that it was resonably quiet at night (we were there Fri-Sun). Recommended, as a solid base to explore the city from.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent hotel, perfect location.”", "Author": "ClaytonO", "ReviewID": "UR115777585", "Content": "Would definitely recommend this hotel. It was spotless throughout and the staff were helpfull. The best part was the location. Although the El Raval area does not have the best reputation, the hotel is only one minutes walk to La Rambla, so it's far enough away to be quiet yet close enough to feel comfortable. It is within walking distance to most of the sights, and for those further out attractions, the subway is right at La Rambla. Th best part is the La Boqueria market is right behind the hotel up the side street, which was perfect for our quick breakfast indulgence.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Highly Recommendable”", "Author": "Acrosstheuniverse66", "ReviewID": "UR115758496", "Content": "This hotel is exactly as you see it on their website, spotlessly clean, excellent location beside ramblas, shops, metro station, very close to open top bus stop, friendly staff but not annoying. Air Conditioned. Top quality continental breakfast. Mini bar very reasonably priced. I would definitely recommend this hotel and would definitely stay here again.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "nj", "Title": "“Modern hotel in a great location”", "Author": "ssgtravel", "ReviewID": "UR115486683", "Content": "Having done a great deal of research on hotels in Barcelon, we chose the Herperia Ramblas which turned out to be a great value for the clean room, and as others have said, the location is terrific. In addition to being near the famous market, along the Las Ramblas, the hotel is also very close to a subway station, and not far from the Gothic area of Barcelona. We arrived very early from a cruise and they held our luggage in a secure, locked location. I felt the breakfast was too expensive, so we went to a small bakery just up the street which has great juice, coffee and pastries. We were able to easily use the clean, well-marked subways to get to some far-flung locations; but most of what we wanted to see was within walking distance. Barcelona is a beautiful city and has wonderful places to walk. We enjoyed our too-brief stay there.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Dorset", "Title": "“Great location”", "Author": "Sotongirl49", "ReviewID": "UR115234984", "Content": "Modern hotel situated c.500 yds down Las Ramblas, just past the Boqueria market. Ideal situation midway between Placa Catalunya (the main square where the Aerobus airport bus stops) and Port Vell, the Marina. Rooms are of modern contemporary style (reasonable size, if a little light on storage space) and are kept clean. Bathroom modern, although watch out for gaps in the large shower cubicle panels which can result in a wet floor! Reception staff helpful & spoke good English. Breakfast buffet can be included but pricey – better to go room only and use one of the many coffee shops/cafes etc within walking distance. Tips: Bocqeria Market – 100 yds max – do visit. A huge display of fresh fruit, veg, seafood, meat etc etc – wonderful mix of colours and smells. Escriba – (just before the market) – great for coffee, pastries & luxury patisserie. Places to eat – spoilt for choice – Placa Reial (200 yds) has many and the squares and streets of Barri Gothic (opposite side of Las Ramblas) provide huge choice. We liked Santos Tapas in Placa del Pi. Las Ramblas – great for a relaxed drink and watching the world go by. Do be vigilant however re pick pockets etc. El Raval – an interesting part of the old town (exit right from hotel) – but notorious for petty crime, so best avoided in the evening or if travelling solo. Sagrada Familia cathedral – can be walked to but c.2 miles (or Metro) – advance ticket purchase is worthwhile to avoid the long queues and an early morning visit (between 9-10) if you wish to use one of the lifts for the cathedral towers (walk down) as lifts are small and queues can be long! Nou Camp – FC Barcelona – take Metro Line 3 Liceu (entrance on Las Ramblas close to side road for hotel) towards Zona Universitaria and leave at Palau Reial (then walk down hill) – Ticket machines are touch screen with an English Language option.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Location, Location, Location at Excellent Value”", "Author": "RoadTravelled", "ReviewID": "UR115186520", "Content": "As they say in real estate, location is everything. And, in the case of this hotel it is most relevant. It is a very short walking distance to the bustling La Rambla with it's sidewalk cafes, shops, restaurants, street vendors, kiosks, and people watching galore and in addition the famous Boqueria Market just a block behind the hotel. It's also just a short walk to the Liceu Metro station (Blue Line), the Gothic Quarter filled with Old World charm including the Cathedral (not the Gaudi one), the Opera House (Gran Teatre Del Liceu) and the Placa Reial (vast square with more restaurants, shops, cafes, fountains, people watching, clubs, outdoor concerts, and even 2 giant lanterns by Gaudi). The hotel is a small, boutique type hotel situated on a very quiet side street (L'Hospital). Look carefully as you come down the street from La Rambla for the entrance on the right as it is a bit hidden due to it's front doors being offset from the street. You will need to buzz the speaker on the wall to the right to gain entrance (you must do this each time you enter even after check-in providing a nice sense of security). The reception area is spacious, modern and clean with very attentive and friendly staff who quickly checked us in and answered all of our questions with well informed answers throughout our stay. We stayed here after a 12-day cruise and so arrived early in the morning around 9:30 am. We fully anticipated having to just store our bags and then head out to the city but were informed our room was ready and they would be more than happy to let us go ahead and fully check-in. A very nice touch! The room was very modern and immaculately clean with a great bathroom, comfy beds, flat-panel TV, and large windows that opened to provide air and views to the street level. There was also a very large closet/wardrobe unit that included a safe for your valuables. The room felt spacious it seemed to me, especially for European standards. We were on the front of the hotel but despite that didn't experience any problems with noise. The windows are very thick and sound-proof and as mentioned the street is far enough away from La Rambla as to not be much of a problem. The bathroom could have used more counter space but otherwise it served very well. The door is clear and so adds a more airy feel to the rooms. The room rate is very reasonable and provides excellent value for your money. We booked it directly through the hotel's website as part of the Hesperia hotel chain. There is an additional 10 euro charge for the breakfast downstairs which we opted-out of as there are just too many places nearby to eat otherwise. The taxi from the cruise port was about 10 euro + surcharge for baggage and the tip and takes about 10 minutes or less depending on traffic. The taxi to the airport was about 30 euro + surcharges and tip and took about 20 minutes or so. We left early in the morning so the traffic was not a problem. But, I understand that at other times, that can be an issue. There are 2 small elevators to the rooms that seemed more than adequate. We never waited long for an elevator. The only negative aspect that I saw of the hotel was the hall carpets (which are carpet square) were quite dirty and needing repair and/or replacement. But, that was minor in context. Of course one of the primary reasons to visit Barcelona is to explore all of the Gaudi architecture throughout the city which is not to be missed. From this location, all his major works can easily be reached by the Metro station nearby or in the case of Palau Guell (which was just recently reopened) you can even walk. All in all, you will not be disappointed with choosing this hotel for modern accommodations, friendly staff, value and most of all location.", "Date": "July 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Antrim, United Kingdom", "Title": "“Excellent value for central location”", "Author": "MapRad", "ReviewID": "UR115164285", "Content": "The hotel road is located right in the middle of La Rambla (half way between the Christopher Columbus monument at Port Vell to the south end of La Rambla, and Plaça Catalunya at the top/north), so it is right in the heart of the action. The hotel is only 50 meters off La Rambla, on a small street which has a few shops, bakery, bank, etc. The street to the back of the hotel leads directly into the Mercat de la Boqueria (or you can also access the main entrance of La Boqueria from La Rambla) - a wonderful fresh food market with an astounding variety of foods - excellent for breakfast or refreshing snack through the day, so no need for any expensive hotel breakfast if it's not included in the booking. The hotel is recently built and modern inside, although as with the majority of 3* hotels, the lobby/reception area gives a false impression of marble luxury, which is not carried on through the rest of the hotel corridors, where the carpet on our 3rd floor was looking a little worn. This unnerved me at first, but on reaching our room we were pleasantly surprised to find the room spacious, very clean and furnished in very neat, modern minimalist furniture - very tasteful, nice, adequate, and all that we required for our 3 night stay prior to our cruise. Likewise the bathroom was a fairly good size, with bathtub and shower, but most importantly very clean. There is no good view from the hotel rooms apart from looking down onto the small street below (large windows, so the rooms are lovely and light, but with good blackout curtains). At nights La Rambla is buzzing and noisy, but the hotel is just nicely situated off from the crowds and we had no problem with noise. Although our bed was 2 large singles pushed together (not sure if other rooms had proper double/king size beds), it didn't bother us and we found the mattresses really comfy and enjoyed 3 good nights sleep. Staff are excellent and helpful. The previous occupants of our room had left the safe locked, so when I rang reception for assistance they had someone up to our room to sort it within 2 minutes! Free WIFI is available throughout the hotel and in the rooms, which was really useful, you just have to ask reception for the code. Need to press a buzzer to get into the hotel, which was no hassle because the staff respond to it straight away. The area around the hotel is quite interesting and offers a taste of the real Barcelona life - we wandered around the small streets on our first night and found it all quite intriguing, but you need to be careful as it can be a little seedy in places, and you can become quite isolated and vulnerable the further off the beaten track you go, for example within a 5-10 minute walk from the hotel we found ourselves unknowingly in the middle of the red light district. It would not be wise to go out around these smaller backstreets alone at night. Liceu metro stop (green line) is very close to the hotel on La Rambla (2 minute walk), or a 10 minute leisurely stroll will take you right to the top of La Rambla to the Plaça Catalunya where you will find a major metro station with access to most of the metro lines. Its best to purchase the T10 ticket if you plan on using the metro a number of times during your stay, and you can also use this for the train to/from the airport. Plaça Catalunya is also the place to pick up the start of the Hop-on Hop-off buses. We chose to go on the Barcelona City Tour buses (red buses - prebooked online to save 10%), rather than the Barcleona Bus Turistic (blue sided buses), although both tour buses are the same price we were glad we chose the red buses as they were definitely not as busy as the other company. We never had any problem getting seats together on the top deck and the buses were really frequent - great way to get an overview of the city and then go explore yourself. Our prime reason for choosing this hotel was its excellent location along La Rambla, so that we would be near the touristy heart of the city for the first part of our holiday, but also because of its proximity to the port for our cruise. We walked from the hotel right down La Rambla to the Christopher Columbus monument, where we got the port bus to the ship - although walking with luggage in the midday heat was tiring. Compared to other hotels in this area, the value for money for our 3 night stay was excellent, and I would not hesitate to highly recommend the Hesperia Ramblas. Word of warning for any travel in Barcelona - beware of very clever pick pockets!! On the train from the airport to Barcelona at the very start of our holiday, my purse was pick pocketed from my handbag (which was actually in my hand luggage case which I was sitting on!) by a young couple (in their 30's) very smartly dressed, definitely not the scruffy Artful Dodger characters that I was initially looking out for. Thanks to a previous tip review I had read on TripAdvisor, I was alert and on the lookout for pickpockets, so noticed that the man had a coat hung over his arm, while the woman was being distracting with her over-affection towards him. Thankfully I caught on to what had happened and shouted to my husband that my purse had been stolen - the guy dropped my purse and moved into another train carriage to find the next poor victim. Keep sharp when travelling on crowded trains!", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Belgrade, Serbia", "Title": "“We loved and well be back”", "Author": "vladimirlj", "ReviewID": "UR115134599", "Content": "Its a clean, nice hotel near Rambla street. We got all what we expected and what we hope for, for our baby and us, nice, clean rooms, 50 meters from La Rambla and Liceu metro station, nice working people in hotel who were there when we needed, With this i want to say them thanx and to keep up good work in this nice hotel. All our recomendation. Also to ad, bad for baby was good, and room was cleaned every dan.", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Somerset", "Title": "“Excellent hotel, deserves another star.”", "Author": "Scott_Main-Reade", "ReviewID": "UR114892237", "Content": "Situated right in the thick of the action. Great location for sight-seeing and a great location to reach all the cities major attractions. Staff where friendly, professional, and bent over backwards to please the customers. Great price for a clean, modern, airy hotel. Would use again.", "Date": "June 30, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Portsmouth", "Title": "“Modern, Clean, Efficient & Ideal Location”", "Author": "heartbeat", "ReviewID": "UR114807213", "Content": "My wife and I stayed here Thursday to Sunday 23rd to 26th June - booked direct and got 15% discount including breakfast, which turned out to be a good deal. Arrived mid afternoon, taxi was around 30 euro from airport and took around 35 mins, but there was heavy traffic due to public holiday next day and everyone leaving early from work. Hotel is one minute down a side road off the Ramblas, entrance is through glass doors and you need to buzz to get in at all times so its secure. Reception area gives instant feel of modern clean feel and freshness. Reception man was efficient and polite and he had on record special request for high floor and double bed. We couldnt get both but chose double bed on floor 2. Whole check in process was fairly quick and painless and we were provided wifi code (free access) for our stay. The room (floor 2) was quite small with double bed, with en suite shower and had small wardrobe and safe (free). No balcony but door opened inwards for air. Air conditioned room. We asked to move to higher floor with two twin beds - this was no problem. This room on floor 5 (top floor) was so much bigger (probably more than twice as spacious - L shape) with separate large bathroom with bath. Everything else same and overlooked another alley. Perfect for us - and was so so much better than first room (we had room 510 which was opposite lift - but quiet). Like the other room this was spotless with TV (only BBC News as prime english channel + National Geographic). Breakfast room was on floor below reception - was so very clean and airy. Continental, but cereal, toaster, juices, meats, a few hot items incl scrmabled eggs and cheeses and wonderful fresh assotred fruit on trays, coffee and tea (leaves in tins for fresh brew). As a bacon and eggs person this was such a great change and lady (who did everything) was friendly and helpful. We were very pleased with this and more than adequate. Only criticism was tables werent cleared very quickly. Location - come out of the hotel door and turn left to get to Ramblas in one minute. Half way to Ramblas at first alley on left if you head up alley a few yards up is the market hall for fresh fruit and assortment of items. A tourist attraction. There was somewhere to get breakfast I believe too if needed. If you otherwise turn right from hotel there isnt much to see, and we did once but not again. Hotel provides maps and advice. They provide you witha tour bus discount - you pay 4 euro for a discount voucher which you then exchange at tour bus offices on Catalanya Plaza (where buses start) at a cost of 17 euro. You cant but ticket from hotel. Overall all this saves you 2 euro each - but better than nothing. There are 3 tourist bus routes - red, blue and green. Most people do red as more stops and attractions, blue visits football ground, green was small. You can use ticket and do all three and jump on and off and swap etc - but must use in one day unless you get two day ticket (extra cost). We did red and blue same day and each was about two hours - red was best. You can wait for next bus is you want upstairs. Catalunya plaza - left out of hotel, left at Ramblas and walk to top of hill (10 min). Red bus stop is straight ahead, blue bus stops on right of square (make sure you get right one). Ticket offices are on square too. Can be busy but buses are regular and wait isnt too long. Other Tips/Views on Area: On Ramblas if you turn right (opposite to Catalunya direction) this ends up at port (10 mins) where theres lots of attractions near waterfront. Very much tourist area and lots to see and shopping centre too. Off Ramblas go down all the lanes and alleys. They all end up at churches and aattractions, so many shops and bars and restauarants to see. You can walk for hours andso much to discover. Be warned that shops and bars on Ramblas are so much more expensive. If you go off into alley, bars and restaurants you get more value. For example on Ramblas tapas selection and drinks can easily cost 40 euro plus for two, yet we paid 25 euro for 3 tapas (big portions) including hams and drinks at a non Ramblas location. Souveniers same - t shirt for kids (adult size) cost 12 euro dont pay more. Haggle will get items cheaper and dont accept first price. Safety wise just be sensible is the advice. My wife put handbag strap over head, and I kept wallet close in deep pocket and I only took out enough euro for the day. Be wary of people who approach you asking directions or in groups. There are lots of crowds. Dont trust anyone. We had one event where group of lads approach close pretending to be drunk, but clearly sizing us up. We let them past before proceeding. Just to add that whenever you see prices at restaurants etc dont forget there will be 8% tax added - prices on boards tend to be exclusive. Tips are normally around 5% if you want, and in bars we tended to leave change in coins a few cents. Quite a few beggars which you can ignore and they go away. Others play music or perform acts and if you like then a few cents are appreciated. Check out from hotel was midday and you can pay 20 euro till 2pm if you want (we didnt). At Catalunya Plaza you can catch the airport bus. It is located on the right hand side of plaza close to above the blue tour bus location. Cost was 5.30 euro one way each and there is a separate bus for terminal one and for teminal two (same bus stop). Was around 30 mins trip and drop off was right outside terminal. Good tip to use this both ways - wish we had done so. Think was around 9 euro. I feel like a tourist guide but if I try to help readers not just with hotel but with some tips we learned. Sorry its so long. Back to hotel - it does what you need and is very clean and was perfect for us. Avoid a small room though and request a larger one on higher floor. Likely if you want double bed you will get small. If we returned to Barcelona we would definitely return here as was central to everything we needed and very friendly. No frills and no restuarnat except for breakfast - but didnt expect it and didnt need it. Rooms have no view - didnt need one wasnt in there long excpet to sleep. Would recommend. Anyone wants to ask question just send email about hotel, location etc. Happy to help if we know. Phew !!", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Southampton, United Kingdom", "Title": "“Great location well sound profed modern hotel”", "Author": "Hampshireman94", "ReviewID": "UR114689029", "Content": "Found this hotel via TA I am glad we did modern clean just a few feet from the Ramblas but so quiet good wet room air con and sound profing very helpful staff on the front desk", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Ft. Lauderdale", "Title": "“Great Location, Great Hotel”", "Author": "Teka2", "ReviewID": "UR114617130", "Content": "My wife & I stayed here prior to to our NCL Epic cruise. We had read other reviews online prior to making our selection, and were very happy with the choice! Never having been to Barcelona before, we had emailed the hotel with a few questions relating to transportation from the airport. The emails were answered quickly & were very helpful. When we arrived at the hotel at noon after a very long flight from Florida, our room was ready & check-in was qiuck. Having no knowlege of Spanish was not an issue, as everyone we had contact with at the front desk was bi-lingual. The room was great, very clean, modern decorations, the bathroom quite large, and they even provided a toothbrush & toothpaste. (Note: both hotels we stayed at in Barcelona did not provide washcloths; This one at least provided a sponge. Apparently this is the norm in Europe?) The location is excellent to Las Ramblas, a main tourist / shopping / restaurant area in Barcelona. It is less than a block walk to the area, and we felt very safe walking around here. We asked the front desk for recommendations on places to eat in the area, and they gave us a card for a tapas restaurant, Taller de Tappas. A bit tricky to find, but fairly close to the hotel. Great food & when we showed them the card from the hotel, provided us with a free glass of cava, a light wine. Overall, a great visit & we would definitely stay at this hotel again.", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Seattle, Washington", "Title": "“Clean option right off Ramblas but bed hard as a rock”", "Author": "gailea", "ReviewID": "UR114078480", "Content": "The room is clean and decently sized for Europe but basically feels like an IKEA showroom set-up. The bed was super, super firm. Like bruise on my hip bone firm. We read about the hotel on a list of kid-friendly places to stay. They brought up a stuffed bunny and a person shaped sponge - which our daughter loved - but otherwise there's nothing unusually kid-friendly about the place. Definitely a decent option, just not that amazing find of a hotel.", "Date": "June 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Staten Island, New York", "Title": "“Clean, modern, affordable hotel”", "Author": "hug0stiglitz", "ReviewID": "UR113715568", "Content": "My wife and I stayed in this hotel for two nights prior to a cruise. The hotel is very modern in design and decor. The front desk staff spoke a little bit of English, enough to do the basic like check in, check out, purchase hop on/hop off bus passes, book breakfast the following morning (it's not included, as one review mentions.. maybe it was in the past, but as of this writing, it was 10 Euros/person), etc. The price was very affordable but at night you may realize why it's more affordable than a hotel in Port Olimpic.. It's location is very close to La Ramblas and if you read reviews on La Ramblas, you'll see there are plenty of mixed reviews.. I for one wasn't one of those tourists who loved it, therefore I gave the hotel 4 stars only because of it's location, and it's not entirely fair to the hotel because it's not like they lost the one star for bad service or dirty rooms, but since this is trip \"advisor\", I would advise you to book this hotel for it's cleanliness, it's low costs and it's usefulness as a place to keep your things while you explore the city and a place to sleep when you're done, or in my case, as a place to stay prior to your cruise; it's maybe 30 minutes from the airport and 15 minutes from the cruise terminal by cab. I wouldn't consider this a place to stay if you're looking to soak yourself in the beauty and friendlier parts of Barcelona, as you will need to do some walking or bus riding to see those parts.. there are probably better hotels (location-wise) to stay in if thats what you're looking for, but otherwise this is a very nice hotel and it does the trick to make you feel comfortable and at home when in the safety of your room.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "New York City, New York", "Title": "“LOCATION! LOCATION! LOCATION!”", "Author": "Kirby003", "ReviewID": "UR113678086", "Content": "All I can say is that it is a GREAT location for the price. My wife and I stayed here for 4 nights and loved the location as it was a block away from Las Ramblas and the Mercat de la Boqueria, as well as the Metro. It's about a 20 minute walk from the Airport Express A1 line which stops/picks up at Placa de Cataluyna. We arrived in Barcelona at 10:30am and were able to check into our hotel at noon, unpack and begin exploring. This was a pleasant surprise as most hotels worldwide would not allow check-in until 2pm or 3pm. The hotel staff is welcoming and helpful. We did not choose the breakfast option offered since the Mercat has much better dining options and you get to experience what the locals have for breakfast and brunch. Our room was very small at the back of the hotel on the fifth floor, but clean, modern and served our purposes for just getting a good night's rest as we walked through Barcelona. Overall it was a great stay for the price and location.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Meh..”", "Author": "mstucker", "ReviewID": "UR113473173", "Content": "We spent one night at the Hesperia Ramblas post cruise. I wasn't hugely impressed. The desk clerk was devoid of personality, although he did allow my poor sick husband to check in early (I think he got tired of looking at his sad face sitting in the lobby). The walls are paper thin, so noise from inside the hotel was an issue. The carpet in the halls was dirty and the seal on the shower door needed attention. On the plus side, it's location was \"close to the action\" -- about a block off the Ramblas and two blocks from La Boqueria Market.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Manchester England", "Title": "“Great hotel and helpful staff”", "Author": "bluwes", "ReviewID": "UR113064324", "Content": "Just back from Barcelona. We stayed at this hotel for 2 nights prior to a cruise. It was everything we wanted. the location is great because you are literally a stones throw from Las Ramblas, but once you turn of the main street, it fairly quiet. It has a modern look and feel about it. The staff were very helpful and gave us recommendations of a great place to eat away from the main tourist spots which quite frankly serve up horrible food. After the cruise we had a late flight back home and we fixed up that we could leave our luggage back at the hotel after we had debarked. We were even able to change clothes and freshen up. Will definately recommend this hotel.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Washington", "Title": "“Nice hotel in great area”", "Author": "Glo51", "ReviewID": "UR112661079", "Content": "Enjoyed our one night stay here close to Las Ramblas. Easy to walk to many restaurants and shops in the area. Great area to enjoy Barcelona. Very quiet, clean rooms with wood floors, good size bath, free wi-fi in lobby. Did not have breakfast as our flight left early.", "Date": "June 10, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Just okay for us”", "Author": "clarklett", "ReviewID": "UR112331833", "Content": "I found this hotel on TripAdvisor and it looked really nice in pictures and was affordable. We only needed one night here before leaving on a cruise. Looking back it was just okay, but still probably one of the better at this price and location. One other disclaimer, like many others and despite precautions my wallet was pick-pocketed at the metro station closest to this hotel. I love Barcelona but it really isn't safe there right now and I wouldn't recommend traveling there until they fix the street crime. I'm usually good about keeping my eye on my wallet, but these teenage or early-twenties kids will distract you by crowding around and falling, or getting run over by someone's bag while another one grabs your wallet. This was the one time I didn't have it in a money belt under my clothes but that's all it took. Anyway, back to the hotel: • Paint was peeling and a bit discolored in the hallway and the room, which didn't match the nice clean image the photos seem to show. • One of the front desk staff was friendly enough, but the other one seemed to have a permanent scowl, and practically grunted instead of responding at times • I think we had a disabled room, but it was probably a bit larger than some other standard rooms • We paid 10 euro a person for breakfast in the morning, which was a pretty good European-style breakfast (meats, breads, pastries, eggs, etc.) • The modern style is nicely designed, but everything does feel a little cheap in person • Free wi-fi worked well on my iPad", "Date": "June 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Boston", "Title": "“Loved this hotel”", "Author": "slp75", "ReviewID": "UR110923115", "Content": "We recently spent two nights at this hotel; one night before our cruise and one night after our cruise. Loved this hotel - staff at the desk were very polite and helpful. We had two different rooms and both were exceptionally clean. Loved the large showers! The second night we checked in, for some reason we were given the handicapped accessible room, which turned out to be a bonus. It was a larger room and the shower had two shower heads! The first night, we faced the main street and did not hear any noise at all. We had A/C in both rooms ( I don't know why some reviewers claim they didn't have A/C). Thought breakfast was expensive but there is a bakery three doors from the hotel and the large market is around the corner. The metro is a 3 minute walk, there is an ATM machine about 10 feet from the front door of the hotel and it cost us about 21 euros to take a taxi to the port. The petty crime is a problem in Barcelona but the hotel clerk told us to stay in the lobby with our bags until our cab came. When we left, the cab driver actually came into the lobby and carried out our bags! Would definitely stay in this hotel again and the price was fantastic!", "Date": "June 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Perfect Location”", "Author": "Niamh197", "ReviewID": "UR110600002", "Content": "The location of this hotel was perfect with just a 3 minute walk from the metro station. The room we stayed in was extremely small. When we opened the door the bed was right in front of us, with no \"hallway\" like most hotel rooms. Apart from the room being small, it was perfect as the it was decorated quite funky and was spotless clean. The TV only had BBC News as the only english station but what could we expect in Barcelona. The hotel staff was very polite and helpful. We didnt eat breakfast at the hotel but there are plenty of cute coffee shops nearby. One morning we went down to the market and got a frest fruit smottie for €1 and fruit salad for €1.50. I would definately stay in this hotel again if i was returning to Barcelona. Oh when exiting the hotel, walk to the left. One day we turned right and down that street made me feel uncomfortable with some undesirables hanging about.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Mims, Florida", "Title": "“Affordable and convenient.”", "Author": "flennee", "ReviewID": "UR110403351", "Content": "My husband and I stayed at Hesperia Ramblas two nights before our cruise. We found the hotel to be modern, with a convenient location and quite clean. Our room was very spacious and comfortable. The front desk was not overly friendly and warm but were very helpful and answered every question we had. They gave us great suggestions about transportation and discounted bus tickets. They also called a taxi for us the morning we left for the port. It was a basic hotel and had no gym or pool. It also only had a breakfast option downstairs which we did not use. However, it was within walking distance of bus stops, restaurants and other shops.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Calgary, AB", "Title": "“Good location, noisy and poor service!”", "Author": "veggienb", "ReviewID": "UR109815492", "Content": "Stayed for three nights. here are the pros and cons: Pros: Location Price Modern room design Large bathroom Cons: No air conditioning for two of the three nights Slow service at reception Cons: Noisy outside as well as the hallways Poor service, no a/c for 2 of 3 nights No hotel info on check out time or how to reach reception via telephone Beds are hard and sheets are stiff and noisy!", "Date": "May 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fordingbridge, United Kingdom", "Title": "“Would go back tomorrow if they sort out the street crime.”", "Author": "1065822Judy", "ReviewID": "UR108943956", "Content": "So very pleased with this lovely hotel. Lovely bedroom, quiet, very clean. Excellent air conditioning. Lovely staff, delicious breakfast and excellent location. Would highly recommend it to anyone visiting Barcelona and would go back to it. However Street Crime in Barcelona at record high. Had Flight Bag stolen outside hotel as we were leaving. Incidents of jewellery theft, wallet/purses being taken and handbag snatches, several times a day. Until the police introduce zero tolerance we shall not go back.", "Date": "May 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oslo", "Title": "“Close to perfect”", "Author": "ballodent", "ReviewID": "UR108482606", "Content": "My wife and I stayed for 4 nights and loved it. The room was big enough with bright colours and a spacious bed, the air conditioning worked very well, as did the shower (hotelrooms are to be measured by the functionality of the shower). It was very quiet though facing the street, and not a sound to be heard from the neighbouring rooms. The breakfast rolls are very good and there seems to be very few items lacking. We still agree with the other guests who have mentioned the fantastic Boceria market just around the corner. There you may enjoy a delicious English breakfast at a very reasonable price. The hotel staff is very helpful. None of the guys at the counter seem to have problems with the English language. The only (quite insignificant) thing that renders a negative impression are the hideous stainy green carpets in the corridors. When they are replaced, this hotel will be perfect. Anyway, we will not bother looking for another place to stay: The unposh, very latin and supercentral location is unbeatable.", "Date": "May 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“Good, saft and comfortable place to stay”", "Author": "davidjun", "ReviewID": "UR106762287", "Content": "We had stayed in this hotel for one night before our cruise in March, 2011. Staff is courteous and helpful. The location is great. The price is fair. The remodeled room is clean, comfortable and modern. We will definitely stay there again.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sliema, Malta", "Title": "“good hotel - central location”", "Author": "115owner", "ReviewID": "UR106624423", "Content": "Central hotel , just in one of the side roads of Ramblas and 1 min away from Bouqeira Market. Hotel in very good condition , room clean , bathrooms tatty!!!", "Date": "May 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Glasgow", "Title": "“Modern hotel in the heart of Barcelona”", "Author": "Anon092", "ReviewID": "UR106564516", "Content": "Boutique hotel on a side street close to La Rambla. Convenient base for touring the city centre and all points beyond. As you leave the hotel, turn left and it's only a few hundred metres to the buzz of La Rambla ... lots of cafes, bars and shops nearby (although many shops are closed on Sundays!). Hotel is clean and decor is modern. Only slight criticisms are that the rooms are a bit on the small side (as you would perhaps expect in many major cities), the views from the rooms are not that great, there are only a limited number of English-speaking TV channels and the reception staff are pleasant but painfully slow! Only other cautionary note is that if you leave the hotel and turn right, some of the streets further along don't seem to be in the greatest neighbourhood! But turn left, head for La Rambla and you'll be fine.", "Date": "May 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Nice hotel in a great location - shame about the staff”", "Author": "Spanner82", "ReviewID": "UR105693656", "Content": "We recently spent 2 nights here to enjoy beautiful Barcelona. The location of the hotel is great, just of La Rambla and 2 minutes to a metro station. While it can be a noisy area, the rooms were very well insulated against noise. Value is average for a hotel of this standard. The rooms are average size, modern and clean, however my only complaint is that there was no air conditioning. We were told that there is no air con during \"winter\" however with temperatures in the mid-20s celcius, the rooms got very hot at night. Having the window open provided very little relief, and allowed the street noise in, so best avoid this hotel if you would like to sleep. The staff were also quite rude. One argued with me about the definition of twin and double beds when I was provided with the wrong type, even though my booking clearly stated the requested type. Overall, I would recommend this as it's a modern and clean hotel in a good location. However, be wary of the lack of air conditioning if you're not going in summer.", "Date": "April 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Stamford, UK", "Title": "“Good location, but noisy”", "Author": "IGJ44", "ReviewID": "UR105290137", "Content": "This hotel is in a good location and is clean, however what isn't clear before you book is that it is very noisy. The rooms were warm almost too warm to sleep and you couldn't open the windows because the noise from the neighbours was also too much to allow sleep. One of the neighbours dead opposite our 5th floor room decided to have a party at 11.30pm that went on to 1.30am, you couldn't hear yourself think with the window closed! If you want to be in the heart of the city and don't mind the noise this hotel is fine but if you need something more quiet and less humid then find somewhere else.", "Date": "April 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Surrey", "Title": "“Brilliant Hotel, lovely staff”", "Author": "felicityjg", "ReviewID": "UR104477630", "Content": "Situated a minute's walk from the middle of La Rambla and a further minute to the Metro Station. The Hotel is spotless! This break was a rebook from one cancelled by the snow in December. Despite having made a non-refundable booking, as soon as we were forced to cancel the Front Desk Manager offered to rebook for another time. We paid a very reasonable amount more for the booking a week before Easter (instead of totally out of season!). We arrived by 10am and had our rooms been ready we would have been able to check straight in. As it was, the desk looked after our luggage and we were free to go out. The rooms are small but totally adequate with lots of wardrobe and shelf space. They are modern and spotless. Ours looked over a back alley - but it was a city break - and provided the room is quiet and comfortable I don't care about a view! The bathroom was a good size and had a hot, powerful walk in shower. (Do make sure the door is fully closed - there is a good seal around it, but it does need to make contact!). There was a safe in the wardrobe. The breakfast can be pre-booked to save a few euro and was excellent. The bread was delicious and fresh, as was the fruit. The coffee machine, however, did take an age to make coffee, and the kettle took a long time to boil! The only very small complaint was that there was only one girl doing absolutely everything. She coped admirably, but at the weekend it would have been more efficient to have 2 people on duty. I would recommend this hotel to anyone and would certainly stay there again should we return.", "Date": "April 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dudley, United Kingdom", "Title": "“Excellent hotel”", "Author": "kinhell", "ReviewID": "UR104066294", "Content": "We have just come back from teh hesperia Ramblas. It's conveniently located and couldnlt be in a better position with teh Ramblas 50 yards away along with Liceu Metro station. The hotel is new and clean with a modern decor. The front desk were very helpful.", "Date": "April 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "durham", "Title": "“What's all the hysteria about hesperia? : convenient location, average hotel.”", "Author": "Coffeeprincess", "ReviewID": "UR102230075", "Content": "Spent a weekend break here. Not as enamoured by this hotel as many of the previous reviewers though it was certainly decent. Hotel is located on a side street a few hundred yards from the hustle and bustle of La Ramblas, however if you head a few hundred yards in the opposite direction you will find a very rundown part of the city. However it is close to LIceu metro station and therefore is a convenient base for exploring this beautiful city. Room was nicely decorated and pleasant enough but it was rather on the small side, so much so that if you sat at the solitary table in the room your partner cant get to the other side of the room without clamouring over the bed. On the positive side the room was very clean, though the bathroom was basic including a large shower area which tended to flood the rest of the bathroom when in use. Breakfast was also okay with a selection of cooked meat, cereals, fruit and pastries, though the self-service coffee maker/hot water maker took an age to fill a cup (no black tea bags either). All that said, these criticisms are relatively minor and easy to fix, and we would certainly not discourage anyone from staying here. If you do make sure you visit Park Guell, an amazing hillside park designed by the maestro Gaudi.", "Date": "March 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kent", "Title": "“Great Hotel”", "Author": "TravellingLou", "ReviewID": "UR102197998", "Content": "We decided to stay at this hotel because of the location and great reviews. The location was perfect for us, just off of La Ramblas and very close to Liceu Station. The hotel was spotlessly clean, room was a great size and very nicely decorated. The beds were so comfortable and there was not a sound from outside once the windows were shut. We also really enjoyed the breakfasts. I would definitely stay here again and would recommend others to stay here too.", "Date": "March 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sweden", "Title": "“Lovely hotel”", "Author": "Aany", "ReviewID": "UR101837818", "Content": "Modern and spotlessly clean, a little gem of a hotel. Really good location, only 1 minute away from Liceu metro stop and La Ramblas. Very quiet, as soon as you close the window you are in your own little paradise. Modern and comfortable rooms, lovely bathroom and shower. Free WiFi was a big plus :). I would definetly stay here again if returning to Barcelona.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great Value in La Rambla Area”", "Author": "mr_cruiser", "ReviewID": "UR100399246", "Content": "Stayed here 3-nights pre-cruise in February. Great location on side-street just a couple short blocks away from La Rambla, Liceu Metro and Boqueria Market, so it was very convenient and close to all the action yet very quiet at night. Super central location meant it was an easy walk from Catalunya Place where the Airport bus drops you off, and an easy walk to the Columbus monument at the foot of Rambla where we took the Shuttle bus to the Cruise ship terminal. From the hotel you can explore La Rambla, the old town, Barri Gothic, El Raval, etc. by foot. To see more of Barcelona (Montjuic, Parc Guell, Sagrada Familia, Torre Agbar, Olympic Waterfront, etc) we took the excellent value hop-on hop-off bus (we choose the RED HOHO as it goes to goes to more sights and areas than the other Green one). The hotel itself is newish and more modern than others we considered, the 4th floor was quiet and our room was clean and adequate size but sparsely furnished, good water pressure, nice double-glazed window overlooking the street (Le Hospital), the safe was large enough to hold a notebook and other important stuff, free wireless is included (there is computer access with a printer in the lobby if you don't have your computer but you have to pay for this service). We didn't have breakfast in the hotel as there were lots of nice eateries to experience nearby. We felt very safe even coming back late at night as the hotel was very close to Rambla, plus you have to ring the bell to get entry (many hotels there have this security feature). Would certainly stay here again.", "Date": "March 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "houston,TX", "Title": "“Perfect”", "Author": "houstonflygirl33", "ReviewID": "UR99711639", "Content": "Stayed here 3 nights and it was mire than expected. All the reviews are good and proved to be true. La boqueria was a treat. We bought fruit, fresh bread, ham, cheese and kept in the fridge in the room. Also bought wine from a great shop 2 side streets past hotel in the corner of the boqueria. This saved us money and it was just delicious. There is a bakery next to the hotel on the same side of the street. We ate here everyday! Great quiches, delicious empanadas, everything they sell us amazing!! We took food with us on the bus tour :) I highly recommend this hotel. Worth the money.", "Date": "March 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great Deal (overall), Great Aesthetic & Great Location”", "Author": "TransEuropaExpress", "ReviewID": "UR99704023", "Content": "Overall, this hotel is a great deal in a great location- if you prefer to stay right off the Ramblas near the Gothic Quarter which we did. The hotel is relatively new (built probably within the last 5 years), and has a great modern aesthetic (think West Elm meets Ikea), but unfortunately it seems like they ran out of money when it came to the lighting and bathroom fixtures- most of them seemed like they would (or in some cases did) fall apart as soon as you touched them, or they were poorly mounted and it showed- which is a shame, since otherwise, the interior design was quite nice and modern. The toiletry handouts were also kind of cheap, so bring your one and don't expect any l'occitane toiletries or anything of the sort. Free Wifi is a plus as long as you're stationary, and the in-room safe is also appreciated. We opted out of the buffet breakfast, and decided rather to explore the local options of which there are plenty. Otherwise, the staff was very kind and helpful and mostly on the ball. We had an issue with the toilet running, and someone was sent up to fix it immediately. Would definitely recommend to someone else.", "Date": "March 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Worcester, United Kingdom", "Title": "“Great stay at this clean and modern hotel with polite and friendly staff”", "Author": "J0b_27", "ReviewID": "UR99694324", "Content": "stayed for 4 nights, arrived at hotel approx 10.30pm, able to access coffee and pastries on arrival. cleanliness evident immediatly in reception area. lift access to rooms based over 5 floors. booked breakfast for the next morning so a small 2 euro discount was applied. Breakfast - juices, pastries, cereal, toast, bacon, scrambled egg, sausage, fruit also available plus tea and coffee, self service. Rooms very clean and modern, great shower/bath, daily maid service. safe available in room at no extra charge, also a mini bar available in room. no tea or coffe making facilities in room, however plugs available for if a travel kettle was taken. 1 minute walk to main street Ramblas, easy to access metro train and walk to tourist bus services. The fantastic Boqueria market is accessed approx 50 yards from hotel. no excessive noise was heard from the hotel and overall the hotel was quiet. Great stay.", "Date": "March 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin Ireland", "Title": "“Very good central hotel at a cheap price”", "Author": "darraghke", "ReviewID": "UR98793578", "Content": "Stayed here from 27th Feb until 3rd March 2011. Located just off the Ramblas, a great place to base yourself for getting around Barcelona. The hotel is nice. You must ring the bell to gain access to the hotel, a bit strange but at least it shows they are security conscious. The rooms are of good standard. Just a couple of small points, the bed was far too low, I never slept in a bed so low it felt like I was sleeping on the floor. And no extractor fan in the bathroom.After a shower the bathroom tended to be very hot and humid for ages afterwards. If I am coming back to Barcelona I will look up this hotel first", "Date": "March 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rabat, Morocco", "Title": "“Wonderful Stay”", "Author": "luvninou", "ReviewID": "UR98352547", "Content": "Just came back from my barcelona trip where i spent 3 nights at the Hesperia Hotel. The location of the hotel is perfect; in a small street by Las Ramblas (the place to stay in in barcelona). The staff is so nice, courteous, and helpful. The rooms are quite spacious fro european standards. The design is ultra chic & modern, all made with white & grey shades. The beds are comfy & the bathroom is very modern. The hotel & rooms are kept clean daily. It's a lit bit noisy as it is right on the city center, but you can still sleep fine at night. We checked other hotels in the area, & all had the same problems, at least Hesperia is located in a small street, so the noise isn't unbearable We never felt unsafe while walking to the hotel at night, although we found many prostitues on the main avenue in Las Ramblas, but really, nothing to brag about. Getting around : - You can take the hop on hop off busses (bus turistica is by far the best) to see the main sightseeing, don't forget to ask for the headsets once inside. We tried it on friday, which was a good option but i'm glad we didn't get it on saturday & sunday as there were HUGE lines to get into the bus. If you are interested ask in the front desk for the tickets coz you get a 2 euros/person discount & they give you a small booklet that has tons of discounts. Otherwise the taxi is a very good option as i found that it was't expensive at all (25 euros to the airport for the four of us). Food : - We had breakfast at the hotel, almost 11 euros (2 euros discount if you tell them as soon as you come). Ok it's a little bit expensive, but it's worth it; good selection of pasteries, fresh juices, coffee, cheeses, scrambled eggs, breads, sausages, fresh fruits, cereals & yogurts. Otherwise, there's a starbucks coffee 5 to 10 min walk from hotel. - We found the food in barcelona very delicious, we tried many tapas restaurants; i think the best one is called Txapela (located in passeo Gracia right after plaza Catalunya, you pass across the huge \"El Corte Engles\" & it's 3 min away on your right), there was also a good one (u shouldn't be on a hurry though & i woudn't recommand their paella) named \"Taller de Tapas\" & located on the small streets in front of the hotel in Place Sant Josep Oriol, N°9 (Pl. del Pi) - On my birthday we tried \"Con Gracia\" Restaurant, you have to make online reservation at least couple weeks before on tehir website. It is expensive (around 60 euros/per + beverages), but in my opinion it's one of the best. It's not a hispanic restaurant, but a great mixture between japaneese & mediterranean food. They have only 2 menus, one they call traditional & the other one \"surprise\", made up only for you based on what you like & dislike but you can only pick up one menu per table. We tried the traditional one & it was a great experience, we also saw some people getting the surprise menu & it was as delicious. There were some combination of food i've never tried & the mixture of ingredients was devine. For sure, i'll go back there if i ever visit barcelona. SIGHTSEEING : We didn't have time to see it all, but we picked up the following & it was a rewarding experience : - Nou Camp (Stadium) : for the FCBarcelona fans, yes i'd recommand ot, otherwise just skip this tour - Casa Batllo : Very charming & beautifully made with all the details Gaudi thought about. I highly recommand it - La Segrada Familia (Church Sacred Family) : Beautiful structure. Unfortunately we couldn't get inside on the 2 days we went there (we went quite early on the 2nd day). there was always a 3hrs waiting line & we just couldn't take it. Maybe we'll be lucky enough to visit it next time - Guell Park : When the bus drops you, you will have to walk on a VERY STEEP street for 5-10min. It's a wonderful place on a sunny day. You can enjoy a nice view from teh top of the gardens, & there r musicians all around the park - We loved walking around & discovering the city especially on the narrow streets just past Las Ramblas area, we'd get lost & then found out our way. Totally safe & fun visit. You get a different taste of the city. On sunday you can find farmers selling their products (cheese, flan, olives, homemade biscuits..etc).", "Date": "February 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“would stay here again!”", "Author": "Lifesdepth", "ReviewID": "UR97387344", "Content": "In January for 3 nights prior to our cruise we choise Hesperia Ramblas. It was excellent price and great location! Our first time in Barcelona and we could not have chosen a better place! Our room was clean, bright and specious. Not much to add to other positive comments. The staff was friendly and helpful. Nicely decorated and comfortable pleasant lobby. We were out most of the time and it was pleasure to get back to good \"home\" away from home.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bangalore", "Title": "“In the heart of all the fun. Great Hotel. Great Experience”", "Author": "Nym18", "ReviewID": "UR96680073", "Content": "The hotel was spotless, the service staff were very helpful. The front desk manager was really patient with us coz we were first time travellers in BCN. It's in the middle of everything, location wise. Very pleased. will definitely come back.", "Date": "February 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Super value and location”", "Author": "Portcruiser", "ReviewID": "UR95698598", "Content": "We stayed here in January, 2011 for a four day sightseeing visit. You can book on their own site for the best rates with no penalty if you need to cancel. http://www.hesperia.com/ I cannot say many more good things that what others have already written. You can't beat the location of this hotel if you want to stay in the Las Ramblas area.. Next to the Boqueria Market for fresh cut fruit and pastries at bargain prices [if you wlak to the right and turn right there's even a shortcut], a Dunkin Donuts a block up Las Ramblas for American coffee if you want, and right by the Liceu metro stop or a short walk to the hop-on-hop-off buses for which the hotel provides a nice discount -- buy a 2 day pass since you want the red line one day and the blue another. Clean and modern and new. On Google maps the picture has it still under construction. The staff was friendly and helpful and speak English well. Free internet is available in your room [they give you a password good for your entire stay] or computers in the lobby for guests. The safe in the room is large enough for your laptop and lots of other stuff. Bring a converter for Europe and a washcloth which hotels here do not offer. The towels are large and fluffy. The rooms are quiet. The beds are nice and firm. Want great food then for Tapas cross Las Ramblas and find Irati at Cardinal Casanyes 17; for dinners La Fonda or Pelai a 10 minute walk in different directions [the hotel will print you Google maps for them] or Osmosis, the #2 rated, -- a cab ride. Do not miss the Roman ruins in the basement of the city museum in the Barrio Gotico just a 15 minute walk.", "Date": "February 6, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Moscow, Russia", "Title": "“Very good hotel.”", "Author": "rupi22", "ReviewID": "UR92859465", "Content": "This hotel is very nice and very comfortable and the shower works very nicely. It is not expensive for Barcelona and it is very quite to sleep at night. Breakfast very nice and I am very happy with this hotel and next time I will stay longer.", "Date": "January 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "washington, dc", "Title": "“Great location and clean rooms”", "Author": "car6", "ReviewID": "UR92107256", "Content": "We stayed here for three nights and loved it. The staff was wonderful, the room was clean and the location cannot be beat. It is one block from La Rambla and the Liceu Metro Stop. It is in the immediate vicinity of La Boqueria (right next door!) and a short walk from the Gothic Neighborhood. It is walkable to the beach, Sagrada Familia and other sites (albeit, these are fairly long walks). One thing to note - we couldn't control the room temperature very well and it was very hot.", "Date": "January 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“Great location”", "Author": "aussiewineguy", "ReviewID": "UR91133051", "Content": "Our second time in Barcelona was somewhat brief. We were overnight readying to board our cruise ship the following day. The hotel is just off La Rambla in an easily accessible location - right in the heart of 'downtown' not too far from Catalunya, it is also easy walking distance from one of the metro stops. The hotel is in excellent condition, and we were able to check in early. The breakfast the next day was buffet style and actually a decent selection (loved the fresh fruit), and the price wasn't too bad (10 euros pp). Very convenient if you don't have time for a late-ish breakfast elsewhere. Room was in great condition, nice big bathroom and comfortable bed. Internet included was great, allowed us to organize a few things, and review online maps etc. Staff were prompt and courteous, and gave good directions to a major department store where we were able to buy multi plug adapters. All in all, precisely what we were aiming for, and it didn't break the bank. Great location for exploring Barcelona!", "Date": "December 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Harpenden, United Kingdom", "Title": "“Good value and great location”", "Author": "cheznelson", "ReviewID": "UR88738443", "Content": "We booked this hotel on a prepay deal and got a great price, including breakfast. Very impressed with the room (especially the powerful walk in shower!), decor, location, and breakfast choice. Good minibar prices too. In room safe to lock away your valuables, a/c or heating as the season dictates and free wifi connection. We had a room overlooking Carrer Hospital, which was a little noisy at night if you left the windows open, but then you are in the heart of the city, so should espect this. Metro stop at the end of the street and very easy access by airport bus from the airport. All major sites within walking distance (and walking is the best way to see this city). Public transport costs very good value.", "Date": "December 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“excellent!”", "Author": "Evie09London", "ReviewID": "UR88078114", "Content": "Very clean, nice breakfast, very quiet and good value. Very impressed!! And most important close to everything!", "Date": "November 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Benton Harbor, Michigan", "Title": "“Good Value, clean and friendly and so near to everything.”", "Author": "shoprojb", "ReviewID": "UR87064230", "Content": "I stayed there in early Oct. 2010. While the room was small it was spotless clean and very quiet. The hotel is a fairly new building located just a block off the Ramblas and just around the corner from the central market. There are a lot of resturants nearby and the Metro station is a very short walk. The Hesperia Ramblas was ideal place to stay. The staff was great, friendly, spoke english fluently and were always there to answer any questions and provide directions. I speak and understand a little Spanish so I was able to communicate very well. I would definately return there.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great Hotel”", "Author": "ecd200", "ReviewID": "UR86675549", "Content": "You can't beat the location of this hotel. Next to the Boqueria Market and right by the metro. Clean and modern...this is a great find. The staff was friendly and helpful. Free internet is available in your room or computers in the lobby for guests.", "Date": "November 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tallinn, Estonia", "Title": "“Recommend undoubtedly! :)”", "Author": "Prima_ee", "ReviewID": "UR85711331", "Content": "Was staying at Hesperia Ramblas July 2008. Staff was very welcoming and helping if you need wonder what to see round -- gave maps, ads etc and do speak sufficient English. Hotel isn't crowded itself and surprisingly quiet even if windows look at the road. Rooms are comfortable, nothing less, nothing more, all is at high standard: very clean and neat. No complains to the typical light continental breakfast. And most important: very good location - beginning of La Rambla is in a 1-min walking distance, + bus and metro stops!", "Date": "November 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Good value and excellent location.”", "Author": "mebanana", "ReviewID": "UR85399251", "Content": "This hotel is pretty new and the decor reflects this - very modern. It is clean, well serviced but not luxurious - the rooms are pretty small and the desk staff are helpful but not pandering. However, if you come here, you don't pay for luxury! The location couldn't be better - many of the sights are a short walk away and the rest are accessible by the nearby metro station. We had a great time here and I'd thoroughly recommend this hotel.", "Date": "October 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "england", "Title": "“a great hotel in a central location - everthing you need for a stay in Barcelona!”", "Author": "EnglandRatbag", "ReviewID": "UR85284662", "Content": "Well appointed room albeit a little small. Super bathroom supplied with all you might need (down to toothbrush, toothpaste and sponge. Las Ramblas and Metro about 50m away. Clean, friendly and amenable - a great stay!", "Date": "October 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bratislava", "Title": "“Perfect hotel - worth its price !”", "Author": "marianmachi", "ReviewID": "UR84402386", "Content": "Fabulous hotel in the heart of Barcelona. We have enjoyed our stay here, though we have stayed only few nights here, we felt we were warmly welcome by the front desk stuff, always willing to help. But i must confess, we had no non-standard requests on them, since everything was going smoothly :) The rooms were very clean and despite the fact you're in the city center (small side street) you don't hear any noise neither from the street, nor from other rooms. The rooms are not very spacious, but for the short stay in Barcelona its worth its price. Its located just a few steps from La Rambla so both shops, cultural sight and nighlife activities are reachable in walking distance. We didn't even buy any public transport ticket (didn't need to due to good location of hotel). I didn't have the chance to taste the Breakfast buffet here, since the Mercat La Boqueria is just few meters away, you can walk there anytime and buy fresh breakfast. Our group was 100% satisfied with this hotel, and YES we will recommend to our friends.", "Date": "October 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Phoenix, AZ, USA", "Title": "“Modern hotel, tiny rooms, good location.”", "Author": "alsobidingmytime", "ReviewID": "UR84197329", "Content": "Check-in was efficient and reception was friendly. Surprised by the size of the room -- it was tiny. There was very little room to move around the queen sized bed. We had two large suitcases that took up quite a bit of room on the window-side of the bed. The size of the bathroom was adequate. The room was clean but the shower door did not close completely because there was a bit of mold build-up that prevented the door from fully closing which then allowed water to leak onto the floor. We didn't notify reception as we were only going to be there for a few days and it wasn't a priority. The location of the hotel is good -- right off Las Ramblas. Far enough away to be fairly quiet but close enough for the convenience. Another plus is the proximity of the mercado -- just a quick walk up the narrow street behind the hotel. We enjoyed browsing the mercado each day and had a hot breakfast there one morning. Overall, the stay was fine but if you are looking for luxury this is not the hotel for you.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Doncaster, United Kingdom", "Title": "“Good value, clean, modern hotel, just right for us.”", "Author": "johnandpat59", "ReviewID": "UR82863216", "Content": "We stayed here for 4 nights with friends. We all agreed the hotel staff were extremely helpful and friendly, advising on trips, travelling around the city, getting taxis, nothing was too much trouble. Breakfast deals were offered and well worth taking. A good selection of hot and cold food was very good and it was all buffet self service, perfect for us. Rooms were spotlessly clean and cleaned every day with fresh towelsdaily and bedding twice during a 4 night stay. We recommend this hotel to people wanting to be quickly in the centre of town, it is on a side street off La Rambla, easy to walk to Placa Catalunya for Tourist buses and Airport transfers. We will stay there again, thank you Hesperia Ramblas!", "Date": "October 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bowie, MD", "Title": "“Comfortable and convenient”", "Author": "lovelyrita_mm", "ReviewID": "UR82506031", "Content": "This hotel is very comfortable and clean. It's conveniently located right off the main drag of La Rambla - and a very short walk to the Liceu Metro stop. The beds are comfortable and I slept really well. We had friends that stayed in a different hotel and they had noise from a disco. That's not the case here - we didn't get any outside noise. The staff was friendly and helpful too. That said - the bathroom sort of has a door - it's a piece of thin plastic that slides sort of over the door, but it may not give you the privacy you might prefer. We would have liked a a real door. Also, the shower only has a curtain dividing it from the rest of the bathroom, so water can spray over the floor. The water pressure, on the other hand, was nice. The rooms have free wifi, which is very nice, but you have to constantly log in. Every time my phone or ipad screenlock went on, I'd have to reenter the wifi username and password, which was a pain. But hey, free wifi! These little things weren't enough to really bother me as the hotel was so quiet and comfortable. I'd stay here again.", "Date": "October 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Yorkshire, UK", "Title": "“Good Accommodation, Great Location”", "Author": "jonesy21", "ReviewID": "UR82020434", "Content": "We stayed here in October 2010 during a very short visit to Barcelona for which we wanted to be reasonably central. Hesperia Ramblas is just 50m from Rambla de Sant Josep and a short stroll to many bars and restaurants in the vacinity. Rooms were very clean and comfortable, reception staff very helpful. Beware of the theives/pickpockets in Barcelona, we weren't targeted ourselvesbut witnessed two bag snatchings in the two days we were there.", "Date": "October 4, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "New York City, New York", "Title": "“A glitch in their system”", "Author": "GoddessKris", "ReviewID": "UR81174436", "Content": "As you will read below, my rating is not based on the hotel room, its cleanliness, sleep quality, etc. because even though we had booked to stay at this hotel, we were pretty much rejected as soon as we entered the hotel property. After a long and uncomfortable flight on an old aircraft from America, we finally arrived in Barcelona, ready to take a shower, unwind, and get our vacation started. However, when we arrived at the hotel, the staff told us that a problem in their system had us booked NOT at the Hesperia Ramblas, but another Hesperias property on their other side of Las Ramblas. After not being able to convince them to let us just stay at the hotel since the fault was theirs, we waited in the lobby for a taxi to come get us to take us to the other hotel. When the taxi finally came, we had to sit through the hotel staff and the taxi driver haggling over price. We didn't understand what was going on, until we started driving. What would have been a very short walk, the taxi ride was over 10 minutes through the back streets of El Raval. And the best part is, the taxi couldn't even drop us off at the hotel. We got dropped off on Las Ramblas, and with the taxi driver telling us it's only a 2 minute walk to the hotel, we proceeded to get lost in the small streets of Barrio Gotic. Luckily, we found a helpful local who guided us to the hotel. Needless to say, I was disappointed by this entire ordeal, especially because a friend of mind had recommended the Hesperias Ramblas to us. I was disappointed at the lack of professionalism and the low quality of customer service.", "Date": "September 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location, just OK hotel, free wifi, good value, would stay again”", "Author": "GreenwichNick", "ReviewID": "UR79846765", "Content": "The location of this hotel has to be one of the best in Barcelona - just off La Rambla, a couple of minutes' walk from Liceu metro. All the Barri Gotíc is in walking distance, and also on the Poble Sec side of La Rambla there are plenty of bars and restos in walking distance. Metro line L3 takes you plenty of places, or you can walk up La Rambla to Catalunya. I was a bit disappointed with hotel - while it's modern and clean, it feels a bit grubby and cramped, and too many things didn't quite work first time - I couldn't get the wired Intert access to work, although the free wifi was just fine; my phone didn't work and I had to ask for it to be replaced. The room was small and bare. All that said, this hotel was good value, the staff were friendly and helpful, and I *would* stay here again. It's a great lowish budget option for staying in the centre of town for those of us who want something better than the low end.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Gem of a hotel”", "Author": "Worldsbig", "ReviewID": "UR79763840", "Content": "We stayed in this hotel after reading positive reviews on Tripadvisor. We were pleasantly surprised with the Hesperia Ramblas. The convenience of this hotel is paramount. It is just off of Las Ramblas, with the subway and bus stations close by. The rooms are simple with a modern approach. They appear very clean and we felt very comfortable in the room. Beds were rather firm, as this appears to be common throughout all of Europe. No outside noise was heard either! We didn't eat at their restaurant, as the market (Mercat de Boqueria) was a two minute walk away. For 130 euros, we felt this was a good deal. No internet, without extra charges, or fitness center. Still happy with Hesperia Ramblas.", "Date": "September 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Perfect location in the heart of town.”", "Author": "DG78", "ReviewID": "UR79427827", "Content": "Perfectly clean, tidy, comfortable and quiet. Excellent base to investigate this amazing city. Turn left out of the hotel and you are a few meters from La Ramblas and then a hop, skip and a jump away from everywhere else you may want to visit. Turn right out of the hotel and you are in the Raval district, great if you love nooks and crannies, bars and boutiques, the rough and the smooth. Behind the hotel is the wonderful Boqueria Market...torturous if you love fresh ingredients as you have nowhere to cook them...but fun all the same. One complaint. The male receptionist who was manning the desk as we arrived for our one and only holiday of the year which we had scraped and saved for, failed to look up from his computer as we stood in front of him for at least a minute. Not long you might think. But not a polite greeting in anyones book. He them proceeded to book us in without a welcome, or a smile, or very much else for that matter. Thankfully he only seemed to work mornings. The woman who worked afternoons and evenings was delightful, helpful, friendly and welcoming and made up for the rude \"welcome\". Unfortunately-he also checked us out, and his attitude was equally sullen then also. I will try not to take it personally.", "Date": "September 13, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Paris, Texas", "Title": "“Right off Las Ramblas and Very Convenient”", "Author": "TheDarsts", "ReviewID": "UR79143152", "Content": "We walked right past the very un-assuming entrance the first time. It's kind of tucked away depending on the direction you're coming from. Within a block of Las Ramblas, the location is perfect, especially at this price. FYI for travelers, there is a Metro stop on Las Ramblas very nearby, it's the Liceu stop in case you're interested. The room was very clean, almost sterile it seemed. Very white and crisp. Room size was very comfortable for the 2 of us. The free wifi was very convenient and we enjoyed our stay very much!", "Date": "September 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cambridge", "Title": "“Great mid-range hotel”", "Author": "yrjs2", "ReviewID": "UR78930048", "Content": "We stayed at this hotel for three nights in September 2010. Everything was very new and clean. For the price range, the rooms were spacious and they were very tastefully decorated. The bathrooms were equally clean, well equipped and spacious with a good large shower. It was a great location, just off the Rambla and within walking distance of most of the major sites. My only minor quibble would be with the receptionist, who kept getting distracted while checking us in and dealing with other things. As breakfast was not included in the price of the room, I am not able to review that.", "Date": "September 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ballinamallard", "Title": "“Great hotel, perfect location, very helpful staff. A real gem!.”", "Author": "MerciBeaucoup", "ReviewID": "UR77875265", "Content": "We stayed at this hotel last December. We were surprised how great the hotel was considering the price and the central location. it was very quiet despite being just off Las Ramblas. The staff were very helpful, the hotel itself is modern, very comfortable and very clean. Thoroughly enjoyed our stay and will return this year.", "Date": "September 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Raglan", "Title": "“Handy to everything”", "Author": "Ragdad", "ReviewID": "UR77166394", "Content": "Good service and very close to the market, Ramblas and Metro. Friendly and helpful staff with good English. Great breakfast selection, but avoid milk coffee from machine as made from sweet milk powder.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bishops Stortford, Herts", "Title": "“An absolute gem. Recommended to any City Breakers”", "Author": "Best_Gillybear", "ReviewID": "UR76954810", "Content": "I booked this for us and our friends after reading a few reviews. Not only was the hotel exceptionally good value for money (best rate was actually booking direct with the hotel and obtaining an extra 15% discount through them), but this is one of the best city centre hotels I've stayed in for a long while. Admittedly the rooms aren't huge, but they are perfectly acceptable. Some have wet rooms and some bathrooms. The complimentary set in the bathroom was very good and included things like travel tissues, anti-perspirant, nail file, etc etc. Free safes and fridge in the room were very welcome. The hotel is quiet, totally secure, very well air conditioned, staff very helpful (a city map is given to you on arrival) and does a good breakfast for around £8 all in. Will definitely come again.", "Date": "August 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "sofia", "Title": "“amazing location,perfect and very helpful staffs,clean,safety,more secure”", "Author": "genetix", "ReviewID": "UR74755906", "Content": "I stayed fro 31th of july to 4th of august at Hesperia Ramblas,Barcelona.The hotel location is heart of La ramblas.It is very close to Placa de Catalunya,picasso museum, sea,shopping centers I mean everywhere.We stayed at room,404.the room is amazing,very clean,staffs are very helpfull,clean,more secure from lots of places.I definetly suggest this hotel to stay.The important point we have booked this hotel on february.The cost is very cheap.", "Date": "August 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Scottsdale, Arizona", "Title": "“Great Location, Modern, Great Staff and Comfortable”", "Author": "aoc613", "ReviewID": "UR74184109", "Content": "Coming from a fair hotel in Madrid to Barcelona we were very surprised by this great little hotel. It has a great location right off the main street Las Ramblas, but still quiet in the room. Yes the room was definitely small, but it was modern, the bathroom was a good size and the bed was very comfortable. The front desk staff were friendly. The free WiFi was awesome! We didn't get the breakfast option so can't comment on the food. But I would definitely recommend this hotel and it has a great price as well!", "Date": "August 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Munich, Germany", "Title": "“Great place to stay nearby to all locations”", "Author": "oobodoo", "ReviewID": "UR73145955", "Content": "Very clean and stylish hotel in a sidearm of the vivid Las Ramblas, Barcelona's esplanade. New rooms with nice design and new bathroom. Everything looked nice and new. The room was small but this is usual for Spain. We had a large dresser we could put our clothes as there was not enough space to place the suitcases in the room. There is also a safe big enough to store and charge your notebook as there was a power plug inside. Free wireless and very important: quiet rooms! We have ordered a quiet room and got one to a back alley. Close by to all the sightseeing spots in the old town district and to the subway station. There is breakfast available but we haven't used it as there is plenty of patiseries around to start with a coffee and some sweet pastries into the morning. Service was ok and friendly. We were able to check-in at 11 AM. I would highly recommend to stay there as everything was better than expected and required.", "Date": "July 31, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hull, England", "Title": "“Ultra modern and supremely clean hotel in fantastic location!!!”", "Author": "koggyboy", "ReviewID": "UR72902739", "Content": "Had read the glowing reviews on this hotel and was not disappointed when we arrived. Just off la Ramblas down Hospital St, the exterior is glass and cream stone with a really modern look. Good security, you have to press buzzer to let you in (security man in background at night). When you walk in, it's so quiet and peaceful, long reception desk and easy check in, staff were polite. Good lifts that arrived quickly at all times of day and night. Rooms are ultra modern again and so clean, the whole hotel is almost sterile, I've never stayed in anywhere so pristine. The rooms are ultra modern again, with a massive bed and crisp white linen. The decor and curtains are lovely and modern, the floor is a grey resin sort of floor that matches the modern decor, so don't be expecting a plush carpet! There is a double sliding wardrobe and shelving that contains an easy to use free safe and also a good sized fridge that contains the mini bar at very reasonable prices, but if you're stingy like us, you can put your own stuff in there. There are two white bedside tables and a matching larger one opposite with a big mirror above. There is a flat screen TV on the wall. The bathroom is excellent with quality white modern fittings set in a cream stone, a good sized mirror and excellent lighting. There are some nice touches like an extendable mirror, hairdryer and lots of toiletries and bits and pieces like nail file and shoe shine, in fact I've had lesser things in some four star hotels I've stayed in. Lots of white towels. There isn't a bath but the shower makes up for it, it's so big you could could fit three people in it and easily the best shower I've ever come across. Fab air con as well. The whole place has a tranquil vibe about it and considering it's location, we didn't hear anything and slept like babies all the time we were there. Will be the only place we'll stay now as it's such good value for money and would definitely recommend. If you haven't been to Barcelona before, getting around the place is so easy. Don't get a taxi from the aiport as they can be very costly. Come out of the aiport , go left and walk to the Aerobus stop. It's 5 euros to Plaza Catalunya, the big square at the top of La Ramblas. It announces the stops in different languages so you know exactly where you are. About 30 mins on the bus, get off and walk straight down La Ramblas and Hospital St is on the right, a good walk down. Coming back, go to the square again and get a Terminal 1 or 2 bus and they run approx every ten mins. The open top bus is a great way of seeing the city, it has red, green and blue routes and you just hop on and off as you please. You can spend all day on this if you wanted and it costs 22 euros or 29 for a two day ticket. It's so worth it as there is so much to see and it's a brilliant way of seeing it all. The whole system is so well organised and you hardly wait anytime for the next bus to come along. Shopping is fantastic and so are the many restaurants and bars, all serving quality food. The market off La Ramblas is so colourful and vibrant and you can buy ready prepared fruit and freshly squeezed juices which are great after nights out. At the other end of La Ramblas is the harbour area with a shopping plaza and great seafood and Tapas places overlooking the harbour. A colourful and vibrant, bustling city with great architecture, will be rushing back soon!", "Date": "July 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Lovely hotel in central location”", "Author": "jonnytekno", "ReviewID": "UR72589514", "Content": "Can't fault this hotel. Excellent value, very clean and well presented and in a great location. It's just off La Rambla, which is a tourist mecca, but is central to everything else. The rooms are very nicely air conditoned, quiet and very dark when the curtains are shut. Free wi-fi is awesome.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Nice quiet hotel near everything.”", "Author": "mooresf", "ReviewID": "UR71417432", "Content": "Great location right off of Las Ramblas. You forget about the city the second you step into the hotel. Las Ramblas is just steps away. A farmers market is to the rear of the hotel which was a great place to grab breakfast. The rooms were tiny, but clean. The hotel staff was extremely helpful. If you are looking for a quiet clean no frills hotel in the middle of everything, this hotel is perfect for you.", "Date": "July 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Clean Hotel in Central Location...”", "Author": "McGAussie", "ReviewID": "UR70878044", "Content": "This is a great little hotel if you like things modern, minimalist and clean in a central location. One block from Las Ramblas and Mercat de la Boqueria with only a 15 minute stroll to either St Jaume Square, the harbour or Placa de Catalunya (where the 3 Hop On Hop Off bus routes depart from). We heard no traffic noise nor noisy neighbours (inside or outside the hotel). Our room was exactly like the hotel’s photo advertising. Our double bed was the usual 2 singles pushed together but they each had large, firm mattresses with feather pillows and crisp white sheets. The room was well lit and the window opened plus had good sized block-out curtains. The air-conditioning was a little noisy but it certainly cooled the room. A mini-bar and safe were hidden in the wardrobe but no iron or ironing board. The bathroom still looked fresh and new, however, my husband was unable to wet shave in the basin as it was too small with no plug (take your electric shaver). The small hair-dryer had only one setting and was fine for a \"quick blow-dry and go” rather than styling. Towels were large but no face washer was supplied. Lovely “emergency” toiletries were provided including a nail file, roll-on deodorant, shoe shine, etc but no toothbrush or toothpaste. And if you don’t like combined liquid shower soap/shampoo then bring your own too. We didn’t partake the hotel’s breakfast, but the subterranean breakfast room looked very nice. PC with internet use was available for a small charge or wifi for free. The staff are multilingual and helpful. I would recommend this hotel to most travellers.", "Date": "July 14, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“Excellent stay.”", "Author": "compassnorth", "ReviewID": "UR70858388", "Content": "As a lover of the Spanish culture and all things spanish, I had always dreamt of visiting Barcelona and this was a great experience for me. The hotel was in a perfect location within the city, with everything very close by and great transport links. The rooms were not big, but in a city centre hotel you do not expect that, and they were very nicely done up and very clean. The reception were really helpful in giving directions and tips on where to eat and I really enjoyed my whole stay and have no complaints. The local tapas were out of this world and Barcelona was every bit as fantastic as I had hoped it would be.", "Date": "July 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "irl", "Title": "“very very good”", "Author": "byrnemx", "ReviewID": "UR70074936", "Content": "we checked in at 1am, no problem. very clean and very quite considering its right in the middle of town. rooms are very modern and stylish. a great stay. we stayed 4 nights. excellent.", "Date": "July 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Good location, friendly & helpful staff. would definitely stay again”", "Author": "chunkyl42", "ReviewID": "UR69923636", "Content": "We arrived early on Saturday and were provided with a quiet room immediately. Rooms are small but clean and neat, all basic items included, safe, fridge, shampoo, etc. Hotel was just off Las Ramblas down a side street which was relatively safe even at 11pm or so. La Boqueria is directly behind the hotel, less than a 2 minute walk up the alley. Front desk clerks were very helpful and a security guard is posted late at night, access to the hotel is restricted fairly well, so you dont feel like anyone can just walk in. We would definitely give this hotel another chance.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Perth, WA", "Title": "“Safe, Secure, Quiet, Friendly, Central and Practical”", "Author": "Sooty016", "ReviewID": "UR69832986", "Content": "We stayed here in mid May 2010, and for the price we paid, I don't think we would have been able to find anything as clean and functional in quite such an ideal location. The decor of this place is modern and funky and the rooms are simple, clean and functional. Breakfast was OK, although being only a stones throw away from the markets and gothic quarter, we found a number of more 'cost effective options' elsewhere. The staff are friendly and genuinely helpful, and possibly the most important feature of this hotel is its security. Even as we waited for our taxi on the last morning, the staff were constantly keeping an eye out for us and our belongings. However, as everyone else has commented, the location of this hotel is possibly its best feature! Although the little back street it is located on is a little dingy, the hotel basically backs on to the markets and is a one minute walk from Las Ramblas and the Gothic Quarter and is central to the Metro (ride at your own risk!) and public transport. Despite its close proximity to the nightlife, once you decide to settle in for the night, the rooms are completely quiet! On our second night, Barcelona had won their league soccer finals and Las Ramblas was packed with soccer celebrations. Despite finding ourselves on the wrong side of the mall, and having a little difficulty making our way through the crowds, riot police etc and back to the hotel, we were pleasantly surprised to find that once safely inside, we didnt' hear a thing for the rest of the night. We would definately recommend this hotel to anyone looking for a clean, secure and functional hotel in the centre of Barcelona.", "Date": "July 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London", "Title": "“Very simple and basic hotel, excelent location but the street it is on was very smelly and dirty”", "Author": "lau950", "ReviewID": "UR68001835", "Content": "I found this hotel to be too expensive for the quality it was. Yes it was very quiet and clean but so simple and the room and bathroom very small. Also not located on a very pleasent side street. However if you just want somewhere to sleep after your days out in barcelona and you don't mind paying a little extra then this is a good hotel for you. Also felt very safe here as front doors to hotel only let you in once you ring door bell and front desk see you come in.", "Date": "June 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "North Bucks", "Title": "“Clean and well located - modern and efficient”", "Author": "grumpyguts", "ReviewID": "UR67503587", "Content": "We stayed at this hotel as a stopover before embarking on a cruise ship from the port. The hotel is located ideally for the trendy part of the city and is within walking distance of a whole host of different eating and nightlife attractions. We never felt threatened (three blokes travelling together) as some of the reviewers have commented. The hotel was very clean and efficient, with helpful staff and a great position, as above. There is no restaurant for an eveining meal on site, but when you take into account what is around the hotel, this is hardly a hardship. Breakfast is, however, served in the mornings below reception. I didn't think this was particularly fantastic value, but that is mor a function of a weak pound than the hotel being expensive. I would recommend this hotel as a great place from which to explore the best bits of the town.", "Date": "June 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bethesda, Maryland", "Title": "“Good location, Quiet”", "Author": "RobertTheRed", "ReviewID": "UR67281722", "Content": "Comfortable rooms, a little spare on the furniture (bed, table/desk, one chair). Very quiet, especially less than a block from La Ramblas -- probably because it is new construction with modern windows. Didn't eat the breakfast there -- always got food at the Boqueria market one block due north -- but if you need food early, then the market isn't good since nothing is open until 8-ish. Very close to Liceu metro stop, which is a big plus. Free Wi-Fi (but signal is very weak in the x01 rooms, where you'll need a cable to plug into the wall outlet for Internet). Price was pretty decent for Barcelona, so I'd stay here again under similar circumstances.", "Date": "June 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston, MA", "Title": "“Location, location, location!”", "Author": "travelbug_Boston_09", "ReviewID": "UR66380067", "Content": "Great location one block off of La Ramblas in Barcelona. Steps away from the market, Gothic quarter and countless restaurants and shops. Rooms have a decidedly modern vibe and are very small but also very clean. Desk staff was friendly but not exceptional. Prices varied among various online booking sites and published rates in the hotel. Doing your homework may get you a better deal. Instead of the buffet breakfast head over to the market for some fresh fruit and pastries. If you are interested in doing the open air bus tour you can save 2 Euros by buying your tickets at the hotel.", "Date": "June 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zichron Jacob, Israel", "Title": "“Great hotel, the location is amazing”", "Author": "Sarit23", "ReviewID": "UR66281604", "Content": "We really enjoyd our stay in Hesperia. The hotel is designed beautifully and it is shown in every liitle detail and The service was very friendly and helpful. The location is unbelievably good. (The only thing that wasn't perfect was that there weren't really hot water in the shower, only lukewarm).", "Date": "June 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Essex, England", "Title": "“Bargain - great price for lovely hotel”", "Author": "Mistress_Yorkie", "ReviewID": "UR63824099", "Content": "I took my boyfriend to Barcelona for a surprise birthday trip in Jan 2010. As I was funding the trip for both of us I did have to keep an eye on budget, but as it was treat I wasn't quite prepared to slum it too much. This place was an absolute gem - reasonably priced, in a great location, and a really nice hotel too! The staff were great, the lady on reception who looks like Jessica Alba was so sweet and helpful, and the whole place is immaculately clean and surprisingly stylish, it more than exceeded my expectations. Location is great, close to the Ramblas and a Metro stop, but not too noisy. Would happily recommend to friends and other people considering it on tripadvisor.", "Date": "May 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Harrogate UK", "Title": "“Excellent location!”", "Author": "Bruntysnr", "ReviewID": "UR62941472", "Content": "We stayed in the Hesperia Ramblas 25-29 April.The hotel in new and in an excellent location, just of La Rambla. All was spotless. We had a bath with shower over, which was powerful. Our room overlooked the side alley which leads into the Broqueria market but there was no noise. The air-con works a treat and you can have the window (door length) open if you want. The towels were a generous size and were changed every day.The bed was huge and comfortable. The reception staff were fluent English speakers and were very friendly. We bought our 2 day 'tourista' bus information pack there which gives a good discount when you buy the tickets at the bus stop (plus other discount vouchers) We also got our postcard stamps at reception. We did not have breakfast there as we slept so well from walking everywhere, that we got up too late! The Broqueria market does lovely fruit smoothies and doghnuts. Most shops stay open till 9pm. Getting to the hotel was really easy. We caught the Aerobus (E5 each) from the airport. This drops you off at Placa de Catalunya. La Rambla is just off this square and the hotel is a 10 minute walk at the most on the right hand side. Eating and drinking is expensive, especially on La Rambla, so we often went to the Carrefour supermarket for bread/cheese/ham and bottled water. Watch out for pickpockets. I kept my cross shoulder bag firmly in front of me, as did most tourists. All streets and alleys were very well lit. There seemed to be plenty of police and civil guards around. A lovely city to visit. Would go again and use this hotel!", "Date": "May 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Yorkshire", "Title": "“Lovely hotel”", "Author": "Ossycat", "ReviewID": "UR62736030", "Content": "We have just returned from the Hesperia Ramblas on the 21st April - this was a four day break but due to the 'volcanic ash' we had to stay an extra seven days. The bedrooms are clean and bed linen is changed every day there was a wet room shower in the bathroom not a pokey little shower you get in most hotels. We had the buffet breakfast for 4 days and found this to be excellent value. The hotel is very near La Ramblas and easy access to most amenities. The reception staff are very knowledgeable and gave us great advise on how to get to places via metro and railway and supplying us with maps - travel by metro it is excellent. I would especially like to thank the two men on reception in allowing us to use telephone and internet access when we were trying to get home via rail and coach nothing was too much trouble for them. So if you intend to visit Barcelona you will not go far wrong if you stay at the Hesperia Ramblas. If you want a good tapas go to Taller de Tapas on Pl Sant Josep Oriol - few minutes from hotel", "Date": "April 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“perfect”", "Author": "pussycatdogs", "ReviewID": "UR61649189", "Content": "it's an excellent hotel.good location. our room was clean.", "Date": "April 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bangalore", "Title": "“Good hotel in beautiful city”", "Author": "gobabu", "ReviewID": "UR58899143", "Content": "Barcelona is bautiful city I have ever visited. In this beautiful city, this is very good hotel I feel. Please check other reviews as well.", "Date": "March 18, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Ekero, Sweden", "Title": "“Good value”", "Author": "ovler", "ReviewID": "UR57325387", "Content": "Perfect location, friendly staff and the room looked exactly like the photos on the hotel's web-site!!!! This is what a three-star hotel should be. I would rate 3+", "Date": "February 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Coventry", "Title": "“Superior Ramblas”", "Author": "Kalel23", "ReviewID": "UR57154185", "Content": "I spent a lot of time searching through hotels and after much deliberation, settled on the Hesperia Ramblas, relying on reviews submitted on TripAdvisor. It proved to be a great choice. We stayed for 3 nights in the last week of February paying £78, £74, and £64. Firstly, the location is supreme. We caught the Aerobus directly from the airport (El Prat) which drops you off by the Hard Rock Café. The hotel was just a short 10 minute walk from there. Admittedly we did catch a taxi from drop-off point to hotel just for convenience but in retrospect, was not necessary. The hotel is situated on one of the roads leading off la Ramblas – you could not be better placed. We were a 5 minute walk from the port and virtually on la Ramblas. Catalunya Plaza was a 5 minute walk. The nearest metro station is just 1 minute away! Although close to the action, we were just far enough away to enjoy a peaceful night. The immediate area is quiet but well lit and safe enough. The hotel itself is clean and well presented. Check in was quick and easy. The rooms were just as shown in the pictures and were immaculate. They were spacious, stylishly decorated and cleaned everyday. Bathroom again was large and very clean. As others have mentioned, the shower is very powerful - almost like having a massage (which is the perfect tonic after a long day of sight-seeing). We thought that the bed was comfortable and afforded us a good night’s rest. The hotel staff were brilliant. All spoke clear English, were knowledgeable and extremely receptive to our questions. Offered great directions and suggestions of places to go according to what we were looking for. You have to be buzzed through the main doors, but this was never a problem. We were never kept waiting and most of the time they seemed to almost pre-empt our arrival! They also kept hold of our luggage on the last day with no fuss as were weren’t flying out till the evening. Of course the hotel has no restaurant or bar or any other facilities for that matter, but then, you just don’t need them being so close to la Ramblas. Everything that you need is just a stone’s throw away. Ultimately it is the perfect base from which to explore the beautiful city and to recharge your batteries for the next day of adventure.", "Date": "February 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Fantastic, cant wait to go back.”", "Author": "CLUK", "ReviewID": "UR55092686", "Content": "I stayed at Hesperia Ramblas for two nights; I’m 25 and visited Barcelona with my parents both 54 and sister 24 On arrival we were extremely pleased the hotel it was modern, clean and the reception we were given was very pleasant. The rooms were spotless, sheets were amazing and bathroom had a really powerful shower. Breakfast was 12Euros each which we thought was expensive but as the hotel is in such a fantastic location you aren’t far from cafés. We ate in Café de L’Opera for both mornings. We went to a real Spanish Tapas restaurant called Bar Celta, the restaurant is really basic but the atmosphere was great and the food was delicious. we walked everywhere, but i would recommend both the blue and red bus routes, and Gaudi’s cathedral is incredible I can’t wait to go back to Barcelona with my boyfriend and I will defiantly be staying at the Hesperia Ramblas.", "Date": "February 3, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Dublin", "Title": "“Very Disappointing”", "Author": "DPMCG_9", "ReviewID": "UR52598257", "Content": "Have just returned from a two night stay at Hisperia Ramblas and was very disappointed to say the least. We paid €278 ($400) for the two nights and felt that we would have had the same amenities in a youth hostel. On our arrival the bathroom sink had black hairs in it, there were no covers on the pillows and no english language TV channels. We were informed that the laundry had not returned pillow cases that day and that the wind had blown the satellite dish out of place! All weekend there was only one staff at reception and we were told on Saturday evening that the chambermaid might go onto the roof to try to fix satellite dish, as there were no maintenance staff working during holiday periods!!! Needless to say ... this didn't happen. The rooms are very sparsely furnished and the bathroom toiletries are a joke. There are tea/coffee making facilities at reception but you must pay for these. Overall very bad value for money and a bit of a \"Fawlty Towers\" experience.", "Date": "January 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, England", "Title": "“Excellent location, spotlessly clean”", "Author": "dwnw3", "ReviewID": "UR52439140", "Content": "Ansolutely no complaints about this hotel, although not on the nicest of side streets, the hotel is in a perfectly safe location and less than a minutes walk once you turn off La Rambla. The room and bathroom were spacious, well maintained, immaculately clean; it all looked almost new. Front desk staff were friendly & helpful. We did not have breakfast at the hotel but can highly recommend Forn Del Pi coffee shop at Hospital 40, they also have another branch at Ferran 12; very good for breakfast, lunch, a snack or just a pick-me up of a pastry and a hot drink.", "Date": "January 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Grecia", "Title": "“Perfect in everything”", "Author": "Griegos", "ReviewID": "UR51983050", "Content": "It is an excellent hotel in a great location next to everything.It is more than a 3 star hotel and the staff is really helpfull, speaking english and they provide you with useful information material.The hotel is clean and the rooms are very cozy and good decorated .We recommend it to everyone !!", "Date": "December 28, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Hesperia”", "Author": "VandaT", "ReviewID": "UR51285405", "Content": "Great! But without breakfast, what it's not a problem indeed because you could find nice places at nice prices for your breakfast, near to the hotel. Is really close to Las Ramblas and in the top of El Raval barrio (safely and calm).", "Date": "December 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“Lovely Hotel”", "Author": "dandd888", "ReviewID": "UR49393561", "Content": "This hotel is very centrally located. It's modern and fresh decor is very pleasing. Staff were always happy to help and were fluent in what seemed to be endless amounts of languages. The only bad point was the room was very warm and the AC was only for heat for some reason so if you don't mind sleeping with the window open that's fine. Noise wasn't a problem.", "Date": "November 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "new orleans, la", "Title": "“great choice”", "Author": "darhines", "ReviewID": "UR49182214", "Content": "Just returned from 4 days in Barcelona. This hotel is centrally located just off Las Ramblas, the rooms are small but comfortable. Staff is friendly and helpful.Only drawback is they turned the A/C off to the entire hotel and you could only get heat. It wasn't quite time of the year for NO air, but we made due with opening windows, although the street noise was a distraction. There are plenty of tapas bars and breakfast location on Las Ramblas, so no need for a taxi. I recommend the Bus Turistica, hop on/ hop off open air buses for viewing the city. Get the two day pass discount at the hotel and enjoy the bus. Plenty of sights to see and lots to do. Don't miss Park Guell, it is fabulous!", "Date": "November 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Austrtalia", "Title": "“not possible to go wrong with this hotel”", "Author": "petesh", "ReviewID": "UR48812832", "Content": "The other reviews say it all. great location, lovely rooms, friendly staff. we are on our way back to Australia following a cruise and booked into this hotel based on reviews and were definitely not dissappointed. to exchange currency if staying in this area change your money at the hotel. they charge 4% if you change it on las ramblas expect to pay 18%.", "Date": "November 9, 2009"}], "HotelInfo": {"Name": "Hesperia Ramblas", "HotelURL": "/ShowUserReviews-g187497-d1450932-Reviews-Hesperia_Ramblas-Barcelona_Catalonia.html", "Price": "$140 - $253*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">C/ L'Hospital, 26</span>, <span class=\"locality\"><span property=\"v:postal-code\">08001</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "1450932", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/af/fa/affa69551843e3c125fdd144dc0dccbe5large.jpg"}}