{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“San Diego is fantastic, but don't stay here”", "Author": "KUrquie", "ReviewID": "UR126008866", "Content": "The room was was dirty - my feet were filthy after coming out the shower and walking on the carpet, the blinds above the bed were thick with dust, the cooker didn't work - although I wouldn't have used it even if it did, there was no safe and we were on the ground floor facing onto the main street and the lock didn't feel very secure, there was no air conditioning so we asked for a fan. We did get one, but we were told only to have one electrical appliance in use at a time which we found laughable, the staff weren't particularly helpful or interested in us and didn't appear to know the local area (we asked for some advice on tourist attractions but other than give me a leaflet and a map, the staff were no help). I was completely unimpressed with this place - it was right on the beach, but even the beach wasn't that nice - there are much nicer beaches in San Diego. All in all, I loved San Diego. We were only there for a few nights but had a fab time despite our nasty sleeping conditions. My recommendation would be stay elsewhere folks.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "dallas", "Title": "“Great location”", "Author": "dianedallas", "ReviewID": "UR125242819", "Content": "We stayed here February 2012. This motel is nothing fancy but the location is perfect, right on the beach. Our room had a partial view of the ocean. The view of the ocean from the balcony outside our door was amazing! The room was clean, very basic, with a small refrigerator, microwave and coffeemaker. They gave us extra coffee, towels, etc. when we requested them. The bed was comfortable. The motel is within walking distance of many restaurants, many of them right on the beach. There is a coffee bar about a block away at Crystal Pier. However, parking is definately a problem. There are not enough parking spaces and the parking on the street fills up fast, especially on the weekend. We would definately stay here again. It is probably the most affordable place to stay on the beach.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Once was more than enough!”", "Author": "Gl0betr0tterAnnie", "ReviewID": "UR120086403", "Content": "Stayed here for 2 nights on a girl's USA roadtrip and can honestly say this is one of the worst places I have ever stayed. We stayed in a one bedroom 'suite' which was on the ground floor right next to the reception. The room was pretty large to be fair however it was in a word FILTHY! The whole place smelled mouldy and the dust was about an inch thick on the window blinds. The wardrobes in the bedroom were also very smelly and mouldy needless to say we never bothered to unpack. The outdoor area was rather untidy and the tables and chairs were old and dirty. We asked reception to borrow an iron and the one they gave us was covered in burnt in black stuff so we ended up chosing to wear our clothed creased rather than use it. When we returned the iron the lady had the cheek to look at the burnt stuff then at us in disgust!!!! The only thing going for this place is the location which is right on the beach but when you see the other hotels and guesthouses surrounding the Pacific View Motel then it just magnifies exactly how bad this place is. NEVER again!", "Date": "November 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "los Angeles", "Title": "“Strategic location at great value”", "Author": "GiovanniDaVerrazzano", "ReviewID": "UR118761908", "Content": "It's not a luxurius stay (you could probably imagine that..it's a motel) but it's perfectly located between Pacific Beach crystal pier (actually on the waterfront) and Garnet avenue, one of the main clusters of SD night life. Rooms are big enough to spend the night, shower and change with comfort. Nothing fancy but clean and at a good price. We paid about $100 for one night, which didn't include parking nor breakfast. Note if you want view on the ocean the price rises to about $170. I would def stay here again!", "Date": "September 29, 2011"}, {"Ratings": {"Location": "5", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Budget accommodation in a great location!”", "Author": "Amigos186402", "ReviewID": "UR118040433", "Content": "We recently stayed at this hotel for three nights. The location is fantastic but sadly the accomodation was lacking. We had a partial view room but the majority of the view was blocked by an overgrown tree! The accomodation was clean and well laid out but very basic. There is no air con, phone or cable tv (of the 12 channels available only 8 worked!). There was also no iron or ironing board, hair dryer or safe. We also had an odd incident when one of the staff just let themselves in our room while we were in there and made up some strange story about checking the carpet!! But, it is the cheapest hotel in this location and there is parking... well for another $20 per night! Also, be aware if you stop here there are lots of odd rules to abide by like keeping your usage of electrical items to a minimum!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Relaxing Gettaway”", "Author": "Monique061710", "ReviewID": "UR116026708", "Content": "It was a spur the moment trip stayed on a sunday-monday and the price wasnt too bad, staff was friendly, room was clean and comfortable, everything smelled fine and was clean, chose a non view room on the top floor but we still had somewhat of a view, slept with the windows open and listened to the ocean all night. A LOT restaurants/bars were within walking distance Motel was right on the beach Will be staying here for future trips Highly Recommend", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fresno, California", "Title": "“Blast from the Past”", "Author": "Cedar240", "ReviewID": "UR112059690", "Content": "I received a personal tour of most of the rooms when I visited San Diego...New carpets, freshly painted walls, spotless and clean...OK it is not the Ritz but if you want a confortable room right on the Ocean this is the best bargain in the area...Friendly staff, Laura was wonderful, very friendly, patient, kind, and a over all dream...Just think you are staying at grandma's...narrow entries into the baths, older fixtures, older TV's but heck your at the beach who is going to be in their room except to sleep...Some rooms have kitchenettes and some rooms have a full kitchen with a regualr size fridge!!!!!!!! Plus less trips to the store to get your favorite beverage...There is an outdoor area right outside your room to sit and watch the people go by and enjoy your favorite beverage...and to look out and see the ocean...", "Date": "June 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Best Value, Best View, Best Vacation”", "Author": "VCRRTraingal", "ReviewID": "UR74621469", "Content": "If you are looking for a place right on the beach, this is it. We were so impressed with this hotel. They even provide you with a parking space...at the beach. The employees were all friendly and attentive. This is definitely the last of its kind on the beach. PLEASE don't ever let them tear it down. Granted our room was small and sparse but who cares? We heard the ocean all night and we just had to walk out the front door to the beach. The sheets and towels are clean and there was plenty of room for us to keep our bikes in our room with us. There are a lot of great but inexpensive restaurants all around you and we felt totally comfortable everywhere we went. We will never stay anywhere else when we go to San Diego again.", "Date": "August 10, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Portland or", "Title": "“Great Location - Dirty and run down”", "Author": "badbarn9", "ReviewID": "UR45845572", "Content": "My first room (3 night stay) had patches of carpet cut out and replaced with other chunks, which did not necessarily match. I opened a drawer, thinking I'd do some unpacking and found an \"extra large roach trap\" in the drawer. Got a different room, which did have a nice view of the ocean and a little patio out front. Roomj was slightly better than the first, but still dirty and run down. Stayed there 3 nights and liked the area. The young woman at the desk was great. Always happy and smiling. By the way, the 9am-5pm are flexible. Sometimes, they leave home at 9am and start cutting out about 4 if nothing is going on.", "Date": "October 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Phoenix, AZ", "Title": "“Nice friendly place, right on the beach”", "Author": "jryan16", "ReviewID": "UR33675846", "Content": "I came down from Phoenix for a 3-day weekend with ASU friends. The hotel staff were friendly and organized 2 rooms right next to each other with an ocean view. The hotel is older-style but quite charming and in the perfect location. We had a fun time.", "Date": "July 1, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Calgary, Canada", "Title": "“Good value, spoiled by June Gloom”", "Author": "Tactic13", "ReviewID": "UR32127425", "Content": "I don't want to rag on this place too much because it is great value for the Pacific Beach area and the cheapest place to stay directly on the beach. However, people should know what they are getting into. They are self described as a vintage establishment. What this means is that everything about your room will be antiquated and slightly run down. You don't realize how great cable TV and a phone in your room is until you stay somewhere like this. We had three channels, which was fine but for the price we should have had cable. The location is a blessing and a curse. It is walking distance to countless bars and resturaunts and stumbling distance to the beach. This unfortunately makes for a very noisy night with paper thin walls and windows open (no ac at least when I was there). I had four nights booked and they made me pay in advance with a zero refund policy so I kind of had the feeling they knew they were putting one over on me. Lots of wierd policys. There were also people living in the motel. If there had been good weather on the beach it would have been perfect. However, I unwisely came during June Gloom so the crumby motel was not worth it in my case. It is clean though.", "Date": "June 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "JBSanDiego", "Title": "“Great Place for a Family on A Budget, Oceanfront Motel”", "Author": "JBSanDiego", "ReviewID": "UR31084012", "Content": "We checked in to the Pacific View on a Thursday. The front desk was very busy, but the girl working was very polite and helpful. She even printed us out directions from the hotel to our various destinations in San Diego. Also, she recommended several places to eat, shop (all within walking distance). The service was very good for such a small, mom'n'pop type motel. The room was OK. There was nothing particularly special about it. Be forewarned there is no air conditioning, no pool, no cable (they're still using rabbit ears!), and if the parking is sold out for the day, you have to hunt for a space. A nice touch was that the room did have a mini fridge and a booklet, explaining what the rules were/numbers for security maintenance, etc, and place to eat/things to do. We stayed for 3 days and the housekeeping staff was also very nice, they cleaned our room everyday and made our bed with fresh sheets each day. The location was the absolute best! It was on the boardwalk, between Tower 23 and Pacific Terrace. Our room had a gorgeous view of Crystal Pier/The Pacific Ocean. We parked our car the first day and only used it when we went to Sea World. We walked to the beach, shopping, and dining. For the nice, helpful staff and the excellent location, I'll give the Pacific View 4 stars.", "Date": "May 29, 2009"}], "HotelInfo": {"Name": "Pacific View Motel", "HotelURL": "/ShowUserReviews-g60750-d1451746-Reviews-Pacific_View_Motel-San_Diego_California.html", "Price": "0", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">610 Emerald St.</span>, <span class=\"locality\"><span property=\"v:locality\">San Diego</span>, <span property=\"v:region\">CA</span></span> </span> </span> </address>", "HotelID": "1451746", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/c0/34/95/pacific-view-motel-thumbnail.jpg"}}