{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“Ripped Off”", "Author": "johncourt82", "ReviewID": "UR120158943", "Content": "On basis of a Lonely Planet recommendation, we had booked 3 nights at this hotel on arriving from UK. After a long tiring flight we arrived at the hotel only to realise immediately that, despite us having a wedge of confirmatory e-mails, there appeared to be a problem with our booking. The \"friendly\" (according to LP) Mr Chan was most evasive and asked us to wait while he sorted something out. After an hour of waiting and a non-appearance on Chan's part, we were still no nearer to either getting a room or having an explanation as to what the problem was. His wife during this period was positively rude. After an hour, I popped out to see what else might be available in the area but this proved to be difficult as conferences and exhibitions taking place in HK meant that short notice accommodation was at a premium - so we were stuck with Mr Chan. A further hour and a lot of hassle later, we finally got Mrs Chan to agree to providing a room - Mr Chan had disappeared totally from the scene. Although the incredibly rude Mrs Chan made an awful room available, it had to be for 3 nights at a total cost of HK$2500. We realised that this, in the light of their published room rates, was a total rip-off but, in the circumstances - hot, tired and burdened with luggage - we had no option but to accept. However, we were so disenchanted with the whole situation that we checked out the following day and moved to a much nicer and much cheaper hotel - there was no offer of a refund of the cost of the 2 nights unused accommodation. We accepted this\"write-off\" as we were so pleased to get out of the place. We feel that this was a deliberate rip-off on the Chan's part and that we needed to let Trip Advisor members know about this - we are writing also to Lonely Planet to ask them to review their recommendation of this hotel and also to the Hong Kong Tourist Board who have registered this hotel. So, please be warned.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hong Kong, China", "Title": "“good for price / quality in hong kong”", "Author": "steven852", "ReviewID": "UR119775700", "Content": "I ve stayed here several times, but always just for a night or two on the way to europe or to get a visa.The rooms are tiny, but clean, and safe. The location in Tsim Sha Tsui is good; but yes, nothing fancy. The rooms are spread out over different flats; some rooms even have an outside window, but most don t. But at 200 dollar a night, in hong kong that is cheap. Big people with lot of luggage might not fit into some rooms.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Oaxaca, Mexico", "Title": "“Okay for my purposes”", "Author": "espinalc", "ReviewID": "UR117308623", "Content": "I only went to Hong Kong to get a visa processed for Mainland China so it served my purposes, but I wouldn't recommend this play for longer term stay for rooms may be too small and uncomfortable. The room was definitely clean. I stayed in a single room which was the smallest room I have ever slept in!!! But the upsides were: air conditioning, a television, and decent service. There is a lady who speaks fluent English who can help with communicating with the folks who actually own the place. Someone cleaned my room every day and everyone there was flexible. I would definitely recommend this place for people who need a couple of nights and want to be in the middle of the center of Hong Kong.", "Date": "August 27, 2011"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“Do NOT stay at this hotel the price trippeled from we booked till we showed up!”", "Author": "S N", "ReviewID": "UR116883774", "Content": "We booked this hotel online, provided our credit card details and had a confirmation back from Mr Chan (Steve) who is the manager. The confirmation listed 200 HK$, buit when we show up after a looog flight. There are no rooms available and when Mr Chang is phoned he claims that the price is now 600HK$!!!", "Date": "August 18, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manila, Philippines", "Title": "“Good value for money, but crappy receptionist.”", "Author": "suzy100804", "ReviewID": "UR71013047", "Content": "There's no doubt about it, Man Hing Lung is a great hostel and travelers on a budget would definitely appreciate the low room rates. The room and the bathroom were clean, and they give fresh towels upon request. Also, the private bathroom is pretty decent for a hostel. Dont expect a five star room though. The typical HK hostel room is very small. A warning: beware of the rude receptionist. When we got there, we were greeted by a cranky, disrespectful, discriminatory, and unaccommodating receptionist. She was rude, and most probably, if we didnt make a prior deposit/reservation, she would not have accommodated us. However, the real owners of Man Hing Lung were very nice when we rode with them at the elevator. Its probably just the female receptionist who was rude. All in all, I would recommend staying here if you could get past the rude receptionist. If its any consolation, you would see her only during the first and last day of your stay in Hong Kong. However, the Mirador Mansion is not known for its very secure rooms. So before you leave your hostel, be sure to lock your doors.", "Date": "July 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mandaue, Philippines", "Title": "“man hing lung hotel...comfortable and accomodating owners”", "Author": "docmarilyn", "ReviewID": "UR68276907", "Content": "My family had a great time staying in man hing lung hotel located in mirador mansion which has tight security and fairly clean. We met a wonderful chinese owner named inti and her son in law..they are very accomodating and helpful during our stay.they have cheaper rooms compared to other famous hotell and hostels in mirador mansion.we thank them for being so personal in helping us when we needed it most..INTI! thanks so much and your son In law,you know you are our savior!.we also met lourdes, filipina cook staying with them for 6 years and testified when we asked her that her employers are good in character.for pinoys and others who are looking for a good stay in hongkong try this hostel!they have as low as 200hk and up room rate accomodations depending on your comfort and budget… best regards to our new friend inti! thanks for everything! we will definitely recommend and we will stay again in your place!see you !", "Date": "June 22, 2010"}], "HotelInfo": {"Name": "Man Hing Lung Hotel", "HotelURL": "/ShowUserReviews-g294217-d1454189-Reviews-Man_Hing_Lung_Hotel-Hong_Kong.html", "Price": "0", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Flat F2 14/F, Mirador Mansion, 58 Nathan Rd., Tsim Sha Tsui</span>, <span class=\"locality\"><span property=\"v:locality\">Hong Kong</span></span>, <span class=\"country-name\" property=\"v:country-name\">China</span> </span></span></address>", "HotelID": "1454189", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/bc/c0/39/man-hing-lung-hotel-thumbnail.jpg"}}