{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London,UK", "Title": "“Fab Location, Boutique Hotel”", "Author": "Michellekblondon", "ReviewID": "UR139890949", "Content": "The standard room was lovely with a tiny balcony overlooking the square. The room was a good size for Europe and the bed really comfortable. You can easily walk to the main attractions and there are a good number of tapas bars in the vicinity.", "Date": "September 10, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Francisco, California", "Title": "“Great location, friendly staff and nice amenities”", "Author": "delfinazul", "ReviewID": "UR139695195", "Content": "We booked a business room in this hotel for the first and last night of our 2 week trip around Spain. It really exceeded our expectations with a wonderful location, extremely professional and friendly staff, an extensive and delicious breakfast and super comfortable beds and pillows. You can't beat the location! It's close to everything and you walk out and immediately have options for tapas, wine, live music, really nice ambiance. The staff was very helpful with directions, calling cabs, exchanging $ for Euros, you name it. Breakfast was included and we were satisfied with the buffet: great coffee/ tea selections, yogurts, cheeses, cold cuts, breads, fruits and made to order eggs. I love the Europpean style breakfast and this one didn't disappoint. The king size bed and pillows are wonderful...they might seems too hard (bed) and too soft (pillow) but I had a great night sleep. There's a spa and workout room in the basement which looked very clean and relaxing, but I didn't have a chance to use it. Wifi is free and there's a minibar, iron in the room. Room size was good enough for a couple with two large suitcases and a carryon, remember it's Europe. The decor is modern contemporary which was nicely done, but yes some of the art pieces might need a little getting used to...not a big deal as some reviews allude to. Overall fantastic hotel, definitely would stay here next time we're in Madrid.", "Date": "September 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“Good hotel, great location”", "Author": "Ingeborg D", "ReviewID": "UR139495118", "Content": "This hotel offers very good service, large and comfortable rooms with excellent beds. The breakfast is far better than average. However, the best thing for me is the location. I have stayed while on business, returning to the hotel in the evening. Then I appreciate to be able to go for a walk in a very pittoresque part of the city. The only negative bit is that since this hotel is quite trendy, some rooms are painted in dark colours. Not always the best solution.", "Date": "September 5, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Nice hotel in central madrid.”", "Author": "TugaatLondon", "ReviewID": "UR139325789", "Content": "Excelent location, with nice staff and pretty decent rooms... The radisson style but on a smaller spanish hotel. The room has everything you need, with free wifi, nespresso machine, big bed, etc.... The wallpaper is a bit weird, but you get used to it. Outside a lot of bars for some tapas and wines (or beers). Walking distance to Puertas del Sol and all other attractions.", "Date": "September 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Excellent location”", "Author": "Omar N", "ReviewID": "UR138666410", "Content": "I think the Radiddon Madrid has the best possible location, right between three museums and within walking distance to the Plaza Major still it is an average hotel. I booked a business class room for 1 night during my stop over. the interior is a bit gloomy. i have to admit though the amenties were up to standard with nice staff, and eventhough there are two coffee shops on the street below with some people playing music, the soundproofing is great. couldnt hear a thing. the worst part of the hotel are the pillows!!! i had to put 4 on top of each other for me to sleep. my head just seemed to sink into it. I have read reviews with similar comments but i never expected it to be that bad. The Radisson is a perfect place to explore the city. Just get your own pillow with you,", "Date": "August 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Amazing location, average hotel.”", "Author": "MPLSKevin", "ReviewID": "UR138513551", "Content": "I stayed here for a week while on vacation in Madrid. The hotel is in an amazing location, across the street from the Prado and the Real Jardin Botanico. The hotel is on a (very small) square, where several cafes offer outdoor seating. There are easily a hundred different restaurants inside of a 10 minute walk, and all the major sights are within a 20 minute walk. I stayed in a corner suite, which was quite large, including a second bathroom, and separate sitting and eating areas. The bed was a little hard, and the bedding not terribly comfortable. The bathroom was large, with a separate walk-in rainfall shower and jacuzzi tub. The hotel staff are very friendly, helpful, and knowledgeable, offering solid advice and where to eat and when to go. There is a small restaurant inside the hotel, which has a very nice breakfast. Sadly, the breakfast is only offered until 10:30 am. I would definitely stay here again, and for the price, recommend the hotel to anyone else as well.", "Date": "August 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bandar Seri Begawan, Brunei Darussalam", "Title": "“Fantastic Hotel, Fantastic Location!!”", "Author": "PeterFeran", "ReviewID": "UR138471316", "Content": "If you ever go to Madrid then you must stay at this fantastic hotel. A small boutique hotel in an an old heritage listed building in a fantastic location, only minutes from Plaza Mayor. The hotel and rooms have a modern new design with all of the facilities that you expect from a a 5 star hotel. Great beds, lCD TV's, FREE wireless internet and excellent bathrooms with rain showers!The hotel has a great little bar and restaurant if you want to dine in or right out the front door is a beautiful terrace with several cafes and bars where you relax and enjoy some Tapas and local fine wine!! All of the staff that we encountered were extremely friendly and professional, delivering excellent customer service at all times. Look forward to coming back on our next visit to Madrid.", "Date": "August 26, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Really exceptional service”", "Author": "Ria T", "ReviewID": "UR138259607", "Content": "Knowledgeable and courteous staff, always looking to help. Fabulous breakfast buffet, great complimentary coffee. Rooms were clean and ours had a great view of the plaza below. Walkable to almost everything we wanted to do in Madrid. Pillows were a bit over fluffy for my taste, but other than that, no issues. They even had a cute pool/spa area where you could take a dip and relax. Would definitely stay here again.", "Date": "August 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“excellent location excellent hotel”", "Author": "vans406", "ReviewID": "UR138233271", "Content": "Nice rooms clean...great value... Breakfast was alright.. Excellent outdoor patio area in front to chill and have drinks..great location... Walking distance from all the tourist sights. Staff spoke English and were very friendly", "Date": "August 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Wonderfull experience !!!”", "Author": "loulougag", "ReviewID": "UR137247780", "Content": "The Radisson Blu is little, lovely, well design, nice and quiet hotel. Very much my taste. The location is perfect (museums, El Retiro park) ! There is a good ambiance the moment you walk in and a warm welcoming. The decor of the room is well done, the comfort is great and the bathroom awesome ! I couldn't ask better to go to the Spa after a long hot day of walking, little oasis. I don't want to forget the most important, the staff !! Thanks to Mohammed and Pablo for their professionalism, discretion, they were very helpful and they made the difference. L'opportunité de communiquer en français avec eux était un ultra plus !!! I wish I could stay longer...Je recommande cet hôtel boutique sans hésitation, une belle expérience !!!", "Date": "August 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Nice!”", "Author": "Deflumine", "ReviewID": "UR136869709", "Content": "we had a very good corner room - spacious Obviously this hotel is new However, you need a university degree to understand the lightswitches in the room Some small issues we had, but they were dealt with immediately by very professional staff Sadly the food and beverages on the terrace are not as good as the next door terrace, but more expensive if you want churros and good coffee, the terrace outside is the place, not in the hotel the bedlinnen is great, the pillows are crap", "Date": "August 11, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Budapest", "Title": "“Good location, average room”", "Author": "ejenet", "ReviewID": "UR136581472", "Content": "The hotel has perfect location (though our taxi driver could not find it even though he gave it three tries), everything is very close (Prado - 2 min, subway stop - 5 min, Puerta del Sol - 6-8 min). In our room it was 28C degree when we arrived and even 2 hours later it was the same. We had to change room where the AC was properly working. The staff was friendly and the room was very clean. The size of the room is the smallest I have ever been to in a Radisson.", "Date": "August 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "atlanta", "Title": "“Comfortable Boutique Hotel”", "Author": "RFSAtlanta", "ReviewID": "UR135985204", "Content": "This is not your typical Radisson. It has only about 50 rooms on four floors. The top two floors house executive rooms (no lounge), where I stayed for four nights. It faces a small square with a few outdoor cafes (good food). The hotel is completely updated - everything is very modern, very nice bathroom (but no tub, just an excellent shower). Excellent soundproof windows. A very nice breakfast comes with the executive rooms (otherwise 15 euros cold, 19 euros hot). Free in-room internet. Good neighborhood near Prado. 15-20 minute walk to old city (Plaza Mayor). The staff is pleasant and helpful. I would definitely stay here again.", "Date": "August 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Super hotel”", "Author": "DalzielD", "ReviewID": "UR135906101", "Content": "I am fussy. I like a good breakfast, a comfortable bed, a good location, and friendly welcoming staff. The Radisson Blu Madrid was excellent on all these areas. Opposite the Prado, next to Atocha, in a fantastic area full of bars and restaurants, and in one of the most interesting areas in the centre of Madrid. Loved it.", "Date": "July 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami Beach, Florida", "Title": "“GEM IN MADRID”", "Author": "maria b", "ReviewID": "UR135889608", "Content": "Excellent location with an excellent staff in a refurbished charming building. The rooms although small were wonderful. The bed was magnificent and the bathroom splendid. It reminded me of the Dream hotel in New York city. The staff who speak perfect English as well as other languages was comparable to a five star hotel. If you are into walking you can go anywhere from this hotel. Literally five feet from your doorstep you can enjoy people watching while sipping on anything and eating tapas. Just great.", "Date": "July 31, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“Perfect Location, Beautiful Rooms”", "Author": "ElizabethandCraig", "ReviewID": "UR135459007", "Content": "This hotel was in the perfect location as it is directly ascross from the the Prado Museum and a quick walk to the Plaza Mayor. If you are there on Sunday, grab a latte from the cafe right outside the hotel and take a stroll to the Rastro Market. Everynight we walked to Plaza Mayor and enjoyed the culture, restaurants, and nightlife. The rooms were very, very spacious for EU rooms. The bathroom itself is larger than most rooms in New York. The room was very clean and very art deco, if you care about such ammenities. The price was very reasonable and I would return. The only negative, if you have rented a vehicle, parking is close, but not cheap, approximately $40 USD, a day.", "Date": "July 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Friendly”", "Author": "Kevin_UK84", "ReviewID": "UR134180942", "Content": "We were my husband and I with some friends hosted for 15 days there. Treatment of the staff should be classified excellent. Very good. Especially the waitress from the terrace: some, like a girl very young and sweet (Zaida was her name), can say that they had a pleasantly exquisite service... friendly, very attentive, helpful, very friendly, fantastic... hopefully always ourselves staff as well where want to go...By its staff deserve 5 stars and 7 by the waitress in question who enjoys her work and some others that we also attended... We would like kitchen hours would be more comprehensive and there is more variety in the buffet. Hotel we can say that you disenchanted us the room which was very small. We also had problems with the shower and the last day with the air conditioning. In spite of that, we will return to the Radisson of Madrid. Thanks", "Date": "July 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“City Smooth Welcome”", "Author": "Thewark", "ReviewID": "UR133986388", "Content": "We stayed for five nights B&B in the second week of May. The hotel is wonderfully situated for Prado, Retiro Gardens, Botanical Garden, Reina Sofia and the west end, with short pleasant strolls to all of them. The hotel exits onto a small civilized plaza with a selection of nearby eating and drinking places and is urban and smart. There are nearby convenient short bus rides to other major parts of the city. Traffic noise is negligible and good windows keep out normal street noise. The reception area is cool and sophisticated and the courteous staff responded very well to polite communication, being pleasantly helpful to non-Spanish speakers. The lifts came quickly. Our room was clean, cool, quiet and very comfortable (except the night Atletico fans besieged the neighbourhood in some wildly significant football victory ... Oye Oye Oye!). The generous and varied breakfast is served in restful modern surroundings with good light ambience. You may safely ignore any reviewers that complain of a long walk to serve themselves - the breakfast is indeed spread over three rooms but is no more spread out than in many single restaurant rooms elsewhere. (Also ignore weird reviews that complain that the only natural light come from the windows - where else did they expect it to come from?) We ate dinner once - it was served in a very friendly and professional way and was excellently prepared albeit from a slightly restricted menu, which is why we ate out on other nights. We did not use the spa so cannot comment.", "Date": "July 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tallinn, Estonia", "Title": "“Radisson at it's best in very good location”", "Author": "Kai R", "ReviewID": "UR133740023", "Content": "This hotel was one of the best I have stayed in Spain. One of the reasons why I felt like at home may be that I am used to stay in Radisson BLU hotels (mostly in Scandinavia) and even though they might not be as exiting as some boutique hotels, you may be sure about overall quality and standards in Radisson hotels. Standard room was large enough, with sitting corner, work desk and very nice and clean bathroom. I liked the Nespresso coffee machine as I need first coffee immediately after waking up. In addition there are also water kettle, minisafe and terry slippers. On the basement floor the hotel has small pool area which may attract children. Our room was on 4th (and the last) floor and therefore had smaller windows than other floors. Despite the fact that room window was facing busy square the windows were absolutely soundproof – we didn’t even hear the street construction works which started early in the morning. Also the door and walls were so soundproof that we basically felt like alone in this hotel (which definitely was not the case). In Radisson I love the fact that they also have international TV channels, so we were able to follow the news etc. Location of the hotel is perfect for visiting the main Madrid museums; Prado museum is just across the street and also everything else is within walking distance (main railway station Atocha, old city, Sol square etc). Our package didn’t include breakfast and as it is quite pricey in Radisson hotels (21 EUR) we had the breakfast out hotel. There are 3 cafes right in the front of hotel and countless amounts of restaurants and cafes in neighbourhood, nearest Starbucks 300 m from hotel. You can easily get to the hotel from airport by Renfe local Train C1, which leaves Airport T4 after evey half an hour and takes you to Atocha in 25 minutes. Hotel is within walking distance from Atocha (appr 400 m). Wifi was working smoothly, we got all the assistance needed (were able to use computer and print out the boarding passes), so I don’t have absolutely nothing negative to say about the hotel. Good location, excellent conditions, flawless service.", "Date": "July 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Shoeburyness, United Kingdom", "Title": "“Excellent business stay”", "Author": "Neil R", "ReviewID": "UR132860309", "Content": "My second time at this hotel. Comfortable (business class) room, excellent location within walking distance of all the best locations. Would not hesitate to stay again.", "Date": "June 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Church Stretton, United Kingdom", "Title": "“Superb location for the main art galleries”", "Author": "PBushell", "ReviewID": "UR132080146", "Content": "I had a room on the 4th floor overlooking Calle de Moratin which was excellent. Sound proofing kept all the noise away, which might be a problem at the front of the hotel which is on a very busy main road. Room was a small double, but nicely fitted out and well maintained. Breakfast was a decent continental buffet. Front desk service was excellent - very helpful. The hotel does have a few quirks - the lifts are very slow responding and the doors take so long to open you begin to worry they are stuck, but you get used to it. Decoration is very dark as others have commented, but I thought it suited the building. Main advantage of this hotel is its location. You are a walk across the road from the Prado and the Royal Botanical Gardens. 10 Minutes from the Reina Sofia and the Thyssen-Bornemisza. I'd recommend walking up through the back-streets to the area around Plaza de Santa Ana, both to get a feel for old Madrid and for finding restaurants - they is an abundance of cafe's and bars in this area and they are for the locals rather than aimed at tourists.", "Date": "June 16, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "London", "Title": "“Horrible experience as Gold Carlson member”", "Author": "kawoh", "ReviewID": "UR131657334", "Content": "Recently achieved Gold Carlson status and was nothing short of shock about this property and the great reviews. Received and upgrade to effectively a windowless room there were windows but whited out overlooking a tiny back roof area. So much for an upgrade considering u need to do 25+ nights per year. Mediocre hotel, wifi didn't work for whole stay, front desk are paid off by taxi driver mafia also taxi driver had 10 eur on meeter before I even got it... Vs 2.20 which it shld have been. No steam room has stated, stained carpets and stained sofa with some bodily liquid on it, front desk promised robes for pool area which never came, pool area has tiles falling off, overall poor hotel with poor maintainence, do not treat elites well at all, and some serious health and safety concern and cleaning in room. Never again so Many better choices in Madrid", "Date": "June 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Great Hotel!”", "Author": "ccandyy", "ReviewID": "UR130961766", "Content": "Loved the decor. Very charming, artist, and modern. We loved our little balcony. Very good location. Excellent service. Would definitely stay here again.", "Date": "May 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Moncton, Canada", "Title": "“Nice hotel in great location”", "Author": "Maddy52", "ReviewID": "UR130761627", "Content": "We liked our stay here very much. We stayed one night and found this hotel to have a very warm and welcoming staff. The location could not be better as we had only 24 hours in Madrid and wanted to see the Prado and Thyssen Museums. We also took advantage of the hop on and hop off bus tours of Madrid. All were only steps from the hotel. The hotel is super clean and offers very good value for the money. If I had to say one thing slightly critical I think it would be that the decor/ designer didnt quite get it right. To me good design is practical. I was not taken with the black decor, nor the inefficieny of the bathroom. There is nowhere to put anything such as a kit, or hair dryer yet there is space that could have been put to this use. But these are minor things. The hotel is in a lovely old building and in the middle of a very busy area yet it was quiet and we had a great nights sleep.", "Date": "May 28, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Quezon City, Philippines", "Title": "“Good location, nice view from Balcony”", "Author": "Tricia S", "ReviewID": "UR130487122", "Content": "We (3 adults, 2 small children) stayed for 3 nights at Radisson Blu Madrid Prado. We ate at the nearby Burger King. We rode on the Hop-On Hop-Off bus just across the street (at Prado Museum). We walked to the nearby Atocha-Renfe station to ride the train. Cristina at the hotel reception was very nice. She even upgraded our 2 rooms to business rooms which had a balcony. The children were very excited about the view. Rooms were a little small. Wi-Fi was good. Shower area at bathroom was spacious.", "Date": "May 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Complaints Seem Petty”", "Author": "Bmac1011", "ReviewID": "UR130476509", "Content": "I realize that each person has different expectations for what a hotel should provide but I am honestly stunned at some of the negative reviews this hotel is receiving. We stayed here for a week in May and got exactly what we were looking for -- EXCELLENT service and a location that cannot be beat. The hotel is right across the street from the Prado and a straight shot up to Plaza Mayor - so that was perfect. The room was much like many European hotel rooms - a bit smallish but extremely clean. People saying that they had no room to put their bags must have been bringing in several steamer trunks full of clothes because my wife and I always overpack and we had absolutely no problem with room. We both had large suitcases (filled to the brim - 23kg exactly!!) - a backpack each that were jammed with shoes and other clothes - as well as another carry on -- and everything fit in the room without incident. The \"rain\" shower was very nice although for the life of me I will never understand why Europeans do not have doors that go all the way across their showers - the 1/2 door tends to allow the floor to get wet. I have seen several complaints about the internet -- we used it all week long with no problems. I have also seen people having issues on here about the air conditioning - while it was (for me) too hot where they have it set - all you have to do is call down to the desk and they will lower it. It still was a little warm for me and they happily lowered it again. I cannot speak to the breakfast or restaurant because we did not eat there - nor do I know why someone would eat at the hotel when there are so many amazing choices around the city. I also cannot speak to the spa because we never even saw it while we were there. My biggest problem with what I have read on here is people complaining about the service - No one being at the front desk - people being unfriendly - and service taking too long to react. I literally had the complete opposite experience.. There was someone at the front desk when we came down early in the morning for our plane, there was someone there when we came late at night after a tapas crawl - there was someone there every time we walked into the hotel. We had several different people help us with directions, suggestions and were always greeted with a smile and a hello. We had one minor incident where the light in the closet was out - fixed by the time we got back in the room. We asked for ice - 5 minutes and they were at out door. When we left each morning - we asked for our water bottle to be filled with ice - each day the host at the restaurant filled it with a smile on his face. One thing -- people have said that it was hard to find for cabbies - during our trip we had three different cabs take us to the hotel -- one got us to the doorstep and the other two got us \"in the vicinity\" - so there is some truth to it although I do not understand why to be honest. Overall -- this rooms are very modern and nice - not huge but definitely big enough - the staff is very helpful - and the location simply cannot be beat. I would recommend this hotel to anyone.", "Date": "May 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Portsmouth, United Kingdom", "Title": "“Great location”", "Author": "Wilma S", "ReviewID": "UR130229912", "Content": "My husband and I stayed here for three nights in May. We stayed 2 nights and then returned the night before our departure flight for a further night. The first thing I noticed when I entered the hotel was the wide doorway. Then it all became dark and black. I was not sure if the walls were black or if they were mirrors. Most of the foyer was the same. Too dark. I could not find reception at first. Check-in was slow but at the time this was not a problem. We had reserved a business room and were given a room on the second floor with a balcony overlooking a lovely square near the Prado. However, natural light was only provided by the window from the small balcony. It took me ages to find the main light switch for all the lights. The room had a long hall opening to the bed area. There was no place to put suitcases except on the floor in the hallway. The bed seemed to take up the whole room. There were photographic murals on two walls making the room appear even smaller. The bathroom had a large walk in shower with rain shower effect. There was no space for toiletries etc., for two people. I felt there was a lot of wasted space in the bathroom that could have been used to extend the sink unit. There was no place to hang the bath mat once used, so it was left on the floor. On the plus side we were provided with bathrobes, slippers and the room did have a Nespresso machine and an electric kettle, and the was an ample stock of tea coffee etc. When I found there was no hairdryer I phoned reception and one was immediately brought up to the room. The usual business room desk had been replaced by a round table. The bedside tables were also mix and match round tables with no drawers. There was no place to put clothing for a long stay apart from the wardrobe and a couple of drawers in the cupboard. Good internet. Large flat screen TV provided but there was only BBC World and CNN in English. We found the pillows were too soft. The breakfast room was pleasant though lacking in atmosphere. The breakfast offered was cold and fully self-service. We learned later that a cooked breakfast was available to order. The food and beverages were in another room. It was a bit of a walk. The only real advantage of staying here was the location and proximity to the Prado Museum and the other museums in the area. The Atocha railway station is a 15 minute walk away. There appeared to be good transport links in the area. Lots of tapas bars and cafés too. On our return visit we requested a different room but we were given the same room as on our initial stay. Check out on both occasions was a bit slow, but the staff were friendly and sympathetic and I must say thank you to the staff for printing my boarding pass. As for Radisson Blu hotels we would think twice before staying in them again as we have had varying experiences with the chain.", "Date": "May 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "manhattan beach ca", "Title": "“Great location and nice/modern hotel”", "Author": "ailee", "ReviewID": "UR130140698", "Content": "We booked a large room, it was basically a one bedroom suite with a jacuzzi tub. So didn't have the room size issues of others. The location is fabulous. It is an easy walk from the train station, even with luggage, and the neighborhood is fabulous -- right across the street from the Prado. We found a good restaurant a few blocks away and there were lots of other bar and restaurant options. Easy walk to Reina Sofia and we were able to buy \"hop on/hop off\" tour bus tickets at a little shop around the corner and board the bus near Reina Sofia, so it was easy to get around to other sites in the city. The staff was not quite as helpful or proficient in English as the hotel staff we found in Barcelona, but they were pleasant enough. Breakfast was included and it was a decent buffet. The bed was very comfortable and the modern design of the room was very functional and nice.", "Date": "May 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“great location, small room”", "Author": "VicSu", "ReviewID": "UR129889483", "Content": "As some of the reviewers have mentioned, this hotel is in walking distance of the Prado and the train station. Very convenient, but the main downside for me was the room's size and lack of English TV channels. This was my first trip to Madrid, so I am not sure if rooms are this small in general. On the plus side, there was unlimited Wi-Fi, which was great to have since other locations have expensive Wi-Fi rates.", "Date": "May 13, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Sleek but poorly managed hotel”", "Author": "MaxLondon1976", "ReviewID": "UR129662397", "Content": "That was my 2nd exposure to Radisson BLU hotels in April. After a disappointing experience in Brussels, I had higher hopes for their Madrid venue, as Spanish hotels are generally more upbeat in terms of design and athmosphere. The hotel's location is great - virtually across from Museo del Prado and 7 min walk from Plaza Santa Ana teeming with tapacerias and bars. The lobby is small, but very design-conscious. My room was also quite pleasant with a big B&W image of Madrid across the wall, great bathroom, though slightly oddly shaped. Where this hotel really disappoints is service. Check-in process took 10 minutes by most optimistic estimates. Supposedly free Wi-Fi was out of order and was not working for 2 days when I stayed at this hotel. At check-out they had a trainee who didn't know how to operate the system and could hardly speak a word of English. There were black-outs in their satellite TV service. When you think of this kind of hotel - guys, you've done many things right - location, design, comfort - find a proper adminstrator who will set up the service, otherwise all the investments are worthless", "Date": "May 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "NJ", "Title": "“Incredible location for first time visitor”", "Author": "xkaay", "ReviewID": "UR129533198", "Content": "My husband and I stayed here end of April into may. It was our first time in Madrid and it was the perfect base. We hadn't had time to plan our trip thoroughly so was unaware of airport shuttle for 5 euro per person which stops at plaza de cibeles (it's a 5 minute walk on flat, relatively wide street alongside the prado museum). We took a cab when we arrived and it was about $35 (the cabbies usually dont speak english sobmake sure to know the st, or have a map and point to it). On the way back we used the shuttle. It's worth it if you ate solo or couple traveler on a semi budget like ourselves. The hotel is essentially across the st from the prado museum but there is a building in between the main st and the hotel which I found to help is muffling the traffic noise a bit. If u walk up hill away from the prado there are many many eateries, cafes and such. The lobby of the hotel leaves much to be desired... Hardly a lobby, just a front desk really, but we found the staff to be helpful and welcoming. They were well informed about ways to get around and eager to help with reservations etc. it rained while we were in Madrid and they do have large complimentary umbrellas to use fyi. We had a standard room but found it to be just the right siZe considering it's the cheapest room. Good enough storage and good sized flat screen and I found the bed to be wonderfully comfortable and lots of fluffy pillows. All in all, it doesn't come with a lot of frills (I speak for standard room) but still a winner for its location and friendly staff.", "Date": "May 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Truro, United Kingdom", "Title": "“\"Definitely Style Over Content\"”", "Author": "Featchy", "ReviewID": "UR128577395", "Content": "We stayed 3 nights (April 21 to 24,2012) and chose a Business Class Room which was very comfortable and quiet, but overall was pricey at nearly 600 euros. Found the pillows far too soft but informed no choice available which was hugely suprising for a 4* hotel. Breakfast just OK, cooked was available but not made clear, and staff did not ask if you wanted...you had to tell them ! No service from the lone member of staff, it was up to you to get everything, it would have been nice to have been offered coffee at your table !. After a very busy day we decided to eat in their restaurant on our last night...Big Mistake ! ,main meal of meat just about passable but desert cake still frozen. Would highly recommend Elheco Bar opposite. Interior of hotel very dark and you really have to be careful. Spa was OK but had to request steam room switched on and the door seal was poor meaning big heat loss which spoiled the moment. Overall, the location is great, 85% of staff helpful and polite, but food nowhere near 4* standard..sorry Radisson Blu but we would not stay with you again and certainly not recommend.", "Date": "April 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Nice small, quiet, and comfortable hotel on pleasant little plaza”", "Author": "travelersdepot", "ReviewID": "UR128431368", "Content": "I selected the Raddison Blu because in studying the map I saw that it was very close to the must-see Prado and a park where tulips were in bloom during Easter week 2012. Our cab-driver did not find it easily so it is important to have the address written down, especially if arriving from the airport.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Moscow", "Title": "“NEVER EVER AGAIN”", "Author": "Olga B", "ReviewID": "UR128393234", "Content": "We stayed in the hotel during April 17-April 21,2012 and was very disappointed. -Internet did not work during 3 days. Stuff offered us a check-in computer which is very very strange because of information safety reasons. -SPA did not work -We requested 2 separate beds in our room but the stuff said that they had only 1 room in the whole hotel with 2 separate beds and it was already occupied -ANTS IN THE BATHROOM!!!!!!!!! -we had troubles with a room key almost every day When we requested for some compliment because of all these problems the stuff answer was very very rude. Sometimes there was a stuff who almost did not speak english. So NEVER EVER EVER EVER AGAIN to this hotel and chain.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Munich", "Title": "“By Far the Worst Radisson Experience Ever”", "Author": "cehada", "ReviewID": "UR128351611", "Content": "My husband and I stayed in Radisson Blu Hotel Prado in Madrid between April 15th and April 19th (4 nights). This has not been a good experience, at all. Below I summarized the reasons: 1) During check-in we were given a room (Room 414) by the reception. We went to the room. After a few tries to open the door with our key cards, somebody from inside responded and asked what we were trying to do. This person was actually the guest who was staying in that room at that time. We apologized and returned to reception and explained what happened. Following a few sorry sentences we were sent to another room. 2) We were given the Room 114. In the evening we realized that there were insects (ants) in the bathroom. Next day (16th of April) we informed the cleaning lady. She talked to reception and they changed our room, saying that they would “toxicate” the room to get rid of the ants. So, we moved to Room 408. 3) There were ants in the bathroom of Room 408, as well. But this time we did not change the room because we believed that that would not help. We only informed the reception about the ants. 4) During our stay we could only use the internet for the first day. From the morning of our second day until the time of our check-out, there was no internet service within the hotel. We contacted the reception several times to learn when the service would be back. We were given all sorts of answers and solutions that did not help anything. At the end, we haven´t had the WiFi service during 4 of our 5 days stay. 5) As a solution to internet problem, reception gave us a card for a so-called “business center” (a small cell with 1 computer and 1 printer; so small that 2 persons at the same time cannot fit.) But, there was no internet connection available at this computer, either. Another person in the reception told that they already knew that there was no internet in this “business center”. So what did they give us that card for?? 6) At some point the reception staff offered us their own computers at the check-in desk, which we rejected immediately. Letting the guests have access to check-in desk computers, which store private information of all the hotel guests, is very dangerous and unacceptable. 7) During check-out they tried to charge us a Perrier from the minibar which we did not drink. We told that we did not drink anything from the minibar. They said that maybe the person before us drank and they charged us by mistake and asked us to sign a document that we acknowledge the hotel wouldn´t charge for that drink. We haven´t signed that document. 8) I would also highlight the low quality of the furnitures in the rooms and bad smell in the hallways. 9) We also noticed that the hotel staff is inexperienced and thus incompetent. 10) At the end we paid the whole amount although we haven´t received the service quality we paid and expected. I would not recommend this hotel to anyone.The location is good. So if you go are going to Madrid, please find another hotel in this area. We stayed in several Radisson Hotels throughout Europe before, if they are Radissons then this hotel in Madrid cannot be a Radisson.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St Petersburg", "Title": "“Lovely boutique hotel with prime location”", "Author": "U1traviolet", "ReviewID": "UR128335296", "Content": "Very beautiful designer hotel in the centre of Madrid. Famous Prado museum is just across the street, all the sightseeings within walk distance. Room is nice, bed is cozy and staff is very helpful. We had breakfast included in rate and it was good, wide variety of cold cuts, fruits and pastry but no hot dishes. If you expect hot American buffet you probably won't like it but for us it was totally fine. The only negative point I have is that WI FI didn't work and it was rather a disappointment. Otherwise recommended!", "Date": "April 22, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "San Diego", "Title": "“Looks are deceiving”", "Author": "Sameer R", "ReviewID": "UR128002103", "Content": "We should have known that we were bound for disappointment upon our arrival at Madrid. First, the car service that picked us up significantly overcharged us for the trip to the hotel to the airport. The irony is that I had called the hotel the day before, requesting car service recommendation, and they suggested this service. Yet, when I informed the Radisson's check in staff, they feigned ignorance, noting that this is not the car service that they use. We subsequently asked to speak with the manager and were told that she would be available in 30 minutes. We requested that she visit our room vs. call as our infant son planned to sleep. Naturally, the 'manager' called our room 1 hour later, waking our son up, and she had the gall to suggest that it was our fault for using the wrong car service. And, the hotel would accept no responsibility nor provide recompense. She was completely unapologetic. When pressed, I learned that she was not the actual manager of the hotel, and I was able to speak with the GM of the hotel. He, conversely, was quite helpful, switching us from our business class room to a suite and noting that he and his front staff person, Pablo, would comp the car and provide complementary transportation to MAD for our flight back to the states. Unfortunately, he did not communicate the complementary taxi to his front staff as upon checkout, they noted that we would be paying for the ride. It took another 15 minutes to get the GM on the phone to advise his staff, so we were happy to leave the Radisson at that point. The only redeeming qualities of this hotel are twofold: Its location across the street from the Prado and the coffehouse/cafe directly across the street. If you can afford it, pay extra and stay at the Westin Palace up the street.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“Very good hotel near all museums (across from Prado)”", "Author": "SeattleShanu", "ReviewID": "UR127887056", "Content": "This hotel is in a wonderfully quiet neighbourhood and we were able to walk to all major museums in the area. Slew of \"new concept affordable\" dinning opton are within walking distance. Even all touristy plazas r easily reached.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Edinburgh, UK", "Title": "“Avoid at all costs; the web pictures are utterly misleading”", "Author": "Scotscouple99", "ReviewID": "UR127864416", "Content": "This hotel is a major disappointment. It is overpriced, badly managed and has very little to offer other than a central location, especially for the Prado. We paid for a ‘standard’ room. This meant that we had a tiny room with a window that was facing the hotel skylight. You could not swing a cat! The bathroom was adequate and the rain shower good. The free internet facility was also welcome. The spa is tiny and sympathetic but terribly filthy. The men’s changing area did not seem to have been cleaned for days and the toilets were terribly smelly. The ‘swimming pool’ is really a plunge pool attached to the steam room, which never seemed to work. The hotel is seriously understaffed. The checking in and out experience is very slow as the result of this and the breakfast experience very but very slow and disorganised. We discovered only during the last day of our stay that we could order things for the menu, as the buffet seemed to run out of food constantly and things were not replaced. The food choices were limited and the staff very aloof. Given the prices of the rooms the hotel is not to be recommended. The value for money is very poor and the experience disappointing. We found the web photos of the hotel very misleading. It is almost as if they were taken from anotherhotel…", "Date": "April 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Belgium", "Title": "“Trendy place in neighborhood of Prado”", "Author": "SvenDL", "ReviewID": "UR127066237", "Content": "Positive: quiet area, great breakfast, relaxing spa, nice stylish rooms, friendly service Can be improved: quality of beds, available parking space", "Date": "April 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "london", "Title": "“Suite was Sweet!”", "Author": "funseeka_1974", "ReviewID": "UR126972977", "Content": "Only stayed one night for business but was upgraded to the suite much to my colleagues annoyance. Very comfortable bed and big living space, powerful wet room shower was a delight after my flight but unfortunately didnt get to use the jacuzzi bath :( Very clean slick and modern hotel with friendly staff in a busy area with loads of tapas bars to chill out in. Cant fault it.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“Great location, great staff but so-so hotel”", "Author": "EmemBath", "ReviewID": "UR126833653", "Content": "We have just returned from staying 4 nights in room 309 at the Radisson Blu. First; we walked from Atocha Station along the Paseo del Prado and could have missed the hotel in the dark as it is quite unobtrusive. Although the address is Calle Mortain, the hotel faces onto a small plaza at the bottom of Huertas. Hotel found we were warmly greeted by the staff, who throughout our stay were friendly and helpful. Our room felt pretty cramped with nowhere to stow our cases but it was clean with a comfortable bed (Hence the 'so-so'). The tea and coffee-making facilities (including the Nespresso machine) being a welcome addition (although as the tea-bags were supplied by an American company - despite being labelled English Breakfast, produced a pretty weak and foul-tasting brew so hint to the Brits, take your own) . Our room had a small balcony which overlooked the aforementioned plaza. (Sorry I can't remember the name of it and can't find it on the online maps.) Given the proximity of the Paseo del Prado (a major road) the soundproofing was excellent. The breakfast was fine and the waitress happily obliged my husband's request for cooked items each morning (bacon, eggs, mushrooms etc). Only one small gripe, they apparently ran out of orange juice on the third morning, which considering we were in the heart of Spain was somewhat strange. (Hence the 'so-so'.) The 'fitness suite' consisted of a recumbent cycle, exercise bike and treadmill. I liked the changing lights and powerful jacuzzi jets in the pool but it's more like a giant hot-tub and not suitable for a swim. The steam room was cold and not steamy but that may have been because no-one seemed to be using it so they don't go to the expense of heating it. (Hence the 'so-so'.) Therefore travellers, you pay your money and take your choice. It is undoubtedly in the most fantastic location for the Prado, Thyssen-Bornemisza and Reina Sofia galleries, the Botanical gardens and Parque del Retiro, the station and all the other must-see's in Madrid. However, for this price you don't get perfection.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "ireland", "Title": "“hectic,fun weekend!”", "Author": "coleen10", "ReviewID": "UR126782284", "Content": "I am trying to think what i will say about the Radisson!!A boutique hotel in the most central position you could ask for!Small,a decor a little dark for my liking(dark grey)bedrooms good if not overly large,but you spend so little time in them in this marvelous city.Great pillows.missed having a bath but had a vg shower.We did find the airconditioning unit very noisy so turned it off and opened the window. Breakfast good,bar good but service poor.You could not ask for nicer or more helpful staff,really pleasant---congratulations to them all. Now ,the Spa/swimmimg pool area--so small,could just do 5-6 strokes in the pool,more a large Jacuzzi. Across the road is the Botanical Gaardens,also the Prado museum,to the left -5 mins the Thyssen,the other direction --Reina Sophia--great. Outside the Hotel ,two Tapas Bars-serving a good range--catering to most peoples taste. Would we stay here again,probably,on a/c of its position,missed having a lounge to chill out in. Aword of warning,all of the taxi drivers that we used had absolutely no idea of where the hotel was,ended up costing a small fortune driving around looking for said hotel!!and getting dropped off in the wrong spot.oneway to aiiirport € 40.00", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Niagara Falls, Canada", "Title": "“excellent location, very clean”", "Author": "CMKMJ", "ReviewID": "UR126609084", "Content": "Loved this hotel. We are a family of five. We had connecting rooms with a private hall to store our luggage. The rooms were very spacious. Everything was spotless. Excellent shower and comfortable bed. Quiet rooms. Lovely balcony. Buffet breakfast was included with room rate. It was a good value when travelling with three hungry teens. Staff friendly and helpful. Made a few bookings for us and all restaurant/ show recommendations were excellent.", "Date": "March 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“The best hotel of our Spanish leg”", "Author": "TheHoodedBanoonigan", "ReviewID": "UR126130575", "Content": "For art-buffs, the location doesn’t get better than this. Directly across the road from the Prado (truly outstanding), and an easy walk to the Thyssen or Reina Sofia, what more could you ask for? Well, you’re in luck, because the hotel is just a stone’s throw from Taberna Maceira, the gutsiest, most energetic tapas bar imaginable. If you stay at Radisson, eating and drinking at Maceira at least once is a must. For those after something less hectic, other solid eating options are available in close proximity, the perfect way to digest the day’s inundation of masterpieces. As if that wasn’t enough, Retiro Park is an enjoyable 10 minute walk in one direction, and the city centre 10 minutes in the other. In between all this, there’s a hotel to consider, and the Radisson exceeded our expectations. Put simply, the service was impeccable, consistently so, and far beyond anything we had experienced elsewhere in Spain. As an example, they not only booked day tours for us, they actually researched them as well! If today’s favours become tomorrow’s expectations, they’re going to be very busy. We stayed in a standard guestroom. I’d say the rooms were above average, without being exceptional – modern, clean, spacious, good sized tv, wifi, nice bathroom, plenty of space for suitcases, and a comfy bed. Everything you want as a tourist. The restaurant did a great burger when going to Maceira a third time seemed too indulgent, but I didn’t get a chance to lounge in the Whisky Bar, which was one of the reasons I chose this hotel. My wife grabbed an in-house massage whilst I hit the intriguing Reina Sofia; a classic win/win right there. The only complaint of our four-night stay was that the laundry service stained and/or tore a couple of my wife’s shirts which was annoying for a light-packer. Other than that inconvenience, staying here was an absolute pleasure from beginning to end, and we would most certainly choose the Radisson again on any future visit to Madrid. Highly recommended for any tourist, but a must for those doing the rounds of the big three museums.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Austin,TX", "Title": "“Love this hotel!”", "Author": "TravelingTexans2", "ReviewID": "UR126091546", "Content": "Perfect location (less than 10 min walk to train station or about 40 min from airport but right in town within walking distance to everything). Friendly staff, clean rooms, big shower, big comfortable king bed, small balconies that open, nice tv that even have speakers in the bathroom! Nice coffee maker. No complaints!", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent location”", "Author": "Familyabbott", "ReviewID": "UR125998234", "Content": "Loved every minute of staying in the hotel friendly staff 50% on food in the restaurant. Spa was good except I got a different treatment to the one I booked and pool a bit cool . Room was great", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NoVA", "Title": "“Unpretentious Elegance, and Unbeatable Location”", "Author": "Tourist416", "ReviewID": "UR125763064", "Content": "Located in Las Letras, this hotel is perfectly located for Prado, Reina Sofia, Thiessen, and Caixa Forum- each within a scant minute to 3 minutes walking. The Prado being directly across the street and the Caixa Forum essentially next door. Parque del Gran Retiro is a 5 minute walk. I arrived very late in the evening, and my room was upgraded upon arrival- a very pleasant surprise! I made my reservations through Booking.com which was seamless and easy. My room was well appointed, with an exceptionally comfortable bed and pillows. A Nespresso coffee maker provided free coffee and tea, which was a nicety. The bathroom was very nice- very modern, and had a fogless mirror. Hardly a need-to-have, but very cool. The shower was a rain-style shower head, with the ubiquitous hand-held unit as well. The hotel has a restaurant, lounge and bar. The latter two I used, but not the restaurant so cannot vouch for the food. But that was of little consequence to me as there are PLENTY of tapas bars, cafeterias, and cervecerias within seconds of the hotel. I spent my first two days here at the Prado Blu, then took the train from Atocha station (within sight of the hotel), to Sevilla. I liked this hotel so much that I booked it again on my return to Madrid a few days later. My initial intention was to experience other hotels but had such a pleasant time here, I booked it again without hesitation. This hotel, being in Las Letras, is not in the middle of the hot action and flurry of the Centro and Sol areas. But these are within about 10 minute walk or less if you decide to metro. love this hotel and would book here again without a second thought.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "hamburg", "Title": "“Good and bad”", "Author": "orish1", "ReviewID": "UR125281349", "Content": "Had within one week 2 stays in this hotel. The first stay for 2 nights I was happy to book a One-Bedroom-Suite for the price of a normal double room with kingsize bed. So we had a nice living room, a bedroom and a large bath icl. shower and bath and WC plus a second separate small rest room. The only bad in these days where, that the small restroom was smelling very bad like it was cleaned with a very old always wet and filthy cloth wipe. 2 days later we had a normal (small) double room and the bath also smells like described above. One time the cleaning lady entered our room without knocking/asking. The Spa/Gym is not really a Spa/Gym - it has 3 machines and a small warm pool plus 3 or 4 loungers for rest. There are already 2 rooms for treatments and massage. No reception at the Spa/Gym - just walk in. The location is very close to Atocha the train station and very close the center of madrid. The stuff is really friendly. The breakfast was good.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Helsingoer, Denmark", "Title": "“Great Location - disappointing details”", "Author": "Svegaard", "ReviewID": "UR124907461", "Content": "This hotel has a great location with short walking distance to the 3 major museums in Madrid. The atmosphere is not as cosy as you normally see at Radisson hotels. The Spa is small but fine, but the water was far too cold on 3 out of the 4 days we where there. We had booked 2 rooms but they turned out to be as far away from each other as they could (allthough on the same floor). One room had an extra door with lock which meant we had to call the room to get in touch with our children. This is just not good enough when you order rooms 2-3 months before the visit. One of the days the rooms wasn't maid when we returned at 5pm - again just not good enough.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Barcelona", "Title": "“great quality for value”", "Author": "Xuan", "ReviewID": "UR124877518", "Content": "good location next to major museums. cozy, modern, design and intimate business boutique hotel", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cheshire", "Title": "“Excellent”", "Author": "MDG534621", "ReviewID": "UR124358658", "Content": "I have stayed in the Radisson Blu, Prado on two occasions now. Both are during business trips but the Radisson made the stay comfortable and enjoyable in all aspects. I have stayed in Room 212 and Room 215 both business class rooms and equipped to a very high standard. The beds were lovely and comfortable, the furnishing in the room perfect for relaxing and working. Wi-Fi was free and faultless. I had three/four devices attached during most of my stay and this was perfectly adequate for FaceTime/Skype calls. The Nespresso Coffee machine in each room is a nice touch. Staff were excellent, always very polite and helpful. Special thanks to Denista and David who were really superb. Restaurant was very nice, although always seemed to be quite empty? Food was really nice, and was quite cheap considering. The Duck dish is well worth trying, very nice. Finally the gym/spa was very nice, despite only having three machines they were all top quality and were in very good condition. The pool and steam room were very nice. The location was really convenient, some nice Tapas bars within close vicinity, and for those that aren't so adventurous there was a Starbucks, and a Burger King just down the road!! All in all the only thing that I can really fault the hotel on was the bar, which was not really that comfortable, and quite regularly empty.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Great Location”", "Author": "amaliamou", "ReviewID": "UR123937424", "Content": "Two minutes walk from Prado museum, very close to Reina Sogia museum and other attractions.. We stayed in the suite..very comfortable, very clean, nice amenities.. I didn;t like very much the breakfast..(too poor for the price) and don't expect a big lobby. There is no place acctually to sit if you are waiting to check in- check out. Madrid is one of the most amazing cities..", "Date": "January 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Santa Fe, NM", "Title": "“Art & Tapas Central”", "Author": "SantaFeB", "ReviewID": "UR123620511", "Content": "You like art? A short walk from the hotel is the Prado and more. You like tapas? Across the street and throughout the neighborhood. There was even professional flamenco nearby. One could not ask for a better Madrid location. (Of course, this was my first visit to the city so I have nothing to compare it to...) I'm fond of the Radisson Blu brand - so far each hotel has been delightfully special in its own way. The Madrid Prado was good but not great. I found my room on the small side and the strange super-photographics on the wall made it seem even smaller. The work table was not really business-friendly; small and barely adequate. That being said, the bed was comfortable, the room quiet, the shower-only (no tub) nice, the breakfast delicious, the front desk staff terrific, and, as I mentioned above, the location perfect. The hotel room was very \"useful,\" a good base from which to wander but not the kind of room you look forward to coming back to, to kicking off your shoes and just hanging out and relaxing...or working. Seasoned travelers know the difference. Nevertheless, under the appropriate circumstances I would most definitely return.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Enjoyable Stay in Madrid”", "Author": "PassportGirl75", "ReviewID": "UR123209102", "Content": "I stayed at the Radisson for 3 nights. Overall, I really liked the hotel. The front desk is very helpful. If, like me, you get in very early from a trans-Atlantic flight, they will try to get you in to your room early. If they cannot, ask if you can use the spa - there are showers and comfy lounge chairs (almost beds) where you can snooze while you wait. I had a standard king room, which was very large for a European hotel. The bed was nice and there were foam pillows in the closet for those with feather allergies like me. The bathroom was smaller than other hotels of similar class, even in Europe, but for a quick trip it's fine, and I liked the rainfall shower. I could not get the theromstat to go below 19C, which is not cold enough for me for sleeping, so I would try to sleep with the windows open, but the hotel plays this weird music in the hallways, which you can hear if the windows are open (if they are closed it's totally soundproof). Turning the music off around midnight would help. Speaking of the windows, they had a film over them, so you could not see out at all. Light still came in, but I would have liked to have seen out, even if it wasn't a great view. The website advertises a pool, but it's really more of a giant hot tub. (I could swim the length without taking a breath). It's not what I expected, but it is relaxing and fun, and I used it nightly. Upon check out, I had 2 charges on my bill which were not mine, but they were removed after I pointed them out. Overall, I would go back. It's on a quiet street right off the Paseo del Prado, close to museums and restaurants, and a very quick walk to the Atocha metro stop.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "LONDON", "Title": "“Outstanding hotel”", "Author": "JudithChalmers09", "ReviewID": "UR122939414", "Content": "Perfect hotel for my business trip. Great rooms, WIFI, bar and breakfast. Staff are fantastic and would recommend this hotel without hesitation.", "Date": "January 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Genève", "Title": "“Location”", "Author": "Tandem2", "ReviewID": "UR122409648", "Content": "We stayed for 3 nights at this hotel. The location is super with the Prado just across the street and the Thyssen Bornemisza some blocks away. Cosy decorated small room (including Nespresso machine) with comfortable bed and a nice bathroom. Lovely breakfast with fresh fruits, all sorts of bread, muesli, milk products or whatever pleases you; like freshly baked eggs with bacon etc. etc. Just a pity that we needed to ask two days in a row for bath towels and toilet paper; but this was brought to our room instantly. Otherwise it's just perfect and we highly recommend this hotel.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sliema, Malta", "Title": "“Great hotel!”", "Author": "KAYLR", "ReviewID": "UR121508757", "Content": "I stayed at the hotel with family last easter. The hotel was clean, staff was super friendly! I even recommend the restaurant at the hotel as it is great value for money and has great food! The decor was beautiful! EVen had a nespresso machine which was a great plus!The only downside is that the hotel is a 5-10 minute walk to the centre, its central dont get me wrong, but not bang in the centre. Overall will visit again and again! Never been let down by a Radisson.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Location, location, location”", "Author": "Jerry B", "ReviewID": "UR121375119", "Content": "My main purpose for two days in Madrid was to visit the Prado. This is virtually across the street. But in addition to proximity to the Prado, it is very well located. Lots of places to eat and interesting places to see. The hotel is small and very contemporary design (outside facade has been retained). My room was small but comfortable and an excellent bed. Service excellent.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Superb location for tourists, pleasant, helpful staff”", "Author": "globaltraveller200", "ReviewID": "UR121332364", "Content": "We enjoyed our five night stay in the Radisson Blu Prado, superbly located for tourists opposite the Prado, around the corner from the Caixa Forum and a short walk from the Thyssen Bornemiza and the Reina Sofia. The main train and bus stations are also nearby, there is good public transport access and tens of restaurants and tapas bars in the immediate area. The hotel is a recent conversion of an apartment block and almost qualifies as ‘boutique’ with c. 50 rooms, contemporary décor (varying shades of black and grey), ‘wet’ bathrooms, a small basement pool, gym and steam room. There is a small restaurant and a bar, which seems to be either empty or - late at night - overcrowded. Public space is otherwise minimal. Our ‘business class’ room and bathroom (shower only) were adequately sized, furnished and soundproofed. The room were made up rather late in the day. Laundry service was efficient and inexpensive. Breakfast is an excellent buffet with hot food available on order. We did not use the restaurant otherwise. All the staff we met were exceptionally pleasant and helpful (but there aren't many of them and no porter service). Free WiFi access is available throughout the hotel but there is no public computer. This is not a traditional luxe property, not cheap and perhaps not ideal for business travellers. But it met our needs well. Recommended to tourists, especially art mavens.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mississauga, Canada", "Title": "“Excellent loation”", "Author": "annanhm", "ReviewID": "UR120959504", "Content": "Very nice hotel, friendly staff, good location, very close to the major attractions in the city. Breakfast was good, the hotel is at walking distance from the Plaza Mayor, Puerto del Sol, Gran Via, Prado Museum, Cibeles, Retiro park and Royal Palace, We even walked to the Bernabeu Stadium (it took us 55 minutes) but we enjoyed it, the weather was perfect. we also enjoyed walking at the Calle de Serrano late afternoon, all the major Spanish fashion brands are there.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Nice hotel, friendly staff and in a good location”", "Author": "Gnome81", "ReviewID": "UR120956663", "Content": "Recently stayed here on a long weekend break. Hotel was very clean and comfortable with all the facilities you would expect. Staff were very welcoming and helpful. The hotel is located in a lively part of the centre, plenty of tapas bars and small jazz bars. It's also a short walk to the Prado and Reina Sofia galleries and El Retiro park.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Valletta, Malta", "Title": "“Great location and service”", "Author": "Hillbillycat", "ReviewID": "UR120916862", "Content": "Great location near the Prado museum and many nice restaurants close by. I am not particular fond of design hotel but this one is neat and clean and the staff is very service minded (and speaks good English which you can not expect in Madrid). Small but good buffet breakfast.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, UK", "Title": "“Quiet, central location, room service excellent, disappointing breakfast”", "Author": "polar_b", "ReviewID": "UR120899144", "Content": "Unless you look closely you would not even know the hotel is where it is. The conversion is nicely done and don't be fooled by the old-fashioned exterior, step inside and you are in a truly modern, highly design-conscious environment. The location is good, it's off the main road and in a pretty quiet location. The whole hotel has a very quiet feel to it, maybe due to the materials used - the corridors have all been soundproofed and if you close the window in your room you won't hear a thing from the outside. This hotel is clearly quite small, which has its pros and cons. The pro is that the service is quite personal, and it does not feel crowded. There is normally only one person in reception, and once you stay a few days they do get to know you. The con is that they can't quite deliver the level of service and facilities larger hotels provide. Having said that - I ordered room service two nights in a row and was pleasantly surprised. Instead of having a separate room service menu you simply order dishes from their top-quality restaurant, and the food was the best room service meal I have had in a long time. I am a seasoned business traveller and often order room service (due to time constraints), and the food was full of flavour, exciting and tasted very fresh. So, top marks for providing such good food in such a modestly sized establishment. The rooms are fine, nothing special. Bathroom large, rain shower nice but honestly every hotel has them nowadays. No ironing board in the room, you have to call housekeeping. Furniture not very practical, there is a chair for relaxing but it's very low and they also give you a bean bag which is great if you are 5 years old but not practical otherwise. Small round table OK but would have preferred a proper desk to work on. Also when having a room service meal there is no proper large table to sit down and eat, you have to use the relaxing chair which is awkward. Breakfast left me disappointed. To be fair, this is a small hotel and comparing to the large hotels I normally stay in is perhaps not fair, but then again I have had breakfasts with more choice in smaller hotels than this. Breakfast buffet is all cold dishes, there is a menu from which you can order a few hot dishes. I ordered an omelette and some bacon/sausages, which was OK (nothing more) and the buffet is also nothing more than OK. Also it's quite time-consuming to always have to order your hot dishes, instead of just taking them from a buffet - my time is very limited in the mornings. This is one of the cons of the small size of the hotel - they haven't got scale so can't offer a large breakfast buffet like a much bigger hotel can do. Still, they could do much better with their hot dishes. There are no taxis outside so they will have to call you one, and it takes 5-10 minutes before they arrive so factor this into your trip if you are going for a meeting in the morning.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Miami Beach, Florida", "Title": "“Great location; contemporary, clean rooms”", "Author": "Sobe21", "ReviewID": "UR120788729", "Content": "Radisson Blu is a very nice contemporary hotel in Madrid. The location is great, the hotel is very clean and the staff is professional and very nice. Depending on what you are looking for, its \"boutique\" style can be a pro (seems exclusive, very quiet, staff attentive) or a con (rarely saw any other quests, hotel restaurant/bar was pretty much deserted so not a very energetic atmosphere). + Clean, contemporary rooms. Very good wi-fi. + Staff is very nice and helpful and speak English very well. + Location is great, near the Prado and Retiro, not too far from some of the more high action areas (though can't be considered very close to Chueca, so if that's your focus you might want to stay closer to that area, see my review on Lusso Infantas). +/- Windows kept out noise from the plaza below quite well (though one shutter kept coming loose and banging around in the wind). +/- Bathroom very contemporary and nice with towel heater, overhead shower, but with contemporary styling got limited vanity space for setting anything down and only outlet for shaving quite far from mirror. - Hotel hallways, elevators, too warm. Room also too warm and couldn't turn down thermostat. Found out front desk electronically controls limits on room thermostat, once they adjusted the room itself was fine. - Late night (11 pm) room service menu quite limited (though similar to many hotels). - Casual chair in room more form over function, not that comfortable to lounge or work in, and bed a bit too soft, but otherwise comfortable. Desk chair was fine. Tip: Since there are so many cabs in Madrid, save €6 pounds when you leave by just flagging a cab instead of having the hotel call one. It's only about 100 ft to the street. Should cost you about €35 in total to get between the airport and the hotel including the €5 airport supplement.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Fabulous and very central”", "Author": "Dia_Carstens", "ReviewID": "UR120751353", "Content": "My husband and I stayed at this great hotel for a 5-day trip to Madrid recently. It is extremely well located, and literally walking distance to the best tourist spots in Madrid including the station. The rooms are spacious and modern and the spa is adequate. Breakfast is sumptuous and the service is friendly and good. The staff speak good english! I would definitely recommend this fabulous hotel for a memorable stay in Madrid!", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "scotland", "Title": "“Nice relaxing stay.”", "Author": "alibasher", "ReviewID": "UR120632664", "Content": "We arrived late on Friday night,the girl at checkin was excellent,very helpful,showed us around the area of the hotel on a map.We went straight out for food/drinks which are easy to find as there are plenty of places right on the doorstep of the hotel.The room was nice and modern with a good sized modern bathroom complete with rainfall shower.There was no shower gel provided so we had to go out and buy some,there was shampoo,conditioner and body lotion however.As it was my birthday the hotel left us complimentary bottles of water and fresh fruit which was nice.The wifi in the room was excellent and free.The desk staff were always friendly and pleasant every time we went in or out the hotel and were very good at checkout.The hotel is in a great location,very handy for the train station,close to the metro,museums,parks etc.All in all we had a pleasant,comfortable and relaxing stay.We never ate breakfast at the hotel,as there are places within a few metres for breakfast,four of us had light breakfast and coffee for a total of 10 euros at the cafe across the street.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Nice hotel but expected better”", "Author": "PetPPP", "ReviewID": "UR120593999", "Content": "The Radisson BLU was a nice hotel to explore Madrid. It's well-located, close to the Prado and Train Station. The Hotel is new and rooms are very modern. Price was maybe a bit on the expensive side for lack of services that you'd expect from such a hotel. The front desk should be better - we wanted to buy Bus Tickets to Granada and they never helped, they actually looked clueless and we had to go to the bus station -. They also claimed that my credit card was refused (when securing the reservation at check-in) when it wasn't the case. It's also next to the Syrian Embassy which meant some noise on Sunday.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Great hotel in the perfect location”", "Author": "Reena P", "ReviewID": "UR119928845", "Content": "My husband booked this hotel for my 30th birthday and we spent 3 nights in Madrid. I cannot fault this hotel; staff were very helpful, location was perfect and the room was modern, spacious and very comfortable. Perfect trip to Madrid.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "England", "Title": "“An Excellent hotel”", "Author": "littlemissnoisy", "ReviewID": "UR119782662", "Content": "We stayed for 4 nights in a suite at the Radisson. We wanted a space big enough for our 3 year old to spread out in and go to bed at night and not be disturbed by us watching the telly and this was perfect. The extras offered in all rooms at this hotel are above and beyond what you would normally get for this price, a nespresso pod coffee machine, slippers bathrobes and lovely bath products. The breakfast was very good, although the space a little small. The hotel advertises a pool but this is very small more like a very large spa pool but for our 3 year old it was ideal and after a day of walking around Madrid the sauna and pool were very welcome. I highly recommend this hotel!", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Flinton, Pennsylvania", "Title": "“Discrete and Comfortable -- a credit to the Radisson brand”", "Author": "PickyKate007", "ReviewID": "UR119638781", "Content": "This hotel has a terrific location.  It is discretely tucked away on a quiet street just off the Prado.  Within an easy walk are easily 100 restaurants.  There are so many things to do just on the doorstep. I like this hotel and would recommend it.  The room is small but very comfortable.  The sound proofing is excellent and the bed comfy.  It is a complete remodel of an old building.  Tastefully done with great attention to detail.  The staff are friendly and speak English.   I have few small things to pick about.  The is only one bar of soap in the bathroom and they seem to count out the Kleenex.  I had to break out my emergency soap supply just to have soap at the sink.  And there is no soap dish in the shower.  The only spot is to wedge it into the towel bar and then when it drops on the floor of course it shatters.  And the bath is designed without a shower curtain so everything gets wet that is on the floor.  But there is no counter space or towel rods.  Very strange bath.  The shower head is great though and it is a big bathroom. The final thing to pick about is that there is no top sheet on the bed -- just a covered duvet.  We had to take the cover off the duvet to use as a sheet since it is warm in the room.  I thought the maid would see our need but did not, she put duvet back on, took the used bar of soap and still just left one new one.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Miami, Florida", "Title": "“Great Location. Good Hotel.”", "Author": "CliffKol", "ReviewID": "UR119451097", "Content": "Centrally located, across from the Prado Museum and a short walk to Plaza Mayor and Royal Palace. Restaurants, tapas bars and stores all around us. Older building but modernized internally for the hotel. Room was small but modern. Free internet. Close to trains.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney Australia", "Title": "“Fabulous hotel, perfect location”", "Author": "Syd_family", "ReviewID": "UR119065662", "Content": "We (2 adults + 7 year old son) stayed here for 2 days and had a wonderful time. Best location for Madrid - across the road from the Prado, also a short walk to the huge Parque del Retiro. Lots of restaurants nearby. Hotel room was lovely (we booked a business room on the hotel website, Nespresso machine in room, great breakfast included and free wi-fi). Nice warm spa in the basement. Staff were absolutely fantastic. If you go to the Prado with kids - get the kids' audio guide - it is free with an adult audio guide and is excellent ... our 7 year old son who will usually only last minutes in a gallery spent 3 hours in the Prado, amazing! Will definitely stay here again.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "baltimore, md", "Title": "“Perfect location in Madrid”", "Author": "twobyauto", "ReviewID": "UR118845989", "Content": "We spent 5 nights at the Radisson Blu. The staff was extremely helpful to us during our stay--calling taxis, making dinner reservations as requested, and helping us get train tickets to Segovia for the day. The room was modern, comfortable and clean. We enjoyed the large buffet breakfast each morning. We were within walking distance of the Prado, the Thyssen, and the Reina Sophia as well as the Royal Palace, the Plaza Mayor, and Retiro park. A short walk to the Atocha train station got us to the AVE train to Toledo for a day of sightseeing. There were also some good restaurants in the neighborhood that we enjoyed.", "Date": "October 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Haifa, Israel", "Title": "“Very good location, excelent service”", "Author": "mirapitzi", "ReviewID": "UR118821672", "Content": "We stayed at this hotel in Madrid for 17 nights in a beautiful suite, very modern designe, the staff and mannager are very efficient and friendly, very clean, the rooms are very clean, breakfeast room is lovely and food us ok. The location is excelent - all the important museums are close and most of the touristic sites are on walking distance. Lot of restaurants all around the place. Transportation facilities are good - many busses stop near the hotel, 2 metro stations are in 5-10 minutes walk. wIfI is free, there is a coffee machine in the room, but with no milk heating. We recommend this hotel heartfully and wish to com back one day.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Great Hotel, Amazing Staff”", "Author": "Zbigy", "ReviewID": "UR118503957", "Content": "In short, this hotel had one of the best staff I have ever experienced. The hotel was great, modern, and well designed, but it was really the staff that made our stay the best. The hotel itself is locate on a small and quiet street, but literally 2 blocks away from beautiful parks, museums, and small restaurants and bars; the location is pretty perfect. The hotel is pretty small as well, with about 50 rooms. The hotel also has a restaurant inside that has some pretty good food, as well as a very trendy pool and spa (with light up showers and lounge music included). The rooms are also nice, with some interesting design to each one. The standard rooms are a little small, but not any smaller than what is normal for spain. If you are thinking of spending the extra money to get an exterior room, it is VERY worth the money. The rooms are nicer and have a huge window with a balcony facing out to the street, which really makes all the difference. However, as I said, what truly made our stay was the amazing staff. From the moment we walked int hey were extremely friendly, helping us with all we needed. We got in early and our room was ready (we had an interior standard room without a balcony), and we asked them if there was another one available with a window. They told us we would have to wait to check out time to see if someone left, so we strolled for a couple hours and came back to find that two people at the front desk had spent a good amount of time moving things around and figuring out a way for us to get a nicer, bigger, room with a balcony; at no extra charge. We spent 3 days in this room, and then took a trip for a while to then return a week later, during which they were happy to keep our bags and remembered us immediately as we walked back in the room. This time, I had booked a balcony room, and found that they had upgraded us for free to a full suite, without me even asking! Needless to say, the constant helping attitude, friendly faces, and effort to make our stay as enjoyable as possible made the hotel experience one of the best I have ever had. They will truly make your stay all the better.", "Date": "September 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "gr", "Title": "“really wonderful”", "Author": "mf2006", "ReviewID": "UR117381638", "Content": "Very nice hotel in a very convenient area, close to the major museums and the Retiro Park. In walking distance from the center, 30 min about. Close to the metro station and bus stasion. Very clean and confortable rooms. Spacius wc and shower. Coffee machine in the room, which I consider an asset. Free WIfi everywhere. Delicious breakfast. Lots of restaurants and cafes very close to the hotel. Very helpful and kind concierge.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "kuala lumpur", "Title": "“Clean and no fuss hotel!”", "Author": "NorRainaAbdullah", "ReviewID": "UR116990459", "Content": "A simple 4-star hotel located in a very central area; just opposite the Prado musuem, and within walking distance to the underground, the Atocha main train station, as well as restaurants all around. A huge lovely park and other musuems, including the Reine Sofia Museum of Art is also in the neighbourhood. We felt safe and nice staying there. However the room we got was slightly small, but nevetheless clean.", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Excellent Location, Great Service”", "Author": "southmiamibeachbum", "ReviewID": "UR116964599", "Content": "The hotel is located immediately off of the Prado so its blocks away from Museo del Prado as well within walking distance of the Plaza Mayor, the Impressionist Museum, restaurants, shops and lots of bars and cafes that are oriented towards locals not just tourists. The hotel has a full buffet breakfast with a variety of breads, home made jams, fresh juices, hams and cheeses as well as whatever other cooked dishes you would like. There is a bar in the plaza in front of the hotel with the hotel's own little area as well. The hotel has impact windows so little ,if any, noise gets through leaving even our room facing the plaza totally quiet. The service is friendly and effective with a technological problem resolved immediately on a Saturday night. A taxi was called even without a request. Everyone is multilingual. There is a very small gym with a nice pool and sauna as well as the possibility of massages. We really liked the hotel, but had to go up from the standard room to accomadate our teen as the regular room would have been too small to comfortably fit a rollaway (for which about 6o euros is charged). While I loved the business suite which had a comfortable couch made up into a bed (only fits one teen-not a sleeper), I did not like the glass wall in the bathroom which denies privacy. Also, they have a bar on the lobby floor which is so cold looking that it was always empty. They do have another bar, but that was also empty in the evening. The hotel is saving resources (this usually equals cost cutting measures) and so leaves the hallways and maybe the elevators without a/c (maybe heating in the winter) which is a bit uncomfortable in 90 plus degree heat. However, the rooms are very comfortable temperature and otherwise. Definitely would recommend this hotel to anyone.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Wareham, Massachusetts", "Title": "“Great Location and Staff”", "Author": "Minkcove", "ReviewID": "UR116723430", "Content": "This hotel is steps from the Atocha train station and the Prado Museum. If you don't mind long walks, you can also walk to Plaza Mayor. Also, in the hotel's backyard is a wonderful neighborhood full of tapas bars. The staff speaks excellent English. There is a nice sauna pool. The room was clean, modern, well appointed.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Love the modern hotel!!”", "Author": "HakeemHaron", "ReviewID": "UR116003067", "Content": "This hotel is highly recommended mainly because of the value for money and excellent location. Its situated right smack in the middle of the city.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fayetteville, Arkansas, USA", "Title": "“Hip hotel with convenient location”", "Author": "SarahElspeth", "ReviewID": "UR115991758", "Content": "The first thing I loved about the Radisson Blu was its location- just a quick walk from Atchoa train station, the museum district and lots of great dining options. (We also walked to the Royal Palace/ Plaza Mayor/ Puerta del Sol/ El Rastro/ Parque del Retiro, but less adventurous travelers could catch a quick cab or metro to the more distant sites.) Once inside, the hotel's decor was very modern and hip, with super cozy beds and funky images from Madrid on the walls. (We don't usually stay at chain hotels in Europe, but the larger-than-life images of Madrid on the walls made the hotel seem more like a botique hotel and less like a chain.) Our room had a small balcony. The bathroom was top notch, with a fantastic shower. The room had a well-stocked mini bar, but the snack and drink prices were quite steep. The staff was incredibly friendly. We will definitely stay at the Radisson Blu again.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Oslo, Norway", "Title": "“Nice quiet modern new hotel, good location.”", "Author": "Bear V", "ReviewID": "UR115967198", "Content": "Stayed at the hotel for 4 nights in july 2011. \"Normal\" sized modern double room with extra bed. The room was quiet, no noise from street or other rooms. Beds ok. Nice breakfast. Very fancy design in room and hotel. Lightning in room terrible. The lightning made the room very hot, and the air condition was not able too keep the room cool. Lightning in the bathroom not useful for make up/shaving. Free wifi internet. No parking, and no help with parking at the hotel. Fitness room in same area as spa, made it to hot for any fitness. Helpful and friendly staff. Good location, very close to museums, restaurants, bars, cafe etc At check out I was presented with an extra charge for for the extra bed. No information on that when I booked the room !!", "Date": "July 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“Your 2nd home in Madrid”", "Author": "Hornelson", "ReviewID": "UR115892031", "Content": "Defintely my best choice in Madrid. It's located in a wonderful place, just in the pedestrian area with lot of restaurants for dinner. Everything is ten minutes walking, from Prado Musem to Atocha Station if you need to take the AVE train. All the major attractions too are just 10-20 minutes walking. Service is great, staff is warm and they always trying their best to accomplish your requests. Breakfast is very good quality. Defintely my 2nd home in Madrid. And. Mr. Luis, a young front desk staff, is a great professional.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“A great hotel. A great location.”", "Author": "theCCCCS-Afamily", "ReviewID": "UR115657461", "Content": "The Radisson Blu has an amazing location centered in the art triangle of Madrid. The location is not the only good thing though, the rooms are amazing too. We had two rooms and one was the suite. It was amazing. It had a great bathroom in the bedroom made of glass. When all of the lights were off the glass appears to be a mirror. The giant bed is as soft as the robes and slippers. The pool is also fantastic. It is small but warm and has jets. It is almost like a giant hot tub. This is one of my favourite contemporary hotels.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "israel", "Title": "“Well placed and clean”", "Author": "ellen1979il", "ReviewID": "UR114818714", "Content": "We were very pleased with this hotel - the location can't be beat, the room was very clean and bed very comfortable. The room was a bit on the small side (we were in a handicap accessible room) and although we didn't travel with a wheel chair, it would have been quite tight for someone confined to one. The staff were very helpful and spoke English very well. Breakfast was included in the room rate and was quite adequate. We had several dinners at the hotel (they grant a 50% discount to hotel guests) - food was good and price ok after the discount. Would recommend this hotel, but would warn regarding the small room and lack of a real lobby, otherwise this hotel deserves a \"10\"!", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Nice hotel, very good rooms”", "Author": "smb2011", "ReviewID": "UR114816716", "Content": "Had a very comfortable stay here. The bathroom is superb!! The room is also very modern and very well designed. Room service was excellent. Breakfast was substantial. Service was very good. Good location as well. Walking distance from museums and the square where the tourism office is.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Good location, friendly staff, modern rooms”", "Author": "DaveMaharaj", "ReviewID": "UR114585747", "Content": "located 20 minutes from Barajas airport - a 25 Euro cab ride. 15 minute walk to Atocha train station and 20 minutes from Plaza Mayor and Sol. All 3 major museums were within a 5 minute walk. Staff spoke English well and were very kind a courteous to the point of walking us a block to show us our way. Rooms were modern, clean and sized as expected - not too big not too small. We stayed here on 2 separate occasions on this trip - both times we arrived well before posted check-in times and both times were able to be checked into our room without hassle. I recommend this hotel to anyone who is in Madrid for the museums and of those taking the train to other Spanish destinations.", "Date": "June 20, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Good hotel but no hot water”", "Author": "felicityineurope", "ReviewID": "UR110272620", "Content": "I'm not too sure how to rate this hotel; it was actually ideal for what I needed but there was no hot water and a cold shower in the middle of winter in Madrid doesn't make for a happy stay. I called reception around 7am to ask if there was a problem with the water because my shower wasn't getting hot. The receptionist said no, there wasn't a problem, and offered to send someone to check it out - of course I accepted and she said, OK they'll be there after 9 beause that's when maintenance start work. I had meetings so had to deal with the cold shower, as did my colleague. Upon checkout the receptionist admitted that there was a hotel-wide problem with the hot water but didn't offer any compensation. Overall, I liked this hotel, it's modern, bathroom was spacious and well laid out, bed comfortable, breakfast good, location great so I suppose I would recommend it, maybe check that they plan to have hot water or maintenance staff on hand.", "Date": "May 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Perfect location, friendly and helpful staff”", "Author": "Travelfan2009", "ReviewID": "UR109643683", "Content": "The hotel is located within easy walking distance of The Prado,Thyssen, Seina Sofia and Caixa Forum Museums - all major attractions and well worthwhile visiting. The Atocha station is a couple of blocks away - with high speed trains to Valencia and Toledo. The hotel itself is small, modern and efficient. The restaurant is great for breakfast - we also had dinner there a couple of times and it was very good quality and value. The reception staff were very helpful in locating a pharmacy nearby and even offered to accompany me to translate ! They also helped with train times and restaurant reservations. I would definitely recommend this hotel to friends and will return here on any future trips to Madrid.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Great hotel, fantastic location”", "Author": "tyny77", "ReviewID": "UR108853623", "Content": "My husband and I stayed here for 5 nights. If you are looking for a clean, reasonably priced hotel in a great neighborhood, this is for you. The location could not be better, located in walking distance to the Prado, Reina Sophia, Thyssen-Bornemisza, and the Parque del Buen Retiro. Additionally it is close to the Atocha train station and the metro so traveling around Madrid and Spain is very convenient. The room was very clean with adequate closet space. The bathroom was very trendy. The rain shower was a treat after a long day of walking and it was nice to have a powerful hair dryer provided. The only negatives were that the air conditioning did not work so well and the beds were extremely hard. If you are looking for a full service concierge you will not find one here but the staff is helpful and courteous.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Jersey City, New Jersey", "Title": "“Beautiful Hotel with Terrible Shower”", "Author": "romcat1106", "ReviewID": "UR108468946", "Content": "Overall we enjoyed staying at the Radisson but I wouldn't recommend it due to the shower situation. You couldn't take a relaxing shower at all since the water would constantly go from normal temperature to freezing to super hot. Which after a day of sightseeing and walking around for 8 hours it would have been nice just to take a normal shower. ---Pros--- -Bed & Pillows -Decor -TV -Room service options -Friendly service (Pablo was very nice) -Plenty of clothing storage -Nice mini fridge / coffee -Room wifi ---Cons--- -Shower water temperature would get cold to hot constantly. Would never remain the same temperature. -The shower - a bit too modern - wasn't so functional -The sink area wasn't very functional for putting your toiletries around or below -The Hair Dryer if you moved really at all it would come out of the plug", "Date": "May 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "kew", "Title": "“Book a business room - worth the extra”", "Author": "kewfriend", "ReviewID": "UR108167813", "Content": "Given that this hotel is almost next door to the Syrian Embassy which had recently been daubed in 'blood' red paint, this hotel could not have been in a 'safer' district with all the police lazily observing the comings and goings. Outside are two perfectly good street cafes which we also used. The rooms are exactly as pictured by the hotel: plush, restrained, scrupulously clean. The breakfast was superb and unending. Everything worked. With our room overlooking the small outside square we might have expected noise - it was blissfully quiet. Enormous fluffy pillows decked a bed to sink into. The spa area, though small, was delightful and a wonderful retreat from the heat of the day. We didnt try their own vaunted restaurant - another time. The menu didnt seem that 'adventurous'. Generally Radisson hotels are 'boring'. This one is 'small and perfectly formed'. The location just a few hundred metres from the Prado and Thyssen is excellent. The metro is a short walk away. A further walk brings one to some decent restaurants - nothing very local.", "Date": "May 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“A real pleasure”", "Author": "Pearl2014", "ReviewID": "UR106646925", "Content": "Very conveniently located - in the centre of town, opposite the Prado museum, a couple of minutes on foot from numerous other good museums/art galleries, in a pleasant, leafy area and within walking distance of many places of interest. The welcome was friendly, staff helpful and the room superb (contemporary design). We booked a suite to accommodate us and our 13 year old - a luxurious bedroom (King size bed) with a comfortable extra bed in the separate living room, an excellent bathroom and a second separate toilet and basin. Very comfortable bed, good sound proofing from the road outside, everything spotlessly clean. Pleasant small spa pool and gym in basement. Not cheap but worth the money. We had a very good dinner in the reasonably priced hotel restaurant and also tried the restaurant directly opposite the hotel (also very good). Would definitely visit again.", "Date": "May 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Porto, Portugal", "Title": "“Great option in Madrid”", "Author": "351pete", "ReviewID": "UR106271666", "Content": "The Radisson Blu Madrid is very nicely located near the Prado and Reina Sofia museums, and also at walking distance from the Atocha train/metro station. The rooms were very comfortable, and unlike other reviews, I didn’t found any issue with the shower. There was also free wi-fi, although with the recent change from goldpoints to club Carlson, it may not be the case anymore.", "Date": "April 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Mixed bag--location, location, great bed, weird bathroom”", "Author": "NewYorkNYTraveler", "ReviewID": "UR103954692", "Content": "The location was fabulous-- quiet, across from the Prado. A very attractive neighborhood, not like other areas we walked in in Madrid. The hotel itself is a little weird-- very modern, but the designer missed the boat a lot. The shower, as others note, sprays everywhere because there's not a big enough lip between the shower and the rest of the bathroom. And there was no shower door. It takes an electrical engineer to figure out how to turn the lights and the a/c on and off. And the door to the bathroom opens in the wrong direction. The TV is too big for the room. The bed, however, was unbelievably comfortable and the room was very quiet. The staff was very nice. So, if you just make sure you don't use the hairdryer while your feet are in the puddle on the bathroom floor you'll be fine if you stay here. Oh, we were for some reason put in a handicapped accessible room-- I cannot imagine how someone in a wheelchair could get past the table that was wedged against the door to the bathroom that opened the wrong way that was next to the huge TV set to get into the bathroom. The little cafe right in front of the hotel is great for breakfast-- very inexpensive and good food,", "Date": "April 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Colorado", "Title": "“Decent location, average room, nice staff”", "Author": "Katherine L", "ReviewID": "UR103327758", "Content": "The hotel is in a decent location but the room wasn't impressive or great at all. Two single beds pushed together to form the queen bed and the comforter covers for some reason were not long enough to actually cover the entire comforter. The room itself was okay, the bathroom decent, small but clean. The room we had only had a shower, no tub. Room was quiet. We did have to call down to the desk to set the tempertature lower (seemed to occur across several different hotels in Spain..you're only able to control the volume / fan speed in the room). The designers were going for ultra modern/trendy. The staff was friendly and helpful. My husband and I changed hotels (we booked for 4 nights, ended up only staying 2 - luckily with AAA rate so there was no penalty). We ended up not getting / paying for their breakfast and instead went to a local VIPS for a fraction of the price and funny enough probably the only place outside of any hotel which actually was open for eggs/toast type of American breakfast. The metro has 2-3 stops within 5 min walking distance.", "Date": "April 8, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York City, New York", "Title": "“Modern, clean, and comfortable”", "Author": "whyran7", "ReviewID": "UR103288270", "Content": "We chose this hotel after reading the New York Times review: http://travel.nytimes.com/2010/09/05/travel/05checkin.html and they didn't steer us wrong! It was new, spotlessly clean, and extremely comfortable. The location is, of course, perfect for the museums. It was a bit of a walk to the old quarter (maybe 10-15 minutes), but quite doable. We paid €157 per night for a weekend in early December which is not super cheap, but okay.", "Date": "April 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Windsor, UK", "Title": "“Affordable and affable choice with great location”", "Author": "GBR007", "ReviewID": "UR102888436", "Content": "I stayed at the Radisson Blu for one night (Sunday) en route to a workshop I was giving in the north of Madrid on the Monday morning. It turned out to be an excellent choice/ Newly refurbished, the RB offers * A really good buffet breakfast and good coffee * Very modern and comfortable rooms (mine was a standard single) - superb bathroom * Free wifi in rooms and the famous netpresso machines! * Warm (very warm!) gym with a plunge pool - small but fine for those wanting a quick work out *Friendly and efficient front of house - no fuss and quick check in Key bonus is the location - slap opposite the Prado and within easy walking distance of other museums. Plenty of good restaurants just 5-10 minutes walk away heading up the hill towards SOL. All in all - a hotel that met my needs at an affordable price and I would certainly stay there again for future trips to Madrid", "Date": "April 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Location, location, location”", "Author": "zzzizzzi", "ReviewID": "UR102060113", "Content": "This hotel is ideally sitauted for the Prado & Thyssen galleries and is also within easy walking distance of Sol etc. We also thought the breakfast was second to none. Free WiFi is always a bonus and would definately consider this hotel for another visit. The Spa and leisure facilities on the website look better than what they are; three pieces of gym kit and a glorified paddling pool is not my idea of a Spa, however this is not enough to put us off going back.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Quality in city centre”", "Author": "Bingtravel", "ReviewID": "UR99779902", "Content": "Good and new hotel directly across Prado Hotel in city centre Small room not on a busy road. good beds Service good be beter. Room Locker didn't work and wasn't repaired in three days stay.", "Date": "March 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“Superb staff, lovely hotel and highly recommended”", "Author": "goodadvice12", "ReviewID": "UR98497096", "Content": "We stayed at the Radisson Blu for four nights. The hotel was modern, extremely clean, and in a great location. The staff were wonderful and the quality of the breakfast was excellent. The room was small but adequate and the wifi free and easy to access. The bedroom was initially very hot, but after a word with reception, the temperature was lowered and all was well. Our room did not have an external window, which was the only downside. Overall I would highly recommend and would happily return. The spa is nice but it is not a swimming pool, as some booking agencies suggest.", "Date": "March 1, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“Decent hotel”", "Author": "JumboJas", "ReviewID": "UR98363765", "Content": "As far as European hotels go, this is indeed a fairly decent hotel. Although there could be some imrpovement, it is a nice little hotel all in all. Pros - Good location. 3-minute walk from Prado and 10-minute walk from Retiro Park and Atocha (Train station to Toledo). - Pleasant neighbourhood with plenty of bars, cafes and restaurants. We did not exactly brush up our Spanish beforehand but everyone seemed very friendly and keen to recommend different authentic dishes despite the language barrier. It felt very safe to go out even late at night. - Decent room and cool design. Love the huge mirror and over-head shower in the bathroom. - Attentive staff. Cons (rather minor stuff) - I have to agree with previous comments that the water temperature seemed to jump up and down a fair bit. (It was almost like 15-second of decent temperature and 2-second extreme hot.) - Lack of make-up mirror in the bathroom. - Average quality of toiletry: lack of cotton buds and cotton pads. Hair conditioner was very weak. (Having said all that, I could live with it for 4 days.) - Light switches were very random, we had so much trouble working out what switch was for what light.", "Date": "February 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Poland", "Title": "“Couldn't ask for better location.”", "Author": "jaym01", "ReviewID": "UR98057100", "Content": "The standout for the hotel is its location - right across from the Prado, surrounded by great little cafes, 500m from the metro, but on a quiet side street so there's no noise. That was perfect. And overall, it was a wonderful experience. The rooms were lovely, comfy bed, free wifi (thank you!), friendly staff, and I'd have no hesitation in recommending it to anyone on this basis. There were just a few little things that niggled me. 1. The shampoo was terrible. I don't mean just ordinary. I mean I don't even think it was shampoo. My hair was destroyed afterwards. I've never had such an experience. 2. There was only BBC TV in English - unless you wanted to pay 15EU for more English language TV. 3. The strange bathroom design meant it was really impossible to have a shower without getting the whole room wet (although I note the showers were wheelchair friendly, perhaps these things are related). 4. The shower ran hot and cold meaning you had to keep stepping out of it to avoid being burned. All little things - but it's the little things that make the difference, sometimes. And which might make me look around next time. Overall, though, it was brilliant and I probably would stay again. I'd just bring my own shampoo.", "Date": "February 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“Superior staff, but too many other problems”", "Author": "Mousewife", "ReviewID": "UR97429782", "Content": "The Radisson Blu Madrid has several distinct pluses and minuses. The positives: 1. The hotel staff was unfailingly pleasant, attentive, helpful, professional, and in command of at least adequate English. 2. The location is perfect for the art-tourist: a short walk from the Prado, the Reina Sofia, the Thyssen, and the Royal Academy of Fine Arts. It is also a short walk to the main train station and convenient to a host of restaurants. It is in the middle of everything, yet secluded and quiet. 3. It offers an effectively all-you-can-eat breakfast, a great convenience, and it is substantial: you can select from a better-than-average buffet and/or from the menu. The two in combination offer just about anything you could want. 4. The massage my wife received in the spa was very good. Although the massage therapist did not have much English, we were able to specify areas that needed special attention (feet and back after long hours in museums and sight-seeing) when we booked the appointment. Unfortunately, these were substantially offset by the negatives on my recent visit: 1. The “free wireless” did not work. (In fairness, we did not follow up with the hotel.) 2. The climate control in the room kept it suffocatingly hot. The thermostat did not respond to our efforts, suggesting it was either preset or broken. We spoke to the front desk and asked the preset thermostat to be lowered to 18 C; this was presumably done, but the room remained hot. We endured our five-day stay by keeping the window open. (In fairness, we only inquired once.) 3. The water temperature always felt as if you were on the verge of running out of hot water. It is perhaps appropriate that the water from the sink should never be scalding, but the shower never felt quite warm enough. 4. The channel selection on the television was the most limited I have yet experienced in a European hotel. The only English-language channels available were the BBC and Al Jazeera. 5. The pillows were remarkably limp and flat. 6. I want to be clear that the hotel staff was excellent, but I believe management has left the staff overworked and stretched thin. There was considerable evidence of short-staffing, and I suspect employees maintained their chipper, upbeat mood only because, with Spain’s unemployment rate around 20%, they are too frightened to do otherwise. This possibility was reinforced by a somewhat sinister customer satisfaction survey I received by email after check-out, asking me to name specific hotel employees for credit or blame. In light of all these experiences, I would not recommend the Radisson Blu, particularly as there are several other hotels in the same price range located close by.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Northampton England", "Title": "“Cool hotel in the narrow atmospheric streets of prado”", "Author": "Waldea", "ReviewID": "UR97027635", "Content": "A cool hotel right in prado. Rooms have huge prints of Madrid streets on the Walls. A bit dark... Trying to be a bit too hip. But still a bit different.", "Date": "February 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Birmingham UK", "Title": "“Brilliant hotel in great location”", "Author": "KarenBirminghamUK", "ReviewID": "UR96109264", "Content": "This hotel was perfect for a city break. Me and my partner are used to staying in modern, super cool hotels and this hotel did not disappoint. Although seeing reviews about the size of the room, we were not disappointed. It was not huge but was perfectly comfortable for the both of us and the bathroom was lovely! The staff at the hotel were very attentive and a young girl at the check in desk gave us some fabulous restaurant recommendations. If you are looking for a very nice meal in a uber cool place....check out Rameses and midnight Rose......both awesome. Our room was cleaned brilliantly every day. Location is perfect.....right opposite Museo Prado and close to everywhere! Word of advice for party animals-do not go to Pasha if you are 25 or over.....full of teenagers! Would definitley recommend this hotel to family and friends!", "Date": "February 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Empuriabrava, Spain", "Title": "“Excellent well located Hotel in central Madrid.”", "Author": "desertdog3", "ReviewID": "UR95574428", "Content": "An excellent and well located hotel in central Madrid. The room was clean and very comfortable. The staff were exceptionally friendly and helpful. Highly recommended.", "Date": "February 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great staff; great location; small but efficient rooms”", "Author": "AndyMell", "ReviewID": "UR93193489", "Content": "This is a great little hotel located close to the Prado (major art museum). But, it's on a quiet side street, so the noise level is fine. It is also a short walk from Plaza Mejor, and a number of interesting residential neighborhoods. It's near to the railway station that serves Bracelona and Toledo. It's about a 25 minute drive from the airport, but you'll need to bring a map for taxi drivers, as ours had not heard of the hotel. Our room (queen) was small but efficient. There wasn't a lot of room to move around, but I guess spending time in the room isn't the reason you go to Madrid! The staff was always very helpful with directions and making dinner reservations for us. They were also always happy to get us a drink from the bar.", "Date": "January 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manila, Philippines", "Title": "“Excellent stay...this is how a 4-star should be!”", "Author": "JuliaVanderbilt", "ReviewID": "UR93139599", "Content": "Was very happy with our 3-night stay at the Radisson Blu Madrid. The location is excellent if you want to see the big 3 museums, Prado, Thyssen and Reina Sofia. There's also the architectural marvel that is the Caixa Forum just 2 blocks away on the main street...and that was a wonderfully unexpected bonus. Restaurants, bars and cafes abound in the area...the streets are charming, small and cobbled. Plaza Mayor and Plaza del Sol are not too far away. It's in a great area especially since we were very interested in the museums. We were given a room on the third floor with a charming little balcony that overlooked the front of the hotel. Great natural light came in every morning and the room, while a tad small, was charmingly laid out, had great and restful colors, excellent bed furnishings and very good and dependable free WiFi. The bathroom was large and adequate with good toiletries and towels. I would have to say that the best part of our stay was the meticulous and warm care of a front desk person named Pablo. Not only did he recommend excellent restaurants around the area, he also managed to find us tickets for a great flamenco show. He was very warm, friendly and welcoming and it was his great hospitality that made all the difference!", "Date": "January 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Novosibirsk, Russia", "Title": "“Centrally located boutique hotel”", "Author": "AroundGlobe", "ReviewID": "UR92958197", "Content": "It's a small and very friendly hotel in the middle of everything. The hotel is very new and fresh. Though it bears only four stars plaque it's much more stylish and convenient than many of Madrid 5-stars hotels. We stayed in an upper floor suite and loved this spacious and stylish room. Breakfasts are well enough and the staff is very helpful. We will definitely stay in the same suite in this hotel if we are back in Madrid.", "Date": "January 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seville, Spain", "Title": "“Fantastic hotel, great rooms, facilities and service and brilliant location”", "Author": "andybarty", "ReviewID": "UR92005325", "Content": "We stayed here for 4 nights in January and found the hotel to be absolutely brilliant. We had rooms on the top floor and they were quiet and had great decor and facilities. The staff were really helpful, professional and friendly. The hotel's proximity to the museum triangle was a real highlight as was its proximity to very interesting and lively streets (for example Calle Huertas) full of bars, tavernas, restauranst and nightlife. If you are into theatre the marvellous Teatro Espanol in Plaza Santa Ana is only a stone's throw away. Thanks Radisson!!", "Date": "January 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Lovely small hotel across from the Prado and near other museums”", "Author": "mrwatson", "ReviewID": "UR90345036", "Content": "This is a very nice business oriented hotel that is close by the major attractions of Madrid (quick walk to Puerta del sol, across from the Prado etc.). The rooms are small but comfortable. There is a small restaurant with a nice breakfast selection and a small set of options for other meals. It is located very close to some lovely tapas restaurants.", "Date": "December 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Lovely boutique hotel”", "Author": "worldtravelernow", "ReviewID": "UR89281975", "Content": "I recently returned from the Radisson Blu Hotel and found it to be a wonderful hotel in a great location. The staff were all welcoming and friendly and my single room was a very nice size. The breakfast room was extremely pleasant and most mornings there was a nice variety of baked goods. There were delicious fruit and juices and you could have a fabulous omelette prepared especially for you. I used the indoor pool one evening and truly enjoyed myself and stayed for over one hour. It was a perfect size, and I had it entirely to myself which was very relaxing after a long day of touring. The hotel was very pretty from the outside and the lobby was very welcoming. It was very clean and modern and quite comfortable. The only thing that really bothered me was when I was checking out I was given my bill; and I noticed they had charged me for items from the minibar that I had not even touched. Every day someone knocked on the door and asked if I had used the minibar and each time I said I had not. I was miffed to say the least; and if I hadn't checked my bill carefully, I would have paid for someone else's refreshments. I would highly recommend that you carefully check your charges or you may be paying for things you did not use. Other than that incident, everything else was perfect; and I would stay here again.", "Date": "December 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Decent”", "Author": "numb15", "ReviewID": "UR88612961", "Content": "Pros: Friendly staff, great location, free wifi, brilliant bathroom with huge shower head and no annoying or mouldy bath like in the UK, decent breakfast. Cons: I had to change the key card twice as it deactivated for no apparent reason. The Fitness spa is poor quality (the tiny swimming pool had cold water, there was only one running machine and a bike, and the room was boiling hot). This was a complete contrast with the fitness areas in a Radisson, Sheraton and Hilton I stayed in when I was in Argentina and Uruguay, all three of which had huge swimming pools, big gyms on the top floor with lots of free weights and cardio machines and with fantastic views over the city. I think it must be a European thing to put a tiny fitness centre in the basement, I experienced this at other hotels in Europe and it's not pleasant.", "Date": "November 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leeds", "Title": "“Great hotel and perfect location”", "Author": "GoMarshy", "ReviewID": "UR86495825", "Content": "Very impressed, an absolute bargain for less then £80 a night in a 4* hotel. Rooms very contemporary with modern bathrooms and walk-in shower room. Staff friendly and helpful. Perfecty located for the main art galleries but also in one of the livelier parts of town with losts of bars and places to eat between the hotel and Palca Mayor. The Mercado de San Miquel just outside the Placa Mayor is a must visit for food and drink in great surroundings", "Date": "November 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Loved the hotel- the best costumer service ever!”", "Author": "BCNRocks", "ReviewID": "UR85243409", "Content": "Never have I stayed in a hotel that valued their costumers that much. The staff was very helpful, rushing to help with ANY request we had. We wanted to shorten our stay from 4 nights to 3, it was no problem to them. We just notified them of leaving on the same morning that we checked out. The room was smallish, but it didn't bother us at all. It was modern, cozy. Very comfortable bed:). My GOD, the breakfast! I have never had that great of a breakfast in a hotel, ever! It was not some usual hotel old sausage-yesterday's potatoes-breakfast. Here everything was genuine authentic traditional spanish kitchen. Real quality jamon iberico, fresh squeezed orange juice, many sorts of bread, sqeezed tomato to make your own pan con tomate, etc etc. Everything looked home made. Wifi is for free. I say the change that happened in Hotel chain's ownership had a very positive influence on the quality of these hotels!", "Date": "October 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Philadelphia", "Title": "“Hard to find fault”", "Author": "LeighPhiladelphia", "ReviewID": "UR85198588", "Content": "If you are a museum buff...this is the place to stay! Also location wonderful for tapas, dinner, late night activities. Staff very competant and helpful, all spoke english, even wait staff. I am an Architect and appreciated the very well designed interiors. Even minor problems promptly attended to by willing staff.", "Date": "October 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Comfortable hotel in great location”", "Author": "alysonth", "ReviewID": "UR85076790", "Content": "Extremely comfortable beds in smallish rooms, great sound-proofing so very quiet which is amazing in Madrid. No tub but huge shower in bathroom. Heated mirror so no misting which is a nice touch, also very good hairdryer. Plenty of closet space, excellent coffee maker and really delicious breakfasts with good pastries, fresh fruit salad, fresh orange juice and good coffee arrived within ten minutes of ordering from room service. Very friendly and competent young staff at reception. Did not try the restaurant - there are so many good tapas bars nearby. Hotel bar was empty when we were there. Wonderful location within minutes from Prado, Museo Thyssen-Bornemizsa, Atocha station, Botanical gardens and Retiro Park.", "Date": "October 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "new york", "Title": "“Disappointed”", "Author": "agl120854", "ReviewID": "UR84548156", "Content": "Can't agree with many of the other reviewers. Booked the hotel when to Room Mate Alicia was full for our last night in Madrid. Reasonable plan ahead rate (128 euros without breakfast) Upon entering the hotel there is a dark small entrance way with the reception desk. There was a dark unused whiskey bar straight ahead. the bar and restaurant were on a different level. Except for breakfast never saw a person in the restaurant. Check in was smooth but our \"upgraded\" business room was no different from any other room in the hotel. Small for the price but adequate. Did not use the spa. Definitely not a luxury experience. Location is OK but I enjoyed being near Santa Ana plaza more.", "Date": "October 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Quiet, Comfortable and Convenient”", "Author": "charsmama", "ReviewID": "UR81273841", "Content": "I was extremely pleased with the accommodations and service at the Radisson Blu Madrid Prado. We had originally booked at another hotel, but when they replied dismissively to an email I sent requesting information, I viewed that as a red flag. Fortunately, I had just read the New York Times review of the Radisson Blu, so I rebooked there and was not disappointed. The location is incredibly convenient, just ~100’ or so off the Paseo del Prado, placing it immediately across from the Prado Museum, yet located just behind another building so that traffic noise was limited. The hotel is on the corner of a small side street and a little square that houses a pleasant café/bar, with tables and plenty of seating. The reception staff at the Radisson Blu was a group of young, attractive women and men who were always welcoming, cheerful, and readily helpful. They greeted us pleasantly each time we passed through the lobby. Our room (212) was very comfortable and spotlessly clean. It overlooked a side street, so while we didn’t have a glamorous or expansive view, we could open the window to see the little square in front, yet we still enjoyed perfect quiet for sleeping. In fact, the hotel seemed to be exceptionally well sound-proofed, and that’s saying something, because I am a light sleeper. (Rooms on the front facing the square might not be as quiet.) The bed was firm but comfortable and offered a variety of pillow types, both light feather and firmer polyfill. The room offered plenty of lighting options: you could turn the lights up to very bright to see into a loaded black suitcase and yet also dim the bounce lights to more subdued lighting. The bedside reading lamps operated individually so that I could read the guidebook before sleep without keeping my husband up. Our bathroom didn’t have a tub, just a shower, but the rain shower had a handset with enough pressure to massage my feet. The hairdryer was so peppy that I used it instead of my own. The closet was roomy enough for us to hang clothes for 2 and offered a reasonable count of wooden hangers, including enough skirt hangers. A Nespresso machine was tucked in near the minibar and safe, and the coffee was free. The wireless worked flawlessly. There were some minor glitches. There is no standard lobby with seating where you can wait to meet someone. Instead, just inside the entry is a high concept and glassy-surfaced whiskey bar called “The Cask” which we never saw anyone occupy. The regular bar/restaurant has seating, but it is out of sight of the lobby. There are benches in the long doorway. The small “spa” in the basement was a little odd. I think there were 3 pieces of aerobic equipment and 1 TV, private rooms for massage, and a small dip pool that I had assumed was a hot tub but was instead a small plunge pool. Still, the environment was serene, and when my husband needed a nap I retreated to the spa, stretched out on one of the chaises and checked email and read while being soothed by the spa music. Also, the TV options were rather limited, i.e., no international CNN, just CNBC (I think.). Most channels were Spanish only, but – hey -- we weren’t there to watch TV. These issues were very minor. Overall, I really liked the hotel and I wish more offered these features for the price. I would definitely stay here again and would recommend it to friends without hesitation.", "Date": "September 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "meath", "Title": "“A gem in Madrid!!!”", "Author": "6543", "ReviewID": "UR78791971", "Content": "We stayed here for a short break and loved everything about this hotel. Ferran and his team were excellent!! I'm already planning a return visit!!!", "Date": "September 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Great location near train and museums”", "Author": "BrooklynMiro", "ReviewID": "UR78367238", "Content": "This hotel was a great place to stay upon arrival in Madrid after a long flight. Our room was ready early and the staff had many great recommendations. You can walk to the high speed train as well as Retiro Park, the Prado Museum, and Reina Sofia, and more. There is free wifi everywhere in hotel. You can walk to many great restaurants filled with local treats.", "Date": "September 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Best Hospitality Experience Ever!!!”", "Author": "guest218", "ReviewID": "UR77378427", "Content": "Me and my partner stayed here for 3 nights on our very first visit to Spain, and believe me when I say Radisson truely redefines hospitality and customer service, we have stayed in several Radissons world wide and the 'wow' factor never stops. All the staff was excellent , a special thanks to Pablo the night receptionist for the amazing recommendations, and attention to detail to ensure our stay was a comfortable one. Location and breakfast was perfect, with clean and spacious rooms, and very close to attocha station (main railway station) and all major tourist attractions including prado museum/touristic bus stop. A must go night lcub is kapitol which is two minutes away from the hotel. We would certainly recommend this hotel to everyone and would definitely return to this one of a kind hotel.", "Date": "August 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Great business stay”", "Author": "LiamRyan32", "ReviewID": "UR73235198", "Content": "Stayed here while on business and it fulled all my requirements. The staff are friendly and the room I stayed in was very good with very good maid service. Location is pretty good, close to a great deal of museums and lovely small galleries. Would stay again.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Radisson blue Madrid, the Best”", "Author": "zla123789", "ReviewID": "UR72369769", "Content": "I rate this hotel with a 10/10 score. Why? super clean rooms, friendly and attentive staff, comfortable beds, excellent location, free and good wifi and WONDERFUL espresso free morning coffee in your room. The price was very decent for all the comfort we got. The locate is perfect because it is located in the centro and it is walking distance to sites of interest for tourists.", "Date": "July 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Nice, small boutique hotel with big chain name”", "Author": "Ouiparis", "ReviewID": "UR71946016", "Content": "We stayed at the Radisson Blu for two nights in July. I picked the hotel based on a great deal from expedia.com as well as the relative newness of the hotel. The location was perfect. We were a short walk away from El Retiro, the Prado (which we did not visit), and the Sofia Reina. The nearest Metro stop is Atocha, which is just 5-7 minutes away on foot. We appreciated the robes and slippers and comfy bed. I used the very small gym, which consisted of two stationary bikes and a treadmill. We would have loved to indulge in a few spa treatments but simply did not have the time. There are two cafes with outdoor seating directly in front of the hotel. They seemed to be very popular with the locals. The front desk staff could not be more cordial or helpful in suggesting places to eat. I would not hesitate to recommend and stay at this hotel again.", "Date": "July 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "5.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "New York City, New York", "Title": "“to get every amenity, you pay a little more”", "Author": "stevesenior", "ReviewID": "UR67822555", "Content": "There are many hotels in a large city like Madrid. We first stayed in one for much less money, and the location was a far walk to the Prado and the amenities were few. There are also hotels far from everything a tourist is interested in. The Radisson Blue costs more, but is across the street from the Prado, and freely gives many amenities. They also video record a every transaction at the front desk, which could be useful because of the many pickpockets in the tourist section.", "Date": "June 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Silkeborg, Denmark", "Title": "“The place to stay if you go to Madrid”", "Author": "RasmusMunch", "ReviewID": "UR63877338", "Content": "The perfect hotel in Madrid must be Radisson blu, Madrid Prado. From the second we arrived we felt welcome. The staff told us about the facilities and made themselves available should we need any help. Rooms were not big but adequate for this type of stay. Cleaning was perfect. Small but nice and relaxing spa-area. Staff friendliness and service was high. The service in the hotel restaurant, The Cask, was impeccable and Rodrigo made our dining experience excellent. The hotel is very nice located 50 meters from a main street, and it was quite calm and tranquille even though it was near many cozy bars and restaurants, 10 minutes from downtown Plaza del Sol, just a few minutes from the train and metro and 50 meters from the bus and taxis. We would recommend this hotel to everyone who wants to go to Madrid. Excellent price/value.", "Date": "May 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Stylish boutique hotel - great location”", "Author": "chris2401", "ReviewID": "UR57305212", "Content": "My partner booked this hotel as a birthday present and we really enjoyed our stay! The room was ready for ckeck-in when we arrived, which was before the normal check-in time. The staff was very friendly and helpful making restaurant reservations as well as giving us tips on what to do. The room we had was on the smaller side, but has everything you need. The bathrooms were very cool. Breakfast was nice but too expensive compared to hotels in London. We also loved the spa area, the jacuzzi was fun too. I would recommend this hotel for sure -great for couples!", "Date": "February 28, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "dublin ireland", "Title": "“Excellent!”", "Author": "eireboy", "ReviewID": "UR56444535", "Content": "Throughly enjoyed our stay at this new Hotel, We arrived early from Ireland and were given our rooms straight away by the pleasant Receptionists. The Bedroom design was a breath of fresh air with lovely period doors to a small balcony out to the square , the bed was so comfortable it was a struggle to leave it! Breakfast was delicious, very well presented, Quality over Quantity. Great Location for walking around an Amazing City. A Small Hotel with no fuss & simplicity in all aspects. Recommend this and will return some day hopefully.", "Date": "February 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Naas", "Title": "“A great place to stay in Madrid”", "Author": "PollyandPlup", "ReviewID": "UR54400067", "Content": "Fabulous hotel. Excellent location, opposite Prado Museum and just off Calle de la Huertas for great restaurants and bars at night. We had a lovely spacious room with a balcony overlooking the Prado Museum. Traffic from the busy street could not be heard at all and the bed was one of the most comfortable I have ever slept in, The spa was great to relax in after a busy day sightseeing. Staff were all very helpful.", "Date": "January 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "matagorda", "Title": "“relaxing break in madrid”", "Author": "henb71", "ReviewID": "UR53555442", "Content": "Just back from a great trip to madrid , the hotel was nice but the rooms are not very spacious ,there was no bath and after a long day of sight seeing and shopping its nice to relax in a bath. However there was a great big walk in power shower which was nice. The bar was very relaxing and the staff were friendly. There is a lovely thai restaurant called Phuket Thai which is about ten mins walk which was fab in Achocha and we went to restaurant Maria which was also fab in puerto del sol . i would recommend these highly. Starbucks is near the hotel also.", "Date": "January 15, 2010"}], "HotelInfo": {"Name": "Radisson Blu Hotel, Madrid Prado", "HotelURL": "/ShowUserReviews-g187514-d1456437-Reviews-Radisson_Blu_Hotel_Madrid_Prado-Madrid.html", "Price": "$169 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Calle Moratin, 52</span>, <span class=\"locality\"><span property=\"v:postal-code\">28014</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "1456437", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/9a/26/9a2640fa24a25947ebe4faf1c58c28805large.jpg"}}