{"Reviews": [{"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Great hotel!”", "Author": "Buketcicek", "ReviewID": "UR124822964", "Content": "I liked the overall experience! Although the lobby doesn't seem glamorous- it's a bit tight and furnished in wood, the rooms are spacious and look very warm and cozy. Clean and provided with everything you could possibly need. The staff is kind and helpful. A lot of shops in the neighboring area where you can buy food or souvenirs. Definitively a good choice!", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Our First Time”", "Author": "Lee H", "ReviewID": "UR124617477", "Content": "After being awarded some work in Istanbul 5 of us from the UK stayed at the Levent Otel. We founf the place to be very clean, rooms good size, showers warm and the staff we very very freindly. They assisted us with a Mini-Bus for all 5 of us to the Airport and once gain where polite and freindly. We are all returning to Istanbul for the next phase of works and will without a doubt stay at the Levent Otel !", "Date": "February 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Regensburg, Germany", "Title": "“Small rooms, small price, good value”", "Author": "Ratisbonensis", "ReviewID": "UR123866565", "Content": "This hotel is situated in a busy / business area of Istanbul, only 15 mins by Metro away from Taksim square. The rooms are small but perfectly adequate, the breakfast buffet tasty, the prices acceptable and the staff (and the hotel owner) very nice and helpful. It is only a short walk from upmarket Kanyon shopping centre with plenty of international shops and restaurants to choose from, but there are also a large number of very good local eateries around the corner. I can only recommend it!", "Date": "January 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "MUMBAI", "Title": "“Good Hotel, co-operative staff”", "Author": "BINDIMumbai", "ReviewID": "UR98480161", "Content": "A place worth visiting, for Business travelers, which also suits ones pocket. Located within the near by business centre.Wolud like to recommend this hotel for business travellers, as it suits ones pocket & also as it is nearby to the business centre locaitons.", "Date": "March 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Turkey", "Title": "“Clean & cozy”", "Author": "siteg", "ReviewID": "UR69654615", "Content": "Next door to glamorious Kanyon Shopping Mall and only 2 minutes walking distance from subway, this is a very conveniently located hotel, provided that you are a business traveller and has got meeting in the business district of Istanbul (Levent or Maslak). On the other hand, if you would be visiting Istanbul for sightseeing and for major tourist attractions, then you better stick with one of the hotels around Taksim district or the historical peninsula (Sultanahmet). The hotel is one the borderline between top of the line business/shopping district, and a lower income and not so safe Gultepe neighborhood. But where hotel is located is safe, even at night. 3-story new building, with fairly-sized rooms. Furnishings are new, clean, and functional. All rooms have got a/c (a blessing in humid summer days). The modest breakfast fulfills the function - nothing more, nothing less. To complement it all is the friendly and helpful staff. Overall, a 2 to 3-star category hotel, and avreage TL120-130 nightly charge (2 persons bb) is a good value for a city that is famous for its expensive and not-so-good hotels.", "Date": "July 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“recommend it to everyone..”", "Author": "memzo", "ReviewID": "UR63465086", "Content": "I stayed at this hotel in April with my wife and 4 year old daughter and I strongly recommend it to everyone with no hesitation. The hotel is very clean and the staff is very friendly and helpful so I couldnt understand what the review made by 'erasted' was about. The main shopping malls and the tube station are a walking distance away so shopping was fun and also manage to visit Taksim Square, Cevahir and other must see places through the underground. I would definitely stay at this hotel in my next visit to Istanbul.", "Date": "May 7, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Arjantine", "Title": "“Clara”", "Author": "Semanta72", "ReviewID": "UR54485864", "Content": "When I stay hotel levent with my friends and parents in January. All room is very clean everyday and open buffet breakfast is delicious. All personel very quite and friendly. When Ä± come back to Ä°stanbul on July, I will stay otel levent because near the shopping mall, fresh and clean room and friendly staff.......", "Date": "January 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Athens, Greece", "Title": "“very nice hotel , recommend to everyone”", "Author": "veligreece", "ReviewID": "UR48310311", "Content": "from Greece searching hotels in taksim had wanted to stay but could not find the hotel is empty and the place levent hotel and was very good from the hotel, I was very happy and everything was very beautiful in the division have to attend a meeting had levent and for being so difficult transportation access very comfortable comfortable transport a clean room I heard during stay at the hotel new opened and hotel prices very chipper , I have already Extras , drinks not expensive also very close to the metro within walking distance of the hotel ,recommend to anyone.", "Date": "November 2, 2009"}], "HotelInfo": {"Name": "Levent Otel Istanbul", "HotelURL": "/ShowUserReviews-g293974-d1459773-Reviews-Levent_Otel_Istanbul-Istanbul.html", "Price": "$92 - $131*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Talatpasa Cad. Bacadibi Sok. No 7</span>, <span class=\"locality\"><span property=\"v:locality\">Istanbul</span> <span property=\"v:postal-code\">34413</span></span>, <span class=\"country-name\" property=\"v:country-name\">Turkey</span> </span></span></address>", "HotelID": "1459773", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/92/29/92299f5133a7e35230bd75e9877786934large.jpg"}}