{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, England, United Kingdom", "Title": "“March Visit”", "Author": "Roger G", "ReviewID": "UR128473321", "Content": "we booked a room only stay of 3 nights through an online bookings website - 120 euros. The room was fantastic (as the photograph - 10th floor), clean and modern. Yes, the tv was outdated, but who cares. We came by car, and the parking was easy and free. The tram stops were very close by, and took us into the city centre (east side) very quickly. The reception staff were very professional and helpful; unusual I thought for such a large hotel. Even on a short stay, towels were replaced without question. I would certainly stay here again on our next visit to Berlin - not something I would usually say!!", "Date": "April 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Heidelberg, Germany", "Title": "“Affordable Accomodations”", "Author": "dnorton_6", "ReviewID": "UR127980602", "Content": "If you are looking for a reasonable place to stay in Berlin, then this hotel is a good choice. The price is right and it's close to several public transportation lines. The rooms were large and clean, but the TV small and old fashioned (if that's a priority for you). Breakfast was not included in our online booking, but we were able to purchase the buffet for 7.50 Euro (about $9.00) per person at the reception desk - which was well worth it. Free parking is available behind the hotel, so driving directly to the hotel is not a problem. Just be advised that this facility is connected to the Holiday Inn and they even share the reception desk. Depending from which direction you come, you may not see signs for the Grand City hotel. No problem, just look for the Holiday Inn and you will end up in the right place. Enjoy your trip!", "Date": "April 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "", "Title": "“Fantastic value for money”", "Author": "HH H", "ReviewID": "UR127464482", "Content": "Although a bit further from the city the hotel is excellent value for money and very accessible with public transport.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Nice and clean room, great breakfast, very bad pillows”", "Author": "KiRae84", "ReviewID": "UR126670227", "Content": "This March we stayed here a long weekend. From the outside this hotel doesn't look very attractive, but our room was great: enough space, clean, great bathroom, good bed... Except from the pillow. Waaay too thin! But after a call to the reception the staff arrived with a few more pillows. As we are used from Germans, the breakfast was great! A lot of choice in different kind of bread, eggs, fruit, yoghurt etc. The hotel is not located in the city center, but is very good connected with public transport. It takes 10 - 15 minutes to Alexanderplatz.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "France", "Title": "“Excellent hotel for quality/price”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR126582011", "Content": "Excellent hotel for quality/price: nice rooms center is quite close calm and quiet clean competitive price: pay 2 nights and get 3", "Date": "March 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Coburg", "Title": "“Good stay”", "Author": "Thomas F Posted by an Easytobook.com traveler", "ReviewID": "UR126531392", "Content": "All is ok. The rooms are clean and quiet in the night. The breakfast is large and the price is ok. You need 20 min to the centre via street train.", "Date": "March 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Inverness", "Title": "“Poor pillows”", "Author": "Neil B Posted by an Easytobook.com traveler", "ReviewID": "UR125544133", "Content": "Very good value. Little far from city centre but very easy to travel with choice of trams. Friendly helpful staff. Room ok, no hot drinks. Bed let down by pillows. Didn't try breakfast as seem quite expensive an lots of other options available.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Berlin, Germany", "Title": "““Looks good on photos, not in real life””", "Author": "ARKTIKMANN", "ReviewID": "UR124802023", "Content": "Was excited to stay here as the photos suggest a better look and feel. Got a good price on expedia so I took it. Wifi is an extra 10 Euro per day. Upon arriving, it is a bit out of city centre, but easily accessible with buses, taxis, etc. The new restaurant is about the only cool and new area. And good food. The rest is like 30-40 years old, that old depressing look and feel. Carpet in my room is stained. Room, bathroom, sheets and pillows are however clean. The tv must me at least 25 years old and the remote is super retro old at least 30 years old. Interior design is not appealing at all. New tones and colour could do a lot to these old rooms, and get rid of carpets. thats so 80's and full of dirt and bacteria. Surrounding area is the same, old and depressing buildings. Staff is kind, helpful and service orientated and all speak english. I love Berlin, but I would not return to this hotel. Stay in West Berlin: Mitte, Charlottenburg, Prenzlauer Berg, Tiergarten, Ku'damm", "Date": "February 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Reasonable Hotel”", "Author": "G K", "ReviewID": "UR123843557", "Content": "This hotel is actually two hotels in one, it shares the same reception and one building with the Holiday inn Berlin east - which made finding the place a little confusing at first. Hotel seemed a little far out of the city, but it turned to be only 10 mins on the tram (tram runs 24 hours) to Alexanderplatz. There were shops and restaurants around the hotel but you had to look for them. The Holiday Inn restaurant was a little expensive with a boring menu. Rooms were modern, clean and warm. Bathrooms were fine with plenty of hot water. Only issue we had with the place was one of the beds was very uncomfortable due to being well used with springs poking out and offering no support. We paid an excellent price to stay here at new year and couldn't expect any more for the price paid.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“Superb Service ;)”", "Author": "Wandile K", "ReviewID": "UR123762955", "Content": "I really enjoyed my stay at the Grand City Hotel Berlin East. Friendly and helpful staff added a huge value to my stay. Rooms are clean and the service is good. Breakfast, mmmmmm! superb and delicious. Thanks and well done to the manager/s and staff. Wandy", "Date": "January 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Krakow, Poland", "Title": "“Grand because of his value for money”", "Author": "Jon076", "ReviewID": "UR121573305", "Content": "Grand City Hotel Berlin East is a clean and comfortable hotel situated in an unattractive (but come across as being safe) area of Berlin, a 15-minutes tram ride away from Alexanderplatz. When you make a reservation here you'll be given a spacious room but don't expect any modern or fancy furnishing and character. It is very simple and basic 3-star standard (even though some hotel-searchers call this hotel 4-star - it is definitely not), a typically sleep-only, no frills place. What makes this hotel a good choice is: spacious and clean rooms, clean and comfortable beds and facilities, friendly and helpful staff, easy access with public transport to many parts of Berlin (read below). All disadvantages I would call rather small and insignificant like no safe and no minibar in the rooms (but there is a beverage and snack machine in the corridor), unattractive area with no cafes or restaurants (except hotel ones), basic and a little bit outdated furnishing. Overall rating for Grand City East hotel depends of what you expect from this place. Objectively - it's not a pretty, cozy hotel with a unique character, place where you can spend all day. But what makes this hotel really \"Grand\" is not a furnishing but price and its relation to the value - I can say that we paid \"hostel\" price for a hotel private room - 27 EUR/day for a double room without breakfast. If you can book it for a comparable amount don't think too much - take it! Finding Grand City East is really very easy but because I see some people had a problem with it, here are some tips: 1. From the Alexanderplatz take tram M5 (direction Zingster Str.) or M6 (direction Riesaer Str.) After 15-minutes ride gett of on \"Hohenschönhauser Str./Weißenseer Weg\" stop (M5) or \"Altenhofer Str.\" (M6). Don't panic when tram leaves the Landsberger Alee and turns into Oderbruchstr. - it's ok. 2. If you get off on \"Hohenschönhauser Str./Weißenseer Weg\" stop you'll see wide street perpendicular to this on which you got off - it's Weißenseer Weg and on the otherside of this street you should see Renault car showroom. Hotel is just after this place (going Weißenseer Weg you'll se three tower blocks - Grand City East sign is on the first of them. If you get off on \"Altenhofer Str.\" (M6) you have to come across parking and go with a small street. After 2-3 minutes of walk you'll be in place. 3. Check-in. Even though you book a room in a Grand City East Hotel, first you have to go to the middle building of Holiday Inn Hotel and there you'll check in. 4. Even though the hotel isn't in a centre of Berlin it's very good communicated with a lot of parts of the city. You know already how to get to Alexanderplatz. This hotel will be also great for people who come to the shows in o2 Arena. A direct tram (M13) from the crossroad of Landsberger Allee/Weißenseer Weg will you take you on place. You can also chose M5 or M6, go to Petersburger Str. and then change into M10 going to Warschauer Str. If you take this tram in opposite direction you'll go to the Prenlzauer Berg - nice district full of cafes, restaurants and streets to wander. All important information concerned public transport you will find on the www.bvg.de - it's a homeweb of Berlin Public Transport Service (also in English) 5. Our room was without breakfast and as I mentioned I didn't see any place to eat in the surrounding of the hotel. But if you're going to the Alexanderplatz you may get off on the way on Petersburger Str. Here you will find Kaiser market with a fresh sandwiches or bakery shop next to it where you can also eat a breakast for a 3-5 EUR.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Kapellen, Belgium", "Title": "“Holiday Inn??”", "Author": "reymerswael", "ReviewID": "UR120870605", "Content": "We had trouble finding the place. Reason was, tram M5 or M6 left the Landsberger Allee before coming to Weissersee. (Indication was the crossing of the 2 streets). And since no big hotel signs were to be observed we did walk more than 500 meters before we found the hotel, not more than 100 meters from the tram stop. Very friendly reception, rooms basic but complete, only a shower and an old fashioned TV-set. WIFI was available but not free. During our visit, the restaurant was closed but we had dinner at the bar. Very good and at a 20% discount. Tram tickets were to be bought at the reception but unfortunately, they were sold out. Overall, a good hotel for the price.", "Date": "November 21, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "zagreb", "Title": "“high quality for resonable rate at convinient location”", "Author": "bestsZagreb", "ReviewID": "UR118079576", "Content": "only 10 minutes away from alexander platz by tram. an optimized solution in terms of very good service and location.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Great value for 3 star hotel in Berlin - Definitely recommend”", "Author": "VictoriaThreadgold", "ReviewID": "UR117511831", "Content": "I cannot fault Grand City Hotel Berlin East and find that previous reviews are unfair. Firstly, it is REALLY easy to find - take the 10-15 minute journey on tram M5 or M6 from Alexanderplatz and alight at hohenschoenhausstrasse, turn left when you get out of the tram, cross at the crossing then turn right on to Landsberger Allee. You will see the big building with \"Grand City Hotel\" behind the Renault building and you need to check in at the \"Holiday Inn\" Reception even though you are staying at Grand City. The room itself was in excellent condition considering it is a three star hotel and only cost £72 for both of us for three nights (booked via cheaphotels.co.uk). It was spacious and light with two twin beds next to each other which were very comfortable. It even had a small kitchenette with a microwave and fridge, which was very useful as the breakfast is very expensive (17 euros!) so we just went to a supermarket and ate in the room. Wifi is available in the room at a charge. I think the only slight negatives I have is that I found the room quite warm and as we were staying on the 14th floor you could only open the window slightly. Also, the housekeeping staff cleaned the bathroom and did the beds but did not take the rubbish out on any of the days, which would have been nice! All in all, Grand City Hotel Berlin East represented incredible value for money and I would definitely stay there again. A \"Tageskarte\" (daily ticket) on the tram costs 6.50 euros, so this needs to be factored into the cost of your stay to determine whether it's worth doing the little journey, but as we paid so little it definitely was!", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Helsingor, Denmark", "Title": "“Good value for money”", "Author": "WilliamJansen", "ReviewID": "UR112897446", "Content": "The hotel was by far the swankiest room I've stayed in for 38 euros. This is the kind of money, that usually buys you a hostel-type experience, and this felt like a 3 star hotel. The place was quiet for the duration of my 3 day stay, so please use this as a counter-weight to other comments from guests. I loved the place and will recommend it, but have these slightly negative comments to add to the general image of a great stay. A few notes; a non-smoking room was not available in the lowest price-range, so I \"had to\" buy an upgrade for 8 euro. The transport to the city-center is a bit more troublesome, than the hotel website gives you the impression of. I chose to walk to the nearest S-Bahn and from there take to trains to Alexanderplatz. I was happy enough taking my time, but the trains could easily take 30 minutes, if you just missed a train, when you arrive at the S Bahn near the hotel. The internet was troublesome. I could connect to the network 90% of the time, but most of the time I got a very poor download-rate, i.e. I couldn't load a newspaper. It always worked smoothly in the lobby. It wasn't a big deal to me, but it might be to you.", "Date": "June 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Cheap, Clinical and 10 mins on tram to centre”", "Author": "Vicki432", "ReviewID": "UR109167797", "Content": "The hotel was a large conference/business type hotel in an area 10 minutes from the center - we usually stay just out of the center of cities to find better value local supermarkets and restaurants, which give a more authentic experience; but there was none of this to be found around the Grand City Hotel. No shops, no restaurants, just one Kebab stand next to the tram stop. Although the building was huge and could be seen on the corner of the road opposite where the tram stopped, actually finding the entrance was not that easy. Out of the three towers, two were run by Holiday Inn and that was the only thing that there was signage for. After walking around the hotel trying to find check in for GC, we found the GC tower entrance and were directed to the Holiday Inn reception desk. We were allocated a twin room, when we had booked a King sized bed. Upon returning to reception we were moved but advised it was only a double as they did not have King beds in the hotel. The room was spacious, including double bed (with twin duvets as the hotel don't have doubles), TV (English channel - CNN), sink, fridge, microwave and basic bathroom with poor towels. There were two computers in the reception area which could be used for web access, else WiFi was 5 Euro an hour or 9.90 for a day. The best thing about this hotel was the tram stops were moments away and took 10-15 minutes to reach the center running at least every 10 minutes into the early hours and so we didn't have to spend much time in the hotel.", "Date": "May 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Stockholm", "Title": "“Nice hotel a bit outside the city centre”", "Author": "everythingcounts", "ReviewID": "UR87965122", "Content": "It was a nice hotel and great staff that helped us check in earlier than check in time. The room was big and fresh. Close to the tram, and also to night buses. Close by it was some grocery stores, and also some restaurants. Though it was no highlife spot, you need to get closer to the city. The beds were comfortable and the bathroom was big. It wasn’t that modern, it was very 80’s with the interior. Clean and fresh hotel, though it was too far from the city life for my part.", "Date": "November 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Portugal", "Title": "“Big room, cheap hotel, 10 minutes from center”", "Author": "keoshi", "ReviewID": "UR84723870", "Content": "Berlin is cheaper than most European capitals and this hotel is the perfect example. Located just 10 minutes from the center by public transportation (I recommend the tram), it's (very) cheap and offers top quality services. This hotel is run by Holiday Inn and, also due to location, it's mainly a business/big excursion hotel, which mean the rates are lower and perfect for us. Accommodations are among the best I've seen: huge room, huge comfy beds, clean bathroom, a big closet, a big working table, large windows of lots of light, satellite TV; spacious yet cozy. Staff was really pleasant and helpful but it is a big hotel and very busy, so every time we'd have to wait in queue for at least 5 minutes at the counter. I was a breeze to use room service: fast, painless and, again, very nice staff. If you don't mind a 10 minutes commute and want a cheap hotel room with good accommodations this is perfect for you. Would and will go back.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Excellent hotel, highly recommended”", "Author": "Dizzy75", "ReviewID": "UR82048225", "Content": "We stayed at this hotel for two nights in September. We were driving so wanted to stay somewhere outside of the environmental zone and with parking. This hotel was ideal as there is a very large free car park for guests. It is quite difficult to find until you realise it is part of the Holiday Inn. The room was large, spacious and very comfortable and the bathroom was clean with a bath and over bath shower. As the hotel is on a main road the noise was very loud so you could not leave the window open at all (even though we were on the 15th floor). This is not a problem outside of the summer months. The best aspect to this hotel was the service we received in the form of helpful advice from the staff on reception. I asked several times for advice on how to get about / where to go / where to eat, etc and they were incredibly helpful each time. The hotel is quite far out but the transport system is excellent with trams running all night and a tram stop just a few minutes walk away. Highly recommended", "Date": "October 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Denver, Colorado", "Title": "“I regret staying in this hotel”", "Author": "fastpig", "ReviewID": "UR81518860", "Content": "The hotel represents itself as a four star on Hotels.com , 2 at best. They may have nicer rooms but they will put you in a old run down section if you book on line. This is the only thing I can think of to explain the other reviews. They don't use card keys, the room was dirty with stained carpet and a foul smell, won't exchange currency, dryclean, or help you in any way unlike what their web discriptions say. They wouldn't move us to a different room even though we offered to pay more since we booked on line and not though the Holiday inn site. This place was so bad we paid for the week and left. They won't help in any way and wouldn't let us out of the reservation or move us to a different room. I have photo's and will upload Please don't waist your time", "Date": "September 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Athens, Greece", "Title": "“good choice!!!”", "Author": "necrophagist", "ReviewID": "UR78692728", "Content": "Very nice hotel and very easy to reach from the airport!very clean,every day there was room service,a very spacy room,nice decoration and atmosphere,large beds and you could choose the right pillow for you from \"the pillow menu\"!!!also the staff was gentle!and all these to the price of 32 euro per night!!!!well,what one can consider negative was the very expensive internet if you need to use it,the lack of air condition,and the fact that it was 15 minutes with the tram from the city centre!", "Date": "September 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "USA", "Title": "“Great Hotel, but a Hike to the City”", "Author": "Seeker707", "ReviewID": "UR63580119", "Content": "The Grand City Hotel East in Berlin was a great place to stay, in terms of the hotel itself. The staff was very friendly and the rooms were quite big. The bathroom was extremely clean (cleaned every day thoroughly) and the beds were very comfortable. I had two areas of dissatisfaction with the hotel. The first is that it is quite far from the city and anything a tourist would want to see or do. There is a metro system that drops you almost in front of the hotel, but it takes a while to get back and forth and depending on which place you're coming from at the end of the day, you have to transfer at least once. (Also, the public transportation system in Berlin is kind of confusing.) The second issue I had was that the hotel did not provide, soap, shampoo, lotion, or anything else I would have expected of such a large corporate establishment. Maybe they will in the future. That being said, if you have your own toiletries and don't mind being out all day, this is a great hotel! Advice: Our room had a fridge and microwave. Turn right out of the hotel and at the corner (down a small hallway and then down an escalator), there is a grocery store. We bought snacks and sandwich stuff there. Also, when using the metro, do NOT go to the one directly in front of the grocery store. Walk around the corner to the left and get on from there (less transferring, less confusion).", "Date": "May 8, 2010"}], "HotelInfo": {"Name": "Grand City Hotel Berlin East", "HotelURL": "/ShowUserReviews-g187323-d1468164-Reviews-Grand_City_Hotel_Berlin_East-Berlin.html", "Price": "$49 - $153*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Landsberger Allee 203</span>, <span class=\"locality\"><span property=\"v:postal-code\">13055</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "1468164", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/b9/b9/df/zimmer.jpg"}}