{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Singapore", "Title": "“Nice boutique hotel with a great location”", "Author": "ashyees", "ReviewID": "UR132785938", "Content": "The hotel is a good choice if you intent to stay in Mongkok area. Its a 5 mins walk to Mongkok MTR. There's lotsa shopping and many restaurants around that area. The hotel's clean and has free WIFI everywhere including the rooms which is a plus point. Only downside is that there is a staircase at the entrance of the hotel so u need to lug your luggage up and down the stairs, which is fine with me since u only need to do it twice (check in and check out). Also, so note that there is no wardrobe in the rooms, only a standing hanger to hang stuff. Overall, not a bad choice but do note that the staff there are not super helpful or friendly. Haha.", "Date": "June 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Great location and spacious family room hotel”", "Author": "Munmun_Loo", "ReviewID": "UR129586098", "Content": "Been to Hong Kong a few times, and this hotel is the most spacious one that I've ever stayed in. It allow four adults to the room, which we appreciated a lot as there are elderly in our group which required our attention. The room is always clean and tidy after we came back from our shopping anytime of the day. The bathroom is also a plus! It has those jacuzzi function shower heads. As for the location, needless to say, it's just a stone throw away from Langham Place (Shopping mall) and the MTR. Eateries are all over, and if you would like to have a feel of the hustle and bustle of the hongkong-ers typical market, it's just behind the hotel. Within walking distance to Tung Choi Street (Ladies Market) and Temple street. The only thing which is slightly troublesome is the climbing of stairs at the entrance of the hotel. Especially when we first arrived and depart, as we've got to lug our big luggages up and down the flight of stairs. But i'm still willing to go back to this hotel again despite the climbing of stairs! :)", "Date": "May 8, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Terrible service.”", "Author": "Lauryn_Sydney", "ReviewID": "UR124332399", "Content": "Our first impression of this hotel was NOT great. DO NOT STAY HERE if you have Large BAGGAGE. At the entrance there is a flight of stairs and no assistance is offered. We all had large suitcases which has been fine in all other countries we've travelled through, there'd always be porters to help us or a lift system. When we got to this hotel after a tiring day at about 2am we went to reception and asked if there was anyone who could help us girls take up our luggage, the man at reception smirked and said, no, you take it up yourself to your room. Service? Non existent here!!! We had to lug 25 kg suitcases ourselves up the stairs while he sat at reception. Room was basic, sheets were dirty- pen or high lighter marks. Pillow had green/yellow stains on it. Not impressed! On the up side- location is great, right near the heart of Mongkok so awesome for shopping and food, very close to Mongkok MTR. All in all we would not stay here again.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great Family Hotel”", "Author": "Family_of", "ReviewID": "UR121414346", "Content": "The family room we stayed in was perfect for a family of 5. My husband and I plus my three kids. It was difficult to find this kind of hotel that would allow 5guest in a room. The bed linens were clean. The bathroom especially the shower is nice. I would highly recommend this to family travelers that is lookng for a clean and accessible hotel.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Puchong, Malaysia", "Title": "“Every day is a Sunny day”", "Author": "JoanneCfl", "ReviewID": "UR119436867", "Content": "located next to Langham Hotel. 3 min walk to mongkok station (Langham Place Exit). Have food shops that opens till the wee hours in the morning. there is a morning market nearby, opens after 8am, turn right when u exit the hotel, turn right again at the first junction. A convinience shop is located at Langham Place. 10min walk to ladies market, sport shoe market. A short stroll from these markets will lead you to soy street, where you can find lots of local food there. We took the family room, it comfortably fits 4 people. the \"spa\" shower is definatly a plus point! This is a better hotel compared to the other budget hotel pictures that I have surveyed for this area. As for the stairway to the reception area, its just a short fleet of stairs, once up, there is a lift to bring you to the higher floors. No complains. The thing i hope they improve is the receptionist attiude, not so friendly and unwilling to give us more info about the area around the hotel.", "Date": "October 18, 2011"}, {"Ratings": {"Location": "5", "Overall": "2.0", "Value": "1", "Service": "2", "Rooms": "3"}, "AuthorLocation": "muntinlupa city, philippines", "Title": "“Over priced hotel”", "Author": "anne8888", "ReviewID": "UR118198579", "Content": "First, if you are NOT a light traveler, do not stay here. There's a flight of stairs you have to climb to reach reception. When i inquired about booking a bus for airport- the staff told me to take the cityflyer bus which is a 3 min. walk to bus stop. NO porters to help with luggage so be prepared to carry your own stuff. I consider the HKD1000/night i paid for way overpriced. True, there's free wifi. But you can stay in a better hotel and just pay the wifi charge. The decor and size of room is ok. Clean linens, etc. It's kind of a turn off to see there's a price listed for all the stuff in the room- like if you take the notepad holder, this is what you pay. Like this hotel expects their guests to steal stuff or something. The plus of this hotel is free wifi, close to MTR, close to ladies market. If you book, be sure to print a map, if you're coming late night, take a taxi. It's very close to MTR if you know which exit (C3 or C4) and direction to walk- you can get lost easily and locals don't know where reclamation street is. The area is brimming with local flavor, good local restaurants which I liked. But I will not stay at this hotel again.", "Date": "September 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Hidden gem in Mongkok!”", "Author": "Angela_K09", "ReviewID": "UR117819774", "Content": "1. Location: Fantastic location. 2~3min from Mongkok MTR Exit C4. 5~10min walk to the night markets (Ladies Market etc), Nathan Road, Argyle Street and all the good places. Mongkok MTR is strategic as it is an interchange. You have a choice of 2 train lines which saves you a transfer whether its travelling up or down the lines. 35min via MTR to Tung Chung. 15min via MTR to Central. Absolute best location ever I can't say it enough. Lots of food stalls and shops that open till 12~1am. The whole place comes to life after 5pm haha! 2.Cleanliness: No complaints. Everything is in order, towels are changed everyday and the new ones are sealed in plastic bags (not very environmentally friendly though... I would rather use the same towel for a couple of days.) Complimentary shower and shampoo as well as a bottle of water, coffee, tea etc. The toilet has really cool shower stuff as well. You'll find out what I mean when you stay here haha! 3.WIFI: FREE. IT WORKS! AWESOME! I would not hesitate to stay in this hotel again. I stayed in the Family room which is relatively spacious (Hongkong hotels can be really tiny.) and there's sufficient walking space as well as luggage space. The family room has a queen and a single. Very comfy. One tiny peeve. The flight of stairs leading to the lobby. Small issue IMO as I only have to carry my luggage up and down once during the trip. Without the stairs, I would have awarded perfection for the combination of location, comfort and price.", "Date": "September 8, 2011"}], "HotelInfo": {"Name": "Sunny Day Hotel (Mongkok)", "HotelURL": "/ShowUserReviews-g294217-d1474288-Reviews-Sunny_Day_Hotel_Mongkok-Hong_Kong.html", "Price": "$117 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">No.419 Reclamation Street, Mongkok, Kowloom</span>, <span class=\"locality\"><span property=\"v:locality\">Hong Kong</span></span>, <span class=\"country-name\" property=\"v:country-name\">China</span> </span></span></address>", "HotelID": "1474288", "ImgURL": "http://media-cdn.tripadvisor.com/media/daodao/photo-s/01/aa/c6/09/caption.jpg"}}