{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Buenos Aires, Argentina", "Title": "“Amazing Location and View”", "Author": "Kiphtoot", "ReviewID": "UR139951091", "Content": "Right in the heart of the city - near all the cafes, restaurants and bars! We were upgraded to a 'Gran Via' street view which was breath-taking. The lobby is small (it is in a European city centre after all), but the staff were lovely. The best part is having a drink or a snack at the bar - one of the best terraces around! In fact, we had asked locals were to go for a drink on a terrace and they told us to go to our own hotel!", "Date": "September 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leeds UK", "Title": "“Excellent hotel”", "Author": "JGGLeeds", "ReviewID": "UR137627167", "Content": "Central location, excellent room (was upgraded to room 505) and friendly staff. Difficult to find entrance as just around the corner from Gran Via and reception is small but the 2 guys on there were very friendly for the whole week we were there. Location is great for all the shops and bars which don't get bust until well after midnight. Calle de Pelayo had many good bars and restaurants which is very close to the hotel.", "Date": "August 19, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Did not feel welcome”", "Author": "RenHK", "ReviewID": "UR137323006", "Content": "Been there for one night. Did not feel welcome, especially when we came back to the hotel at night and were greated by a very pleasant \"do u stay with us?\". Unfriendly staff. Reception tiny and spooky. Took quite a while to check in. Room ok nothing fancy. Breakfast good though.", "Date": "August 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hull", "Title": "“Central hotel, very welcoming and good value”", "Author": "MarkBell", "ReviewID": "UR136544152", "Content": "Stayed for 2 nights at the end of July, 2012. The room was fine but functional, very clean. Breakfast was included and to a high standard. Enjoyed our stay and thoroughly recommended, especially for the price! Great value.", "Date": "August 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Moscow", "Title": "“Splendid! What we were looking for!”", "Author": "snaked", "ReviewID": "UR131820085", "Content": "Right in the centre - we walked almost everywhere. Spacey room with cute decoration details.  We booked a suite and were really happy about it - windows faced beautiful street Gran Via with Ar-deco style building. Also we didn't hear the street noise as it is situated on the higher floor. Absolute cleanliness! Great breakfast on the top floor in a nice-looking restaurant.  Only two minor complaints are: a tiny reception desk area, with only one, maximum two managers present, which could be inconvenient when a lot of guests arrive simultaneously. And 2 small elevators which were always full or busy, so we took the steps probably all the time we stayed there, but if you don't mind to wait, it's no big deal. Everything else trully met our expectations: clean spacey room, quietness, good breakfast, central position.", "Date": "June 12, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Dont go there”", "Author": "Michael W", "ReviewID": "UR131512127", "Content": "Went for a bit up-market special weekend to Madrid at the end of May and booked the Ada FOUR STAR HOTEL (£493 for three nights) and was totally disappointed. Ordered a Double Deluxe and was give a pokey tiny room in the centre of the hotel on the third floor overlooking the central core of the hotel. Rooms were so dark (with brilliant sunshine outside) that you had to switch the lights on to see what you were doing. Decor of rooms matched the room. Dated, dark and depressing. Reception and lifts are a total farce. Reception tiny. Lifts only accommodate two at a time and are incredibly slow. We walked to our room most of the time. Staff efficient to be optimistic, but certainly not friendly. Asked for an iron and ironing board (twice) on day one together with more clothes hangers (of which we had three). Iron arrived, together with three more hangers, but the hotel did not have an ironing board??????? We were told to use the table which had a glass top. Wonderful multi-jet shower in the bathroom which could not be used because the door leaked badly. After having a basic shower the bathroom floor was flooded. No tea or coffee making facilities in room, no information about Madrid, no instructions on how to use the phone, no free internet. We visited the acclaimed rooftop bar on the first night for a nightcap of two beers. We were not give a choice and were delivered two bottles of unidentifiable wheat beer which was not pleasant. The bill for the two beers was 29€ which we feel outrageous for two drinks we did not want. This hotel is rated as four star rating; I would seriously struggle to give it two stars and have stayed in much better two star accommodation. Altogether unmemorable hotels which I would highly recommend people do not book. A rip off on all fronts.", "Date": "June 7, 2012"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "", "Title": "“Bad Experience”", "Author": "Nicolas G", "ReviewID": "UR131214489", "Content": "The left elevator broke with my little sister (14) inside for hours, the only working elevator was very small and had to wait to get up to the room cuz of the long line of people wanting to go up. Our room in the 6th floor and we had to go pass the bar a kitchen to get to the room, very unpleasant when you have to carry bags and are tired from the trip. The room does not make it any better, very small and the airconditionaire blows straight to your face when you are trying to sleep, I would not come back and neither would my family. My mother wanted to leave and the only reason we stayed was that we had per-payed in advance", "Date": "June 3, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Jeddah", "Title": "“bad trip bcuz of Ada Palace”", "Author": "sulhabib", "ReviewID": "UR131065144", "Content": "was 3 night nightmare ..Was reallyn bad trip first day my wife got stock in Elevator(Left) in the 4th floor and i went down to ask them to open it or my wife she will get dizey and fall down and may cannot breath(has a phobia from closed place) the guy who work in the front disk told me take it easy if you want to fight let go outside and we called the police told them that you want to fight.. i was asking them to hurry and he told me take it easy.. 2- Bathroom are really sucks and leaking all the time.. 3-Rude staff GUYS NEVER THINK About IT", "Date": "June 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Minus a Mini Bar !”", "Author": "jonspeyer", "ReviewID": "UR130400168", "Content": "I would say that possibly Manuel could run a better hotel ....it seems as though there is no true boss.....everyone at the Ada has a bit of attitude and gives off to the customers.....from the reception staff who announce on our arrival that the floor we are staying on is out of order....to the waitress who shuts the breakfast bar off at 10.50am with a slam and not a care for you attitude.......to the roof top bar staff who cannot serve coffee .....why oh why can you not have a coffee on the rooftop while you inhale the scent of a Madrid evening.......its about giving the best service possible not trying to screw the last sodding euro out of the punter. The mini bar encapsulates the Ada......its half full.....and the bit thats missing ( in the Mini bars case was the Gin, Whisky , Wine ) is the stuff that you are after.. In the Adas case its the smile the charm the feeling that they welcome you there! that is what business should be about. Madrid was awesome, noisy and fun. From the Prado to the street marfket.....to the Tapas bar..... As for the Ada PAlace and the Valesquez ( where we were sent for day 1 ) i would say yes.....just make sure you take you own Gin ......ensure you have room not on the Gran Via and if they say that the floor is out of order just say \" non comprende \" and demand a Latte on the Roof! that will get em going", "Date": "May 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Munich", "Title": "“Highly recommendable”", "Author": "idelgado", "ReviewID": "UR129350883", "Content": "Indeed reception is tiny and there are some steps to climb which is not ideal when carrying a suitcase, however it is the most charming hotel. Very nice and clean rooms and the best breakfast I ever had in a hotel, including national products and fresh orange juice. Very friendly staff too. Shame that internet connection is fairly expensive and if it is purchased in the bar it won't work in the room and the other way round.", "Date": "May 4, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Segovia, Spain", "Title": "“Ada Palace Hotel Madrid”", "Author": "Chris G", "ReviewID": "UR129259594", "Content": "The Hotel was a little dissapointing and I would like to share exactly why. It really is not a Hotel at all in my eyes rather someones residence that has been turned into rooms to stay in. Firstly there is no lobby and the front desk isnt even as big as the desk in the rooms. The really most annoying thing was in fact the trouble with the Wifi I had but seriously after a 20 hour journey through, trains, planes, taxis and buses the last thing any traveller want to do is take all their luggage up one last flight of steep stairs which is what greets you as you walk in. If I was running this hotel I would surely employ a Doorman whos only job is to take peoples bags up those darn stairs. My partner is very petitie and there is no way she is getting a 20 kilo case up one stair never mind ten or so. So I was left to take all the luggage up. And then was greeted by three staff! One in the back room! My check in was 11pm so I am sure the staff at that time prefer not to see anyone at all and thats the feeling I got. So checking in I was greeted with very incomplacent attitudes mostly at the fact I didnt speak Spanish I suppose. With rather no explanation or even a map of the area we were handed the keys. If we were a family of 6 or so there would have been no room in lobby almost. The elevators are made for residences not really getting bags up and down to rooms as they are extremely small, tight and slow. Again for just living there it would be fine youd never have luggage. I booked the suite room which is in fact just a double with another room in it that has a separate door and key that opens that also so we got two keys. Leaving the key in that other room and accidently closing the door will lock you out and this happened to us so had to go down and get another key. In the room there is no Service Menu of the Hotels services at all. I managed to work out this is because this Hotel doesnt offer any services whatsoever. There is no Number on the telephones next tot he bed to call to front. This is quite annoying but I just went down each time I was asking about something and well in fact it was because 1. The Wifi Completely did not work in the room at all 2. There is no Iron in the Suite room even. I was given an Iron promptly but with no Iron board so I used a towel and the sofa. The shower in the suite room goes cold every 30 seconds for about 2 or 3 seconds. The suite room TV did not work at all but we could hear the TV in the next room which was actually just another one of those connecting doors that was just not opened which gave the feeling of the people there being right next to you and in fact each room can hear absolutely everything in the other room right down to talking on the phone. If you do business dont get these rooms! I have no idea why but it seems so many hotels cant organise their shower water to stay in the shower and Ada Hotel is a shining example so far as that the shower door has a really nice big gap so that the water can get everywhere. Not to say this is bad but there are sideways jets in this shower as well! that point straight out rather than down but you can only select two of these at a time and without the shower as well so its pointless to have them although it looks styleish using these would seriously just shoot water staright into the bathroom entirely. After actually taking my computer to the much nicer day time staff and showing her it wont connect I was told to go back to the room and call the Free Toll number to fix the problem with Ibahn internet themsleves. Since there is no service menu I had to g back and find out how to call an outside iline which of course is usually 0 but the free number also had zeros so after another trip I was dialling 000 number number and got through to a lady in India! who asked my hotel and country and after about 10 minutes of telling her my IP full name and room number and so on her and I worked it out. This hotel should offer FREE Wifi throughout and forget having to put in your room number and Name! While I was asking about it another guest mentioned he coudlnt connect but I dont think he went as far as I did and gave up. The hotel is quite close to the main sights and streets if you are prepared to walk around 15 minutes or so and we walked to the Plaza Del Sol, Plaza Major, Royal Palace and so on so for Madrid and a day or two the location is on fact fine. I liked the fact the suite room had an outside if what very thin Balcony that you can walk out on around the both rooms and spend a few moments gazing at city life every so often. This also looks right up the Gran Via street if you look sideways from there. The closest Train Station was Gran Via. Their is an advert in the room for a Free iPad with 3G with Apps on Madrid installed that you can use free for the first 24 hours then its 12 Euro a day. But if you stay one day you can get the whole day free and just return it without paying. I found this pretty rare and too good to be true so looked into it but in fact it is true as they expect most people to get it for more than a day after using it. I would have used it for Google Maps only but stayed more than two days so gave it a miss and used a good Madrid road map. There were quite a few bars and restaurants close by the hotel in the back streets to the left as you come out the hotel. Have a great stay and I hope this helped your decision. Thats all and have a great stay", "Date": "May 2, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "MAURITIUS", "Title": "“ADA PALACE - MADRID - Not Interesting Hotel”", "Author": "Micaplus", "ReviewID": "UR129021748", "Content": "When we booked this Hotel in Madrid via Travel Agent, we thought it was ideal place in the center of Madrid. We were disappointed at first sight. With a family of 6 and lot of luggages, no one came to help us at the doorstep. Moreover, the reception is very very small and we had to climb the 6/7 steps to sign the papers, with all our luggages. There were no toilet facilities in the reception area and we had to go on the 6th Floor(Restaurant floor). The 3 rooms were not ready and were still dirty. We had to contact the maid on the 2nd floor to tell her to make the rooms ready. After some 2 hours, we finally entered the rooms. This Hotel is far from the attractions and shops within Madrid Center. The food outlets were some 30 mins walking distance. As we were there in January 2012, the weather was cold. We do not recommend this Hotel unless you stay there for not more than 1 day!", "Date": "April 29, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "", "Title": "“the last hotel you need in Madrid”", "Author": "MarcoTsanginHK", "ReviewID": "UR126186862", "Content": "Though it says it is in Gran Via, it is not that convenient at all. Just a Starbucks nearby and you need to be very understand the area or you cannot find restaurant, shops...alike. Some strange people stay late night nearby hotel area which made me uneasy. Room is OK when you know you cannot expect too much in this price level in Spain, but WiFi is somehow too expensive. It cost Euro 16 for 24 hour connection. Though they provide iPad at very good rate, many visitors prefer to use their own.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "French Riviera", "Title": "“Short on Staff and Management absent”", "Author": "Torero", "ReviewID": "UR125534211", "Content": "ADA is one of my regular places to stay in Madrid. As others have mentionned there are two main motivations to stay here. Locations and quality / price ratio. Location is perfect for several reasons. there are Metro stops a few meters away from the Hotel = \"Banco Espana\" or \"Gran via\". Here you are in walking distance of many museums like the Prado and Thyssen, of sights of interest like Puerta de Alcala, Puerta del Sol, Plaza Mayor, Retiro Park just to give a few examples. Metro takes you there as well. The Hotel is clean and rooms are comfortable. Ameneties in bathroom, Rooms that I have had here have Glass Showers not bath. The shower has a massage ramp. Rooms have flat screen TV but internet is at a cost some 7 € an hour, or 17€ for a full day. There is a Starbuck up the street as an option for Internet and breakfast. I have always gotten a good deal at this hotel at around 100 € a night, sometimes a little less and some times a little more. There is a bar and a restaurant on the 6th floor. No gym. Now for the Negative. If anything goes wrong this place is unprepared and understaffed. The staff on site is abandonned by Management who in NEVER on site. Thare is often just one person at the minuscule front desk. There is no support from a responsible person. On my last trip we had no hot water three days in a row. On the second day the water was brown. The young lady alone at the reception was going out of her mind answering questions and complaints from the entire hotel. The only thing she could tell us was that the problem was beeing worked on and that it would be solved. It took 3 days. e decided to find a solution on our own that second evening so we could shower to go out to dinner. We booked a place across Gran Via at Catalonia Hotel. At the same time one of the two elevators was broken to access the over 200 rooms. Both are very small. So this was a big problem, even more because there was a private party that evening at the Restaurant level. The back up in the small lobby was massive. Shame on management. Shame on supposedly responsible individuals who abandon their Four Star Hotel clients and their employees in the middle of the storm. These individuals have no place in this profession. This is a service profession and their responsibility was to offer solutions when we were in the middle of the storm. Under those conditions I would say the lonely staff was heroic. They could have jumped ship and they didn't. Under proper management this hotel would be an excellent choice.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chattanooga", "Title": "“A really good rest. Good location.”", "Author": "ArtistGirl68", "ReviewID": "UR124650161", "Content": "My room was spotless, and prettily decorated, though very very traditional. The lobby and lift areas are lilliputian, but the rooms and the breakfast situation were very good. My bathroom was white marble and pleasantly lit. Every toiletry I needed was provided. The staff was not only helpful but extremely friendly. We spoke in mixed Spanish English. Breakfast was very, very good and very fresh. I would return.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rome, Italy", "Title": "“Good choice!”", "Author": "MariaA4", "ReviewID": "UR124534724", "Content": "A very good hotel. Perfect location in Madrid center, at the beginning of Gran Via, few minutes from the airport shuttle stop (Plaza Cibeles). The staff was very professional and kind. The room was not so large, but with all the facilities for a perfect staying. Quite and clean. Only a remark about the centralized heating... for me too high and impossible to regulate. The bathroom was clean and with a useful courtesy service. The breakfast was very good, for quality and variety. Maybe a little expensive, but in a very nice position. I image that in summer was very nice to have breakfast in the terrace, on the roof with some of the more beautiful view of Madrid. The internet connection wasn't free... pity!", "Date": "February 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Paignton, England", "Title": "“weekend in madrid”", "Author": "Lally63", "ReviewID": "UR124474100", "Content": "we stayed in this hotel for 4 nights in September 2011. The best thing about the hotel was the location which was brilliant and very well located for the airport bus. I was a bit disappointed with our room on the 2nd floor which looked out on to another building which was very close and made the room dark the decor was also a little bit tired but the bathroom was very good. The hotel had no reception/ lounge area which is a shame. We had breakfast in the hotel which was in a nice restaurant and was very good. The hotel has a nice rooftop bar but be warned it is quite expensive 21 euros for a vodka & tonic & a bottle of beer! I would book this hotel again but would probably book a superior room on a higher floor if possible in the hope of a better & brighter room.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tulcea, Romania", "Title": "“Delightful city , rude staff !”", "Author": "liviusorin", "ReviewID": "UR124334849", "Content": "The hotel has a proper location for city adventure by walking.If you go by your own car it would be a nasty surprise since there's no parking area for this hotel.There're some private parking places nearby but you must be prepared to pay about 30 euros for each day.The room was clean and attractive . The restaurant has a spectacular view over the city. I've spent three nights and was almost OK. The heat was off during last night and left me a bitter taste.The staff from reception was very young and not kind enough.My wife had to carry her luggage by herself in front of their eyes. Quite rude , I could say ! There was no gentleman at all.But on the whole , the hotel is all right.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "stratford -upon-avon", "Title": "“Value for money”", "Author": "giannir", "ReviewID": "UR123291061", "Content": "Although first impressions are important, don't let the size of public spaces can put you off (specially the reception and the lifts). The location of the hotel is very good with the stops of the very convenient Airport Express and the City Sightseeing bus only two minutes walk away. The hotel is within easy walking distance from amost all attractions and eating places. Standard and cleanliness of the rooms are very good. Choice on the breakfast buffet is ample. Staff are efficient and helpful but not very forthcoming (maybe because not fully confident with languages?). There is one particular guy at the reception desk (he speaks good English) who gives the impression that talking to guests is a favor more than a service.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Northborough, Massachusetts", "Title": "“Great time in Madrid”", "Author": "Carlos G", "ReviewID": "UR123036310", "Content": "Ada Palace hotel lobby is very small and maybe not efficient,same as the elevators but the hotel rooms, , the terraza at the top floor and the restaurant is well preserved , charming and high quality . This hotel location is very combinient to walk all around the center and to the Paseo del Prado.In a five mile radious you can walk all around the best sites of Madrid.... The hotel will we choose next time we plan to visit Madrid", "Date": "January 13, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hove, United Kingdom", "Title": "“not as good as on previous visits”", "Author": "davideHoveEastSussex", "ReviewID": "UR122967029", "Content": "This was our third and final stay here...although it offers good value for money I think the standard of service has dropped dramatically. Our room was ok overlooking the internal light well but clearly they have run out of money as a lot of work has not been completed on the site. If this is your first visit to Madrid then book for the location and great roof top bar...otherwise try Room Mate Oscar in Cheuca which is also good value for money and has a stunning rooftop pool and bar", "Date": "January 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "CrstnBeach", "Title": "“Very good for Price; average hotel overall”", "Author": "CrstnBeach", "ReviewID": "UR122425787", "Content": "We had an adequate room, with a small balcony (big enough to stand, not sit). The bed was fine, and despite the large windows, we slept well as they seemed to be well-sealed and at least double-glazed. The location is great, close to several metros and tourist locations. Another positive is that we could control room temperature with own thermostat, which I don't always expect in smaller older European hotel rooms. We arrived at 10 am and were pleasantly surprised to be able to check in early. The front desk staff were very nice; we departed late the following day and left luggage unlocked for about 10 hours without concern. The elevators are small - my husband and I had to take separate ones as we each had our own suitcase.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Heidelberg, Germany", "Title": "“Great location, great price, beautiful room”", "Author": "MaryH16", "ReviewID": "UR122088687", "Content": "My primary concern was location. I wanted to be able to walk to the museums and other amazing sites in Madrid. I was not disappointed. The room was clean and well appointed. It's not very often my room looks exactly like the pictures. The roof top bar has amazing views of the city. The only issue was construction going on outside our room - a loud beeping awoke us at 7am on several days. But this was not within the control of the hotel, and what you sometimes encounter staying in the city center. There were many great bars within walking distance and the neighborhood was fun to explore. The staff was fine, I didn't have any issues so I didn't interact with them much, but they provided maps and suggestions. Definitely worth the money!", "Date": "December 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Connecticut", "Title": "“Clean, comfortable and spacious”", "Author": "JRock2", "ReviewID": "UR121362792", "Content": "Booked a suite via booking.com and was pleasantly surprised. The two rooms were perfect, plenty of room for us and the luggage. Quite inexpensive. Didn't have the problem with the shower/bathroom floor as previous posts did. No complaints - would definitely stay again.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bulgaria", "Title": "“Perfect ;)”", "Author": "ZarinaBulgaria", "ReviewID": "UR120625671", "Content": "Great hotel, perfect location. The hotel is close to everywhere. Very helpful and friendly staff with a lovely sense of humor. Excellent breakfast, huge rooms, nice shower, very comfortable beds. Very clean. The hotel offers more, than you pay for, I will visit it again for sure …", "Date": "November 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“A good hotel”", "Author": "pejko123", "ReviewID": "UR120469244", "Content": "A nice hotel in the middle of Madrid. On a noisy road, but the windows are double or triple glazed so you don't notice it too much. Our room was large, with a comfortable bed and very clean. The bathroom was large and the shower was a real power shower with jets that go down the wall and come out at you! However, the glass door to the shower did not fit correctly and therefore the bathroom floor got water on it. The breakfast room is on the top floor with good views of the city. The breakfast itself is good, plenty of choice of meats, cheese, fruit, yoghurts, fresh pasteries etc. Overall a good hotel, situated in a convenient spot.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Fife Scotland", "Title": "“Great Hotel/Location”", "Author": "libraryasst", "ReviewID": "UR120378132", "Content": "Just came back from this hotel and we had a great time. The Hotel is 5 mins walk from the Gran Via the centre of Madrid. The hotel reception is small and the lifts too but these are the same as there sister hotels so nothing new there. Our room overlooked the metropolis building and was lovely, the tv has an english music channel - 10 and the tv also has pay per view films should you like a night in. As per a previous review should you require a drink for your room go to the Corte de Ingles in the supermarket and they sell wine, beer and spirits. The room bar service is expensive being rum drinkers they wanted 12 euros for a small bottle you would get on the plane! The breakfast was good with a selection of cold meats, cereals, juice and a small hot buffet, the breakfast setting is lovely and the view over the city breathtaking. This hotel is in good walking distance to the main and surrounding areas. Overall I would definately go back, the Santiago Bernabeu for the game was amazing the atmosphere electric and the metro trains run every 5 minutes so no problems there. The tapas bars are friendly and when you order drinks, normally they give you small plates of food to accompany the drinks so overall not an expensive night. My husband had a Baileys due to be a little hung over and the measure he got for 5 euros was like 4 nips it filled half a brandy glass ;-) the tapas excellent to we went to El Labriego a few times, small friendly and very spanish, at the top of the Gran Via at the square is the Corte de Ingles diagonally across walk up the street, at the end of the street and turn left. Lovely City and the people helpful.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "sweden", "Title": "“Convenient hotel”", "Author": "pyttanSweden", "ReviewID": "UR120339771", "Content": "This hotel has a good location, close to everything. The room was clean and the beds were comfortably. Breakfast was rich and nice. The staff.was helpful and spoke English.fluently. For a good price,100 euro/ night, you can without any doubt book this hotel.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Ray”", "Author": "Rayenpalma", "ReviewID": "UR118789965", "Content": "The hotel is fab, but whilst there for the weekend we were not able to use the terrace bar due to private functions. The security on the doors were very rude and night porter didn't care lees! When i complained aa was tole to use a back entrance to the hotel to use a small part of the terrace! It is very bad the out of the whole weekend we couldn't use the chill out terrace! I feel cheated and was treated badly by staff!", "Date": "September 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Better than hoped!”", "Author": "BranstonLB", "ReviewID": "UR118539811", "Content": "My friend and I have just returned from a week's stay at the Ada Palance. First impressions made our hearts plummet we entered the hotel by a tiny small door up a flight of steps to a very small reception area. Booking in was very efficient. Up to our room on the third floor, wow, a small corridor with a desk and table lamp, then into the main room with a very large wardrobe, containing a safe, then the bedroom two queen sized beds with plenty of room to move around in, in addition we had a chair a two seater settee with small side tables and table lamps then their was a coffee table a mini bar and a flat screened TV, the soft furnishings all matched and the curtains certainly kept out the sun first thing in the morning. The bed linen was clean and fresh the bed was comfortable but firm. The bathroom was a good size with a hairdryer and a good selection of toiletries. The only thing we would have liked, even though not essential,was a tea and coffee making machine.. the breakfast room/restaurant/bar was on the 6th floor which was fabulous the decor, seating views etc where wonderful. The 7th floor terrace was even better. Breakfast is/was a buffet. A large selection of coffees, teas, juices where available. You could even have churros and chocolate if you wished. Hot dishes where bacon, sausages and scrambled eggs which where absolutely amazing. the toaster worked extremely well toast was done perfectly. A good section of cold meats, cheeses and bread. plus cereals yoghurts and pastries. Staff were pleasant and always neatly turned out. Whilst talking to a member of staff we found out that the building was originally a gentlemans club and they sold part of the building to a hotel chain, however the club continues to use part of the building and it has retained the grand formal entry to the building, do walk up the Gran Via in the evening and have a look, it is beautiful, marble and chandelires. Which explains why the hotel entrance is not very grand. Location was , for us, perfect we could and did walk to all of the sights, The Tyssen and Prado [Retiro & Royal Gardens] where a 10 minute stroll/walk away. The Real Palace, Temple of Dehob where about 20-30 mins away. The view from the Palace of Cibele was a few minutes away. Plaza Mayor and Puerto de Sol weren't far away either. Do go on the Madrid bus trip it gives a good overview of the city. The Reina Sofia museum was our least favourite , however if you like modern art go, Try the cafe Riojana [or similar] on the Cala Mayor and try the cafe Mallonquin on the Puerto del Sol. El Rastro was disappointing. we would definitely return to this hotel", "Date": "September 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Old world charm”", "Author": "mjmusic", "ReviewID": "UR118374620", "Content": "Hotel Ada Palace is in a great location, close to major attractions and shopping. The room was spacious, a little noisy as we could hear doors slamming. The rooftop bar is stunning, and a must do even if you are not a guest of the hotel. It can get a bit busy after dinner, yet we could hear nothing from our room. Unfortunately the wifi and movie on demand did not work for the first 3 days of our visit, which was a tad inconvenient but did not ruin our holiday. Reception staff were welcoming and very helpfull. Overall, we would stay there again.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Preston", "Title": "“Lovely room .... shame about the facilities”", "Author": "allthejs", "ReviewID": "UR118056704", "Content": "The room was very spacious, well furnished, and well-equipped, though it did smell of cigar/cigarettes. The bathroom was clean and spacious with a great supply of complimentary toiletries. The staff were helpful. The lobby and lifts were small as has previously been commented upon on Tripadvisor. Unfortunately we stayed on a Saturday when the public areas of the hotel, i.e. roof top bar and restaurant were booked for a wedding party and we were told that we could not use the bar until 12 midnight. On the Sunday the main roads around the hotel were closed for most of the day due to a cycle race. It would have been useful if we had been forewarned by the hotel staff of these two events so that we could plan our itinerary for the weekend.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "2.0", "Value": "2"}, "AuthorLocation": "Porto, Portugal", "Title": "“Bad choice”", "Author": "mjrfs", "ReviewID": "UR117903633", "Content": "The hotel doesn´t have a place to park a car even for a couple of minutes to take out the luggage. We had to stop the traffic and excuse us for the trouble, because the street is narrow. Room 312 smells like a discharging pipe (!) and nobody was able to fix it or offering us another room. Beyond all pardon, because I claimed and I am sure that they know the problem very well. Three nights, payed ahead. This was the first and the last time! Usually we stay at Hotel Arosa (Best Western), in Gran Via. Much better and a low price.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "2"}, "AuthorLocation": "Russia", "Title": "“It was Ok, great location, but unfriendly staff”", "Author": "Alexandra12345", "ReviewID": "UR117776256", "Content": "We stayed in Ada palace with my friend. For the money we payed it was ok. Just the steps when we arrived (and we are two girls with two big heavy bags) we had to handle our self's. Taking into account that there are many places in Spain where you have to carry your bags on your hands (underground, steps, hills) you expect somebody to help you in the hotel, especially in 4 star hotel. It is very clean and nice inside, though the reception is too small and the lifts are small, so there s practically always a queue. At the reception desk you can meet two nice members or one tough and quite rude guy. It s all up to your luck. The location for tourism is great, but there are many different hotels in that area, so if you want something more special, then it is not Ada palace. Plus they write that they have free wifi, but that s a lie.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Nice hotel but...”", "Author": "gigisulivan", "ReviewID": "UR117449602", "Content": "It was one day stay (last day of our short honeymoon). Hotel was easy enough to find. The hall, well lack of it, is not impressive at all. We were disappointed to find out suite I have booked (paid for) has only twin beds the did not have free suits with double bed. Hotel did not offer us a free upgrade but a downgrade to Superior room overlooking Gran Via ( will see if I get a refund in few days) + free breakfast (my wife said it was good). I dont recommend this hotel if you are claustrophobic as the elevators especially one of them are really small and quite slow. Luckily room was spacious enough, with nice big shower cabin. Very nice view of Gran via. Bed was comfortable and we slept well. Good choice of tv channels and pay per view etc if you are looking for something like this. Internet/Wifi is not free. They have a nice roof bar and restaurant is ok on 6th floor. I have been to Madrid before but this was first time in a hotel so I cant compare it to other ones. Because of the reservation issue I dont know if I would stay there again.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Highly recommended!”", "Author": "Ksu_icu", "ReviewID": "UR117337810", "Content": "Our stay was perfect. Hotel is in the center of the city, very close to everything, close to metro station. We had a superior double room, with the view of the city. It was really amazing. The room was spacious, with a great view. Hotel also has a great terrase on top, where you can see the whole Madrid. Overall, the hotel absolutely met our expectations from what we saw on the pictures on their website. It was a very pleasant stay. I would definitely stay there again.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Wilmington,NC", "Title": "“We would stay here again.”", "Author": "helenbrum", "ReviewID": "UR116404194", "Content": "The Ada Palace is in a wonderful location for exploring Madrid. Ask for a room with a view of the Grand Via.. Parking is a problem if you are arriving by car, but the location makes it worth the trouble. the security guard was so helpful the morning we left. It was early and he stood outside with me while my husband went to get the car. He helped load the luggage also which was great as there are no bellman at the hotel. We also left a shirt and new pair of Escada jeans in the room. When we got back to the states we emailed our friends who were there for another day and asked them to check with the desk to see if they had found them. Within 10 minutes they were delivered to their room. The honesty of the staff is to be commended. If in Madrid I would stay here again. Thank you to the staff.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Rovereto", "Title": "“Very good hotel in a perfect location”", "Author": "B_D_Italy", "ReviewID": "UR116306047", "Content": "Excellent location, at the very bottom of Gran Via (just opposite Metropolis building and a few steps away from Banco de Espana metro station). The room was spacious, clean and with a nice bathroom. The reception staff is really friendly and helpful. Breakfast is often not included in the price, but although a litlte expensive in my opinion, is extremely good.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Normal, Illinois", "Title": "“Unsafe -- Don't stay here!”", "Author": "EAFrost", "ReviewID": "UR116124174", "Content": "While the location of Hotel Ada Palace is excellent and the facilities are nice, this was ultimately the worst hotel experience I've ever had. We checked into the hotel late and went out touring the following day. When we returned to the room in the late afternoon, both balcony doors were swinging open and one had been pulled off its hinges. (Strangely, the room had not been cleaned although it was late afternoon. In hindsight, it seems strange that the maid was not the one to discover the room had been broken into. Having read some other reviews, I wonder if this hotel has a serious theft problem.) Luckily, nothing was taken. We immediately reported the incident to the front desk staff, who seemed unsurprised. They sent a repair man, who fit the broken door back into place and lectured us not to open it, then left. Feeling vulnerable, we packed our things and asked to be moved to a room without a shared balcony. The woman at the front desk thought this was a highly unreasonable request. She informed us that incidents like these are why they provide combination safes in the rooms. After a few minutes of arguing, a manager came by and told her to give us a new room. She did so, but made a big production of it and certainly never apologized to us for the incident. The following day, not wanting anyone at all in our room, we put out the do-not-disturb sign while we were out. When we returned, a maid had cleaned our room. Nothing was missing, but we were nevertheless disturbed. Upon checking out, the same woman at the front desk tried to charge us for items taken from the minibar in our first room. (We didn't even know there WAS a minibar.) When we argued, she did agree to remove the charges (though we are keeping an eye on our credit card and don't know yet if she was true to her word). Between the breaking-and-entering incident, the general unfriendliness of the staff, the leaky showers, and the outrageous price for Internet access, this hotel was a terrible choice. Steer clear.", "Date": "August 1, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Duisburg, Germany", "Title": "“Nice hotel”", "Author": "hgaur", "ReviewID": "UR116069498", "Content": "The location of the hotel is very ideal for tourists. . It was within easy walking distance of the Prado Museum and Reina Sofia Museum as well as shops, department stores and other restaurants. The front desk staff was cordial, friendly and spoke English. The room was also elegantly designed. We enjoyed our stay here.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "dublin", "Title": "“nice hotel nice location”", "Author": "loughlin", "ReviewID": "UR115949725", "Content": "great location on the grand via... booked 3 rooms all grand, help staff though internet is very expensive, had breakfast stayed for 3 days would go back, but watch out ....they have a lovely terrace bar on the roof worth a vist but be prepared to pay €7 per drink including water!!", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Amman, Jordan", "Title": "“Not bad - not a 4 star hotel”", "Author": "Hijjawi", "ReviewID": "UR115435937", "Content": "It was great to find staff that speaks english fluently and was very helpful when it came to hints about the city. Location was great, we could see the Gay pride parade from our balcony! Unfortunately, many things - as follows: first, we were promised a 24m sq on our first stay in madrid (as per booking.com confirmation email) this was not the case at all, as seems the only room that had a king size bed that was booked for us in the smoking rooms floor was extremely tiny (we had t put the empty suitcases in the bathroom under the sink!) the most horrible thing was the connection door with the next room, which - although it seems the room was more of a service room than anything else, left little to imagination when it came to noise, we could even hear the fridge door close! It was annoying especially that we are honeymooners- which we mentioned in an email sent to the hotel on purpose two weeks before our stay - and which remained unanswered - also no special treatment of any kind - not even a silly thank you note - was given! :( whant annoyed us even more is that when we booked the hotel on our way back (one day only before we left) we were very picky about the room so we got a room for twice the size of our first stay room...however with separate beds! For those who wish to avoid the connected rooms, advise you to stay far from room 307 and 306. the 308 room was vaste but has separate beds.", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "London", "Title": "“Good value in central Madrid”", "Author": "ViewfinderLondon", "ReviewID": "UR115385574", "Content": "The lobby staff were very pleasant and helpful but the waiters had the same un-smiling attitute that is very common in Spain though they were quite efficient. We had a double deluxe room overlooking the Gran Via. The room was very nice - though small but the sound insulation from the window was poor meaning that there was quite a lot of noise from the street. Some rooms had windows that didn't close properly making the problem worse. Wi-fi is certainly expensive at about 17 Euros for 24 hours. Our room rate didn't include breakfast which was 15 Euros per person. But this included fresh orange juice and a hot and cold buffet and I thought that for Madrid it was reasonably good value. The hotel is nicely decorated though it's beginning to fray a bit around the edges. Overall we enjoyed our 4 nights at the hotel and I think the Ada Palace is good value for this part of central Madrid", "Date": "July 15, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Doesn't deserve 4 stars!”", "Author": "Weightofyourskin", "ReviewID": "UR115135027", "Content": "The good : the location is very convenient and our room was nice. That being said, we felt very disappointed by how cold all the staff were. I don't typically expect \"service with a smile\" outside North America but there wasn't a hint of friendliness from anyone. Our first morning there we were woken at 8 AM by a cleaning lady pounding at the door to give us more towels. I'm really not sure why she couldn't wait until we left the room and someone would come in for housekeeping anyway. Also, their charges for Internet use are RIDICULOUS. I think free wifi should be the norm - we've had it at all the other hotels we've stayed at in Spain - but to charge 6.95 an hour for wifi or 3.50 to use the lobby computer for 15 minutes is highway robbery. I would not stay here again or recommend it to a friend.", "Date": "July 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Spain", "Title": "“Spectacular View, Warm room”", "Author": "Rebrites", "ReviewID": "UR95950666", "Content": "Maybe we got such a deal and such a view because we booked on a weekend in February. This was my husband´s birthday weekend, which co-incideded with an important football match that brought us to the Big City... so I pulled out the stops. The hotel did not disappoint! The greatest point was the view. We were in room 203, (a \"superior double\", which cost only 8 more Euros than a standard double) with a spectacular view of the landmark Metropolitan Building right across Gran Via from our windows (and the Circulo de Bellas Artes as well), two French windows onto balconies, Awesome. I expected the Gran Via to be noisy, but the soundproofing was excellent. The service was what you´d expect from a four star hotel. My only complaint was the lack of free WiFi, and the heat... the room was HOT day and night, and the thermostat in the room did not respond. We had to open windows to ventilate, which let in noise and traffic fumes as well as cool air. Desk staff responded after a couple of hours, once the open windows had solved the problem. Still... fab location, great view, clean and round-the-clock staff... super value in the center of Madrid. I will be back!", "Date": "February 8, 2011"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "santander", "Title": "“NEVER COMING BACK. Pay attention to your booking! Terrible client service”", "Author": "myhotels", "ReviewID": "UR93443390", "Content": "Ada Palace had become one of my favourites in Madrid for work and pleasure stays, and I thought I was a good client...but...I booked a room for a business meeting last october for a set date. One hour later, my meeting was moved on to the following week, and I contacted the hotel in order to change my booking. The sayed my booking was a non-exchange, non-refund policy and that they would not change my datos for the following week, and that they would keep all the booking charges made in my credit card! I even offered to pay an extra charge if necessary. But no, finally they charged me one night and didnt change my booking! Nearly 150€!!! I sent the reservations manager a formal complaint through email, but his reply was the same. NEVER EVER COMING BACK.", "Date": "January 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Thessaloniki, Greece", "Title": "“Great location great service great hotel!”", "Author": "NikiSym", "ReviewID": "UR89200944", "Content": "We were very lucky to choose this hotel for our little vacation in Madrid. The hotel is centrally located in a very safe neighbourhood, from where we could easily reach by foot all of Madrid's worth seeing places. The superior room, that we booked, is spacious, full of light, with wonderful view to Metropolis building. Very clean rooms, smiling stuff, good breakfast, elegant bar, we couldn't ask for more. Just a piece of advice, don't be alarmed by the reception desk. Don't hesitate to book this hotel, it worths every cent you 'll pay!", "Date": "December 6, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Overbooked and zero service”", "Author": "MarttiLeh", "ReviewID": "UR83800564", "Content": "We arrived the hotel late in the evening. The girl in the reception told us about problems in aircon etc, and that she could not accommodate us. She asked to take taxi from the street (it would have been nice gesture to arrange the taxi for us to the hotel...) and offered the room in their other hotel (Gran Hotel Velazquez) not so centrally located. Also promised that we can have the room next day after it is repaired. Next day when we tried to return to the hotel they said it was fully booked. Even in Spanish standards this was a really bad experience. I would have accepted the reason that they have to fix our room but instead they choose to lie to paying customers.", "Date": "October 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Excellent hotel with great location!”", "Author": "Bert1826", "ReviewID": "UR78009605", "Content": "We arrived in Madrid Friday afternoon and weren't staying long since we were flying back to the States Saturday morning. About a 10 minute drive from the train station (7 euro) and it was a beautiful drive. We were on the 6th floor, next to the restaurant / bar which was odd but ended up being fine. The service was helpful and the hotel was beautiful. For the price, the rooms were very clean, pretty and very large. A bit loud on a Friday evening on Gran Via, but Real Madrid had just won a game(?). The rooftop bar looked beautiful, as did the restaurant, with excellent views. The location is great - we never took the metro, were able to walk everywhere we wanted to.", "Date": "September 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Good value for money”", "Author": "Pinkelaars", "ReviewID": "UR74344647", "Content": "The first night we stayed there, we were in a small room with broken airconditioning and somehow (it was raining in madrid) the room would heat up incredibly so we were not able to sleep. The showers leaked as well. The next day we asked to get another room and we got one. This room was very pleasant and I liked the breakfast at the roofterrace very much. Except for the entrance I think the hotel looks good. We did pay a third the normal price for our room, and I think we couldn't get a better place for the money. So I don't think all the rooms are equally as comfortable, but the location (except for Retiro and museums, also close to Chueca) and everything else makes up for it.", "Date": "August 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "santander", "Title": "“A hidden gem..”", "Author": "myhotels", "ReviewID": "UR70727033", "Content": "A great hotel at reasonable prices, I have stayed a couple of times this year, and so far, so good! Great ample rooms, great breakfast and bar area overlooking the madrid roofs..at the Gran Via What can I say...well, the lifts are tiny, buy hey..who cares?", "Date": "July 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Seattle", "Title": "“Don't expect much”", "Author": "SeaTraveler1", "ReviewID": "UR69297281", "Content": "I stayed at this hotel for four nights. The service was extremely poor, attention to guests needs is something they just do not do, the 6th floor restaurant no way, and the rooms are just too small. Next trip to Madrid, I wont stay at this place.", "Date": "July 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sao Paulo, Brazil", "Title": "“Couldn't ask for more”", "Author": "dbhgirl", "ReviewID": "UR66806804", "Content": "I loved the hotel, the pictures show exactly what you will have there, beautiful and clean rooms, bathroom is really nice, amenities are great, staff is nice, breakfast was not included but I paid and it was worth it. The location is excellent. There are some nice shops in Gran Via near the hotel. The entrance can be a little misleading, but once you get to your room you forget about it. The terrace is very nice for a sunset wine experience. I wish I stayed longer.", "Date": "June 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Birmingham, Michigan", "Title": "“This is a fantastic hotel with excellent service”", "Author": "lpalad", "ReviewID": "UR65474332", "Content": "a great location at the start of the gran via Excellent room & big with terrace overlooking the gran via. very quite room thanks to double glazing. a deffinate 4star hotel with a very pleasent ambience & staff. Breakfast (buffet) was also excellent. Look forward to returning to this hotel", "Date": "May 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wexford, Ireland", "Title": "“Great breakfast!”", "Author": "Trasa8", "ReviewID": "UR64928290", "Content": "Well the first night none of the key cards worked on our floor. Had to keep going down to reception when we wanted to access our rooms. Very annoying, no apology from staff. Rooms clean, bar lovely, balcony view excellent in lounge area. Staff efficent, difficulty with english was a big problem, we had to draw diagrams to explain what we wanted! Breakfast was superb.Nice mix of people in hotel, mostly Spanish, didn't see any children during our four nights there. Hotel is close to all the shopping and sights around Gran Via. Building work next to hotel, woke us at 7-8 a.m each morning, be aware of this if you plan to book as it looks like it will go on for some time to come.Ask for a room to front of hotel. We had a lot of problems during our stay, we also had an extra night due to the volcanic ash cloud delaying our flight. Despite all that we loved the hotel! and found ourselves missing it when we came home..I would recommend this hotel if you can get a good rate and good room with breakfast.", "Date": "May 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“An elegant central hotel with a terrific terrace and views.”", "Author": "berkiDublin", "ReviewID": "UR63182173", "Content": "Very pleasant hotel in the city centre. We had a quiet inside room looking into a surprisingly well kept inner courtyard area. The room was comfortable with a good bathroom and air conditioning. The lounge/bar and dining room are on the sixth floor and have terrific city views and lovely terraces, a sunny one for breakfast and a larger one that serves as an outdoor bar area. The breakfast buffet was top class, lots of variation in breads, pastries, meats, fruit, cheeses, juices, yogurts etc. The hotel is very central, we walked the short walk to the Prado and other main museums and also to the Rastro market and shopping areas. The staff were courteous and the reception staff in particular were very helpful. Enjoyed the stay very much.", "Date": "May 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsburgh, PA", "Title": "“What a lovely surprise”", "Author": "liza2408", "ReviewID": "UR62023410", "Content": "This hotel was such a surprise. We expected a kind of hole in the wall for the price and location in such a city, but once we entered the tiny lobby, we were heartened. The busy and efficient front desk clerk spoke good English with a smile and was dealing with several travelers whose plans had suddently changed because of canceled flights because of the volcanic ash issues, however, she took her time with each customer which we knew she would then do with us when it was our turn. The \"lobby\" was tiny, the elevators even tinier, but the room was completely lovely with 2 larger than twin beds, a large window opening on to the Gran Avenido 4 floors up, and to beautiful sights, (noises), and architecture; the batroom was big (although the shower doors leaked water on to the floor), and there was a little couch. Maybe because we had come from much starker rooms in Morocco did we think this place was perfect, but it was, and I will definitely stay here again. The clerk was helpful every time we had a question, even though she was swamped with needy customers the two days we were there. The breakfast buffet was lovely -- cakes, fruit, cheeses, meats, sparkling wine, breads, coffee, juices, and eggs -- in a separate alcove from the well laid tables in the dining room. The location couldn't have been better --right on the bus line, near the metro, on wide avenues with wide sidewalks and taxis, near the hop on/ hop off tour bus, and shopping and people watching. The Latino area was just blocks away as were the museums and promenade. And we found in the next block a perfect tapas place for a perfect evening's entertainment. This hotel was lovely.", "Date": "April 20, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Italie", "Title": "“Will never come back!”", "Author": "EclairChocolat", "ReviewID": "UR48842105", "Content": "Our stay in this hotel was kind of special, got a two bed room for a couple on a special anniversary. They promised a higher category room for the next nights which we didn't get. We came back to do the change and got an even smaller room with one bed though. Got the feeling that if you don't pay full rate they don't care about you at the front desk, not a 4 star hotel service! The only good stuff is the breakfast in the morning, nice big bathroom and the staff is nice. The location is great walking distance from the center....though you have a lot of hotels in Gran Via which are for sure better.", "Date": "November 9, 2009"}], "HotelInfo": {"Name": "Hotel Ada Palace", "HotelURL": "/ShowUserReviews-g187514-d1479574-Reviews-Hotel_Ada_Palace-Madrid.html", "Price": "$107 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Calle Gran Via 2</span>, <span class=\"locality\"><span property=\"v:postal-code\">28013</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "1479574", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/9d/43/9d43b47a0cc2a44bd0ee1786547328c84large.jpg"}}