{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "netherlands", "Title": "“This Hotel Rocks!”", "Author": "miss-zwatanika", "ReviewID": "UR128429546", "Content": "Good food, good beds,nice people, lovely restaurant, free wifi, late check-out. Tv is tiny and nailed to the wall!Breakfast buffet was super good, in the evening there was a clybby vibe in the bar.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wicklow", "Title": "“Bit hipsterish but good!”", "Author": "rarabug", "ReviewID": "UR128421532", "Content": "My boyfriend and I stayed in one of the loft rooms last November for 4 nights. The hotel is very cool and had a lovely laid back feeling. The room was pretty nice and big for how reasonable it was- although the quality of some of the fittings weren't amazing it was clean and had some really nice design features. (Actually the entire hotel has some really nice design!) It's right beside the U-Bhan and really easy to get to. Situated in the middle between city centre and arty Kreuzberg. Breakfast is a bit pricey but worth it. The only negative was that the cleaners left the window open 2 days in a row in our room. So after being out all day in the freezing cold we got back to an ice box of a room! But once I complained they apologised and offered us a chocolate mit rum! Overall it was a great hotel-good fun (bar stays open pretty much all night) and I would recommend it to other couples and groups, probably not families with very young children though. It is a bit of a hispster hang out but sure it just made for a more entertaining stay!", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Abu Dhabi, Abu Dhabi, United Arab Emirates", "Title": "“Cool, funky, arty, atmospheric hotel”", "Author": "Frank P", "ReviewID": "UR127711035", "Content": "Was only here one night, but the place feels special from the moment you walk in. Staff were all extremely friendly and when we decided to chill for breakfast or some drinks we met lots of fellow travelers. Rooms were clean and cozy. Highly recommend this place if you are looking for something a little different.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“You have no right to call yourself a \"hipster\" until these 2 things happen:”", "Author": "the_real_bohemian", "ReviewID": "UR127682432", "Content": "1. you visit/move to Berlin 2. you stay at/hang out at the Michelberger. Just call this place the hipster mothership. OH I forgot - hipsters would never call themselves hipsters. OH so sorry. Well if the shoe fits... Myself - I most, absolutely, do not fit into that category, however I do love me a fancy, not trying to look fussy designer hotel so when I landed in Berlin the Michelberger was the only option. I mean look at their front entrance. How could you not love a place that welcomes you with \"New S**T Has Come to Light\"? OK so to be serious for a minute here are my thoughts on the Michelberger as a hotel. 1. Good location more or less. Across the street from a subway and down the street from the train that connects you to the main station (prob. 15 mins). 2. Daytime staff is cool. and friendly. Of course they are international hipsters. Hipsters speaking English, German, Italian, Spanish, Hungarian, etc... take your pick. The overnight staff however is this decidedly \"not cool\" older dude (who only speaks German) prob cause all the cool kids are hung over from some \"art pahtee\". 3. The \"cozy\" room is compact and has all you need. Most important the queen bed is nice and firm (and could be quite kinky if you have 3) with a view of your showering buddy for those into that kinda thing. 4. WiFi is free and fast. 5. the place is hopping! There is a restaurant and cafe and bar. IMPORTANT!!!! If you want to actually sleep make sure to get a room that is NOT facing the courtyard as there are people partying there until 4am. If you plan on joining them - never mind. 6. Finally the breakfast buffet (not free) is actually one of the best hotel breakfast buffets I've seen in a very long time. Lots of choice and very delicious. Also the people watching in the morning is quite the riot - I lost count of the ironic T's, arty giant glasses, etc... Have I mentioned that the staff here are more friendly than you have the right to expect them to be? I was half expecting to hate this place but ended up liking it in spite of the trendiness. So take what I have said under advisement and just stay here already!", "Date": "April 11, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Berne", "Title": "“Really cool place”", "Author": "nathalieyes", "ReviewID": "UR127245557", "Content": "I stayed at the Michelberger in march and really like the hotel. It funky and cool, without being \"cold\", lovely staff, a fantastic breakfast buffet and loads of \"small things\" that make it a great place that you'll remember, and not only a 08/15 hotel that is fine, but wont stick out. The courtyard is lovely, and must be a great place to spend an evening in summer. Cool and trendy decoration all over the public areas and the rooms, with a lot of small details. I had a band room (that would easily fit 5 people) for myself. Comfy beds (two of them in the \"loft\"), and I l really like the \"book / paper theme\" that is all over the hotel. The hotel is just opposite the Warschauer Strasse U and S-Bahn station, from where you can pretty much reach every place in Berlin. Around the hotel, you wont find a lot of restaurants that are within walking distance, and thats probably the only reason why on my next trip to Berlin, I will think about going back there.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“A quality hotel in Berlin”", "Author": "jpi74", "ReviewID": "UR127076220", "Content": "If you are looking for a great hotel to stay in Berlin which has good transport links this is the one. Quirky rooms, great breakfast, good bar. Been coming back to this one again and again.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Pescara", "Title": "“Cool Place!”", "Author": "dailali", "ReviewID": "UR126845633", "Content": "It's hard to describe how cool is this place! Everything is so perfectly designed...and the atmosphere is captivating. I strongly recommend it to anyone looking for a nice and trendy experience in Berlin. I'll definitely come back one day...", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“A wonderfully welcoming hotel”", "Author": "ReluctantTraveller01", "ReviewID": "UR126126039", "Content": "From the moment I arrived the atmosphere at the hotel was captivating - a world away from the usual type of anonymous corporate hotel. The staff were friendly and went out of their way to help us with whatever questions we had; every thing was given the michelberger touch from the funny room key, and the special breakfast tokens to the small family type photos next to the bed. Free and fast wi-fi everywhere in the hotel was a great bonus too. My room was quite small and fairly basic but had everything I needed and was quiet. There are lots of spaces to sit and relax lots of sofas in the lobby area, seating in the large courtyard and a bright and airy restaurant. I recommend this hotel to anyone who wants to feel they are in the city they are visiting", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“A hotel adventure with endless treats!”", "Author": "Duncan_Bramwell", "ReviewID": "UR125822072", "Content": "Stay at Michelberger during business trip to Berlin. I'm a consultant in the hotel business, so think of me of the most demanding and picky guest! This hotel was a treat to the senses and the wallet. They've captivated the feeling of Berlin in this hotel and you feel like a friend in your best friend's home. Forget the big boring brands, and treat yourself to something really fun and refreshing! A great job, well done!", "Date": "March 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Reading, England, United Kingdom", "Title": "“A cool and relaxed hotel that is pleasantly different”", "Author": "Dennis L", "ReviewID": "UR125802478", "Content": "This hotel avoids being a traditional fusty hotel and it is staffed by enthusiastic and helpful young people. The bar is (I think) open 24 hours a day, and is usually busy with a young crowd, and there is usually music playing. It is a good place to flop on one of the many sofas after a day visiting Berlin. Our room had a sort of d-i-y aesthetic. The bed was very comfortable and was on a raised platform accessible by a ladder. I had no problem with that. There was a TV but no refridgerator. The buffet breakfast, served until 11am, is excellent. The street outside is not especially pretty, but two tram services stop outside and S and U Bahn stations are less than 300m away. We paid €306 for a couple for three nights, including breakfast (early March 2012). I recommend this hotel and would love to to back.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "east cowes", "Title": "“Not too cool for grandparents - or so they told us!”", "Author": "andrew w", "ReviewID": "UR125357468", "Content": "This hotel does not disappoint. In initially walking in through the bar area it certainly appeared to live up to its \"trendy\" label. The lobby layout is creatively arranged and comfortable and the whole place was buzzing with the 20/30s crowd. We felt so old that I asked the receptionist if grey hair was allowed or if I needed to dye my hair! I was assured that they loved having grandparents! Certainly we were warmly welcomed. The corridors are dark, gloomy and evocative, I imagine, of communist days. The room, however, although small, was beautifully clean, very well laid out, comfortable and very quiet. The area around the hotel has a slightly run-down feel but transport links are superb. The breakfast was no doubt excellent but too expensive for those of us happy with a coffee and a cake at a cheaper establishment. This was a great base, thoroughly recommended - even by this grandad!", "Date": "February 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Cool, comfortable, friendly, great location”", "Author": "TS2010", "ReviewID": "UR125224122", "Content": "This is the ideal place to stay to see Berlin. WIth the U-Bahn, S-Bahn and tram on the doorstep there are really easy connections to all of the city. The Michelberger is a great hotel with a really friendly feel to it. We had a loft room, which was a good size for two but easily could have slept three people. It was warm, comfortable and had lovely big windows, luckily double-glazed the hotel is on a busy road. There was a tv and some interesting decor/furniture, including rope shelving and a ladder up to the mezzanine sleeping area. There were not many extras to the room (no kettle, iron, etc) but these seemed to be available at the reception, and it was nice to have spacious room that was lofty and uncluttered. Shower gel and a big bottle of water were included with the room. The bathroom was small and en suite. The shower was good but the bathroom was dimly-lit and separated from the main bedroom by a frosted glass window - private but not completely so! It is definitely worth paying the extra for breakfast - it is served in the restaurant downstairs and there is plenty of choice - cereal, breads, pastries, eggs, meat, cheese, fruit and lots of teas and juices as well as coffee. It's also served until 11am in the week and 12 noon at weekends so no early starts necessary. The bar downstairs serves good coffee, fresh cakes and pretzels and very scrumptious hot chocolate. The guy with the beard behind the bar mixes a mean margerita too. There's a really friendly party feeling in the evenings, and a good mix of random pop from the 80s and 90s was played on Friday night. By day it's more like a coffee shop or a common room and provides a nice place to hang out. It's not somewhere to stay if you want a standard generic hotel - this is for people who want a bit of character and something that's a bit more like a hostel but without the budget feel. It's also for people who don't mind a bit of noise from the other rooms when other guests get home after a night out. The hotel has some of the biggest warehouse clubs nearby and some clearly come here to party. But don't think this is just for young people; there was a really good mix of ages and nationalities and the atmosphere is very relaxed and welcoming. The staff are brilliant - speak perfect English, always very helpful and genuinely seem to like working there. We asked for information about travel to the aiport and got a bespoke printout with timings, platform numbers and clear instructions - so helpful! All in all, a great base from which to explore Berlin and a really refreshing great change from a regular chain hotel.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Fantastic place if you are looking for something different....”", "Author": "sambo06", "ReviewID": "UR124829262", "Content": "We are just back from 4 nights stay, it does live up to the good reviews. The location is fab, couldnt be better and we faced directly onto the street and had no problems with noise at all. The design of the rooms and the reception, lobby, bar and chill out area is very clever, so quirky, edgy - you definately will remember your stay here. Only reason I wouldnt give it 5 stars, is that a couple of wee things, could have bumped it up the ratings for us....an ipod docking station or even a radio in the rooms would have been just perfect and breakfast at €11 is pricey....especially when you can nip down the road to Simon Dach Strasse for some good berliner grub! All in all, a very memorable place.....will certainly recommend it! P.S Remember to visit the Badeschiff on your visit, a pool / sauna facility on the river spree!", "Date": "February 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Simple but stylish with an amazing breakfast”", "Author": "katwoma", "ReviewID": "UR124743365", "Content": "This is my first review whilst on a ten week trot around the globe. I'll keep it succinct because I like getting to the point. The Michelberger is fantastic. Funky rooms, cleaned daily, no shampoo/lotions etc included. You have to request a hair dryer at reception. Very, very helpful staff, sweet bar, cool vibe, chilled. Breakfast was amazing. U-Bahn was right out front. Location brilliant. Highly reccomend you test this place out.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Huddersfield, United Kingdom", "Title": "“great price for designer hotel”", "Author": "CharlotteTaraPoppy", "ReviewID": "UR124031986", "Content": "We loved it, v stylish, great food, fab rooms, lovely staff, would recommend to anyone staying in Berlin. AMAZING BREAKFAST!", "Date": "February 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tampere, Finland", "Title": "“Coolest crib in town”", "Author": "PyynikinParoni", "ReviewID": "UR123839358", "Content": "Super original, super cool! Good service, excellent breakfast (+reasonably priced), great decor and after a long day in Berlin you walk into a party every night in the lobby bar. U-bahn station literally across the street! Nice restaurants within a walking distance. By far the coolest hotel experience I´ve ever had. Booked another stay the day after departure... And yes, this is for the urban hipsters, not for the golden oldies.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Antwerpen", "Title": "“Loved this hotel”", "Author": "Kathleen_Tim", "ReviewID": "UR123322405", "Content": "We stayed in the Michelberger for 7 days and had a great time. The room was small but cosy and clean, just what we wanted. Staff was very friendly and the location was perfect with the U & S bahn in front of the hotel. Great overall atmosphere! Would definitely recommend this hotel to friends & family.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic hotel”", "Author": "Lynsey T", "ReviewID": "UR123178727", "Content": "Stayed here 13th to 15th Jan to celebrate my birthday! Rooms are so stylish and cosy i stayed in a nice and spacious loft room with my friend. I would highly recommend this hotel along with the alternative walking tour which picks you up at the hotel. Ben who is the guide is very well informed on Berlin and shows you a side of it which I just would not have seen had i explored it myself during the time I was there. I hope to come back in the summer!", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Overall amazing experience michel berger stylee!”", "Author": "vickyenglish", "ReviewID": "UR122485079", "Content": "Stayed here from 30 th dec till 2nd jan for my boyfriends xmas present, we stayed in a cozy room with a sexy shower! Brilliant to watch your partner having a shower from your bed! Really quirky room with lots of character just like the rest of the hotel! The 1st night we had a 5 course meal which was lovely home cooked food very generous portions! Loved the whole vibe off the hotel from the vintage cases and cuckoo clocks in reception, too the classic soul music played by the dj! All staff spoke brilliant english two members of staff that were very helpful were inga and phillip! Any problems see these guys on reception they couldn't be more helpful! Will defineatly coming back see you all soon :)", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Huge fun and superb service”", "Author": "Charles R", "ReviewID": "UR122040027", "Content": "The Michelberger is a superb mixture of whackiness, unusual rooms, relaxed atmosphere, friendly staff and slick service. Pretty well everything has been really well thought through, and our large party (17 to 55 years old) were all thrilled. The rooms are unusual, inspiring and very comfortable: the setting huge fun; the seating area and bar superb; and the location terrific for walking, S-bahn and U-bahn. Everyone should swim at the Badeschiff (15 minutes away). Wi-fi is excellent. Our only regret was a slightly expensive breakfast: otherwise, the perfect place to stay.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Highly recommended: Modern, clean, cleverly designed, hip, trendy and young hotel”", "Author": "Karslima", "ReviewID": "UR121367243", "Content": "I had initial reservations booking a room at the Michelberger but I'm glad that my husband and I decided to give it a try and stay there. We will certainly be back and would recommend this hotel for anyone looking for an easily accessible location in Berlin and a good base for exploring the city/ sightseeing (especially for those in the city for the first time). There are so many \"uber-hip and trendy hotels\" in the world's major cities that just disappoint and fall short of expectations. In some cases, the staff are too hip to care or nothing properly works in the rooms. I'm glad my initial concerns about the Michelberger were proven wrong. The pros: Friendly and helpful staff who efficiently checked us in when we arrived in the morning and out. A hearty breakfast with hot and cold food options (and sufficient choices for vegetarians as well). Daily housekeeping service and the room was always kept clean. There is a restaurant/bar right by the hotel's reception area where they sometimes have live music (Not sure what the food is like in the restaurant/bar because we didn't get a chance to eat there but they have a good cocktail and wine list). I really liked (and appreciated) the modern aesthetic of the place and the smart use of space in the common areas and bedrooms. Even though the hotel has a very modern feel it wasn't cold or uninviting. The cons: The internet connection (although free) was very spotty and slow in the room and even in the common areas. It only worked 10-20% of the time we were there. We didn't mind this very much since we were in Berlin on holiday and only tried to access the web for trip planning and personal email. This is definitely something to consider for business travelers. Other considerations: The hotel is located in the Frederichain district, an up and coming and increasingly gentrifying/yuppified part of town but it still has much of its gritty character and industrial quality (at least for now). There are several restaurants and interesting boutiques/stores (selling clothing, jewelry, art, etc.) within a walking distance from the hotel. The Michelberger is also within walking distance from the East Side gallery. The U-bahn and S-bahn stations are located across the hotel. Berlin is very well connected by public transportation (i.e. trains, trams, etc.) and the major attractions (i.e. Reichstag, Brandenburg Gate, Checkpoint Charlie, Christmas markets) are no more than 20-30 mins by train from the hotel. The hotel is 45 minutes to an hour by train or bus to Tegel/TXL airport. I would guess the guest age demographic at the hotel is between early 20s to early 40s but that does not mean you can't stay here if you're much older. It depends on your preference. We stayed at the \"cozy\" room which is certainly true to its name. The room is very basic with a full sized bed, bathroom and toilet. I would say this room is best for couples. The Michelberger has other bigger rooms (more loft-like spaces) available. Our room was all the way in the back and it was generally very quiet so we managed to get a good night's sleep during our stay. I'm not sure how sound proof the other rooms are especially when there is live music playing or an event at the bar downstairs. All in all, we had an enjoyable stay.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Fun first time in Berlin”", "Author": "JessNYC23", "ReviewID": "UR121303326", "Content": "2 friends and I traveled to Berlin for the first time this month and decided to stay at the Michelberger because it looked cool, was a great price and good location in Friedrichschain. Berlin turned out to be the most amazing place and our stay at the Michelberger definitely contributed to that sentiment. The rooms are big and clean, the breakfast is a delicious smorgasbord of German food (and the dining room is gorgeous), the bar is a fun place to hang and the staff are super friendly. The staff were more than willing to show us how to get places on maps, recommend restaurants and nightlife -- all recommendations were spot on. Only a few small complaints: 1) the wireless seems to be a little spotty throughout the hotel. I wasn't able to pick it up at all and you need to get an individual code to access it. Weird. 2) there are no phones/landlines in the rooms. if you don't have international service on your mobile phone, you're pretty much out of luck. There is a hostel a few doors down that has an international pre-paid phone booth that's not too inconvenient to use if necessary. 3) They advertise that they have sandwiches and snacks available 24hrs, but actually they don't. We came back starving from a night out hoping there'd be something to grab in the bar area and there was nothing. We ended up having to go to the pretty gross kebab shop down the street. Plan accordingly. 4) One afternoon, we asked a girl at the front desk to recommend some shopping streets in Kreuzberg to check out and instead of showing us quickly or telling us to take a short walk over the bridge down the street on the right, she told us to buy these Michelberger Guide maps for 1 euro each and sent us on our way. I felt a little ripped off. I get it, they want to sell these guides but it would've been nice if she had opened them and taken 30 seconds to show us where to go. Overall we had an amazing time and I would definitely stay here again. If you stay here, be sure to take the free Alternative Berlin walking tour that's advertised and meets in the lobby -- it's totally worth your while.", "Date": "December 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“The Best Hotel in Europe”", "Author": "TimTheGuest", "ReviewID": "UR121195637", "Content": "I have stayed here 6 times and each time I have been impressed on a number of levels. Friendly attentive staff, they remember me now and greet me personally which is a nice touch. The bar and lounge area is very nicely laid out with good music, a well stocked bar and comfy sofas to relax on after a hard night in Berghain. There is a range of rooms from \"Cosy\" which is very cheap and ideal for a quick stop over, right up to penthouse rooms and large rooms for groups of people. The rooms are well laid out, very quiet, excellent shower and shower room. The beds are very comfy and the rooms are always extremely clean. Breakfast is €11 and well worth it, smoked salmon, salami, cheese, eggs, beef kebabs! Everything you could wish for with a selection of Croissants and Pastries etc. They even have Soya Milk for people who are lactose intolerant. The hotel is located opposite Warshauer Strasse mainline station, easy to get to both airports or to Alexander Platz, Ostbahnhof, Oestkruez and Freidricshain (excuse my spelling). You can also access most tourist attractions very easily. This hotel won't suit everyone as it is not your typical 5 Star hotel chain but if you like individuality, slightly quirky places with a 5 Star service in comfortable, clean and laid back surroundings then this is the place for you. I get the impression it is a fun place to work as the staff turnover seems very low and I see lots of familiar faces each time I return. I will be back next year definitely", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Fantastic place”", "Author": "Franca M", "ReviewID": "UR120848775", "Content": "It's the perfect place to stay: really large clean super comfortable and quiet rooms, friendly helpful people and a great bar to hang out, have a drink and listen to music: you don't need to leave the place at all to have a nice time.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“best place for hipsters”", "Author": "volpelinoantwerp", "ReviewID": "UR120542369", "Content": "really great place to stay in berlin. although low budget, the interieur shows a lot of love in detail. it looks very trendy yet functional and cozy. the staff is very helpful and friendly. in the evenings, a DJ is clubbing in the lobby of the hotel and makes it a perfect place to hang out. don't miss the breakfast (jummy)! it is located directly at u- and s-bahn. discover nightlife by foot.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Göteborg", "Title": "“Self-facilitating media nodes”", "Author": "Mitchell C", "ReviewID": "UR120391022", "Content": "You could not wish to encounter a more pretentious, vacuous crowd then the one the Michelberger so carefully attracts and nurtures. Nathan Barley would love it.These soulless ironic types are admittedly ten-a-penny in Berlin nowadays but the Michelberger must be their number one hang-out. The fabric of the hotel is of an acceptable standard (apart from the cheap, uncomfortable beds) but you'll pay half the price for the same standard if you can forego the \"cool\" of this unfathomably overrated place.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“way above expectations!”", "Author": "b-inabag", "ReviewID": "UR120364168", "Content": "we came across this place in a travel magazine and loved the description even then. but when we stayed there liked it even more. its a fun place, offers you a hostel like feel but with the convenience + look of a hotel. its young and hip with a bar on the ground floor if you feel like staying indoors. the rooms are spacious and nice. we stayed at whats called the loft (if i remember right) its spacious and big enough for two. there are a few quaint things in the room, which of course you want to pocket, but they warn you against it! there were some books on berlin which we carried along when we roamed around the city. good to browse in the trains etc. so look out for those... the bathrooms are huge - almost as big as some of the rooms we stayed at during the rest of your trip! everything is neat and clean. and even the bathrooms have facilities for the handicapped. the soap / shampoo is in a BIIIGGG dispenser that gets filled every second day. and the shower its really nice. the right amount of force without any worries about wasting that extra water! conveniently located - near the stations (S-bahn+ U-bahn) and walking distance from a whole bunch of eateries. the staff is extremely helpful and are able to answer a whole lot of questions. an excellent experience, hip and urban but yet not too young and in-your-face! worth repeating if we visit berlin again.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Just Awsome”", "Author": "ArtisaCritic", "ReviewID": "UR120177907", "Content": "The coolest place to hang out - with a really stylish bar and rooms if i visit Berlin (hopefully when) i would love to stay here again, The staff were very friendly speaking fluent english and allowing us to keep our bags in a safe closet before and after our room was ready and going home. With the Ubahn across the road it felt anywhere in the city was easily acessible. There was a great burger place across the bridge renovated from an old toilet block. The room was nice and very stylish however the lights in the bathroom were rubbish small dark and shining in your face they should sort them out. The WiFi appeared to be dodgy at the time of visiting and also one evening music was being played really loudly which was disturbing but other than that the hotel was fantastic. The breakfast although not included should be enjoyed at least once with an amazing range of choices (croissants, scrambled eggs and smoked salmon was my indulgence). Overall the stay was very enjoyable and i would recommend this hotel for anyone looking for that chic Berliner style", "Date": "November 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Fun, stylish and comfortable hotel in a great area”", "Author": "LondonZoeJ", "ReviewID": "UR120066769", "Content": "We stayed here for two nights last weekend and had a great time. It is really well priced for what it offers which is somewhere clean, cool and comfortable to relax when you're not out enjoying the highlights of Berlin! Less than 10 minutes walk from Watergate, Maxim and the Berghain/Panorama Bar with lots of nice restaurants and bars a short walk away in the centre of Friedrichshein. We also really enjoyed a falafel at a cool little place a few moments walk away from the Michelberger. Having the UBahn and S-Bahn opposite makes it ultra convenient for the rest of Berlin too. We'll definitely be back on our next trip to Berlin!", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Galway", "Title": "“Cannot be missed!!”", "Author": "conin", "ReviewID": "UR119476729", "Content": "From the moment we arrived at this hotel, we did not want to leave. Easy going, relaxed staff greeted us, checkin a breeze. Rooms very clean and very quirky. We had a loft room which sleeps 2 perfectly and 3 if you have an extra guest. The bar/lobby area is a must to hang out and relax during the late afternoon and evening, light food available. Staff very friendly and a couple of them actually had a drink with us after work. Had dinner in the restaurant on the Friday night followed by a disco/dj's in the bar/lounge area - fantastic night!!! The design of the hotel is very quirky and we could not stop taking pictures of everything!!! We will be back!!!", "Date": "October 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Kongens Lyngby, Denmark", "Title": "“A great stay at Michelberger Hotel...”", "Author": "MartinKaufmann", "ReviewID": "UR119210751", "Content": "Late August 2011 my girlfriend and I stayed for three nights at Michelberger. The hotel is great, excellent rooms, friendly staff, good food and very inspirational. Combined with good prices this hotel is worth using. A few more words and photos to be found on my blog: http://www.martinkaufmann.dk/2011/10/michelberger-hotel-berlin/ All the best, Martin", "Date": "October 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow, Scotland, United Kingdom", "Title": "“Funky, Fun base for a great time in Berlin”", "Author": "alexpinna", "ReviewID": "UR119176589", "Content": "Ideal for a fun-loving crowd. Well designed hotel, great bar and social areas. Cosy room is small but perfect for a couple. Very clean and good sound proofing. Breakfast is great. Staff are very friendly and will point you at a decent place to go for a drink or party. Excellent location - good access to some off the track East Berlin clubs including Suicide Circus and Berghain.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kendal, UK", "Title": "“Super hotel for Berlin mini break”", "Author": "ajc75", "ReviewID": "UR118893859", "Content": "We picked the Michelberger Hotel as it was recommended in the Saturday Times - and we are really pleased we did. The hotel is in a great location, right opposite the tram, S-bahn and U-bahn stations and easily accessible from the airport and into the centre of Berlin. I would recommend that you buy one of Michelberger's local maps highlighting restaurants that they like. We ate at a few of these and they were all great - most were a little off the tourist trail and we wouldn't have found them ourselves. We did have lunch in the hotel one day - very tasty and great value for money. We stayed in a Loft room which is a great use of space and like the rest of the hotel, full of quirky features. We had three nights at the Michelberger, and wouldn't hesitate to go back.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Cool hotel, great rooms, friendly staff and fantastic breakfasts and all at a great price.”", "Author": "SW1LL", "ReviewID": "UR118632188", "Content": "Just got back from a weekend in Berlin with my sister. The hotel managed to find us a late room as we only decided to go the week before we flew. Very accommodating. I'd seen this place recommended in Sunday Times Travel mag last month as one of their favourite hotels in Europe, so we though we'd give Michelberger a try. Housed in an old warehouse this hotel is budget friendly but with a cool boutique hotel feel. Very bohemian and easy going. Staff are friendly and extremely helpful. The bar (Honolulu) is great fun and relaxed. Drinks are reasonable and a hot chocolate and fresh mint tea were a nice afternoon pit-stop treat. The restaurant area where we had breakfast was roomy and spacious and the food itself was yummy and was a great start to the day. Hotel is located just opposite a tram and metro station, so very easy to get to all parts of the city. There are some cool Sunday flea markets walking distance from the hotel which are worth checking out, plus you get to mingle with the locals too. We stayed in a 'cosy room' which was certainly cosy, but space was used to the maximum and although furnishings were minimal we loved the decor and little bits of artwork, laminated pics, wallpaper and books. The bathroom/wet room too was also cosy but did the job. Very modern and well finished. Probably not the room for you if you're not comfortable sharing with someone you don't know intimately (as there isn't much place to move). Loved Michelberger for its easy-going vibe, friendly staff and great service all at a really great price.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Fantastic stay, Berlin in a microcosm!”", "Author": "hmidkiff25", "ReviewID": "UR118581550", "Content": "Unique, artsy, and funky decor, live and loud music, freindly travellers and staff alike...not to mention a glass-walled shower whose inhabitant is best viewed supinely from the bed?? We had a great stay here, and while they accidentally charged our card twice, they quick to remedy the problem. There is little reason to leave the space with the excellent food, drinks and live entertainment prepared by the staff each evening (thought this can be forced upon you due to its loudness). When you are ready to leave, all of Berlin is steps out the door, (literally the East side gallery is meters away), as is the tram, bus and train. Highly recommmeded kitcsh!", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Madrid, España", "Title": "“Amazing”", "Author": "Tsops", "ReviewID": "UR118443144", "Content": "One of the best hotel I have ever been. Not the luxury style, but very clever solutions for everything. Client orientated, higjly designed features and devoted service.", "Date": "September 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Worth the stay”", "Author": "Foolfin", "ReviewID": "UR117945585", "Content": "The Michelberger could have been straight from a movie: a whole country band in full dress hanging by the bar, ping pong tournament in the yard and, of course, The big lebowksi playing 24/24 on the inhouse tvs... Overall, great breakfast, good value for money and, if the east side is your location of choice then certainly worth the stay.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Paris, France", "Title": "“Funky, friendly & fun but loud till 11pm”", "Author": "jungleberry", "ReviewID": "UR117736881", "Content": "I stayed here one night after staying at another hotel on Friedrichstrss for two nights last weekend (Sunday night). Personally, I loved its funky ambience and young and friendly staffs yet it might be a bit too loud for older guests who mind DJ playing music/people chatting and playing table tennis in the courtyard. Location is relatively convenient as major train/metro system is right across the street from the hotel. Maybe it was just this Sunday but there was lots of young people hanging out in the courtyard and it was fun for me to enjoy the scene and eat BBQ for dinner. It provides free Wifi and rooms are very fun and originally designed. Will I stay again - yes for sure for another few more years but if you are traveling with your parents, I would choose a quieter hotel.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Leiden, The Netherlands", "Title": "“Lively Berlin awakes with the incredible Michel Berger Hotel”", "Author": "Jan N", "ReviewID": "UR117561522", "Content": "The hotel is not situated in the most quiet part in Berlin, but I (44) and my nephew (14) Matthijs really loved it! The East side gallery and great Oberbaumbrücke at one side and the graffity at the other side, the outgoing youth make it a lively neighbourhood and we like this. I'm pretty used to busy Amsterdam, so the S-bahn sound in the street made me feel at home. The hotel is really like presented on the internet: all these nice details! The room with high bed and lounge corner with great desk to write out postcards was comfortable and nice to arrive in the evening. The large windows where great to open for some time in the evening. The staff, whereever they helped you, were very polite and helpfull. They all spoke fluently English, but I self prefered they spoke Deutsch, ich mag auch diese Sprache! With all of them you feel yourself a kind of at home and at ease! Breakfast was fantastic, really worth the € 11,00 pp. Every morning we choosed whatever we liked, every morning there was something special. Don't need to say I had to lose some pounds after visiting Berlin! Eating in Berlin is great in quality. For prices I only remember in Amsterdam long ago! Next time I go to Berlin, I will return to Michel Berger hotel. I also hope I will be some more evenings in their lounge on the ground floor, mostly we arived in the evening, Berlin stays alive in the evening! Special thanks to Michel Berger staff, room designers, kitchen cooks and helpers and the cleaners! Thank you for holidays we won't forget for long times! Matthijs (14) and Jan (44)", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“One of a kind”", "Author": "Sam B", "ReviewID": "UR117494649", "Content": "A friend recommended this place to us and after having stayed there even for just one night I'll recommend it to you, reader, as well. Highly. One of the most unique hotels I've had the pleasure of staying. If you're charmed by design and creative use of space this place is especially for you.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Great value, unique, fun hotel”", "Author": "eameschair", "ReviewID": "UR117313790", "Content": "Loved this hotel. So different to the many overpriced, generic, standardised hotels I've stayed in. We had The Loft room which was really spacious for 2 and would have been perfect for 3 also. The hotel and rooms are uniquely designed with a high quality finishes. There were small touches everywhere that really made this place great - some included the fun bottle stickers or Do Not Disturb signs and the bird noises in the toilets! The brunch buffet is excellent quality and good if you want to fill up for the day. The bar is fantastic, chilled out and the drink is reasonably priced (although more expensive than nearby pubs). The u-bahn stop is just across the street and the s-bahn up the road a little.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Uber cool - but need new cleaners!”", "Author": "Julie C", "ReviewID": "UR117272676", "Content": "Stayed here for a few nights as part of a family holiday. We all loved the hotel and the area. We are definitely East Berlin fans. The rooms were great and worked well for us with teenage children. My gripes however would be about noise and cleanliness. Room overlooked the central courtyard and it was impossible to have the window open at night if you wanted to sleep. Parties 2 nights until early hours of the morning. This wasn't too disasterous as it wasn't particualrly hot when we stayed, but if the sun had been shining in Berlin.... Of greater concern was the poor standard of cleaning inthe room. One of the beds in our 3 bedded room hadn't been made on our arrival - so we reported this to reception. Bedding was delivered late that night (though we were left to make the bed ourselves), but no clean bottom sheet was provided and the one on the bed was dirty. I reported this to reception the next day but nothing was done. I had to report it a second time before a new sheet was provided. Room cleaning also seemed very cursory - not sure it happened at all one day and scarcely on the others. We loved our stay - and will be back to Berlin. Would love to stay at the Michelberger again, but please, please do improve the cleaning and the service.", "Date": "August 26, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Unsanitary, and to be frank, unsafe!”", "Author": "Neededalobotomy", "ReviewID": "UR117047202", "Content": "I like to party as much as the next person but arriving to find a used needle in our bin and stains on the so called \"clean sheets\" was neither acceptable nor sanitary. The staff were exceptionally rude and condescending. To make matters worse the hotel decided to throw a party in the central courtyard in which djs played deafeningly loud music continously from 1pm until 1am on a sunday. We were not informed of this event until after we had checked in and thus we were told it was too late too cancel our booking. All in all it was a traumatic stay and was definitely not worth the 60 euros they charged for there inadequate facilities. I would highly recommend that this hotel is avoided at all costs if you value hygiene, comfort and any sleep at all.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Melbourne, AUS", "Title": "“Great idea, mixed feelings”", "Author": "lauraelkha", "ReviewID": "UR116940024", "Content": "Conceptually the Michelberger is great - when we first arrived we were enamoured with our loft room, as designers we appreciated the clever yet cost effective details throughout the room and hotel in general. We chose this hotel not because of the cheap price but because we wanted something unique - which is something I needed to keep reminding myself when being frustrated at not having comforts that we were used to like A/C which meant having to throw our mattresses down the steps to sleep on the floor during the hot nights we experienced. We had a room that faced onto the street and got EXTREMELY hot. There were powered shutters on the windows yet they had a mind of their own - sometimes working when we wanted them to and sometimes not at all, other times just opening up on their own. Wrangling them was a constant battle we gave up on in the end. We were actually more than happy to spend more than we did and stay in a better room, but all were booked out. It must be said that the breakfast was fantastic - a delicious spread with great variety in a gorgeous space with the perfect morning vibe and, as all things at Michelberger, was very reasonably priced. We so wanted to love this hotel but my partner and I left with mixed feelings. 50% of the staff were great, 50% indifferent or just unavailable. The room was cool, yet not comfortable. The location provided great U-Bahn & S-Bahn accessibility and an easy walk to Kreuzberg, but in itself was not great... In summary I would suggest to think of it more as somewhere to stay that positions itself closer to hostel than hotel, a week during summer was too long for us, but 3-4 days during a winter could be fine and fun.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Cool & Hot”", "Author": "QuincyKid", "ReviewID": "UR116722013", "Content": "We (me, my wife and 3 teenage sons) stayed at the Michelberger and found it to be a very interesting and fun place. The atmosphere of cool is mirrored in the rooms with the bunk beds and ropes for towel holders. Breakfast was well worth the money too. Our only complaint is that we were there on two hot nights and air conditioning would have been nice both for the temperature and to keep down the noise from the courtyard.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Love it and highly recommend it”", "Author": "alilaw6", "ReviewID": "UR116568226", "Content": "Stayed over a long weekend with a group of friends. The hotel is oozing with character and was in a perfect location. We stayed in one of the loft rooms and there was plenty of room for five girls. The downstairs bar was fun at night and the staff were very helpful in pointing us in the direction during the day. The hotel also has a great breakfast, which is not to be missed.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Biot, France", "Title": "“The coolest hotel”", "Author": "EvelyneA06", "ReviewID": "UR116556829", "Content": "Stylish, smart, friendly and fun...it feels like at home", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Basel, Switzerland", "Title": "“Pleasing for two different generations!”", "Author": "Dindi_SE", "ReviewID": "UR116462695", "Content": "I was at the the Michelberger with my mother and some of her friends (I am 24 and my mom and her friends over 50), and I have to say we all enjoyed the experience immensely! Because we arrived in Berlin very early, we had to wait a bit before being allowed into our rooms, but that was absolutely not a problem! Staff was friendly and the huge reading rooms with thousands of books to choose from and great comfortable couches is fantastic! The building and surroundings can look odd at first - but do not let yourself be fooled by that. The rooms are great, clean, full of light and interesting architectural and design touches that always allow you to found something new. The rooms we stayed in had no air-conditioner. Because we were there in September, it was absolutely not a problem - but perhaps it might be in different months of the year. The hotel bar is great - my mother and her friends always found new interesting drinks and great late-night light snacks. Even though it is not located in the city center, public transportation is easily accessible - in fact, a big station is located just across the street from the hotel. As an additional surprise, brazilian music was playing when we arrived, it was a good way to feel welcome! The restaurant offers great portions of food for incredibly reasonable prices - after all, this is Berlin! - but the breakfast buffet is the best I have seen. Anyway, surely not enough to downgrade our opinion about this place!", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Oslo", "Title": "“Perfect”", "Author": "ghafsaas", "ReviewID": "UR116272325", "Content": "This hotel is so perfect, I almost doesn't want to tell anybody about it. It is a very cool and trendy hotel, with a friendly atmosphere.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“A super cool place for young people”", "Author": "mirasol08", "ReviewID": "UR116163170", "Content": "Stayed at tthe Michelberger over the weekend on a friend's recommendation. We had a fantastic time there and the location was brilliant. We got excellent recommendations from staff for restaurants and bars in the area and the lounge/bar area is open late and great for chilling out. Only thing that I was slightly surprised by was the shower in our bedroom. It was right by the bed and the wall separating the two had a huge transparent window looking into it - not even frosted one bit! Fine if you are staying with a boyfriend/girlfriend etc but not so great if you are a little shy :-) It's not a big deal though - I will definitely be coming back to stay here again!", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Fun, funky, and affordable...”", "Author": "Ennaei", "ReviewID": "UR115928110", "Content": "The lobby is welcoming and comfy, with lots to do (books, late night dance parties, etc...). The courtyard is nice as well with ping pong, bbqs and breakfast. Great service and located next to the tram, U bahn and train.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "pdx", "Title": "“Fun and Inspirational”", "Author": "xstaceynyc", "ReviewID": "UR115895801", "Content": "Michelberger was recommended by a Designer in Berlin. My husband had also seen photos in Creative Review. We had the room with the tiny stairs and upstairs sleeping loft facing the courtyard. I was concerned it might be noisy at night, but I was out until it least 2 am each night so it was fine. I loved it. The people who work there are super nice and helpful. We don't speak German, but it was not a problem. There are tons of art books and novels in the lobby. Everything from the cooler in the breakfast buffet \"I have no arms or legs, help yourself\" to the hallway playing an endless loop of The Big Lebowski made me feel like I was on a real vacation. The design details are thoughtful and charming. I am now obsessed with the breakfast room with the hanging white lights, long rustic tables and variety of chairs. There were fresh flowers all over the hotel, usually in some combination with orange. The train is across the street: so convenient! The food is quite good. We loved the buffet, the pitchers of water with lime, mint and currants. The lunch salads and pasta were great as well. They were going to have a dj with a bbq the weekend that we left- it sounded fun. The room is funky, it's not luxurious. The bed and towels are not super comfortable. The stairs/ ladder going up to the bed is not for everyone. (there's a day bed on the main floor if you're too drunk). I found the city of Berlin so exciting that I didn't really want to hang out in my room. There is not a gym, but you can rent bicycles down the street. I stay in a lot of corporate hotels when I travel for work. I was really charmed by the design and personal details of the Michelberger. I will definitely come back.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Sydney", "Title": "“Hotel concept is great but is an average hotel overall”", "Author": "LalanRobbie", "ReviewID": "UR115633994", "Content": "We were very captivated by the website and hence decided to stay at this hotel. It was a much bigger hotel than we had anticipated - but this was good. We had a loft room which faced the main road. Unfortunately there was no A/C and this was a big downside for us, because we experienced some hot days and nights. Luckily there was a small fan next to the beds; which saved us. The loft room has a toilet with shower, TV, some comfy loungy thing and a sink; downstairs. Upstairs is just a bed - or shall I say 2 thin matresses side-by-side. The beds could have been better. PRO's: * Even though the room faced the main streets, it was quiet at night once we closed the windows. * It is a funky hotel with an awesome (and Fresh) buffet breakfast - with anything you could ever want. * Sometimes the hotel organises lunches, dinners, BBQ's outside in their bar, which is really cool - good atmosphere. Really good use of space * Mostly the staff were friendly * Awesome for transport - 1 minute away from both S and U Bahn stations. CONS: * Bed could have been improved; werent big fans of the 2 thin mattresses side-by-side. * We couldn't seem to get our room serviced properly on 2/4 nights that we stayed. After the 1st night, they took away our towels and didnt replace them. So we were left with one wet bath towel and 1 wet floor towel. Toilet paper wasnt replaced either. We had to ask for some from the cleaner we saw in the hallway. * Location - wasnt as close as we would have liked - it was about 15minute walk to the more lively streets in this area. Overall, we had a good stay, but will probably stay elsewhere next time.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "5", "Service": "2"}, "AuthorLocation": "Tijuana", "Title": "“A Hipster's Hotel/Hostel: Different and interesting. The best? ...Not sure!”", "Author": "Psicoloco", "ReviewID": "UR115192611", "Content": "Hello readers, hope you're enjoying your day! Well, we stayed at this interesting Hotel through July 2 till July 7 2011 traveling as a couple; we chose this place because of the reviews posted in this site and also because of the Hotel's website which let me tell you, it captivated us! Yet we didn't made a bast research of Hotel options which we should have done. Now that we experienced it I would say that we ended up with \"mixed up\" thoughts about it; the best thing of this place is definitively the price! Although Berlin is very cheap city (no using the word \"cheap\" as a pejorative) but for sure this hotel is a good bargain for what it offers; basically we did OK in this hotel, not awful not excellent, but OK... And I would say that this Hotel has a very peculiar public as a target which might be young Hipsters, alternative personalities, modern design lovers/freaks , local arts scene dudes, in other words something very \"Friedrichshain-Kreuzberg\"; we're not gonna use \"lay-back\" as an adjective to describe this place since we didn't experience that vibe (in general) actually we observed some amount of pose and attitude but again its a Hipster thing. So if you're an average tourist, a family, someone looking for a regular hotel features, someone traveling without a budget or none of the above mentioned I would rather suggest looking for more \"orthodox\" options. Now we would try to explain very objectively OUR thoughts about this place with a PROS and CONS list, (we find necessary to mention that this comes out from our personal experience and we do not intend to give rather a good or bad impression about this interesting place, just personal perception): CONS: - Dumpster: As a the previous reviewer said, choose wisely your room (avoid 212 to 238 rooms), there's a huge local dumpster just in the back of the hotel and it's not only the view what is mortifying, since there's no AC in the rooms you'll have to open you window to get some fresh air (now imagine whats next!), also, activity at this dumpster starts very early so if you have a light sleep be prepared to be woken up by machinery noises. - Beds: Beds are not so comfortable so people with back problems, be aware. - WiFi: So slow! - AC: No AC in the rooms and believe me, Berlin can get very hot and humid in summer. - Layout: Reception and Hotel Entrance layout, to reach the reception (and hotel's elevator) you need to cross through the bar's lobby and the bar, this might be OK or cool for some people but since there's a party every night it might get very crowded, some nights we dealt with crowds (and very drunk people) to get into the hotel after a long and tiring day out. So if you're not intending to stay in the party, this is not a very comfortable feature. - Attitude from some of the personnel: this is a very interesting point, we were attended by six different people during our stay (in the bar, in the reception and in the restaurant) and I would say that 3 from 3 were cool, kind and helpful, the other 3 were very indifferent, long faced and we felt like they were annoyed by our questions and/or requests. We thought this might be because of the lack of English (not everyone speaks good English and we don't speak German, LOL) or a cultural thing but a couple of German friends (one living Mitte and the other one in Friedichshain, Berlin) told us that it was all attitude, they used the phase \"Sh***y Berlin Hipster's Attitude\" and that because of the hotel concept and vibe it would a common thing to get it. Well the point is that since its a Hotel, good quality customer service must be always a must, and even tho they're cultural differences between locals and tourists, a Hotel staff is expected to know them and manage them to make their guests stay pleasant and comfortable. PROS: - Location: Such a huge plus; Warschauerstrasse S/U Bahn (just across the street) connects you with everywhere worth visit in Berlin. There's a Kaiser's supermarket about 5 minutes away from the hotel were you can buy treats, booze, groceries, etc. - Nightlife: If you like the night life you have amazing bars and clubs near the hotel like The Berghain, The Waterfront, The Lido, the Ichiban Karaoke, all bars, restaurants and venues around Friedrichshain-Kreuzberg. And if you like to walk, well you can reach Alexaderplatz in just 20 minutes away. - East Side Gallery: Just around the corner. - Concept: The concept is amazing, more than a common stay its an experience, we really think that it gives you a good idea about what's happening in Berlin's design, cultural and art scene. Obviously they're a bunch of good designers and artist beyond this project which is a very interesting thing to observe and experience. - Some of the staff: Again, half of the personnel that assisted us during our stay was very helpful and friendly, there's this tall and pretty girl in the reception that was extraordinary helpful and attentive, sadly we saw here once during our check in process. - The Bar: Well if you're don't wanna party outside the Hotel you can do it inside, there's something going on every night, a local rock band, a cool DJ, etc. - Price: for us, the best feature of this place is the price. Such a bargain! Before Berlin we visited Belgium, The Netherlands and other cities of North Germany and this was the best deal as for hotels. If you're using your hotel just for sleeping and shower I believe this might be a good option just because of the price. Overall this Hotel might be enjoyable or the opposite depending on taste, interests and expectations. If you're a frequent Hostel customer this place might be amazing (also if you're into the Hipster scene) but If you often stay in regular 3-5 stars hotel, think it twice and be aware. If coming back to Berlin this hotel might be a second option if we don't find a better place to stay. Have a nice day!", "Date": "July 9, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Pick your room wisely to avoid the rubbish dump! Good vibe but facilities lacking”", "Author": "HonestH", "ReviewID": "UR114899602", "Content": "We were looking forward to this stay but have mixed feelings. We had a horrible location tiny budget room (226) over the rubbish dump but our friends stayed in the luxe gold room and loved it. Breakfast although nice was expensive at 11euros each. We didn't stay in the room much, Berlin is there to explored, it turned out to be a good stay. However, the low point merits mentioning. First night some idiot set the firelarm off at 3am, so we had to walk through corridors of chemicals, waiting outside without explanation for 45minutes only to returning to our room door open (with all our belongings/passport / creditcard/cameras in there) without appology or explanation, let alone refund by staff Positives: Nice relaxed vibe in hotel, friendly staff, communal spaces were comfortable & stylish. Transport is on doorstep, location is excellent for kreuzberg and friedrichstein bars. Lovely hotel dog. Free wifi Negatives: Budget room which was absolutely tiny; 3 hooks for a wardrobe; shower was an clear window so not only could the room see us shower, but the worker from the rubbish dump saw naked. The toilet in the room meant this was far from a romantic stay. Without a fan or air conditioning we had to leave the window open so the noise (bin men every day incl. weekend started at 6am plus birds squarking over rubbish) and smell wasn't fun. A ceiling fan would help enormously!! Top tip: Get a room overlooking the courtyard! The budget room is hostel standard so i'd pay extra for better accommodation & if you can afford it treat yourself to the luxe room.", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "new york city", "Title": "“Didn't meet expectations”", "Author": "shopaholic84", "ReviewID": "UR114752086", "Content": "Had high expectations from all the reviews on Tripadvisor, but was disappointed with our stay. The hotel was definitely cool, funky, and alternative, but had more of a hostel feel than a hotel feel. For example, our sheets were never changed during our 4 night stay, the room was humid and stuffy but we couldn't leave our windows open at night given the raucous on Warschauer Strasse, the internet (although free) was SLOW, and despite asking several times we could not get any helpful information from the hotel staff (for the first 2 days we couldn't even get a map)! We asked for restaurant recommendations and they just pointed to a general direction of where there were a lot of restaurants. Also, if you're in the loft-style room, be careful of the stairs leading up to the bed! There isn't any traction on the steps and it quite hurts when you fall (said from experience).", "Date": "June 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“Amazing Hotel”", "Author": "clairedigby", "ReviewID": "UR113214751", "Content": "I stayed at the Michelberger Hotel with my boyfriend for 4 nights and 5 days (6th June-10th) and i can not give this hotel a better review. We stayed in the cozy room and at first I was quite concerned that the room might be too small but when we arrived I couldn't have been more wrong. Yes the room is a little on the small side but with the high ceilings and clever lay out this room is one of the nicest I've stayed in. The court yard and lounge are amazing! and all the staff are so friendly. I was a little worried as my German isn't great but all the staff speak perfect English and are very polite. The breakfast was lovely, lots of fresh fruit and the location couldn't be better. Trams, U Bahn and the S Bahn are right on the door step. I will definitely be coming back to Berlin and I will definitely be staying at this hotel again!", "Date": "June 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“So good, I dont want everyone to know about it”", "Author": "Tjukkebolla", "ReviewID": "UR113155443", "Content": "This place made our entire trip. The funky details in the rooms, the cafe, the free concert in the courtyard....it was so entirely brilliant I would like to live there. I dream about that place. It was one of the best hotels I have ever stayed in.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "hanna8577", "Title": "“Fabulous!”", "Author": "hanna8577", "ReviewID": "UR113029676", "Content": "Surpassed our (high) expectations – we got a really spacious, clean and quirky room (not for the disabled…). Staff were super friendly and helpful, we couldn't have wished for a better stay. If you're a light sleeper then this might be a little bit noisy for you, the room was also pretty warm but there was a pretty powerful desktop fan which helped. The bar was also really nice.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Oslo, Norway", "Title": "“Free guiding tour in Berlin”", "Author": "Hnordin", "ReviewID": "UR111756740", "Content": "Arriving at the cool hotel Michelberger Juni 2. we spotted a sign on the reception wall for a free city tour. At 12.30 a young, relaxed english guide called Mark arrived. Together with another small group we got an interesting and alternative city-tour by foot and U-bahn, We visited YAAM-beach (http://www.tripadvisor.com/Restaurant_Review-g187323-d718863-Reviews-Yaam-Berlin.html), Tacheles (http://super.tacheles.de/cms/), among others. All we paid was a small tip eatch to Mark, and our subway ticket. Thanks to hotel M for introducing this. Warmly recommended!", "Date": "June 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Moscow, Russia", "Title": "“super small room”", "Author": "BouH", "ReviewID": "UR109912618", "Content": "Hotel has good design, although I can't same the same about the rooms - nothing special. The room was like a kennel for a dog, it was super small, only bed inside and shower with toilet with a transparent window. There is a garbage collector in front of the room with a garbage car always move to and fro with noise. Warsauerstr - good district with many bars and restaurants, but think about stopping at this hotel twice.", "Date": "May 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "UK", "Title": "“If you're trendy then this hotel is perfect for you”", "Author": "monkeykieran", "ReviewID": "UR109173252", "Content": "I have stayed at this hotel three times, as it is in a great location if you like visiting the bars and clubs of Friedrichshain, opposite Warschauerstrasse station. The lobby, bar and reception are like the staff very welcoming to all guests even if you are a bit worse for wear. The lobby is really chilled and relaxed but I always get a sense that it full of \"Trendy\" brits who think they're all a bit cool for school, great if you like that sort of thing, but not really my vibe. The breakfast is fantastic, good range, very fresh, pity theres never freshly squeezed juice just that made from concentrate stuff but not the end of the world. The rooms are very basic, in decor and facilities, the hotel aims for this minimal vibe aside from the random assortments of books and things), but I personally find it a bit too plain and I think the shared rooms have the beds too close to each other on the mezzanine levels and the mattresses could be a lot better all round. From memory it costs only a bit more to get a room by yourself or with two people than it costs for 3 or more so id suggest doing that as there isn't much space in the shared rooms.", "Date": "May 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Rijmenam, Belgium", "Title": "“Quirky place for a salesmeeting”", "Author": "1822910Geert", "ReviewID": "UR108996790", "Content": "We stayed here with 7 people and used the Whiskey room as meeting room Do not expect the standard meeting rooms but a sort of living room atmosphere to hold your meetings which also impacts the way you discuss things The rooms are not large but accommodating, clean. The hotel breathes a Berlinesque style. The patio is nice for lunch. You are near Kreuzberg and near clubbing areas. There are a lot of people walking the street at night switching clubs but this is not creating problems . Watch out for the bicycles if you coming out of the hotel, the gain a lot of speed going down the slope; We were near the tramway but were not bothered by noise or trembling sensations. The bar is inviting and the hotel has an overall hang loose feeling.", "Date": "May 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Sweet hotel - awesome value”", "Author": "oconut", "ReviewID": "UR108888041", "Content": "It's a great hotel with compact, clean rooms, a great bar & cafe downstairs, and an amazing breakfast buffet (I'm talking smoked salmon for breakfast baby). Staff were helpful and it's close to the U-bahn and S-bahn. Walking distance to decent restaurants and a short train ride anywhere else. The whole hotel has a funky style with a lot of really smart additions that make life easier, internet, books in the rooms, alarm clocks. I think this is the best value hotel I have ever stayed in. I'll be back!", "Date": "May 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“All those little details”", "Author": "amaral82", "ReviewID": "UR107209939", "Content": "Different hotel with small little gems all over. Check the non-smoking sign, the body wash bottle warning sign, the alarm clock, the small pictures in your room, the not-disturb sign, etc.. But even the whole design and set up of the hotel is quite amazing. Great rooms and breakfast. The only negatives was that internet was down, and we were not offered a refund (despite asking for it) and that the security guard at night would not let us in with food! (\"It smells bad\", he said in German). But hey, you can't help the Germans' general sense of service (or lack thereof). :) Yet, I would definitely recommend the hotel if you are in the look for something different and an experience in itself.", "Date": "May 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Fantastic hotel, amazing atmosphere and vibe”", "Author": "oilir", "ReviewID": "UR107096247", "Content": "We stayed at the hotel with some friends over Easter, and I can honestly say I don't remember when I would have stayed at such a great hotel ! The atmosphere of the whole place is great - (super) friendly staff, funky interior (rooms, lobby etc), inner yard is excellent for chilling etc. Grab a beer at the bar, play some guitar (or two...) in the lobby and enjoy the vibe of the place and the great people who stay (or stray) there - I would recommend it to anyone !", "Date": "May 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Really cool and exceeded our expectations”", "Author": "LauraMandMattJ", "ReviewID": "UR105619331", "Content": "We stayed at the Michelberger last week and had a great time. The hotel looks great on the website and looks even better in real life! It was really cool and designed really well, with lots of interesting bits and pieces to look at. Although it was an achingly cool place to stay, it wasn't intimidating or scary in any way and had a really relaxed and chilled out atmosphere. We enjoyed drinking in the bar area, sitting on the comfy sofas and watching the world go by. The breakfast was great with the most amazing scrambled eggs and lovely fresh fruit. We booked oone of the cosy rooms and that describes the room perfectly, even though it was small though it worked really well for a couple and the bed was really comfy. It also had a great outside courtyard which was lovely to relax in in the evening. Lastly, the location was great, right opposite a U-Bahn station and it is only a short walk up the road to an area full of great bars, shops and restaurants. Fantastic!", "Date": "April 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berlin, Germany", "Title": "“Cool”", "Author": "kuchen1973", "ReviewID": "UR104738312", "Content": "It's a cool hotel with a cool bar, with cool rooms, in a cool neighborhood and with cool staff. If you yourself are not cool, do not fret. Just by staying here, you will start to feel dandy. The price for the rooms is more than fair and some of the great party locations in Berlin are a short walk away. And even if you don't feel like taking that walk, the hotel organizes a Friday night disco-dinner soiree with the perfect mixture of locals, alcohol and flashy lights. The breakfast is also great.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Oxford", "Title": "“The only hotel I'll be staying in in Berlin.”", "Author": "mdbell", "ReviewID": "UR102977591", "Content": "(..under my current budget, obviously.) If you're looking for somewhere cheap and central in Berlin, this is a place for you and you won't have to compromise on cleanliness, quality or comfort. The Michelberger has all of this. It's a convenient location - not slap bang in the centre, with Berlin's excellent public transport, you might as well be. This hotel does more than just ticking all the boxes; it has a real charm and cool vibe. It's unfalteringly modern and cool. You can tell the owners have had a lot of fun kitting out this hotel, without taking itself too seriously. It's full of little quirks, which you'll discover for yourself. We found all the staff to be friendly and knowledgeable. The hotel seemed to be full of people aged 18-30. There's no reason why anyone else should be put off, but you might like to have it in mind. I'd recommend to anyone without hesitation.", "Date": "April 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Rad”", "Author": "happylittlevegemites", "ReviewID": "UR102912375", "Content": "Best hotel that I have ever stayed at.... we wanted to live there. Couldn't of designed it better myself. Great value, location, decor, vibe, coffee, courtyard and most importanly room. Even got a peak at the \"book room\" when walking down the corridor and want to stay there next time. Looked incredible with an entire feature wall of novels. Did the Friday night \"Disco Dinner\" which was excellent. And then moved into the hotel bar to watch the live band and lounge about and listen to the dj. But before we went to bed we had a quick game of ping pong in the foyer. Even in winter it was a great place to stay, can only imagine how much fun it would be in the summer when the courtyard would come into full swing.", "Date": "April 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Almaty, Kazakhstan", "Title": "“The most awesome hotel in the world (and a great value)!!”", "Author": "DLRtravel", "ReviewID": "UR102860220", "Content": "This hotel is truly a gem of Berlin. If more hotels would be like Michelberger, I would never own my own house. Beginning from the innovative design to the extremely helpful and friendly staff, to the exquisite breakfast served in the cafe - this gem is perfect for business or leisure travel. You will be inspired, refreshed, and want to come back to Berlin just for the hotel.", "Date": "April 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“Funky Town”", "Author": "ipcollins", "ReviewID": "UR101980574", "Content": "This places just oozes cool! I stayed here for 6 nights with my wife and it was perfect. The rooms were very well designed and extremely comfortable, it was right near a main underground and overland train station, there is plenty happening around the area, and even the hotel goes off a few nights a week! It is a popular spot for locals to come and drink coffe or watch some live music in the very cool foyer/bar. The rooms were generally well priced and good value for money. The breakfast in the morning is also good value for money, and is delicious healthy food. The staff were also very cool and catered to our needs. I certainly recommend this hotel.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cincinnati", "Title": "“Hotel Alone Was Worth the Trip!”", "Author": "CincinnatiPatti", "ReviewID": "UR99515069", "Content": "Since we were traveling with 2 teens (19 and 16), we initially considered apts in Berlin, but then found Michelberger on Trip Advisor and were smitten by the website. We stayed in one of the Band Rooms, with the loft beds. It was minimalist, clean, and comfortable, with lots of nooks and crannies for storage. The breakfast room, with its incredible buffet and selections for every special diet need, was a beautiful place to start the day. Since we'd never been to Berlin, the nicest surprise was how close we were to 2 major mass transit lines. If you're used to little L'Occitane shampoo bottles and cutesy matching spa robes, this is not the place for you. If, like us, you like arty & funky, and something a little different, we'd highly recommend it!", "Date": "March 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Incredibly value in this stylish boutique hotel”", "Author": "lukesmith1975", "ReviewID": "UR99242747", "Content": "I've been guilty of having promised to write on trip advisor in the past but not delivering. Hotel MichelBerger has changed this, what a fantastic hotel. From the staff to the rooms everything was excellent and reasonably priced. We came to Berlin for nightlife but found the bar in Michelberger the best place we visited. I would recommend this hotel to anyone!", "Date": "March 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“michelberger hotel”", "Author": "frankec64", "ReviewID": "UR98710456", "Content": "everything about this place was fantastic!!!!!!! rooms are clean and tidy the the people on the front desk are amazingly friendly (ms Hammer) the location is brilliant right next door to the 02 world we could actually walk there from where we were shower room right size, beds clean, tv channels, reception and eating area friendly and not to much. i will be back here very quickly if i were coming back again thanks for looking after us you were amazing!! frank colley xx", "Date": "March 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rouen, France", "Title": "“One of the best hotel experiences I've ever had!”", "Author": "lkardatz", "ReviewID": "UR98697207", "Content": "My great experience with Michelberger Hotel began when they allowed me to check in early after arriving in Berlin 5 hours before my boyfriend. I found the front desk staff to be young, friendly, knowledgeable and willing to help 24/7. Everything about the hotel was new, cool and well-designed, i.e. they played one of my favorite movies, \"The Big Lebowski\", on repeat on LCD flat screens in the hallways. Our room was spacious and unique. I enjoyed spending a few minutes exploring its quirks before crashing for a nap on the lofted double bed. The free wifi they offered me at check-in allowed me to track my boyfriend's flight and map a route to the airport to meet him on time. His feelings about the hotel were just as enthusiastic as mine. Although we did not have time to check out the bar/cafe next to the lobby, we did thoroughly enjoy the 9 euro breakfast each morning and let me tell you, it was worth every CENTIME!!! Hands down, the best hotel breakfast we've ever had. I love Michelberger, its staff AND the breakfast. I would definitely go here again and would suggest that you try it for the first time. Hell, I even bought a t-shirt!!", "Date": "March 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vihti", "Title": "“My favourite hotel of all the places I've been”", "Author": "Sohannin", "ReviewID": "UR97931772", "Content": "Already been here twice, once with wife and once with colleague. Excellent rooms, excellent attitude with personnel and extremely comfortable lounge - no matter what the time is. Travelling options to every direction in Berlin are great, stations to trains are near. Great bars and restaurants are close, the location is not as expensive as the central and western part of Berlin.", "Date": "February 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zaltbommel, The Netherlands", "Title": "“heavenly and perfect”", "Author": "jottavg", "ReviewID": "UR97674407", "Content": "Everything is nice, inspiring, beautiful in Michelberger The people, the rooms, the breakfast, the lobby, the atmosphere perfect perfect perfect, good beds, nice bathroom, good place to be perfect connection with all parts of city Berlin nice area only the music is a little bit loud when you sleep on the first floor directly above the lobby Family van de Voort", "Date": "February 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Cool little hotel - great value and location”", "Author": "swbucho", "ReviewID": "UR97598520", "Content": "I've stayed at the Michelberger a few times now for both a city break and work purposes and i find it a great place to stay. Good value for a pretty cool hotel to base yourself out of for your explorations of Berlin - it has a chilled out lounge area with plenty of magazines and books to read plus a bar with a range of drinks and food - good for kicking back after a day on foot around the city. Rooms are v comfortable, tidy and nicely put together - small with the beds (intentionally) taking up most of the room which is fine given the time spent there! Overall has a very laid back and welcoming feel to it. Also does great breakfast if you want to pay a bit extra - buffet based in a lovely industrial breakfast room. Thoroughly recommended.", "Date": "February 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Coolest place Ive ever stayed - didnt want to leave and will be coming back soon”", "Author": "kingofkong", "ReviewID": "UR97391140", "Content": "Myself and my girlfriend stayed here for Valentines weekend. Its really easy to get to from the airport (35 mins away) and you cant miss the place with the huge neon sign outside it. Right by tram/train spot and also the Berlin Wall. The Friday night was buzzing inside with a live band playing, tv cameras and amazing cocktails. We got one of the loft rooms which were amazing - so cool, shelves of old,weird german science books, elevated bed, massive ceilings and windows - really unique style to the place. Breakfast - didnt go to the ajoinging restaurant because it was a continental breakfast buffet - looked lovely but wasnt our thing. Coffee,crossants and freshly squeezed orange juice in hotel cafe were amazing and really good value. All the staff are cool and really helpful - multi national mix of people... The hotel lobby and lounge are is chilled with couches,blankets etc to recline on. Last night there was a hotel guest signing impromptu with her mates on guitar and piano - it was fresh ! Couldnt reccomend this place more - didnt want to leave and i will be coming back with some mates asap Cool spot - unique - sound staff - amazing city !", "Date": "February 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“Epitome of Berlin cool.”", "Author": "erinisfunky", "ReviewID": "UR97295134", "Content": "i had one of the most fun and carefree weekends of my life in Berlin and staying at Michelberger was a part of that. We had the courtyard facing \"band\" room for just 3 of us, plenty of space to hang and sleep comfortably. Berlin beckons but you can't help but linger in Michelberger's bohemian vibe. One of Berlin's famous photoautomat booths is left out the front door on the other end of the bridge. The East Side Gallery is to the right.", "Date": "February 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "amsterdam", "Title": "“Great hotel for young people”", "Author": "mtbAmsterdam", "ReviewID": "UR97268531", "Content": "I really love the Michelberger hotel, I went there 2 times in one year! It really made our stay in Berlin nicer. The hotel is really nice looking, clean and has the best breakfast buffet EVER. 1 time I went with my boyfriend, and that was perfect, so I when I got back home I soon made plans to go again! The second time I went back with 3 girlfiriends. After a drive of 12 hours we arrived at the Michelberger in the evening to find out that they had overbooked the hotel and that we had to go to another hotel, because other people wanted to stay in the room one day longer!!! We made the reservation months ago! Why didn't they said to the other people that the room was already booked and that THEY had to go or had to wait untill we where there? SInce we had the terrible long drive we didn't want to go in discussion and we really wanted to come back anyway.....cause the nice stay of the last time was one of the reasons to come back again! The other hotel was really crap. It was a hostel with shared bathrooms, not nice looking rooms and not as nice looking hotel. So we were very very very dissapointed that we couldn't stay at the Michelberger have of our stay in Berlin. All we got is 1 free breakfast. Since I really like the atmosphere of the hotel we went back for that other night (and beacuse the other hotel was bad). I will go back again, cause of the looks and location. I just hope I just hope that next time I will get the room for all the days I reserved it. Or else it would me a big dissapointment, again and I think I wouldn't go back anymore. I am not sure whether it is a hotel for older people, I would more say that it is for young people. Couples or friend doesn't matter. I stayed in a room for 4 (the 1 night I we could stay) and it was wonderfull!!! The location is perfect, right in between Kreuzberg and Friedrichshain, so if you like those neighbourhoods, I would stay here!!", "Date": "February 20, 2011"}, {"Ratings": {"Overall": "5.0", "Rooms": "5"}, "AuthorLocation": "Moscau", "Title": "“Nice place to stay”", "Author": "NastiaLarkina", "ReviewID": "UR97257333", "Content": "I found this hotel on the Internet while surfing through sites with interesting outstanding design. Occasionally at the same time I planned my journey to Berlin. The hotel was really friendly and nice. I took the smallest room but it was nice and cosy and I loved the interior and the view from the window. Potato salad at the bar was also good.", "Date": "February 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Excellent place, great style and service”", "Author": "vonienne", "ReviewID": "UR97256847", "Content": "I loved the Michelberger Hotel. The staff was terrific, rooms very stylish and well thought out. I spent a lot of time just studying the clever little innovations in the room. The rest of the time I mostly spent in the great cafe downstairs. I really couldn't have asked for more; it is Berlin at its best!", "Date": "February 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Top value for money - Artsy hip hotel”", "Author": "troels_aagaard", "ReviewID": "UR97193864", "Content": "Great value for money. Small but fine rooms. A bit designer-chik but perfect for a short get away. Breakfast buffet is fantastic although it is 10€ ektra. Worth every penny.", "Date": "February 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Really unique hotel at a bargain price in a great location!”", "Author": "Ellzzer3000", "ReviewID": "UR96639933", "Content": "The hotel is a brilliant option for those who like something a bit different. The bar was great to hang out in with friendly staff and live music sometimes you get the feeling people just like hanging out here. We had a lovely homemade soup from the bar quite late when we arrived, there is a restaurant but we didn't use it. We had a loft room which we thought was a double but it's two single mattresses and duvets which is normal in Germany apparently. It wasn't a problem though. The room itself was great, roomy and very light because of the massive warehouse windows. The location is great as it's right next to both train lines and a tram stop is right outside. Overall we were surprised at the value of such a wicked hotel!", "Date": "February 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Finland", "Title": "“Fun and lively hotel in an awesome spot in Berlin”", "Author": "Annemi83", "ReviewID": "UR96472052", "Content": "We just spent 2 nights at Michelberger Hotel and we recommend this hotel to everyone! Even though the COSY room was quite small, it was pretty, fun and the bed was so comfortable. The walls are a bit thin, but this did not disturb us at all! we had a room on the 2nd floor, facing O2 stadium and could also see a bit of East Side Gallery. Hotel lobby is so comfy and relaxing, great music and reasonably priced drinks. Breakfast was OK, if possible go out to Friedrichshain (Boxhagener Platz) and find yourself a brunch buffet, it's worth it! I also ordered the Liebhaber set as a surprise for my boyfriend, which was a beautiful set of fruit, brownies and Prosecco! a lovely beginning to our fantastic trip!", "Date": "February 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Australia", "Title": "“Michelberger Hotel in Berlin – funky hotel, friendly and helpful staff, interesting area”", "Author": "wmlewis", "ReviewID": "UR93737269", "Content": "The Michelberger Hotel in Berlin is quite a funky place in the former East Berlin, in both appearance and vibe, having been converted from an old factory. The reception area sits adjacent to the cafe and lounge area, which you have to walk through whenever you come into the hotel. Mostly this was ok, but every now and then when I just wanted to get to our room (and a winding path it was, too, to reach it), especially at night, I wished we didn’t have to go through this area. No a big deal though, especially since the people in the cafe and lounge area always seemed very chilled out. The staff at the hotel were very friendly and helpful, and all in my experience spoke excellent English. We didn’t book our room with breakfast, but ate there pretty much every day of our stay because they were so good, and were very good value for money – it was a help-yourself buffet. The breakfast room itself, where they also held dinners sometimes, was really cool, with a few small stand-alone tables and large tables with long benches – there were views out to the S-Bahn station, and as an interesting people-watching area this proved to be quite good fun as part of the breakfast experience. The hotel is in an excellent and interesting area (e.g. close to the East Side Gallery), with lots of great places to eat and drink very near-by. It was also close to both U- and S-Bahn stations, and to the tram, so public transport was easy and convenient for going anywhere at all in Berlin. Possibly the only disadvantage of this versus a more central hotel was we were often reluctant to return there to chill out in the late afternoon before heading out again – not a big deal though. We had a 12 night stay in one of the loft rooms (ours was room 111), which was close ground level with a view of the courtyard. At first I thought this would be a problem from a noise perspective, but this proved unfounded. It was a very quiet room, even when there was music in the cafe and lounge area. We didn’t end up hanging out in the cafe/lounge much, but the events they had seemed to include cool music and chilled people. It was a very mixed crowd of people staying at the hotel, too, which was nice. From quite young and hip travellers to older equally hip folks – a nice menagerie of the world’s groovy travellers. There was free wi-fi with a password, too. Highly recommended place.", "Date": "January 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "cubalibre10", "Title": "“Friendly, individual with bucketloads of cool!”", "Author": "cubalibre10", "ReviewID": "UR91999335", "Content": "Michelberger has a pretty immense website, and it sets the scene for the hotel itself - zany, individual and very funky. The staff were so friendly and really helpful, location was awesome - near some great bars, the east-side gallery and the train/tube stations. Most of all the atmosphere created by the hotel makes it a friendly, relaxed and cool place to be - if you want to stay somewhere really different but with luxury and quality Michelberger is where it is at!", "Date": "January 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Perth", "Title": "“For what it is and aspires to be, this is a very good hotel”", "Author": "PattyTPerth", "ReviewID": "UR91957426", "Content": "The Michelberger is squarely aimed at a younger, cooler clientele and so those of us who are no longer quite so young or cool might struggle with things like the pumping music in the lobby and loft beds. That said, the quality of service is very good indeed, the staff are extremely friendly and helpful, and the breakfasts are amazing. The way the rooms are set up probably makes this hotel unsuitable for the very young or the very elderly but I would recommend it to everyone in between as a fun and different hotel experience in a good Berlin location.", "Date": "January 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“You feel like you are part of something cool here...”", "Author": "DawnR68", "ReviewID": "UR89697104", "Content": "I loved this hotel. I stayed in a cozy room, which was small, but very smartly and efficiently decorated. The bed was warm and very comfortalbe and the shower was fantastic; hot with great pressure. The place may not be for people seeking traditional hotel comfort or luxury, but for me it was fantastic. I enjoyed the clean lines, high ceilings and industrial feel. The whole place is very designy and a lot of attention has been paid to every detail, which for me was fun and interesting... The breakfast buffet was wonderful and hanging in the bar/lounge was really enjoyable and relaxing. The music is very well chosen and one night there was a really good indie rock band playing live. My experience with the staff was that they were welcoming, kind and helpful. It's hipstery here for sure, but not cloyingly so. Staff members seemed to sincerely want to take good care of all patrons and they were very professional. LOVED the area too...", "Date": "December 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ireland", "Title": "“Friendly staff, good location, very laid back”", "Author": "Meally", "ReviewID": "UR87154698", "Content": "I stayed at the Michelberger with friends on a stag night in early November. It's very easy to get to with an S-Bahn and U-Bahn stop just across the street. The staff are really friendly and very helpful. They were a little disorganised when it came to checking us in to our rooms but that was the only negative I can think of. The staff in the bar and at reception were great for organising taxis and giving advice on places to go. We were in a dorm-style room which was very tidy and spacious. The breakfast was good in the mornings and the beds were comfortable. There's a really good atmosphere in the bar/lobby of the hotel. Definitely a good place to explore Berlin from.", "Date": "November 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Funky hotel that my college aged kids loved.”", "Author": "sneezytennis", "ReviewID": "UR86500908", "Content": "Location was a bit far away from sights, but U and S bahn stations are right across the street. Staff recommended Rio Grange restaurant nearby which was very good. Also good falafel place right next door. Had a drink in the hotel bar one night, which always seemed to have lots of patrons there. Funky, edgy design of hotel lobby, rooms, etc. We had a loft room which was fine for mom and 2 college aged kids.Could use better light. Staff was hit or miss....some were very friendly and helpful, others didn't seem to want to be bothered or have the time for questions. Thin walls....couple next door kept me up one night, which was awful. Didn't eat hotel breakfast. Overall a good experience.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Paris, France", "Title": "“So Berlin!”", "Author": "descoubes", "ReviewID": "UR85732064", "Content": "excellent design, warm and courteous welcome, remarkable breakfast, very good east-Berlin location... what else do you need? you may just end up spending a large part of your stay in that hotel, from the bar to your room to the restaurant, and on again!", "Date": "November 2, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Leuven, Belgium", "Title": "“SUPERTROOPERDECOOLHOTEL”", "Author": "DafneK", "ReviewID": "UR85620984", "Content": "i love the michelberger and berlin!!! it is such a hip hotel, when i go to berlin, i would definitely go there again!", "Date": "November 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "cork", "Title": "“Stylish Hotel but lacks some comforts....”", "Author": "consan", "ReviewID": "UR83438439", "Content": "We stayed here for a long weekend and LOVED the look and feel of the hotel - very cool and funky. BUT even though we paid (in full, in advance) over the odds for rooms - €80 for single, €90 for double, which was the cheapest we could find; they had GIVEN away one of the rooms because we hadn't told them we'd be late. We were furious but they did offer a room with shared facilities for €40 instead which had to do for one night. We had bked separately but they mixed up the reservations for the whole weekend, who was checking out when etc. In our room, arriving at 11pm the windows were wide open and the room freezing cold and no heating working. For this, we got free breakfast (amazing selection) the next day and the heating was repaired by the next evening. Our friends heating never worked. Painful stuff. Staff were lovely and friendly though so you couldn't get angry with them....really. Hairdryers at reception, no phones in rooms which are very minimalist but stylish. We discovered we were in the cool part of town on the last night - previously we had partied in Orangieburger (??) area of town. then a girl there said go to Warscheur Strasse area and the Simon Dach Strasse, which is just up the road from the hotel! Very Shoreditch ( London) and up and coming. Found fab restaurants and bars there, very reasonable. Had a great night out there! So for all the hassles in the hotel, we would still recommend because it looks fab, is comfy, great breakfasts, lovely staff........but check your room in advance and tell them to close the window if you're staying in winter! Loved Berlin and it's people although it was completely lacking in the expected German efficiency - everything was delayed or late. It felt like Berlin moved to it's own tune and we loved that. Amazing bars to suit all tastes, great graffiti, funky art galleries and shops.", "Date": "October 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Portland, Oregon", "Title": "“hip hospitality at an excellent price”", "Author": "theholidaygirl", "ReviewID": "UR82492792", "Content": "Michelberger is a stylish, friendly, comfortable place to stay in East Berlin. It's also an excellent value - we paid only €70 a night for our loft room. Despite its reputation as a party hotel, it wasn't noisy & we got excellent sleep. Rooms are funky & designed in a way that they feel like little apartments - spacious & light-filled. Lots of fun little details, too. Do they always show the Big Lebowski on TV in the hall? The breakfast, while a tad pricey by Berlin standards, was delicious & extensive. Its proximity to U-Bahn, S-Bahn & the trams made it really easy to get around the city. That said, there's not much to walk to (besides Karaoke, the East Side Gallery & some food stands) near the hotel. The area is a bit industrial, but it's not deserted (lots of foot traffic to the stations) . More by way of sundries would only improve the experience at the hotel, but the lack of them isn't a deterrent. We'll definitely stay here again the next time we're in Berlin.", "Date": "October 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "California", "Title": "“Great Place to Stay”", "Author": "lostmywalletagain", "ReviewID": "UR82333780", "Content": "I loved the cafe. It had great service, light food and outstanding coffee drinks. It was really a nice place to hang out while around the hotel.", "Date": "October 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cardiff", "Title": "“A lovely, homely stay in Berlin.”", "Author": "CardiffKid", "ReviewID": "UR81650220", "Content": "The hotel is just off the warchauer strasse station in east Berlin, a youthful part of the city. It's in a good location with two main train and underground stations a stone's throw away. There is also a collection of some good places to eat and drink if you don't want to go far. Positives: The reception and cafe area is great, big loungy rooms with blocks of books. Nice place to have a night cap after returning from an evening out (As we were checking out, some live music was on) Free fast wifi The rooms are cosy, stylish and clean. They play the Big Lebowski on tv screens on every floor, so you can always catch glimpses of this great film at every opportunity Friendly and helpful staff Negatives My room, for some reason, had a window into the shower. Not a complaint but just a bit disconcerting depending on whom you sharing a room with! The breakfast was nice but at €9, not cheap so you had to eat yours moneys' worth.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Harrow, United Kingdom", "Title": "“Not so much a hotel, more an upmarket hall of residence”", "Author": "davethewasp", "ReviewID": "UR81236976", "Content": "Having read the reviews I was really looking forward to my 4 nights at the Michelberger and, in some ways, I'm pleased that I went. First, the good stuff: great location for public transport and the O2; friendly staff; \"cool\" atmosphere; good bar; excellent breakfast; clean and well renovated rooms (it's in an old factory building built around a central courtyard) with comfortable bed; free wi-fi throughout. However, I really think prospective guests should be aware of several points: the bar and ground floor sitting area reminded me of a Students Union bar particularly later in the evening, whilst the breakfast room with its long trestle tables and non-matching chairs reminded me of a refectory (albeit that the breakfast itself was, as I said, excellent). Now the not so good bits: reception is chaotic; no porterage; there is one smallish, slow lift serving 119 bedrooms on 5 floors; my room was tiny - no desk and chair (no chair at all); no wardrobe (just 3 hooks on the wall with 2 coat hangers); no airconditioning; no business facilities whatsoever; no fitness facilities. Would I go back? For a weekend with my wife or a concert at the O2 - definitely yes. For business - sorry but no.", "Date": "September 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tampere, Finland", "Title": "“great place”", "Author": "jess3416", "ReviewID": "UR78530700", "Content": "Had a great time here. Cool bar and lounge area, cute, clean and comfortable rooms with attention to detail, great breakfast in the morning. Just down the street from the East Side Gallery. Next time I go to Berlin I'll be staying here for sure. We had a room on the street side which could be a bit loud in the day with the windows open and the rooms would get warm from the sun with the windows closed, but we didn't spend much time in our room during the day anyway.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Trendy, quirky, great location and the real Berlin experience”", "Author": "TravelKitteh", "ReviewID": "UR78490067", "Content": "We stayed in the Michelberger Hotel for two days in August at the start of a 3 week trip around Europe by rail. We were recommended to the hotel by a friend and were delighted to find it. The hotel's interior is funky, full of unique furniture and accessories, with hundreds of books around comfy chairs and sofas, lampshades made from magazines, guitars in corners for guests to use as they wish and a great court yard for warm weather. The rooms are quite quirky too - we booked a band room for four people and had a great upstairs area with netting to stop you falling out of bed! The whole place had a great 'Berlin buzz' about it and we ended up finishing our nights out with a bottle of wine in the bar which has a great chilled out ambience and which seems to be frequented by locals as wells as musicians, artists and dancers as they travel. Very convenient for tube and overground trains too and an easy 5-10 min train journey to central Berlin. We also walked one day and it only took about 30-40 mins. There are also some great restaurants and bars 10 mins walk away and reception will be happy to recommended them for you. They also have a very cute dog! Big thumbs up!!!", "Date": "September 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Extraordinary.”", "Author": "Morning_blossom", "ReviewID": "UR78105784", "Content": "It was a great place to stay. The architecture, the way they put furniture in the room...everything was very unusual. It is worth just to go there and see it.", "Date": "September 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“This is a fantastic hotel-not only is it...”", "Author": "TravellerGG", "ReviewID": "UR77562074", "Content": "This is a fantastic hotel-not only is it in a great location but it's full of friendly staff, quirky decor & excellent value for money. Well worth a visit.", "Date": "August 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“definitely the coolest hotel i've stayed in!!”", "Author": "chillychillies", "ReviewID": "UR76461656", "Content": "The Michelberger is such a cool place. Fab rooms and really well designed with a deconstructed warehouse feel, lo-fi and modern but also feels incredibly comfortable. We had an awesome room with a mezzanine style raised bed, all the rooms look amazing - check out the pics on the website. We didn't make it for breakfast but did squeeze in a couple of cocktails in the bar which were lovely. The location is brilliant, close to some awesome bars & clubs, short walk to east side gallery and the river and friedrichshain is a really nice area with cafe's, bars, cool shops and a fab flea market on a sunday. It's also just across the road from the metro station and trams & easy to get to from the airport. All that said, what really makes it is the people, they're so friendly, helpful and welcoming, you leave feeling like a friend. We were lucky to be there for the first birthday and invited to a brilliant party out in the courtyard.......literally didn't want to leave, we were even considering changing our flights! We'll definitely be going back and recommending to friends. THIS HOTEL ROCKS!!", "Date": "August 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Fantastic all-rounder”", "Author": "tgord", "ReviewID": "UR76402502", "Content": "Very trendy, but ultra comfortable, a lobby and courtyard where you would actually want to spend time and relax. Great rooms, we read many reviews that said the hotel was too hot, I stayed in 31oC temperatures and was fine. it doesn't have air conditioning, but fans were supplied which made it fine. Most of the rooms don't face the road, and have huge windows which open completely.", "Date": "August 23, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Fantastic boutique hotel”", "Author": "NBlick", "ReviewID": "UR76166886", "Content": "The Michelberger is the most characterful hotel I've ever stayed in. A boutique style hotel near the east side gallery, easy to get to the centre of Berlin and airports (u-bahn opposite) The staff were very friendly and helpful, and frankly I could have happily stayed in the hotel all day. There are various 'themed' rooms, we had the mezzanine level with 'goal posts' to stop you falling out of bed! The coffee shop/bar in the hotel is reasonably priced. in an amazing setting. I will absolutely stay there again and have already recommended it to friends.", "Date": "August 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Unique and food quality stay in a courtyard facing room”", "Author": "Seraphina_82", "ReviewID": "UR75626468", "Content": "This is the most unique hotel I have stayed in. If you are sick of boring cardboard cutout hotels that all look the same, or hotels that look like their target market age is about 60, go to the Michelberger. The unique touches aside from the funky loft layout included second hand books throughout the hotel and made into lampshades, the chopping board breaky tokens, the witty way they provide written info i.e the 'do not disturb' sign. We were originally given a road facing room and it was noisy so we immediately went back to ask for a courtyard room and in this room we had a beautifully quiet sleep. It was easy to get to the city centre by train. I will say that some sheer curtains for daytime (there was only a blockout set) and a full length mirror would have made my stay 100% perfect.", "Date": "August 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Antwerp, Belgium", "Title": "“Funky low key hotel with comfortable rooms in great location”", "Author": "nikatik", "ReviewID": "UR74854511", "Content": "The Michelberger is a supercool stay for the young and hip who would like an inexpensive yet comfortable stay. There is a very cool bar, library and outside courtyard and have a mean breakfast!", "Date": "August 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Cool Place, Cool Staff and Great Location”", "Author": "mushy79", "ReviewID": "UR74500746", "Content": "Travelled to Berlin with a large group of mates for a long weekend. The hotel is a modern warehouse style hotel. It has a great location right next to a station and lots of pubs and restaurants near by. The rooms were spacious, clean and funky. The staff were also helpful and friendly. Sitting out in the courtyard in the sun drinking a cold German beer was amazing. Would recommend this to any younger groups who want to stay in a cool hotel that won’t break the bank. I have to say Berlin is an amazing place and the people were all so friendly and would highly recommend it for a city break. Thanks again to the Michelberger for helping us have an amazing weekend.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nicosia, Cyprus", "Title": "“Superb location, great hotel!!!”", "Author": "cfiakka", "ReviewID": "UR73595467", "Content": "The hotel was really nice, very artistic in its interiors and the staff there was really cool !!! The location was also spot on as we could be everywhere in just a few stops, and the S-Bahn station (Warschauer Strasse) is conveniently just opposite the hotel! The area is also interesting if you go up the road towards the station with little nice restaurants and cool shops! The only minus which wasn't that big of a deal was the actual cleanness of the rooms! But you could always complain if you have a problem! Overall very excited with this hotel and will definitely go back soon! ps: if you are looking for a hotel with a real pampering this is NOT your hotel! But if you are like us that just appreciate simpler things with tasteful looks and approach this is just perfect!!", "Date": "August 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“Awesome Hotel”", "Author": "Mike_Caridi", "ReviewID": "UR73212668", "Content": "Great place to stay not only for it's great location, but the staff are also excellent. I stayed in the loft room with the double bed on the second level and it was great. I will definitely stay there on my next visit to Berlin.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great hotel, perfect location”", "Author": "Sugarplum85", "ReviewID": "UR72454193", "Content": "Okay, I have read some of the other reviews before posting my own, so here goes. I went to Berlin for a week's holiday and booked this hotel through Expedia, having read other positive reviews and seen some photos I decided this was the hotel for me. My room was small but perfect, with even the basic room having big beds (queen/king, I can't remember which) as well as a TV, wet room with great shower, and a fan. Honestly I don't understand why people are complaining about the lack of air conditioning. This is Berlin, Germany. The heatwave was a one off, maybe if you were in a year-round warm country you would expect A/C but not in Europe! Also this hotel isn't 5-star, so if all inclusive breakfast is what you want, you're looking in the wrong place. My only gripe - and this is very minor - is that there are no tea/coffee making facilities in the room, I only say this as even the cheapest budget hotels provide this facility in the room. Otherwise for me, the room was great and I really loved all the little details, from the rope towel racks, to the cute colourful coat hangers, the sepia photos on the walls - and who could forget the funny Michelberger labels on everything. Very fun! The location of the hotel is ideal. I knew I didn't want to stay right in the centre of Berlin so chose this location. As others have said, the Warschauer Strasse U-Bahn and S-Bahn station is right across the road, with all lines stopping there. A short walk away is a Lidl, Kaiser supermarket, the East Side Gallery, and lots of highly recommended cafes and restaurants. Step out of the door of the hotel and walk left, about a minute later you'll discover an amazing falafel place, Momo Falafel, where you can get a pita bread or box of falafel and help yourself to the accompanying salads and sauces for just 3-4 euro. Perfect for when you don't feel like venturing far! Breakfast was great and at €9 I was expecting great things - I needn't have worried. Plenty of fresh fruit, muesli, homemade breads, meat, smoked salmon, croissants, jams, butter, fresh coffee and tea, eggs - all sorts of yummy stuff to help yourself too. I think I had breakfast at the hotel nearly every day of my stay! The staff were always really helpful, never rude, and the only time I had to wait to be seen was if they were speaking to another guest, or on the phone. Yes, the hotel does focus on the kitsch and quirky side of things - but that's the point! To have somewhere a little different, informal, doesn't take itself too seriously. During my stay I saw other guests of all ages, couples, solo travellers, students, businessmen - it just goes to show that this hotel can suit everyone. Often I would just go downstairs to the bar/lounge area just to read, grab a drink and a slice of cake, and relax somewhere outside of my room. The bar is also well stocked, with hot and cold drinks at reasonable prices and strongly mixed! For anyone who's a fan of the Big Lebowski, try the Michelberger's 'The Dude' cocktail :) Mostly, I loved the fact that you could just wander around the hotel, take pictures, or do whatever you wanted without feeling like you weren't allowed to explore. My advice to anyone staying here is, take this hotel for what it is - a budget but fun, comfortable and quirky hotel in a great area of Berlin. Tschuss Michelberger, I hope to return soon! :)", "Date": "July 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Helsinki, Finland", "Title": "“A bit dissapointed”", "Author": "Minttuinen", "ReviewID": "UR71661358", "Content": "We chose the Michelberger hotel based on great reviews. We stayed there for 7 nights, and started to notice that everything wasn't so great after all. At first the hotel was just like described, very cool, nice details and also the room (loft room) was very cosy. The hotel is near public transportation, u-bahn, s-bahn and tram. So very easy to get to and also in an interesting part of town. But. ..First of all, the room was cleaned properly only the first two days of our stay. The next days it was bearly cleaned at all - beds were not made, floor wasn't cleaned, or table tops. They seemed to only take out the trash from the small carbage bin. There was dust everywhere from the street because we had to keep the window open, due to the fact that there was no aircon. Towels were not changed until asked. Not that they have to be changed every day, but during a week you would think so. We told the reception about this, and no change in the cleaning. About the staff - they seemed quite nice, but you would always have to wait a long time before they had time for you. Sometimes there were three staff members kind of there, near the reception - but only one to serve the customers. They didn't seem to be very professional, a bit too much hanging out and not doing there job. I had the feeling that I was bothering them if I had a question. They did not do anything about the cleaning in our room - I didn't think they took it seriously. We checked out in the evening because we had a really early morning flight, and had to do it through very loud music as there was a band playing in the lobby. The desk could be in a different place - so that the music wouldn't disturb talking to the staff at the reception. Also music from the bands in the lobby (almost every evening) was too loud (could hear it clearly to the room) and disturbed our sleep as the music went on until at least twelve in the night. So - I would recommend this hotel only for a short visit, and only if you care more about a trendy and cool atmosphere than the service of a hotel. They have put much more effort into the atmosphere than the fact that it is supposed to be a hotel - not a hostel.", "Date": "July 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London", "Title": "“Disapointed”", "Author": "stub0612", "ReviewID": "UR71328188", "Content": "Stayed at this hotel in unusaully hot weather and seeing as there was no air con the rooms were unbarearbly hot, they had run out or fans and so did not sleep at all well. The loft rooms are the ones to get and at €90 good value, the bar was great, atmosphere ok, all be it a bit too try hard with people trying to be cool for no aparrent reason, overall ok and i am sure that if went at a differnt time of year then may be ok but I am afraid this Uber trendy place needs to stop trying so hard and get their basic services sorted out, also the staff seem to act as if they are guests, you can not work out who works there and if you can get them off their phones you could get them to help. no phones in the rooms and the lift was not working so all in all a chore and hotels are not supposed to be a chore. I left a day early as i could not bare to be there another night!!", "Date": "July 18, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Cape Town", "Title": "“Average at best”", "Author": "CliffCo", "ReviewID": "UR71319871", "Content": "I chose the Michelberger because of the great reviews on TripAdvisor. On the plus side, it is in an interesting side of town and there are some great restaurants around. It is also close to trains, trams and buses. Too close in fact. At night we couldn't open our windows because of the noise of cars, trains, trams and pedestrians outside. But, because it was quite hot and humid in the rooms (due to no circulation), we had to make the choice of either getting some air or sleeping. I agree with an earlier review that said the staff were not particularly helpful. They weren't unfriendly, just a bit disinterested. The biggest issue I had was I reported a (very) noisy fan in the bathroom on my way out one morning, and asked for it to be fixed that day. That night (around midnight) the fan started a loud thumping noise meaning sleep was impossible. I reported it to reception who made an effort to fix it without success and who couldn't answer why it hadn't been done during the day. In the end I opened the window because the street noise was preferable to fan noise! I know things can go wrong with anything, but their lack of effort to fix it when it was reported much earlier is what annoyed me most. The place has potential but needs a big attitude shift.", "Date": "July 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "West Chester, PA", "Title": "“Nifty Place, Good Location; Hangover Nightmare.”", "Author": "Toddworth", "ReviewID": "UR70742413", "Content": "We chose Michelberger as a swanky, young, and hopefully fun place to stay while in Berlin on our honeymoon. Very easy to get to as it's right across the street from two bustling U and S-Bahn lines, one of which (the U1) runs through Kreutzberg (like Berlin's Brooklyn) and many of the decent and un-touristy places to eat and hang out while there. When we arrived we were amused and impressed with the decor and the small touches of kitsch everywhere (ie. the old vinyl-framed b&w photos of random people). The beds in the upstairs loft seemed pretty comfy, and the shower was nice. Cool layout and great utilization of space. Stylish and unique above all else. So, we took advantage of the locale and went out to some great clubs and bars each night of our stay. Michelberger is across the river from Watergate and around the corner from Berghain. The loft was sweltering each night or morning when we came to bed despite having a fan blowing right on us, and neither of us had a good night's sleep for the time we spent in Berlin. There's no ventilation at all. Even worse, napping during the day was way out of the question because of the roar of traffic below; our options were to roast like turkeys in a quiet room with the windows closed or deal with the noise and try to get some sort of air flowing with open windows. It's paradoxical in a way--this is a place where a lot of partygoers flock to, yet a terrible place to sleep off a hangover. It is not the staff's fault that there was a heat wave while we were there, nor is it their fault that a torrent of endless and cacophonous traffic rolls by here twenty-four hours a day. We appreciated the unique vibe this place has to offer, but we simply couldn't sleep a wink while staying here. We paid around e80/$100 a night for no amenities besides hipness and lo-fi appearance. In a city with 600+ places to stay, you can find something better for this price. Despite all of this, I'm happy to have given it a whirl because it was quite different from anywhere else I've stayed. I could see this place being cosy if the conditions were right. For us, though, they weren't.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Hippest hotel in town or maybe even the world”", "Author": "Virginifer", "ReviewID": "UR70550322", "Content": "We loved this hotel. The whole concept of the place is AMAZING. It was the little touches we loved about this place: Big Lebowski playing in the corridors; little wooden tokens for breakfast; door key designed like a credit card. Rooms are great. We had a loft. There was a little noise and there is no aircon as they are minimising their carbon footprint. Other than that, we loved everything about the place. Free wifi. Breakfast is good. Bar and beer garden gets a lot of locals in and has a great feel to it. Location in East Berlin is the best place to stay we think. Room rates are great. Upgrade to a loft if you can.", "Date": "July 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“Great hotel, but an issue with the breakfast”", "Author": "paroncider", "ReviewID": "UR70336820", "Content": "We were thrilled with this hotel, from the funky decor and friendly service to being a stone's throw from the s-bahn. It has a great vibe, and is ideally situated for exploring the nightlife of Berlin, as a few clubs were just across the street by the s-bahn station. The hiccup we encountered was being overcharged for breakfasts. Our group of four stayed three nights, and only ate breakfast downstairs once. Unfortunately the breakfast system is a bit flawed, as you collect a token from the front desk and hand it to the woman at the counter in the dining room. Somehow, something went horribly wrong and we were charged for something ridiculous like 16 breakfasts, when our group only ate downstairs once (breakfast x4)! We were only told of this error on checking out and unfortunately the hotel didn't believe us. We had to barter down and had to settle at paying for eight breakfasts, which was still disappointing that the hotel staff didn't believe us. If I recommend Michelberger to friends, I'll suggest they avoid breakfast altogether.", "Date": "July 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nottingham", "Title": "“Michelberger ist sehr gut!”", "Author": "PurpleFoxglove", "ReviewID": "UR70030948", "Content": "A cool, quirky hotel in East Berlin which I would recommend whole-heartedly. It has lovely bar, a seating area full of books, musical instruments, and lampshades made out of magazines, and a outdoor area which regularly has live music, and while I was there, had big screen TV's for the world cup. The atmosphere is great, and the location is perfect, just across the road from the train station and underground. A minute's walk away is a lovely bakery with an assortment of pastries for breakfast, which also serves coffee, and obviously the inevitable sausages! The hotel also offers the oppertunity to take an alternative tour of Berlin, with no cost apart from whatever tip you wish to give. This tour takes you to the bits of Berlin which you won't find in many tourist guides, but are extremely interesting in giving a taste of the 'real' Berlin. The showers have a see through window, so perhaps if you are not much of an exhibitionist and enjoy your privacy, that might put you off! However, me and my friend were fine and just agreed not to look! Rooms come with a bathroom, sink, and TV and are cleaned everyday.", "Date": "July 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "resemannen", "Title": "“Too cool for school”", "Author": "resemannen", "ReviewID": "UR68850942", "Content": "The Michelberger hotel is very easy to get to thanks to it's great location: right outside the hotel you can choose to go with the S-bahn, U-bahn or take the tram into the city. The room we stayed in (Cosy) was had a really cool design and there were plenty of funny little details. However, the room didn't feel very clean: there were stains on the floor and on the walls and the room had a funky smell in it. On the day that we were leaving the hotel we also saw what looked like a pile of dump in the stairs to the lobby...", "Date": "June 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Canberra, Australia", "Title": "“Great beds, great location, great vibe”", "Author": "OirishOrstraylean", "ReviewID": "UR68617121", "Content": "Great beds, great location, great vibe. We stayed in a loft room, very funky and imaginatively designed, with massive windows, a double loft bed, a day bed, a tiny bathroom (with a fab shower), TV and various unique touches - netting shelves, anyone? The staff were friendly and very helpful all around, from the bar man to those on reception. Great breakfast too... I miss it already, and we only left yesterday.", "Date": "June 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tucson, Arizona", "Title": "“A really funky hotel that gets you in the right mood to enjoy Berlin.”", "Author": "Dimitrivaz", "ReviewID": "UR68451818", "Content": "This brand new hotel just opened last September, and the young staff created this unique property by converting an old warehouse building. It really feels like an IKEA summer project completed by some recent college grads, but the whole idea works perfectly. It is located in a lively part of the former East Berlin, which has a run down look to it, with tons of young adults just hanging out day and night. Our daughter and her friend were intrigued by the atmosphere, and enjoyed the clubs which were close by. The rooms are spacious, and include all the amenities, but nothing more, and certainly would not be termed luxurious. Don't come here if that is what you need in a hotel. Stay here if you want to try something a little wild, don't mind hanging out in comfy chairs in the lobby, or conversing with other young travelers in the courtyard. We had a blast, and the girls said it was their favorite hotel in the whole trip. Free wifi and paid on site parking were available.", "Date": "June 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Love the super-efficient single room”", "Author": "TrinityNYC301", "ReviewID": "UR67304128", "Content": "After booking at the Michelberger, I was concerned I would be the only person over 35 in the hotel. I wasn't though it definitely skews young. I was also concerned it was too far east, but I loved the location. Very convenient to transportation and right by a fantastic bridge. The staff was helpful and friendly and i LOVED my little room. I live in a studio in New York, so I appreciated the efficiency of the room and the very high ceilings. I did not have breakfast there as i was still jet lagged but the breakfast/diing room looked very nice.", "Date": "June 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Best Part of Berlin”", "Author": "kathym530", "ReviewID": "UR65398391", "Content": "I can't add much more to the previous reviews. We picked based upon Trip Advisor and were not disappointed. And even though we are not as hip as the hotel, we felt welcome and comfortable. I loved the common spaces and spent a wonderful early morning in the patio, at breakfast (which was fantastic) and in the sitting area...great spaces to read, write, listen to music and relax. Our needs were anticipated and the staff was friendly and helpful even for the stupid questions..like how do you turn on the lights (with the key) and now that you've told me (again) can I have another key cause I left mine in the room. Room was comfortable and very green....a very smart hotel. Loved it.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Brilliant hotel: relaxed, original and quirky with fantastic staff”", "Author": "Trainspotter22", "ReviewID": "UR64824594", "Content": "I spent three wonderful nights at the Michelberger Hotel. It is like staying in your own loft studio in Berlin with the best cafe/bar downstairs. The staff are on the ball, friendly and extremely helpful. The rooms are quite minimal but well considered. They have got the important things right - sound proofing, good quality mattresses and linen, ventilation, high ceilings, curtains that work - and have not wasted money on horrible hotel furniture (let's face it, even in 5 star hotels it is mostly not 5 star design), mini bars etc. You get a bottle of water and there is some pleasant hair and body wash in the bathroom. No wasteful little bottles. If you like your souvenirs you can keep your room key. Rarely have I stayed somewhere that I actually wanted to hang out in the bar or lobby but there was always a really chilled atmosphere, day and night. Breakfast is highly recommended and a bargain. I will be back!", "Date": "May 20, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Brazil", "Title": "“One of the coolest hotels I've ever stayed”", "Author": "Alegitana", "ReviewID": "UR64446454", "Content": "Modern, trendy, cosy, creative...I could spend my time giving lots of adjectives to this hotel. I've stayed there for one week, during a hard winter, and I could not imagine a better place to stay. Very nice rooms (stayed in a loft one), DELICIOUS breakfast (9 euros), great and cool bar (handsome barmans!!!), alternative neighborhood, next to some of the best nightclubs in town, very nice STAFF! I'd like to come back in summer. Maybe next year!", "Date": "May 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Paris", "Title": "“Left the hotel yesterday, can't wait to go back there!”", "Author": "Mia_Paris_75", "ReviewID": "UR64380406", "Content": "I picked this hotel thanks to tripadvisor and I couldn't be more satisfied with my choice. The rooms are simple yet hype and cosy and the atmosphere of the hotel is great. We stayed 4 nights and really had a chance to enjoy our rooms and the beautiful lobby. The staff is nice and helpful and even advised me when I was looking for a vegetarian restaurant near the hotel. Stupid tips : the wifi code changes every day so you have to ask to the reception for a new code every day the bar is open all night and they have some very good stuff (japanese whiskey, 15years old rhum and cocktails...) when you enter your room for the first time, you have to know that to activate electricity, you have to put your key room in a slot just after entering (left side when you enter) if you have your breakfast at the hotel, try to have it before 10am, you'll have more choice at the buffet. And believe me, it worth it. I'll definitly come back, with more friends !!", "Date": "May 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London UK", "Title": "“Uber Cool hotel - without being pretentious”", "Author": "Cleo_O", "ReviewID": "UR63958322", "Content": "The Michelberger would not be out of place in trendy Shoreditch or Hoxton in London with its cool warehouse/industrial interior and exposed lighting wiring, a hotchpotch of differemt bar chairs and huge sofas to slump into. The lounge is sublimely relaxing with racks of books, a grand piano and acoustic guitars which are occasionally played well (by residents or official musicians, I dont know!) and there's a great playlist of music in the bar segueing effortlessly from rock, pop to country to classical. The bar serves probably the best coffee in Berlin and some very decent cocktails too. Breakfast is a relaxed buffet affair set in a separate room with long refectory tables and a delicious organic range of breakfast items such as salmon, eggs, cold cuts, juices, coffees and teas, breads and cereals and fruit and veg, at 9 euros per person. Snacks are available all day in the bar at a reasonable price and are of great quality. Service is charming, welcoming, friendly, efficient and super-helpful. Bedrooms are set around a large courtyard, home to smokers, bicycles and some tables for warmer climes. The cosy Room does just what it says on the tin; its compact and ship cabin like, with not much storage or hanging space. The rooms are simply decorated, with humorous touches (altermative Do Not Disturb door sign is a classic example). Even though the rooms are small, they are all surprisingly airy and bright, the double bed is large and super comfortable, and the shower hot and powerful, and everything is spotless. The hotel is right opposite the U1 line that runs east to west and there's a tram service too. Check out Simon Dach Strasse - 5 minutes walk away for a wonderful array of well priced restaurants and bars, and the East Side Gallery on the wall by the river. In short the Michelberger is a fantastic option and I wouldnt hesitate to book it for my next trip. Enjoy.", "Date": "May 12, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Love this Hotel”", "Author": "Scribalicious", "ReviewID": "UR63402730", "Content": "I have stayed in this hotel the last two times I have been to Berlin and have also recommended it to my friends who loved it. I love it. Perfect Location, Friendly Staff, great price. Check it out.", "Date": "May 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Beautifully designed modern, friendly hotel.”", "Author": "Maccamarie", "ReviewID": "UR61972584", "Content": "The minute I walked into the Michelberger I wanted to live there - cuckoo clocks, vintage suitcases, fresh flowers, grand piano, walls of books - it is immaculately designed, down to every last detail. The staff were friendly and helpful. They were able to accomodate us for an extra night following the volcano fiasco, and we were able to borrow a laptop to check our travel situation. The room was basic (bed, bathroom, tv) but cosy, clean and modern and good value for money at 60 Euros a night. Breakfast at 9 Euros was an all you can eat feast and served until a leisurely 11 o clock. The hotel is easy to get to - on the s bahn, u bahn and tram routes. And there are lots of cafes, bars and restaurants in walking distance. My only criticism was that there was a lot of noise from the bar and outdoor area on the Saturday night until the early hours, and if I was a lighter sleeper this might have disturbed me. All in all though, if I go back to Berlin I would definitely book the Michelberger hotel again.", "Date": "April 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“A excellent hotel and a charming staff”", "Author": "Jean_76_Paris", "ReviewID": "UR61652141", "Content": "We are a couple who has stayed in this hotel during the Easter. From the first moment we could feel everything was perfect. There, we met Alex (one of the receptionists) who helped us in everything we need from the beginning till the last day. The best receptionist in the world! Thanks for everything Alex! The hotel's location is perfect because the stop of the U-bahn and S-bahn are 50 meters from the hotel. In addition, the neighborhood where it is located (Friedrichshain) is a very interesting neighborhood if you're a young person looking for a dynamic neighborhood with cultural activity. Every detail in the hotel is put carefully. The design is visible in every corner of the building and everything is taken care to ensure that tenants are comfortable. The bar area is located next to the reception and is an ideal place to chat, meet people, listen to the music, drink or use the internet. It is really quiet and cozy. The room where we stayed was the Loft. It is a large room where a big bed is housed at a height. There is a big table too, to put everything you need there, and there is also an extra bed with big cushions that you can use like a sofa. The windows facing the street were beautiful and the bathroom is clean but have little light. Another notable thing perhaps is the breakfast. For just 9 euros have a varied breakfast with various products of high quality. In addition, people who work there are very friendly. It's very recommendable to have a breakfast there! The most notable thing in the hotel was the people who work there. They are really helpful and friendly, and they have very good atmosphere! I think they really like what they do and you can feel it when you are there. In short, is an ideal choice for young and happy guests looking for a cozy place with excellent service. People doing this hotel are wonderful and have managed to create an almost perfect hotel. Do not hesitate to visit this hotel if you are going to visit Berlin.", "Date": "April 16, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "W Sussex", "Title": "“Excellant Hotel”", "Author": "JemThomas", "ReviewID": "UR60921944", "Content": "This hotel ticks all the boxes for a family with teenage kids. The Family rooms are just right and the price at 65EUR per night is spot on. You are right next to the U Bahn and Tram so getting around is easy. Freidrichshain is a hip area with lots of interesting places to eat. Don't let the odd web site put you off these guys have really put some thought into this place and have created a novel freshing place to stay. They do follow the Easy Jet model so you have to pay for all the extras, for example the breakfast is 9EUR but it is a really good spread so fill yer boots and if you're not hungry you don't have to partake. So if you are planning any sort of trip to Berlin STAY HERE you wont regret it.", "Date": "April 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fort Lewis, WA", "Title": "“Classy and affordable hotel at a great location”", "Author": "thefortuna", "ReviewID": "UR60461488", "Content": "The service at the Michelberger was amazing. I was delayed and they let my partner check-in under my name easily. I got the single room and it was compact but very unique, free wireless, and a flatscreen TV. It had everything a young couple needed to start sightseeing in Berlin and beyond. The location is a two minute walk away from the train station. In a few stops you are at the heart of Berlin, and Potsdam is a short hop away. In one day we hit the Brandeburg Gate, Checkpoint Charlie, museums, looked at the river Spree, did some local dining, and rode the train back to the room and still had time to go for a drink downstairs at the wine bar/cafe and some conversation at the lounge. Very convenient. The location is absolutely the best part of this hotel. What I liked least was not having a phone in the room. I recommend bringing a laptop and using a Skype account. Problem solved.", "Date": "April 5, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Berlin, Germany", "Title": "“Basecamp for Berlin-Wildlife-Excursions”", "Author": "kanoesel", "ReviewID": "UR60428459", "Content": "I stayed a long time there.....this hotel is organic, its crowing more and more to a melting point for cool dudes and amazing women from all over the world. If you wanna stay in Berlin, take a hotel. If you wanna be alive in Berlin, take the michelbergerhotel ! \"Heissa Safari, the walk on the berlin side starts here!!\"", "Date": "April 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Brilliant, magical stay”", "Author": "MariaGraziaZ", "ReviewID": "UR59864566", "Content": "This is a wonderful, magical place. All the staff look after you, they are very kind and will make every effort to make you feel at home. You can have a coffee, a reviving herbal tea or a beautiful amazing cocktail; you can drink it in the lovely 50's themed lounge or in the cool courtyard or up in your room. The breakfast is delicious and you can pig out on the lovely cheeses and hams and pastries and the amazing home-made German breads. I only stayed for 4 days and wish I could have stayed a lot longer; the atmosphere on Friday and Saturday night was fantastic, with many people enjoying the lounge, the majority were probably not residents. The rooms are different from the rest, interesting, with personality and wit. Definitely not your average corporate hotel, I highly recommend the MIchelbergers' as they made me have a wonderful break... will come back soon!", "Date": "March 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Providence", "Title": "“Berlin at it's best”", "Author": "bschellenberg", "ReviewID": "UR59681436", "Content": "Great hotel, great staff, great rooms. The hotel is ideally located near several public transportation options. It takes about 30 min from Tegel to the hotel. The lobby and rooms are funky, but very comfortable. We booked a loft room and slept like little kittens between the comfortable sheets and on a very great mattress. There is a small coffeeshop down the block and a large supermarket just over the bridge. There are also multiple kabob shops to choose from. We loved the various bars and clubs in the area.", "Date": "March 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“East Chic”", "Author": "frozensausage", "ReviewID": "UR59581779", "Content": "I spent my 31st birthday in the Michelberger, and the experience was fantastic. This has to be one of the best hotels in which I've ever stayed, yet didn't have a hefty price tag attached. The Michelberger is perfectly positioned across the road from the Berlin U and S Bahn, which makes it a great base to explore the city, although Friedrichshain itself is a really cool area whicgh I wouldn't have discovered had the hotel not been there. The hotel itself feels more like a trendy bar, yet the service and staff are friendly and efficient. The rooms themselves are scrupulously clean, and the room we had had a great view out onto Warschauer Strasse and the U Bahn. This has to be THE place to stay in Berlin", "Date": "March 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“A break from exhaustion: clean and quiet, coffee and funk”", "Author": "greencateyes1", "ReviewID": "UR59115549", "Content": "I arrived in Berlin after 10 hours of incredibly hectic transit and this hotel managed to deliver exactly what I needed: a clean and quiet room (two hours before their official check in time), an incredible breakfast, good coffee and some great music playing in their cafe/lounge area. The service was also incredible: the staff are friendly, young and incredibly competent. And even better, they are willing to help with any problem that you encounter (including lost luggage). I would highly recommend the Michelberger Hotel to any traveler. I should note though that the only downside of my stay was that the hotel is rather far away from the airport and, not knowing this, I ended up taking a 40 Euro ride upon arrival. I would recommend trying to take public transit if you can.", "Date": "March 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Sydney", "Title": "“Comfortable but a little pretentious”", "Author": "pathologic_KT", "ReviewID": "UR59104049", "Content": "This hotel has a hipster vibe to it. Everything, from the room access cards to the bar menus to the don't disturb signs has something quirky about it. It's a bit pretentious, but not offensively so. The staff are friendly and the rooms are clean and comfortable. My room was very small, which was not unexpected. It would've been great to have a chair in the room though. I found it quite difficult to sleep (disclaimer: I'm a light sleeper). My room faced onto the central courtyard, and every night smokers would gather in the courtyard and talk loudly. This happened all through the night, despite the rain and snow. It was frustrating. If you're a light sleeper, perhaps request a room on the other side of the corridor. The location is a bit out of the way, but it's well served by the U-bahn and S-bahn stops just down the road. If you're coming from the airport via public transport, I'd suggest the U-bahn, which is closer to the hotel and has fewer stairs to negotiate than the S-bahn.", "Date": "March 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“Want to stay somewhere different, in a great location, at a great price...this is it!”", "Author": "Aimsed", "ReviewID": "UR58738783", "Content": "We stayed at the Miichelberger for three nights and loved the whole experience of the place. There is a really cool vibe and the staff are super friendly and helpful. It is all very relaxed and personal. As I am pregnant we loved the fact that we could chill out in the bar area downstairs and not feel like we were in the way/out of place. Not to mention that drinks and food didn't cost over the odds. The neighbour was great, had a fab Indian in Amar not 5 minutes walk away in Kreuzberg. Transport network was brilliant...weather wasn't great so we really used the S-Bahn and U-Bahn alot. The room was very funky, maybe lacked a little in some of traditional hotel features you grow accustomed to (phone, safe, minibar) but we didn't really miss any of this stuff. If you like to stay somewhere with a bit of soul as opposed to the usual hotel lobby stiffness then this is the place for you. Good work Michelberger Team", "Date": "March 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "All over the place", "Title": "“Awesome!”", "Author": "parks82", "ReviewID": "UR58702421", "Content": "I can only echo what others have said before me, this place is great! The staff are incredibly friendly and helpful, and not to mention willing to stay up and talk crap with a bunch of drunkards! The rooms are designed in a really clever and neat way, we had 3 of the \"band\" rooms which have a large sleeping area up above the rest of the room and there was plenty of space for 4 of us. It's also fantastic value for money, boutique hotel style for hostel money and I will go back for sure. On a finishing point - the 4 Euro goulash is unbeatable!!!", "Date": "March 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berlin", "Title": "“Very Berliney”", "Author": "Elvine", "ReviewID": "UR58308755", "Content": "This is Berlin in a nutshell: good value for your money, creative and tasteful. Rooms have mirrors hanging from ropes and the showers have a window to the room, so you can see and be seen (by your travel companion only...) It’s located by Warschauer Station, a very apt location for this industrial chic place. Oh, and the breakfast is mind-blowing!", "Date": "March 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Very cool, relaxed and inspiring place. I can't wait to go back.”", "Author": "joebraidwood", "ReviewID": "UR58249016", "Content": "I visited Michelberger after hearing great reviews from friends who had been there. This is usually a good sign - and it was. The hotel is an incredibly cool, relaxed and inspiring place. The interior design is outstanding, the location is fantastic and the staff are some of the most friendly and professional people I've ever had the please of being served by. I was there for just three nights and shared a loft room with two friends. We all slept very well and the room was great. The food at lunchtimes (when we got up after a night's partying) was exceptional in the hotel's outstanding and relaxed restaurant. But it was in the lobby/bar area where we really had the most fun, staying up until the small hours being served ice cold beers and chatting with the staff. I can't wait to go back.", "Date": "March 10, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York, NY", "Title": "“An unconventional hotel near the convention center...that bespeaks Berlin ubercool”", "Author": "JuddS", "ReviewID": "UR57007491", "Content": "The Michelberger is a truly unique, very special experience - but it is not for everyone. The hotel's theme is \"under construction\" - and they play this out with spackle on the walls above a certain height. One does gets the feeling they might have just been too cheap to finish painting, but they manage to pull it off. The lobby and cafe are really confortable, and have the vibe of a chill cafe. Hipsters hung out all hours of the day and night, and the decor is created by rotating displays of bold art and piles and piles of random books. We stayed in three different rooms over three nights - we had booked a room for 3 people, but when we arrived they didn't have that room available. To their credit, they gave us two doubles for the price of one - but this still was not adequate as we wanted 3 individual beds, and 2 of us guys had to bunk together. The double-bed rooms are really small and only adequate for a close couple or single. The last two nights were better, as we had the \"loft\" room we originally reserved, which are a fantastic deal in this city. The hotel itself is clearly an old factory, and the rooms do have a very loft feel - I wish they did better with the appointments and toiletries, as these are a little on the cheap side. The hotel is really great for young people who don't need lots of service or luxuries - when we asked for bedding for the sofa/bed in the room, it was dumped off by the night watchman. We had to make the bed ourselves. I'm not looking for Ritz-Carlton service, but having to make my own bed in a hotel was a bit annoying. I grew to really like the location, but first impressions were that it was strange. It is located out on what feels like an overpass by a major convention center. The U-bahn line terminates across the street, but it is not the most useful line if you are trying to get to the center of Berlin. The S-bahn station is a bit of a walk through inhospitable industrial surroundings, but nothing unsafe or really far. It doesn't really feel urban - surrounded by rail yards and vacant lots, but somehow works with the place. The location is, however, very close to the hippest nabe in Berlin - Freidrichstein. Great restaurants, shops and cafes are really a 10-15 minute walk away. The location is kinda perfect for what must be the interests of their clientele. If you don't go expecting top service or a \"normal\" hotel, the Michelberger is truly a hipster find - this is not your typical boutique hotel or design hotel experience, but one that has rougher, edgier vibe that bespeaks uber cool Berlin.", "Date": "February 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Boston", "Title": "“This is the perfect hotel for tourists in Berlin; I will stay here on all future trips.”", "Author": "BosTrav", "ReviewID": "UR53885450", "Content": "This hotel has everything you need for a great trip to Berlin, and represents a tremendous value. The location is ideal for exploring the hip neighborhood of Friedrichshain (and the East Side Gallery) on foot. To get to other parts of the city, the U-bhan and S-bahn are directly across the street -- this will end up saving you loads of money on cab fare. Even in the dead of winter, we used cabs only to/from the airport. For all other trips, the U-bahn, S-bahn and buses are the way to go. The public areas of the hotel are decorated well, especially the breakfast room. Speaking of which, the buffet breakfast could not have been more perfect -- and for only 9 Euros, it is a steal (especially if you eat as much as I do.) The rooms are very basic, but very comfortable. You have everything you need as a tourist in these rooms. The beds could not be more comfortable, and if you stay in a loft room as we did, you will not want to get out of bed because of the \"cocoon\" effect you experience on top of the loft. Also, our room was on the second floor and looked out onto the street facing the U-bahn but there was zero noise from the outside. Note: if you are a business traveler, this hotel might not be ideal for you. There are no fax machines (or telephones) in the room and there is no business center or fitness center. These are things I usually look for when traveling on business. Also, I do not think the location is ideal for business travelers who probably want to be closer to other areas of the city. I also do not think there are conference rooms available at the hotel for business meetings. The price cannot be beat. When staying in Berlin, I normally pay more than double what I paid to stay here. Yet I found myself wanting for nothing, and, in fact, enjoying my experience much more. Lastly, I want to comment on the service. On the morning of our checkout, we waited outside the breakfast room just before 7 a.m. when it opens. Because an employee was ill, there was only one staff member responsible for preparing the breakfast and setting it up on the buffet. She saw us waiting and opened the breakfast room a little early for us. She could not have been more friendly and apologetic for the fact that she needed a little extra time to get things completely ready due to being short-staffed. She put out items as they were ready and told us repeatedly (in perfect English) that if we needed anything we should ask her for it. Her apologies were totally unecessary as we understood that we were very early (we had to get to the airport to catch our flight) and despite being short-staffed she had the place under control. But her friendliness and concern were truly exceptional and is part of the reason why I would want to stay here again.", "Date": "January 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Paris, France", "Title": "“This is where you want to stay in Berlin!”", "Author": "BenZeto", "ReviewID": "UR52560550", "Content": "How happy I am that I chose this hotel while hesitating with a cheaper solution !!! This is simply the hotel where you have to stay in Berlin. I spent 5 nights at MichelBerger around Xmas with a friend. The hotel was created by a group of friends and opened last July and is therefore spotless. The large chill out area is perfect to have a beer and exchange with other fellow travellers. Without talking about the super stylish deco and great music! It is very much a backpacker atmosphere with the comfort of a strong 3* hotel for a ridiculous price (€65 p.n. excl. breakfast). Took the breakfast twice (€9 p.p.) and didnt regret it (fresh fruits, cheese, croissants, eggs, etc.) The hotel is ideally located at Warschauer Strasse with the U-Bahn, S-Bahn and Tram all nearby. Points of interests like the East Side Gallery is only a 5min walk. Simon Dach Strasse with its tons of bars only 10min walk, and you basically reach any part of the city in less than 20min. Most important is the fantastic/fab staff ! Berlin was almost dead on Xmas eve and we were unable to find a restaurant open. They offered us to sit at their table with friends and family... never spent such a nice Xmas while abroad! So so welcoming! If you're looking for smtg outside of the box and/or 100% Berliner, that's the place where you want to stay! You definitely see me there next time I'll go to Berlin :)", "Date": "January 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Very cool. Fantastic staff and atmosphere And LOVED their music!!”", "Author": "LinnyPie", "ReviewID": "UR52041469", "Content": "We had an amazing stay here,. it's quite Hoxton/New Yorky. Simple clean kooky rooms,. great music compilations in the bar, brilliant value for money, fab breakfast,. very beautiful and ridiculously helpful staff,. gorgeous dog! and very comfy chill out area. Also, it was situated in a great area, I would definitely go again, and would indeed highly recommend it. Its a perfect place to stay for a city break. They've got it SO right! Get a room at the back if you can,. the only downside to this place is it can be noisy at the front as its situated on a main road. I switched room to the court yard area which was very quiet. Also, there's no baths ,. only showers (apart from in the delux suite)", "Date": "December 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Perfect for us”", "Author": "VixPhilotes", "ReviewID": "UR51383872", "Content": "The hotel was simply perfect. I had my reservations as when we booked there wasnt much to go on given how new it was. But as soon as we arrived it just felt comfortable and welcoming. From \"the shining\" inspired hallways to the quirky decorations, the spacious rooms and the friendly staff we couldnt fault the place. The bed was set above the rest of the room meaning we had so much space, plenty of quiet half hours lounging on the daybed. The location is really good, near the trendy locations in the East and lots of transport links. We had no problem getting all round town and back again. Only made breakfast once, but there was plenty to it and the large breakfast room had lots of charm. The lounge / bar was great. It felt so homely that you cant help but kick of your shoes and curl up on the couch whilst sipping your cocktail....until you suddnely realise its 3am and you should really go back to bed. We'll definitely be going back and I'm already recommending this hotel to everyone!", "Date": "December 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Nottingham", "Title": "“If you go to Berlin, stay at the Michelberger...”", "Author": "Sheldinio", "ReviewID": "UR51283409", "Content": "...it's that simple, I've just got back to England from my three night stay in Berlin and the hotel proved a significant feature of my completely positive experience. My girlfriend had booked so I was aware that it was going to be a 'hip' budget hotel but could not have envisaged the ambience, the relaxed aesthetic that infuses everything about the place without ever comprimising on quality or value for money. The ground floor is welcoming, warm and stylish. There is a large lounge bar area that guests and non-guests lazily mingle throughout the day and night. The bar is well stocked - it has good quality and tasty food - and was tended by a quirky range of staff ranging from pretty young things to men in their fifties in strangely apt bow ties. I really liked it that the one quality that united the staff was friendliness and not age, looks or background. The room was an impressive design feat with a mezzanine floor holding the bed that faced a huge window overlooking the grafitti-strewn train line. It might not sound a huge aesthetic hit but then it depends what you like; I liked the quality of the room, the view showed me an undeniable aspect of the city I was in and it felt honest but stylish. The breakfast is fantastic value and was a real pleasure. For 9 euros they serve fresh breads, fruit, meats, cheeses, wonderful scrambled eggs, tasty coffee and the nicest jams I've had in a while. It makes a mockery of the breakfasts too often found in large corporate chain hotels. Finally, I guess I would say the staff were a significant aspect of our experience. They were friendly, clearly loving their jobs and part of something more than simply a business. The place has an ethos of relaxed but unwavering style, and it is delivered at a bargain basement price. If more hotels go this way then all the better for us.", "Date": "December 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Genoa, Italy", "Title": "“Great concept and value”", "Author": "Annike", "ReviewID": "UR50121617", "Content": "I had a three-day stay in Michelberger and was not disappointed at all. I agree with the traveller who mentioned that the hotel has a youth hostel vibe with a hotel comfort. Friendly staff who care to remember your first name and make sure that everything is alright (they extended my check-out time with no problem), a fantastic public area filled with books and sofas and cushions that invite you to spend some time there. I reserved the 33m room, which was perfectly arranged even for its small size, with large windows and a see-through wall dividing the bed area from the shower. Please note that the rooms have no toiletries nor phone. The great care for details is also shown in the rooms, I loved the design. For 59€ I found it of great value, and so is breakfast at 8€, which you cannot miss both for the quality and the magnificent room. Location is also very good - withing walking distance of the O2, the East Side Gallery and the cafes, bars, restaurants and shops of Friedrichshain. A tram stop is literally in front of the hotel, subway and s-bahn can be reached with a 2/5 minute walk.. and from there you can easily get to any place in and out Berlin.", "Date": "November 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Great value, atmosphere and location. Small but beautful”", "Author": "IronDuke555", "ReviewID": "UR50110452", "Content": "What a great place! Super cool without being try hard or pretentious, ok the rooms aren't massive, but that's missing the point when it's such great value. The bar is perfect for a drink before you go out and the breakfast is super tasty, and robust enough to revive you enough the next day for a good days sightseeing. Great to go with your partner, or with a group of mates. Good location, it's just on the edge of an \"up and coming\" suburb with loads of good bars and restaurants. There is also the watergate club within a 5 min walk and the Panorama bar is only one u-bahn stop (or a long walk) away. Nothing more to say, go now!!!", "Date": "November 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Interesting place to stay”", "Author": "LondonDrg", "ReviewID": "UR49752283", "Content": "We read about this hotel in the Guardian, and it exceeded the positive expectations we got from reading the article. It is a trendy but relaxed place, with very friendly staff and a pleasant atmosphere. The rooms were small but comfortable and it was great value for money.", "Date": "November 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“Great value, Nice People.”", "Author": "Traveltubby", "ReviewID": "UR49618963", "Content": "I'd have no hesitation in recommending the Michelberger, unless you're a fan of the corporate / bland hotel in which case you may have some issues! The hotel itself is quirky in design and layout, but it's clean, comfortable and in a great location opposite the S & U-Bahn stations. The room I had as a single traveller was small but well laid out and perfect for my needs as I was there to see the city. The bar /communal areas were good places to relax, and the hotel has the vibe of a youth hostel but the quality of a hotel . The best attribute however is the staff - they seem to hit the right balance (for me) between informality (welcoming, considerate and friendly) and yet remaining professional (serious about what they do, and their guests satisfaction.) Great Hotel - will definitely return.", "Date": "November 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Suffolk", "Title": "“Fab hotel, breakfast to die for and great location”", "Author": "LisaTSuffolk", "ReviewID": "UR49563520", "Content": "Booked the Michelberger as it was near the O2 World not realising that when we got off the train wondering which way to go that out of the dark there is was glowing and only a 2 minute walk. The staff were really friendly and spoke brillant English. We hadn't booked for breakfast but I would definately recommed having it €8 for an all you can eat with great coffee. The rooms were great nice and clean and the showers were fantastic. Overall I would go back to the Michelberger and would highly recommed it.", "Date": "November 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sweden", "Title": "“100 % satisfied”", "Author": "Sluggo73", "ReviewID": "UR49545615", "Content": "Without a doubt one of the best hotel experiences I've had in a long time. Very cool and clean rooms, great location and a super-friendly and helpful staff. The price for the room was more than fair and I'm more than happy to highly recommend the Michelberger Hotel.", "Date": "November 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Nottingham", "Title": "“Goulash, lampshades and rope cords!”", "Author": "RobinHood024", "ReviewID": "UR49206728", "Content": "Not a chain - thankfully - and if you're looking for Saga \"comforts\" then go somewhere else, but for two 50-somethings this was a great stay. Even though there was only two of us, we had a room that sleeps 5 with mezzanine so that my wife could throw socks at me from above! Excellent value- the room not the socks! Room fittings are a design feature - smartly whipped ends of braided cord support accessories and the lampshades in the bar/lounge are 'textbook' -really! music choice also very engaging. We were there before they started doing evening meals but the goulash soup with turkish bread was excellent value and the breakfasts, particularly the fresh breads, will keep you going all day. Very close to East Side Gallery and Oberbaumbrucke and as others have said transport access U & S-bahn is literally across the road. S3 from Hauptbahnhoff takes you door-to-door through the centre. Tip: Surprisingly, for a major western economy, the cash machines are few and far between, if and when they work, and we found ourselves in a restaurant that took cash only!", "Date": "November 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Shanghai, China", "Title": "“A good start, room to improve”", "Author": "crox40", "ReviewID": "UR48914880", "Content": "We decided to stay at the Michelberger based on a write up in the Guardian and overall we were happy with our decision. The hotel is cool and funky and definitely fits the neighborhood it is located in. They openly admit that they are in quite an ugly area of the city right on the sign out front but they make the best of it. The rooms were always clean and made up quite promptly - there were a few hangers for clothes and a small space to put your bags. The breakfast is pretty good and served until noon - a rarity with hotels so they are definitely aware their clientel spend their nights out late. On the down side, this late night habit of guests proved a bit of an issue. We give service 3/5 primarily because even though they were quite helpful when we spoke to them, there was only one person working the front desk even at busy times and it would be quite a wait to speak to them. And a bigger deal - at around 4am one night someone came back - obviously froma night out drinking and started pounding on a room door across the hall, yelling for someone to open up. This went on for quite a while and unfortunately there are no phones in rooms to call the front desk and our room was quite a distance from the front desk. The noise issue is the main reason for only 4 stars - the hotel backs onto a recycling destination and at 8am each morning but Sunday we had machines hard at work. Overall it was a great experience - lots of good bars and restaurants within a short walk and U & S Bahn connections plus a Tram right across the street. They were unable to locate our reservation which could have been a big problem on the big weekend but they seemed unworried and settled everything quite quickly. There is free wireless but you have to renew your password each day at the front desk. Definitely recommend this place - especially if you are planning a visit around an event at O2 World or want to visit places in Friedrichain. It is also a phenomenal value - €55 a night (bigger rooms for €65) though I did see someone who booked through another service for €50 so there is value to be had here.", "Date": "November 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Philadelphia, PA", "Title": "“A wonderfully chaotic weekend.”", "Author": "ahl88", "ReviewID": "UR48539330", "Content": "If their raucous opening weekend festivities are any indication of where this place is going, it's gonna be one chaotic and fun ride for our friends at the Michelberger. Common Areas: Great vibe -- the lobby seating area has plenty of obscure books and magazines to peruse, and the lampshades were constructed with old East German glossy magazines. And that's before you even reach the front desk. For some, the central focus of the common area is the small, pleasant cafe area, which serves the usual coffee drinks, sandwiches and the like. But more important for this weekend's festivities was the courtyard, which would be the scene of a tropical-themed 2-night kickoff party sponsored by Bacardi (or some other damn brain-pollutin' dark liquor that always bites at inopportune times). Generally speaking, my room was on the 1st floor, facing the courtyard where the band would be playing. More specifically, my window opened onto the stage. As in, I could lean out the window and nearly tap the bassist on the arm (I refrained from doing so). The lovely young lady at the front desk had explained that because of this weekend's festivities, \"it might be quite loud at times.\" Woman don't tell no lie -- it rocked like a Blue Oyster Cult concert, circa 1978. (I can't find the umlaut on this computer.) Anyway -- No sleep, and I didn't care. With so many nightlife options in the area, the one (loudly) outside my door turned out being the best. Gotta love it when a plan comes together. Rooms: Small, functional, and economical. Paid about 62 Euro per night. That first shambolic weekend, the accommodations were still a work-in-progress -- on my 2nd night, the shower broke, and leaked water all over the floor. No harm, though. Handled with a smile. Service: Five stars. I'll be honest -- being from a more, say, \"staid\" part of the world -- I was fearful that the place would be infested with Annoying Hipster Douchebags (AHDs). Several of the artistes at the bar, who were clicking away on their MacBook Pros, raised my Douche Awareness Level to 4. And there were more potential AHDs near the front desk. Did they... work here? I should've calmed down. The staff, while undoubtedly dressing the part of the dissolute mid-20s slacker, were outstanding. Case in point: I mentioned that I forgot my razor, and the guy standing next to me disappeared, almost without saying goodbye. Five minutes later, he returns with a razor he bought at the local drug store. I could see he was out of breath, too -- he must have jogged there! In all my years staying in hotels, I've never seen anything quite that ... well, touching. Class move. (To return the favor, I picked up some power adapters at the electronics store in the mall at Alexander Platz. The staff thanked me way too much for this little housewarming gift.) Location: I grew to like Frederickshain, but all in all, like Prezlauer Burg a little bit better. The Hotel itself is right across the street from a main station. That is a good thing. Overall: Crazy, chaotic, cheap, fun and friendly. Great concept, and while it's still a work-in-progress, they appear to have an enthusiastic team. I'll definitely be back. However, if I'm there for another Friday night party, I'm bringing earplugs this time.", "Date": "November 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Paris", "Title": "“If I could have made it, it would be like that”", "Author": "LadyPek", "ReviewID": "UR47905638", "Content": "Very well located in front of 2 U and S Bahn stations, almost along the Spree. Not completedly central but definitely a Berlin flavor. The hotel is very well designed, rooms are comfortable and very creative in the way they are furnished. The nicest parts are the breakfast room, the lounge and the bar where I would have stayed for hours. Last but not least, the team is great and they all give great advice to make the most of your trip to Berlin. I felt like I was staying with friends.", "Date": "October 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“One of the funkiest places I ever stayed at!”", "Author": "nik001Sweden", "ReviewID": "UR40360847", "Content": "First of all - check out their website at www.michelberger.com. The unusual layout of the website speaks for the hotel as a whole. This is really a funky hotel. Well worth the money, as it is not at all expensive (rates as low as €65 for a double room with a proper third extra bed, not a sofa). Even though the hotel has only been open about a month or so, the atmosphere is already a bit like staying at your best friends place and I am certain it will be more expensive to stay here in the future once the hotel has been open a few months. Location is brilliant. About 100 meters from the U1 (Warschauer Strasse) and another 3-400 meters to the S-Bahn which takes you out to Schönefeld Airport in 15 minutes. Trams and buses stop outside for connection with other tube lines and other cool parts of old East Berlin. However, if I am to give the room a few bad pointers they are: 1. The room type that we were staying in was defineatly not suitable for a person of larger size or with a disability as there are very narrow stairs leading up to the double bed. The whole room is built according to \"compact living\" ideals. If I think about it, you should propably not be too drunk either, as falling backwards might leave you permanently lodged into the flat screen TV on the wall behind you. 2. There is an in-wall light installed by the lower right side of the toilet that gets seriously hot. Risk of getting burnt. 3. Not a single English speaking TV-channel which could cause some distress for someone who doesn't speak German. However, if you are so dull that you spend a weekend in Berlin watching telly, you are mad!! I will certainly stay at this hotel again in the near future!!", "Date": "September 9, 2009"}], "HotelInfo": {"Name": "Michelberger Hotel", "HotelURL": "/ShowUserReviews-g187323-d1483628-Reviews-Michelberger_Hotel-Berlin.html", "Price": "$88 - $210*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Warschauerstrasse</span> | <span class=\"extended-address\">39/40</span>, <span class=\"locality\"><span property=\"v:postal-code\">10243</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "1483628", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/75/36/33/michelberger-hotel.jpg"}}