{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Detroit, Michigan", "Title": "“dirty and scary”", "Author": "sienna t", "ReviewID": "UR126018901", "Content": "Our room was completely disgusting. The bed skirt was ripped and hanging off the bed, one side had a huge white stain down the side of it as if some one had thrown up. The sheets had stains on them. Their was a red stain on the dresser by the tv, maybe wine or blood. Scary area to walk around. Left after one night, the girl at the front desk did nothing after I told her the next morning. Could not believe they charged 75 dollars for this nightmare, Paid 40 dollars at a red roof inn that was clean and half the price!", "Date": "March 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chester, United Kingdom", "Title": "“Clean, habitable, OK”", "Author": "Sir_Edmund", "ReviewID": "UR125866010", "Content": "The Vista Inn gets a great apparent rating on Tripadvisor - and so I booked. The location is indeed great for walking into Beale Street, restaurants, baseball and FedEx stadium. There were no problems with the cleanliness of the room or bedding. Everything in the bathroom worked. The larget CRT tv worked. The carpet was not old old and worn, the walls had been painted and were not scruffy or old. Fridge and microwave too. For a basic motel type room, this is very good value for money. No problems at all during the 2 night stay. If you want luxuries like a coffee maker, hangers, lounge, cocktail bar, restaurant, free breakfast, then do not go to the Vista Inn. If you want somewhere clean, habitable, inexpensive in a great location, then do book!", "Date": "March 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Wisconsin", "Title": "“Scary noisy place.”", "Author": "Lasarre", "ReviewID": "UR125527950", "Content": "Very loud. The wash cloth in the bathroom is noisy. Very dark walking to Beale street. Lock broken on door to room. Would not stay here again.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Perth", "Title": "“Walking in Memphis”", "Author": "EmalyPerth", "ReviewID": "UR124186059", "Content": "My husband and I stayed at the Vista Inn Motel for 3 nights in early January. The location is terrific only a couple of minutes walk to Beale St. We were visiting during the quiet season, so the streets were empty at night, however it's safe to get around Downtown on foot. Bed was comfy and the area was quiet. Only cons were had to ask for a restock of fresh towels andtoilet paper, some of the towels were old and had with the previous user's hair intertwined in the fabric, and there is a fee of $5 per person to have bags stored at reception at check out. Otherwise; everything else was fine. The hotel is pretty basic, but that's what you get for a 2 star accomodation. It was clean, safe and in a good part of town and that's all we wanted.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "nb canada", "Title": "“Great Location and Price”", "Author": "NBlobsterman", "ReviewID": "UR122515478", "Content": "Stayed here for 2 nights. Great location, free parking and internet. Never had a problem with internet access. This is not a 5 star hotel, if this is what you are looking for look elsewhere. If you are booking in the near future you may want to ask if the new roof is finished, we had a bad smell of tar in the morning when they were warming up the tar for the roofing. Besides that the hotel was good for the price. Easy walk to the FedEx for a basketball game.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Fab service in the middle of Memphis”", "Author": "Cornelia D", "ReviewID": "UR122011061", "Content": "The motel is perfectly located in the middle of Memphis! Although the city itself is not really practical built, almost everything is walkable from this place. The service was magnificent, the girl at the reception arranged a Graceland tour for us for much less money than most offered tours. The breakfast is at the reception. It's quite simple (cereals and muffins), but it's filling and fresh. The rooms are big, the bathroom is nice and there is enough space to park your car. However, the beds are not pretty big or very comfy and I got a little stiff after the first night. Though I would definitely come back for another Memphis visit!", "Date": "December 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Salisbury, Wiltshire", "Title": "“You get what you pay for.”", "Author": "beznee", "ReviewID": "UR121508487", "Content": "If you are expecting luxury or an immaculate room then look elsewhere. Then again, if you're paying $80 a night in peak season and get this central a location then you should be pretty happy with whatever you get. The staff were friendly enough and the rooms were basic but fine. The motel is in a fairly safe area; most of Memphis is like watching an episode of The Wire, so all things considered where this hostel is is not too bad (though I wouldn't recommend turning right from the motel, probably the worst area I saw in my 3 months travelling the US). Beale street is only a 3 minute walk the other way and is the nicest and most touristy destination. Free breakfast consists of a few muffins put out in the reception area...... Good for a short stay in Memphis where you don't intend on spending much time your room.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Birmingham", "Title": "“Too Many Little Things Wrong”", "Author": "Roger R", "ReviewID": "UR121423018", "Content": "We stayed here for the St. Jude Memphis Marathon, and did not expect anything but a clean room, Internet access, and convenient walk to start and finish of marathon. The room did not have a clock, the Internet never worked (we were in the second building, and not sure if this had anything to do with it) and was the most disappointing part of our stay, the bathroom had broken fixtures, the bed frames were on their last legs (literally), and the TV was basic with poor quality on some channels. I knew we were getting a fair value that was offset by the great location to Beale St., the FedEx Forum, and the marathon, but there were too many little things wrong for me to recommend, especially if you need Internet connection during your stay.", "Date": "December 5, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Canberra", "Title": "“Location Location Location”", "Author": "Tom D", "ReviewID": "UR119084909", "Content": "We stayed here for 3 nights and found it generally acceptable? We did have some issues with dirty bed linen on arrival (a boot print on the pillowcase was kind of a clue) but it got sorted out. As other reviewers have noted, the location is great for walking to many Memphis attractions. Not sure why some reviewers feel the area is unsafe. I don't regard having to walk past a Greyhound station as particularly threatening. The room and bathroom were clean. The free wi-fi was good when it worked , but it did tend to disappear altogether at random times. There is a Denny's a couple of blocks away as a breakfast option, and a TGIF opposite the ballpark if you want to avoid the Beale Street tourist traps.", "Date": "October 8, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Lexington, NC", "Title": "“Scariest place I've ever stayed!!!!!”", "Author": "HappyH0neym00ner123", "ReviewID": "UR118289789", "Content": "My husband and I were on our honeymoon and wanted to see Graceland and Beale St so we decided to stay the night in downtown. We had not researched the Memphis area beforehand. The Vista Inn seemed nice enough with reasonable rates - the room was remodeled and clean. The room we got had NO bible in it so we held hands and prayed over the room. At about 2 am the door to our room was opened by a white young man - the only thing that kept him from coming in was the upper latch - we had closed the door (which locks automatically), locked the deadbolt & flipped the upper latch so whoever was trying to get into our room HAD A KEY!!!! By the time we got up to look out the peep hole he was gone. We hardly slept and left as soon in the morning as we could throw our clothes on & GET OUT!!! We did complain to the front desk lady and received only an apology and nothing else. Needless to say, I would not recommend anyone staying there - EVER!!!! Our suggestion is that if you go to Memphis - GET IN AND GET OUT!!!!", "Date": "September 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Overland Park, KS", "Title": "“Perfectly acceptable, good value, close to Memphis sights”", "Author": "KC-Gordon", "ReviewID": "UR117544937", "Content": "I recently stayed one night on a motorcycle trip. It was a good value, an older motel close to downtown attractions but clean and I felt safe enough walking in the area. i walked to Sun Records for the tour and also downtown to restaurants and to Beale Street in the evening. All in easy walking distance. I also rode my bike to Graceland for a morning tour and they were accommodating to allow me to leave my bags in the room after check-out until my return. I would definitely stay there again if I was just looking for a place to sleep while doing the tourist thing, not a destination hotel. Had a fridge and microwave although I didn't need them.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Haarlem, The Netherlands", "Title": "“Really good located motel with a good price”", "Author": "NinMa188593", "ReviewID": "UR117257383", "Content": "We liked this place alot. Good price, 70 dollar including tax. Nice swimingpool, and just around 10 min walk to Beal Street. Couldn't ask for more. Free parking, free internet, micro, and fridge.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "MISSOURI", "Title": "“We will be back, great little gem”", "Author": "CMOTO", "ReviewID": "UR115066977", "Content": "i found this place becase the Comfort Inn was full so i booked this one...FREE parking, FREE internet, FREE breakfast........the parking was safe and our car was fine the whole time, the internet was fast...i was watching youtube videos one nite and no problem, and the breakfast was kinda weak....it was just a pastry and some juice or coffee but it was something!! the pool is AMAZING, i cant not believe more people dont stay here it was about a five min walk to Beale st and we even walked back around midnight one nite and never had a problem. its not fancy, but we had a king bed and slept great every nite, the bathroom is small but its big enough for you to get a shower and get ready. there is a dresser with 2 drawers and a little closet area with a few hangers, but we packed like we was gonna be gone for a month so we didnt have enough room but if we would have packed like normal people it would have been fine. it was SUPER HOT when we was there and the A/C worked just fine for us if your looking for a place you can walk to most stuff and get free stuff and a great pool without all the fancy stuff then this is the place for you.....plus the staff was great to us, we got there at 10am and check in isnt till 3pm and they got a room ready for us so we was in a room by 10:15am...did it with a smile too!!!", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Kansas City", "Title": "“Just fine place to stay”", "Author": "MaraSuung", "ReviewID": "UR113174358", "Content": "PROs: Location near Beale Street, easy walk to attractions and dining. Clean pool, great air conditioning, fridge and micro. Free parking, friendly staff. Great price. Con: asked two nights for extra towels, none delivered.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Baton Rouge, LA", "Title": "“Great Value and Friendly, Accommodating Staff”", "Author": "JenandBenarecool", "ReviewID": "UR110275582", "Content": "We were a little hesitant because of some of the reviews, and because we don't know the area well and were afraid it was too far out on the fringes of the downtown/Beale street area. But, at $60 per night, it easily beat out any other downtown hotel, so we took a chance on it - and I'm so glad we did. Yeah, it's not the Ritz, but it's very clean and the service can't be beat, and it's within walking distance of everything.Â  OK, some brief cons: -No coffeemaker in the room. However, there is free coffee in the front lobby.Â  -Hot water took a little while to get started - shower was fine, but the sink tap didn't seem to heat up.Â  -As someone else mentioned, wireless was spotty, kind of went in and out. Still free, though. Pros: -Very close to downtown, just a short walk. We were looking for dinner at 8:30 on a Wednesday, and the woman at the front desk assured us that we'd be safe walking toward downtown - she said she did it every night alone, and that there are cops everywhere downtown anyway. Sure, we got harassed for money, but that happened everywhere that tourists were, and not especially near the hotel. -The front desk people are super friendly and accommodating. In the morning, we were preparing to check out at 11 when we realized that the ducks would be marching at the Peabody hotel just two blocks away. The woman at the front desk was kind enough to allow us to continue storing our stuff in the room for an extra hour, just so that we could go see them. (Alternatively, they let you store stuff in the office for five dollars.) I'm really glad we took a chance. We will definitely stay there again the next time we're in Memphis...and hey, if ambience is what you're looking for in a hotel, just walk down to the Peabody, get a drink and watch those ducks go.Â", "Date": "May 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Good value and clean”", "Author": "iblisamb32", "ReviewID": "UR98153662", "Content": "This was a good value for the locaton. The room was clean and decent for the price. We could walk to Beale St and not worry about where the car was parked. The staff was friendly and offered assistance without us asking for any. We will stay here again.", "Date": "February 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Georgia", "Title": "“Great location, good value, but some downsides.”", "Author": "JTDawg", "ReviewID": "UR91346354", "Content": "Stayed at this hotel for three nights after Christmas. Location was great. Within walking distance to Beale Street and everything in downtown Memphis. Parking was free. Continental breakfast, but it was pretty lame. A few pre-packaged pastries and milk and cereal. No juice and really no room to sit and eat. Rooms were adequate. Clean enough, although not spotless. (a little dusty) They are stingy with the towels. Had to ask for more several times, but they gladly provided more. If you are driving and can do it, I would recommend you bring your own towels as the ones from the hotel are very threadbare and small. Beds were OK, but a little on the hard side. We were a couple staying together, so did not feel unsafe in the hotel, but I would not recommend to a woman staying alone as it is on the edge of the downtown area and you have to walk by panhandlers on the way to downtown. Did not feel unsafe, just a little uncomfortable. For the value, and location, it was OK. I would stay there again as it is at least $100 cheaper than the other hotels in the immediate area. If you need to print a boarding pass, etc. the computer in the lobby costs you $5 for 30 minutes.", "Date": "January 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“The best deal in Memphis”", "Author": "travlalot35805", "ReviewID": "UR90709654", "Content": "I have stayed at the Vista several times. I was a little hesitant the first time because of the location, price etc. but was very pleasantly surprised and a little mad at myself because I had never tried it before. The location is excellent within easy walking to Beale st. and all downtown venues. Room with fridge and micrwave was clean and comfortable, staff was great. One day I even spoke to the owner outside whom was very friendly and personable. I would recommend to anyone.", "Date": "December 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Greeneville Tn.", "Title": "“What a location! Nice Room.”", "Author": "dougeGreenevilleTn_", "ReviewID": "UR81566982", "Content": "Nice clean room. No windows in our room but everything was within easy walking distance. Sure there were a few bums around there but they were all good natured and friendly. Beale Street is only a block or so away. The next time I go to Memphis I will definately go there again.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Lancaster, Pennsylvania", "Title": "“This place is not located in a nice area.”", "Author": "GeoGiantPa", "ReviewID": "UR81338515", "Content": "I planned to stay in Memphis for 2 nights. I pulled into the parking lot and there appeared to be an abandoned building next to the inn. I checked in and figured I'd walk around a little, I was surrounded by beggars as soon as I stepped onto the street. About a block from the inn is a bus terminal with all sorts of folks lurking about. I decided that I wasn't going to feel safe walking in this area at night so I turned around, went back to the inn office and checked out. I figured I would have to pay for my first night since I didn't provide 24-hours notice but I'd get the second night back - wrong. The desk cleric, while very nice, told me flat out lies for why she couldn't refund the second night. I didn't argue, I just walked out, Let me add, the cleric didn't seem too surprised that I was checking out. The after-dark safe areas in Memphis are a few blocks. This inn may be close to the safe area but it is clearly not in that safe area!", "Date": "September 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“Exceeded expectations in a mostly disappointing city”", "Author": "Michael255057", "ReviewID": "UR75172739", "Content": "This motel is a block away from Greyhound terminal. A local there warned us about staying at this place called Kings Court. I walked around town and found and booked this place because it was the cheapest and they let us check in early. Only later did I find out this was the old KINGS COURT!!! I took our key and made my way towards our building expecting the worst. But the hotel is fully renovated. Everything worked including the TV. The staff were good not exceptional but hey this is not a 5 star place. The room was clean, bed linen and towels were all clean. For the price you cant go wrong in Memphis.", "Date": "August 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“perfect location!”", "Author": "nolaredhead", "ReviewID": "UR72616362", "Content": "my daughter and I originally booked for two nights but decided to stay a third. absolute perfect location for walking and short drive to lots of other sights..and right across the street from the ball park! room was a bit small but served it's purpose for us...beds were comfortable and hotel was quiet...and the sweet little pool was so refreshing at the end of each day! everyone was polite and helpful.....it appeared that the hotel was owned by a family who had lots of vistors and had a wonderful gathering and feast each evening under a tent in the parking lot...we were so jealous that we weren't part of the family. we'll be back!", "Date": "July 27, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Ants in the Bed & Dirty Towels”", "Author": "Scottoire", "ReviewID": "UR71003261", "Content": "Scheduled to stay here for 2 nights, however checked out after the first. We discovered ants in the bed, so requested a room change. Admittedly they did this without hesitation, however new room had dirty towels. The area around the hotel isn't so pleasant, and gives off bad vibes. Having said this is very close to downtown, easily walkable. I wouldn't stay here again.", "Date": "July 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Fort Worth, Texas", "Title": "“Nice value for long family weekend, downtown Memphis”", "Author": "fwtexastraveller", "ReviewID": "UR69080443", "Content": "I stayed here for an impromptu overnight last week, with my wife and 9-year-old daughter. We were passing through Memphis and decided to stop for dinner downtown and stay the night. We found this place on Expedia for $97. For that, we got two double beds, nonsmoking, and clean. The room was warm -- and the AC off -- when we checked in, but it cooled off quickly. It's a motor lodge with free parking and pool on the back side of AutoZone Park and a few blocks to the heart of downtiown. Those few blocks are a little rough, but we felt reasonably safe. I'd recommend this place for a long family weekend getaway where you want to be within easy walking distance to Beale Street and everything else downtown. (I even went out for an early morning walk and walked down to the Civil Rights Museum south of downtown. Again, some of those blocks south of downtown are rough, but I felt safe.) The motel has a very limited free continental breakfast, but, believe it or not, the Greyhound Bus station next door has a very good and cheap breakfast buffet that we tried and enjoyed. It has a full range of choices, from eggs and bacon, to fruit, yogurt, and bottled juices and milk. The motel is three blocks to the famous Peabody hotel, known for its 11 a.m. March of the Ducks from their rooftop aviary to the lobby fountain, where they swim for the day. This exercise will keep the kids interested and occupied for a good couple of hours, and it's air conditoned and free. The motel is also three or four quick blocks to Beale Street. We asked the Peabody concierge to recommend a rib joint, and he pointed us to the Blues City Cafe on Beale Street, which was fabulous.", "Date": "June 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Park City Utah", "Title": "“Great location!”", "Author": "PCmtnchick", "ReviewID": "UR61383779", "Content": "Don't stay here if your looking for luxury. The rooms were very basic and mostly clean. The location made it worth it and the staff are incredibly nice!!!! We had our dog with us so I think we may have gotten some of the older rooms that are not updated. However it met our needs of a place to crash for the night and they are dog friendly. The hotel is within walking distance of Beal street and I even felt safe walking back there at night. Memphis was so much fun and loved it better than Nashville. GREAT music!!", "Date": "April 15, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Ontario", "Title": "“Amazing service from the manager”", "Author": "lccOntario", "ReviewID": "UR59540412", "Content": "I was looking for someplace to stay just 1 night, downtown so i would not have to worry about driving or cabs, and on a limited budget. And my choices were very limited because of the BBQ championship. I was skeptical based on the price but the reviews gave me enough reassurance to give it a try. I could not believe the over-the-top service that I got from the Manager (Neil?). Wow. The motel itself is very basic, but the room was very clean and the location was good. I don't think you can find better value in downtown Memphis.", "Date": "March 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London", "Title": "“very basic rooms but great location”", "Author": "LondonKazza", "ReviewID": "UR56711397", "Content": "we expected this to be basic and it was, the rooms are no frills, but they are very clean. you get free parking outside your room and you only have to walk 3 blocks and you are in Beale Street. The bed was comfortable and the water was good and hot with a strong shower. It was a bit noisy because they also rent out parking spaces to the public in the car park for $7 a night, so people were coming and going all night, but it wasn't too bad. They also mistook us for another room and gave us a wake up call at 6am that we really didn't want, but everyone makes mistakes! We paid more than we would have liked for this room, but really the location made it worth it as we saved on cab fares in to town.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Melbourne", "Title": "“Great Value - Amazing customer Service”", "Author": "babetteo", "ReviewID": "UR52338269", "Content": "This is a family run business. The owners have a passionate, enthusiastic, friendly approach. Their excellent customer service is evident with no task too difficult to organise. Their knowledge and appreciation of Memphis was evident and they gave excellent suggestions of places to visit. The rooms are basic but the location is excellent, within walking distance to Beale Street. The swimming pool is a welcome relief after a busy day exploring Memphis. Delicious breakfasts were organised specifically for our Singing Tour group. We will certainly take future groups to this hotel, and we look forward to catching up with the owners again", "Date": "January 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Milwaukee WI", "Title": "“I'm impressed”", "Author": "bohmagic", "ReviewID": "UR41204979", "Content": "Stayed here for it's location. Just blocks away from Beale St. and literally across the street from the Redbirds stadium. I was very impressed with the newly renovated rooms and the super friendly staff. This is a clean bare bones motel at an extremely decent price in the heart of downtown. Nothing fancy but has just what you need I will definately be back any time I come to Memphis.", "Date": "September 13, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Hot Springs AR", "Title": "“Big problem-haven't even stayed yet”", "Author": "ChloeHotSpringsAR", "ReviewID": "UR40609933", "Content": "I made a reservation with Expedia back in January for this coming December. The motel ran my credit card which they weren't suppose to do. I have since changed my plans and called Expedia 3 times about canceling & getting my money back, they then told me to call the motel directly who then told me they didn't charge my credit card the travel agency did. Well, the motel DID charge my card and I had to get expedia to call them directly. Expedia in return gave me the name of a lady named Sue at the font desk. I spoke Sue directly and she said my credit card would be credited. It has been 15 days since I spoke to her and nothing has been credited back and now I can't get them to answer the phone. Very suspicious.", "Date": "September 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "San Antonio", "Title": "“Exceptional service an exception except here”", "Author": "writersblock_25", "ReviewID": "UR36243570", "Content": "To preface this, I generally do not write reviews for places where I stay on trips-- good or bad. King's Court is an exception in its exceptional service. Not only were the family staff very friendly, but helpful beyond belief to my family and me. The husband of hotel manager not only offered to (and did) drive us to one of our destinations, but even offered to pick us up, and got us free tickets to the Memphis Redbirds Game. The staff were not some of the nicest people, but THE nicest people, I have met in my stays. That said the rooms were kept well, though fresh towels were not always furnished in the morning (we had to remind the houskeeping staff), and the wi-fi was frequently slow or unavailable. You get a fair amount of space for the price, and the room (ours had two double beds), though modest, is well furnished. We chose King's Court Motel (to be Vista Inn in the future) so that we could be close to downtown and save our money for traveling. Although our trip in all was not particularly memorable (we did not plan it out well, and there were other external issues having nothing to do with the motel), our experience at King's Court was one we will remember for a long time, and if we have the opportunity to stay in Memphis in the future, we would gladly stay at King's Court again.", "Date": "July 30, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Tennessee", "Title": "“Nice, but did not like location”", "Author": "weddlebond", "ReviewID": "UR35769913", "Content": "Staff very nice. Rooms real clean. OK for the money. Did not like Location. Not far from Beale Street. Did not like walking from the Hotel to Beale Street because of the area. I would stay there again. Expedia did an excellent job in finding that motel for the Money we had to spend @ that time. Other hotels downtown Memphis is very expensive.", "Date": "July 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Kittyboots", "Title": "“Excellent Location and Very Friendly Staff.”", "Author": "Kittyboots", "ReviewID": "UR34090075", "Content": "My husband and I were looking for a Hotel that was within walking distance to watch the fireworks on the river in Memphis. This was the only hotel that we found with reasonable rates and that had vacancies. The service was excellent and the staff was very friendly. We had a small problem with our first room that I addressed to the young man at the check in counter. He promptly checked us into a different room which was great. The bed was very comfortable and the air conditioner worked amazingly well. They have security cameras and a security guard that stays on the premise at night. It was very quite around the hotel at night. They did have WiFi and it worked great.", "Date": "July 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "ar", "Title": "“Worth The Money”", "Author": "razorbackpat", "ReviewID": "UR33976042", "Content": "This Place is being remodeled and parking lot is being paved at this time, But when you meet the mangement they are great it makes you look over some things. It was a good location close to Beale Street. But keep in mind there was not a blow dryer and not alarm clock, I have not seen that in years. I will be more prepared next time cause it is an older motel, but I would return for a short visit.", "Date": "July 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "STL", "Title": "“The Kings Court has some of the best customer serivce I've seen in a while.”", "Author": "GO_CARDS_9", "ReviewID": "UR29768320", "Content": "The rooms were clean and comfortable. Location was great, you can walk to just about anywhere. We had a group of people celebrating a birthday during Memphis in May. We were able to walk to the Music Festival and Beale Street. The staff was the best part of the stay. They were extremely helpful and friendly, even taking some of our group to local stores.", "Date": "May 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Manchester", "Title": "“Excellent - lovely lovely people”", "Author": "Memphit", "ReviewID": "UR28427793", "Content": "The staff were the nicest people I have met so far and could not do enough for you. Even offering to drive me inthe golf court to the back of my hotel so I didnt have to walk the 5 mins in the rain!! Also none of the staff would except any tips of any kind, so you know that the service being provided was just out of niceness. Location I thought was great less then a 10 min walk to Beale St. Some people may have concerns because it was a little of the beaten track and the area did go a little down hill. But as a single female I felt perfectly safe there. Room was large and clean and very comfortable. I think it the best bed in a hotel etc I have slept in.", "Date": "April 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Minneapolis", "Title": "“Not perfect- but a good value and awesome location”", "Author": "MinnesotaTraveler43", "ReviewID": "UR27705586", "Content": "First, realise that all the old horrible reviews of this motel were from before the renovation. It is NOT moldy or smelly anymore. The rooms have been cleaned, repainted, and have new doors and locks. The staff cheerfully meet your needs. Refridgerator and microwave are available. The only drawbacks were that the towels are small and threadbare, and the new doors stick and are hard to open. But that is small beans compared to the value you get for the location. This motel is adjacent to Autozone and two blocks from Beale Street and the Fedex Forum, on the same street as Sun Studios, within walking distance of the riverfront and downtown, and less than a mile from the MLK Jr. museum. It is in the center of all of the reasons you came to Memphis. And you pay a lot less than at any of the other hotels in the area. It may look a little run down but it's well worth it (just like the rest of Memphis).", "Date": "April 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Texas", "Title": "“Great place to stay!”", "Author": "DMMTexas", "ReviewID": "UR26413920", "Content": "Rooms were very clean but small. Staff was very heplful. We did have a problem with the phone in the room, but within minutes we had a new phone. Location was great!!!! Just blocks from Beale street, several museums, Red Bird Stadium is accross the street. Pool looked clean, but pull area is a little lacking. Great value! My family felt very safe. I'd recommend this to anyone looking for a clean, comfortable, and reasonably priced place to stay. It also offered free parking.", "Date": "March 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Grove City, OH", "Title": "“Great value for a Beale Street area Motel”", "Author": "The_Satchman", "ReviewID": "UR25602510", "Content": "My friends and I traveled from Columbus, OH to Memphis for a weekend near Beale St. Once we arrived the staff at King's Court made us feel welcome. We spoke to several members of the staff and their primary concern was our well-being. We had one small glitch that was fixed within minutes and then we could enjoy our stay. Only two short blocks from Beale and across Union from Memphis stadium. A return trip is in the works! GO BUCKS!!!", "Date": "March 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Midwest", "Title": "“What a great improvement!”", "Author": "MidwestMophead", "ReviewID": "UR24566454", "Content": "I have regularly stayed here at least once a year for about the last 5. First started staying just because of the location, directly across the street from the ballpark, (Go Redbirds!), and of course all of the Beale Street nightlife just steps away. The renovations recently completed improved the place 100%. The rooms have all been redecorated, new bathroom fixtures, paint, pictures, furniture...all have made a great improvement. I used to just stay if by myself or a with a drinking buddy, but now definitely would not hesitate to spend the weekend with a date there. The minor improvement I'd suggest is to make sure and have working TV remotes, but that is only thing I could say would make my next stay better.", "Date": "February 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Wade", "Title": "“Good Place to stay”", "Author": "RTW376", "ReviewID": "UR23281957", "Content": "When we arrived we were a little nervous due to having to be buzzed into the lobby and then the office staff was behind a glass wall. However, while we were in town we did not see/hear of any problems. There was a truck parked in the parking lot that had the bed of the truck loaded with tailgating stuff for the Liberty Bowl. Each morning I went outside to see if anything had been stolen out of the truck and both mornings the truck appeared fully loaded. Rooms were clean. Office staff was very knowledgable and friendly. Beale St is only about 3 blocks away and we walked there and back and felt safe. I'd definitely stay there again if I go back to Memphis.", "Date": "January 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, WA", "Title": "“Best Motel EVER!!!”", "Author": "getdaref", "ReviewID": "UR23016637", "Content": "The Kings Court Motel in downtown Memphis is the best motel in which I have ever stayed. The price ($75/night with tax for a double) was extremely reasonable, and the front office staff was exceptionally helpful and friendly, When I checked in, the young man at the counter not only helped me with my bags, he also drove me to my room in the motel's weatherproofed golfcart! I haven't experienced service like that in a long, long time! The entire motel has been recently remodeled, and the rooms are large, clean, and well-furnished. My room had a dorm refridgerator, TV w/limited cable (including HBO), writing table w/chair, and a wardrobe, stocked with extra blankets and pillows. During my 5-night stay, housekeeping took care of my needs, and the front office staff was always available to help with map directions or rekeying the electronic lock. If I ever go to Memphis again, I will definitely stay at the Kings Court Motel.", "Date": "December 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oklahoma City, Oklahoma", "Title": "“Undiscovered Gem”", "Author": "lannyr", "ReviewID": "UR21919123", "Content": "I was having a hard time finding a reasonable room in Memphis when I stumbled across this little downtown oasis. A throwback to the days of mom & pop motels, it is close to Beale Street and across the street from Autozone Field. Recently remodeled it is clean and secure. The staff was friendly and gracious, parking is free and rates were reasonable. I wouldn't stay anywhere else in Memphis.", "Date": "November 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cowtown", "Title": "“I'll be back to the King's Court”", "Author": "whimzykat", "ReviewID": "UR20989520", "Content": "It's already all been said. The owners and staff of this very moderately priced motel provide exceptional service. The rooms may be on the smallish side, but if you're in Memphis sitting in a motel room you're in the wrong town anyway! Easy walk to Beale Street and all it's wonders as well as the rest of Memphis. The King's Court provides some pretty good perks for the price: in room refrigerator and microwave and premium cable channels. I think it has wifi, but I didn't use it on this trip. We are planning to return for more than just a night and we will stay at the King's Court again.", "Date": "October 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver", "Title": "“Great Stay”", "Author": "canadaeh40", "ReviewID": "UR20208123", "Content": "I had booked us to stay at the Artisan Hotel, I cancelled at the last minute and I am so glad I did. The Artisan is very far away from everything and it would have cost a fortune in cab fairs. I booked us in at the Kings Court, we had a great stay, it has been newly renovated and it was only 2 or 3 blocks from Beale street and the Peabody Hotel. There are several very good restaraunts close by and it was very quiet and we felt very safe. The staff was great, they were so friendly and helpful. we felt like we were at home and we had the time of our life in Memphis. special thanks to James for taking such good care of us. Thanks from Canada", "Date": "September 19, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City", "Title": "“Perfectly met my expectations”", "Author": "ciannu", "ReviewID": "UR19114724", "Content": "My boyfriend and I ended up staying here because we had a 24 hour layover on our way back from vacation in Mexico. I had been on TripAdvisor looking for a cheap yet decent place to stay since it was the end of vacation and (a) it was only one night & (b) i knew we'd be practically out of money ha. I will say that from the reviews I read, particularly one entitled, \"HORRIBLE!!!!\" i was very apprehensive, but DON'T BE. Yes, this Motel is under construction, but there wasn't any noise during our stay at all, and despite appearances, our room (king sized bed) was very clean, excellent AC, efficient and affordable. This isn't a luxury hotel (obviously), but it met our 24 hours needs perfectly. The location was perfect as it was near all the things i wanted to see within the 24 hours -- namely Beale Street (around the corner) and S. Main Street with the historical district, and Sun Studios. While it is around the corner from Beale Street I will say that the block its on made me a little nervous cause it was sort of desolate, but, it didn't prove a problem and because the bus station was nearby and other more upscale hotels, there were cops around and such. Only other thing I found was that when I called originally they quoted me at $60 for the night and then when i showed up they told me it was $85... but I was able to negotiate back toward my original rate quote. I say go for it. I thought it was just right.", "Date": "August 19, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London, England", "Title": "“Good cheap place to stay in Memphis”", "Author": "pdp84", "ReviewID": "UR18845284", "Content": "This is the best place to stay in downtown Memphis, if your looking for accomodation that is relatively cheap. There are some alternatives within the same price range, but are nowhere near the same quality as this hotel and their locations aren't in the best of areas. The staff were excellent and very helpful, the room for the price I paid was well above average, which included the pool. It had excellent AC (which helped with the high temp) and was very spacious. This hotel is highly recommended.", "Date": "August 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lawrence, KS", "Title": "“Good place to stay”", "Author": "vern_728", "ReviewID": "UR18660094", "Content": "We stayed here for a concert that was going on at the stadium right across the street and I'm glad this is the place we chose! Our first impression was not good because they're undergoing renovations and it looked like a construction zone. However, our room was newly redone and very clean. Memphis had a heat index of 115 that weekend and our room air conditioner kept us very cool & comfortable. It's in a great downtown location, near everything a tourist would want. Plus, the price is the best you're gonna find! I would stay here again if I return to Memphis.", "Date": "August 5, 2008"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Missouri", "Title": "“Horrible!!!”", "Author": "abc1758", "ReviewID": "UR15031792", "Content": "This is literally the worst place I have ever stayed in (including hostels in Europe). The reason we booked this place was because of its location, and it was cheap compared to other hotels in the area...DON'T BE FOOLED! I had read all of the reviews and thought, \"Why not?\" It is much more worth your time and money to stay somewhere else. When I called, I was told that the place had just been renovated. Now, if they did indeed fix things, the owners used garage sale furtinure or stuff from the dump. Our TV did not have a power button or a remote to use. The sink did not have a drain, the carpet was coming up around the edges, there were holes in the walls, there were holes in the furtinure, and there was MOLD in the shower. The towels were paper thin and the beds were lumpy. They advertised having free wi-fi, irons, and ironing boards, but I found none of these things. We attempted to stick it out not wanting to waste 75$, but there were people fighting and slamming doors at the motel not to mention the horrible traffic right outside (which I know they had no control over). At midnight we left and went to another hotel which was MUCH better. When we left, I stopped to talk to person working, and he was really rude about the thing - tried to deny that there was fighting going on etc... I will never stay here again, and I wouldn't recommend this place to my worst enemy.", "Date": "April 14, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "fort smith Ar", "Title": "“My favorite place to stay during Memphis in May”", "Author": "lele420", "ReviewID": "UR14988576", "Content": "I love this place I stay here every year for Memphis in may music festival. I have gotten to know the owners really well. They are super nice people. Thanks Leon H", "Date": "April 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“You can't beat this place for it's value and location!!”", "Author": "R0xy1", "ReviewID": "UR10939396", "Content": "I came accross this motel after getting off a 10 hour grey hound (bus) trip. It's right next to the station and I really didn't fancy searching around for a good price. The owners and staff are extremely friendly and were very helpful with everything, tips on the area, where to go, what to see etc. They made sure our stay was pleasant and comfortable. Rooms are about $50-$58 a night and having been to this city a few times now, I can honestly say that you will definitely not get cheaper than that. If you want to be in dowtown memphis (5 min walk to Beale Street and the heart of Memphis) you will not get better than this. It's also walking distance to rock and soul museum which offers free transport to Graceland, sun studio and heartbreak hotel. I've looked into other hotels in the area and a majority of them are in 4 star category where you would be looking at at least 100 pounds a night. The kings court motel is therefore ideal with its price! It is basic though so don't expect anything lavish. I think considering price, location ,helpfulness of owners, you can not go wrong with this one and I always recomend it to people.", "Date": "November 20, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Fine for the price, walking distance to everything except Graceland/Stax”", "Author": "skud", "ReviewID": "UR8267171", "Content": "When in Memphis, you'll probably be out most of the day checking out Graceland, SUN Studio, the Stax Museum etc. then at night be wandering Beale St. We drove into town and just happened upon this place. It wasn't particularly nice but not completely filthy either. For the price and to be able to walk back from Beale St. at the end of the night it was worth it. Not the greatest place for families and if the Best Western up the street is close in price then go there, but this place is fine for budget travellers who are used to hostels or other low-end accomodation. We never had anyone knock on the door or give us any problems.", "Date": "July 31, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cordova", "Title": "“OK Not so Bad”", "Author": "pratboy", "ReviewID": "UR7351732", "Content": "Hmmmmmm.........Not so bad,..... next to memphis stadium on one side and Fedex Forum on another side ..... very close to Main street. Room is ok ...........u can try fo once", "Date": "April 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "3.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "san diego", "Title": "“decent”", "Author": "dieg0", "ReviewID": "UR6509286", "Content": "I also went there one morning when I got off the Greyhound. I walked for a while but there was nothing else around, and I was tired. Paid about 45$ bucks, room was decent, very quiet, I never had problems or people knocking on my door. And I agree that this hotel's greatest advantage is his location, next to Beale street, Peabody place, Greyhound terminal, Fedex center and that nice ballpark just accross the street.", "Date": "December 28, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "pasadena, ca", "Title": "“location....”", "Author": "foobaz", "ReviewID": "UR5041820", "Content": "humm. there are 3 outstanding things about this place. location, location, location. however, it's exactly what you pay for. all we needed was a bed. wasn't nasty, but it wasn;t the peabody either. was safe, free parking, and a across the st from the ball park, 2 blocks from beale and the fedex center. would recommend it if all you're gunna do is pass out and then start again the next afternoon on beale.", "Date": "May 8, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Aberdeen Scotland", "Title": "“One night only”", "Author": "A TripAdvisor Member", "ReviewID": "UR4985592", "Content": "I stayed at this place for one night when I got off the Greyhound. Five minutes after I got into the room on the ground floor just along from the front office a transient knocked on my door offering to go to the store and get me booze, or he would get me drugs or he would get me a little female company. I said no thanks and closed the door. Five minutes later a \"lady\" knocked on my door and asked if I wanted some company. Again I said no thanks and closed the door. Not recommended for families.", "Date": "April 18, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "England", "Title": "“Dirty, shabby, searly staff, don't bother”", "Author": "A TripAdvisor Member", "ReviewID": "UR3228537", "Content": "With travel you get what you pay for in general. With the Kings Court Motel you do get a central location but that is its only merit. Room 217, dirty, stained lampshades, blown bulbs, smoke alarm hanging off, walpaper peeling, flithy bathroom with a door that does not close, sink / dress top positioned so that the toilet sisten cover would not fit. The ceiling had a 50x50 mdf borad patching up a hole. The shower was ok if you were under 5ft and if you wanted clean water you had to run it for 5-6 minutes. The room had been recently re painted, nothing was left untouched, light switchs, light fittings and even the light bulbs had been painted over! Searly rude staff who cared more about eating food that assisting guests needless to say I canceled my second night. Yes it is cheap for central memphis but cheap doesn't have to mean dirty and shabby. I paid less in a Nashville Days Inn and was much more satisfied. Memphis is a great city so spend the extra and stay at the next cheapest, Bestwestern opposite the Peabody hotel. Don't even think about staying at the kings court, you don't derserve it !", "Date": "February 24, 2005"}], "HotelInfo": {"Name": "Vista Inn Motel Downtown Memphis", "HotelURL": "/ShowUserReviews-g55197-d1485414-Reviews-Vista_Inn_Motel_Downtown_Memphis-Memphis_Tennessee.html", "Price": "$89 - $152*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">265 Union Ave</span>, <span class=\"locality\"><span property=\"v:locality\">Memphis</span>, <span property=\"v:region\">TN</span> <span property=\"v:postal-code\">38103</span></span> </span> </span> </address>", "HotelID": "1485414", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/c4/03/c4034e065182fd6eb4f6288f652fc7e71large.jpg"}}