{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "La Spezia, Italy", "Title": "“Special attention to details”", "Author": "ANCC1970", "ReviewID": "UR127509209", "Content": "This Hotel has been recently restructured and it is still in a very good status. Perfectly located, large rooms clean and very comfortable. No noise in my room. Very professional staff available at any time during the day and the night. Avaliability of parking inside the Hotel, but also outside during the weekend it is not difficult to find a parking. I have appreciated the availability of Gluten Free food for the breakfast.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“I was there in March and this is the best hotel in Rome!! Not only the service was amazing but the most honest people!”", "Author": "GiulioM23", "ReviewID": "UR127323693", "Content": "My mom left her gold rolex in the room and we were at the airport already on our way to Barcelona. I called hotel and as soon as I said my name they said, we found you watch and is in our safe. They are AMAZING!!!!", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Patras, Greece", "Title": "“Amazing palazzo!!!”", "Author": "MariannaDayio", "ReviewID": "UR126667692", "Content": "We stayed here to celebrate our 1 year wedding anniversary. The staff at the reception was super friendly and helpful. We had a room with our own balcony in front of the hotel. The breakfast was very nice and had a variety of cold and hot dishes. The hotel in near via veneto and galleria borghese. Would definetly recommend it and stay there again given the chance!", "Date": "March 26, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Rio de Janeiro", "Title": "“Mixed feelings”", "Author": "machadojr", "ReviewID": "UR125218528", "Content": "Let me start saying that I liked very much the hotel. A beautiful palazzo, quite new, free parking, free internet, gym, interesting location near Galleria Borghese. But, at the end of my first day they had a problem with the water. No water. I had to move to another hotel late at night so I could take a shower. As the hotel has many qualities I give it the average rating.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Connecticut", "Title": "“Good value”", "Author": "nomenemo", "ReviewID": "UR123886574", "Content": "I was here with friends in January. It's a lovely small hotel near the Borghese; not too far from the Via Veneto. We had a roomy corner room with a large private balcony. People at the front desk couldn't be nicer or more helpful. Very nice breakfast.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kalamata, Greece", "Title": "“A place to be”", "Author": "natasa g", "ReviewID": "UR123094991", "Content": "Villa Pincianna is a beautifully renovated hotel just next to the centre of Rome (Via Venetto - Piazza Barberini) that is totally linked to the city of Rome. Cleaness and professionalism (especially by the front office employees - Sandrina & Antonio) together with a smiling attidute made our stay really comfortable. Free internet access and breakfast box upon departure early in the morning were added values. I would just comment on the breakfast menu (great variety but no light products included - light milk, light yoghurt, whole wheat bread) and on the bed covers (luxurious new sheet together with old blankets - a duvet cover would be suggested).", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Illinois", "Title": "“A grand hotel!”", "Author": "EuropeanTraveler6977", "ReviewID": "UR123062664", "Content": "My husband and I visited Italy this past holiday season including wonderful Rome! We stayed at the Hotel Villa Pinciana for three nights in their junior suite and found it to be a beautiful, elegant and class-act hotel located in a quieter area of Rome yet close to the Borghese; the main shopping areas near the Spanish Steps and to one of our favorite restaurants, Lo Stil Nuvo-just around the corner! Both my husband and I have sensitive backs and the bed's mattress was what I would compare to a foam mattress of the highest quality-very comfortable. The breakfast offered was fine; pastries, fresh fruits, cereals, breads of all types, meat/cheese trays along with juices and the best coffee I had while in Rome! We did ask alot of questions of the front desk manager(s) and every time, each of them was very gracious, helpful and friendly. Would we return? You betcha!!", "Date": "January 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cypress, Texas", "Title": "“A Quiet Gem of a Hotel”", "Author": "lkpeterson", "ReviewID": "UR122134727", "Content": "This wonderful hotel is a quiet gem in what can be a noisy city! It is within a few minutes' walking distance to the Villa Borghese Parc - an excellent location for walking or jogging. I love the breakfast setting on the outdoor patio (in the spring). It is a wonderful value with friendly, helpful staff.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Craigavon, United Kingdom", "Title": "“Super location”", "Author": "Garry R", "ReviewID": "UR121237844", "Content": "Lovely small hotel in a great location for sightseeing in Rome. A lovely oasis to return to after a day's exploring the attractions. Nice breakfast. Staff helpful when needed.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gosford, Australia", "Title": "“Could this be the best boutique hotel in Roma?”", "Author": "KeithH4", "ReviewID": "UR120448273", "Content": "We booked this hotel on the basis of reviews on tripadvisor, and it did not disappoint. A great location, only a couple of blocks from Via Veneto, but far enough from the hustle and bustle of the city to be peaceful and quiet, particularly at night. Also just a short walk to the beautiful gardens of Villa Borghese. The building has been beautifully renovated and the appointments and furnishings were of high quality. The European breakfast was beautifully presented, and thoughtfully put together. Front desk staff Antonio and Magdelena were friendly, courteous and helpful, and handled our transfer bookings from port to hotel and from hotel to airport with no fuss. This is one of the best value for money hotels we have stayed in anywhere in the world, and we would happily recommend Villa Pinciana to anyone looking for classy, quiet, affordable accommodation in Rome. One little glitch - the hotel recommended we use GLT for a \"hop-on, hop-off\" bus service while in Rome, and were able to provide us with a ticket (Euro 64 for 48 hours) at their front desk. We would not recommend GLT at all - they were Euro 12 more expensive than other operators, seemed very inefficient with their operation - long waits between pick-ups - and their drivers and staff had a \"couldn't care less\" attitude to their customers. On our next visit to Rome, we would either walk and save the money, or definitely look for a different operator.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Samara, Russia", "Title": "“Nice hotel with stupid problems”", "Author": "Pavel K", "ReviewID": "UR120244279", "Content": "My name is Pavel Kurenev. As i am myself a travel agent and sending clients for trips for 12 years, i try to choose for myself the best places to stay that worth their money. About this hotel everything is fine if there would not happen a stupid thing! I needed to open a bottle of wine at my room but did not find a bottle-screw. I went to the reception and asked for this thing, a man said he would find it and come to my room to open. In 10 min i made a call to the reception-he said he is still looking for it. At last I went with a bottle downstairs and you will never imagine what he told me!-he said that there is a restaurant nearby and I would better go there to open it! I could hardly believe my ears but as I was in good humor I really went to the restaurant next street and there helped me with this problem. Besides they gave me the bottle-screw as a gift and I gave it to reception with words to keep an eye on it. It was funny that time but you will never believe that exactly the same thing happened in two days and this time I got angry but the girl at the reception again advised me to go to the restaurant next street! This is most stupid thing which ever happened to me at any hotel(", "Date": "November 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Coronado, California", "Title": "“Well-situated, excellent breakfast, nice staff”", "Author": "Mfsylvester", "ReviewID": "UR119596845", "Content": "My parents, sister and I wanted a smaller hotel for our week-long visit to Rome. Villa Pinciana was an excellent choice. Located just off Via Veneto, it was very easy to walk almost anywhere in the city. The rooms were clean and well-appointed; my parents' suite had two expansive terraces with French doors and we spent several afternoons there drinking wine in the autumn sunshine. The staff was very supportive, making reservations and calling for taxis and tours. Of particular note was the excellent breakfast, everything from pastries to cheeses, with fresh juices and coffee.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fort McMurray, Canada", "Title": "“Smaller hotel with lots of charm...”", "Author": "rjmggftmac", "ReviewID": "UR118788156", "Content": "We choose this hotel for our four-night stay in Rome mainly because of the charm - and the price which was considerably lower than any of the other hotels we stayed in on our trip through Italy. The hotel is just off the beaten path, but still within walking distance to most attractions (we walked from the hotel to the Vatican, St. Angelo's castle, the Roman Forum, the Pantheon, etc). Another factor in our decision to book this hotel was the advertised roof-top terrace. While there is a lovely roof-top terrace, there is very little patio furniture there. We were travelling as a group of 6 people, but the terrace had only 4 chairs and a small table when there was room for much more. There is a lovely patio that we used each day for breakfast. The rooms were beautiful, but a little small. The included daily breakfast buffet was okay although were not as good as what we had experienced at the other hotels during our trip. It was a little awkward to pour your juice, coffee, etc as there was no place to set your cups or glasses down. We had very good service from a couple of the front desk staff members, and not-so-good service from a couple others. All in all, we feel this hotel is good value for the cost.", "Date": "September 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Malta", "Title": "“Slightly disappointing”", "Author": "Michael-Art", "ReviewID": "UR118700416", "Content": "With the amount of hotels in Rome choosing the right one was a very hard task and after reading so many great reviews on Tripadvisor about Villa Pinciana we thought that we have found the right place to stay in. Unfortunately we were slightly disappointed as we had higher expectations for a four star hotel. The hotel really does have a great location being very close to Via Veneto, Villa Borghese and 10 min. walk to the Spanish Steps and it is actually its main advantage - quiet area and in the same time it is close to everything. Looks like when making the hotel the main efforts have been put in the outside area and the first floor where the reception and breakfast area is. The room we stayed in (we had a booking for 5 nights) was nothing extraordinary, it looked like any other hotel room and did not have that boutique Italian charm stated in the advertisement. We were lucky to have a balcony but there were no any chairs so we didn't use it. Bathroom was nice but I personally found not very comfortable that there was no place to put shampoo or soap in the shower cabin (just on the floor), towels were of poor quality with some old stains and were not changed every day. The same about bed linen - for the five nights we stayed our bed sheets we not changed, we complained to the guy on the reception on the forth morning but even then they didn't change the sheets, I can say that for sure because the bed sheet had a hole that was sewn and there was a patch and I kept seeing this patch on the sheet for 5 nights (I even took a photo), This is something I cannot accept for a four star hotel and for the price we paid (more than 200 euro per night)! The air-conditioner in the room was too noisy so we had to switch it off as if you stay in the room longer it will definitely cause you headache. We were told on the reception that it is not just our room that has this noisy problem so we had to cope with this; fortunately it wasn't too hot in Rome. Sandrine and Magdalena on reception were very nice and very helpful with everything we asked for something I cannot say about the blond guy with glasses whose name I unfortunately didn't notice. He was supposed to give us a wakeup call on the morning of our departure, we asked for that wakeup call but nobody called, good we didn't missed the flight! He said he called somebody but obviously it wasn’t us, ridiculous! Except for Sandrine and Magdalena the other hotel staff had difficulties to understand/speak English even those that served the breakfast and although the girls that served the breakfast were one and the same they kept asking us every morning for the number of the room which I personally found annoying. Breakfast itself was OK but a bit limited choice, bread and pastry were not fresh. Limo service provided from the hotel to the airport was excellent, better use it instead of other companies like we did on our arrival using Romacabs - the driver was terrible, was speeding, not speaking English and obviously not knowing the directions very well as he was using navigation to find the hotel. This hotel could be a really nice place to stay but unfortunately there are some gaps in the service and some details that make you feel disappointed. It is a shame because with this location and architecture Villa Pinciana has a great potential and can offer far better service for that price range.", "Date": "September 28, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Poway, California", "Title": "“Perfect Small Hotel with Huge Charm”", "Author": "Mary S", "ReviewID": "UR118016718", "Content": "A well-groomed 25 room hotel in a nice area of Rome where you can walk to restaurants, shops and even walk or catch a bus to the Spanish Steps and other historical sites. The hotel staff were the most wonderful people. They would answer questions after question, give directions, help select restaurants, call taxi's and always with a smile on their faces. I particularly loved the morning buffets in their elegant morning room. There were selectons of meats and cheeses, pastries, eggs, cereals, cappucino, etc. Yum, yum! The rooms were very nice, very clean and quiet. All in all it was just a lovely hotel. I would go back there in a minute. My husband and son really enjoyed it as well.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Such a lovely and more intimate Hotel”", "Author": "Jay W", "ReviewID": "UR117794713", "Content": "Just loved this hotel, they have sound blocking windows so you can hear the local traffic. its nice and small so the staff are always very quick with your requests. Very helpful with Shopping recommendations and with great restaurants. would definitely recommend, my husband and I could not fault it.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Wellington NZ", "Title": "“Beautiful hotel In nice part of Rome”", "Author": "JacquieP", "ReviewID": "UR117058917", "Content": "We had a very nice large suite to accommodate the four of us. Only thing was my two teenage sons had to share a fold out bed which they weren't rapt about!! We had a very large outdoor patio with a nice view over the gardens. The hotel is nicely decorated within large gardens and has a elegant breakfast room with outside patio option. the breakfast itself was a bit lacking we felt. there appeared to be lots of options but most of the pasties were not very fresh or tasty. the staff in the restaurant were also abit surly. We loved the location just a short walk from the very elegant and Via Vittorio Veneto the home to the infamous Bar ( well worth a visit to indulge in the Peach Belinis made with fresh white peaches but be warned they cost 15 Euros each- but you do get yummy complimentary Hors d'oeuvre). We ate twice at Alex Cafe also on this street which we rated as the best food in Italy!! ( Gluten free pasta is amazing)", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Wakefield, United Kingdom", "Title": "“Charming Hotel”", "Author": "Edwards55", "ReviewID": "UR116954125", "Content": "My sisters and I stayed in the Villa Pinciana in August and had a wonderful stay. The rooms of the Villa were clean, comfortable and beautifully and tastefully decorated in classic style. You could sit out in the gardens and enjoy breakfast which was varied and well presented. The staff, particularly on reception, knew the meaning of customer care and were very welcoming and helpful. It was a 5 to 10 minute walk from the Villa to the shops and to the terminus where you could hop on a tour bus. The area felt safe even at night. We all enjoyed our stay in Rome and and would definitely return to the Villa Pinciana.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Surrey, Canada", "Title": "“Great hotel, book in advance for better rates”", "Author": "Wenron", "ReviewID": "UR116944968", "Content": "We greatly enjoyed our stay at this hotel and we would recommend it enthusiastically. We stayed here 5 nights. The breakfast was above average, but the breakfast room was beautiful. You also have the option of dining in their courtyard which is very nice. Our room had a large private patio/deck with a nice view of a church courtyard. The room had high ceilings making it feel larger than it was. The decor was bright and high quality. The staff were friendly and helpful. When my backpack with the room key (metal, not plastic) was stolen (I put it at my feet in a Macdonald's and when I tried to pick it up after my meal, it was gone!) I was not charged a replacement fee at all. They asked if anything else important was in my bag (there was not). The hotel is located in a quiet and very safe feeling part of Rome, 5 minutes from the Via Veneto. We were fine with the walking to all the sites in Rome, as we were trying to get in shape, but someone with walking issues may find they are a little way from the tourist sites. However, no matter where you stay, you will need to do a lot of walking in Rome. Our room had a shower with no tub, but the shower was large with excellent water flow. This hotel deserves its four star rating, but we will give a five circle rating here because we got more than we thought we would. We paid 655 Euros for 5 nights. July 13-18. We booked well in advance.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Doncaster, United Kingdom", "Title": "“Perfect, wouldn't stay anywhere else.”", "Author": "CSN1039", "ReviewID": "UR116890202", "Content": "We stayed in Rome for 4 nights and this hotel was perfect, within easy distance to the centre, we walked everywhere - it's definately the only way to travel around. As soon as we arrived the staff were friendly, knew our names and had prepared a personalised map for us, complete with translations so we didn't get lost. They also booked us a meal at the restaurant round the corner for our Anniversary which was amazing - we did soon realise we were in the pricey part of the city but it's a simple 10 minute walk to plenty of other moderately priced places to eat. Breakfast was great, hotel was spotless and the staff can't do enough for you. We used the Spa facilities whilst there also, and while basic, it was much needed. You simply book it 10 minutes before you wish to use it and they prepare it for you. You get it yourself too which made it even better. Can't wait to go back!", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "scotland", "Title": "“Lovely hotel Very Nice Receptioist”", "Author": "Tillascotland", "ReviewID": "UR116504425", "Content": "We had a 2 night stay with my 3 daughters, the rooms were clean and the breakfast was good. What made the stay was the lady on reception when we arrived she could not have been more helpful, by the time we had checked in and taken our suitcases to the room ready to exsplore Rome she was there with a map ,highlighted all the main attractions which bus to get or underground, where to get your tickets and how much they should cost. Very helpful indeed and made it a lot easyer for us with only 1 1/2 days to see as much as possible. In the evening she booked a restaurant for us which was lovely. Top marks to her.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Vienna, Virginia", "Title": "“Would stay here again in a heartbeat”", "Author": "momva01", "ReviewID": "UR116496676", "Content": "Our family of eight stayed here precruise for three nights. As much as we were looking forward to our cruise we hated to leave this hotel. Our rooms were spacious, clean, and well-appointed. The staff was very friendly and helpful. The breakfast buffet was a nice touch with lots of options. We loved taking a bottle of wine up to the roof terrace and enjoying the scenery. Great experience.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great Hotel Near Via Veneto”", "Author": "BuonaNotteRoma", "ReviewID": "UR114993444", "Content": "My family of four (me, wife, daughters 15 and 12) recently stayed at the Hotel Pinciana in Rome for five nights and had a terrific stay. We booked a single room for the four of us online several months in advance…and the reservation went through without any issues. About one week before our stay we were sent a very nice e-mail offering to arrange for transport between the airport (FCO) and the hotel. Their rate was virtually the same as a cab would have been…and they sent a far more roomy and comfortable van. The hotel is as clean, charming, and classically European as it looks on their website; and we were welcomed by name upon arriving, which I always appreciate. The room (which I booked as a quad-occupancy) was prepared for us with a king and two roll-away beds. In truth, it is sized like an oversized double and was a little tight for the four of us but I expected as much since the ‘classic’ European hotels seem to be set up for two. We were just happy to \"bond\" and save a little money by sharing a quad...I knew there would be a trade-off. Size notwithstanding, the room was clean and beautifully decorated with ample room for our bags and to hang our clothes. The location of the hotel is about two blocks off the top end of the Via Veneto (near Villa Borghese) and about a ten-minute walk to the nearest Metro Station. While the location might be a bit removed from Rome’s key attractions for some people, my family and I enjoy walking different routes as a form of exploration and getting away from the more crowded areas of town. We were very happy with the location. One great surprise was the number of excellent restaurants within walking distance of the hotel…and I’m NOT referring to the overpriced ones lining the Via Veneto…although we ate at a couple of those, too. My family and I were out about town for most of our stay and don’t typically eat in our hotels, thus I can’t comment on Villa Pinciana's restaurant and other services - although they have a very nice patio on the property. The desk attendant was extremely helpful when I needed her urgently to print our ticket voucher for the Colosseum just one hour prior to our assigned time and was walking in the Villa Borghese when I discovered my error. The rest of the staff was just as friendly for the few times we interacted with them. I would not only stay again at the Villa Pinciana but would recommend the hotel to other families or couples staying in Rome; particularly after having previously stayed at a couple of the far pricier 5L-star hotels in town. It met all of our needs perfectly, without the grandiosity and inflated price of the 5L's.", "Date": "July 3, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Duisburg, Germany", "Title": "“friendly staff”", "Author": "hgaur", "ReviewID": "UR114730441", "Content": "This Hotel is located just a 8 - 10 minute walk from the Spanish Steps and Spagna Metro Stop. The staff at this hotel was amazing, especially at the reception. They provided us with maps and all the important touristic information. The breakfast was also very nice. The bed was comfortable and the bathroom was also nice. I will stay here again if the price is right.", "Date": "June 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fayetteville, Georgia", "Title": "“Wonderful”", "Author": "nsreiter", "ReviewID": "UR112185521", "Content": "We find this hotel by searching trip advisor and booking.com. The rooms were very nicely decorated. Our first room was like a NYC hotel room. I asked for a larger and said I would pay the difference. They moved us with no additional cost. The buffet breakfast was perfect. You should never expect a full, cooked to order breakfast. They give a nice assortment and the patio was pleasant in the morning. We walked to our dining selections that were suggested by the hotel. They were spot on each time. But my favorite aspect of this lovely place was the location. We were away from the hustle an bustle of the city. This was nice after very long days of touring. It is worth the cost to have them pick you up at the airport. A nice start to our holiday. Thank you Hotel Villa Pinciana!", "Date": "June 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Great”", "Author": "Gay64", "ReviewID": "UR111845479", "Content": "We spent 4 wonderful nights at Villa Pinciana. Our room was spacious and so comfortable. Staff are very friendly and helpful. Nothing was too much trouble.Being a \"mature\" couple we found the walking a bit heavy going, but survived. Would definately stay again. Only negative is no coffee making facility in room as we are early risers and need our caffeine \"fix\".", "Date": "June 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“La Dolce Vita”", "Author": "LiliHannah", "ReviewID": "UR106700637", "Content": "This beautiful hotel-palazzo (found via trip advisor) was a real treat ! A limo service to chauffeur you from and to the airport, excellent location, some tips on divine restaurants, free internet, large and clean bedroom and bathroom, my 16 year old daughter and myself had - for 5 days - a taste of the italian \"Dolce Vita\". The staff was extremely nice and helpful, I DO recommend this hotel without any hesitation and we will be back for sure in Roma and will stay again with pleasure in Villa Pinciana. We fell in love with Roma.", "Date": "May 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Seattle", "Title": "“Great Hotel”", "Author": "BellTrav", "ReviewID": "UR105950530", "Content": "Spacious and luxurious rooms. Well located in quiet neighborhood. Beautiful breakfast with full range of meats, cheeses, juices, etc. Staff very helpful with restaurant reservations and making our stay enjoyable. Very clean.", "Date": "April 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "The Hague, The Netherlands", "Title": "“Fine hotel, ok location, but nothing special”", "Author": "KSeH74", "ReviewID": "UR103362310", "Content": "After reading the many positive reviews, we were a bit disappointed by the hotel. The rooms are small, and the beds still have old fashioned blankets. Breakfast is ok, but italian style: many sweets, nothing warm and no fresh fruits or juices. And believe it or not: they serve very bad (filter)coffee at breakfast, so save your coffee craving for a neighbourhood bar. The spa didn't work properly, even after the so called reparation.The positive part: hotel is well maintained, clean and the staff is friendly and helpfull (drawing busroutes on maps, restaurant tips etc). Location is good for visiting the museum in villa borghese (book tickets in advance online). Rome is fantastic!", "Date": "April 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Singapore", "Title": "“Very Good for the regular travellers to Rome”", "Author": "JChua", "ReviewID": "UR101104267", "Content": "Upon arrival in Rome Termini, after more than 3 hours of travelling from Lucca, we boarded a taxi driven by a young and well-groomed Italian. Thought he looked too good to be a driver, indeed, we were conned by his 'note swapping scam'! Asking for 15 euros, my jet lagged husband had given him a 20, but he claimed it was only a 5 ... So, do be careful. Anyway, this nice Hotel has not only honoured our booking of one of their best suites, the Suite Borghese on the 4th floor of the Hotel but they had also kept all our packages that were sent from Venice. There was only this suite on the top floor of the Hotel, along with a small sitting area and terrace for all guests. So, it still feels very private and romantic. The wow factor of this suite has to be two different terraces, with one bigger one with chairs and table on it. The views were of neighbouring villas, embassies and churches - nice way to end our Rome trip! Bed was very comfy, so was the 3 seater sofa (huge)! TV was large with English channels and if I did not remember wrongly, Wifi was also free! Common areas are all laid out in yellow, dark brown and white marbles - classy! Oil paintings, Murano glass chandeliers and classical furnitures abound - my favourites! There was also 2 or 3 nice little gardens surrounding the Hotel with chairs and table for sitting - good for better weather. Ample parking also seems to be available on site. And why did I rate such a high price/quality ratio hotel only 4 stars? Two reasons - we slept like babies in the quiet suite, in preparation for our 13 hours long flight home the next day, only to be awaken by a bright white emergency light at 4.45am! A call to the Reception had confirmed my worst fears - they had trouble with the electrical supply! And normal power did not return till one hour later ...luckily had my eye masks with me. The other reason has to be the Hotel's location - it was shown on our GPS that the Hotel was exactly 1.5km from the Spanish Steps area and such equipments don't lie. True to the fact, it was a long way up a hill, albeit a small hill. After all that walking, shopping and sightseeing, this had proven quite a daunting task for us, especially at the end of the day. Thus, in my honest opinion, this Hotel is most suited for people who has seen much of Rome has to offer, like us. If you are a first or second time visitor to Rome and would like to catch what Rome has to offer to the average tourist, then this Hotel's location is not very suitable. But overall, I would still highly recommend this Hotel to the regular travellers to Rome.", "Date": "March 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Wales", "Title": "“Elegant hotel in good location”", "Author": "CarysWales", "ReviewID": "UR100844245", "Content": "A good, safe location just behind the Via Veneto - nearest metro. sation is Barberini although Spagna is also fairly near i.e about 10 mins walk - a bit uphill so beware if you have lots of heavy luggage - not a good idea to walk. If you're flying into Fiumicino airport then the train at the airport (Leonardo Express) into Termini costs 14 euros one way and a white taxi trip from the Termini to the hotel should cost no more than 8-10 euros (beware the rogue taxi drivers hanging around the station entrance!). I would probably take the bus from Termini - see hotel website for bus numbers - rather than take the metro. The hotel was a former embassy and has been beautifully renovated, rooms was very clean and spacious and the hotel is quietly located. Breakfast was good - warm croissants, selection of hams and cheeses, cereals, but tinned fruit and juices were from a carton. Ask the waitress if you want a cappuccino or expresso and she will make it fresh for you. Reception staff were very helpful and provided a map of the city with bus numbers already written in which was useful. The Via Veneto is 5 mins walk away with all its big hotels and Harry's Bar, Cafe de Paris - expect to pay 8 euros for a soft drink and 14 euros for a cocktail in any of these places and for me the Via Veneto just lacks atmosphere and 'when in Rome' I would much rather go down and sit and have a meal in one of the restaurants overlooking the Pantheon in Piazza della Rotunda, etc. Walking down to the Spanish Steps is 10 mins away and to the Pantheon and Trevi Fountain 20-30 mins. The Colosseum and Vatican are more of a hike to walk from the hotel - Colosseum about 40 mins and for the Vatican I would take the bus or metro . If you want to be very central, I can recommend the Villa Pinciana's sister hotel called the Boutique Hotel Trevi and I stayed there 2 years ago - its location is excellent and right besides its namesake so great if you don't want too much walking, especially at night. I would stay here again, if I got a good deal, otherwise the best places to stay for convenience are around the Spagna area - Via Babuino/Via Condotti, around the Trevi Fountain or the Pantheon or Piazza Navona. You will naturally pay more for hotels in these areas but I think it's worth it.", "Date": "March 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Yorkshire", "Title": "“Careful, quiet and friendly”", "Author": "Beachseekers009", "ReviewID": "UR95634929", "Content": "My mother and I visited this hotel recently and found it charming. Sandrini on reception was so pleasant and helpful, she was full of information and helpful suggestions. Their airport transfer option went smoothly (although the return driver was a bit preoccupied with the football on the radio and dropped us at the wrong terminal on the way back). The room was lovely and they are very efficient changing linen and renewing the freebies daily. This is a small hotel and there was a mixture of business and tourist guests, it has a quiet air. We had no problems with the accommodation at all and tried several of the local places to eat. There is a variety nearby. La Bruchette is worth a go for a rustic lunch, the owner/manager is very entertaining and sang to us. Otherwise we enjoyed La Toscana, via Germanico near the Vatican for the full blown, up market but reasonably priced roman experience (see Rough Guide best 10 near the vatican). From the Pinciana to the Vatican costs around 15 euros by taxi (my mother doesn't walk well) but the buses, trams and metro are cheap and easy. The Via Veneto is really close.", "Date": "February 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great hotel in a great location”", "Author": "Marchant_1981", "ReviewID": "UR94523396", "Content": "A great hotel, we wanted somewhere with a Jacuzzi and Steam Room to relax in after a few days walking round Rome. You book a session in the wellness suite and have it all to yourself. The service and facilities were great. The staff very helpful and spoke good Engish. The rooms are very well presented and beautifully furnished. I've stayed in hotels costing 3 times the price which don't feel as special. I'd place this hotel in a class somewhere between a 4 star (UK standard) and a boutique hotel. Free wifi in the room was handy too, Trip Advisor recommended some great local restaurants.", "Date": "January 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ancona, Italy", "Title": "“Convenient if you travel by car”", "Author": "edna1", "ReviewID": "UR91338550", "Content": "If you are in Rome with a car, I think this hotel is very convenient. The parking is inside the hotel garden and it is free. The hotel is very close to the city center and Via Veneto, so you can leave the car and have a walk.Our room and bathroom were very large and spotless. Staff was very kind and helpful.The only negative point is about some holes I found on the bed linen (old bed bugs?): it was a pity for this hotel.", "Date": "January 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Liked it a lot, a couple of suggestions to make it better”", "Author": "eichm", "ReviewID": "UR89226995", "Content": "Great location, a couple of blocks from Via Veneto. BTW avoid the overpriced restaurants in Veneto and instead give it a try to the Fiorentinan Girarrosto around the corner form the hotel, it looks a little wore down but they have great fiorentinan specialties. Our room was in the 3rd floor, very large an confortable, nice beds and a small terrace which was very handy for smoking. Th bathroon was big with a nice shower, no bath (which I don't need anyway). Th berakfast was average european breakfast with warm beverages, OJ, pastries, breads and cold cuts. THINGS TO IMPROVE: my husband was sick and had to stay one day at the hotel, I wanted to bring him a soup from the supermarket around the corner but ther was no way to heat it. Without room service maybe a microwave in the kitchen would be good. They should stop recomending GREN LINE TOURS for sight seeing, it is horrible (see the reviews).", "Date": "December 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "NY, NY", "Title": "“Nice smaller hotel with lovely rooms”", "Author": "NYTraveler01", "ReviewID": "UR88055668", "Content": "Hotel was a bit smaller than expected, but charming and our room was a good size and nicely appointed. It had a mini-refrigerator, flat screen TV. Marble bath had a tub shower with a large pan shower head. Breakfast buffet had a nice selection and was served in a lovely dining room. Reception staff was cordial and helpful. One thing to point out for future visitors - the lights in the room require you to leave your card key in a slot in the wall by the door. Presumably this is part of an effort to conserve energy, which is good. Only problem is if there is more than one person and one wants to leave and take the key, you leave the other person/people in the dark! Guess you can ask for a second key.", "Date": "November 24, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Menlo Park, California", "Title": "“Bait and Switch”", "Author": "KrisP77", "ReviewID": "UR86798344", "Content": "When I went to check in, there was a \"water line' that broke, and they had no other rooms. They had already booked me into one of their sister hotels but couldn't tell me about the price difference. It was the Hotel Eliseo. Check the reviews on that one. There's a couple other cases of people having been dumped there after their other reservation had issues. Just be careful that don't pull the same thing on you.", "Date": "November 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leawood, Kansas", "Title": "“This is an excellent hotel in a great location with wonderful staff”", "Author": "KentKC1", "ReviewID": "UR85090485", "Content": "We recently spent three nights in Rome at the Villa Pinciana. We could not have been more pleased with the hotel. The hotel is in a quit neighborhood just a short walk (about three blocks) from the famous Via Veneto. The facility is top notch, with roomy, excellently appointed rooms. There are beautifully landscaped gardens surrounding the hotel that provide a great place to relax and have a glass of wine. The staff was very helpful going out of their way to provide directions, restaurant recommendations, etc. Breakfast was superb and a great way to start the day. The hotel was a tranquil oasis after hectic days of sightseeing in Rome. When we return to Rome, we will be staying at the Villa Pinciana.", "Date": "October 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“We relied on Trip Advisor to select our hotel in Rome. Selecting a hotel was not an easy thing to do.”", "Author": "Thecounterscount", "ReviewID": "UR83415296", "Content": "After an extensive search, we decided on this hotel. We understood that the cost would be a bit more pricier than other hotels, but we wanted to be satisfied and have no problems. We asked for a larger room. We got a larger room facing the street. Wonderful to wake up + look out. Bright and airy. We got what we expected. The front desk people we very helpful and always willing to make suggestions. Reservations for dinner were made. Directions were always provided with a happy smile. They really want to please. We asked others about how they chose this hotel. Always the same answer....From the reviews on Trip Advisor. Choosing a hotel in Rome is a difficult task. The hotel location for four days in Rome doing the tourist thing was very ok. Breakfast was fine. We had no complaints at all.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Montreal, Canada", "Title": "“Big rooms, a rarity in Rome”", "Author": "beentheredonethat16", "ReviewID": "UR83377284", "Content": "There are hundreds and hundreds of hotels in Rome. We searched and searched on Trip Advisor. The interesting thing is that when we asked the other guests at the hotel how they picked this particular onel, they all answered because of the comments on Trip Advisor! We were all right in our choice. Our room was very large and the king-size bed was the most comfortable I have ever experienced. However, I think that we might have caught bed bugs, but cannot be 100% sure. As we didn't sleep anywhere else after leaving home, we are kind of suspicious. The room was very clean however. The bathroom is European-style, that is, luxurious but not necessarily practical. There is no counter space, just a little dolly underneath the sink. Also no iron nor ironing board, but there is a hair dryer. The bathroom is large with a bathtub, a rain shower and a telephone shower. There is also a nice-size safe in the room. The location was very good for us, near Via Veneto. We found a short way to walk to the Spanish steps. The breakfast area was very nice, full of typical Italian buffet items. Because of the cool weather, we were unable to enjoy eating outside which was one of the reasons we had picked this hotel. The personnel was very nice and helpful also.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Montreal", "Title": "“I will book this hotel again”", "Author": "Saphora", "ReviewID": "UR82318600", "Content": "It was a *little* tricky to find by car, but we did! It was fantastic to be able to leave the car in their lot, safe and sound! Breakfast was delicious! Mmm Proscuitto...... Served indoors or on the terrace. Of all the hotels I stayed in during my vacation, this bed was the BEST to sleep in! I have bookmarked this hotel to come here again. It may be more expensive, but you see what you are paying for! Clean, quiet, and there is Parking! oh!!!! There is a Hammam and a hot tub downstairs that you can reserve for an hour and you have the whole Spa Area all to yourself!! Two bathroom, PLENTY of towels, clean and Very private! This was SUCH a fantastic way to relax after insane days of walking! PS: Great pizza place one block north (towards the Villa Borghese Park) and to the West. The do Take away pizzas as well! There was even a DeSpar one block to the southwest of the hotel.", "Date": "October 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Stamford, Connecticut", "Title": "“Great Place to Stay”", "Author": "mcatherine14", "ReviewID": "UR80481038", "Content": "Everything was really great here, especially that we were able to park the car right in their lot. The staff was friendly and the room was very comfortable and clean. The breakfast had a great selection and you're able to eat outside. The only bad thing I would say is that they don't tell you that you can't drive around the center on certain hours. Beware of the hidden cameras and tickets if you are driving in Rome! We walked to the Spanish Steps and the Piazza Poppola. It wasn't a short walk but it wasn't bad!", "Date": "September 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Highly Recommended”", "Author": "summer-projects", "ReviewID": "UR78265992", "Content": "We stayed here for the last 4 nights of our trip in August and found it to be absolutely terrific. When we arrived completely overheated from the sweltering sun we were checked in immediately and sent to our room to cool off. Once we were showered and relaxed we returned to pick up our passports and the lady at the front desk gave us tons of information about the neighborhood, hotel, amenities and had even personally annotated a map listing all the various public transportation options and how to get to major cultural attractions. She suggested a fabulous restaurant nearby (not owned by the hotel ) which served authentic food from Abruzzo which was exceptional and had the best service we found in Rome. We found all the staff at the front desk very helpful. When our flight left late at night we were allowed to keep all our luggage at the hotel and have a full day of sight seeing with out lugging around our stuff. Although we stayed in our room until 12-1pm on certain days we were never interrupted or disturbed by housekeeping. The only flaw in service is that the girls in the breakfast room were a little distant and so you really have to assert yourself to get a specialty coffee (there are pitchers of American coffee readily available). The breakfast was great and was available from 7 am to 10:30 so it was never crowded and the patio made for a nice alternative. In a converted Palazzo with only about 25 rooms there is a really intimate and personal feeling to this hotel. Our room, 202 was excellent, high ceilings, spacious, huge windows, tastefully decorated and very quiet. The bath was large and marble with plenty of towels, all sorts of complimentary stuff aside from the normal shampoo and soap including shaving kit, vanity, slippers, toothbrushes and more. It did not have a terrace which might have been nice but honestly it was so hot the last week of August I am not sure we really would have used it. Instead the patio shaded by the trees was really fine for our purposes. The air conditioning worked like a charm which is more than I can say for several places we stayed. We loved the location as it was close enough to walk four or five blocks to Via Veneto, Barberini and the Villa Borghese park without the crowds and it in a quiet residential neighborhood. I think this hotel really deserves its 4 star rating unlike some of the other \"4 stars\" we stayed at in Rome. I would definitely return and would recommend to anyone.", "Date": "September 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Ostend, Belgium", "Title": "“fantastic place great service”", "Author": "fixer912", "ReviewID": "UR76064303", "Content": "A beautifull modern hotel well situated and with impacabel service. Great value for money/", "Date": "August 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wigan, United Kingdom", "Title": "“Excellent hotel, great location, exceptional service.”", "Author": "derby14", "ReviewID": "UR75678939", "Content": "Perfection. Look no further – this is the one to book if you want a wonderful hotel in Rome, which is very comfortable, has a beautiful air conditioned interior, will provide a substantial breakfast and is within walking distance of all the main sights of Rome. The Trevi Fountain, Spanish Steps, Coliseum, Roman Forum, The Parthenon and the Vatican can all be visited on foot from this hotel (a good map – which the hotel will provide – and a good level of fitness will help). For those who prefer to use transport the bus stop is only a couple of streets away and Rome Termini train station is only a 10 - 15 minute walk away. For those travelling into Rome from Ciampino Airport the shuttle bus, costing 4 Euros each way, will drop you at Rome Termini and the train from Fiumicino Airport also stops here. This beautiful hotel is in a quiet street and has a lovely terrace where you can fill up on the extensive breakfast choice before you embark on sightseeing. The breakfast buffet includes, a selection of cereals, fruit – whole and in juice, yogurts, fruit juice, boiled eggs, a selection of ham, cheese and cold meats, toast, bread and rolls, croissants, Danish and sweet pastries, butter and jams, American coffee, a selection of teas and frothy cappuccino on request. The staff are very welcoming and helpful and will book you a taxi, give directions or any help that is needed. We were lucky enough to be upgraded and given the only room on the top floor, room 501, the Borghese Suite. A beautiful suite with adjoining marble bathroom with Jacuzzi bath, and which also had two furnished private terraces on which to enjoy a drink from the mini bar, or just catch the sun whilst admiring the view of Rome. Everything was spotlessly clean and towels were changed daily. Though in a quiet area the hotel is a short stroll from some lovely, reasonably priced restaurants, and the more lively area of Via Veneto is also quite close by, where you can find a selection of shops, more expensive restaurants and the Hard Rock Cafe. This hotel is ideal for the travellers who want to see Rome before joining a cruise ship in Civitavecchia, as trains travel frequently from Rome Termini to Civitavecchia port. The journey takes about 1hr. 15 minutes and costs 4 Euros. (The dock in Civitavecchia is a short walk from Civitavecchia train station). For those with more time in Rome and wanting to spend some time on the beach, the resort of Santa Marinella, one stop before Civitavecchia is a good place to catch the sun. Whatever your reason for visiting Rome this hotel is the perfect place to stay and cannot be recommended highly enough.", "Date": "August 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Excellent hotel but.....”", "Author": "mkurth", "ReviewID": "UR69210834", "Content": "This hotel was excellent overall. It is located in a quiet neighborhood off the Via Veneto. Great restaurants in the area. Easy walk to the Trevi Fountain and Spanish Steps. Service was good. The room was very large and the bathroom was large as well. The breakfast was super with a large selection provided. The outdoor terrace was quiet and an a great place to have an after dinner drink or breakfast in the morning. Having said that I must qualify the but. Prior to going to Rome I was warned of all the scams...the baby, the ring, the gypsies, pickpockets etc. But there were 2 scams that I was not aware of. On our first day in Rome, while walking down the street by our hotel we were stopped by a man in a car asking directions to Milan. We explained that we were from NY and unaware of directions. He proceeded to tell us that he worked for Versace and forgot how to get out of Rome. There was some friendly chitchat about NYC and then he told us that he was going to give us 2 sample leather jackets from Versace. Well, we were taken aback and questioned his motives. He assured us he was on the level and handed the jackets to my husband in a shopping bag. Then he proceeded to tell us that he needed gas money. With this my husband throws the jackets back into the car and tells him to get lost. Who knows what that was all about? The other qualifier was a bit more serious. On my last night in Rome I got a call from a friend in the states at 1am saying that she had just received an email from me asking for $1550 dollars because my bag was stolen in UK and I was stranded. Earlier that day I had used the hotel's computer to send an email to my son about phone trouble I was having. The hotel provided me with a user name and password so I didn't think twice about the security of the computer. When I went back later to check my emails my account was not recognizing my password. I thought it odd but passed it off as a problem with the hotel's computer. Little did I know that sometime between the 2 computer logins someone had stolen my email account. I was frantic and really worried about identity fraud. I spent the next 2 hours calling my banks and credit card companies. Fortunately the damage was limited to people on my contact list being bombarded with this crazy email. Luckily from the way it was written they knew it couldn't have possibly come from me. But it was very upsetting. The hotel staff was not very receptive to what had happened and tried to blow it off. Not the response I wanted. Meanwhile I saw people were still using the computer. At the very least I think they should have it checked or security changed. It was my only complaint but it was a major one.", "Date": "June 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "ohio", "Title": "“Excellent hotel”", "Author": "rgoyal4", "ReviewID": "UR68942133", "Content": "Small hotel with all the big hotel ammenities!! Stayed in quad/suite with two children...age 11 and 13. Spacious room with two beds. Located on top floor, so had 2 private terraces. Staff was very helpful, especially with advice. Breakfast was very good and again, no problems with the children. I would definately stay here again. The location was within a 5 minute walk to the spanish steps and the villa borghese. Trevi fountain within a 10 minute walk.", "Date": "June 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“Boutique hotel with Amazing Staff”", "Author": "littlevino", "ReviewID": "UR65388791", "Content": "I spent a fun-filled weekend with my sister celebrating her birthday and the Villa Pinciana Hotel in Rome certainly delivered. The staff provided kind help and assistance to our every request (even getting us onto a guest list for a packed night club). The helpfulness of the staff was really unbelievable-even down to helping us navigate the bus and subway system! The room we had was spacious and comfortable--the bathroom was quite large and the shower had amazing water pressure. We loved the \"boutique\" feeling of the hotel versus the larger \"corporate\" feeling at other 4-star venues. The hotel provided free internet access and the free breakfast each morning was especially lovely. Sitting outside in the garden with plates of cured meats and cheeses, fruit juices, cappuccinos, and pastries was just the little luxury my sister and I needed to start each day. The hotel is situated near the Borghese Park, but in walking distance to everything we wanted to see. I would certainly stay here again at our next visit!", "Date": "May 26, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Rooms": "4", "Service": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“Lovely hotel that just needs to adjust a few tiny things to earn an \"excellent\" rating”", "Author": "TGoodall", "ReviewID": "UR63417422", "Content": "I stayed here recently with my partner and overall, thought it was a lovely hotel and a blessed relief from the larger, blander hotels (which I generally steer clear of anyway). Beautiful building, lovely greeting by the woman on reception when we arrived, very clean and beautiful room (we were lucky enough to have a terrace), friendly and helpful staff in general and a fantastic breakfast. Oh, and free parking - how incredible in the centre of Rome! However, there are just a few things that I felt would have made a difference, given that this hotel is denoted as Four Star Superior. Firstly, and this is something that too many hotels slip up on, the hairdryer was one of those attached to the wall which looks like the hose of a vacuum cleaner and in no way can be used to style your hair. For many women, this is a potential trip-spoiler - especially in a city like Rome where elegance is called for and you dress up in fabulous frocks when you go out. These hairdryers are not acceptable in my book in any hotel boasting four or more stars. Plastic cups were provided in the mini-bar - again, not befitting this sort of establishment. And where were the robes? Again, I would expect any hotel with four stars or more to offer these. We had a lovely terrace, but there was no wandering out onto it in the morning without having to pull on clothes, rather than just don a robe. And, even if we hadn't had a terrace, I would still expect robes to be provided. The towels - they were large, but of thin material which spoke of a three-star establishment and again, just jarred with the quality of the furnishings and the overall image. We went down to look at the Wellness Area, but would not use the jacuzzi - the water looked far too murky for our liking. Finally, I had a bit of a crisis as I went to iron a top. I asked for an iron to be brought up and was told that there was not a single iron in the hotel. The reason is that in Rome irons apparently present a safety hazard and therefore it is more unusual than usual to find a hotel with an iron. I'm sure there must be ways around this without having to think ahead to use the laundry service. It would be helpful to know about this in advance, as to me it is the most normal thing in the world to expect an iron. I fear this list makes it sound as though I didn't enjoy my stay, and this is not the case. I thought it was a beautiful hotel and I would stay there again. But, the idea of taking my own hairdryer, robe and glasses does make me balk a little. I just want to see this hotel reach its true potential with some small adjustments. Clearly, plenty of money and taste has gone into creating this hotel, and some tiny details are letting it down.", "Date": "May 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Elegant hotel in central location with friendly, efficient & helpful staff”", "Author": "Mary196316", "ReviewID": "UR58730306", "Content": "We stayed in Hotel Villa Pinciana for a weekend in March. The location is central, the hotel is stylish and elegant and the staff were the most friendly, efficient and helpful we had ever encountered. We loved this Rome and this hotel and hope to have the opportunity to return some day.", "Date": "March 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Latvia", "Title": "“Just perfect hotel !”", "Author": "AlinaLatvia", "ReviewID": "UR55816785", "Content": "We liked the hotel very much. It is new, beautifully decorated, clean. The staff was very-very helpful and friendly. It is situated in the splendid district. The bus stop is in 2 min, walk, the underground - 10-15 min., Spanish Steps - 15 min., park- 5 min. There are some good restaurants nearby . Just perfect hotel !", "Date": "February 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Juan, PR", "Title": "“Villa PInciana is a gem in Rome”", "Author": "Sixto_2000", "ReviewID": "UR50474564", "Content": "I stayed in Villa Pinciana hotel from november 27 to november 30 with my wife and a pair of friends from Seville. For us was the 4th time in Rome, last one in Febryrary 2009 and for our friends, was the first time. Staying in Villa Pinciana was a real surprise and a pleasure. We were supposed to stay in hotel Sistina, one of the Leonardi Hotels, that we´ve choosen because of the location, in spite of not so good rerviews in the Trip Advisor. When we arrived to Hotel Sistina, they told us that they had overbooked as many as five rooms, so they offered to us three other hotels to stay. Initially we were reluctant, because we insisted in the excellent location of the Sistina, and in spite of the fact that the first impression of the Sistina was awful. When when we arrived to Hotel Villa Pinciana we felt immediately that really were extremely fortunate for the change. Villa Pinciana is a brand new hohtel, beautifully decorated, that apparently was an ancient house with a patio around the hotel. The personnel at the front desk are friendly, helpful and they solved every single request from all of us. The girl at the front desk when we arrived was called Sandrine, I think, and she was extremely helpful. The hotel is located about two minutes walk from Via Venetto and about ten minutes walk from Piazza Barberini, wherre you can take the Metro to all places. But you can take the bus 52, 53 and 65 to all places too and the bus stop is one minute walk from the hotel. Villa PInciana has a nice Gym, Sauna and Steam bath facilities, internet in your own room, using an ethernet cable that they can lend you. Besides there is a beautiful and cozy parlor where you can sit down and read the newspaper, watch tv or use the internet in a computer that they have there. The rooms are exquisitely decorated too, with enough sockets where you can charge the cellular phone, use your computer and really feel at home. Besides, they have a security box in the room and all details in the bathroom like the shower cap, soap, Q tips, facial tissues, shower jelly and body cream. The room is large enough to feel comfortable and besides has a nice LCD tv. No English or Spanish speaking channels. The bathroom has enough towels, so that you feel comfortable. The breakfast is really the highlight of all the beautiful and magnificent details of this hotel. The breakfast is very complete and the two persons in charge are elegantly dressed and they are friendly and very very helpful to all requests. As a matter of fact one of our friends wanted to take the breakfast to the room for her husband and the attendant in the breakfast room had the detail to bring a tray,wrapped with a napkin and everything well presented. They offer coffe, including expresso or american coffe, hot chocolate, two different juices (pineapple and orange), different cold cuts, croissants, and other hot pastries, all of them delicious. Also boiled eggs, a large variety of cereals, fruit cocktial, peachs in syrup, yogurts, breads (all kinds), jelly, butter and really all that you need to start your visit in the beautiful Rome. Very close to the hotel there are different places to have a beer, coffe or lunch and dinner. Our best buy was a restaurant -Il Pomodorino- that is open until late. The service is good and the menu is varied and excellent. They also have a special menu for each day. One day one of us ate Pasta and clams and although slightly spicy, was delicious. In our last night I ate Pasta with shrimps and antichokes. Really delicious. In general all that we ate in Il Pomodorino was good and reasonably priced. In Febryary 2009, my wife and myself stayed in the Domus Romana hotel in Via Quattro Fontana and I wrote a review in Tripadvisor for the Domus Romana, but although my review for the Domus Romana was good, Villa Pinciana is superb. If I would return to Rome, definitely I would return to Villa Pinciana because it is beautiful, exquisitely decorated, the personnel is excellent, all details are outstanding and in general because it is a real gem in Rome.", "Date": "December 2, 2009"}], "HotelInfo": {"Name": "Hotel Villa Pinciana", "HotelURL": "/ShowUserReviews-g187791-d1490240-Reviews-Hotel_Villa_Pinciana-Rome_Lazio.html", "Price": "$177 - $379*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Abruzzi, 11</span>, <span class=\"locality\"><span property=\"v:postal-code\">00187</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "1490240", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/b2/06/21/esterno.jpg"}}