{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hitchin", "Title": "“Great hotel, great location”", "Author": "EmmaWaters", "ReviewID": "UR127916465", "Content": "I stayed here from 4-7th April 2012 with my husband. Lovely hotel, great room - very modern and huge bed! Nice modern bathroom with a lovely shower too. Friendly and helpful staff and we enjoyed a few cocktails in the cocktail lounge too. The breakfast was tasty - lots of fruit, cold meats, croissants etc and then option to have a cooked meal from the kitchen. We had a lovely view of the busy streets from our balcony and found that the noise was minimal. I'd stay here again because of the great location, clean and comfortable rooms, and definitely recommend it.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“great hotel in superb location”", "Author": "colennis", "ReviewID": "UR127764222", "Content": "overall couldn't have asked for more from hotel, it was clean, rooms are nice, location is great, the staff where particularly friendly, from check in to check out they were polite , professional and gave great advice on a query a had about a particular train service. I couldn't fault it at all", "Date": "April 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Perfect location”", "Author": "lulapin", "ReviewID": "UR127675916", "Content": "Modern hotel in the best part of BCN. We stayed in a small interior room and it was very good except for the view of course but it was worth it.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Funchal", "Title": "“Good hotel well located”", "Author": "Nuno_1969", "ReviewID": "UR127664879", "Content": "Been there from the 25th March to the 29th March 2012. Hotel very well located. Nice room, a bit noisy. Cleaning should be really looked at as the room was not very clean. Proper vacuum cleaning the carpet needed!!!! Some dust on shelfs, shower hanger was broken and no one went there to replace it. For the price payed (€550 4 nigths) these are details that have to be looked at! Also our room #405 starting to need some overall maintenance. Very nice decoration overall! Great king size bed! The personal was nice and helpful. Did not had breakfast at the hotel, €18 per person... I would stay there again.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Modern but not at all Practical”", "Author": "SableRostron", "ReviewID": "UR126979213", "Content": "Have recently returned from a 4 day stay at this hotel (Room 406). Reviews were mixed for this hotel but this hotel was the best we could afford and seemed to be one of the few that had comfortable beds which is a must for me! At 130/140 euros a night though it didn't come cheap but then it is a 4 star hotel on one of the most expensive streets in Barcelona. Positives: In an ideal location for exploring Barcelona - very nice cafe 2 doors down Caffe de Francesco which I highly recommend for wonderful coffee and magdalenas Very comfortable bed and pillows Negatives: Unfortunately they have thought only of the modern aspects and not though about the practical aspects - wooden flooring in the communal areas meant when people came back late at night you could hear the clunking of the shoes on the floor - especially bad were the high heel wearers! This meant that I never got a good night's sleep at all whilst at this hotel. To run a bath you had to get right into the bath to access the taps as there was a massive sink unit and shower screen in the way. Bath was a porcelain bath - extremely slippy and I had to have my husband help me out of it - this would be no good for older people - to be honest is an accident waiting to happen! The bathroom doesn't have a proper door - sliding doors so not very private when somebody is in there and in the bedroom the door is a mirror/door that you slide across - this doesn't block any noise out at night from the corridors! Lighting - very annoying - you can dim it and turn it up but it doesn't go that high so putting on make up etc is very difficult in the morning. Only a small desk provided - not much storage space at all and the few hangers in the wardrobe leave a lot to be desired - we had to place our cloths on the small sofa near the window as there was no room for them! Tea and coffee facilities provided but these are charged for! Breakfast 18.50 euro each per day - absolutely unbelievable - we went out for breakfast every day - 2 coffees and 2 croissants = 8 euros total. On our last night we discovered on returning to our hotel that our room had ants in it - my husband immediately went to the desk to report this and somebody did attend the room - he said to my husband that the maids had told them about this in the morning but they hadn't bothered to do anything about it and we were not made aware of it so by the evening it had gotten bad! On checking out no mention of the ants and we weren't even asked if we had had a good stay. Overall I was very disappointed with this hotel - I wouldn't recommend this hotel to friends and family and wouldn't stay again.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“10-rated hotel in Barcelona”", "Author": "Vladimir_from_Moscow", "ReviewID": "UR126757121", "Content": "We've spent lovely 3 days at SixtyTwo Hotel with my wife and it was one of the best experiences we've ever had. Only facts (as they arise upon arrival): 1. If you arrive to Barcelona airport, take a train, exit at Passeig de Gracia, 10 steps more and you are at the entrance of the hotel. It takes you 3.60 euro and around 25 minutes. 2. We took executive double room and it was right decision, because it faces Passeig de Gracia, beautiful street with nice view. A sea to the left, mountains to the right, old and at the same time modern Barcelona in front. There is a nice balcony, from which you can enjoy the view. 3. The room itself is modern and everything is brand new there. It's not huge, but enough for everything you need, if you don't expect it to be junior suite. 4. The bathroom is also great - all the technics works perfectly, the water pressure and temperature regulations work, like you are at home, without any problems. There is a big shower cabin (about 1m x 0.8m), a bath and a toilet. 5. A couple of words about lightning system. It is operated via smart-home system. Very easy to use, and what is really amazing is that you can create very chill-out atmosphere in the room dimming the lights. 6. If you book from the hotel's site, you can also book a bottle of Champaigne, which will be ready by your visit. Add this to chill-out atmosphere from previous point and you can really relax. 7. During the night the sound insolation is great - the noise on the street is quite high, but if you close the windows, it becomes very quiet in the room. Not a recording studio, but absolutely enough to feel relaxed. 8. The breakfasts are far better, than in standard hotels. You have different types of yogurts, meats, cheeses, cakes etc plus you can order one of 4 types of dishes from the kitchen. 3 of them are different tasty omelettes plus smoked salmon with Mascarpone and other stuff... 9. The hotel is also perfectly situated in the city. Passeig de Gracia has all the high brands shops one can imagine, it is 5 minutes walk from Rambla and other central (tourist of course) places. 10. Wifi is quite fast and free. It was possible to chat over Facetime, so good enough. The only thing I missed was a table for working, which is a norm at business hotels. But this hotel is definitely much more for relax and having fun, than for work. 11. For the stuff. Usually one can read, that 'the stuff was very helpful\" etc. I can't say anything regarding this - we didn't have any problems and so didn't need any help. The check in and out took a couple of minutes, the guys at restauraunt during breakfast also were fast and positive. As a sum-up - if you are looking for a good mood, good impressions and high quality service, I would really recommend this hotel.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Triumph of design over comfort”", "Author": "Sandra Levine", "ReviewID": "UR126681523", "Content": "The pros: location, location, location comfortable bed big, clean bathroom The cons: No comfortable chair, only a desk chair placed in a corner away from a laptop computer desk that was also used as a coffee-making station, etc. Inadequate space for clothing for a stay of longer than a couple of days. There were some small built-in shelves in the closet, but I had to use the safe as an additional drawer. Weird half hangers in the closet and not enough of those. The norm is one facecloth, despite the fact that two people were registered for the room. After requesting another from management, on some days we received an extra one. Zombie-like service at reception desk. My husband's wallet was pickpocketed in the metro. We asked for new room keycards, which we received, but not even with a comment along the lines of, \"That's too bad,\" or, \"I'm sorry you had that experience.\" We checked out the night before, without any comment from the desk, nor was there any comment when we left the next morning, like, \"I hope you had a nice stay.\" We had been there for eight nights. Don't these people know that they are in the \"hospitality\" business. I don't expect genuine hospitality in a hotel, but aren't they supposed to create the illusion of it? The hotel was nowhere near full during the week we were there. In other cases where we've had a similar situation, we were upgraded, but not here. When we asked for more hangers and another facecloth, we got strange looks, as if these were peculiar requests. I understand that part of this attitude is a display of hipness, considering the hotel, but older, seasoned travelers may want to look elsewhere. Pro and con: minimalist design, to a fault", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Chic, comfortable and central”", "Author": "Lochlady", "ReviewID": "UR126635913", "Content": "This modern hotel is on the Passeig de Gràcia in Barcelona, and could hardly be more convenient for sightseeing and shopping. Our room was spacious and comfortable, and although our room was at the front of the hotel, overlooking the a main thoroughfare, there was very little noise and we slept soundly. The style is minimalist, but everything necessary is provided, including an iPod dock and free Wifi. We didn't have breakfast, so I can't comment on that, but everything else was excellent. The staff were welcoming and helpful, service was efficient and the location of the hotel was perfect.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wiltshire", "Title": "“Excellent hotel, very enjoyable stay though not 100% perfect.”", "Author": "BoxTravellers", "ReviewID": "UR125470438", "Content": "We visited Hotel 62 last September for a 4-night break with friends who were celebrating their wedding anniversary. Overall, the experience was a very positive one and we had a most enjoyable stay. The location was perfect - right on the main shopping street; very convenient for transport, access to the main sights and for shopping and pavement cafes without being too noisy. We were between two fabulous Gaudi buildings and walking distance from the Ramblas and the port (a longer walk, this one), with buses and taxis available right outside. The hotel itself was beautifully decorated, new and contemporary in style, although perhaps trying to be a bit too clever - the lighting in the bedrooms was far too complicated, the blinds so bleeding edge that they weren't reliable and no curtains to keep out the street lights when they didn't work. The bed was very comfortable and the balcony overlooking the main street a nice bonus. The bathroom in our room was large, with bath and separate shower cubicle. Toiletries, mini-bar, tea and coffee suppliers were all replenished daily. Our friends' room was at the back of the hotel, overlooking an interior courtyard - not such an attractive outlook but the room itself seemed larger - there was more seating within the room. The bathroom was slightly smaller. Nonetheless an attractive and comfortable room. Breakfasts were excellent - buffet style in a club-type room on the first floor - with very fresh produce and a wide range. The same room was used in the evening as a lounge, and with laptops available for internet access. I understand that the hotel now offers free wifi too. There was also an honesty bar, which was a very nice touch - just a pity the reception desk didn't have the same prices as were displayed on the bar when it came to paying the bill, but this was quickly sorted out with no fuss. The staff individually were generally very helpful and good natured both before our arrival and during our stay. We were really happy with the restaurant recommendations and bookings were made for us for restaurants and taxis with no fuss. The only criticism I would have would be over attention to detail, and handover between shifts. As it was our friends; wedding anniversary I wanted to arrange a treat for them in advance. The hotel had offered a bottle of Cava during an email conversation so I arranged for some flowers to be delivered and put in their room. On our arrival, the flowers were there but no sign of the Cava, even after 24 hours. However, after a gentle reminder the Cava was delivered, accompanying by some delicious chocolates and a delightful message left on the mirror! The most significant issue we had was with our room - on arrival neither the blinds nor the safe worked. Because of an absence of proper handover between shifts it too until the third day and several reminders to get moved (the problem with the blinds was not easily solved). Eventually, after first offering us a pokey corner room which we refused, we were begrudgingly upgraded as there were no other rooms equivalent to our original one available. Credit has to go to Hakim, who, unlike the receptionist on duty at the time, knew how to handle this kind of situation, moved our luggage for us, made sure we were happily settled and offered us a complimentary bottle of wine in recognition of the upheaval. Things do go wrong with equipment, that is understood - I only really have two complaints about this issue - there appeared to be no handover between shifts and we started from scratch each morning; and one member of the reception staff didn't appear to want to offer any alternatives when they found the problem with the blind was going to take some time to solve. I gather from the hotel management that they have looked at the handover process to address this issue - I am impressed that they took the trouble to email me after our visit in response to the feedback I left when we returned home. In summary, we had a lovely stay at the hotel; we were very happy with almost everything and I would have no hesitation in returning, or in recommending it to others. I also think it's good value for money. Indeed, I have booked clients into the hotel for their wedding anniversary in March 2012, prior to their departure on a cruise from Barcelona port, and I know they will be as satisfied as we were. And we will definitely return. Kit Williams Silver Compass", "Date": "March 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Amsterdam/Salt Lake City", "Title": "“Nice hotel, cool design but lacks some amenities”", "Author": "PC_expat_in_AMS", "ReviewID": "UR125168035", "Content": "The hotel has a convenient location, the service is good, and the rooms are clean and comfortable. However, there is no hotel restaurant, bar to speak of, and the common areas are sparse. However, the staff are attentive and very good. The rooms are trendy, comfortable and clean. Book directly with the hotel to get the best rates (lesson learned).", "Date": "February 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Very pleasant - but a bit boring....”", "Author": "ChiswickChas", "ReviewID": "UR125047497", "Content": "Style over substance - but excellent location covers lack of facilities. Very comfortable beds, great bathrooms, could have done with a proper desk. Room lighting controls drove us all nuts - you really need to read the manual to work it out. You can't have the reading light on without having at least some of the ceiling lights on too....how dimwitted is that? Watch out for stubbed toes on the bl**dy bed legs - especially if you haven't worked the lights out....!", "Date": "February 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hayward, California", "Title": "“Feb in Barcelona”", "Author": "MackStWgns", "ReviewID": "UR124772482", "Content": "i stayed in the Sixtytwo hotel in early Feb 2012 on a short 3 day business trip. The Hotel is right on Passeig de Gracia, so you are right in the hot spot of Barcelona. The entrance is a bit hard to see, its just a couple of banners mounted high up above the beautiful big entry door. his hotel seems to be a converted apartment building, as the lobby is just a small entryway with a hotel desk and some settee's. Overall Sixtytwo Hotel is very nice, it was clean and neat. The refurbishment that converted this from an apartment building into a hotel was done very well. The rooms are about standard size, with nice modern European bathrooms. The room furniture is minimalistic and modern, but very nice. The room could have used a desk, and I believe they will be working to add this. There was an espresso machine on a small table with a small selection of espresso and tea. The mini bar refrigerator was hidden in the closet, which is hiding behind the huge sliding mirror. Could have used some more shirt/coat hangers. The breakfast buffet was served in the bar area on the second floor. A small but good selection of local cold meats and cheese, with some fresh breads, a little fruit, juice, and coffee, some deserts. You could also order an omelet. I ordered room service for lunch and they did not have the ingredients for the salad, and so I had a club sandwich instead. the sandwich was OK, but not great. Have the club sandwich at the OMM Hotel, 3 blocks away for a great club sandwich.", "Date": "February 18, 2012"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cantu, Italy", "Title": "“great in the city center, will return”", "Author": "tycommercial", "ReviewID": "UR124640309", "Content": "Ideally situated in the center, at the airport you catch the train and get out right by the hotel for a fare of 3.50 euros. Perfect if you like shopping and tapas, visiting sagrada familia and the ramblas. The room was clean,quiet and stylish, the bedding comfortable, even the toothbrush was already there. I appreciated the modern lights with a dimmer but did not use any of the services like breakfast, which sounded quite expensive. I carefully avoided the porter who wanted to explain me how \"the room worked, I guess for a tip.", "Date": "February 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Good hotel, nice for walking into town.”", "Author": "Dizzeem", "ReviewID": "UR124463840", "Content": "This hotel was pretty good. We stayed here for 2 nights in August 2011 before a cruise. The room was very clean, linen were fresh and we had inside view of the 'garden' which wasn't really that exciting. It didn't really matter as Barcelona is what we came to see. The bathroom was spacious and clean also. The room had a nice clock to connect an iPod and a Bang Olufsen television (I dont know what the fuss is about with Bang Olufsen, the TV quality, remote was poor). The room had a nook with a nice sofa for relaxing/reading. The staff at the front desk were friendly, always acknowledging when I was coming or going. I didn't really need to interact with them beyond that. This hotel allows you to start every day off with a nice walk, 20 mins to the top of Las Ramblas, 40 minutes to the piers. 45 minutes to 1 hour for Sagrada Familia. You do NOT have to walk to these locations as there is a metro station on the corner where the hotel is. We walked to most places and caught the train back. There is also a Gaudi house visible from the entrance to the hotel, 5 mins walk. We didn't eat in the hotel and I got the impression that Spaniards don't do a hot breakfast. There are lots of nice places to eat in general though as you walk towards the city centre and a McDonalds 5 mins away (no hot breakfast menu when I went)...good for a coffee fix. I couldn't find a local place for bottled water and snacks but this seems like Barcelona in general, not many stores/kiosks in tourist areas like I am use to so I ended up having to walk to the department store 20 minutes away for snacks and drinks before it closed. All of the quick buy tourist stands were already closed after 9. I would stay here again if I couldn't find another place.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stafford, Virginia", "Title": "“Amazing!!!”", "Author": "AFwife87", "ReviewID": "UR124125068", "Content": "We stayed here for two nights pre cruise in October. The hotel was amazing. We arrived at 10:00am after taking the RENFE train from the airport. The train/metro stop is directly in front of the hotel. Our room wasn't ready (didn't really expect it to be) so we freshened up in the lounge area, checked email on the hotel computers and grabbed breakfast at the restaurant next to hotel. Decided to do the HOHO bus that is also located almost right in front of the hotel. Headed to La Rita's for lunch (wonderful, local restaurant not to be missed very close to hotel) and then went to see if our room was ready. The only small complaint I had with this hotel was we had asked for a room overlooking the street and were put in a room in the back of the hotel looking out over a small court yard and apartment buildings. Our room was a nice size and very clean. The bathroom was well appointed and quite spacious. We never had any issues with noise. The room was extremely clean and maid service was always prompt. The bed was extremely comfortable and nice and large. There was an honor bar where there was always beer, wine and other assorted drinks available. There was a very nice breakfast available, but we never tried it. It was a bit on the expensive side and there are several places to eat 100 feet out the front door that were more reasonable. The front desk staff was always pleasant and always willing to help. If I was ever lucky enough to go back to Barcelona, I would not hesitate to stay here!", "Date": "February 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Very nice place”", "Author": "Rockwork", "ReviewID": "UR123098574", "Content": "Very good breakfast. Nice design. Perfect location for sightseeing and shopping. Plenty of nice restaurants at walking distance.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Bainbridge Island, Washington", "Title": "“Excellent Location, Great Service”", "Author": "PhelpsRoad", "ReviewID": "UR122973364", "Content": "SixtyTwo Hotel is an excellent choice if you are planning a trip to Barcelona in the near future. The staff is friendly and very helpful, the rooms are large for a European hotel, and it is located in the heart of the Passeig de Gracia. The hotel is directly outside of the Passeig de Gracia train station from the airport, so we didn't have to spend time looking for the hotel in a city we were unfamiliar with, when we were tired and jet lagged. It is also centrally located so walking to the various neighborhoods is not an issue. There is also the metro right outside the door for longer excursions. We stayed for 8 days and because of this, the staff was very kind and offered us a nice room facing the street. I highly recommend the SixtyTwo if you are planning a trip to Barcelona anytime soon.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Good location for sightseeing, but hotel is all about nickel-and-diming!”", "Author": "bostongal19", "ReviewID": "UR121798961", "Content": "My fiance and I stayed at Hotel SixtyTwo for two nights as part of a four-night/five-day trip to Barcelona. His work required us to stay at a different hotel for the second half of our trip (Barcelo Sants). I booked Hotel SixtyTwo based largely on the recommendations/reviews found on TripAdvisor, and I must admit that I found them a bit misleading. The hotel's location is, by far, its best selling point. It's located equidistant between Casa Mila and Casa Batllo, and only about a fifteen-minute walk from Sagrada Familia. Lots of designer, high-end shopping on Passeig de Gracia as is the subway/underground stop if you wish to explore other neighborhoods. We were in Room 210, all the way at the end of the hallway on the second floor. In our days at the hotel, we did not run into a single other guest at the hotel. Though December is not high season for travel to Barcelona, we was a bit surprised. Our room was as pictures indicate -- low, platform king bed with a couch annexed off with tall windows, a closet hidden by a heavy mirrored door. The safe and minibar refrigerator is inside the closet; please note the safe is VERY small (too small to fit my iPad -- had to carry it the entire time in my purse). The TV is, also, quite small (23\"?), and, as we discovered on this trip, the channels for foreigners are limited as there are only four English language channels (CNN, Fox News, MSNBC, BBC News). On demand television is a pipe dream! As I noted in the title of this review, the hotel nickels-and-dimes you for everything. Wireless internet for 24 hours is 12 euros (free at our other hotel), each bottle of water is 3 euros, even the espresso pods for the Nespresso machine in the hotel room cost 1.5 euros each. I have never stayed at a hotel that charged to use a coffeemaker/espresso machine in individual rooms. Never. We had credit from Hotels.com for a free night that made the cost of our two-night stay very affordable ($230 total instead of $400+). Without that credit, the hotel most definitely would not have been worth the price indicated. The location was convenient for exploring the city, but there were not other advantages that warrant the cost. We would not recommend the hotel to family or friends traveling to Barcelona, and should we return to Barcelona for a leisure trip in the future, I would book a major brand hotel (Mandarin Oriental, Ritz, etc) for that stay. I imagine it would be more comfortable!", "Date": "December 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami Beach, Florida", "Title": "“Extremely nice hotel, very accomidating”", "Author": "ThegoodmanKyle", "ReviewID": "UR121081127", "Content": "We had a great experience at Hotel Sixtytwo. We stayed for 5 nights near the end of Nov 2011 and we had a great time. The hotel and rooms are very accessible, very clean, and the decoration is very inviting. The bed was a california king and very comfortable. We were on the first floor and if not for the rainy weather, I am sure the courtyard area would have been very nice. The location is great if you are in barcelona to shop or if you intend on using the metro a lot. The staff was very helpful with all of our needs. I had made a mistake when making the reservation and accidentally selected 4 nights instead of 5. We didn't notice this during check in. After the 4th night we were scheduled to check out (which we were unaware of) and arrived in the evening and our keys didn't work. We asked the front desk about it and they said they were expecting us to check out. We explained that we had mistakenly thought we were scheduled for 5 nights. They instantly renewed us for 1 additional night at the same rate. The entire exchange/mixup took less than 10 mins to resolve. I was a bit embarrassed about the mistake but they were more than happy to accommodate us. I was pleasantly shocked at how professionally and quickly things were worked out and I could not be happier with the result. The only 'issue' I would have is the cost. We received the 50% discount via a TripAdvisor coupon, but without this coupon I do not believe the hotel would have been a good value. We paid €146 a night which I thought was a very good value, but over €200 would have just made it expensive.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Extremely nice for the second time!”", "Author": "Mikaela W", "ReviewID": "UR120832658", "Content": "This hotel has a perfect location, nice design and suberb room service. It's clean and the staff is always very helpful. Taxis stands by just outside 24/7 and it is close to walk to almost everything in the Barcelona center. The breakfast is not included but if you eat there the buffet is awesome. The hotel has an \"Honesty bar\" if you get tired of room service. This was my second time here and it will definitely be a third.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“Amazing!!”", "Author": "Ashleigh1605", "ReviewID": "UR120826447", "Content": "Had a fantastic stay at Hotel SixtyTwo in October this year. This was my first trip to Barcelona and loved the city and would definitely love stay here again. The hotel staff were very friendly and helpful as this was our first time in the city we had lots of questions to ask. I even left my iphone in the hotel and this was posted straight back out to me after my stay :) The hotel is so modern and we loved the decor and the style of our room. The rooms were spotless, and a great size. We had a balcony looking out onto the Passeig de Gracia with great views. The location of the hotel was perfect for us as we needed to be central with easy access to public transport to get around and we certainly got this. The metro station was right outside the hotel and also the tourist buses stopped on the Passeig de Gracia so we hopped on and off as we pleased. We will return to this hotel at the next opportunity we get, and recommend this for couples travelling to Barcelona for a special weekend.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Wonderful boutique hotel”", "Author": "twofoodies02", "ReviewID": "UR120749287", "Content": "My husband and I stayed at the SixtyTwo Hotel in Barcelona for 5 nights. The location is wonderful. Close to great shopping, restaurants and tourist attractions. The hotel is modern, clean and the staff were very helpful. We would definitely recommend this hotel and have passed on this information to our travel agent as well.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Porto Alegre, RS", "Title": "“Very nice boutique hotel”", "Author": "carlos l", "ReviewID": "UR120718753", "Content": "We spent 4 days and more 2 days at the SixtyTwo. Staff very friendly and helpful. Great location, near of a lot good restaurants and tapas. Moderns and stylish room and bathroom. We like much the breakfast an the Honesty bar.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dallas", "Title": "“A good value on a cool place”", "Author": "McWowser", "ReviewID": "UR120706482", "Content": "Very cool & creative stark modern design. Very well maintained. Large spacious rooms with plenty of amenities and features. Good location. In a very clean and safe part of town on a major thouroughfare. Not too far from Las Ramblas, the long walkway famous for it's sidewalk cafes, kiosks, street vendors, artists, shops, & outdoor street entertainment. Competent staff who was very willing to be helpful. They spoke and understood English. Would definitely recommend or stay there again.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Pasig, Philippines", "Title": "“Good hotel but....”", "Author": "flipavocat", "ReviewID": "UR120695519", "Content": "We stayed in SixtyTwo Hotel twice during our recent trip to Spain (we arrived and left via Barcelona) and had two different impressions of the property. We arrived at a sleek and modern boutique hotel located in what is one of the best areas in Barcelona. The hotel is very accessible, with the Passeig de Gracia metro/train station on the corner, a taxi stand right in front and a hop-on-hop-off tourist bus stop a short walk away. Our room was simply great as we were given a well-designed room with a balcony overlooking Passeig de Gracia. The hotel staff, while seemingly indifferent at times, were actually quite pleasant and helpful when queried or asked for assistance. We left feeling mighty glad that we had also booked the same hotel when we return after two weeks to Barcelona for our flight home. Our second stay was a somewhat different experience. Same hotel, same staff, but a visibly smaller room at the back of the building. We had requested, and had actually been looking forward to the same or a similar balcony room as that given to us during our first stay considering that we were \"return customers\" so to speak, but unfortunately, this was not to be. The hotel management may have had its reasons for this (we were told that they were fully booked and that the rooms with balconies were not available) but our second stay was a real letdown. All things taken into account, the hotel isn't at all bad and we will consider staying there again if in Barcelona.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jalalabad, Afghanistan", "Title": "“October”", "Author": "Motakuto", "ReviewID": "UR120689762", "Content": "I spent 5 days at the SixtyTwo. Great location and very nice rooms. Staff friendly and availbale to help. Gorgeous breakfast. Only shortcoming is that the wi-fi is not free. Strongly reccomend this Hotel", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great boutique hotel in brilliant location”", "Author": "RickyKGee", "ReviewID": "UR120246909", "Content": "We were very pleased with our choice of hotel. It is located on one of the nicest main streets almost opposite Cassa Batllo and just up the street from La Pedrera. Station linked to Airport less than 100m from hotel door. Rooms very modern and stylish. Beds comfortable. Bathroom spacious. Would definitely stay there again.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, IL, USA", "Title": "“Great option in Barcelona”", "Author": "ChicagoAlli", "ReviewID": "UR120180519", "Content": "I agree with the majority of positive reviews on this hotel. The location is close to the metro as well as a bevy of restaurants and sights. Room was comfortable and spacious. My favorite aspect was the wine tasting on Friday afternoons--a nice different touch. Would definitely stay here again if traveling back to Barcelona.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Budapest", "Title": "“Superb hotel”", "Author": "Andrew S", "ReviewID": "UR120081699", "Content": "After trying many hotels in Barcelona i have finally found one that ticks all the right boxes. Location is fantastic with just a 10 minute stroll to the rambles. staff are excellent, friendly, knowledgable and very willing. nothing too much trouble. Had a great room with a terrace. No need for me to look elsewhere to stay when in barca again. Great for business and leisure.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Doha, Qatar", "Title": "“excellent hotel”", "Author": "jaymmy", "ReviewID": "UR119883519", "Content": "excellent choice for this hotel. good service, staff are so friendly. rooms are modern,big, clean and well equipped. Bed was very comfortable. the location was also very good. close to restaurants, metro and shopping malls. It's also a walking distance to ramblas. we will recommend it to all our friends and we will stay there when we go next time.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mississauga, Canada", "Title": "“Great value for this location”", "Author": "Lilac15", "ReviewID": "UR119789760", "Content": "We stayed for 3 nights post cruise at the end of September in this hotel; we were very pleased when we received a room with walk out to a nice patio. the room is very modern but comfortable. We had problems closing the safe, called the front desk and in 2 minutes someone was upstairs to check it out (it was us not the safe). The concierge was very helpful with directions, giving us maps and recommendations. The location is the best. We will definetely come back and will recommend it to everybody.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "singapore", "Title": "“Stay Here - It's worth every penny!!!”", "Author": "archman4", "ReviewID": "UR119572549", "Content": "Central location (right in the heart of L'Example), excellent rooms and amenities, very helpful and friendly staff...what more do you want? :) I'll stay here everytime I visit Barca.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Beja, Portugal", "Title": "“Amazing...”", "Author": "Martarochaparis", "ReviewID": "UR119496152", "Content": "Very good hotel, with a great location, near public transport and city center. The staff were very nice, helpful and polite. We had a problem with our room, and they made us an Up grade to the suite for Two nights. I allready have recommended it to my friends and will return if i need to go again to Barcelona.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Holland", "Title": "“Very good hotel in een fantastic city of Barcelona.”", "Author": "The D", "ReviewID": "UR119491224", "Content": "We did have een very nice and awesome stay in Barcelona. Hotel Sixtytwo was een good choice. Perfect location in distance to the cityr centre. Less than 10 minutes walk to Placa Catalunya and La Rambla. Great shops in the near area. The hotel was well designed with very clean rooms with airco. We stay in a privilege room with een modern bathroom. Only the electric sunscreens did not work. The staff was very friendly en helpful. The breakfast was excellent. We recommand this hotel.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hertford, United Kingdom", "Title": "“Awesome.....!”", "Author": "michael w", "ReviewID": "UR119457738", "Content": "The room and bathroom were outstanding. Fantastic location - great shopping on the doorstep and very easy walking distance to the city centre. Public transport also great from here- bus stops/metro/trains/taxis all outside the door. The staff were polite, friendly and helpful. Would thoroughly recommend this hotel - but have a good look at the pricelist for drinks in the bar before ordering........!", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bethesda, Maryland", "Title": "“Hotel SixtyTwo worth a return visit”", "Author": "bhmmhm", "ReviewID": "UR119157794", "Content": "We were here three nights, 9/16-19, and thoroughly enjoyed our stay. The room, bath (particularly the walk-in shower) and public rooms were excellent, reflecting Barcelona's hotel movement's outstanding minimalist style. The buffet breakfast was outstanding, a real bargain with the benefit of the two-for-one breakfast coupon available through the hotel's TripAdvisor reservation option. The young staff at the front desk, and in the breakfast service, were friendly and helpful. We had debated which, among several hotels, in the area to stay at , and are enthusiastic that this was the right choice..", "Date": "October 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kfar Saba, Israel", "Title": "“Smartly designed Good Service”", "Author": "Heart7", "ReviewID": "UR119102832", "Content": "We stayed at the hotel for 4 nights. the location was perfect to us, as we did not want to stay too close to the husle of the Ramble and Catalunia Sq. the Paseig de Garcia was perfect as it is a very nice wide upscale street and at the same time the hotel is 13 minutes walk to Catalunia Sq. (if you take the \"by the day\" metro card, you might as well take the metro from Catalunya Sq.) plus metro station of many lines right at the front of the hotel. but note that the metro station is very big and for some of the lines there is a long walk underground. also across the street from the hotel is Goudi's Casa Batallo and a few streets away is the Goudi's Casa Milla and that is convenient if you plan to visit those. we did not try the breakfast since we found the price way too high (E 18.50 pp) and found nice cafes around for coffee and pastry for around 3 Euro. The bed mattress in the room we stayed in was nothing less than PERFECT for us. The room is very specious and we loved its modern smart design. The room was clean and the AC worked perfectly. note that the safe was not big enough for a laptop or ipad and we had to leave ours at the room (but it was still there when we got back...). maintenance was OK but not brilliant - did not fill in shampoo and staff, and also \"forgot\" to clean our room one day. we also thought that lack of the \"clean up/ do not disturb\" sign was unfortunate. but still we thought the hotel is excellent and most of the staff are very patient and attentive, we got a great help from the front desk, directions, recommendations etc. and to our experience it was an advantage to have a small hotel, smartly designed with good location.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Bliss”", "Author": "MooandJu", "ReviewID": "UR118991481", "Content": "A fantastically well thought out hotel, with little or nothing missed in maximising the enjoyment of staying here. The rooftop suite that we stayed in was pure bliss. The room was so well thought out and offered so much enjoyment... it was impossible not to feel truly romantic here. The only minor point against the room was the electric shutters / curtains, that only offered two functions... up or down. And when down, you couldn't access the terrace!", "Date": "October 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“City trip to Barcelona”", "Author": "Belgiantraveller772", "ReviewID": "UR118941065", "Content": "Found the hotel room lovely and clean. Very quiet with the double glazing even though it was on the Passeig de Gracia. Great location! Will be back!", "Date": "October 4, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Lincoln, United Kingdom", "Title": "“location, location, location”", "Author": "macandjudy", "ReviewID": "UR118220652", "Content": "Fantastic hotel in a fantastic location. The rooms are gorgeous and so is the breakfast. Only a few hundred yards from \"Las Ramblas\" and right in the heart of the city. A metro station is immediately outside the hotel door. Will go again without hesitation.", "Date": "September 17, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Shanghai", "Title": "“in the mist of it all”", "Author": "MWShanghai", "ReviewID": "UR118034324", "Content": "looking at Gaudi's vision from the terrace, next to the subway and walking distance to so much. Modern minimalist room, beautiful!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bethesda, Maryland", "Title": "“Perfectly situated and great staff.”", "Author": "PKatz59", "ReviewID": "UR117947549", "Content": "Great location, and not just for shopping, but for walking or taking the subway to other parts of the city. Rooms are modern in decor, but no over the top; clearly the hip quotient is high. That includes the staff, all of whom were pleasant and helpful. Not an inexpensive hotel, but certainly not an expensive one, it's well priced for Barcelona and what you get.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "St. Petersburg, Russia", "Title": "“A very nice hotel in an excellent location”", "Author": "Plateresca", "ReviewID": "UR117928333", "Content": "A very good, comfortable hotel in the very centre, with a great sound isolation (this is important), amiable staff - well, really good :)", "Date": "September 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Palma de Mallorca, Spanien", "Title": "“A City Hotel with Great value for money!”", "Author": "GiovanniFrati", "ReviewID": "UR116699557", "Content": "The Hotel is located right in the centre of Barcelona, a the Passeig de Gracia, maybe the best shopping street in Barcelona, with all big brands like Louis Vuitton, Burberry etc. You'll find nice cafes, Tapas bars and Restaurants in the direct neighborhood. Great access to the public transport e.g. metro and bus, although you can easily walk down to the Ramblas and the Plaza Catalunya. The Hotel itself has been modernized and offers ample rooms (pls mind it's a city Hotel) with a very nice layout and design features. Not everything is state of the art, but the general appearance is very good. We stayed only two nights, but would come back since we found the location, the staff and the rooms very nice!", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Adelaide", "Title": "“we loved it and willl go back”", "Author": "mhmtravel", "ReviewID": "UR115711469", "Content": "Stayed 3 nights and this was a fantastic location, city bus stop close by. Very helpful and attentive staff. 2 free laptops for guest use, luxurious bath and shower gels.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Wonderful and beatiful boutique hotel in great location!”", "Author": "CaseyTeh", "ReviewID": "UR114775838", "Content": "Stayed in SixtyTwo Hotel during my vacation in Barcelona. The hotel is very nice with all the necessary facilities and great amenities that one needs during a holiday. The location is central and accessible to all the places that we want to visit. Would recommend to everyone to share the wonderful experience in this hotel. Only setback is that free wifi is only available at the lounging area instead of each room.", "Date": "June 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Berlin, Germany", "Title": "“Very good Hotel in the City center”", "Author": "bloeck_berlin", "ReviewID": "UR112595722", "Content": "After the first night (we have a smaller room) we changed in a higher catagorie that we have booked. We have a wonderful room in the 5th floor with a very big terrace and a wonderful view. For our next stay we will choose this hotel again. Breakfast was great, everything was fresh and so delicious. Staff are very friendly", "Date": "June 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fortaleza, CE", "Title": "“This is the right hotel on the right place for a trip to Barcalona”", "Author": "Flecheiras", "ReviewID": "UR112143485", "Content": "The hotel on the right place in the right city. This design hotel is a pearl and we enjoyed the stay very much. If you come by plane, the railway station is just a few steps away. If you like to discover the beautifull city by the metro, just a few steps away.", "Date": "June 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Great stay, but that one front desk clerk... and 12e/day per unit for wifi?”", "Author": "Ogreenlee", "ReviewID": "UR110652544", "Content": "We had a very nice stay at SixtyTwo Hotel in Barcelona. Very convenient to the main metro (right outside the door) and could throw stones to both Gaudi houses. We also felt very safe in this location, and we loved the wide boulevards on the Passeig de Gracia. So perfect location, especially upon arrival, to get your bearings. The room was very modern, and comfortable. The shower was powerful and quite awesome, and it was heavenly after a long day of walking. We made ourselves cappuccino while we waited on our room to become available, and it was a nice space with free internet. So those are all the great things about this hotel. The negatives on this hotel consisted of two major things and one possible misunderstanding. First the misunderstanding... I left a nice tip with a note asking for an extra large towel, as I use two just for myself. I didn't get it, but that could have been a mistake. The fact that we had to pay for wifi in this day and age is bad enough, but you must pay 12 euros, each day, for EACH UNIT. Laptop? 12 euros. Smartphone? 12 euros, iPad? 12 euros. I mean, that is just absolutely ridiculous, and insults me as a guest. I didn't complain about having to pay for each of the nespresso coffees, and I wouldn't have complained about the wifi had it not been for the 12 euro, per unit charge. The other problem I had was with one of the front desk clerks. He worked the day shift, and was just so smug and arrogant. He offered his service, but lacked concern for anything that did not interest him. I know the folks at the hotel read these critiques, and I'm certain they will know which man I speak of. The one other guy who was working with him there, on the day we checked out, was such a nice guy. I wish I knew his name. He had darker skin, and a great smile. Too bad you can't hire more men like him!", "Date": "May 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“An Absolute Gem”", "Author": "AfficionadaNYC", "ReviewID": "UR107671988", "Content": "\"W\" in Barcelona. Tranquil, lovely setting; private garden; free wifi; honor payment for bar; location directly across Gaudi UNESCO museum treasure.", "Date": "May 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Excellent location in the heart of Barcelona”", "Author": "marbel_11", "ReviewID": "UR107164967", "Content": "The SixtyTwo is a very good hotel on a favourite touristic location in Barcelona. We had excellent, very quiet rooms with nice little terraces to the court.", "Date": "May 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Perfect stay, at a quite and pleasant room in the heart of Barcelona”", "Author": "schmidt2011", "ReviewID": "UR103940656", "Content": "Good small hotel. In the center of the city at walking distance of almost everything. Taxis in front of the hotel. Clean. Friendly and helpfull staff. Speaking englisch. I have been staying in large hotels before, but this hotel was good. I will definately return. My room was the smallest and the last available. Next time I will take a room with a view on passeo the gracia so that I can open the windows in the morning and see the city wake up in sunshine.", "Date": "April 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Fantastic Location”", "Author": "SilaE", "ReviewID": "UR101476448", "Content": "We have stayed for 4 nights at the SixtyTwo Hotel. The location is just fantastic. Right in the heart of Passeig de Gracia, between Casa Mila and Casa Battlo, the location is just wonderful. We were in walking distance to every important point. 10 minutes to Placa de Catalunya, Tourist Information Buro and Las Ramblas. Also the room was very clean, and spacious. Front desk was very helpful. We asked them to make a reservation for us since we do not speak Spanish and they did it right away. Also they helped us to print our boarding passes. So everything went well and delightful. The only negative aspect was that tea in the room was 1,5€/teabag (trying to make profit from such a small point is really ridiculous and not understandable), and the rooms did not have free internet, however there are 2 computers online which you can use at the breakfast section. Anyway I would definitely recommend!!!", "Date": "March 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "winchester", "Title": "“Perfect hotel for city visit”", "Author": "dylanvillan", "ReviewID": "UR101226265", "Content": "Hotel located within metres of the metro station, so only took about 25 minutes to get from Barcelona airport. A lovely area with plently of restaurants and cafes. Felt very safe. We had a triple room for me and my husband plus 14 year old daughter. She loved the room as she had her own 'area' in the room with a very attractive, modern bed. We had a king sized bed with nice bedclothes. Room beautifully decorated, very clean, quite. Staff were welcoming and helpful.", "Date": "March 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Absolute perfect hotel!”", "Author": "Sharongompen", "ReviewID": "UR101129822", "Content": "Great hotel! Perfect shopping location, nice and big rooms! Furthermore, the staff is very kind!", "Date": "March 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Nice, Trendy, No Bad Suprises, Friendly Staff”", "Author": "BarbarosG", "ReviewID": "UR98072684", "Content": "Hotel location is Passeig de Gracia which we can say largest main street of barcelona. All sightseeing, attractions and shopping is on this street and connected streets where this hotel located. You just need to leave hotel and walk down to Placa Catalunya squesre and down to seaside, thats all... Rooms are trendy, design and cool... Bed is very comfortable, there is one mid size Lcd screen with lots of european tv channels... As all barcelona has, you gave a nice balcony facing a busy main shopping street. Staff is helpful, big time accent english but smiling a lot and friendly and helpful... There is one bath tube and one standing shower in the room. Nice and trendy... Breakfast is extra which is 18 Euros... Internet is 12 Euros daily... I advice this hotel to couples travelling to barcelona, young trendy, clubber feeling in Hotel... One minus a can say is Hotel needs a little repairs...", "Date": "February 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mumbai", "Title": "“Great Location”", "Author": "Orbiter007", "ReviewID": "UR97996197", "Content": "Lovely boutique hotel on the Pg de Gracia ... right in the middle of the avenue with all the major designer stores. Diagonally opposite Casa Batlio and within walking distance of La Pedrera (and a slightly longer walk to the Sagrada Familia). Placa Catalunya and La Ramblas is within walking distance. Very nice breakfast. Pleasant staff. Book in advance for attractive rates. Large comfortable rooms with B&O TV and Etro toiletteries. Tea/Coffee maker is available in the room but is charged. Iron provided on request but book in advance as there aren't many available.", "Date": "February 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Milan, Italy", "Title": "“Very nice place”", "Author": "Papere", "ReviewID": "UR97002725", "Content": "Excellent location; nice design; very nice \"honesty bar\"; very good rates", "Date": "February 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "prague", "Title": "“Disapointed”", "Author": "LorenzoLivi", "ReviewID": "UR96403727", "Content": "Hotel right in the center of the Passeig de Gracia where there is a lot of nice shopping to do, BUT expensive for what it is. No breakfast included in the room, You can hear the conversation on the next room, you hear the people walking on the corridor, bathroom are very simple. a trendy hotel but very expensive for what it is, for almost the same price you can go to the OMM hotel which is a realy 5 stars hotel. No nice service, you seems to disturb the people who work there. This is not a 4 stars Hotel.", "Date": "February 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Convenience Boutique Hotel!”", "Author": "AdeNgan", "ReviewID": "UR93985147", "Content": "28th Sept, 2010 The Hotel is near Casa Blato & Casa Mila and a short walk (5min) to Metro station. We booked an \"Hop On and Off Bus\" for our day tour and the main station was just near to the hotel. Although the hotel is small but it's tastefully decorated. The bed was so comfortable after a tiring walk. It is the perceptive and friendly service that makes it worthwhile paying a higher price. The owners and staff are helpful and generous coz we left our mobile phone during our checked out but we manage to get it back from the reception. The internet at 1st floor was so slow...Anywhere, just 5min walk to Starbucks for a coffee and checked all our emails. Sixty Two Hotel is a place you would definitely come back to and recommend to your friends!!!", "Date": "January 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“Great hotel, staff need to be changed”", "Author": "Anooos", "ReviewID": "UR86886509", "Content": "the hotel is great,location is very good near city center, staff are rude", "Date": "November 12, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Excellent hotel with sting in the tail”", "Author": "citybuddy", "ReviewID": "UR85143026", "Content": "Location,Room,Breakfast,Wine Tasting,all of very high standard.Really enjoyed the ambiance of the hotel.However the room safe is very small and we left all our documents,passport ,two wallets,phones as much as we could in the safe.On our return home I realised to my dismay that my small wallet containing credit and debt cards health card and a some of british money was missing.Phoned the hotel before cancelling the cards to be told phone back the following day as the cleaning staff we not available(understandably it was after midnight)Cancelled cards.Phoned the next day as requested but to no avail no wallet was found.We always use the safe for our valuables and don't open it till we are ready to return home.So please be aware that the safe is small and take care with your property.", "Date": "October 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fabulous location but paper thin bedroom walls”", "Author": "Martha_Duck", "ReviewID": "UR85025560", "Content": "As most of the other reviews say, this is a lovely boutique hotel, fabulously located between the two famous Gaudi houses on the Passeig de Gracia. Staff are very friendly, rooms clean etc etc. Our only complaint is that the bedroom walls are paper thin which meant that we could hear everything (and I mean everything) that was happening in the room next door, even to the extent that we could hear someone's normally spoken conversation word for word. In the end we had to put music on in order to block it out, which probably meant the people on the other side of us didn't get much sleep either! Having said that, when the neighbours were quiet, the beds were really comfortable. One other tip - most of the taxi drivers had never heard of this hotel and struggled to locate it, even when we gave them the exact address. Our friends arrived at 2am and the taxi driver gave up and asked them to get out the cab further down the road! If this happens, ask the cab driver to drop you off at the Hotel Majestic on Passeig de Gracia. That's a massive hotel and about 4-5 doors down from No sixty two. Oh, and if you don't fancy paying for an expensive breakfast, the cafe a few doors down does a lovely coffee and bagel in the morning and opens late in the evening too.", "Date": "October 27, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Germany", "Title": "“Terrible bathrooms, awful service”", "Author": "Zorro7770", "ReviewID": "UR84040190", "Content": "I booked one of their Executive Rooms through Expedia - and I looked-up the Trip-Advisor recommendations beforehand. None of my expectations came true. The late shift concierges were not at all interested in their guests. They were just hanging around in the lobby, and not understanding my issues. Firstly I booked a non-smoking room, but there was none, and the receptionist said, I should open the window. Bummer. The one who guided me to my room did not even know what to show me upstairs. He was a funny one - lost in space. The rooms are spacious, that's true. And I guess some time ago it's been a modern, state-of-art environment - but once I stepped into the bathroom I was disgusted. The shower was so mouldy, I could hardly breathe. I've never been in such a messed up shower room. It was quite offending, to offer this kind of place for money. The same receptionist said: he wouldn't understand my problem, there'd be a tub too, and I could simply close the shower and now use it. Well, that's a strange perpective. The replacement room they wanted to give me for one night (and then move again), had other service issues, I doubt that the bathroom's floor's been cleansed before me checking in. The next night (after talking to the supervisor) I stayed in another room - no shower (only tub) but everything's been a bit sticky and worn-off. A shame because you could clearly see that somebody invested a chunk of money in this hotel. Given the great location some people might enjoy staying here. But neither on business nor for fun I'd return. The bathroom reminded me of my worst campsite experiences when I was young. But for the price of € 200,- /night this is a no go!", "Date": "October 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Great location, excellent service, comfortable and clean rooms.”", "Author": "Neurosurgeon", "ReviewID": "UR83486000", "Content": "Spent 6 nights here. An excellent choice. Great location, easy access to all sites and conveniences. Rooms are good size, modern & clean. Staff is most helpful. Breakfast is a bit high in price, but there's a great selection. Would not hesitate to stay again.", "Date": "October 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Shanghai, China", "Title": "“Great Location, Just Misses the Mark”", "Author": "ozallan", "ReviewID": "UR82694277", "Content": "This is a trendy establishment in a great part of the city, on one of the best upmarket streets close to two of Gaudi's famous buildings and a short walk to the subway and to La Ramblas. I had a large premier room with an alcove sitting area overlooking the back which was quiet and pleasant. The beds are soft and comfortable. The breakfast is good but pricey and probably need more staff as the used plates take awhile to be cleared and the food to be replenished. But it just misses on a few simple issues: the duvet is too thick for the Barcelona climate but the hotel has no blankets, the bottled water is not replenished after the first bottle, there is no slip mat for the bath / shower and the floor of the bath is quite slippery. I am amazed if people have not been previously injured - I had to use the had towel getting out to stop slipping. The air conditioning temperature controls can only be adjusted by the front desk - why? This is suppose to be a 4 star hotel. And the rooms are a bit pricey so I think a charge of 12 euros a day for wifi is a bit extreme. Yes there are two free laptops in the lounge to use but that is not the point. And finally although there are 4 English language news stations on TV why cannot they supply an English movie channel station or even Discovery. But overall not bad.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "California", "Title": "“Modern and comfortable hotel, but not worth the price”", "Author": "cl361", "ReviewID": "UR81496347", "Content": "Overall we had a pleasant stay in one of the economy rooms, however, I did not think the hotel was worth the price. We found much better deals in other cities (Madrid, Sevilla, Granada). If you're on a budget, you can probably find a comparable hotel at a better price. Pros: good location right at the Passeig de Gracia metro stop, close to several Gaudi sights and in the middle of the Eixample area, however, about a 15 min walk to the top of Las Ramblas and the beginning of the old town. We would take the metro back (although only 2 stops) after a day of walking around down there. Staff very helpful and friendly, we got several wonderful restaurant recommendations! Beds VERY comfortable, quiet rooms, slept like a baby! Cons: the room has odd designs - sink is separate from the rest of the bathroom and water drips onto the carpet, you can't turn on just the bathroom lights (if someone is sleeping and the other in the shower, have to leave the room lights on) shower floor drains on the sides. there are only 2 laptops for shared use that were very slow and there was always a line (probably because they were so slow) Tip: if coming from the airport, if you take the Aerobus, it's a bit of a walk with luggage, navigating through crowds, from Placa Cataluyna, although do-able if you're on a budget. We ended up taking a taxi back to the airport, which was about 30euro. Didn't try the train option, but the stop is right in front of the hotel, however, one of the hotel staff did refer to Barcelona's train system (different from metro) as \"hell\".", "Date": "September 29, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London", "Title": "“Fantastic hotel - can't rate it highly enough!”", "Author": "AliPLondon", "ReviewID": "UR77780543", "Content": "A fantastic hotel, convieniently located on the Passeig de Gracia, right next to the metro station. We stayed in a premium room which was perfect - tastefully decorated, clean, and with a well stocked mini bar, robes - all you need really! The recepetion staff were brilliant, even before my trip when I contacted them to confirm my booking etc. Just wonderful!!", "Date": "September 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gothenburg, Sweden", "Title": "“Fantastic!”", "Author": "rosumalmo", "ReviewID": "UR77513032", "Content": "Perfect location, great room, fabolous breakfast and very kind and helpfull staff. A small pool and a terrace would be nive though. Will definitely return!!!", "Date": "August 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“A haven of serenity in a bustling city”", "Author": "billbid", "ReviewID": "UR76491538", "Content": "Just had a five night stay at hotel sixty two location great recepion staff friendly helpful and had great english roon 504 has a beautiful large terrace which is quiet and peaceful after a day in the city. The only critisism was the breakfast which was expensive and not at all nice. We would stay here again and would recommend this to others Thanks again for a lovely stay Cathie & Bill", "Date": "August 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas", "Title": "“Sleek and beautiful in a fantastic part of Barcelona”", "Author": "awmstx", "ReviewID": "UR74826334", "Content": "We stayed six nights here and had an almost perfect stay. It was extremely hot all over Europe and it was a relief to finally have a lovely, modern and air-conditioned hotel to come back to after long days of walking around the city. The room was spacious with its own large and furnished balcony and a perfect view over the Eixample and the Gaudi Casa Batlo. Many beautiful stores on the Passeig de Gracia where the hotel is located. The staff were extremely gracious and always there to please, especially Alex, who was at the desk most days. I would stay there the next time we visit Barcelona, which I hope will be soon!", "Date": "August 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Damascus, Syria", "Title": "“Location Location Location”", "Author": "ShamiGuy", "ReviewID": "UR70739735", "Content": "We arrived at the hotel at 2:30pm and realized that the location was absolutely fantastic. We were informed however that the rooms wouldn't be ready until 4pm which was fine because we weren't planning on spending any time at the hotel as our objective was to discover the city! We have the regular room with a balcony overlooking Paseo De Gracia while others in our group had two large rooms with the private terraces. Other than the fact the 2 larger rooms didn't have funciontal air condition, they were really great. I must mention however that the management did quickly respond to our complaints about the ACs and changed the rooms immediately. Positives of the standard rooms: Good size (by European standards) Modern looking Spacious closet space Spacious bathroom (loved the soap!) Negatives of the room: WARNING: Take a step back from the toilet when flushing because the water WILL splash outside the bowl (not pleasent) Make sure that the AC is working in the room Water from the shower kept switching between cold and hot due to bad piping Positives about the Hotel: 1) EXCELLENT Location 2) Friendly and helpful staff for the most part 3) Modern Looking Hotel 4) Clean 5) Excellent Value for Money Negatives about the Hotel: 1) No AC in the corridors between the rooms and elevator which was annoying since it's quite hot during the summer 2) Honesty Bar didn't match up to its hype in terms of it being a fun hangout (found it to be a little tacky in terms of design but again this is a matter of taste and nothing factual) Overall it was a great experience and excellent value for money.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic hotel, fantastic location”", "Author": "leethelimey", "ReviewID": "UR70731420", "Content": "Have just returned from a long weekend trip to Barcelona. We were a mixed party, including very young children and were here to celebrate our mothers 60th birthday. The hotel staff took great care of us all. They are friendly, helpful and gave great advice about local restaurants and place of interest. The design and layout of the rooms were fantastic, the beds large and immaculate bed linen. Really enjoyed the honesty bar and communial area on the first floor. A great place to meet up before going out for the evening. Boutique hotels are great when they are like this, have stayed in loads that come up short. This certainly was not one of those. Overall a fantastic hotel in a great location.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ankara, Turkey", "Title": "“Great Hotel,Perfect Service...*****”", "Author": "anil_talasli", "ReviewID": "UR69853449", "Content": "The hotel is excellently situated on Passeig de Gracia, in L'Eixample. Although we arrived early on Monday, our room was ready, and had a private terrace as we requested. As soon as we entered to our room, they kindly sent a bottle of Cava and chocolate truffles as they knew that it was our honeymoon. Hotel's services were amazing. Everyone at the front desk was helpful, friendly.We really loved this hotel.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rio de Janeiro, RJ", "Title": "“GREAT SMALL HOTEL WITH PERFECT LOCATION”", "Author": "AlanGeller", "ReviewID": "UR69020056", "Content": "We'd love the hotel Small an cozy, good Staff, confortable room THE LOCATION IS PERFECT, WE RECOMMEND!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "June 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“STOP! Book your room here, stop loooking any further. WOW!”", "Author": "boston76", "ReviewID": "UR68067818", "Content": "We stayed here for 6 nights in late May 2010 and had an amazing stay. The location on Passeig de Gracia could not be beat. Diagonally across the street is Casa Batllo and Casa Mila (La Pedrera) is a few blocks in the other direction. Also, the Metro/RENFE stop is about 2 steps from the front door of the hotel. It is less than a 10 minute walk to Placa de Cataluyna. Our room (406, an Executive room) faced the inner courtyard and was spacious and quiet. We requested to look at a room facing the street (202). While the bathroom was much bigger, we were informed that the room darkening shades were broken. Room 406 was a great size (by European standards and even by American standards), had a large bathroom and a cozy sitting area. With the room darkening shades working in 406, it was an easy decision to pick this room. In retrospect, those room darkening shades are terrific and necessary to keep out the bright morning Barcelona sun. Everyone at the front desk was helpful, friendly and willing to offer suggestions or advice. Montse was particularly helpful with answering all of our questions throughout our visit. (Thanks again Montse!) The bang for your Euro here cannot be beat. Great room, great staff, free internet during the afternoon and evening, all in a great location for not a lot of money. It's worth far more than they are charging.", "Date": "June 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UAE", "Title": "“Excellent stay , perfect location”", "Author": "MajorChaos", "ReviewID": "UR63776369", "Content": "Excellent hotel with a fabulous service. Location was close to every where in walking distance. Services were amazing. Honesty bar was a very creative idea , where you can drink and write what you drank on a piece of paper.", "Date": "May 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ithaca, New York", "Title": "“Hidden Gem- stay here NOW while you have a chance at getting a room!”", "Author": "OttoCal", "ReviewID": "UR63207292", "Content": "This hotel is excellently situated on Passeig de Gracia, in L'Eixample neighborhood about 5 blocks from the Placa de Catalunya. For our arrival, we took the Aerobus from the airport to the Placa for 5 Euros each and walked to the hotel. As we arrived very early and on a Sunday, our rooms weren't ready yet, but they stored our luggage and gave us a map & tourist booklet and sent us on our way. If you are looking for this hotel on Google Earth from the photo-Street View layers, it is located between the green Casa del Libre bookstore awnings. As this is a photo from last year, the Hotel Sixtytwo awnings are not visible. We found this hotel on Expedia, and got a good rate for Sunday-Thursday. We watched the prices go up, up, up for Friday/Saturday then they were sold out for those days. I believe there was a large trade show in town that ate up a lot of rooms for the weekend. Our room was on the street side, and had a view of Gaudi's Casa Batllo', which was charmingly lit at night. Had seen some notes of complaint about street noise. Um, seriously? Through that double paned insulated glass? Hardly. There were electronic room-darkening blinds which we only used one night, as they really made the room dark and I prefer light in the morning to so I can haul myself out of bed to start sightseeing at a reasonable hour. The small balcony had a lovely wrought iron railing. Our room for Sun-Thurs. was # 402, and was quite spacious and nicely decorated. The bathroom was the largest I have seen in a European city hotel. Everything was very modern, and the toiletries were of nice quality. There was a tub with a detachable shower spray, typical of what we have seen in nicer hotels in Europe. Was I going to splash all over the place as usual? Yep. Can't get the hang of those things! But wait! there was a hidden shower room that was a dedicated shower with a door! Awesome! No more splashing around! The bathroom had a large sink and vanity area, and a short roll-away set of shelves for storage. Then a closed off toilet room and the shower room, both with a shared sliding door, and the tub. We had a queen size bed and a useful low shelf about 2 feet wide running the entire width at the foot of the bed. Generous closet space, mini bar/fridge, safe, funny orange chair, and a desk that we did not use. The lobby was not large, but bright and always attended. The cleaning times varied from about 10-5. There was a breakfast buffet available, but we did not use this service. It was abuot 20 Euro per person, and we prefered a smaller meal. On the first floor (2nd floor for Americans), there was an open lounge, 2 computers for general use, and an honesty bar. You were welcome to have drinks and just write down your room number, and they would add it to your bill. The breakfast buffet was served here also. We had to wait a few times for the computers to be free, but with a lovely lounge overlooking the Passeig de Gracia, it was hardly a bother. The hotel is right next to a metro entrance- the large Passeig de Gracia station. As Friday/Saturday were at first beyond our budget and then full, we moved to a different hotel for those nights. Unfortunately, due to the closure of the Barcelona Airport for part of our departure day, we were stuck in Barcelona for an extra day, and we returned Here to Hotel Sixtytwo. I say stuck, since we had to trudge back into town with no hotel or really a clear picture of what we were supposed to do with ourselves of for how long. The airline gave us an estimated departure time of 5 days later! We booked for one night, and it eventually turned out that was all we needed. Our second room was on the 3rd floor facing the back courtyard. It was smaller, no separate shower room, no shelf at the end of the bed, but what must have been a large balcony was converted into a small room with a fabulous and deep room-width couch thingy. This was perfect for our day of confusion, as we ended up spending most of the day on the couch. A couple of notes- The satellite TV was iffy, sometimes you got all the channels, sometimes some of the channels, sometimes none of the channels. The second room had A/C problems, and we couldn't get the temperature to regulate, despite several attempts from the front desk staff. I believe this was a known problem, and they did try to adjust it for us. In April it was bearable. In August? Perhaps not. This hotel is under new management within the past year, and they have done a lovely job. It is 4 Stars, and really- the location is wonderful- so close to the metro! There are great restaurants around, and it is in close proximity to the Casa Battlo, La Pedrera and the interesting Antoni Tapies Foundation. We especially enjoyed the Cerveceria Catalunya for tapas. We paid $162 USD per night for the 5 nights we were there. Rates higher on weekends and when they are more booked up I suppose. We paid $240 USD for that extra night at the end for a smaller room on the back. Wi Fi was 12 Euro per day, so we did not hook up to that, prefering to use the lounge computers for free or the cafe a few doors down had free wi-fi. We really liked this hotel, and would stay again at the $162 USD rate. That was a bargain for this class hotel in this neighborhood on this street. The $240 rate was more typical for what you would see right around here. The area is filled with every sort of lodging from cheap hostels to fabulous 5 Star wonders. We certainly don't fit into either of those extreme categories, and were very happy at Hotel Sixtytwo. Oh- all the front desk staff spoke English and were always polite. I think once word gets out about this hotel it will not only be more difficult to get a room, but you won't be able to get any rates under $200 USD. Book now! There are maybe 45 or so rooms.", "Date": "May 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Planned visit during volcano incident”", "Author": "Pstephe1", "ReviewID": "UR62989957", "Content": "I had a terrible experience with this hotel during the above incident. I emailed asking if there was any flexibility around the cancellation policy and reveived no reply. I called and was informed that there was no flexibility, I then tried to re-arrange for a later date but despite numerous phone calls and emails could not get a confirmation of this booking. I decided to cancel And book with another hotel, they have not even had the courtesy to email me back to confirm my cancellation. Very poor experience and I am now glad I will not be staying there.", "Date": "May 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Great hotel. Great location.”", "Author": "charlieandcharles", "ReviewID": "UR60834219", "Content": "This boutique hotel is located in the heart of Passeig de Gracia. The subway and RENFE train system (which takes you directly to the airport) is steps away... There are numerous cafes and restaurants too. And more importantly, Casa Mila and Batillo is blocks away from your hotel. The hotel staff was very friendly and informative. The rooms were spacious, high ceilings and comfortable-cozy. I would definitely recommend this place to a friend...", "Date": "April 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perpignan, France", "Title": "“Great design, attentive service and good value”", "Author": "Motienko", "ReviewID": "UR59212275", "Content": "Having just spent two nights at this new hotel, I must say it is almost impossible to fault it. The room was spacious and beautifully decorated, with plenty of storage space, coffee/tea machine, sleek bathroom with a tub and a separate shower, fluffy towels and Etro amenities. The sound proofing is perfect, while the room faced Paseig del Gracia we didn't hear any noise at all. CD player, flat screen TV, very comfortable bed... The reception was very friendly and helpful and the complimetary wine tasting on Friday night was fun. A designer boutique hotel with reasonable prices, on the most beautiful street of Barcelona, right between Casa Milo and Casa Battlo, with attention to detail, fantastic service and management that really cares... we will be back soon!", "Date": "March 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "USA/Spain", "Title": "“Fabulous Hotel”", "Author": "WorldClassCitizen", "ReviewID": "UR58134995", "Content": "I am a VERY VERY selective person in regard to hotels, cleanliness, etc. My standards are high. This hotel is TOP...particuarly for its class/type of hotel and price! The rooms are super...and very comfortable. This is a very smart, sexy, sleek boutique hotel. Location is PERFECT...there really could not be any better. The \"honest\" bar is GREAT. Staff is friendly, customer service oriented (which says A LOT for Europe), and very attentive. I can not rave more about this hotel! ONE OF THE BEST PLACES TO STAY IN BARCELONA!!! This hotel will now be my Barcelona hotel!!", "Date": "March 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Meath, Ireland", "Title": "“Excellent location and great service”", "Author": "MSfromIreland", "ReviewID": "UR57598721", "Content": "The location was unbeatable on the Passeig Gracia, only 5 minutes from Placa Catalunya and 10 minutes from the Las Ramblas. Transport links nearby including Barcelona Bus. There were some nice restaurants nearby such as Citrus. The rooms were a decent size, modern and clean. The service was good and I loved the honesty bar. It's a small hotel, so the amenities aren't massive (ie. no restaurant or gym). However, it has all one needs. We landed up going out for breakfast. It's great for a long weekend.", "Date": "March 3, 2010"}], "HotelInfo": {"Name": "SixtyTwo Hotel", "HotelURL": "/ShowUserReviews-g187497-d1501787-Reviews-SixtyTwo_Hotel-Barcelona_Catalonia.html", "Price": "$195 - $302*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Passeig de Gracia, 62</span>, <span class=\"locality\"><span property=\"v:postal-code\">08007</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "1501787", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/1d/46/c6/executive-room.jpg"}}