{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Great location, great service, poor infrastructure.”", "Author": "eldavid51", "ReviewID": "UR127896131", "Content": "Nice location, great view to the beach, nice pool. Areas around the hotel look abandoned. Poor continental breakfast. Best thing, employees. Very profesionals, friendlies and always willing to help.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“THE VIEW IS GORGEOUS”", "Author": "Sherry L", "ReviewID": "UR127756886", "Content": "Tripadvisor has the wrong name posted. This is Hotel El Guajataca. Parador El Guajataca is across the road and not on the ocean. We stayed two nights. There is good handicap accessibility. Every room has a balcony and a view of the ocean. We were on the second floor and the view was gorgeous. Loved sitting on the balcony; loved going to sleep at night listening to the waves break on the shore. Two nice pools. Grounds very well kept. Our only complaint: The floors are brown tile and so do not show dirt. The maid obviously had only been broom-cleaning the floors. They looked clean, but when you walked on them you realized that they were grimey. I had to get her to come in and mop them. It was $98 a night and we were traveling on a budget, so we were willing to put up with that. The room had a king-size bed and ample space. Amenities are minimal. There are 7 steps up to the second floor and 7 steps down to the first floor. The hotel is hard to spot from the road; signage is poor. Going west, take the first right after you pass Merendero Recreation Area. If you see the sign for Tunel de Guajataca, you've gone too far. The plain front belies the beautiful view in the back. All ocean and lush, green, undeveloped hillsides in the back. Yes, we would go back.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hamilton, Canada", "Title": "“Loved the sound of the surf from our balcony”", "Author": "HojasRojas", "ReviewID": "UR121684677", "Content": "Very nice rooms and very clean. Lovely grounds and amazing coast line with cliffs and the surf. Staff were very friendly at check in. Wifi only works in lobby which is comfy and well decorated.Free breakfast is basic with coffee, juice and toast. Very friendly staff throughout. Would stay here again.", "Date": "December 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Puerto Rico", "Title": "“Nice place, so good for the price”", "Author": "JV8602", "ReviewID": "UR117130015", "Content": "We stay for a weekend the view is beautiful, the room was clean, very quiet place. Is near to many restaurants and places to visit like las Cavernas del Rio Camuy and el Observatorio de Arecibo.", "Date": "August 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“It used to be nice....”", "Author": "ESLTomas", "ReviewID": "UR98426283", "Content": "First, this is no longer a \"parador\" (a government-run small inn). It is now a private hotel. In 2002, during our first stay, it had a decent, free breakfast, a mini-'frig in room, even a free drink when you checked in. All this is gone. Although the room itself was clean (though musty), garbage littered the grounds below the windows. The window was rusted shut. There was no hot water in the shower. Two pieces of cold toast and bad coffee (where is the legendary Puerto Rican blend?) was $2.19. At 8 AM the restaurant was closed so we ate at the bar. \"Why is the restaurant closed?\" we asked. The surly clerk shrugged. \"The cook's still sleeping.\" A stray dog and cat roamed the indoor common areas, the dog begging for food, which some guests threw from their balconies. I've lived in Puerto Rico for six years. Do yourself a favor. Stay in San Juan. Or, better yet, vacation in the Dominican Republic. It's right next door to P.R., cheaper, and has better service.", "Date": "February 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "queens newyork", "Title": "“nice place for the price”", "Author": "corchado", "ReviewID": "UR93250650", "Content": "i stayed last year the staff is nice but one of the staff is really good and knows the vaul of a custmor she goes out of her way to help the guest she goes that extra mile god bless her her name rosa.the rooms are nice and clean the view is great.i will be back next year.", "Date": "January 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“The Most Beautiful View”", "Author": "ChicagoMisty2", "ReviewID": "UR81923979", "Content": "My family and I lived in Arecibo, Puerto Rico for about 1 1/2years and returned to visit the Island and show our kids. We stayed at El Guajataca for 2 nights and we loved the pool and beach so much! But the best part was in the morning when we sat down for breakfast and the window right by our table was open and the ocean breezes felt so relaxing and refreshing. I felt like I didn't have a care in the world, all my family was with me and the view of the ocean and sound of the waves is a memory that always is there when I think of Puerto Rico.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "nyc", "Title": "“so what is a little old, it is the most beautiful view in pr.”", "Author": "tainashey", "ReviewID": "UR80609160", "Content": "my name is shey roman and i have been travelling to this hotel for 2o years. i was born in ponce but i stay here because i love it ! i love the staff, the pool the walk to the river and the ocean. i wake up to this beautiful view and it sets my soul free. i can connect with the ocean and be free. so for the haters ....too bad, nothing in life is perfect its how you view it......oh and about the dogs ...its sad but if you give a **F bring them food.", "Date": "September 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "new haven,ct", "Title": "“very nice”", "Author": "defyul", "ReviewID": "UR54858483", "Content": "we stayed here at a last minute... the front desk lady Rosa gave us a good deal just to sleep. arrived at 8pm and checked out at 8am. it was a little weird that there is no stay thru out the night. the continental breakfast was a real dissapointment. but the fact that one of the pools was heated and open thru out the night was a real treat. we didnt have to worry about someone telling us we couldnt jump in the pool :)", "Date": "January 31, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Los Angeles, California", "Title": "“Perfect Example of \"Where NOT to Stay...\"”", "Author": "Chacho_Keva", "ReviewID": "UR33266387", "Content": "I made reservations two weeks prior to my arrival on June 16, 2009. Checking in alone was dissatisfying. I was asked to wait outside the clerk's office while he attended another guest. So long was the wait that I went for a walk and returned 20 minutes later figuring this was more than enough time. No such luck! After waiting yet another 10 minutes, I went for a second walk. Upon returning the clerk greeted me courteously but rendered no apology for my wait. I checked into room 202. As soon as I entered, I heard voices from the room next door. Not that the next-door guests were loud. But, the rooms were connected by a common door which was too thin, making it possible for me to hear their conversation. I requested another room. I was sent to room 208. As I made my way to 208, I observed several pieces of litter and an outdoor lamp dangling from exposed wiring. Although this room was not connected to another, I was appalled by what I experienced upon entering. Flies and mosquitoes buzzed around as I took a wiff of a foul odor. The bathroom window had no screen and could not be closed allowing insects to enter. The room's brown floor tiles and decor was dark, drab, and depressing. Given that I was hungry, I left my luggage and proceeded to the restaurant. But...it was closed that day!!! I left disappointed in search of a nearby place to eat. Having found a nearby place, I mentioned my experience to the waitress. She told me how she'd heard similar complaints. She then recommended a place across the road from Guajataca called Parador Vistamar. As soon as I finished my early dinner, I drove to Vistamar and was amazed by what I saw. Not only was the place modern, clean, and with a better view but, the room fees were lower!!! I raced back to Guajataca and told them I needed to check out. They would not reimburse me. I explained the odor and fly issue in room 208. I was handed a bottle of odorizing spray and was told that someone would be there soon with insecticide. \"No thanks\" I said. And with that proceeded to leave minus 118 dollars. I have no regrets for the decision I made. I enjoyed two beautiful days at Vistamar. This is one place I will definitely return to. BUT NOT GUAJATACA!!!", "Date": "June 26, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Illinois", "Title": "“Avoid by all means”", "Author": "comfytravel", "ReviewID": "UR24921783", "Content": "This is a run down place that cater primarily to local weddings. During our stay the restaurant was closed (\"kitchen repairs\"), personnel not friendly, breakfast awful (no place to sit, one day no coffee, another day almost no food). They show two pools on their web site. One pool is dirty and there is nobody to clean it, another is supposed to be attended by a life guard, and for this reason always locked. Only one eatery nearby - an extremely overpriced seafood restaurant with bad food. The room overlooked the ocean and it's really beautiful, but the beach is not suitable for swimming - too many sharp rocks. Everything you can go see from Guajataca is accessible from San Juan.", "Date": "February 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Yauco", "Title": "“Good!!!!!”", "Author": "WiWi198", "ReviewID": "UR18864875", "Content": "Excellent stopover. ..in reception the girls were very kind, very clean the room, excellent pools, the most that we enjoy was the jacuzzi, the unique thing that didn't like a lot was that the restaurant that does not have a lot of variety in foods, but have very excellent service. ..and they should remodel the outsides of the inn so that be seen prettier, but of the others attractive we be recommended him!!!!!", "Date": "August 11, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "New York", "Title": "“TERRIBLE PLACE”", "Author": "Albert03", "ReviewID": "UR8248963", "Content": "Worst property ever employees don't know what are they doing totally deorgaized,poor maintenance, dogs everywhere. I think owners are trying to fool people and thats why there are some good reviews, food aweful!!! service kind of good can do better. Very bad administration. they can do better it they sell. Don't ever stay there!!! Ralph", "Date": "July 28, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Scottsdale, Arizona", "Title": "“Looks like Paradise.....”", "Author": "love2traveltogether", "ReviewID": "UR8020769", "Content": "My husband and I just returned from a 2 night stay at the Parador El Guajataca. I had been visiting the Parador since the early 80's and always considered it a beautiful place to stay. I had not been able to visit for the past 7 years and they have made tremendous changes to the property. The lobby is really beautifully done with faux stone and they now have a stairway that brings you to a lovely deck with gorgeous views. The rooms are still not large but who stays in the room anyway when you have such beautiful surroundings. : ))) The rooms have been redone however and are done very nicely in dark woods. All of the rooms have balconies that look out to the pool area and the gorgeous beach. If you stay for 2 nights or more, you can get a package deal that includes breakfast and lunch. The menu was a little limiting but if you can find something that you like it is well worth taking the package offer. You can also drive into the town of Quebradillas to eat. There are a couple of fast food places as well as some of the local cuisine that is very good. Plus there is a grocery where you can stock up on some stuff. One note of caution, from June-August a summer camp is there and the noise level is quite loud by the pool area and if you are located in a room near the pools you can still hear the noise with the door shut. Parador El Guajataca is a place that should not be missed...Hope you enjoy your stay!!", "Date": "June 28, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Hampshire", "Title": "“Gorgeous view!! Easy to get to, nice facility”", "Author": "niederberger16", "ReviewID": "UR7961026", "Content": "This was overall a very nice place to stay. The pool scene is great!! There is a huge 30 foot(ish) pool, two jacuzzis, and a smaller circular-in ground pool. Each room is ocean front, and the beach is just at the bottom of the hill. A sign says no swimming due to big waves and a risk of an undertoe near the middle portion of the beach. A lot of surfing is done here, so its a lot of fun to watch them or even take lessons! Swimming is still permissible in the waves (and actually a lot of fun!). The restaurant and bar are great!! The food is traditional Puerto Rican, but the servers were great and extremely helpful. On a friday or saturday night, there is live music and when a huge crowd is around (for weddings/events) its a hoppin' place!! The room is plesant, simple, but clean. The hotel might need a bit of a clean-up/facelift on the outside...some equipment is laying around, roof isn't spectacular, but for Puerto Rico its a nice place! Just a short drive to the Camuy Caves and the Arecibo Observatory. Less than a 2 hr drive to San Juan.", "Date": "June 22, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Puerto Rico", "Title": "“Pleasant stay at Hotel El Guajataca”", "Author": "monicaenid", "ReviewID": "UR6821694", "Content": "My fiancee & I stayed at the Hotel El Guajataca for our 4 year anniversary. Overall, we had a very pleasant experience; rose petals on th bed, champagne, strawberries, an amazing oceanview from our balcony... They're still renovating the areas, but our room was comfortable and always very clean. There are 2 pools, 2 jacuzzis and 2 bars. The hotel restaurant is just ok. We had the meals-inclusive package but is it not necessary; there a lot of options nearby specially if you like seafood. The service at the restaurant was good for breakfast but could improve in the evenings. A car is a must. Do visit the Camuy Caves - very impressive - (closed Mondays & Tuesdays). Check-in & Check-out took about 2 minutes, which was great. Can't speak about all the rooms, but we stayed in 203 and had no problems. On the downside, you can't swim on the beach; the water is too rough... great for surfers that put on quite a show each afternoon. This is no a luxurious hotel but it's still a very good option for a different experience during your visit to beautiful Puerto Rico.", "Date": "February 21, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Pottstown, Pennsylvania", "Title": "“Great View but rooms are very basic”", "Author": "vettewomanpa", "ReviewID": "UR5800847", "Content": "I stayed here 3 nights, the hotel gets lots of locals on the weekend but is empty during the week. The room is very basic, with a small bancony. There are tiny ants all over the place, don't keep food in your room or they will be in it! I complained about the ants but they did nothing. I even changed rooms from the original I was in, the 2nd floor was a little better. The pool is Hugh! I had it myself during the week. The biggest attraction at this Hotel is the view and beach. The waves are BIG, you cannot swim here but if you like hanging out on the beach, this is the spot! Be careful if you walk in the surf, I cut my foot on some coral and had to have the life guard fix me up.", "Date": "September 14, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "cayey", "Title": "“good hotel, but...”", "Author": "A TripAdvisor Member", "ReviewID": "UR5431453", "Content": "Very nice view, pools where excellent but rooms are in need of a renovation asap. Food was good but not much to choose from. Bar ok but did not have any ice for the rooms or DRINKS. This hotel can be such a special place if only they renovated the place. Also did not like the fact that we had to share the pool with people that are not staying in the hotel. I hope the management reads this too. The got alot of work to do.", "Date": "July 5, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Rooms": "3", "Value": "5"}, "AuthorLocation": "Norfolk, Nebraska", "Title": "“The best view and inexpensive to boot”", "Author": "Palooka", "ReviewID": "UR4986875", "Content": "If you are loking for luxury and pampering, go elsewhere. If you want the most gorgeous view and a patio to look off of, sounds of ocean waves to lull you to sleep, stay here. Great for kids with a playground and pool. I have been there > 10 times. Bakery and retaurants nearby. I have been to Puerto Rico > 20 times for business and love to come here for privacy and the view", "Date": "April 18, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "New York", "Title": "“Hated It!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4734881", "Content": "We stood one night, it was like staying @ a cheap motel except for the view. It was like pulling teeth to get clean towels and the room was very dull. The view was nice but nothing extravegant. The pool was really the only nice thing although we had to wait for the life guard to show up. ( he was late) I would never, ever return there. The soda machines were broken. The ice machine was no where to be found. It really wasn't a nice stay at all. Sorry", "Date": "March 26, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Whitestone, NY", "Title": "“Dont Stay Here!!!!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3530760", "Content": "My husband and I were suppose to stay for 4 days we only stayed 1 night. This place is terrible I spent the whole enitre night killing bugs and roaches in the room. The food in the restaurant had a bug in my rice. I was so disapointed this place has a wonderful view of the ocean but the cleanliness is terrible. The room was so dirty I didnt even want to lie on the bed. For the amount of money this place charged us for a night you could go further up to Aguadilla and stay at El Cielo Mar and get a wonderful room with delightful people. Thats what we did, thank god we were able to get a room at that place. I would not stay in the hotel even if the room would be free of charge. Please no one stay here, my husband and I stood 2 nights in San Juan at the Hilton what a difference to this place.", "Date": "June 5, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Nebraska", "Title": "“Beach, palm trees, waves right off the balcony.”", "Author": "dainaadele", "ReviewID": "UR2617129", "Content": "My husband and I stay here often when we are in PR. It serves as a weekend getaway from the professional responisbilites that bring us to PR every year. It is not a hotel that exists to serve Americans, it is where PR families stay for their vacations. The rooms are minimal, hard beds, basic shower, but clean. If you are looking to get a pampered hotel stay, don't go there. While the surf is too rough to swim, everything else about it is wonderful. While I have been to many \"beachfront\" hotels, more often than not: the hotel is on the beach alright, but you can't see it unless you get outside and walk a bit. Here every room faces the beach, you can just experience it sitting on your balcony. Just north of there, up the highway, is a senic overlook that is breathtaking. And if you are adventurous enough, you will eat lunch from the vendor that parks up there, very delicious authentic PR food! Back at the hotel, you can walk along the shore, scramble over rocks until you reach the spot where a small river/creek opens into the ocean. Often you will see local families coming there to swim. Most of the time you will be the only mainlanders there. You definitly need a car. There are a couple of decent restaurants in the area, one has a tables on a porch so even as you eat you can look out over the water. Very relaxing, very Carribbean!", "Date": "October 3, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Keyport, NJ", "Title": "“Beautiful location, but needs renovations”", "Author": "A TripAdvisor Member", "ReviewID": "UR1839178", "Content": "I have been visiting this parador regularly since 1991. It offers a beautiful view of the Atlantic Ocean, a serene atmosphere and is right on the beach. It's seems each time I visit, the conditions have deteriorated a little more. Although I love the location and the staff who are very friendly (they remember us year after year), I am extremely disappointed with the conditions of the property. This parador has an enormous amount of potential but has not yet taken advantage of it. It has a good restaurant and an okay pool. The rooms desperatley need upgrading (nothing has changed since 1991). The air conditioning was not working properly in several rooms (I heard other guests complaining too). The bathrooms need renovations and the pathways to pool and beach areas need to redone. They need to expand the hours for the pool (they open around 9:00 or 10:00am and close around 6:00 pm) and consider maybe actually putting a bar in the pool area. The grounds need to be maintained a little bit better as well. They recently added a small game room with pinball machines and a couple of arcade games which is great because there is always alot of families with children vacationing there. During my most recent stay (April 2004), I was told that they may be receiving a loan to renovate the parador. I hope that this is true because all in all this really is a beautiful location and I truly would love to continue staying there for many years to come.", "Date": "April 26, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "New York", "Title": "“Great Deal - But Remember its a Parador!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1438189", "Content": "This is a parador located on the beach, but unfortunately the waters may be too rough for swimming directly in this location, although you could consider a walk along the shore! The view is beautiful, though, and rooms have terraces overlooking the beach. Keep in mind, this is a reasonably priced parador (sometimes rates include breakfast), so it does NOT have the luxuries of a large hotel (such as you might find in San Juan). The beds are a little hard - but I found that they did wonders for someone like me who has back problems! There is no room service, but there is a small restaurant on the premises. The staff is most accommodating! All in all, for the area and the price, it is a a good deal.", "Date": "November 5, 2003"}], "HotelInfo": {"Name": "Parador El Guajataca", "HotelURL": "/ShowUserReviews-g644391-d150417-Reviews-Parador_El_Guajataca-Quebradillas_Puerto_Rico.html", "Price": "$119 - $169*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Road #2 , Km 103.8</span> | <span class=\"extended-address\">Terranova Ward</span>, <span class=\"locality\"><span property=\"v:locality\">Quebradillas</span> <span property=\"v:postal-code\">00678</span></span>, <span class=\"country-name\" property=\"v:country-name\">Puerto Rico</span> </span></span></address>", "HotelID": "150417", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/59/1f/591f881524c08ef900144448c1b50c161large.jpg"}}