{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bangkok, Krung Thep, Thailand", "Title": "“Small but clean rooms”", "Author": "dubbs2012", "ReviewID": "UR127391949", "Content": "My friend and I stayed at this hotel for 3 days/2 nights while visiting Singapore. The lobby is very nice looking and clean. Our room was clean and tiny, but I guess you can't expect much larger when you are working with a small budget. The full/queen bed (I'm not sure which size) took up most of the room, with just enough space around the perimeter to fit a suitcase. Bathroom is also very small and shower is not separate, but I have noticed this is somewhat common in SE Asia. I liked the blackout curtains too, which completely blocked out daylight and helped me sleep well. There did seem to be a small ant problem as I found a few on the walls and in our bed. Free WiFi was a bonus. The location is not great if you want to use the MRT as it is a bit of a walk (for the heat) but I think there is a bus that you could take to the MRT station too. The neighborhood felt relatively safe and quiet at night, and there was a convenience store nearby if you needed water or food. The Whampoa Markan hawker center is very close by and has a great selection of dishes. I would recommend this hotel for people on a tight budget who don't mind being a little far away from the main public transport system.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“good”", "Author": "Azzurro_85", "ReviewID": "UR124280532", "Content": "Stay in twin room for 2 nights. No odd smell in room, staffs are nice and polite. Clean room and bathroom, but I hope there is at least one clothe hook in the bathroom, so that I can hang my towel. Bus stop in front of hotel, but MRT is quite far... Overall, I'd recommend this hotel.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Petaling Jaya", "Title": "“Great & Affordable Place To Stay.”", "Author": "Jameswwt", "ReviewID": "UR122060982", "Content": "Great location, Great room even thou its a little cramp but comfortable, Cold air-con, Clean & Most of all, bus station was just meters away & plenty of Singapore hawkers food stall around at the wet market. 24hrs convenient stall just beside the hotel. The only comment is the hotel staffs is quite unhelpful & a little unfriendly. Hope the Hotel Mgt will improve their staffs service. Overall = 4 points to the Hotel", "Date": "December 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“Very Nice Budget Hotel”", "Author": "wolfpackgirl12", "ReviewID": "UR119011340", "Content": "This is Singapore, so unless you want to stay in the redlight district, you will have to pay a lot for a very basic budget hotel. Singapore is a tiny country, so hotel rooms are typically small and expensive. Based on those facts, I have to say that this hotel is a really nice budget (by Singapore standards) hotel. The staff is nice. The Internet works well, and was included in the price of the hotel. The hotel decor is modern and very nice. The room I had was nice and clean. It was small, but this is typical in Asia. The bed was very comfortable. It was firm, but I like firm beds. The bathroom was small and the shower was located in the middle of the bathroom (something else that is typical in Asia). There's a bus stop right in front of the hotel, so it's easy to get around Singapore. I enjoyed my stay and would definitely stay at this hotel again.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Sydney, Australia", "Title": "“Very expensive broom cupboards”", "Author": "tonypires76", "ReviewID": "UR117563251", "Content": "We stayed here for a couple of nights at the beginning of the week and then had another night at the end of the week. We were surprised to find out that no rooms have windows - only the superior ones. The rooms were dirty, stank of cigarette smoke (even though you can't smoke in the hotel), and were so small that the 3 suitcases didn't fit. The bathroom is as big as an airplane toilet with tje shower above the toilet. We asked for a room with windows on our last night (5 days away) and were told that they'd do they're best as it's first come first served. Even though we were returning guests and were giving them 5 days notice they didn't care. On the last day we arrived only to be told that they were fully booked so we were put on their other sister hotel down the road and this is when we found out about the windows only in the superior rooms. We were offered free wi-fi for the inconvenience and when we told them that we already had free wi-fi as part of the booking, they just laughed!! Never again. Plus, it was not cheap!", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Mosta, Malta", "Title": "“Pretty good value for money for Singapore”", "Author": "Cosmo44", "ReviewID": "UR117277361", "Content": "I would agree with most of the comments made by other reviewers. I stayed at the Hotel Value Nice for four nights in August 2011 and found it a satisfactory base for exploring Singapore, even though it is some distance from the centre. It is easy, however, to get there by 'bus (around 20 minutes to Raffles Hotel). The nearest MRT Station, Novena, is 5 minutes away by 'bus, going in the opposite direction. You should be aware that there are no fewer than three branches of the Hotel Value chain in Balestier Road. I was dropped off at the wrong one by a taxi driver, something that happens quite regularly, I understand. The cost of hotel accommodation in Singapore is on a par with London - and is perhaps even higher. I thought that this hotel offered pretty good value for money. There is no breakfast room, but the rooms are equipped with a small kettle and a couple of mugs, as well as complimentary bottles of water. There are also sachets of coffee and tea - but pre-sugared (yuk!). There is, unfortunately, no minibar - not that there would be room for one! There is a small convenience store right next door to the hotel, and two diagonally opposite it, so I was able to buy basic breakfast items there. The choice of cafes and restaurants in the immediate vicinity is rather poor, I thought. The area close to Novena MRT Station has a much better variety. I was glad that I had paid a little extra for a superior room, with an external window. Cheaper rooms don't have one, which must make them very claustrophobic. My room was quiet and I slept very well. There was a huge mirror behind the bed, which made the room seem much larger than it actually was. The furniture and decor were in very good condition. Almost the entire space was taken up by the bed. There was no point in unpacking, as there was nowhere to store or place items, apart from four hooks on the wall. The en-suite bathroom was tiny, but perfectly OK. There was plenty of hot water at all times, though the shower was an 'open' one, which meant that you needed to do things in the correct order. The floor, however, dried pretty quickly. Free wi-fi Internet access was included in the price. I found the staff pleasant and helpful. The reception desk is so high that you can only see the tops of their heads when you pass by! The appearance of the public areas is smart and the lift is huge for the size of hotel. Would I stay at the Hotel Value Nice again? I probably would, as I don't think there are many places in Singapore offering better value for money. I paid just under 340 USD for a four night stay, which may seem a lot for a two star hotel, but believe me, it's not much by Singapore standards. Balestier Road is hardly glamorous (most of the shops lining it seem to sell furniture or lighting), but it seemed safe to me - and, as I mentioned earlier, public transport links to the centre are good and fast.", "Date": "August 26, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Budget Hotel with a comfy touch”", "Author": "Cal_TheHotelLover", "ReviewID": "UR116377100", "Content": "When it comes to budget hotel, my biggest worried is - crappy bed, dirty room, and cockroaches! At Value Hotel Nice, my worries are settled! Yes, the rooms are small as in really small but you can't find a bed as comfy as this in any budget hotel. As I were to compare to the recent V Hotel at Lavender, Value has better bed and it's even cleaner than V! For just a mere $100 this is great. Though there's no amenities like mini fridge, mini bar and a personal safe with bath room which cannot fit anyone bigger, it is a great budget hotel. You can get local delicacy around the area and convenient store just steps away from Hotel. They could have better staff though. Yes it's a budget hotel and you can't complain much, but a basic customer service with smiles is a must. This hotel is suitable for transits stay who wish to try local delicacy with a cinema nearby. Will come back again for short stays. :)", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Melbourne", "Title": "“Great for overnight stays”", "Author": "WizardMelbourne", "ReviewID": "UR116326641", "Content": "Stayed at the Value Hotel Nice early August 2011 for an overnight stopover and found the budget hotel surprisingly comfortable for the price. Check in and out efficient and speedy. The rooms are small, very small, two people in the room make it crowded and little space for unpacking cases. Bathroom very small, but has toilet, shower and sink. No separate soap or hair shampoo, but gel containers on the wall. A word of advise, toilet first before showering, as the shower water will make the bathroom and toilet very wet (no separate shower cubicle) Comfortable double bed. No outside noise polution for our 5th floor room, but we did hear passageway noise from loud selfish guests. The hotel is away from the main tourist areas of Singapore, perhaps 20 minutes by taxi from the airport and 10 minutes from the shopping areas, but buses and taxis easy to get outside the hotel and inexpensive. Be careful when giving instructions to taxis to take you to this hotel as there are two Value Hotels in Balestier Road and a distance apart, we alighted at the wrong hotel and confusion ranged whilst we sorted things out. If you trying to avoid the ridiculous hotel prices of Singapore hotels and looking for a comfortable short stay hotel at reasonable cost, the Value Hotel Nice will be fine. If your looking for a plush hotel, with pool and other mod cons, this is not for you. We would stay here again for short stop stays.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“A Nice Value Hotel”", "Author": "mmchelle", "ReviewID": "UR116238405", "Content": "The hotel was better than I've expected. Both of us stayed for 2 nights. They converted the old shophouse to a budget hotel with another extension of 4-story (I guess) building at the back. Facade was nice. Room was very clean but a little too small. Did not even have space to put our bags. Fortunately we got the room with windows, if not wouldn't want to be in such a small room with no windows at all. Bathroom was really small too but fully equipped with hotel amenities. Hot water for shower came on and off. By the time you're done with your shower, it's all cold water. Location was good for cabs and bus, no MRT station.. nearest would be about 15mins walking distance. Surrounded with coffeeshops, cafes and a 24hr convenient store next door. Hotel staff were polite and friendly. They helped to keep our luggage after checkout till 6pm. Overall, this hotel really just serve you as a place to sleep and shower. Clean and affordable. Recommendable.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "malaysia", "Title": "“Decent Hotel with reasonable rate”", "Author": "jess_msia", "ReviewID": "UR116195070", "Content": "Room: The room is small with almost 150cm x 150cm bathroom. Those who are not as petite as me might have the problem when using the bathroom. There is no slipper provided as the floor was sticky due to the floor detergent. It was uncomfortable to walk on without slipper. Other room amenities are ok, I love the instant Tea provided the most. Location: The location is good for those who know Singapore quite well and the bus stop is just in front of the hotel. It was my first time to Singapore so it was not as convenient for me because I don't familiar with the location and travel by bus is not the good choice. Besides, Shaw Plaza is just 5 mins walking distance from the hotel and there is a cinema and supermarket in this Plaza. Not much to shop around in this area. Food: There is a big big food court behind this hotel. I found out after a few days of my staying there. Not manage to try all the food in the food court. Balestier is well known of \"Bah Kut Teh\". So there are many shops which promoting it. Foreigners may try it.", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Bangalore", "Title": "“Decent hotel”", "Author": "Vishal_Bangalore", "ReviewID": "UR114901384", "Content": "We stayed here for 2 nights while in transit from Bali to India. The hotel is decent if seen in the context of Singapore hotels and their prices. Yes, it is very small with a very tiny bathroom but everything is very clean, front desk is friendly, neighborhood is good (few restaurants nearby, MRT station is about 15-20 mins walk and it is easy to get taxis), so if one is on a budget and the purpose of Singapore visit is to spend maximum time outside and hotel is needed just for good night's sleep, then one can't go wrong with this hotel. Only thing I missed and which I will suggest to hotel management is to keep \"Deposit Safe\" in the room. I didn't feel safe in keeping my valuables and passport in my luggage in the room and so used to take those everyday with me.", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“Nice value hotel on Balestier”", "Author": "chicagoball", "ReviewID": "UR111260495", "Content": "Nice newish small hotel with small rooms on Balestier. Next to a mall that has a cinema, restaurants and supermarket. Basically a no frills hotel but reasonably comfortable. A very quick bus ride to Novena MRT and mall. Free internet is a nice perk. Good for when you need a bed but are out all day. Good value.", "Date": "June 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Pasay, Philippines", "Title": "“Doesn't seem like a Budget Hotel at All”", "Author": "foreveryoung24", "ReviewID": "UR104453093", "Content": "Hotels in Singapore are way too expensive... If your only looking for a place to sleep after a whole day of shopping and \" lakwatsa \" Value Nice Hotel is where you should stay. A Superior Room with window for a four days and three nights stay cost us S$297. With that price goes a small and clean room no odd smell, a queen sized bed, flat screen TV, clean standing shower complete with basic toiletries, tea and coffee making facilities. Mineral water, coffee and tea, toiletries, towels were being replenished everyday. There a daily house keeping service, just be careful on your variables. No complaints with the size of the room as an Asian, the space was enough. Bed and pillows were comfortable, the air conditioning system and lights are working well. What I liked most about this room is the large window beside our bed, this is where I ate my breakfast everyday, kopi bun bought at Whompoa Market and coffee ^_^. Location is great as well, from the airport you may take a MRT, alight at Novena Station, take cab for S$7.00 to the hotel. If your planning to just walk from the hotel to the MRT Novena Station forget about it! cause we've tried it and it took us 20mins before we get there, it was too tiring for us. The best way is to crossed to the other side of the hotel, look for the nearest bus stop which is a few walks away and take bus service #21 for S$1.00 coin it will take you to the Novena Station already. There are lot of places to eat near the hotel, theres one serving Bah Kut Teh for S$6.00 - 10.00, Malay food at the back of the hotel, theres also Peking Duck, Durian fruit for S$12.00, Mc Donald's is also near 2 blocks away from the hotel, Whompoa Market where I bought the Kopi Bun and a lot of food choices in there, a convenient store is also located beside the hotel ( left side ) where you can buy water 1L for S$3.00, and Ma Chang or sticky flavored rice is available as well for S$1.00 - 3.00. On my next visit to Singapore, for sure I'll stay at Value Nice Hotel again ^_^", "Date": "April 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Selangor", "Title": "“It's okay for a budget hotel.”", "Author": "MichelleCEP", "ReviewID": "UR103393493", "Content": "Stayed for one night. It was very small but what can you expect much from a budget hotel, right? But i wish the bathroom was a bit bigger and the sink was not clean properly. Other than that, the bedroom was clean and the staffs were friendly too. When i viewed the website of this hotel, it was stated parking space available. But when we reached, there was only THREE parking spot available! But we were very lucky to have a space there, if not we will have to park elsewhere which will need parking coupon.", "Date": "April 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Jakarta", "Title": "“Very comfy bed..”", "Author": "gabzpanda", "ReviewID": "UR94963750", "Content": "Value Nice Hotel is a very nice and clean budget hotel. I know that hotels in Singapore are very expensive because of the limited spaces, so I really think that this hotel give a nice value for money. The room is very small (of course, same like all budget hotels in Singapore), but for me it's sooo comfortable, especially the bed. The service is also good. The location is in Balestier Road, many food near this hotel and there's 7/11 right beside this hotel. Bus stop also right in front of it. The nearest MRT station is Novena Station, about 10-15mins if you walk, I recommend you to take a bus there but it also wouldn't kill you if you choose to sightseeing and walking to Novena. :)", "Date": "January 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Small But Very Clean & Comfortable”", "Author": "LouisLee", "ReviewID": "UR90389558", "Content": "I was staying there with my partner for 3 days 2 nights. The room was small but we were not surprised as we had already seen the photos. The room was clean and comfortable. The big mirror that attached to the wall behind the bed made the room looked more spacious. The bus and taxi station was right outside of the hotel, it took only 5 to 7 minutes ride to the nearest MRT (Novena / Boon Keng). Overall, it was a happy stay and considering the rate in Singapore, it was good value for money.", "Date": "December 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Tiny rooms, but clean and comfortable”", "Author": "aussie_history_lover", "ReviewID": "UR86352968", "Content": "On a 3 day stopover in Singapore was recommended this hotel by a friend. Very clean room with all modern fittings and furniture. Room was not much bigger than the queen size bed but that was all one person needs. Not much room for leaving cases open but was able to stand it upright at the end of the bed. Kettle and cups and saucers were provided. Wouldnt recommend the instant \"3-in-1\" coffee and tea provided though, but next door there is a small store that sells small jars of coffee. Shampoo,bath gel, hairdryer and towels provided. Flat Screen TV that struggled to get reception on most channels, but there were a couple of good English speaking choices available. My room was at the back and no street noise at all. Shower cubicle IS bathroom, so similar to a number of European hotels I've stayed in, but much cleaner. Loved the late check-out of 1pm as it fitted well with my schedule. I would recommend this hotel to anybody who just wants a modern, clean room and a comfy bed.", "Date": "November 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Chennai", "Title": "“Small for lesiure & long stay”", "Author": "KSSkanth", "ReviewID": "UR83314168", "Content": "Date of Stay : 23-July-28-July-2010 Selected this hotel with the budget in mind for a lesiure stay. The first room given was very small.... rather a jail cell with no windows. I checked-in with a kid of 2 years and found this too difficult and requested for a change since the stay planned was for 4 days. I was moved to another room which was fairly better with a large road facing glass window. Again the size was small, but manageable. There are no cupboards/storage or even place to keep the boxes/clothes you bring. Some of the staff were courteous where some of them are rude. No room service & food/restaurant since a budget hotel.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Satara, Maharastra", "Title": "“Perfect choice for Budget Travellers”", "Author": "Shakeel_Shaikh", "ReviewID": "UR77115108", "Content": "Just like majority of Indian Tourists we first tried to book hotel in Little India area but we can’t find suitable one in our budget range and we didn’t want to stay in Gaylang area, after lot of search we came across to know this Value Hotel Nice in Balestier area which isn’t much far from Little India, We booked this Hotel for 400 S$ for 4 nights (Including Taxes), very reasonable price according to Singapore standard, rooms are small but aren’t that much smaller as some guys are complaining here, hey it’s Singapore! An island!! Space is very limited here you can’t expect larger room in this price category, The thing I like most about this hotel is its shiny brand new, very clean & comfortable. As I mentioned earlier the rooms are small but have modern amenities like good pair of beds, powerful Aircon, Tea/Coffee maker, 32’’ LCD TV plus we also got free Internet connection in reward of our booking made through Booking.com. Attached bathroom is small standing shower type but very clean & neat. The convenient location is another plus factor of this hotel, just 15 min. Walk from Novena MRT and there is bus stop right in front of hotel from there you can reach easily anywhere in Singapore. The hotel do not have any restaurant but there is are of local food joints around the hotel and you can always have McDonalds & KFC which are in Shaw Plaza (just 2 mins. Walk from Hotel) Bottom Line: If you are budget travellers like us and just want convenient location, clean room & bathroom, good sleep, free Internet then this is right hotel for you", "Date": "August 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Bonne Terre, Missouri", "Title": "“It was an itsy bitsy teenie tiny room...”", "Author": "ems622", "ReviewID": "UR75443544", "Content": "The room was small even by any standard. Close to the Novena metro stop (15 minute walk or a 5 minute cab ride). The hotel was very clean, front desk was helpful, but the rooms were just flat out tiny. Really nothing exciting around the hotel. Definitely have to take the subway or a taxi to get to any of the attractions.", "Date": "August 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sharjah, United Arab Emirates", "Title": "“Not suitable for a family with 2 children!!!!!!!!!!!!!!”", "Author": "Arshaad2010", "ReviewID": "UR73214460", "Content": "Date---July 16th,2010 While coming from the airport,the driver was confused as to which Value Hotel,as there are 3 in the same area.As I had address in hand,the driver got us off in the right hotel after a 2nd attempt.My husband seeing the outer look(they have maintained old,moorish style) was wodering how the hotel would be,as I had made a booking online thru booking.com. Once inside he was relaxed seeing the good and simple,modern look of the reception.We had booked Superior room,it had one queen size bed,no room to move around or keep bags.Managed to squeeze in.There is no cupboard to keep dresses or luggage.The dressing table also very small.The decor of room was good with beautiful curtains and comfy bed,but had to sleep crosswise as we were 2 adults and 2 children. The receptionist knew all the bus routes well and the bus stand was just 2 shops away from the hotel,5 minutes walk.Location was good,better than Little India area which I stayed last year. No meals service in this hotel.Has window in every room.They provide umbrellas if asked as it was raining at the time of my tour.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Noisy ground floor, avoid this floor especially rom no 116”", "Author": "Jufri64", "ReviewID": "UR73083498", "Content": "Got to stay on the ground floor, so damn noisy early morning, it's either the cleaners or the tenants checking out standing at he lobby. Hot water not so hot after 20 minutes.", "Date": "July 31, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Manila", "Title": "“Good for short stay!”", "Author": "thepinkmaria", "ReviewID": "UR70622129", "Content": "Hotel value nice is a budget hotel so expect for a small \"tiny\" room but enough for asian couple. Like any other hotels they have free coffee making facilities and complimentary 2 bottles of water daily. LCD and INTERNET is a plus of which most hotels in singapore would cost you 20 SGD and above. What i love about them is the cleanliness since its a new hotel I prefer a brand new 3 star hotel than an old 5 star hotel. what i don't like about them, they don't have closet for your things just a few metal hangs and that they also don't have in-room dining service though a 24 hour convenience store is just few walks away plus lots of hawkers stall just around the vicinity. the service is good and checking in and out was smooth. they change linens daily or as per request as well as the towels. Good location though its situated in Balestier, there's a bus stop just outside the hotel area. For breakfast you can take local kopi and bun at about 10 SGD not bad for its taste ;) Overall its okay of your staying a night or 2 more than that you'll get bored.", "Date": "July 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Singapore, Singapore", "Title": "“the best choice for budget holiday”", "Author": "susana0172", "ReviewID": "UR69747671", "Content": "I think this is one of the best budget hotel I've ever visited. The hotel is very clean, good interior design, and very modern. the room is very small and the toilet is just the size of a cupboard :P They have live world cup matches broadcasted in every room (you need to pay / go to the pub to watch football in Singapore). consider the scarcity of land in Singapore, the room size is still acceptable (if you want a bigger room means you need to pay extra, which defeats the purpose of staying in budget hotel!!) internet is a bit expensive though. 4SGD for 1/2 an hour OR 10SGD per day if I'm not mistaken. location-wise, not so good. you need to take a bus to the nearest MRT i.e. Novena (red line) / boon keng (purple line) or take a \"super packed\" direct bus to Orchard Rd.", "Date": "July 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Auckland Central, New Zealand", "Title": "“Small but adequate”", "Author": "parsley72", "ReviewID": "UR62704999", "Content": "We had the misfortune to travel to Singapore during Eyjafjallajökull's recent activity, so every hotel was full of travellers waiting to return to Europe. At the last minute I managed to get rooms here but we weren't sure what to expect. The hotel is new and very clean, and the staff were polite and helpful. The rooms were tiny; very little space round the edge of the bed, and the bathroom was also the shower cubicle. But for a place to crash after business it was fine, and better than sleeping on the office floor! There's no breakfast and didn't seem to be many places in the area to eat. You need to hire a cable from reception ($10 a day I think) for internet access, but you'd have to sit on the bed anyway.", "Date": "April 28, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“hotel in Singapore”", "Author": "DanielC32", "ReviewID": "UR59385590", "Content": "Very nice hotel, only bad thing , no breakfast.Situated in a very nice area.You have many facilities very near the hotel.People in the hotel are very very nice and helpful.Rooms are big and clean.Very silent hotel", "Date": "March 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“Good little hotel”", "Author": "PoliPerth", "ReviewID": "UR48217520", "Content": "We arrived at 4am after taking a taxi straight from the airport, and were in our room within 10 minutes, a wonderfully fast check-in, very much appreciated at that time of the morning! No forms to fill in for a change, the pleasant young man just wanted to see our passports and the hotel booking confirmation (we booked through Booking.com). We only booked the room for one night, we just wanted somewhere clean to sleep for a few hours before being able to check in to our other hotel. The room was small, with an even smaller bathroom, but was spotlessly clean, and the usual things in the bathroom were provided, this was a surprise for a budget hotel, but there was soap, shampoo and toothbrushes. Nice clean towels. The room had a queen size bed, a small cupboard, and flat screen tv on the wall. Our only complaint (although we didn't complain to the hotel staff, no point as it was only for a few hours to rest after our flight) was that our room was at the front of the hotel, directly onto Balestier Road, which is BUSY AND NOISY!!!! So make sure to ask for a room which does not front onto this road. There is no onsite restaurant for breakfast, although there was some kind of shop next door which sold chicken (I think), but 50 metres along to the right, there is an open cafe-style hawker's place which does kaya breakfast, it was delicious! A good choice for us, affordable, clean and nice staff. Considering the average cost of Singapore hotels, this was good value.", "Date": "November 1, 2009"}], "HotelInfo": {"Name": "Value Hotel Nice", "HotelURL": "/ShowUserReviews-g294265-d1511521-Reviews-Value_Hotel_Nice-Singapore.html", "Price": "$79 - $112*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">302 Balestier Road</span>, <span class=\"locality\"><span property=\"v:locality\">Singapore</span> <span property=\"v:postal-code\">329738</span></span>, <span class=\"country-name\" property=\"v:country-name\">Singapore</span> </span></span></address>", "HotelID": "1511521", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/23/82/2382ec8602258a00ae3cd3a7793bbf8b1large.jpg"}}