{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Poor experience in a beautiful place!!!”", "Author": "Thefairjudge", "ReviewID": "UR122428712", "Content": "Bad service, poor cleaning, & bad treatment for P.R. residents.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Mayaguez, Puerto Rico", "Title": "“Awesome experience in the middle of the rain forest.”", "Author": "golflover26", "ReviewID": "UR121465717", "Content": "As some body else already said in another review, it's difficult to rate this place based upon the normal standards for a hotel since this is a \"suis generis\" spot in the middle of the rain forest in one of the most remote towns, though very beautiful, of Puerto Rico. The whole setting is what makes this place special. It was built in 1858 as a coffee plantation house and during the last three decades it's being operated as a parador or bed and breakfast. It's currently operated by the municipality. The staff in general is very kind. The service is nice; the food is what you would find at any puertorrican middle class home. Home style food. Generous portions. Don't expect food cooked by a chef; it's cooked by local women, that cook the same way they cook to their families. Nothing fancy at all but with very nice flavor. The rooms are not in top condition aesthetically speaking but are very clean. They have cable TV. I went with a group that took the whole place for us, and had a blast there. Looking forward to go back.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Juan", "Title": "“Great getaway destination”", "Author": "niqr", "ReviewID": "UR118657011", "Content": "My husband and I stayed here to get away from the busy city lifestyle. It is a great getaway destination outside of the Jayuya town surrounded by nature. The room was clean and neat as well as the bathroom and the common areas. This “parador” imitates an old house with swing chairs and memorabilia. The food at the restaurant is superb. The small pool is perfect, but the water is way too cold. I truly recommend this for couples, not so much for people with small kids.", "Date": "September 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Portland, Maine", "Title": "“Nothing fancy, but surrounded by such beauty!”", "Author": "WoodAbbott", "ReviewID": "UR111142608", "Content": "I don't know how to rate this place, because it's not for everyone. I gave it 5 stars because it was the best part of our trip to P.R. My husband and I had a wonderful time here, and I\"m puzzled by the horrible reviews. Some of the reviews are years old--we stayed late May 2011 and the beautiful old place had been recently repainted and looked great. The food wasn't fabulous--the food in P.R. runs to fatty and fried everywhere you go--but the people were nice and the room we had--#19--was wonderful. Yes, the tiles were chipped and the water was tepid--but honestly, the building is 165 years old so we didn't expect a Marriott Courtyard. The big bonus is that you're in the middle of a rain forest, and our room, which had windows on two sides, made us feel as if we were sleeping right in the jungle. It was magical. We loved the wraparound porches, the river-water pool, the hammocks, the wonderful Old World atmosphere. We would absolutely stay here again and ask for Room 19. (Huge comfortable bed.) And for the reviewers who complained that they don't speak English? Come on, really??? It's the mountain area of P.R.--they don't HAVE to learn English. Our bumbling efforts were appreciated, and hand signals can usually do the trick. Bonus: we paid $310 for two nights, two dinners, two breakfasts. That is a DEAL.", "Date": "June 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "McKean, PA", "Title": "“Beuatiful mountain get-away to experience the \"real\" Puerto Rico!”", "Author": "mckeaniac", "ReviewID": "UR99548949", "Content": "We have visited Puerto Rico many times visiting friends who live in San Juan. We wanted to experience more of the island besides SJ and the beaches. The Hacienda is in the central mountains of Puerto Rico near the highest peaks and is located on a former coffee plantation. The buildings and grounds are old (built in 1858) but lovely. We enjoyed walking around the grounds, photographing the gorgeous, tropical plants and flowers. The parador (Puerto Rican country inn) has 2 pools which were very clean. One of the pools is formed by diverting a small river and has a large waterwheel. There is a large deck/patio area and covered picnic areas surrounding one of the pools which would be a great spot for a wedding or party. Very picturesque!! We stayed during the week and had the place to ourselves. We chose the room rate which included dinner and breakfast for 2. The food was delicious, traditional Puerto Rican food which we ordered from the menu and included many choices. The staff was friendly. The balcony off our room was a great place to sit and read, sipping drinks, and listening to the birds and coquis. Our room was no-frills, old but clean. The bed was not the most comfortable we've ever slept on. Overall, this is a quaint inn with lovely mountain views, good food and value. We would definitely go back again!!", "Date": "March 9, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Barranquitas, Puerto Rico", "Title": "“Would NEVER go again to Gripinas... NEVER!”", "Author": "alextm21", "ReviewID": "UR84093203", "Content": "First of all, I will never recommend this hotel/parador to any of my friend and even my enemies. I was at Jayuya for a Business trip, and the first time that we came to Jayuya we stay at La Posada Hotel at Jayuya and it was not a pleasant stay, so for our second trip down Jayuya we got our company booked us Hacienda Gripina, hoping better results from our previous experience. So we drove all the way to Hacienda Gripinas, when we arrive there was no one at the Lobby/Front Desk, but we got a note with our names on it, that told us where our rooms where and the keys where left on the front desk, so we pick them up and walk all the way to the rooms, only to find one clean room out of three. The second and third room where all messy with used towels hanging on chairs, the bed seem like it has been used hours before, some cups of wine where also at the second room. The third room did not have any lights, only one lamp seems to work. So we went down to the lobby and found the only three people working at the Restaurant. We told to a man who seems to be some kind of manager and told what we just found at our rooms. He was very surprise like us and gave us two new rooms. We went to the rooms, and we found that we didn’t have TV/Cable nothing (though they gave us the tv controls) so for us the TV where just ornaments. Bottom line, WILL NEVER EVER AGAIN will go to Gripinas, prefer to stay at Ponce and drove 1 hour to Jayuya for work.", "Date": "October 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mayaguez, Puerto Rico", "Title": "“Excellent”", "Author": "theTruth_OK", "ReviewID": "UR77759151", "Content": "Staff was very friendly. Food was awesome. Rooms were EXTRA clean! Came for a business meeting and ended up purchasing an extra night. Will come back!", "Date": "August 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bridgeport, CT", "Title": "“Great for those who are looking to get away from the resort for a night or two.”", "Author": "zexalva", "ReviewID": "UR61911253", "Content": "First of all, if you come here without doing some research on the area you are going to be in for a surprise. Jayuya is the probably the most isolated town in Puerto Rico. No one speaks English (again if you do research you will know this- only 30% of Puerto Ricans speak fluent English), it has a revolutionary history (1950 they declared a short lived independence). You will be 4000 feet above sea level. There will be mosquitoes, lizards, wild dogs, and roaming chickens. Instead of riding bikes, the kids ride horses, yet they seem to wear all the up to date clothing. The ride there will be one of the most scenic and windy you have ever witnessed. If this kind of stuff interests you as it does me, you will love it. It was a great escape from the resorts at the Rio Grande and the hustle and bustle of San Juan. For $130/night two people get fed dinner and breakfast (average), but that is a steal even if they are feeding you dog food. For the best experience ask for room number 5 as it has the largest balcony. The beds are somewhat uncomfortable and there is no hot water, but this does not take away from the relaxing nature of the hacienda. Bring a book, some bug spray and relax in the nice wooden rockers on the main 30 ft balcony (that has spectacular views of the mountains). Relaxation is the key here. It does seem that the hacienda has deteriorated a bit since the town has taken over, but it still has great charm, and if you have a small Spanish phrase book you will be fine. When you go into \"town\" check out the rock with Taino paintings, the beautiful river where you can swim, the Taino museum the recreated mayors house (if you don't speak Spanish ask for Omar, he has basic comprehension of English and will love to tell you/rant about the history of the town. He will also offer you tours on horses and ATVs for discount prices compared to the more touristy areas around San Juan. If you do decide to come here, please do not cheat yourself out of driving straight from San Juan. The roads are clearly marked and you cannot get lost. This drive was remarkable and something that can only be understood by those who have done it. It is not dangerous at all (my girlfriend was freaking out the whole time before the trip, but was not scared at all when we were finally doing the drive). Just stay around 20/mph, honk around sharp turns and keep the camera on for amazing pictures. Do not go south to Ponce and then up! Do not go come here with children, as they will kill themselves with boredom and/or they might ruin an otherwise peaceful experience for other travelers. I WILL go back there, it is the type of place that one would retire to and purchase and run themselves!", "Date": "April 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Langley, WA", "Title": "“Odd but lovely and fun.”", "Author": "Luvs2G0", "ReviewID": "UR57944991", "Content": "This is a beautiful old hacienda that has seen better days. Some strange practices such as no answering machine on phone, so if someone not in the office (which happens frequently) you can't leave a message but have to keep calling back until someone answers. Another oddity: Has a gorgeous huge lower pool, fed by a natural stream. But as my friend discovered, once in the pool it can be extremely hard to get out because all the rungs lower than the water level are broken off. By design there is over 20\" between the water and the pool lip, so just heaving yourself over the lip is not an option for a middle aged woman. She eventually got out and mentioned the problem to a groundskeeper. He laughed and said yes, it was hard to get out-- even he had problems sometimes (!) These oddities might be explained by the fact that the municipality took it over 3 years ago for back taxes after the company that owned it went bankrupt. The hotel provides absolutely no information about what to do in the area, which is a shame because there are a lot of great hikes, museums, and activities in the area. The food is adequate, nothing more. In spite of all this, the grounds are lovely and immaculately kept up, the building and its verandas are lovely and comfortable. The staff is friendly. We actually had a really good time here, but it's not for everyone.", "Date": "March 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Cabo Rojo", "Title": "“Needs upgrade and could add coffee mystique”", "Author": "crp_8", "ReviewID": "UR57237903", "Content": "The Jayuya scenery is lovely and everytime we have an opportunity to get away and go to the mountains, Hacienda Gripiñas is an alternative to stay overnight, nothing fancy, what I would call an overnight shelter. In this respect I have to agree that many of the cons pointed out by many of the reviewers are true. It should not be this way. The rooms need better quality furniture and bed covers; pillows should be better. In my opinion Jayuya have some of the best coffee plantations in Puerto Rico and the hotel is not taking full advantage of this fact.. There is no special coffee mystique at the hotel (just regular drip coffee). The hotel could have an expresso or coffee bar with a fancy italian expresso machine, local coffee for sale, and have a coffee plantation excursion (as a consortium with local growers like Hacienda Don Pedro) including coffee tasting. Great locations such as Kona with their coffee in the big Island of Hawaii, Napa Valley with is wineries, and others are extreme examples of how to create a sound bussiness taking advantage of the production of good quality products. In the Central mountains of Puerto Rico, such an example could be created (\" Puerto Rico Coffee Trail\"). For now, I would recommend Hacienda Gripiñas as an overnight shelter", "Date": "February 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City", "Title": "“A different side of Puerto Rico”", "Author": "kad78", "ReviewID": "UR57121685", "Content": "We only stayed here one night, but I'm glad we made the trip inland and experienced mountain life in Puerto Rico a little bit. We enjoyed our stay here quite a bit, but I could see it not being for everyone. It wasn't cheap, but with the included meals I think it was a fair price. It definitely had a bit of a rough hewn charm, and anyone looking for a resort might be disappointed. But there's definitely something sublime about lying in one of the hammocks on the back porch listening to the coqui and assorted wildlife murmuring through the night. The staff is really friendly. The food ranges from decent to delicious. There are a couple of pools and though we didn't indulge they seemed clean and well-kept (not heated though). The only annoyance were the stray dogs that woke us up a couple times overnight when they started attacking each other. Not really the hotel's fault since there are stray dogs everywhere in P.R., but something you might encounter if you stay here.", "Date": "February 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Beautiful and well maintained - old coffee plantation”", "Author": "frugal_travelr", "ReviewID": "UR56546187", "Content": "We stayed here for three nights and it was a great experience. Staff was helpful and food great. Ask for a room upstairs with balcony, preferably the one facing the pool.", "Date": "February 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Tampa, FL", "Title": "“Beautiful place, poor accomodations”", "Author": "esculapiaxula", "ReviewID": "UR47425479", "Content": "I recently went to San Juan on a business trip and my colleage and I decided to get out of the city for some peace and quiet. Found Hacienda Gripinas through the Puerto Rico Tourism website and were looking forward to the experience. I must say that the drive there was beautiful, through the mountains of central Puerto Rico. The staff was helpful in giving directions. Common areas are well kept, with much charm. However, the room (Rm. 8) was another story: No hot water in the sink (as in when you turn the hot water on, NO water comes out). Only 2 towels in the bathroom (but the staff did bring more when we requested them). Bathroom door did not close, so no privacy. Shower was stained. Water in bathroom was lukewarm at best, so we couldn't mix with cold water. There wasn't enough water pressure with hot water only, so it was difficult to rinse soap off when showering. Forget about washing your hair. Poor lighting. There was a can of bug spray in the closet. Beds were very old, as were bed covers and linens. Stayed in a downstairs room, could hear everything from upstairs room, including flushing of the toilet that seemed to be placed right above my bed. The food was not very good either. The ham soup and the beans were good. We had the \"house specialty\", which was \"pollo a la milanesa\" (breaded chicken breast , deep fried, with marinara sauce and cheese), and it tasted like old grease. The desserts were not homemade and quite bad. I strongly feel that the room was way overpriced. We had reservations for 2 nights, only stayed one (as you can imagine). We were initially told that the credit card would be credited by the following Monday. When I called, the office manager said that the process would take approximately 30 days because it is managed through the \"municipio\" (town government office) and it would take that long to write an invoice and have a check made out. It's been a month since we were there, still no credit.", "Date": "October 21, 2009"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "5", "Service": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Wonderful, peaceful, scenic retreat”", "Author": "Rebelforever", "ReviewID": "UR44264642", "Content": "Hacienda Gripinas is a WONDERFUL place to stay if you want peace and quiet. It is an old hacienda, NOT a hotel, up in the central mountains of Puerto Rico. The views are spectacular! At night, it gets cold--cool breeze from the mountains, ahhhh! We had a huge balcony and would come out at night to relax and drink beer! We were serenated by an orchestra of bugs. It was like being in the middle of a jungle. It was GREAT!!!!! This place is for couples and mature people. Don't bring any kids or immature adults here. Both breakfast and dinner are included and they are both very good. I would recommend the omeletts for breakfast and the chicken asopao for dinner. Our two hosts, Miguel and Juan Carlos, were excellent! They made sure we were enjoying our meal and would accommodate all requests made. Therefore, although tipping is included, we tipped them. Orlando at the front desk could not have been more accommodating. He gave me precise directions to get to the Hacienda, he changed us to a great room because our initial room was leaking water from the toilet, and he even helped us with our bags. I noticed that the people of Jayuya are very proud people. When we went into town and asked people on the street for directions or for the nearby sights, they would stop and very enthusiastically tell you what you needed to know and then they would ask you if you visited this or that other place in Jayuya, and they would tell you what the site meant to them and give you directions on how to get there. Very nice, friendly and decent people. More so here than at other places we have visited. So, my advice to you is treat people with respect and you'll have a far better time. Like others have recommended, I also advise to get here from Ponce (Route 10) even if you come from San Juan. Last year, we took the north route (Route 149), and although you'll see some great mountain panoramic views and small waterfalls, it will take you more than 30 minutes through very narrow and winding roads--it's mountain driving!--and you could get sick.", "Date": "September 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Florida", "Title": "“Mountain treasure”", "Author": "LimekilnLady", "ReviewID": "UR30448252", "Content": "My husband and I were referred by friends and were not disappointed, in spite of some not-so-glowing reports on this site. We arrived in May, the rainiest month. (Be sure to use Route 10 if you go north from Ponce, not #123 as we did.) Roads are winding but managable. The hacienda was spectacular with extensive buildings built into the mountains and well manicured grounds. Our bedroom and bathroom were dated but adequate. We didn't need the AC unit because it was cool that evening. My husband and I spent time on the veranda before dinner, looking out over the mountains shrouded in mist. This place is at 3,000 ft. elevation so the views are beautiful. Since there was no one else at the hacienda at the time we arrived, we had the verandas to ourselves. (I learned later in San Juan that the place was booked during school vacations starting at the end of May.) The various sitting rooms (like common room) were handsome. The staff was most helpful and we particularly enjoyed chatting with Juan Carlos who lived across the valley, and our waiter who was a pre-med student in Ponce. The dining rooms were elegant. We didn't have enough time to explore the nearby town but want to return. If you expect a 4 star resort with lots of amenities and plush rooms, don't stay. But if you want to sample a bit of history from old coffee plantation days still preserved, then book a room.", "Date": "May 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "san francisco, california", "Title": "“Wonderful experience worth the minor problems in accommodations.”", "Author": "bluetigereyes", "ReviewID": "UR27873823", "Content": "We stayed for one Thursday nite in late February. This is a very special hotel in a very special place in the mountains. Driving la Ruta Panoramica, winding your way over the mountains with views of the Caribbean, through el toro negro rain forest and then into Jayuya to arrive at this former coffee plantation is a way of getting at another aspect of Puerto Rican life. Sometimes it is more about the experience itself than the details of the accommodation. Yes, it is worn a bit, and the staff is not as attentive to details as one might wish (lightbulbs needing changing or enough towels etc), but they are gracious and helpful. There are scenic vistas from the common veranda, from the private balconies and as you walk around the property. We arrived in the rain and watched the fog fade into nite in the distant hills. The sense of place is spectacular. We were in room 5 and it was fine. The food was just all right (my husband had a tough but flavorfull steak and I had a pretty good chicken asapao- stick with local Puerto cuisine here). Breakfast was adequate. But I say go with the meal plan just to stay and soak up the atmoshphere . I would defintely recommend this place to any traveler in search of relaxation and authenticity.", "Date": "April 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Illinois", "Title": "“SOME rooms acceptable for one night”", "Author": "comfytravel", "ReviewID": "UR25143993", "Content": "Some rooms, especially #10, are absolutely awful, with windows opening into the kitchen. The receptionist (woman) was indifferent to our problems; then came a nice guy Batista, had pity and moved us in a nice room upstairs overlooking the jungle. It was OK, but we had no water when the kitchen downstairs washed dishes. In short, the place offers minimal comfort. The food was OK. To drive around Jayuya is challenging, GPS often confusing, but it's fun if you feel confident at the wheel. You stay deep in tropical jungle without the crowds at National park. The pool fed by mountain stream is great, though the water rather cool; the problem is that it is extremely difficult to climb out of it. Hacienda Gripinas is more like a camp site, but at the price of an expensive hotel.", "Date": "February 25, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "ohio", "Title": "“Hated it.”", "Author": "fm11", "ReviewID": "UR23433263", "Content": "I found the staff unfriendly and indifferent. Would not recommend this place at all. The food was terrible.", "Date": "January 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "oregon", "Title": "“Very disappointed”", "Author": "PeepOregon", "ReviewID": "UR22830247", "Content": "I had gone on this web site to check out this property as I learned straight away that it was not a Paradore any more.Their web page did not work and my email to them bounced back. I then had to call them to book. Decided to go anyway after reading reviews. Very disappointed. First, it is now owned by the city of Jayuya and is no longer private. We asked for room 4 as Foders or Frommers suggested that room 4 and 5 were the best (last years book) We knew it would be rustic but little things were not right like my husband had to crawl under the bed to plug in the lamp (he isn't getting any younger!) There were 3 light bulbs out in the ceiling and one on the deck. The ceiling fan did not work. Ironically, the beds were OK (reading reviews said otherwise) Then in the morning, there was water all over the floor in the bathroom (toilet or? who knows) There had been a rain storm the night before. Also the bathroom was the smallest we had ever ever been in. Very basic all together but sort of expected that. The food was terrible......we both ordered a meat with beans and rice and got dried meat (chicken and pork) Very basic menu. The breakfast was no better. I have to say the staff was very pleasant especially the man at the front desk. The pool was too cold. The bar was closed as apparently they were having problems with their liquor licence. It is such a shame as the surrounding area was lovely and the main dining area and seating areas were charming. It just needs better management.", "Date": "December 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2"}, "AuthorLocation": "Barcelona, Spain", "Title": "“If you love nature and dont expect luxury this place is great.”", "Author": "Candy16", "ReviewID": "UR18022132", "Content": "I really have mixed feelings about this Parador, the location is very nice, you are surounded by nature and peace. However the hotel could improve certain aspects such as the beds and the room conditions. We arrived early, around 10 am, and were checked in at once, we stood in room #9, which was really modest, a simple bathroom, a few drawers, and a TV with cable,however it was spacious, the rooms dont have windows but wooden shutters without screens which we loved because you could open them and enjoy the view of the mountains and feel the mountain breeze. No need to turn on the A/C. We had problems the first night, the bed!!!! It was in really bad shape!!! You could feel the holes and the springs because it was really worn out. No matter how many sheets or blankets it was still horrible. In the middle of the night my husband went up to the desk to inquire about changing rooms, it was then when we realized that after 10pm all the employees leave, they lock up the office,the little lobby and leave the guests on their own, in the office the post a number to call in case of emergency, but thats about it. Next morning we asked to be changed. we were moved at once to room #5 and given a discount for the night. The room was perfect, it was right next to the beautifull antique lobby, it had an antique decor with stone floors and furniture, the room even had a great spacious wooden balcony looking over the pool and the mountains, the balcony has a table, 2 chairs and a little hammock, there was even a bird nest of this native bird that sang every morning. The food in Gripinas is good, nothing gourmet, very local, we had the chicken asopao which is a hearthy soup,delicious!! We also tried the rice and beans served with skirt steak, very good. The breakfast are wonderful, they make a great coffee and the a delicious farina. You must try the eggs with local ham, great!!! All the food is well proportioned, and the staff is really accomodating. Our experience with the hoseback ride was not so good, we went to the desk asking for info about hoseback rides, the girl told us he would sent someone to the room with the info, 10 minutes later a man called Toñito showed up offering us the tour. My husband talked to him for a while and was quite puzzeld when he was asked how much each of us weighed. In short ,offered us a 2 hour tour for 50 dollars, which we considered ok. He picked us up at the front of the hotel in a shabby jeep which felt it would fall appart any minute, we drove for maybe 10 minutes and arrived at a wooden shack wich he claimed was his home. From there we would start the ride into a coffee plantation. What we saw next was shameful, 2 rather small horses in bad shape were being prep for the ride. They looked kind of skinny and tired, no wonder they asked our weight, these horses would not been able to carry a common overweight person.It was also strange that this man who was our tour gide had two 14 year olds tending the horses and made them come on the tour with us by foot. At first I was skeptical but they all insisted that it was ok and that they did this tour everyday. We started the ride going up a really steep hill, the horses breathing became so heavy that for a moment I thought they would colapse, the two boys went up by foot, while all the time the guide Toñito followed us in his jeep. We were led into this beautifu plantation, here we were explained about the the history of jayuya, the local traditions and the process of puertorican coffee harvest we were also taken to a lovely stream where we rested for a while and headed for an anciet indian burial ground. The place was lovely but I kept being distracted beause my horse was famished and kept on going off course to eat the grass. One of the boys (Miguel) was really sweet and asked me a lot of questions, I asked if he gets payed for what he does, he said no, he just did it for fun. On the way down the horses were so tired I decided to give it a break so I decended on foot, I even got a taste of some bananas right off the tree, and some water directly from the stream, it was totally safe. Once we got back to the hotel I commented to the desk about the condition of the tour, their response was just quick reply \"oh well, we really dont own the tour, we just recomend them\". So much for safety and quality concern. Besides that our stay was ok, I would return for a weekend, maybe just for a night but not more than 2. If you have kids, skip this place, there is no activities at all execpt for the pool which is small and the water is always cold because it comes directly from the mountains, no nightlife whatsoever, and town is really boring.You need a car to go to all the fun places like the Indian ceremonial park which was great. If you are looking for peace and quiet, love nature and are not looking for any luxuries this place might be good for you.", "Date": "July 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“A Treat of a Mountain Retreat”", "Author": "HuaMulan", "ReviewID": "UR7279121", "Content": "After the bustle of San Juan and its over-priced lodging options, my husband and I rented a car to see the heart of Puerto Rico. Nestled amid the highest mountains on the island and at the end of several twisting, narrow, cliff-hanging roads, we came to rest at Hacienda Gripinas outside the village of Jayuya. The hacienda was originally a prosperous coffee plantation and has retained the flavor and atmosphere of another era. We had a choice of two rooms and opted for one on the main floor, just off the dining area, a reading lounge, and main balcony. Our room opened onto its own balcony that overlooked a swimming pool with views of the mountains. Had the hacienda been busy, the location of this room next to public areas would have been less than ideal, but at most, there were two other couples that weekday night. Lulled by the wind and the sounds of coqui, we could easily pretend that we had this beautiful, quiet place all to ourselves. Our stay included both dinner and breakfast with many tasty menu options and ample portions. Miguel, our receptionist, host and waiter, was courteous and attentive - including finding an extra blanket for the cool mountain night. My only complaint was the erratic water temperature when I wanted a hot shower. It took a long long time running the water before it became hot and a short short time before it went cold again. At the mid-week price of $109 for room, dinner, and breakfast, Hacienda Gripinas is a budget traveler's dream. As a unique hotel with the character and charm of old Puerto Rico, it is everyone's dream. If we could have stayed longer, we would have, and if we have a chance to return, we will.", "Date": "April 3, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Rustic retreat”", "Author": "Jasubar", "ReviewID": "UR6813920", "Content": "Hacienda Gripinas offers a rustic retreat for relaxation and quietude. It’s definitely off the beaten path, a good two-hour drive from San Juan, the last 45 minutes through narrow, twisty mountain roads. Armed with a good map, however, we found it easily and never had to call for directions. Our room was furnished with the basics, and included satellite TV and a heater/AC unit. I mention the heater because the nighttime mountain air goes down to the mid-60s in January and we came “thisclose” to turning it on. The room had vents permanently open to the outside near the ceiling and it got pretty chilly around bedtime. I was concerned that with the vents open to the outside, we might also find some crawly critters in the room, but this fear proved to be unfounded. Based on this parador’s website, I was also expecting to get a poor night’s sleep because of the coqui frogs and early-morning roosters. Although I did vaguely hear a rooster at 3 a.m., neither the frogs nor the roosters were enough to keep me from sleeping quite well. The mattress seemed thin and hard, but my husband and I both remarked to each other that we awoke the next morning without the usual aches and pains us 40-somethings are prone to have. Some previous reports have noted there was no hot water – there is, you just have to let it run for a long time before the hot water actually shows up. Hacienda Gripinas is a restored older building, without the amenities of a modern hotel...expectations must be adjusted accordingly. Unfortunately, our time was short at Gripinas and we didn’t get to fully appreciate all the grounds have to offer. There are two pools, although only one seemed to be cleaned for daily use. There are also many places around to the hotel to sit and talk or read a book. The food was good, local Puerto Rican cuisine. The room rate includes dinner and breakfast, excluding any beverages. Our entire bill for the full experience including room, taxes, meals and a couple of rounds of Medalla beers that we had with dinner and juice with breakfast was $130. A bargain, I’d say! Offsite, the town of Jayuya offers a couple of “must sees”. The Cemi museum offers a glimpse into the area’s archeological finds from the indigenous Taino culture. What we really enjoyed, however, was the Cultural Center next door to the museum. It is staffed by artists who volunteer their time with the goal of exposing both the local community and outside visitors to the indigenous history and culture. We happened to come by as they were getting ready to eat some lunch and rather than ignoring us or asking us to come back later, they insisted we join them for bite to eat. The artists also sell their wares at the Cultural Center – a great place to pick up some true “made in Puerto Rico” souvenirs. A bit further down the road, we found the Café Tres Picachos, a coffee farm and processing facility. This was exactly what my husband was looking for, and we purchased over 20 lbs. of excellent Puerto Rican coffee at a bargain price. My only regret with our experience is that we didn’t give ourselves more time to enjoy the “R&R” opportunities Hacienda Gripinas has to offer.", "Date": "February 19, 2007"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "5", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Sonoma, California", "Title": "“Hacienda Gripinas was a great experience”", "Author": "humanone", "ReviewID": "UR5379932", "Content": "Hacienda Gripinas is not a luxury hotel nor a resort, which is why it is so wonderful. One feels as if one were in the past (except for the ariconditioners) including the smaller rooms and simple furnishings of that time along with the multiple sitting rooms and public verandas.. And it is in the countryside (duh!) which includes bugs and a bit of mildew along with the incredible blossoming trees at your terrace, the charming coqui frog chirps, and the vistas. It is true that it is almost two hours from the caverns, but a look at a map will tell you that it is a winding mountain road that takes you there. Again, driving those roads were wonderful, with the towering clumps of wild giant bamboo along the way. If you are not interested in another culture and a different terrain, don't leave New York or wherever. And...the plaintain soup was the best soup I have ever had, with the Spanish omlette the next day excellent as well'; the rest of the food was Ok. $125 for two people to sleep and have dinner and breakfast seems totally fair to me.", "Date": "June 24, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "New Jersey", "Title": "“Off the Beaten Track”", "Author": "MWG12", "ReviewID": "UR5322819", "Content": "Simply driving through the mountains to get to Hacienda Grapinas is an adventure and is well worth it. The mountains in PR offer another world. The Parador is an old coffee plantation. The setting was lovely and the porches had extended views and were very comfortable. the place was very tastefully decorated. I had one complaint about the rooms. I had read that you did not need air conditioning because there were fans and you could keep the windows open and get the cool mountain air. In fact the fans did not work and you were compelled to use the air conditioning. The restaurant is very good. There are excellant short hikes along the roads outside past hills where coffee is grown. Within a short distance there is true excellant mountain hiking at Toro Negro State Forest, which offers very much the same experieince one would get at El Yunque.", "Date": "June 7, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Service": "1"}, "AuthorLocation": "Vermont", "Title": "“shoddy treatment - not worthy of the \"Paradore\" distinction”", "Author": "Annie46", "ReviewID": "UR4360142", "Content": "We made reservations here in November for a total of 4 nights in January. We arrived on the appointed check-in date at 4:30 in the afternoon, the place was apparently hosting a local mayors' convention, and had no interest in a couple of strangers. The young woman at the reception desk was very short with us -\"what do YOU want?\" When we said we had reservations, without even checking, she flatly responded, \"not for tonight you don't.\" We asked her to check and reluctantly she did so and declared that we could check in two days later but there was no reservation for the first two nights - and made it clear that she could care less about the fact that we were, with darkness rapidly approaching, miles from any place where we could get lodging. This was particularly striking when compared to our experience in half a dozen stays at other paradores around Puerto Rico. Typically the people are sensational, and whether it's rustic or resort level, the paradores are generally great. That made the shoddy behavior here even more striking in contrast.", "Date": "January 18, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Philadelphia, PA", "Title": "“Really remote”", "Author": "Dave's_reviews", "ReviewID": "UR4153371", "Content": "I generally love historic lodges in rustic settings, but this property is simply not worth the trouble to get to. I reserved it after being told by the Frommers guidebook that it was close to the Rio Camuy Caves (a worthwhile stop). It wasn't. After an almost 2 hour grueling journey through amazingly twisty roads, we arrived. The lodge building itself is atmospheric, but the rooms are spartan (and you'll likely be sharing it with a mosquito or two). The kitchen tries -- but generally fails -- to deliver high quality food. There are apparently some walks available from the hotel, but they were inaccessible the night of my stay due to a gate being padlocked. One of the two pools was also closed for repair (the other pool was really too icy to be attractive). At least the drive south to Ponce from the inn only took about an hour. The bottomline is that this property isn't nice enough to make it worth the journey. If you want to see what a historic coffee plantation is like, sign up the the Conservation Trust's tour of Hacienda Buena Vista, just a couple miles from Ponce.", "Date": "November 29, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "NYC, NY", "Title": "“Nasty Placeeeeee!!!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3540401", "Content": "This place is in the jungle. It is full of nasty roaches, it stinks as hell, and it is very expensive for nothing. The rooms are nasty looking, the beds are falling apart, the service is terrible. There is a waiter named Miguel Batista (father) who was drunk while working, the food is ok, but they really need to work very hard inorder to bring up this place. I don't recommend it at all.", "Date": "June 8, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Chicago, Illinois", "Title": "“The worst room ever and very poor food!”", "Author": "pietrob", "ReviewID": "UR3259740", "Content": "I have never been to a crappier and dirtier hotel. And it cost me over $130 for the night. Awful rooms, very difficult to reach, bad quality food. I would not recommend it to my worst enemy. Stay away from it!!!", "Date": "March 8, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“A Walk in the Clouds”", "Author": "A TripAdvisor Member", "ReviewID": "UR3007625", "Content": "For a getaway from the increasing urban development that's become characteristic of the Puerto Rican metropolitan area, this guesthouse is perfect. My girlfriend and I stayed overnight in room #5 and we loved the guesthouse, its setting, the openness of the guesthouse and the grounds. Our room was off of the main living room and had a semi-private balcony that overlooked the pool. Our bed and pillows were lousy, but the serenity of the mountains and singing Coqui frog more than made up for this. The ride to the town of Jayuya from the east (Cayey) is itself a breathtaking ride through winding roads with awesome vistas. The staff is friendly, courteous and attentive. There was no hot water, which was disappointing after our 4+ hour trek and given how cold it can get up in the mountains (relative to the lowlands, of course). If your getting in at night, bear in mind that getting to Gripiñas is tricky and signage is non-existent. We had to stop to ask for directions several times once we got into the town of Jayuya. Dinner and breakfast were included with our stay as was a courtesy Piña Colada (sans alcohol -- no liquor sold in Gripiñas). The Creole Snapper left a lot to be desired and I've had better rice and beans all my life. Breakfast on the other hand, a Spanish Omelette, was much better. For all the rave reviews about the coffee, I found it mediocre. All in all, Hacienda Gripiña was a wonderful retreat from the metropolitan scene.", "Date": "January 14, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Carolina, Puerto Rico", "Title": "“Honeymoon Paradise”", "Author": "A TripAdvisor Member", "ReviewID": "UR2986119", "Content": "If you want to get away from all the loud and fast pace hotels. I definitely recommend Hacienda Gipinas. It was a little difficult in getting there but the travel was well worth it. It you love the Mountains and living with Nature you will Love Hacienda Gripinas. It was my first time in seven years that I got a chance to escape with my wife and we loved the atmosphere. As soon as you get there mountains will surround you and you actually notice the rich smell of nature in the air. The Hacienda has a cozy restaurant and the food is very good. Nearby you will have some tours that you can take and see some Indian carvings on rocks that are over 500 years old. You can visit coffee plantations and buy Puerto Rico grown coffee. Nearby you can go to the highest point in Puerto Rico, which has a Spectacular view. The people are very hospitable and they are always there to tend to your needs. The rates are great and they have Honeymoon packages as well. I recommend this Hacienda to everyone. Have fun in Puerto Rico.", "Date": "January 6, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Bonus for atmosphere”", "Author": "A TripAdvisor Member", "ReviewID": "UR1767706", "Content": "Very nice experience. Inn is converted old coffee plantation house. Very basic, small, clean rooms. Fixtures are worn and beds sag. Best rooms are those off main sitting room overlooking pool (? numbers 4&5 ?)-- those have private balconies. There are 4-5 more rooms on lower level that share a veranda looking into a garden -- in these rooms expect to hear everything your neighbor says & does. Nice atmosphere, great outdoors sounds (loud tree-frogs, birds, roosters). This is a sit and chil location -- bring a book and read it in the hammock. It's a long-ish twisty drive getting from Ponce (use the new highway 10, not the old one). Stays include food (since there's *nothing* close). Food is served with care and quite good. Go for the atmosphere, not the amenities.", "Date": "April 7, 2004"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Pleasant country hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR1270125", "Content": "A pleasant old-style handsome hotel, rambling 2-storey structure with lots of balconies, set in nice greenery. A relaxing atmosphere - you could spend all day on the balconies and in the small gardens and pool. Rooms may be a little worn, but okay. Not personal, as it is rather large. It is on smallish grounds in a village. Around it all you can do is take nice walks up the small roads. For rambling by car, the whole area is beautiful hills with waterfalls etc.. We did not greatly like the dinner which is included, but they do try and it is well served in a dining room.", "Date": "August 31, 2003"}], "HotelInfo": {"Name": "Hacienda Gripinas", "HotelURL": "/ShowUserReviews-g1086394-d151668-Reviews-Hacienda_Gripinas-Jayuya_Puerto_Rico.html", "Price": "$125 - $150*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Rte 527 Km 2.5</span>, <span class=\"locality\"><span property=\"v:locality\">Jayuya</span> <span property=\"v:postal-code\">00664</span></span>, <span class=\"country-name\" property=\"v:country-name\">Puerto Rico</span> </span> </span> </address>", "HotelID": "151668", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/00/1b/96/19/hacienda-gripinas-entrance.jpg"}}