{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Overpriced based on lack of quality”", "Author": "David A", "ReviewID": "UR122087000", "Content": "Me and my girlfriend stayed here and we were hugely disappointed. The remote control for the TV didn't work. There was rips in the bed sheets (that laid a top the hard mattress). We got about 10 tv channels, 6 of which had horrible signal. The TV was set very far from the bed almost infront of the bath room. We were also awoken at 830am to a man outside of our window hammerring and doing repairs to the exterior. The only positives I had were that the staff were friendly enough, and that it was very close to Crash Boat, other than that, we did NOT enjoy our stay here.", "Date": "December 25, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Nice outdoor setting, but poor rooms and service.”", "Author": "jws5046", "ReviewID": "UR116826791", "Content": "My girlfriend and I stayed here in August, the slow season in western Puerto Rico. The location is lovely. Crash boat beach is near and Rincon and Isabella beaches are not far. Unfortunately, the service made the stay somewhat unenjoyable. The pool and bar were closed, and we were never told in advance. The pool looked great, and I really wish we could have gone for a swim. The restaurant is only open for breakfast. We were told it opens at 8 but it never opened. Rooms were not the cleanest. They were plain, had air conditioning, and faced the pool area which was nice. The hotel could be a nice place to visit but we had a poor experience. Hopefully in the busy season visitors would have more luck.", "Date": "August 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Honeymoon Heaven!!”", "Author": "teamtejeda", "ReviewID": "UR106817787", "Content": "My husband and I stayed here for a week on our honeymoon in August of 2009. They had the suite all set up, we had a bottle of champagne waiting for us, the bed was covered in rose petals and the room was decorated in all white! Very sweet! The bed was soo comfortable we had a hard time getting up in the morning to go and see the island! The air conditioning worked very well, our room was always nice and cool each evening when we returned. The room and bathroom was kept clean daily unless we requested it be left alone. The hacienda is secluded and quiet so you can relax, yet close enough to the beaches! Staff was wonderful and super friendly! The restaurant was closed but they opened it just for us, the food was great and we just had a wonderful time! We will definitely be returning with our kids this time!", "Date": "May 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brooklyn, New York", "Title": "“comfortable and cozy”", "Author": "samiranda", "ReviewID": "UR96344867", "Content": "This hotel is close to the main roads,airport in Aguadilla,and shopping mall it is also close to Crash Boat Beach.The staff at the hotel is very friendly and helpful to all your needs.the prices are very reasonable and the hotel is decent looking.", "Date": "February 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“What a fantastic surprise!”", "Author": "Carmenalex", "ReviewID": "UR92131201", "Content": "Our family members had a Three kings Day celebration in their home in Aguadilla and since we are from San Juan it was a long car trip so we decided to stay overnight in the Pedregal Hotel. It was my husband, our two and a half year old daughter, my mother-in-law and myself. It did NOT look like a cheap motel. The entrance was VERY pretty and well kept. The service was AMAZING and very friendly! We took a family room and it was VERY CLEAN and great. There was a small tower like wall complete with little doorway that my daughter just loved. We even had two t.v's in the room with plenty of channels and it was a plasma too so it was clear viewing. We were very comfortable. After my mother-in-law and daughter turned in for the night me and hubby had a great time dancing and having drinks (FANTASTIC PRICES!) in the restaurant. It was Thursday night and they had a DJ. We took a romantic stroll in the nice, lush green grounds and even played billiards in the game room. We thought we were going to be stuck bored in our rooms and we were surprised at how much fun we had. In the morning, breakfast was delicious, home-made and the service was amazing! We ate in the restaurant balcony in the fresh air and my daughter danced to music while she ate. One of the ladies that was in the front desk gladly went to the restaurant to warm a bottle of milk for my daughter at check out, and when it wasn't warm enough she politely and graciously went back to warm it up some more with a smile. THANK YOU! The staff was super helpful and friendly and sooo nice, and the guy working the restaurant was fantastic in making and serving the food. We liked it so much hubby and me want to come back for a romantic getaway and it's minutes away from Las Cascadas water park and an Ice skating rink. Food costs extra though but we didn't find it expensive at all and the fitness center is really just one weight machine thingy but we weren't going to use the gym so it didn't bother us at all. Oh and the grounds were SUPER CLEAN and well kept. We really relaxed and had a great time.", "Date": "January 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Caguas, Puerto Rico", "Title": "“If you have the money, please stay somewhere else!”", "Author": "Chancita", "ReviewID": "UR85561493", "Content": "After days, looking for a good place to stay during one night... we chose \"El pedregal\" because it has good reviews on this site and the Marriott Courtyard was fully booked. First of all, the entrance looks like a cheap entrance of a motel, the facilities overall are ok. The pool was clean and refreshing, but the pool bar wasn't open until 6pm and the restaurant too! The restaurant opens just two times during the day: for expensive breakfast (8am) and dinner (6pm). THE ROOM WAS HORRIFYING! Stains everywhere, small tv with poor signal and 8 channels maximum, no decoration at all, uncomfortable mattress, flat pillows, awful bathroom, Hot water! But there's no way to control it so be prepared for a nice burn. DO NOT BELIEVE ANY OFFERS OF THE WEBSITE! they supposedly include breakfast and dinner but all they give you is a $10 coupon and you'll be notified at the restaurant about that scam. Exercise area? haha... not at all!!! At least the service was good. It's better to keep this place as a secret.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cayey, Puerto Rico", "Title": "“a \"Must Return Retreat\"”", "Author": "EventosMadrigal", "ReviewID": "UR82015800", "Content": "From the first call to request info to the check out, service was always A+. As a first time visitor, I was really impressed with the care time dedicated by the staff to make sure that my stay was the one desired. The place is naturally beautiful which becomes a great get away treat for those looking to leave the everyday stress and finding a peace oasis. Wi-Fi Internet service available is excellent. The room was great and very quiet; great for resting and relaxation. In house nightlife includes Karaoke on Friday and great pool drinks and gathering on Saturday; Rafael really makes the difference with his great service and smile at the poolside bar. Restaurant available with ample variety which allows you to dine in. Great meeting facilities also make this place the ideal spot for business or leisure. Altogether, the natural scenery - tranquility - facilities and attentive staff, make this a must return retreat. Wanda Torres, Coordinacion de Eventos Madrigal", "Date": "October 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "US", "Title": "“Good hotel”", "Author": "gcv77", "ReviewID": "UR73230141", "Content": "We stayed at this hotel because we want to hang out in Aguadilla area. The hotel is small but confortable. The room was clean. It does have a pool and a small pool maybe for kids, we didn't used them, because we only stayed for a night. This hotel is really close to the Cielo Mar hotel, which is more expensive. Close to the hotel is the beach, ice skating, Cascadas water park and bowling, but you definately need a car. In summary, the hotel is good for the price. Nightliffe: We went to Rompeolas. It's a great place. During weekends they have live entertainment starting about 10pm. We order the small sampler, which is great and the price is reasonable.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“It was one of the greatest experiences I've had in 5 years”", "Author": "OneLove69", "ReviewID": "UR58514051", "Content": "It was amazing!!! I was able to relax in a quiet and calm atomosphere. I loved the honeymoon suite. It had a hottub/bathtub in the room and I didn't have to share with anyone except my husband! If you're looking for a great vacation spot nice and quiet for your family I would recommend this hotel to you.", "Date": "March 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Georgia", "Title": "“I felt at home”", "Author": "Estrelitatraveling", "ReviewID": "UR54068243", "Content": "I returned to Pedregal Hotel to unwind and I was able to achieve this. The hotel was full yet at the last moment a small room was cancelled so they called me .the room was clean and surprisingly comfortable. They have renovate the restaurant and the cook is GREAT. I never left the hotel. I read the other reviews and felt sad that these people did not for whatever reason enjoy this hotel. I asked other guest if they agreed with the neg. opinions and we all agreed to keep his place as our secret! For the price I got exceptional quality and the place was always clean and well tended. The pool was clean and a employee (Peter) kept everything under control; I was impressed! I will return.", "Date": "January 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Puerto Rico", "Title": "“Same Owner As For Hotel & Hacienda Los Castillos(Moca)”", "Author": "nildaPuertoRico", "ReviewID": "UR36623932", "Content": "Service for breakfast very poor. No produce available to prepare the breakfast. No phones in rooms, no room service...Mattres very poor.", "Date": "August 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Ponce", "Title": "“It was ok...good for relaxing.”", "Author": "lagareswendy", "ReviewID": "UR36576476", "Content": "Only is you want some time alone, without any interrupsions, it's ideal...It's been a while since we last visited, so I'm not aware of their latest upgrades to the hotel. It was very quiet and that I really liked...No in-door club to visit at night. I was there for only two days while Felix was nearby training (he was part of the Military Police for the 448 post).", "Date": "August 3, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Puerto Rico", "Title": "“Horrible, do not recomend it”", "Author": "prtraveler275", "ReviewID": "UR24645222", "Content": "We rented one of the villas and it was horrible. We were told that there were four rooms in the villa and there were only three so we went to ask and they said that the living room which was aprx. 12x12 was counted as a room. That was not the worst part, there was no hot water for the four hole days we were there. The rooms were all tiny and the kitchen was a counter five feet long, in it was the stove, sink and microwave. the bathroom was huge but there was only one for 12 people. Some of the front desk personal were very helpfull but otheres were just plain mean. I would have never paid three hundred dollars a night for this.", "Date": "February 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“A Hidden Gem!”", "Author": "petehz", "ReviewID": "UR22797034", "Content": "I had a very bad experience at a nearby hotel and need a place to stay last minute. Not only were they very accommodating, but the rooms were a lot nicer than I thought. I reserved a jacuzzi suite which was very comfortable and actually less expensive than the regular guest rooms at nearby hotels, They are also are conveniently located less than 10 minutes from Base Ramey Internantional airport. We ate at the hotels restaurant and the food was very good- they serve mainly native dishes from the island. If your visiting the Aguadilla area of Puerto Rico, I highly recommend this hotel", "Date": "December 17, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "puerto rico", "Title": "“No wonder PR tourism is going downhill”", "Author": "squishyPuertoRico", "ReviewID": "UR19302300", "Content": "We live in Ponce,PR , we needed a short vac. so we decided to do internal tourism. OMG, no wonder PR tourism is terrible, price, service, restaurant, terrible, first, No AC didnt work, pool was filthy, restaurant, they should take some classes. Never had oatmeal with Felipe II and kalua and raw!!! eggs horrible, juice not even natural, from tropic juice or maybe some cheap make and charged as freshly squeeze. Manager never wanted to speak to you... and employees wel I guess they did what they were told... well that night we had to report the AC a couple of time, the manager said if we wanted he/she would refund that night so we can leave. This was around 11:00 pm, we were tired and to go back to Ponce would be about a 2hr drive. imagine that!!!. They lend us a small , dirty fan that it couldnt be any ore dirty.. Promised that next day would be fixed, wanted to give them a chance we went sightseeing, went try to have breakfast , which was a disapointment, wanted to swim , we couldnt it was filthy so we left outside the area and went to visit near hotel and paradores. Came back around 6:00 , they said AC fine , opened the doorm hot as HELL! called front desk the said give it time, gave them one hour, even in HELL , AC would get cold, but this one was beyond Hell!!. room a little shabby, We were charged a full night regular rate!!!!! not even a discount. Try to give them an oportunity to see that , well we stayed, but Manager was very inconsiderate. Plus to much $$$for what we went thru, well just by not EVER,EVER,EVER going back or recommending them , well I guess it would do. It is a shame that an island like ours has to go through this embarassment..", "Date": "August 24, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Florida", "Title": "“disapointed”", "Author": "laamapola", "ReviewID": "UR19125664", "Content": "We stayed for 4 days and the place outside is ok. It's quiet you can hear the coquies at night and the roosters crowing all the time. Unfortunately,the room was not as nice. There was no hot water, the room was out dated with many cracked and broken tile, the A/C was not able to be controlled or adjusted. When on it was too cold and you had to turn it off to get it warmer. The restaurant was closed most of the time, so I don't know about the food. The pool was ok. The service was ok too.", "Date": "August 19, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "New York", "Title": "“Okay, but bring your cell phone!”", "Author": "tatitah", "ReviewID": "UR7624671", "Content": "I booked directly for my mother and my aunt who are senior citizens. Once they arrived, my mother wanted to make a phone call. The front desk claims that I said that I put a block (this is not true). Then they added that the guests are not allowed to use the phone. They claim that the guests do not pay up. My mother mentioned to them that she is willing to pay, but they insisted that she cannot make the calls. I have to call my mother. I believe this is crazy. Not everybody has a cell phone and this is first time I hear of this. Of all the experiences I had with hotels this is really surreal. Also, the room that they were in, the shower head looked like it is slightly hanging. Water spilled on the floor and my mother almost fell down. Luckily, my mother and my aunt went down to complain about it and their room was changed. Another thing was I booked for three days the room. The front desk mentioned it was for two days. My mother insisted, but they didn't budge. She had to pay for the extra day out of pocket. The front desk even tried to charge the extra day to my credit card without calling me. My mother luckily saw this and insisted on a hard copy of the statement. These were the issues that both my mother and aunt experienced. Otherwise, it it a nice hotel. My suggestion is definitely bring a cell phone. Also double check and make sure that you are reserving for a certain amount of days. Unfortunately if it was not because of these issues, things would have been better.", "Date": "May 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Comfortable and Cozy”", "Author": "samiranda", "ReviewID": "UR5962773", "Content": "I have come back to this property everytime I go to Puerto RICO. Once you learn where this property is at It is easy to get to.The property is always kept clean, if you want to relax one day of your trip this is where you want to be, It is so relaxing beside the pool. If you want to book do it in advance because families from all around the island stay here on weekend getaways. the prices are reasonable. the staff is very helpful especialy one guy by the name of Waldemar he makes your stay there as comfortable as he can. The supervisor is Annie she is also very helpful she speaks English for those that do not speak spanish. She will give you the sightseeing spots in the area and where to dine.", "Date": "October 16, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New Jersey", "Title": "“Excellent!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3538836", "Content": "Hi, I just came back from my vacation in puerto Rico.The island is not how I last remenberd it 16 years ago.little by little is is starting to get more americanized. meannig there are fast food resterants now not like before walmarts were never heard of. I found the El Pedregal a wonderful place to stay. The place is clean the poeple the are extra friendly and the location is just right! 5 mins away from crash boat beach!and 20 mins away from hobos beach. At fist sight you will find it a little od cause it sits tucked away finding it is a bit hard. The grounds are keeped nice and clean.They have a great pool it's cosy-n-quaint.While my travels there I looked at other paradors and found that they were all about the same.They are just a room with a bathroom.There was no kitchen in non of the paradores I went and looked at,and to give you the heads up if you plan to stay there get the room with the jacuzzi. That's the best rooms they have.It always have hot water..... The price is just right I paid $630.00 a week and I stayed for two.The only thing I was dissapionted with was there was no good cable channels only had 25 channels. Wold of been nice they had a dvd player in the rooms.", "Date": "June 8, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Mishawaka, Indiana", "Title": "“Luke warm- Pedregal”", "Author": "A TripAdvisor Member", "ReviewID": "UR2148907", "Content": "Luke warm - Pedregal; is the way I feel, If you ask my wife she would tell you they where cold. I will start from getting there. First off, the motel gives you directions to the motel on their web site, but only from the town, since I was coming from Bayamon I had to look them up on MapQuest which only got me to the town and from there I figured out where they where from the motels directions. Once I arrived at around 4:30, I found that there where two wedding receptions at the motel. One of the reception halls is acroos the way from the rooms, and that proved challenging to try and sleep with the music so loud. Since, it was raining that day the floors and stairs that lead to the 2nd deck rooms where really slippery, so watch your step. On day 2 and 3, we had problems with no hot water to shower with in the mornings (this was eventually fixed each day). The motel sits in the middle of a community and is set up so it looks and feels like and oasis - they almost pulled it off except for when your at the pool you can see the projects right across the street. The motel is only 5 minutes from Crash Boat beach which is a plus. The staff gets an excellent grade for service and support. They go out of their way to help you and are very friendly- my hat goes off to them. The staffs support made up for some of the problems with the motel but not all. The resturant at the motel is not part of or run by the motel. The food was okay, and a bit pricy for the quality of the food. I'm critical of the food because I'm Puerto Rican and expected better. Overall it was okay for the price I paid.", "Date": "June 3, 2004"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Whitestone, NY", "Title": "“Loved it!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1824866", "Content": "We here for spring break April 2004, and we loved it. The room was ok, but the place itself is beautiful. They have wonderful pool and a resturant right by the pool. The staff is very friendly and helpful. I would recommend this to everyone. The have excellent pricing and the food and drinks are also inexpensive.", "Date": "April 22, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "JUANA DIAZ, PUERTO RICO", "Title": "“Wonderfull”", "Author": "A TripAdvisor Member", "ReviewID": "UR1135489", "Content": "Hacienda El pedergal is the best site to visit in Aguadilla.", "Date": "July 12, 2003"}], "HotelInfo": {"Name": "Hacienda El Pedregal", "HotelURL": "/ShowUserReviews-g580452-d151794-Reviews-Hacienda_El_Pedregal-Aguadilla_Puerto_Rico.html", "Price": "$75 - $85*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">rd 111 km 0.1 Cuesta Nueva</span>, <span class=\"locality\"><span property=\"v:locality\">Aguadilla</span> <span property=\"v:postal-code\">00600</span></span>, <span class=\"country-name\" property=\"v:country-name\">Puerto Rico</span> </span></span></address>", "HotelID": "151794", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/35/86/c7/view.jpg"}}