{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Falmouth", "Title": "“Hope to return next year!”", "Author": "Michele T", "ReviewID": "UR128170003", "Content": "Just returned from a week in PR, first visit. Stayed at a variety of hotels including 5 star RItz and El Conquistador on our trip. Club seaborne was our favorite. The rooms were simple but very clean and comfortable. breakfast was great. Grounds beautiful and quiet. Linda was fabulous and saw to our every need, picking us up at airport,after day of sailing, providing beach chairs and nice beach towels for Flamenco beach. Helped us book sailing trip with Capt Dan to Culebrita which was the highlight of our week. We felt as if we were the only guests, no waiting or crowds, personal service. Thanks for a great stay Linda.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Long Island", "Title": "“A bit expensive but nice”", "Author": "Diane714", "ReviewID": "UR127707561", "Content": "We just spent several nights at Club Seabourne. While it was lovely and the staff was excellent (except for one who has his hand in several side business that he tries to lure guests into), we did think it was a little pricey for what it was.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Puerto Rico", "Title": "“A wonderful Family Weekend!!”", "Author": "Idapuertorico", "ReviewID": "UR127630902", "Content": "For us Culebra is our piece of heaven and Club Seabourne is definitively the place to stay!! In March we came back to celebrate my husband birthday with our teenage daughter and the stay was better than ever, a weekend full of fun. Our room at Club Seabourne was very cozy and clean. The gardens are extensive and very well kept with lovely views of the Fulladosa Bay. The Hammocks are excellent and invites you to relax with a good reading. The staff at the Hotel always has been very helpful and caring. We spend Friday afternoon at Culebritas Island, and they made all the arrangements with the water taxi. We enjoy a delicious Caribbean Lobster that night at the Hotel restaurant. They also have a delicious breakfast. On Saturday morning we took the complimentary kayaks and make it to Dakiti, where we enjoy the beach and the gorgeous view. We then took our Jeep and spent the afternoon at Flamenco Beach, thanks to the Hotel staff that provided us with beach chairs and an icebox. On Sunday morning we took the Jet Ski tour with Culebra Eco Tour, an amazing experience!!! It was really a wonderful weekend.", "Date": "April 10, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York City, New York", "Title": "“Small easy place to stay”", "Author": "Washington-Wiseguy", "ReviewID": "UR127598482", "Content": "I don't need much from a hotel, I mean who cares what pillows they have and all that. I liked this place because it was 'muy local'. The gardens are lovely the rooms clean good views over the bay. That's it. I didn't live mu whole holiday there ... It's just a room after all. My wife loved it too ... so try it.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Florence, Alabama", "Title": "“nice lodging and staff”", "Author": "simjm", "ReviewID": "UR126655059", "Content": "The owner/managers and staff were all very helpful and really nice people. This is a very nice, relaxing property. We reserved last minute and got the only room available--no view, but most of the other units had a very nice view. Good coffee and a full breakfast in the mornings. The restaurant was a disappointment for dinner--it took for ever, even considering \"island time\" and the food was overdone. I would still try it again, because I think they were very shorthanded at the end of busy season.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Excellent time”", "Author": "ellisbellis", "ReviewID": "UR126616296", "Content": "Stayed at Club Seabourne for three nights in March and we would highly recommend it. The good points: Lovely setting, the buildings blending into the landscape. Extensive gardens well kept with picturesque views over the bay. Hotel is small scale and tranquil - perfect for a relaxing holiday Quiet pool area, never busy when we stayed Staff friendly and attentive Room spacious and cool Good value for money Pleasant walk up the track past the hotel to the local beach - ideal for snorkelling Things to improve: A bottle of water in the fridge on arrival would have been welcome A change in menu between Thursday and Friday would have meant we ate in the hotel again The padlock on the rom door was flimsy and fiddly - though a safe deposit box was provided in the room Mosquito plugs not provided in the hotel - perhaps take your own The hotel is situated in a quiet area, just a bit too far to walk to from the town. The island's taxis were a bit unpredicatble - turning up 30 minutes late once and another time not at all. Fortunately we were offered a lift by a member of staff. Perhaps the hotel could provide a shuttle service into town, for those without other means of transport. Overall the hotel seemed the most attractive on the island as others we saw were modern and lacked character.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“The best place to stay on the island!”", "Author": "Matt B", "ReviewID": "UR126352798", "Content": "This is the first time my wife and I have traveled to Culebra, and it will certainly not be our last. The entire staff of Club Seabourne was very accomodating and did everything possible to make our vacation an unforgettable experience. From the deluxe villa room with a perfect view of Fulladoza Bay to the excellent food at the restaurant, there is no doubt this is the place to stay. The entire hotel is spotless with stunning vistas and plenty of space to relax. Dave, the hotel's primary bartender, went out of his way to help my wife and I experience the real Culebra. Flamenco is a lovely beach, but if one wants solitude, then Culebrita is proper place to be. In his free time, Dave organized a trip for the hotel's guests to the small and amazingly beautiful cayo just outside of the island's bay. Here we came across some of the most picturesque and desolate beaches that I have ever seen in this portion of the Caribbean. Overall, I would recommend this hotel to anyone wishing to make a trip to Puerto Rico.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Chicago, Illinois", "Title": "“What a horrific experience!”", "Author": "Biff R", "ReviewID": "UR126256059", "Content": "We reserved the deluxe room, and instead were given the \"family room\" at check-in, with the need to switch to the Deluxe room on the last day of our stay. When I asked why my room had been double booked, the front desk person simply unapologetically replied, \"it happens alot\". This was the first red flag during our stay.The room was prepaid, so I decided to make the best of it, as I knew that they weren't going to offer a refund. On the day that we switched rooms, we waited until noon to get the key to our Deluxe room, but the counter person kept telling us that it wasn't ready and she couldn't give us the new key. We informed her that we would be out until later that evening, and she simply told us to check in at the office at that time. When we returned at 7pm, there was nobody in site. The three phone numbers listed at the front desk went unanswered. They didn't even leave a note on the desk informing us where to get the key. We finally decided to look in the desk drawer, and by chance, found an extra copy of the key to our room. After two hours of searching for a staff worker, making phone calls, and simply waiting in our Jeep, we were finally able to get in our room. We later found out that the property manager had our copy of the key and we were somehow, telepathically supposed to know who he was and where he lived. The next morning we brought this up to the counter lady, and she once again was very dismissive, and once again, NO apology. Cleaning service was sub-par. Floors were left unswept, room trash can was not emptied. The room door fit poorly on the frame, leaving 1/4 inch gaps under the door, where huge roaches and one scorpion crawled in through. We had to cover the gaps with folded towels. They mentioned that they offer wi-fi, but they didn't mention that we would need to leave our villa and walk down to the office to get any sort of decent wifi signal. We ordered the boxed lunch (turkey rap), and were disappointed when we took the food out of the cooler. It was wrapped in Saran wrap and the water had seeped right through, making it a mushy inedible sloppy mess. We returned the cooler with the wraps, and they once again brushed it off with no apology, yet still charged me $36 for the meal. The audacity of these people! Club Seabourne is nothing but a sham. Their glitzy, photoshopped website photos are just a facade. The staff is very unprofessional, irresponsible and just plain rude. I've stayed at Culebra Beach Villas, and Hotel Kokomo in the past. Had I known what I was in for, I would have stayed at either one instead. They're more rustic in style, but you get what you pay for, plus the staff is courteous and attentive. I don't ask for much when I stay at a hotel. I simply want honesty, cleanliness, a good value, and decent service, neither of which were offered at Club Seabourne. Please stay away from this place. It will ruin what would otherwise be a marvelous get away to a beautiful island.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“Best place to stay in Culebra”", "Author": "rrenatarocio", "ReviewID": "UR125855829", "Content": "My husband and I love Culebra, and everytime we go we stay at Club Seabourne. As a matter of fact, we chose to stay here for our honeymoon last January. Club Seabourne is located in a quite bay, the property is very well kept, and it provides a very nice living area ti stay, equipped with air conditioning, cable tv and hot running water. Carlos, the manager si always available to assist guest and is truly a fine host. However, if your are looking for luxury, bling, and all the stars and whistles, this is not the place, and I doubt that such exist in Culebra. But if your in the mood for a relaxed, slow paced vacation, Club Seabourne is an excellent place to stay. The rooms as I said have the necessary equipment, theirs maid service everyday, and you'll have the best view of the stars from your balcony. Aslo, you wont have to worry about breakfast because it is also included.", "Date": "March 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Beautiful Place”", "Author": "LVGIV", "ReviewID": "UR125839333", "Content": "Very relaxing with great people everywhere. Would most certainly go back", "Date": "March 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Simply loved my week at Club Seabourne”", "Author": "399CecileA", "ReviewID": "UR125625385", "Content": "I arrived at Club Seabourne absolutely exhausted from my NY life, and I left it a week later feeling like a completely new person. The property is beautiful and completely relaxing. There's absolutely no noise and the place is absolutely relaxing. Everything there is done with the view of allowing the guests to fully recharge their batteries.... And, let me tell you -- that worked very well for me. And Culebra island is just paradise. There're plenty of things and places to discover. I just got back, but I'm now looking forward to going back and staying at Club Seaburne agaon, where I know that Carlos and Linda will do everything necessary so that I have is care is just relax and enjoy. Thanks again, Carlos and Linda for this wonderful stay!!", "Date": "March 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York, NY", "Title": "“Beautiful Views”", "Author": "jlynnl", "ReviewID": "UR124975503", "Content": "This place is so extremely relaxing. The deluxe rooms are all individual villas on a hilltop. The staff was so courteous and nice, things do move a little slower here, but no one is in any rush. Breakfast is included in the rate, but found the food to be mediocre. Also, water tends to not work around 8 or 9am. You can be showering with soapy eyes, and the water will just shut off for about 20 minutes. This problem occurred more so in the morning than in the afternoon. Overall, I would definitely recommend this place. The warm breeze and roosters in the background immediately made me calm.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Great Accommodation & Friendly/Helpful Staff”", "Author": "julie01760", "ReviewID": "UR124165438", "Content": "This was our 2nd visit to low key Culebra with its great beaches and funky places to eat & drink. Previously we stayed at Bahia Marina and we found Club Seabourne to be far superior. Linda and Carlos were helpful and friendly. Internet in the lobby, plus availability of beach towels and chairs made our visit very comfortable. We will choose to stay in Club Seabourne again. Judging by the closure of most restaurants from Mon -Thurs/Friday, we sense that restaurants and lodging places are hurting because the lack of passenger ferry access has reduced the number of tourists. However the relatively new Zachos Tacos is doing well and definitely worth a stop. WE already are looking forward to our next visit!", "Date": "February 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“again, the best hotel in Culebra”", "Author": "monquiqui", "ReviewID": "UR123085653", "Content": "this is the 3rd time we stayed in the hotel just to confirm this is the best place in the island quiet, simple, elegant , relaxing, inexpensive!!! carlos allen and linda vega, are just fantastic!!they helped us with everything!! as always. we had dinner in the hotel a couple of times, the food was fantastic! we can not wait to come back next year!", "Date": "January 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Amazing hotel, perfect for a wedding!”", "Author": "ESLN", "ReviewID": "UR122949855", "Content": "The Club Seabourne staff is absolutely incredible, and played such an important role in our wedding. Cecilia organized the decor and beautiful flowers for our ceremony on Playa Flamenco, helped to arrange transportation to Club Seabourne for the reception, arranged a beautiful meal and wedding cake and even helped in finding a DJ! She and all the Club Seabourne staff were absolutely wonderful and our wedding was beautiful! I could not be happier with the level of service and support. If you're considering hosting a wedding or even in Puerto Rico (especially Culebra) Club Seabourne is the place to go!", "Date": "January 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portland, Oregon, United States", "Title": "“Dream Wedding!”", "Author": "Lisa D", "ReviewID": "UR121998094", "Content": "We wanted to have a low-stress destination wedding-leaving the planning to the professionals, and with minimum input from us, in partnership with our wedding planner Zahira (Eventus by Zahira), they created a wedding that far exceeded our expectations. The accommodations, the transportation, the setup at Flamenco beach, the preacher, the flowers, reception dinner, and dj were all excellent in a dream setting. We would definitely recommend Club Seabourne for either the perfect beach/island vacation or wedding (or other event). Getting to Culebra may be a deterrent for those who are more used to direct airport to resort, but for more well rounded travelers you can either get their by a small plane, or by getting to Fajardo and taking the ferry (approx. 1.5 hr ferry ride). They pick you up at the ferry dock so you don't have to worry about transportation on the island, but you can also rent a golf-cart or Jeep to get around on your own. Stay packages can include free bikes for guest use, and breakfast and coffee in the morning, which is a bonus since a lot of the restaurants on the island definitely have the laid back beach island mentality of closing when they want or need to. Club Seabourne's staff was super-friendly, polite, and professional and always made sure we were well taken care of and comfortable. THANK YOU CLUB SEABOURNE!! We hope to come back soon!", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“The best place ever!”", "Author": "Lisybwl", "ReviewID": "UR121469851", "Content": "Best vacations ever! Very personal service, they made everything possible to accommodate us. Wonderful breakfasts and meals. Carlos the owner and manager treated us like kings. Rooms very clean and organized, unlike Bahia Marina, in Club Seaborne every villa had a great view. All employees were very kind, we arrived late at night and they left the restaurant open for us. When asked at what time the bar closed they reply when you want. We ask for some ice and they packed a full beach cooler. Gave us the option of late check out which was at 3 and let us store bags in the car and let us enyoy the wonderful facilities until 4:00 because the boat went out at 5:00. Carlos, the owner, coordinated the car rental and even negotiate the prices. I've been in Culebra a few times and also stayed in other hotels (like Bahia Marina which was the worst experience ever) and for me this is the best hotel from the whole island with an OUSTANDING CUSTOMER SERVICE!", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Relaxing Vacation at Club Seabourne”", "Author": "krnesbitt", "ReviewID": "UR121437751", "Content": "We really enjoyed our time in Culebra and our accommodations at Club Seabourne. Upon our arrival at the island, we were picked up promptly at the airport in a very nice, new SUV. The staff members we met were very friendly and accommodating. Carlos, the manager, checked us in, familiarized us with the island, and was able to help us book a private scuba diving charter, as well as recommend a car rental service. The restaurant and bar had good drinks, friendly service, and very good food. We ate at the restaurant the first night we arrived, and I very much enjoyed my Caribbean lobster. The hotel even has a small wine cellar, nothing ultra-fancy, but very nice for a small island hotel. Prices were reasonable, as well. Breakfasts were included in our rate, which we appreciated not only for the convenience, but the quality. The room was a bit small, but perfectly adequate for the two of us. It was spotless when we arrived, and kept so during our entire stay. I loved the large four post bed, very comfortable. There was also a sitting room area with a small sofa, coffee table, and desk. The shower in the bathroom was nice and roomy. We had a balcony with a magnificent view of one of the bays of Culebra (see attached photo). It was great to sit out on the balcony, watch the sunset, relax and have a drink. (Just remember the bug spray!) The staff even allowed us to use their hose to rinse out/off our scuba gear after each day of diving. We didn't use the pool, but it was very clean and well maintained, although a bit on the small side. The grounds/landscaping were also meticulously maintained. We would recommend Club Seabourne to anyone visiting Culebra!", "Date": "December 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "North Woodstock, New Hampshire", "Title": "“At Your Service”", "Author": "mrkbell", "ReviewID": "UR121267104", "Content": "It may have been off seasonâ€¦the bar wasnt open and the heavily advertised restaurant was closed for dinners, the staff of Club Seabourne, made sure our stay was excellent. Carlos, the manager, even opened the restaurant for our family with fresh caught lobster, snapper and scallops, just for us. It was such a thoughtful and over the top gesture. The rooms are very nice, not extravagant. Just perfectly relaxing. Culebra is such an amazing place and Club Seabourne is one of its many gems.", "Date": "November 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Location": "5"}, "AuthorLocation": "Riverside, RI", "Title": "“a fabulous location for the rehearsal dinner for my son's wedding”", "Author": "Mary M", "ReviewID": "UR120748516", "Content": "What a marvelous location for this important event where Cecilia and her staff went above and beyond to be sure the coctail hour and dinner were perfect. We were thrilled with the location and the lay-out of the tables and the food was just delicious. We could not have been happier and we received compliments all the next day. It is a lovely haven on a magical island.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "1", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Mumbai", "Title": "“Best hotel in culebra”", "Author": "MamboMumbai", "ReviewID": "UR119935419", "Content": "This was really the best place to stay in culebra. Service was wonderful. Breakfast good. We only wish it was cleaner. They didnt seem to clean underneath beds but it seems other places here are worse so it might have to do with a shotage of labour on this island. People 's Holiday homes available for rent (i dont mean the apartments for rent which i heard are mostly badly maintained) may be another good option. Try internet searches - you probably wont find them on trip advisor but more on a craigslist sort of site if they do indeed list culebra.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "2", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A peaceful experience”", "Author": "0426galarza", "ReviewID": "UR119526997", "Content": "The rooms are beautiful,the attention excellent,the breakfast is so good. Its a small place with attention to details,I will return soon.You have to rent a jeep or a golf car because the beach is far,but you have the opportunity to explore the island.", "Date": "October 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Humacao, Puerto Rico", "Title": "“An affordable piece of heaven...”", "Author": "Maril C", "ReviewID": "UR116806156", "Content": "This little hotel have everything that you need for a relaxed vacation, peaceful setting, beautiful view,a nice, big and clean room with a queen bed, a sofabed, a balcony. They provide a cheerfull, excellent service, delicious breakfast and meals. The hotel provide you with a kayak and a bike, both are nice experiences. You will need to bring or rent snorkel equipment so you can have a full experience of this Island. We also recommend to rent a jeep. Flamenco Beach is spectacular, there you have bathroom facilities and kioskos where you can find everything (good food, chairs, umbrellas..)The other beaches at the Island are incredible too. We arrived to the island with the ferry service, it is really cheap way to travel with the ferry, expect long lanes, so arrive early. They said that they have a reservation line, but nobody answer the phone, so arrive early to buy your tickets. Dont forget to bring your sunblock and bug repellent. We loved the Island, but didnt like that they dont have a reservation system for the ferry.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "California", "Title": "“great stay for the second time at this resort”", "Author": "born4travelCA", "ReviewID": "UR116627415", "Content": "Club Seabourne â€“ We have stayed at this resort twice; ten years ago and again this summer and the experience both times have been absolutely superb. This resort is located on the hill side a few miles outside of town and from the local airport - by Fulladosa Bay & a dock where some guests will park their boats if they arrive this way. Otherwise there are two more traditional ways to get to Culebra Island; by mini plane from San Juan or Cieba or ferry from Fajardo. Club Seaborne offers regular hotel rooms in the main building and cottages on the hill side at a premium price. Both times I have opted to pay a bit more and get a cottage with a balcony and views over Fulladosa Bay. We stayed here again in July, last month after I had spoken to Linda from the front office in order to tailor the perfect package for my family which by the way she did a great job of doing! They have many different packages to choose from based on the guestâ€™s interest. Our package included welcome amenities and breakfast, (which is a la carte in the restaurant â€“ and very good food/hot menu selections). We also had the use of mountain bikes which we loved so we could ride into town and eat lunch and we had the use of beach towels which also came in handy the day we went to Flamenco Beach. All the cottages were remodeled and all had nice new king size beds with bamboo posts, contemporary dÃ©cor and bathroom re-done in a natural stone with oversize showerheads etc. A/C, safeâ€™s & mini refrigerators were also in the cottages and along with the king size bed new pull out sofa beds. I believe the regular hotel rooms were remodeled as well. The outside area between the cottages was nicely kept with cut grass, walk ways, palm trees and the area is lit up at night. Once we got to the island the Club Seabourne driver picked us up in the hotel van; he was a very nice man who answered all our questions with the most sincerity. The restaurant was re-furbished; we saw new local art pieces on the walls and the restaurant manager was present for both breakfast and dinner service. Since I was there last time the resort has established quite the wine cellar which is not something you expect on such a small island; as a matter of fact it is even hard to find a restaurant with a good wine selections on the main land of Puerto Rico. The night we ate in the restaurant it was packed - still service was impeccable. The manager suggested a wonderful sauvignon blanc for me to go with the Paella we ordered â€“ it was a perfect pairing. We also had a nice platter of islands appetizers including mini empanadas and conk, a tasty salad & the best home made lemon tart with vanilla ice cream. We saw many other appetizing dishes being served that evening including lobsters, steaks, whole fish etc. This seem to be the only upscale restaurant on this island so guest who are not staying at the resort will got here for a nice dinner. Club Seaborne has one of the two pools to be found on the island and it is very well maintained along with the lounge area by the pool and the pool bar where I got the best mojito I have probably had in my life. The bartender was great and there were not a drink he could not mix; my mojito - he took some time making with fresh mint, cane sugar and local rum, crushed ice. (Things take bit longer on this island but is all worth the wait). I can give this resort my highest recommendations; it may be a bit more expensive than other places on this island but you get what you pay for â€“ as the saying goes.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Cape Elizabeth, Maine", "Title": "“Nice hotel”", "Author": "Momof3reds", "ReviewID": "UR116135000", "Content": "So.....I was very nervous after I booked this hotel and read the reviews again shortly before our trip. We spent one week here. Once we arrived, I would say a lot of what I read was true, both the good and the bad. First of all I will say that if you are looking for a resort, you will not find it in Culebra. That was part of the reason we went. We wanted a laid back place where our kids, ages 7 and 5 yr old twins could snorkel off of the beaches without paying high prices for a boat, when we weren't even sure that they would be game for going. Culebra was perfect for them. I also would say, from what I saw this is probablly the best hotel to stay in on the island. The hotel is in a nice location. Close to Dewey and not too far from the beaches. The pool was great after a day at the beach or snorkeling for the kids to wind down after a long day. They enjoyed seeing chickens and lizards around. We stayed in the family suite which had a queen, 2 twins and a sleeper sofa. The beds were comfortable. They could use some new pillows but I thought for a family of 5, the price we paid was fair. The room was not the cleanest but really, we were just there just to sleep, were out most of the day and the amount of sand my kids tracked in each day, even if it was spotless, it wouldn't stay that way for long. The staff was attentive. Our air conditioner stopped working one evening. I mentioned it to the owner in the morning and it was fixed by the time we returned in the afternoon. There were ceiling fans in each room so we weren't uncomfortable even without it for a night. The fact that breakfast was included was great. It's not at other hotels we looked at. One complaint about breakfast was that it didn't open until 8:30, my kids were used to eating at 7am at home, but again, really, do we need to be at the beach baking in the sun that early each day, probably not. So it worked for us. The biggest let down for us was the restaurant. We ate there the first night but not again for dinner. The kids meals were $10 each for basically a box of Kraft mac and cheese EACH, huge portions, but I would have been happy with half the amount for 1/2 to 3/4 of the price. I ordered scallops which were way overcooked. My husband had issues with his fish but he wasn't expecting the WHOLE fish, so that was just a cultural issue, not Club Seabourne's. The next day at breakfast I ordered an omelette, again, way overcooked and the rest of the family had pancakes, some burned. From that day on we ordered the continental breakfast which was fine but we were served burnt toast 5 out of 6 days, which were more like croutons. lol I think if they stopped overcooking the food the restaurant might be quite good. Also if you are a tea drinker you are better off bringing your own. We ended up eating 3 nights at Baha Marina's restaurant which was fine and 3 night at El Eden, which we LOVED. Best Mahi Mahi I have ever had. Overall, I would recommend this hotel to people, just don't expect a 5 star hotel where you are pampered and there are staff around to cater to you. As I stated earlier, I think it is the best you will get on the island, and I was happy with our decision of staying here.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Ocean Springs, MS", "Title": "“Beautiful property, nice amenities, overall would recommend”", "Author": "nmgirl87", "ReviewID": "UR115845372", "Content": "Overall I would recommend Club Seabourne to others staying in Culebra. The property was very beautiful and well kept, it was nice to have a pool there after a long day of snorkeling. The service was great when we first got there, enjoyed the a la carte breakfast very much and especially enjoyed the bushwackers at the bar in the afternoons made by friendly Joe. The room was clean, the bed was comfortable and the shower was nice. My husband had fun feeding the chickens that roamed the grounds. I enjoyed sitting on the balcony and seeing the view of the bay. I thought the location was good and I actually walked to the pretty, rocky, beach at Punta Soldado which was a nice snorkel spot and excellent place to watch the sunset. A bit of a hike but a short ride in the car. Unfortunately we did not eat dinner there, had waited until our last night and the restaurant was closed - poor planning on our part. There were a few problems, but overall I would rate this stay as a positive experience. When we first arrived we noticed our shower had a loose piece of slate that could have fallen and shattered so we notified the front desk and they removed it but didn't fix it while we were there. Overall the service was excellent but when we were getting ready to check out there was no one at the front desk, they were gone to buy fruit for the breakfast...we made it to the airport on time though. We stayed through Tuesday and definitely noticed a decline in service after the weekend when it was busier. I would recommend putting on bug spray after dark for the mosquitos.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "5", "Overall": "3.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Aurora, Illinois", "Title": "“Beautiful location but needs some work”", "Author": "myn91", "ReviewID": "UR115826812", "Content": "Our stay at Club Seabourne was comfortable. The rooms are nicely furnished and have great views. The restaurant has good food and the hotel has some great ammenities. However, the value is not there for the price. For over $200 a night, I would not expect to find dust balls under the bed, mildew in the blower power cords, toothpaste stains in the bathroom mirror or hair on the drain or countertops. Sliding door did not lock, chair was missing the rubber stopper and the nail was scratching the floor which looked new, TV remove was missing, no glasses for water on the room, safe did not work, etc...I thought the issues were unique to our room but found some of the cleanliness issues also on the other room we had. The restaurant food was very tasty but service was lacking. It took 30 minutes for us to get our drinks and the food took over an hour. Breakfast, which is included in the price of the room, was fine but even here, the staff had issues. They could not agree if the plate of fruit was included in the pricing (no issue like this the day before). We booked a trip to Culebrita through the hotel. Our ride arrive an hour late. Although this is not their fault, the hotel staff couldn't figure out who they had called. In the end, things worked out but in the end we learned of other boat captains that provided service to Culebrita (while waiting on the dock, they kept coming back and forth). Bottom line, this is not a place worth $200+", "Date": "July 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A excellent hotel at a paradise island !!!!”", "Author": "Aleandres", "ReviewID": "UR115821918", "Content": "I stayed last week \" a family of 9\" with my family ! Best boutique hotel I ever stayed in culebra !! My family and agree with the restaurant the food was excellent especially the paella !!! The hotel personal was the best very friendly, kind , gentle , carefull . well I can say that my expectations are extremely exceeded !!! I definitely will come again ! Because the atmospheree was perfect relAx and tranquility !! Dont even think about IT just Go to club seabourne and enjoy !!!! The best boutique hotel in culebra !!", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bronx, New York", "Title": "“We just loved and sure will keep going back”", "Author": "juliethoward60", "ReviewID": "UR115191613", "Content": "We went to Club Seabourne last year and went back this year. The hotel looked awsome with the renovations! The gardens and the rooms were a dream. We were glad to see that Carlos was still there. Last year there was continental breakfast and this year was a la carte for the same great price. The rain did not allowed us to enjoy the beach or Culebrita, but we went to plan B. We do not know if there is another Club Seabourne, but at the one we stayed the food was great and the service was the best ever. You must visit this hidden paradise and enjoy a mojito at the bar made by Joe, from Virginia Beach!", "Date": "July 9, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Colorado Springs, Colorado", "Title": "“Awful”", "Author": "Foxfriend", "ReviewID": "UR114833370", "Content": "Two minutes after stepping into our room we discovered approx. 12 dead bugs in our bed and stains on the sheets. Our shower door was broken the curtain rod above the sliding glass doors was broken. The sliding glass doors would not close all the way allowing many bugs to come through. The floors were filthy and unswept. One of our travelling companions was give raw chicken at the restaurant. Our TV was had fuzzy reception and kept going out. The hotel is far from the beach. Overpriced. Done.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "1"}, "AuthorLocation": "New York City, New York", "Title": "“Doesn't Live Up to the Reviews”", "Author": "CraigSA", "ReviewID": "UR114627811", "Content": "This hotel was not as great as we were expecting from reading the reviews - but this may very well be the best on the island of Culebra - options are limited. Service was pretty much non-existent during our stay. We waited for help at the front desk / restaurant for a long, long time each time we needed something. Though, we really liked that they gave us free use of their beach chairs and towels during our stay. Our room, the small upstairs room next to the pool, was cozy. Definitely bring bug spray. We didn't get a chance to try the restaurant (which was closed from Sunday to Wednesday during our stay - low season). I'll probably try a different hotel when I go back to Culebra, but this hotel is definitely not bad - just didn't live up to the hype.", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Baytown, Texas", "Title": "“It could be better”", "Author": "cokerbud", "ReviewID": "UR113457217", "Content": "The room was average, the receptionist was less than average. The food in the very expensive restaurant was overcooked and overrated but the staff in the restaurant was great. Would I stay here again? No. Would I recommend it? No. The room needed attention and there were dead bugs under the hideaway bed. And bring some OFF.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Felt right at home”", "Author": "Cashzen", "ReviewID": "UR110283223", "Content": "Stayed for four nights at CS. Really felt at home. All staff is great, especially Carlos (GM) and Nanny. They catered to all our needs and we had few of them as we were traveling with our 3y old. Restaurant is very good with a good wine selection. Bar is next to pool and we enjoyed the best Bushwalker's in the island. We had an awesome time and are already planning our next visit.", "Date": "May 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Okemos, Michigan, USA", "Title": "“Well maintained with professional, friendly staff, and gorgeous views”", "Author": "7Ellen", "ReviewID": "UR109383973", "Content": "Praise for Club Seabourne: lovely rooms with nice amenities; smart, earnest, friendly staff who work hard and don't shy away from talking about the conditions of the reefs; well maintained; clean rooms; well built (in rain, you'll appreciate this!); beautiful, groomed, and natural landscape with paths and hammocks throughout; terrific towel service for the beach and pool; complementary rum drinks on arrival; great value with breakfast and activities included in the cost of most rooms. Two things that can be improved: the dinners were a tad over-priced and over cooked and please put coffee makers in the rooms. Sample of the great service and value: we're early risers who want to beat the heat and hit the beach before the crush of tourists. While breakfast typically started at 8:30 am, we showed up to the main clubhouse at 7:30, and they accommodated us with coffee and heated milk, took our breakfast order, and had us out the door in time to beat the rest to the beach.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mobile, Alabama", "Title": "“Awesome Place”", "Author": "Guest06", "ReviewID": "UR109091492", "Content": "My husband and I both work in the hospitality industry, so needless to say we are very critical of where we stay. Going to Culebra expecting to be another villa,we were nicely surprised when we got there. We stayed Thursday through Sunday at Seabourne, this place was just the perfect place in Culebra. The rooms are nicely decorated and very clean!. The food was just great!, Breakfast was a bit slow, but great! Food was just great!, I can't not wait to go back again!", "Date": "May 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Club seabourne experience.”", "Author": "Nrsantiago", "ReviewID": "UR103492456", "Content": "I stay with my daughter and husband on a villa, the villa has a queen bed and a sofa-bed. It was clean, nice decor, spacious balcony, beautiful view to bay. Complimentary breakfast a la carte. Dinner at restaurant great. This hotel is chic. Of course nothing like a resort but is the only boutique-hotel on the island. You need a car to go to the beach. My experience was excellent.", "Date": "April 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Fantastic place”", "Author": "analantigua", "ReviewID": "UR99176678", "Content": "The staff and management was GREAT ! They had excellent meals throughtout the whole day. If your looking for a place to escape from all your troubles at home this is definitley a place you would want to say at", "Date": "March 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Even better than last visit in 2010!”", "Author": "monquiqui", "ReviewID": "UR97235804", "Content": "The service is excellent!!! Linda At the front desk is very professional! Carlos the manager is superb, he finds a solution for everything !!! Wi Fi available now! Even if it was not needed , the hotel went under renovation, looks even nicer than last year! This year the breakfast is a la carte Instead of buffet It sounds cliche but we can Not wait to come back next year! This year breakfast is as", "Date": "February 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“The perfect little place to just relax and enjoy...”", "Author": "MirthaP", "ReviewID": "UR97025018", "Content": "After much research for our stay in Culebra my boyfriend and I chose to book with Club Seabourne...the first time I walked into the place I said to myself: \"I don't want to leave\". There is a certain tranquility and peace at Club Seabourne that hypnotizes. Something I couldnâ€™t explain or blame on the fact that we were coming in from a blizzard in New York. At the hotel they were nice enough to let us check in early without an extra charge...We were so enthralled by how calming and pretty the place was that we didn't make a big fuss about the patio table in our room plus Carlos, the gentleman that checked us in, warned us that they were not expecting us so early and were still painting the balcony, thus the table and chair inside our room. We immediately changed into our swimwear and drove off to Flamenco beach (by the way, YES rent a car!! The hotel rate includes a bike for an hour...but trust me the roads are somewhat crazy and tricky and you don't want to bike it anywhere!). The car ride to Flamenco was about 10-15. The minute we arrived at Flamenco and saw its light turquoise blue waters that same thought came over me again: \"I don't want to leave\"....It is one of the most breathtaking and beautiful places you will ever see. However, believe it or not Zoni beach is even more beautiful. The next day driving back from Zoni, Flamenco and Tamarindo beach we kept going straight past Club Seabourne to Punta Soldado beach (about 5 mins from the hotel, and good for snorkeling)....just in time to catch the sun setting. We were the only ones on the beach...and I think thatâ€™s one of the beauties of Culebra, it is small and intimate. Ok now back to the hotel. Overall Club Seabourne is a beautiful, quiet and private place. We actually looked forward coming back to the hotel at the end of the day because we knew we could have a good time just lounging on a hammock by the pool (open all night) or on our balcony. We stayed in a Deluxe villa and it was spacious, fresh, clean, modern and equipped with a TV, fridge, high-ceilings, the balcony had a view out to the bayâ€¦we didnâ€™t need much from staff so I canâ€™t comment on that. We definitely recommend Club Seabourne for your stay in Culebra! By the way, please listen to me when I tell you: YOU MUST TRY THE AMARETTO TRES LECHES AT THE HOTELâ€™S RESTAURANT! It is superb!", "Date": "February 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“An amazing experienced at a beautifull place”", "Author": "Estela233", "ReviewID": "UR87776600", "Content": "We spent a great weekend at the hotel. The service was incredible, they went above and beyond to provide all the services of an excellent hotel. The restaurant was very nice, food and wine selection was great. Everyone treated us in a great manner. The hotel is quiet, so the evenings appeared to be enchanted with a romantic air. The pool area with the hammocks is great for spending the afternoons. Would go back in a blinc of an eye!", "Date": "November 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“EXPECTACULAR CULEBRA EXPERIENCE! NOTHING BUT THE BEST->THAT IS CLUB SEABOURNE”", "Author": "puertoricantraveler7", "ReviewID": "UR87603811", "Content": "Hello People I am from PR and I must say that to visit one of the best sites of PR (Culebra) and stay in the best hotel and restaurant over there was a great experience. If you want to see one of the most beautiful beaches on the world, you must go to Culebra. And if you want to stay in a clean, friendly, high end but casual, \"boutique type\" hotel, you must stay in Club Seabourne. In addition, they have the best restaurant in the entire island. The manager Carlos is incredibly nice and the sights are perfect for the Culebra experience. Thanks Club Seabourne for a marvelous stay!!", "Date": "November 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“It is by far the best place to stay in Culebras PR”", "Author": "yjzne1", "ReviewID": "UR82944171", "Content": "Concierge Genies as one reviewer said it, would be an under statement! The staff was outstanding! Linda pick us up with a great smile, check us in and was very friendly and serviceable. Carlos and Clara were the best!! They were very genuinely concerned that we were being taken care of. The bartender was more than jsut the bartender, he was our waitress, whom served us in an excelent manner, but he mmakes the best Mojitos on the Island! The food was excellent, kudos to the chef. The room was great, clean and in a great location. The pool was clean and a grest place to relax and kick back our feet. They have kayaks and bikes to rent. I can honestly say its worth every penny. This is a smaller version of a resort with an exquisite with a Caribbean taste. This is a must stay placen which is family oriented.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Madrid, Spain", "Title": "“Only the view-disappointing”", "Author": "Melikes", "ReviewID": "UR67273461", "Content": "In fact the small houses were great! We thought we had reserved those ones but we were EXTREMELY disappointed when we arrived. They gave us a SPOOKY, DIRTY, GLOOMY apartment and they wanted us to BUNK! It was our anniversary and it was terrible!!!!!! After talking for hours, they gave us the small house for only one night. Yet, the second night was horrible! The apartment had a great view but we were so angry to see that. Unfortunately, there was not another place to stay at that weekend.", "Date": "June 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Outstanding service!”", "Author": "2bumpers", "ReviewID": "UR65185473", "Content": "Club Seabourne was wonderful and Linda was amazing. She's like a concierge genie! You ask-she provides almost immediately! She picked us up from the ferry dock on the late ferry, after her shift was over. We needed a jeep-done! We wanted to take a trip to Culebrita-done! We couldn't say enough nice things about her. The room was comfortable and clean witha great view. The bed was a little more firm than we were used to so sleeping was not as good as we had hoped. My boyfriend's only complaint was the toilet paper, so if you have a pampered bottom it's best to pack a roll of your own :) What we didn't know is that restaurant hours on the island are set, so if you get hungry at 4 o'clock you're kinda screwed unless you get to a grocery store. Fortunately the chef fixed us up with some wonderful appetizers at the bar. Very tasty. The pool was nice and the grounds were beautiful. I wished we had stayed here longer.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“best place to stay in culebra”", "Author": "monquiqui", "ReviewID": "UR56565552", "Content": "-great value -the best views from the room -simple and clean -healthy breakfast, but it would be nice to have access to coffee earlier in the morning - friendly staff - no internet access - 5 min drive to town -10 to 15 to flamenco beach -30 min to Zoni beach", "Date": "February 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "bozeman, mt", "Title": "“Beautiful scenery and gorgeous beaches.”", "Author": "packerfan4bozeman", "ReviewID": "UR55588701", "Content": "We actually stayed here on our honeymoon in 1995, but are looking to head back with our three children. We were there in June which is their off-season so there wasn't anybody at the beaches. We snorkled and swam all by ourselves, it was fabulous. The bar at Club Seaborne was fun, met some nice people....I remember Walter from Milwaukee. There isn't much luxury here and thats what we liked most. Thank you Club Seabourne!", "Date": "February 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Miami", "Title": "“This is a clean, great place to stay”", "Author": "MiamiTravelMom2010", "ReviewID": "UR53483829", "Content": "We stayed here in Dec for a 3 day mini vacation. We took the adventure package that include the Kayaking and the jeep rental. It was wonderful. I traveled with husband and my 13 year old boy and 12 year old daughter. Took the morning ferry from Fajardo (they had parking facillities in Fajardo). The ferry was very clean and organized. 45 minute trip to culebra. Once in Culebra, they pick us from and took us to the hotel. The room was very spacious and clean. 1 queen beed and a queen sofa bed for the kids. It also had a nice balcony with a view of the bay. We went kayaking the first day and it was really nice and relaxing. The second day we had the jeep and went snorkling and to Flamingo beach. We also had the jeep for the 3rd day until we left on the early afternoon ferry. Culebra is very nice. You have great scenery and beaches., Worth the trip. I strongly recommend this place to stay. One more recommendation is if possible to take a cooler with beer and sodas from Fajardo. There is limited availability of markets and the restaurants are very few. We had great burgers by the airport (can't remember the name of the place). Be sure to have an early dinner, some places close early during weekdays.", "Date": "January 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "England", "Title": "“REALLY ENJOYABLE STAY”", "Author": "Steve028", "ReviewID": "UR34256018", "Content": "My wife and I wanted a peaceful get-away-from-it-all break and this hotel fitted the bill perfectly. A quick note on how we got there, Jet Blue flight to San Juan about $150 return from Orlando. $20 taxi ride from SJU to Isla Grande airport to get the Air Flamenco -rollacoaster-great fun -Islander flight to the island. These were $105 return which we booked by phone from the UK as they don't do internet bookings. We got charged for overweight cases but this isn't in the same league as Ryanair and we were only billed about $20. We found the room to be very clean, with TV, music system, small fridge but curiously no coffee maker! The price for the hotel was quite expensive when compared to prices in PR and Florida but I guess most things are more expensive on the island(food in the supermarket, car rental etc). Breakfast was very nice, and plenty of it, fresh fruit, bread, rolls, juice, coffee etc, and we had 1 dinner at the restaurant which was very nice(a little pricey though). One of the other reviews prepared us for the restaurant closing on Mon /Tue and if you haven't brought food you'll starve! Seriously though, you have to back into town to sort some food out and your options are a little limited there. Yes it is quite a long way (not walkable) from the only town so we felt a car rental was needed but taxis are an option. I can see why some reviews mention lack of staff but, as we like being left alone, it was perfect for us. They picked us up from the airport and when we saw that we needed a jeep took us back to get one. All the staff we saw were extremely pleasant and helpful. If you like a laid back vibe, little night life and to be left alone then you'll find the island fantastic! The weather in May was great, very hot and only 1 afternoon when it rained, so we were amazed to find about 15 people on Flamenco Beach and the most we counted on Rosario beach was 10. I know it was their slower season but at times it felt like we were the only people on the beaches. The day we went to Zoni we WERE the only people on the beach. We like to snorkel and found Rosario to be the best with the reef literally 10 feet off the beach. A good selection of Parrotfish, rays, coral etc, etc. Flamenco is a great beach with good snorkelling up by the old tank and great fun messing around in the waves at the centre of the beach(but be careful, these waves can hurt!!). Melones wasn't too bad for snorkelling either. We didn't get see all the snorkelling places but its a place that we would definitely go back to to explore the rest.. To sum up: go there if you want to feel like Robinson Cruso, don't go there if you want 5 star resort style luxury. We loved the island and hotel.", "Date": "July 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York, NY", "Title": "“Catered diner was a wonderful experience”", "Author": "CulebraWedding", "ReviewID": "UR32196071", "Content": "I reserved the entire dining room for a rehersal diner. I had to do it via e-mail and was surprised when the catering director kept in touch with me even though she was on vacation in Spain. Between e-mails and phone calls we palnned a dinner and arranged for the room set-up. I was very nervous but had no reason to be. The room was beautiful, the table was set with white linen, crysrtal and silver. There were even charges under the plates. The food was delicious and the service excellent and the staff was warm and smiling. Theyf did not seem to mind serveral small children running around. I was extremly pleased with everything!", "Date": "June 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Washington, D.C.", "Title": "“This hotel is faded glory and not worth the money”", "Author": "GuinnessWashington", "ReviewID": "UR26345500", "Content": "We stayed 3 nights but wish we hadn't. The room was in poor condition; many things didn't work. Bird doo was not cleaned off the deck table. The bathroom floor wasn't clean. The breakfast was mediocre. The evening meal was OK but overpriced. The staff, except for the bartender, was helpful, particularly Carlos. The bar television blared constantly throughout the grounds. Inexplicably, the bar and dining room are closed 2 days a week. No internet service. Paying in excess of $200 a night for this run-down dump was outrageous.", "Date": "March 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "maine", "Title": "“Can't wait to return!”", "Author": "beach_bumMaine", "ReviewID": "UR26297865", "Content": "My boyfriend and I had an amazingly relaxing time! Our villa (#5) had the best view of the bay. The staff was more then helpful and friendly. We went to the Dingy Dock one night for drinks and had a great time. Don't go to culebra looking for a 5 star setting. The food at Club Seabourne was great ( a little pricey but good). You must rent a jeep to get around the island and get to the most beautiful beaches. Flamenco beach was great but was the most populated. Zoni beach was great once you got there. As for getting to culebra I highly reccomend the plane. It is a little nerve wracking but the ferry takes for ever and I did not enjoy stepping over puck as I was exiting. The plane takes 12mins total from the mainland and the ferry about 1 hour 20mins ( and it is $2.50 for a reason). The biggest reason to go to Culebra is to relax and that is what we did and Club Seabourne did everything they could to aid us in our mission.", "Date": "March 16, 2009"}, {"Ratings": {"Service": "2", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Reading, PA", "Title": "“Solid choice in Culebra”", "Author": "Berks1970", "ReviewID": "UR23874443", "Content": "Overall, nice, but not perfect. The good: nice pool, good location, nice grounds. Breakfast in the AM is basic continental, but was fine for us. They picked us up promptly in Dewey upon arrival. It's a quiet enough place, assuming you don't get noisy neighbors (we didn't). There is a road nearby that has a bit of local traffic you'll hear, and some dogs and roosters in the neighborhood (but that's anywhere in Culebra). Restaurant is expensive, but my partner is still raving about the filet mignon there, so I'd say they did the job food-wise (service was just ok). The mojitos at the bar were amazing!!! The not so good: Staff was helpful and friendly when they could be found. There isn't an overabundance of staff, so you need to be patient sometimes or go looking for someone if you need something. Restaurant and bar are closed Monday and Tues. (we were there Sun. thru Wed. AM). We turned down the A/C one night and got wet as the unit dripped like mad. Had to get beach towels from the desk clerk to mop up. Satellite TV was sort of tough to figure out and the CD player in the room had a mind of it's own. Also, the mat in the living room area was most uncomfortable to walk on without shoes on. The bed was acceptable to me, but my partner wasn't too happy. It's a decent place - we felt some of these negative reviews were harsh compared to our experience, which was pleasant enough. Not sure we'd go back - Bahia Marina just up the road was about $40 cheaper per night and the rooms looked like they were better appointed. If you are staying in Culebra, we would highly recommend renting a jeep to get around the island so you can see everything on your own schedule. Just spend the $$ and do it!", "Date": "January 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Santa Cruz, California", "Title": "“Perfect”", "Author": "boomerz", "ReviewID": "UR23137612", "Content": "Our stay at Club Seabourne on the beautiful island of Culebra was a highlight of our trip to Puerto Rico. We got a great \"pre-Christmas\" rate directly from the hotel. (It included breakfast, 1 hr kayak, free drink.) Club Seabourne has a very relaxed charm that grows on you. Staff are helpful and things run smoothly. The restaurant serves excellent food. Take a deep breath and really relax. We loved it. Pros: Comfortable, clean, nice views, professional staff, great food. This is a great place for experienced travelers looking to unwind. Cons: We had a deluxe villa (#5) it was great. Saw #4, not as nice. if you expect a 4 star hotel and a lot of activities, you may be disappointed.", "Date": "December 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Juan", "Title": "“Wonderful Getaway”", "Author": "globito", "ReviewID": "UR21071566", "Content": "The place was beautiful, the staff was excellent and the food.... superb!!! The place to go if you want to relax and enjoy nature.", "Date": "October 21, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Pleasantly surprised”", "Author": "JRD90", "ReviewID": "UR17234328", "Content": "Being from Puerto Rico, I am conisdered a \"local\" in the island of Culebra. However, being in Culebra felt like I was a 1,000 miles away. Culebra is a slow paced, rural and underdeveloped island. And these are the things that make it charming. Thus, if looking for fancy resorts and casinos, stay in the \"isla grande\", Puerto Rico. That being said, it has the most SPECTACULAR beaches well worth the trip. Club Seaborne is the perfect place for those who are not in a hurry, looking for a place that is clean, comfortable and if staying in a deluxe villa, get a great view and balcony. Nothing fancy, but overall well put together. Nice plasma TV in room w cable. The staff was friendly. The restaurant food is excellent and reasonably priced. Bar has great mojitos. Towels are available as well as beach chairs if venturing out. Kayaks also are free. The higlight of our trip was the trip to the adjacent island of Culebrita. You need to get a water taxi (the hotel will help) and for $45 a person, you have paradise island at your feet!", "Date": "June 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kansas City, MO", "Title": "“Great villa on a great little island”", "Author": "travelKC", "ReviewID": "UR8439861", "Content": "This was the perfect start to our Honeymoon. We spent three days and two nights on the charming island of Culebra. Our friends had honeymooned at this property and highly recommended it. Our large one-room villa had a small porch overlooking the water. It was almost like being in a secluded resort. The pool was nice; the restaurant was pretty great as well, though we only at there one night. A few notes about Culebra--be prepared for roosters to wake you up at dawn, and then keep cock-a-doodle-dooing for a couple more hours. You get used to it, but being a city girl myself, I was not prepared. Also, I highly recommend renting a Jeep from Carlos' Jeep Rental. It's located right in the teensy-tiny airport and it's the best way to see this gem of an island. Also, be prepared for a restaurant to not have a dish you order--it's just the nature of being on an island. Sometimes your entree ingredients are on a ship that won't arrive for two more days...such is island life. There are a handful of restaurants on the island that I recommend exploring, including the Blue Iguana and Dinghy Dock. I think we ate at the Dock three or so times. It's right on the water and boats pull up throughout the day. I would also take some time to explore all of the beaches on the island. Zoni is by far the best, though others will try to tell you Playa Flamenco is number one. Don't listen! Zoni has beautiful white sand and was virtually empty when we were there. Culebra is a beautiful island and Club Seabourne is the place to stay.", "Date": "August 16, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Puerto Rico", "Title": "“Once upon a time”", "Author": "TainaPR", "ReviewID": "UR6907014", "Content": "After visiting web site and viewing pictures of the hotel I was sure of making the best decision on booking Club Seabourne for our anniversary. Unfortunately, when given our room, I immediately knew I made a mistake. The room stank of humidity, as if it had been closed up for weeks and just that day turned on the air condition. It was very evident they didn't bother to clean up. The bathroom and the entire floor of the room was filthy (lizard poop, cockroach parts, disgusting!) The bathroom curtain was filled with mildew and the shower was approximately 2 feet wide; the wall of the shower was gooped with silicone to seal (without accomplishing it) the crack (2 inches) between the floor and wall. Needless to say with such little space we had to shower moving as little as possible; water pressure terrible too. Need of major remodeling. The complimentary breakfast was terribly miserable, cold, and left outside on the restaurant terrace to be bothered by flies and mosquitos. Staff in general showed no hospitality or care for our discomfort. Culebra was great, but Club Seabourne should be shut down!!!!!", "Date": "March 3, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“romantic”", "Author": "kot_in_boots", "ReviewID": "UR6831966", "Content": "Mistakingly, after reading all the angry reviews I decided not to stay at Club Seabourne. After doing extensive research on places to stay on Culebra, it seemed like every place was going to be somehow a dissappointment. So the first two nights we stayed at Casa Robison which was great for the price but lacked charm. We drove around and found one room available at Club Seabourne to spend our last night at Culebra. Yes this place is not a five start hotel but it's abot the same quality that the rest of the hotels on the island provide except that's it's much more romantic. Carribean decor, island colors, our room was very spacious, had a couch, nice touches such as turtle book ends, wooden birdcage. Some evidence of disrepair with occasional paint chipping off, patched up screens, the bathroom needs a little work. The public rooms are all in great shape, awesome outdoor bar, romantic restaurant, the service was excellent, and the food was good. The pool was clean, no odor like some of the reviewers noted. The grounds are well maintained as you can see by well groomed palm trees. A bunch of humming birds were having feast around our villa's flowers. After a few drinks at the bar we had our third and final dinner on the island. It didn't dissapoint. After the dinner we hung out on the hammock by the pool looking at the starry sky nicely framed by the palm trees. I would recommend this place for a romantic getaway any time, but don't be shocked if this is not a five star experience, nothing on the island is, because when you travel to Culebra not only you \"get away from it all\" but you also step back in time where not everything is quite up to the Western standards, but that's what makes the island authentic. When I return to Culebra I would probably stay either at Club Seabourne or a private rented house.", "Date": "February 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Juan, PR", "Title": "“A Paradise”", "Author": "masterwork", "ReviewID": "UR5965651", "Content": "This small boutique hotel is a paradise. Culebra is a very charming tiny island, so you will not find night life or exciting activities others than going to the beach, relaxing and eating The resort is beautiful, rooms are well kept and very clean. No TV or telephone, so you can disconnect from the outside world. Personnel is attentive and willing to please guests in their needs and desires. The restaurant is superb! Chef Guillermo is very nice and the food is gourmet, at a reasonable price. We will definitely return to Club Seabourne, we will again to go to paradise. Maira and Reynaldo Landa, San Juan Puerto Rico", "Date": "October 17, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Puerto Rico", "Title": "“If we only new...”", "Author": "ChinaSupay", "ReviewID": "UR4995165", "Content": "I satayed at CS with my husband for only 1 night and we just fell in love with it. They take us without any reservations and treat us very well. 1st you have to understand what type of place is CS and to what type of guest they cater to. If you need the Resort attention 24/7, can't live 3 days without watching the game or Oprah or never leave the premises of your hotel, then CS is not for you. But if you want to just relax, detox from work or everyday rush, lay by the pool where nobody bothers you, tour the island and are able to enjoy the little things in life (not always perfcet) then CS is where you want to stay. The rate includes breakfast buffet, great scamble eggs and fresh fruit. The pool, small but I can do my morning laps without trouble. Can't wait to go back to CS.", "Date": "April 22, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Southampton, New York", "Title": "“Bait and Switch”", "Author": "jhh", "ReviewID": "UR4570427", "Content": "We arrived to find that the Club Seabourne was not as advertised on it's website. The rooms were small, my son had to sleep on the floor, nothing good about the restaurant, they were out of bread, fish and more than half the items on the menu, terrible experience, we hellicopted in, wish we had flown over Seaborne. Beach was beautiful at Flaminco, hotel was a rip off, chef was lazy, web site should be shut down, uses magazine articles, must have a relative in the editorial department! save your family, money and sanity/look elsewhere!", "Date": "March 2, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "kennebunkport Maine", "Title": "“oh my God, yuck”", "Author": "shannonmaine", "ReviewID": "UR4308364", "Content": "I was so excited to stay for a week at Club Seabourne but little did I know how it really was. The rooms were frightening! The pool smelled like sewer! The service did not exist and the man runing the place was down right rude!!! I was shocked and I am still shocked! They clean the rooms sometimes and sometimes they didnt. The rooms were not clean and smelled like mold. The food was not good either. We couldnt open a window due to lack of screens and so many bugs. I enjoyed the snake and scorpions!!! I wouldnt go back to this place for the world!! God help anyone who stays here. And I was told my room was the best one they had!!! Good luck", "Date": "December 28, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Princeton, NJ", "Title": "“Disappointed”", "Author": "A TripAdvisor Member", "ReviewID": "UR3336341", "Content": "We just returned from our first ever trip to Culebra, Puerto Rico. We knew going in that the island was very casual and laid back, so we were not expecting luxury accommodations, but through some web work, we found Club Seabourne. Their website sells you on the promise of a higher end experience and accommodation. Our family of four decided on their Family Villa, at a cost of a whopping $320 per night (2-3 times the average rate on the island). At that price, it has to be good right? Boy, were we wrong. The â€œvillaâ€� was located in the parking lot (something that didnâ€™t make the photos on the website), and it was so tiny there was no room to walk once we put down our bags. We couldnâ€™t unpack, because there were no closets or dressers to put our things. We immediately went to the hotel staff to ask for another room, but the other rooms were not only booked, but smaller than the place we had. In fairness, the staff person was very nice, and gave us no problem when we immediately checked out. The remainder of our first day was spent looking for other accommodations, which was looking pretty bleak until we stumbled upon a place relatively newly opened just up the road called the Bahia Marina resort. What an awesome place. First only $150 a night for a spacious two room fully air conditioned place complete with full size fridge, microwave and stove. All new appliances. Two queen beds in the BR and a fold out couch if you need it in the LR. 2 Full Baths, and a spectacular view of the Bay. Top it off with a great simming pool, a full service restaurant/bar and truly warm and accommodating staff. Our vacation went from hell to bliss in the turn of a key. We loved it so much we extended our trip by a day, with dreams of chucking it all to stay forever. Jeep rental is keyâ€¦ well worth it. Carlosâ€™s Jeep rental has the newest fleet, and some of the great snorkeling and beach spots are only accessible w/ 4 wheel drive. One last thing on Club Seabourneâ€¦ we gave the place another shot and went there for dinner. It was billed as the best place for seafood on the island. Wrong again. Entrees were $20-$30 and the only seafood on the menu was frozen lobster tails that were broiled, hard and over seasoned, or lobster rice with bits of the aforementioned lobster and tons of uninspired rice. Service was good, but the food way overpriced for what it was. We did find, the hands down best dining experience on the island on our last nightâ€¦ Juanita Banannas ----------------. Incredible atmosphere and views only topped but the menu and service. Itâ€™s BYOB, so the emphasis is on the food. Club Seabourne has done a great job of getting hype on the web, on travel sites in local magazine, but I wonder if that is just their marketing or if someone actually went there. If there was a heyday there, it's long gone.", "Date": "April 5, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Birmingham, Alabama", "Title": "“LOVED CLUB SEABOURNE AND CULEBRA!!!”", "Author": "dlpalm", "ReviewID": "UR2973568", "Content": "My wife and I vacationed here last Feb. and are heading back. We have been all over the Carribean and basically go to only small / secluded destinations. We LOVED Club Seabourne! No, it is not the Ritz Carlton but we found the staff extremely helpful and courteous, the dinners very good (bordering on gourmet some nights), and the breakfasts adequete. The rooms were comfortable and clean, and again, while not four star, they were very nice. The pool was small but, again, very nice and we had it to ourselves for most of the week. The island itself was a real treat. Down home, local, and friendly. The small local restaurants were very good (Dinghy Dock and Mamacita's were awesome). You basically felt at home within the first day. We were having drinks at the Dinghy Dock one afternoon and were telling the bartender that the bartender at Club Seabourne recommended Mamcita's and suggested that we check that \"Arlene\" is cooking when we go. The lady three stools down from us, eating her lunch chimed in and said \"Hey, I'm Arlene! Make sure you come down tonight and I'll make you some jerked chicken!\" If I could move to this place I would.", "Date": "January 3, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Had a good time”", "Author": "mcguillicudy", "ReviewID": "UR2439268", "Content": "Overall a very charming resort. We enjoyed our stay. Don't expect big resort amenitities, after all it IS a mini resort. The rooms were clean and the restaurant good, if a little expensive. Our kids enjoyed themselves, even though our son had to get his fix of TV in the lobby most nights. The island as a whole was amazing (our friend is planning on staging a coup so she can take over.....so beware). Flamenco beach is everything it is advertised to be, but spend the extra few bucks to get chairs and umbrellas on the beach. The sand is amazing, like powdered sugar! Zoni beach is very beautiful, but a little rocky. Mamacitas was a bit overrated. We really like Dinghy Dock, the food was inexpensive but great and the view was the best of any restaurant. Try the little pastaillos stand on the road back from Flamenco beach, by the airport. The little old lady makes some great chow. Probably the only complaint we had was during checkin at the hotel. We were first but the staff cut us off to take care of some natives PRs while we waited....and waited. It was irritating to be so obviously discriminated against. the management knows when the ferry arrives, maybe they should have some extra staff there for check in? Overall, the stay on the island was great, and you really can't expect evrything to go your way. We will go back but might split our time between a couple of other places for less money", "Date": "August 10, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Newark, NJ", "Title": "“Charming”", "Author": "A TripAdvisor Member", "ReviewID": "UR2040101", "Content": "Club Seabourne does offer the best looking accomadations on the Island. However, there are no television sets in the sleeping quarters. While that was okay with me, my honey had a hard time understanding why it was we payed sooo much money.We had a nice stay, the service was okay and the breakfast was also okay. We didn't get a chance to have dinner there so i can't write a review on that.Overall, very charming place to stay. Room was very clean and well kept. Also looked exactly like the pictures online with the exception of the pool. It was kind of small. We'd definately stay there again.", "Date": "May 13, 2004"}], "HotelInfo": {"Name": "Club Seabourne", "HotelURL": "/ShowUserReviews-g580453-d151840-Reviews-Club_Seabourne-Culebra_Puerto_Rico.html", "Price": "$184 - $271*", "Address": "<div class=\"amenFloat\">", "HotelID": "151840", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/00/1b/bf/11/club-seabourne-outdoor.jpg"}}