{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Carolina Beach, North Carolina", "Title": "“Awesome!”", "Author": "surfhorse", "ReviewID": "UR127762635", "Content": "Having read the reviews, my thoughts wondered if I had made a good choice, but YES I DID! The rooms were a little small, but who goes to a hotel to stay in the room? The beach was steps away. My daughter and I spent Easter weekend there and we had a blast! The people who so anything bad about this hotel should probably be the people who shouldn't travel and just stay in their own homes! I will return for sure!", "Date": "April 12, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Carolina Beach, North Carolina", "Title": "“Atlantic Beach Hotel, Condado Beach, Puerto Rico”", "Author": "surfhorse", "ReviewID": "UR127751840", "Content": "Excellent location! Beautiful beaches! Staff was superb!!!! Enjoyed everyone at the resort including the guest. It is the happiest place on earth!!! Rooms are small with only a double bed and there is not a pool, but the ocean is a few steps away and it is fantastic! The stores around the area are rather expensive, so go to the mall if you can. I will return!!!", "Date": "April 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Louisville, Kentucky", "Title": "“An honest review”", "Author": "skislopescorpion", "ReviewID": "UR127471920", "Content": "I stayed at this hotel from February 22nd through February 28th of 2012. Before arriving I had read in some of the other reviews that the employees were rude, the rooms were tiny, the place was always under construction and about all the other \"problems\" that could potentially ruin our vacation but because I was trying to budget on my room so that I could finacially esperience all of Puerto Rico I opted to take a chance and roll the dice. At nearly $100.00/night you can't beat the price. Many larger hotels are within a stones throw from here but you will pay more. But it is a no frills hotel, don't expect the red carpet rolled out on arrival. Okay LOCATION ....the best!!! Beach front, walking distance to EVERYTHING, food, shopping, nightlife..you name it. It's all right there. The staff was efficient at checking us in -took maybe five minutes. They were a little stoic in apperance but I later saw that most everyone from P.R. appears this way. The rooms were small but VERY clean and well kept.. newly renovated. House keeping came by every morning to clean and provide fresh linens. The bad part is you can hear anyone walking/talking out in the halls but we were only in our rooms at night to sleep. The only construction going on was at the bar area from about 10 am until the sun went down but we could not hear it from our room. Maybe thats because we did not have an ocean facing room (why pay for this when we were seriously only in it to shower change and sleep??) The bar on the beach is small but quaint. Off to one side is where the construction was taking place but they had it all blocked from view and the music they played was loud enough to make the construction seem non existent. The beers/drinks were cheap- happy hour all day!!!! There is a large gay presence but if your not a total homophobe then there are no problems. I didn't see ANY innapropriate behavior but still the atmosphere here is adult oriented ..don't bring the kids. Besides.. this is everyones vacation... not just yours :) Manny, Ivan and Carlos at the bar were very attentive..bring cash or you'll have to open a tab and pay a surcharge. I used my credit card though (with the money I saved on staying here I didn't have to budget so much on the extras) The Atlantic is RIGHT THERE..like steps away. It was AMAZING and so Relaxing!!! All the patrons were very friendly and we ended up hanging out with alot of people we met on the beach soakin up the beautiful sun during the day and bar hopping with them at night. My boyfriend and I had an amazing time!!!! If you are looking for hot tubs and all the luxury of the HYATT then don't stay here, but if your open minded, wanting to save some cash while staying at the BEST location.. then this is a great place to stay. We can not wait for the cold weather to return to our state so we have an excuse to get back to P.R. and we WILL definately to stay here again.. I've stayed at much nicer hotels in my life and i have had my issues with staff being rude, plumbing, noise levels, ect. but none of that seemed to really be an issue here. This was just our perception though... We rolled the dice ...and won. :)", "Date": "April 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Silver Spring, Maryland", "Title": "“Aaaahhh Right on the Ocean”", "Author": "Born_to_go61", "ReviewID": "UR127242565", "Content": "You are steps from the Atlantic and what a nice beach. We have stayed in other boutique hotels here in San Juan and this one is closest to shops, restaurants, night life. Also a bus ride is 75 cents to Old San Juan City. Note: There is a night club next door, so if you go and sleep early, ask for a room on the side away from the club. It was loud on the weekends and after changing rooms, we heard nothing at all. There is a gay clientele, but it did not affect our visit and we never felt uncomfortable. There is no restaurant yet, but they are working on it and said that it would be opened in the summer.There are a couple of casinos and a weekend market place nearby. There is no free parking, but go into the hotel and they will take care of you and your car for 10 dollars a day. The staff here was very helpful and friendly. The rooms are small, but clean and there is a hair dryer! Have fun.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Location.location. Location”", "Author": "scotthumb", "ReviewID": "UR127073899", "Content": "Probably most notable thing is the majority of patrons are gay. It presented no problem for me. Everyone was very polite and respectful. You can walk up our down the beach fifty yards in either direction to hang with the straight crowd. Room was small but clean and comfortable. Staff was friendly and helpful. One note: the do not allow local guests up to the rooms. I talked to other guests who said there was no problem if a white visitor wanted to visit a guests room. This apparent policy was the only thing that left a bad taste in my mouth. Bar is being remodeled. Noise was never an issue. Large gaps under room doors meant lots of light and sound were always present. Location couldn't be better. Shopping, restaurants, casino, buses and beach is all right there.", "Date": "April 1, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Buffalo, NY", "Title": "“Good Budget Hotel”", "Author": "MCarson699", "ReviewID": "UR126799246", "Content": "This is a no-frills hotel... don't go in expecting to be blown away. However, the location is great and the price is right. The rooms were small, but clean. The staff is nice, but you aren't going to be a prince staying here. The best part by far is the location, you can walk almost anywhere... we even walked to old San Juan, but we really like to walk! My biggest complain is it was a little noisy at night (just door closings and things like that, no partying).", "Date": "March 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Richmond, Virginia", "Title": "“Why bother complaining....your in Puerto Rico!”", "Author": "Pisces1979", "ReviewID": "UR126131902", "Content": "I stayed here the third week of February 2012 for my birthday weekend with some family. We had a blast. I guess I am just not one to nit pick every little thing I figure I am on vacation and out of the country no less...who cares about the room as long as it is clean with no bed bugs its perfect to me....besides who plans on being in there more than a few hours to sleep. I could complain about the creepy elevator, the tiny bathroom and room(s), or even the little hut of a bar or the small amount of construction (which thankfully we stayed on the weekend so no work was being done), the varying cab ride prices, etc.. but why its all in the experience and none of it killed me so its nothing to get irate about. The hotel is in a perfect location you can get anywhere and if your brave the bus is like 75 cents!! and will take you anywhere just about. One thing I (we) didnt experience that most seemed to have experienced was rude customer service. I (we) were treated very well upon check in-during-and check out. Eddie was the best by the way! Also the other gentlemen who works at night he recommended a trip to the Old San Juan hotel....BEST PART OF THE TRIP! We had a great time there ...the casino...the live band...club Babylon!!! All and all it was a great birthday weekend and I would return to this hotel.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Under construction !”", "Author": "Jensans83", "ReviewID": "UR125851425", "Content": "My girlfriends and I planned aast minute getaway here for a few nights. We booked here because it seemed liked the best value. We opted for the ocean view room with 1 double & 1 twin, which worked out perfectly. There is no control over the heat/ac in the rooms, so be prepared for cold/ hot temps while sleeping. The location was amazing, walking distance too tons of bars && great restaurants ( try pinky's for breakfast, a few blocks down / great grilled sandwiches!) The beach was lovely, plenty of chairs and umbrellas avivable. No pool which I was disappointed with. There was 10$ deposit to get s towel daily, which you get back when returned. The outside bar is rundown & the drinks are weak. They do have happy hour all day 12-11 can't complain about that! Also try to bring cash, there is a 15% surcharge fir credit cards. Carlos the bartender took good care of us! It was a 15$ taxi from airport to hotel, beware, they charge extra for every bag, crazy ! There is major construction going on at the hotel, looks like they're trying to revamp a restaurant in there, as of now there is no food on location. So we were woken up by drilling & hammering at 8am everyday. The elevator was scary one of the oldest/ most rundown ones I've ever seen. Upon checkout we were informed we were going to be charged an additional 20$/ night for the \" extra person\" we were never told about this fee, even after checking in & having us all sign numerous papers and taking copies of all three of our ids. There were three people behind the desk arguing with us making a scene. One man told the other man \" just charge it! Just charge it!\" horrible customer service, leaving a bad taste in our mouths while leaving....", "Date": "March 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "CT", "Title": "“Excellent location, clean, comfortable.”", "Author": "mirmtab", "ReviewID": "UR125807264", "Content": "From reading the reviews I was expecting the worst, and instead was pleasantly surprised. Booking can only be done through their website. I personally like to speak to a person, but the online reservation was quick and easy. Check-in was easy enough. We were part of a large group and I could feel that they were a little overwhelmed. However, they were fast and efficient, and we were able to quickly access our room. The room was small, but it served our purposes. We weren't there to lounge in our room all day. We just needed a clean and comfortable place to sleep for the night as a stopover before our cruise, and this place was perfect for that. The room was clean and the bed comfortable. No complaints there! Be ready to leave at or before checkout time. They had a lot of people coming in, and were calling us to make sure we would be able to checkout on time. The people at the desk were helpful with any questions, and assisted us with getting taxi service the couple times we needed it. The lobby and bar were relaxing and comfortable. Sit with a cocktail and enjoy the beautiful view of paradise!", "Date": "March 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great location and Nice hotel, under construction :(”", "Author": "Cileyn H", "ReviewID": "UR125747901", "Content": "My boyfriend and I just returned from our PR vacation, 03/1/12- 03/05/12.. Great location in the middle of everything you need, hotel is very clean, no smoking allowed, but you can smoke in the hotel bar which is fab!!! The bar has happy hour from 11am-11pm, $3.00 beers and $3.50 mixed drinks you will never go wrong. The onlt con to the hotel is you can't sleep!!!! They are under construction which it really never bothered me, im a heavy sleeper, but the front desk kepted calling housekeeping every single second and the phone was ringing non-stop that woke me up!!! :(( They should have 2 way radios to commicate. Besides that the hotel staff especially the bar guys were friendly and nice.. Will consider staying there again..", "Date": "March 7, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Lacks customer service.”", "Author": "Pacotilla", "ReviewID": "UR125508964", "Content": "Location, location, location... Great. Here comes the bad part.We called to change reservation from 3 to 4 and they said everything would be fine but we get charge a little more per night. Ok great... No that's not what happened. We arrived and front desk said they do not have rooms for 4. We said we can sleep 2 in 1 bed. They charge us extra for the 4th, we walk into room and saw a twin and queen or king bed. How are 2 people going to sleep in a twin bed. I didn't get it. We surrender to it didn't fight the charge for extra person, rearrange the beds. By putting them side by side. We r trying to stay positive n make the best of it. We go out all day n arrive late. Expecting to sleep in.... No that's not going to happen with the drilling and hammering going on early in the morning. They were under construction. What??? Not relaxing at all. So we took ourselve onto the beach to gry to sleep there. I feel we were doing too much work just to try to relax and enjoy our vacation. The hotel kept on giving us obstecals to over come, instead of being accommodating. Marriott was only 2 block down with pool and better customer service.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“come for a drink, don't stay over.”", "Author": "TravellersToday", "ReviewID": "UR125473378", "Content": "Great location, terrible service and terrible tiny rooms. Paid for an \"Ocean Facing\" yet you don't face the ocean, the bed has it's back to the tiny windows. It is a pity, since this place has so much potential. Great lobby and beach bar area. This is a gay friendly hotel judging by the crowd. Nice music with a relaxed scene. Come here for a drink, DO NOT STAY. Extremely rude gentleman with a tiny mustache at the front desk. Asking for anything is pointless, as he is completely useless. Our room was very noisy and freezing from a permanent AC with no \"off\" button.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Akron, OH", "Title": "“Very Good Experience”", "Author": "JoeyCS", "ReviewID": "UR125023425", "Content": "My husband and I recently returned from a trip to San Juan and we stayed 5 nights at Atlantic Beach Hotel. The location is perfect - right on the beach and in the heart of Condado. Plenty of good restaurants, casinos and shops to choose from in the area, along with a bus stop right up the street (75 cents one way to Old San Juan on either the B21 or C23 buses - beats the price of a taxi). The room (double bed, non-ocean front) was very small, but we've stayed in Puerto Rico before and in older hotels this is just par for the course. The room was very clean, with fresh paint and bedding. Hotel bar overlooks the ocean and has great happy hour prices. During the weekend the bar was a more popular spot but during the week it was quiet and relaxing. The front desk set up a rainforest tour for us and it was affordable, professional and very enjoyable. All in all we had a great experience and would recommend the hotel to laid-back, open-minded people looking to have a good time in a perfect location.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "1.0", "Value": "4", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Major construction taking place- Be careful when they place you!”", "Author": "downtownsml", "ReviewID": "UR124719561", "Content": "I recently staying at the hotel- when I checked in I was given a room on the second floor. When I got to the room on Sunday afternoon it was a small but nicely renovated room with a ocean view. On Monday morning around 7:00am - the construction crew arrived. I had fallen asleep with my curtains open and when I heard noises I saw the work crew right outside my window. The noise was so loud and having these workman outside my window was very disturbing. I am shocked that the hotel did not mention this to us upon check in- it appears that the construction has been going on for sometime. When checking out I asked to speak with the Manager and was told he had left for the day. I have called him 4 times since arroving home and still he is not availabe and will not return my calll. I think this speaks to the quality of the hotel and the management. It is ashame that they chose to treat their customers this way as it is a well located and fairly priced hotel option in San Juan. Be careful.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brazil", "Title": "“ItÂ´s a good value for your money”", "Author": "Alohanuiloa", "ReviewID": "UR124128222", "Content": "I read many good reviews on Tripadvisor about this hotel so I knew what to expect. And I wasnÂ´t disappointed. The location is great: close (walking distance) to stores, restaurants, snack bars, casino, bus stop, a Walgreens (24/7), not to mention it is right on the beach (Condado beach) ! The room was nice and clean. Not too big but enough for a good night sleep. Bed is very comfortable. The people at the Front Desk were nice and helpful. The hotel has been undergoing a restauration but it didnÂ´t bother me at all as I was out most of the time. Should I go back to San Juan, I will stay there again.", "Date": "February 4, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "", "Title": "“This hotel is 0 stars”", "Author": "yaidy", "ReviewID": "UR123598626", "Content": "I stayed at the Atlantic Beach Hotel Iam from PR. Their lobby was newly renovated to compete against the modern beach bar/club that had opened next door. The hotel gave the illusion of being a clean place to stay; that was soon to be proven false! Let me start by saying I have never stayed in such a dirty hotel but for the sake of saving thirty bucks Â I went against my better judgment and decided to stay once I saw the incredibly tiny room. The images that are shown of the rooms are not what you actually get when you stay here. The halls had filth everywhere and a significant amount of mold was present around the bathroom! I was willing to overlook this and stay since I had paid in advance for the room on-line and believed it to be nonrefundable. The location is great, right on the beach, but so are a number of large very clean chain hotels for slightly more per night. Spend the extra few dollars and stay at one of those! Â The Atlantic Beach Hotel is doing construction on the roof and on another floor (it only has 4 stories of hotel rooms),.Â Â Never have I experienced such an unprofessional attitude, especially from a service oriented business. When I asked for the ownerâ€™s name (I pretended to not know who it was), I was told that a corporation owned the hotel, and the only number available was to the hotelâ€™s front desk. All lies, just like many of the locals nearby had come to tell me. Â just lies. Save yourselves the grief and stay anywhere else but this dive. This hotel is 0 stars", "Date": "January 25, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“RUDE SERVICE”", "Author": "boricua7919", "ReviewID": "UR122791261", "Content": "guy in the lobby is EXTREMELY rude. he seems mad and bitter all the time. bad bad service.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Kingwood, Texas, United States", "Title": "“horrible experience”", "Author": "Bella M", "ReviewID": "UR122771839", "Content": "I would never stayed here again,The plan was to celebrate my son birthday, my cust and friend wedding, and spent time with friends and family.we lasted 2 days worst Cust Serv. I have ever experience, place under construction they wake you up at 6am they dont even let you know. no security, no hair dryers, no restaurant, water leak never ending. and the CRAZY GUY at the desk, yelling at us like, we were criminals, and making us feel like we were robbing the place. asking for ID every time we came from outside. Too loud at night people slamming doors. you feel like they are inside your room. we end up going to el San Juan beach hotel 10 times better pleasant people, beautiful view and everything was at our disposes. and we made it to the Wedding on time. en La Concha.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Disgusting Hotel, Horrible Customer Service”", "Author": "Jennifer K", "ReviewID": "UR122473726", "Content": "I stayed at this hotel in the beginning of December. We had booked two nights however left after 1 and went down the street to La Concha (which is a beautiful resort). The rooms were tiny and disgusting in this hotel without a safe. The location is decent but nothing could make up for the horrendous customer service. I have never been treated so rudely during a stay (by the man at the front desk with a French Accent). Stay away from this hotel; go down the street & spend a couple extra bucks and enjoy being pampered at La Concha.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“We love Atlantic Beach Hotel Staff!”", "Author": "bwrigh10", "ReviewID": "UR122281390", "Content": "My Boyfriend and I just finished up a three week vacation in Puerto Rico and the Virgin Islands. Two weeks of which was spent staying at the Atlantic Beach Hotel. First and foremost, we must say that the staff is unbelievably friendly and accommodating. By the end of our trip we felt as if they were old friends that we had been visiting. Thank you for that! The hotel location is absolutely prime. It is on the beach, within walking distance to anything on the Condado and very close to Public Transportation to get you to Old San Juan. The newly renovated lobby looks absolutely beautiful and we cannot wait for the new bar to be finished. We will have to make a trip back to just to try it out! :-) As it is now, there is a large patio and a small bar that conducts happy hour from 12pm through 11pm. Very affordable! Construction being previously mentioned, it is necessary to point out that at this time there is a fair amount of loud construction noise. This noise lasts from very early in the morning and through out the day in to the evening. Furthermore, when the hotel is full the hallways are very loud. You can hear any conversation taking place as if it is in your own room. This was not good when we were calling it a night and our neighbors weren't coming in until 4 am. We were woken every time. Our first room was absolutely beautiful. Very Large room with an ocean view, very clean and updated. However, when we returned from our trip from the Virgin Islands the promotional rate was over, so we opted out of the ocean view. The room that we were put in was, again, very clean and updated, BUT it was no bigger than a medium sized walk-in closet. No Bueno! Overall, our trip and stay at Atlantic Beach was ideal. It was affordable, with a nice staff, and clean rooms. This was out second stay and I am positive we will continue to stay with them. The construction noise can be overlooked, because alas, it will soon be over. Thank you Atlantic Beach Hotel!", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Great location, friendly staff, clean room!”", "Author": "Noel K", "ReviewID": "UR122148480", "Content": "My husband and I just went on our honeymoon. We sailed on a cruise out of San Juan, Puerto Rico and had to stay one night in San Juan before we flew back home. I research many hotels before we left for our trip. We almost stayed somewhere else instead of the Atlantic Beach Hotel and I am so glad that we didn't. The Atlantic Beach hotel was walking distance to shopping and restaurants. It is located right on the beach. Has a great Happy Hour (but not over crowded). Newly renovated lobby and rooms. Everything was very clean. The elevator could us some work but overall friendly staff. They even gave us an early check-in since we were on our honeymoon and gave us a nice room on the top floor. I would recommend this hotel to anyone. The rooms are not terribly big but that didn't matter for us. Oh yeah...the rate was the best I found in all my research.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Boulder, Colorado", "Title": "“Great Value for a Great Location”", "Author": "Rikki A", "ReviewID": "UR122108972", "Content": "I stayed at this hotel for 4 nights during the on-season and I could not have been happier with my choice. The hotel is in an incredible location next to places to eat, casinos, public transit to Old San Juan, and its right on the beach. The staff was friendly to me each day as I left the hotel to explore the city and they were very helpful in answering questions and ordering cabs. While the hotel is under construction, the work they've done so far makes a bit of tapping that starts at 9:30am okay. Yes, the rooms are small, but if I wanted to sit in my room all day I would have booked at a nicer place down the road. If you're coming to San Juan with realistic expectations and you don't plan on sitting in the room all day, the this is the hotel for you. I only give it 4 stars because I would have loved to use the beach bar, but unfortunately it was under construction during my stay. For the location and the price, this place can't be beat!", "Date": "December 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "muskogee ok", "Title": "“Great Staff, Location and Price”", "Author": "roger b", "ReviewID": "UR122000927", "Content": "Just spent 3 weeks in San Juan. The hotel is changing with a new lobby, but keeping the best hotel staff in town. You will feel like you just came home. Best bar if you like the beach. Rooms are being remodeled. Walking distance to everything including public transit to old San Juan. Can't wait to return.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“This review (is in my personal opinion) could save your vacation!!!”", "Author": "FrqntTrvlr41", "ReviewID": "UR121824977", "Content": "I stayed at the Atlantic Beach Hotel for several nights during my very recent trip to Puerto Rico. Their lobby was newly renovated to compete against the modern beach bar/club that had opened next door. The hotel gave the illusion of being a clean place to stay; that was soon to be proven false! Let me start by saying I have never stayed in such a dirty hotel but for the sake of saving thirty bucks (compared to the big chain beach hotels next door), I went against my better judgment and decided to stay once I saw the incredibly tiny room. The images that are shown of the rooms are not what you actually get when you stay here. The halls had filth everywhere and a significant amount of mold was present around the bathroom! I was willing to overlook this and stay since I had paid in advance for the room on-line and believed it to be nonrefundable. The location is great, right on the beach, but so are a number of large very clean chain hotels for slightly more per night. Spend the extra few dollars and stay at one of those! I later changed to a room with a view that was big enough for two adults to move in and paid extra for it, but mold was still an big issue in the new room, again I tried to not let that bother me too much. The Atlantic Beach Hotel is doing construction on the roof and on another floor (it only has 4 stories of hotel rooms), and on the second night their workers started jackhammering at 7:15 AM! This happened on my third night as well, so I finally decided to politely say something to the only employee working there at that time. They looked surprised. Why? They could clearly hear the banging from the lobby for themselves. I was given a quick and insincere apology. The next morning the workers starting hammering an hour earlier, at 6:15 AM!!! I then complained to an employee who was there most of the time (who locals later told me was the owner) and they just stared at me blankly. I told them this was unacceptable and that guests should have been warned so they could negotiate a refund and make other arrangements, at least do not charge me for the useless upgrade. I was told I got a 50% off promotional rate (NOT TRUE); locals told me that what I was paying was NOT half off and that I was being lied to again. The entire staff became incredibly rude and aggressive towards me because I dared to stand my ground and complain. Never have I experienced such an unprofessional attitude, especially from a service oriented business. When I asked for the ownerâ€™s name (I pretended to not know who it was), I was told that a corporation owned the hotel, and the only number available was to the hotelâ€™s front desk. All lies, just like many of the locals nearby had come to tell me. I never even got an apology from the owner or the rude staffâ€¦. just lies. I have a dispute pending with my Credit card company against them. You will not get your money back nor will you get hospitality at this hotel! Save yourselves the grief and stay anywhere else but this dive.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Good value for budget travellers”", "Author": "tjohnson_11", "ReviewID": "UR121799107", "Content": "When I booked this hotel I was looking for a value priced hotel and I was working with a budget of about $100.00 per night. I had read the reviews and it was typical of the reviews that I read for budget properties. I have stayed in many budget properties and generally give little regard to comments pertaining to being treated rudely by staff, dirty rooms etc. Of all of the budget hotels I have stayed in only one of them has truly earned that reputation, and the Atlantic Beach hotel is not one of them. As long as the reviews don't mention bed bugs I will give the place a try, There was no mention of bed bugs, so I went ahead and booked this reservation. I paid $79.00 for an ocean view room located directly on the beach in a hotel/tourist area of San Juan (The Condado area). One thing that should be mentioned is that this hotel is gay friendly. From my observation, the hotel does have a large gay clientele. If this is a problem and you are not going to be comfortable in this environment then don't book here. We were a group of 2 straight couples and my thoughts were that if the place is safe for gays it will be safe for straights. My first impression of the hotel upon entering was that it reminded me of many of the Miami South Beach boutique hotels. It was light and airy with the back entrance completely open and leading into the patio bar area overlooking the beach. Contemporary couches and coffee tables furnish the lobby. The check in was as per the reservation and I found the staff who checked me in to be friendly and helpful. I was given an oceanview room with one queen bed. The only thing that I would agree with regarding some of the reviews I read is that the elevator is absolutely ancient and there is a scare factor involved in using it. We were on the 4th floor so I would take it up, but took the stairs for the trips down. It also had a strong musty odor that necessitated breathing through the mouth for the trips that I did use for when going up. The room itself was fine. The queen bed was very comfortable and the bedding was white duvet. Loved it. The windows opened letting the ocean breeze into ,the room. There is a flat screen plasma tv that is wall mounted and the rest of the room furnishings were sparse. There was a desk and 2 chairs and a side table. The art and lamps were fairly new and the smoke detector did appear to be in working order. The bathroom for sure is small, but the shower is big enough for 2. I was relieved to find a good blow dryer in the bathroom as well. The room that we occupied was noisy in that it was located next to the air conditioning unit. Rule of thumb when travelling. Bring earplugs. The noise from the a/c did not bother me but my husband was aware of it.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "4", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Great Location, Not That Great a Hotel”", "Author": "Love_2_Travel_djkljd", "ReviewID": "UR121784713", "Content": "As the title says the hotel is in a great location, right on the beach, but it has many problems. Construction has been going on for years, you couldn't even get in the main entrance when I was there (see attached picture). You had to squeeze between parked cars with your big luggage, walk sideways in the gutter, and enter thru the back beach entrance where the bar is. I checked in and headed towards the infamous elevator. It is indeed quite scary. Tiny, dark, rickety, and the door had problems. The door doesn't even open all the way. It opened about 16 inches. My suitcase was wider than the elevator door opening. I had to turn it sideways to get it thru the elevator door. I got to my room, which was a remodeled ocean view room. The temp and lighting was OK in there, but there was one small problem - ANTS!!!! A whole conga line of ants was running along the window sill non-stop. Right above the bed. I didn't want to wake up covered in ants, so I went downstairs to complain. The guy said \"Someone must have been eating in there\". Eating on the 4 inch window sill? Needless to say I switched rooms. My new room was also an ocean view room. It had no ants but it was also darker and hotter. It was missing a light the other room had. Also there is no way to control the temperature in your room. You are at the mercy of whatever the hotel thinks the hotel temp should be. The manager told me to check the vents and see if someone closed them. How do I check them? They are 10 feet up. I stood on a chair. There is no way to adjust the vents. I had to get some long tweezers and stick them in there hoping I wouldn't drop them into the abyss. I was able to adjust them some but it still stayed too hot in there. I had trouble getting to sleep from the loud music being played in the hotel next door (which looked nicer than this one). No room in the bathroom for your stuff. I had to set some on top the toilet. Overall I would not stay here again and can't recommend it. It's cheap, but you get what you pay for. Spend a little extra and stay somewhere nicer.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sargans, Switzerland", "Title": "“New look-Refurbished”", "Author": "JG1203", "ReviewID": "UR121654629", "Content": "I just arrived and despite the pictures and some comments i am very surprised: The hotel has been refurbished: A new and sylish bright lounge look. Congratulations. (work 95% finished - [11th Dec.2011] some minor painting still going on. just ready for peak season). Comparing with the old pictures - also the bathrooms of the guest rooms have been rebuilt. The stuff is friendly and supportive, and they arranged me a room eventhough i meesed up the online reservation - there is WiFi in the lobby (- the sigal on the room is too waek). However: The rooms have not become bigger and are still kind of minimalistic. I got a room to the side street. There is no good view - and it was not noisy at all. And in San Juan.... you don't need to spend your day in a hotel room. All in all: the face lift was worth it. The Lobby and the terrace is beautifull. You have really good deal: fair price for a small room.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Daytona Beach", "Title": "“Needs to complete construction”", "Author": "jacrolls", "ReviewID": "UR121337796", "Content": "I have stayed here many times in the past 25 years, it has changed alot. In the old days it was great, with Stars Disco on the roof and a great Bar and restaurant for breakfast and lunch .After the disco closed and they made it into a penthouse apartment I stayed there, but it is now under construction as are alot of the rooms and bar/restaurant. The price was very reasonable and the new room was nice, but needs a shelf in the bathroom. The staff seem to be helpful, but the hotel had no information on what to see and do in the area. Also did not like the policy that you could not invite guest to your room. There were very few people around the hotel or on the beach, which use to be very busy.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Clean small rooms noisy place with unfriendly stuff”", "Author": "tatyana0203", "ReviewID": "UR120842970", "Content": "I stayed at this hotel two days after my cruise jus to explore old San Juan. I wish I've read reviews. The room was so tiny that we couldn't move around the room. We stayed prior our cruise at San Juan Beach Hotel at the same Condado location and the room was really spacious with table chairs and huge two beds Here at Atlantic just tiny twin beds and TV stand and tiny bathroom. The major complain was the noise from construction. They started drilling hotel walls at 7 am what was horrible when you are on vacation and and you cannot sleep in the morning. When I complained about it to the owner he ignored me completely and walked away. The lobby was a construction mess and elevator was super ancient. The stuff was so unfriendly that we had to ask construction people to help us with our lugage and elevator. My advise - stay away from this place unless you are a gay that's maybe the only reason to stay there. Stay at San Juan Beach- you'll get better deal for lesser money", "Date": "November 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Belleville, New Jersey, United States", "Title": "“If only I read the reviews....”", "Author": "Ross R", "ReviewID": "UR120112628", "Content": "DON'T CHECK-IN TO THIS HOTEL..I should have read the reviews before I booked,we're couple from NY w/ friends from Chicago and SF visiting PR after a week cruise,we arrived in the counter with a very stern unfriendly 1 staffed hotel priced equivalent to neighboring hotels along the shoreline,the place has no parking space and the staff were rude(we rented a car)my friends were checked in at double tree(i should have stayed there-nice) and they were asked rudely if they are sleeping overnight instead of ushering us in and welcoming us,they gave us this 2 rooms and my room I reserve is beachfront but it's weekend they gave me a room with a laundryview at the back and will not compromise,the construction is going on until midnight and starts early am at 6am waking us up,the towels are worn out and the elevator is old and we're stuck on the middle of the floor with our luggage and we have to jump/climb up to the floor not mentioning it's squeaky scary riding in a lift that's noisy and shaky,we rested on the beach using their folding bench and were told we can't use them because they have to keep it at 5pm though they gave us until 5:30 pm.room is small and dusty from the construction going on,some areas are blocked going to the bar and we have to get out to enter the lounge/bar area.staff are so unwelcoming.2 of our friends visited us and were not allowed to enter our room and accused them of being prostitutes.has bucket of ice in our room but no ice to get it from,no water,,,has shampoo and conditioner dispenser but empty and we're given soap bar instead.seems like nobody understands English,we asked for a towel but were given face cloth.the place is so noisy at night,no food available,we can't go out because of the heavy rains.we wanted to check out early but won't refund our money.I regret going to this hotel after a 6 day perfect caribbean cruise,our vacation culminated in a very unpleasant stay in this hotel,,this Hotel SUCKS,,don't patronize ATlantic Beach Hotel in Condado,San Juan,PR,never,never,never", "Date": "November 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“great place to visit or stay”", "Author": "caribbeanlifestx", "ReviewID": "UR119692601", "Content": "after reading negitive reviews i decided not to stay at atlantic beach hotel... after visiting the bar there and the great beach that it is located on i really wished i would have stayed there instead of a nearby hotel a few blocks away that was more expensive since i spent most my time at A B hotel there is some construction still going on during the day but everything that has been done looks great and when finished will be a \"hot spot\" in condado for sure i would go there in the afternoon and the noise was not so bad i started my night there and then would go \"out and about\" then would finish my night there the views looking over the beach is great, so many hot bodies on sat and sunday afternoons on the gay beach, just unreal, there is a upscale club next door called oceano that was a bit to snooty for my tastes and 2 blocks over another gay club \"cant remember the name\" that is pretty cool every day i went to A B Hotel and the staff... from the owner, managers, bartenders were welcoming and friendly even tho i was not a hotel guest when you go there you MUST make friends with the 2 main bartenders... carlos \"the very very sexy hard working thin one\" and ivan \"the butch one that will give you a great haircut if you need one\" and take you to late night clubs he promotes both those guys are the absolute best and will give you all the local info you need tell carlos you want to see pics of his huge dog... its bigger than he is next time i visit san juan i will be staying there without a doubt", "Date": "October 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Fullerton, California", "Title": "“disgusting!!!!!!”", "Author": "Chris C", "ReviewID": "UR119276770", "Content": "I have stayed at this property before and had good experiences. However this last time i stayed there was absolutely horrible! Having flown in from Los Angeles we reserved a ocean view room. The room we were given was a partial ocean view, and a view of a disgusting torn down abandoned building next door. Our room was filled with mold which the front desk said was normal this time of year. The staff was extremely rude when i asked to change rooms. (they did not change rooms for us). when i disputed the claim with my credit card company, they lied in writing saying they escorted us to the rm before checking in to make sure it was satisfactory. That was a LIE!!! we also had a late checkout and having told the front desk upon checking in, was assured that someone is there 24hrs a day to check us out. You deposit $10 per towel when you arrive and upon returning of the towels you get your cash deposit back. when we checked out (late) they said they have no access to money that late and could not refund my deposit. They also LIED! once again to my credit card company saying i recieved my deposit back! This place is disgusting and should not be santiary enough to be operating!", "Date": "October 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“DO NOT STAY HERE EVER!!!!!!!!”", "Author": "loliz1", "ReviewID": "UR118456422", "Content": "I'll start by saying the hotel has no parking and the street is very narrow and crowded by other cars, we were rudely told by a hotel employee to drive around until a parking space appeared! The front desk employee was really rude, no customer service etiquette what so ever, the place is not what is seems in the hotel website pics, the rooms are horrible and the lobby is a nightmare, it's a total scam! We didn't even last 30mins after our check in once we saw the room and asked for an upgrade or our money back the front desk employee literally insulted us, told us if we didn't like it there was the door, refused to give us his name (who by the way had no uniform or name tag) and refused to get a manager, we were told he was the manager! The next day i called to talk to hotel management and they were even ruder, didn't seem to care about my complaint almost seemed as I were talking to same hotel employee!! Its a shame such a horrible place exists in such a beautiful island and a great area (Condado PR) I ADVISE ALL THESE UNSATISFIED CUSTOMERS TO DO A REPORT ABOUT THIS HOTEL WITH WHO EVER IS PROMOTING THEM (ONLINE, WEBSITE, TRAVEL AGENCY, ETC...) I ALREADY DID MYSELF WITH EXPEDIA, ORBITZ, THE DEPARTMENT OF TURISM AND DACO THEY CANNOT KEEP GETTING AWAY WITH THIS!!!!", "Date": "September 22, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Awful”", "Author": "Claramartinez", "ReviewID": "UR118367542", "Content": "The worst hotel I ever stayed. Customer service was awful. The manager in charge was disrespectful.", "Date": "September 20, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Isabela, Puerto Rico", "Title": "“This place is trash. I was completely outraged!”", "Author": "izzy1696", "ReviewID": "UR118345949", "Content": "First off, the hotel looks NOTHING like what their site depicts. I'm originally from PR, and being gay, and on vacation, I thought I'd be nice to stay at this hotel during my visit to San Juan. Well, I checked out 20 minutes after I got there (I would have left immediately if the supervisor had been more cooperative). As I walked in and saw the catastrophe of a lobby, I immediately asked the â€œhousekeeping supervisorâ€� for a refund. The housekeeping supervisor was the only person working at this hotel and was completely and utterly unprofessional. He advised me that since I had already booked the room online I could not get my money back. I am currently filing a complaint with my credit card company in order to get my money back. But either way, I would have never stayed at such a dirty place. The lobby looks like a war zone. The supervisor looks like he had just crawled off a dumpster. The room was small, dirty, outdated, with dirt and blood on the sheets, and no amenities whatsoever. The room was not even air conditioned. The condition of the room and this hotel was completely unacceptable; I would not even imagine a motel being this dirty and unkempt. I would not advise anyone to stay here. As I said, I am still currently trying to get my money back and the only person to contact is the dirty supervisor working the nasty front desk; completely unbelievable. I ended up staying at La Concha, which was beautiful and I would highly recommend staying there. However, do not make the mistake of booking the â€œAtlantic Beach Hotelâ€� onlineâ€”it is not as depicted on their photos. If I had the time and energy, I would sue this place. They are building a place next door which looks more promising called â€œOceanaâ€� and is set to open sometime Sept 2011. The location of this place is great ... You just need to blow it up to pieces and start over with a new owner.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "4", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "orlando", "Title": "“Friendly staff but facilities belong in the \"hotel junkyard\"”", "Author": "fitzlpatrick", "ReviewID": "UR118160252", "Content": "As many reviews have previously stated, renovations are currently being undertaken and according to the hotel manager, are slated to be completed in December, 2011. I was in a non-ocean front room which appeared to have not yet been renovated, though the furniture and fixtures appeared to be new. Bed was extremely comfortable and flat screen TV was nice. Pros: location friendliness and helpfulness of staff beachfront bar proximity to shopping and other areas hotel has its own generator so power is uninterrupted in the event of power outages due to storms, etc. Cons: 1) bathroom was moldy and had a window which would not fully close - as a result, I had to keep the bathroom door shut all the time so that the air conditioning in the room did not leak out through the open window 2) no restaurant or way to get coffee at the hotel - luckily, a starbucks is 2 blocks away 3) construction on renovations started every morning at 7 a.m. ---- extremely noisy 4) room itself was very small 5) elevator was ancient and a little scary to ride - i took the stairs most of the time", "Date": "September 15, 2011"}, {"Ratings": {"Location": "3", "Overall": "3.0", "Value": "2", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Garden Grove, California", "Title": "“U pay for what you get!”", "Author": "Liz C", "ReviewID": "UR118096152", "Content": "The hotel was undergoing construction when I went in June 2011! The hotel price was cheap and its in front of the beach! It's an old hotel and some items don't work like the elevator, door knob. The staff were helpful, but parking was horrible!!!!! Also this hotel is known in Puerto Rico as the gay hotel. I wanted to pay cheap and I had a decent stay! This hotel is safe and near a few restaurants in walking distance.", "Date": "September 14, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Miami, Florida", "Title": "“Pros and cons”", "Author": "AbigRod", "ReviewID": "UR117959566", "Content": "I stayed at this hotel from 9/3 to 9/4. The hotel is still undergoing renovations so the lobby is an eyesore. The elevator and stairs is also in bad shape so it gives the place a 1 star feeling. The staff also speaks little English so communication can involve some guess work. On the plus side the rooms were basic but clean and you really can't beat the location for the price. The hotel is really right on the beach. There are plenty of restaurants and shops within walking distance. There is also a Wendys, Walgreens and Dunkin Donuts within a 10 minute walk from the hotel. There are plenty of cops around so you do feel safe. Nightlife was ok in this area but if you really want to get more options you should go to Old San Juan which is about a 10 minute ride from the hotel. If u take a taxi make sure you ask for the fare before getting in. I had an experience where the hotel staff told me the fare would be around $12. Â I asked the taxi driver how much and he said $20. I told him I heard it was 12 and he quickly said yes 12 :) they are known to overcharge naive tourists.Â", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“Lies, Violence, and Threats”", "Author": "AtLeastBeDecent", "ReviewID": "UR117914320", "Content": "Atlantic Beach Hotel PO Box 16876 San Juan PR 00908-6876 Complaint Description: I checked into the Atlantic Beach on Friday the 2nd and checked out Saturday the 3rd. I have a $187 authorization on my CC, $86 of which is for the room and the other $100 was a hold which I was told twice would be removed within 48 hours guaranteed. I made sure to ask because I am flying in three days and need the money to pay for my luggage. My CC company told Atlantic Beach to simply send a fax to the CC company saying they authorized the release of the $100. When I went to check on the situation and give the employee the information to send to the CC company he refused, then refused to give me the manager's name or his name! THEN, when I (5'9\" 150 skinny guy) told him that the hotel was holding my money hostage he came from behind the counter with a big stick and threatened to hit me with it. I don't know if there are cameras there or not but I swear to God this man (I was able to find out he is a Cuban man named Eric or something similar) came at me with a stick (which is prbably still behind the counter) and when my CC company called him after he continually hung up on my calls he refused to fax the info for the release of the hold. The threat of physical violence against me and the refusal to return my $100 hold after a week when I was told it would be back in the acccount within 48 hours when I left the room squeaky clean is unacceptable, especially since I stay in hotels in San Juan all the time and many don't even use the CC hold. The hotel is refusing to help in any way and I am without the money I need, and the threat of beating me with a stick is incredibke. I was going to call the police but he told my friend who was with me at the hotel that he was calling a group of his friends to come so we left.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Manhattan, NYC", "Title": "“DO NOT TAKE YOUR FAMILY HERE! IT'S OLD, RUN DOWN, RENOVATIONS SUCK!”", "Author": "Kim S", "ReviewID": "UR117138204", "Content": "We stayed as a family at the Atlantic Beach Hotel for three nights. The hotel is still going through renovations, particularly in the lobby area; however, this does not get in the way of hotel guests. We were on the 4th floor and had an ocean view. We were actually in the double room as there was a front door for rooms 410 and 411. Each room was on opposite sides of each other and had itâ€™s own door with a bathroom in the middle. The bathroom did not have a real door just a thin, flimsy sliding door, so it's not that useful if you are traveling with friends or other family members and would want real privacy as you shower or use the bathroom. Plus, you needed the key for the front door to enter the room 410/411 area and also for each individual room. If you mistakenly closed your room door while going to the bathroom, you would lock yourself out of your room if you did not bring the key to the bathroom with you. Itâ€™s a strange set up. I was charged higher than what is listed on the web site since I had one of the largest rooms. Our view was of the ocean and since we were on the 4th floor, we were not bothered by the very loud music being played nightly at the bar. However, be prepared for the music to last past midnight and be sure to request an upper floor if at all possible. Nor, could we hear the construction during the morning hours. Based on the reviews I read before traveling to this hotel, I knew to ask for the \"upgraded\" room. While our room was upgraded, it was also built as the handicap room; however, it was fully functional for us. The room was very clean and seemed newly renovated. The floors were beautifully tiled, as was the entire bathroom and shower. The walls were freshly painted and very clean, pure white. However, since this is a boutique hotel, they did take some shortcuts. There was no flat screen tv, only an older tube box. Also, besides the new headboard and sideboard for the bed, the dresser and night stand looked to be from before they renovated the hotel. Both were very old and dated looking. The room was very plain. One small dresser, one very small closet and two night stands with two very well used, not so clean lamps on them. Now, here are my real complaints. Because this is a small, boutique style hotel, I believe they are taking way too many shortcuts for the price one pays. They need to tweak a few details, for example: -Our room had two large towels and only one face towel in the closet, not bathroom. They were stingy to give more towels and would only provide one additional face towel since some towels were already in the room. -We did not have even one bar of soap in our room when we arrived, which is just ridiculous. Every room should be prepared in the same way. -One lamp was so old that it would not turn off unless you unplugged it. -In the bathroom, there was no holder for the toilet tissue. The roles were stacked on the toilet's tank lid. That is just vulgar. -You are subject to the air conditioning they decide to blast or turn off for the entire building, so it goes from freezing to humid and hot, back to freezing throughout the day and night. -There are no phones in the room, only a stupid hall phone...that's just stupid. Make sure you take your cell phone or else forget about it. -There is no personal shampoo, conditioner or lotion for guests. There are two dispensers that were filled who the heck knows how long ago with shampoo and conditioner to use, but thatâ€™s disgusting too. Yuck. So, really the only comfortable thing about the hotel was that the room and bathroom were both clean. The convenience to the beach is nice; however, it's a filthy beach. Everyone seems to be littering regrettably. The extra time is not taken by the hotel's staff to make sure each room is prepared for guests prior to their arrival. Toilet tissue should have a proper holder and not be stacked on top of the tank like some disgusting public bathroom. That's lazy, inconvenient and very vulgar. Guests should have adequate amounts of soap and towels already in the room, and be provided what they require throughout their stay regardless of how many towels were already in the room. I never asked for housekeeping services to clean my room while there because I did not want to be possibly charged a fee for whatever. After requesting soap and only allowed one more face towel, I saw how unprepared, cheap and stingy they were, I did not want to possibly in anyway acquire any service fees to be charged to my room. The Vendig Street this hotel is located on is not a place necessarily for families. It is filthy as is the beach this hotel is located directly next to. Itâ€™s very urban, which means it's dirty and not a place you would want to walk after sunset with your family. There was a huge pile of smelly trash that stayed on the sidewalk even after the trash collectors came. No one ever picked it up and I'm sure if you go there today, you'll see a pile of trash to the left of the hotel that will still be there. If you are not willing to pay a little higher for a view of the ocean, with the hotel being as small as it is with only 5 floors, your view will be horrible. There will not be a beautiful city view at all. The street is very narrow, so if you do not have to drive there, I'd recommend that you do not bring a car. The area is very urban and very, very gay friendly. I had read that before I came, but was really surprised how gay friendly it is. This is their beach, so just be prepared if you are bringing family members who find that lifestyle unacceptable. When I say it is their beach, I seriously mean it. If you do not respect that lifestyle or live it, this will be quite a surprise. Everyone is super friendly, but you do have to prepare yourself if you are not used to seeing the gay lifestyle outwardly in public. Condado is the gay South Beach, gay Greenwich Village of Puerto Rico. I adore Puerto Rico and hope to return. However, this hotel is not worth the $89 to $118 ocean view price...not at all. The renovations truly suck because they are not renovating the entire building, hallways, rooms, etc. Go to a major chain, find a deal on hotwire or wherever and do not stay here. They have put no work into the old elevator, which we did not take. They have put minimal work into the hall ways. They need to do a ton more. San Juan is full of boutique hotels that are super fabulous and this one has potential, but I think they are cutting too many corners and will never be able to compete with the other nicer boutique hotels in the area until they take the extra effort in making sure every room is prepared properly and that down to the even the smallest details of each room, things donâ€™t go ignored. No one wants to see no holder for toilet tissue in their bathroom and no soapâ€¦thatâ€™s simply disgusting and very lazy on their part. If they are not checking the quality of each room after the room has been cleaned, there are no checks and balances, and that shows. It also makes you wonder, how â€œcleanâ€� was the room really? It appeared clean, but as I said if the manager or a housekeeping supervisor is not checking the quality of each room after cleaned, especially in such a small hotel, then this is questionable. Iâ€™ve seen that done in other hotels in Puerto Rico where we had to wait for the supervisor to approve the cleanliness and the overall preparation of our room before we could even enter. Again, they are cutting too many corners and whoever the owner is, he or she is not taking the extra time to really make this hotel one of a kind, nor making sure it is comparable to other boutique hotels that make you say, WOW! Thanks for reading. Good luck.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Service": "3"}, "AuthorLocation": "Yucaipa, California", "Title": "“Not what you think..”", "Author": "trish p", "ReviewID": "UR116904793", "Content": "based off the pictures, I thought I had a steal for the price I was paying. Hotel lights didn't work, didn't get ocean view like I paid for and couldn't get a refund. People were however, the supervisor was conveniently gone when I asked for him. He was in the back relaying information to the person I was speaking with at the front desk. Poof hes gone when I ask for him. The pictures glorify this place. The rooms are tiny which is fine and I'm not at all a high maintenance person so fancy wasn't something I was looking for. I spent 1000.00 that day and went somewhere else.", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Orlando", "Title": "“Well, there's a bit of history to explain the issues!”", "Author": "Gringo-in-Paradise", "ReviewID": "UR116875503", "Content": "Yes, I realize the staff seems rude and the owners seem a bit conflicted. You have to realize this hotel has been a gay icon for decades and the beach in front is still the big gay beach of the Caribbean. The owners tried to de-gay the place over the past couple of years but now they seem to be embracing their history and as a result the service and facilities are improving to match the new gay resort next door. Give them a chance. Our group of straight but gay-friendly folks just stayed and I can assure you it's well worth the price, the staff is trying, and the bartenders are the very best in the Condado area! Also, drinks are price appropriately...not outlandish like other bars on the beach. So, it's not perfect but definitely worth a visit. I plan to return in the next couple of months.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "MN", "Title": "“Under construction, but did the job”", "Author": "gol19", "ReviewID": "UR116828993", "Content": "The pool and patio areas were under construction so we did not get to enjoy those. The facade and hallways looked run down, but the inside of the room was nice. The bathroom was clean and looked newly remodeled. It was small, but we only stayed one night. The location is great. You're right on the beach. There are bars and a dunkin' donuts nearby (very important for coffee addicts like me). For a short stay on a budget, it was great.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "New York City, New York", "Title": "“A good deal for staying in the Condado District”", "Author": "William M", "ReviewID": "UR116662460", "Content": "Most certainly a real \"diamond in the rough\"! Just because the hotel is going through major renovations does not mean it is poor quality or a run down hotel. This place was worth staying in and it was a bargain compared to other places in the Condado District. I wanted a beach front hotel at an affordable rate, and I got that plus more than what I expected! I recommend this place to people that have an eye for style and are free-minded thinkers who enjoy staying at original and authentic places from the area that is being visited. The room I was placed in looked exactly like the picture! The hotel is situated right in front of the beach and you have 24hr access to it. There is a small bar in the patio open for guests to enjoy a drink while listening to the waves. The check in area, patio and pool area are under renovations. If you observe carefully what work that has already been done, you can immediately see that this place will look amazing later!", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "muskogee ok", "Title": "“Loved it, plan to relocate there.”", "Author": "roger b", "ReviewID": "UR116660953", "Content": "Hotel was being remodeled, but that didn't cause any problems. Rooms were clean and quiet. TV had a good selection. Close to all transportation, including public for only 75 cents. Staff was GREAT. Very heplful, I felt like I was a regulat guest. Staff that included everyone from the owner to the housekeeper. Very safe. Great burger shop near hotel, Punk Burger Bistrol. Great, freindly staff there and great food at a good price. Reserve a lot of time for old San Juan, eat at Sr Frog, good food a lot of fun. The best thing about the PR is the people. I have traveled a lot, these folks make you feel like they want you there and it's your home. Do try out the hotel, it's no a 5 star, but it's clean, great staff(the best) the price is right and a great location. Tell them Roger referred you, they will make you feel at home.", "Date": "August 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Peefect to stay the night before your cruise.”", "Author": "Ykgood", "ReviewID": "UR116649023", "Content": "Not luxurious at all, Lobby is currently being renovated so first impression was \"O, sheet rock walls\" Concierge was nice and helpful. Room didn't have a main light just a lamp. The bathroom light however lit up the whole room. Checked for bedbugs, there were none. Sheets were nice and clean, bed was very comfy. Again nice under $100 for one night stays, perfect for those going on a cruise the next day.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "2.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Colorado Springs, Colorado", "Title": "“Hotel staff rude!!! Would not stay here again”", "Author": "leelouzon", "ReviewID": "UR115870810", "Content": "We originally booked this hotel 2 months in advance via telephone. Upon arriving they did not have our reservation and told us they only take reservations online. A little nervous about the hotel because it was under remodeling/construction but it was late so we stayed anyway. The room was lovely and clean - a little scary getting there because the elevator is ancient. Beach fantastic.But the bar was not very good at all. Decided to stay another day (had an infant with us and didn't want to move to another hotel) and the rate we were told by the manager suddenly had gone up plus they tried to get me to sign a blank credit card charge slip. Upon check-out they billed me double for parking. Got in an altercation with the manager regarding additional charges but they could have cared less. Did notice that everyone checking in had some kind of problem with the manager. If you do stay there be very careful of what you are being charged for. Also, construction did not start until late morning, but have a feeling it is a very slow and ongoing process.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Troy, New York", "Title": "“Bang for your buck”", "Author": "creeplvr", "ReviewID": "UR115585634", "Content": "First I will say we were a little sceptical reading previous reviews but said what the heck, let's go for it anyways because we felt the value (a beachfront hotel in the Condado area) was good...We stayed from the 2nd -6th and we honestly have NO complaints! our room looked like the room in the pics, we stayed in room 204 (looks like the ones psted here for April 2011) The room was clean and cool. Bed was comfy and sheets were clean. The bathroom was nice, small but nice. The water pressure was delightlful! never had an issue with no water or anything like that. Cable on a small flat screen mounted to the wall. It rained a little but it didn't stop our flow. Right on the beach which was a plus. Area was safe for walking around. Room service was on point. Beach lounges and umbrellas were set up with no problem. The staff was very helpful, not rude at all, well at least not to us. They gave us recommmendations, directions, called cabs with no problem at all. The bar was closed for the most part but it gave us a chance to go drink with the locals! We went to the one across from La Concha Resort and got wasted (shots were $2) then went across to La Concha and partied (their drinks started at $9) there is also a Walgreens, Haagen Daz, Subways, Dunkin Doughnuts for those that want a lil taste of home all within 2 blocks of the hotel. The cons: you have to pay a $100 deposit, which we were never informed about prior to, but we paid cash so were refunded when we checked out (which was such a fast easy process) and if you want a beach towel that is also a deposit. Also it seems to be a known gay beach, but it didn't bother us at all. Slushy island drinks were served to us on the beach for only $3 (liquor)and while we went to many referred restaurants the one we found to be the best was at a mom& pop spot called \"Stop& Go\" across the lil park from La Concha Resort (which is right next door & has a banging bar and casino) which we found strolling around, for a whole meal (rice, beans, meat, salad and drink) was $8! Orozco's was also a good on Ashford ave. Must go to Old San Juan for a taste of history, it won't dissapoint. We took a bus there for .75...All in all, you get what you pay for so if you don't set your expectations of a beachfront hotel room for under $100 too high then you won't be dissapointed! Yes they were remodeling the lobby and yes it wasn't dazzling but really, come on! this isn't a 5 star resort! We went with an open mind and because there were so many negative reviews we were prepared for the worst but definetely felt like we got the BEST! We plan on staying here again, but only as long as we can get the same room ;) Enjoy!!!! =)", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Apache Junction, Arizona", "Title": "“A Diamond in the Rough!”", "Author": "LoneWolff", "ReviewID": "UR115436869", "Content": "Just returned from San Juan and loved it. Stayed all 6 nights at the Atlantic Beach Hotel on Vendig St. From the moment of check in to our final adios, we were treated with kindness and smiles. The entire staff was great. This hotel is under construction so some noise is to be expected. It wasnt outragous. They are building a pool on site and renovating the lobby. Parking is $10 per day and SO VERY WORTH IT. Your rental will be locked up in a gate. Anytime you need to retrieve your car a staff member will unlock the gate. Parking on the street and the lot across the hotel would be risky and costly. I recommend this hotel as it is STEPS AWAY FROM THE BEACH. The rooms are VERY SMALL but nice. Recommend for adults and not good for families. (Rooms too small) When I return to San Juan, I would definately stay here again. It was perfect.", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0"}, "AuthorLocation": "Charleston, South Carolina", "Title": "“WORST HOTEL STAY EVER #1”", "Author": "MisterJP", "ReviewID": "UR115158867", "Content": "(June 29 2011- July 6th 2011). DO not be confused by the pictures on the HOTEL'S website. My room looked nothing like that. Infact I looked in 3 different rooms and they looked nothing like that. That bar and deck area looked NOTHING like that, it wasnt even open when we arrived. When it finally opened it still looked nothing like the photo you see on the website. I added some pictures. Water shut off with NO NOTICE for hours. They only have 3-4 parking spots. The bathroom is tiny and the shower is a about 6 square feet. The pictures I posted was of our room #309 which was was the better of the 2 rooms in our crew. The bed was comfortable and hotel was kept cool. however the construction crew was not curtious to the guests. They started their work around 8am.", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Fort Worth, Texas", "Title": "“The saying is true... You get what you pay for!!!”", "Author": "mixedftw", "ReviewID": "UR114934251", "Content": "I was reading a couple of reviews online before purchasing this trip. And most of them say it was good and bad... Now the hotel was under construstion LAST YEAR... So why did i show up to found. NOTHING had been done to my knowledge. It was like they barely begun. Put it this way you could walk in the hotel from the beach cause there was no door!! The rooms were ok... they were clean.. Our sink was stopped up for most of the stay 4 nights and leaky shower head. Room looked nothing like the pictures on the sites ( priceline... orbitz...etc) the room was still out dated with a big tube tv. Our friends room was the \"UP TO DATE\" room but it was 10x small and the view from the room was a shed with the construction tools were being held. Not a bad location everything from shopping to eating are located down & up the street. so thats not a bad thing. If you arent going to be in the room the whole trip and dont care about lil things ... then this is the hotel for you. but be aware its not what you think it is. and ur not a 1* hilton!!", "Date": "July 1, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“!!!DO NOT STAY HERE!!!”", "Author": "satchit", "ReviewID": "UR112432612", "Content": "Ok i basically dont write stuffs but now i have to. All these people who said its awesome and helpful staff, these all people are liers. May be they got paid or tjey are the hotel family who wrote these. Because the hotel is terrible and the customer service is worst i ve ever seen in my life. I nearly called police. I cheked in and then checked out the same day. Not for me, but for yourself stay AWAY from this dump.", "Date": "June 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Condado Beachfront at a reasonable price”", "Author": "CXJJ", "ReviewID": "UR111469963", "Content": "We picked out the Atlantic Beach Hotel because it was right on the beach and very reasonably priced. The place is undergoing some construction that made the lobby look a little rough, but the small rooms are really nicely tiled and tastefully decorated. The real gem here is that staff are so helpful. From giving directions and advice to making sure that your beach lounge was ready for you on the beach, the staff were exceptional. If you have a rental car, I recommend that you use the $10 a night parking provided at the hotel -- you might want to reserve this.", "Date": "June 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Basic but Clean !”", "Author": "axel16", "ReviewID": "UR111140874", "Content": "This hotel is a very basic place right on the beach. Not large at all which is why I liked it. Room is very basic but everything was clean and this is what matters. Was fine for 3 nights and the price was cheap. So I enjoyed myself there. However I would upgrade to a fancier hotel if I was going to spend 5 nights in San Juan next time.", "Date": "June 2, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“This place us a DUMP - dirty, horrible customer service and RUDE STAFF !”", "Author": "Dakinnyc", "ReviewID": "UR110407703", "Content": "In town for memorial day weekend. This place is a DUMP with no form of basic service from it's staff. The desk agent overcharge me and actually lied to me saying there were additionally service charges. As I asked more questions it turns out he was just trying to cover himself for his inital lie. Just because in from out of town doesn't mean you can scam me. When finally confronted in the lie he walk away and said you can find the manager. RUDE!!!! Aditionally, the bathroom in the lounge was so filthy I could even walk in there with my shoes on. DO YOURSELF A FAVOR AND STAY AWAY. WE DERSERVE BETTER TREATMENT.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Mississauga, Ontario", "Title": "“Very Pleasantly Surprised”", "Author": "JC27", "ReviewID": "UR108531647", "Content": "We were looking for an inexpensive oceanfront place to stay before a cruise. Atlantic Beach Hotel was undergoing lobby renovations and has a funky old elevator, but we were very pleasantly surprised overall. Our room was really small, but quite boutiquey with space enough for our stuff, a comfortable bed and a modernized bathroom. This hotel used to cater pretty much to the gay/lesbian crowd, and while that segment of the population was present, we (a hetero couple) were warmly welcomed and felt perfectly comfortable there. The staff were friendly and accommodating and for what we paid you could not beat the value on Condado Beach.", "Date": "May 16, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Sault Ste. Marie, Canada", "Title": "“We would never stay there again, even if they offered to pay us for staying”", "Author": "ladykatherine1967", "ReviewID": "UR108114906", "Content": "Great location. We booked two ocean view rooms. When we arrived they informed us that there was only one room available. The other room faced plaster wall. There was no appology offered. My husband tried to reason with the person saying that we paid for an ocean room view and was told that there were none available. Since it was only for one night we decided to stay and have a drink on the terrace. The hotel and the beach below was full of gay men some of them openly displaying affection and others almost making out in full view of everyone on the beach. After a couple of hours the desk clerk come over and informed us that he had one room with an ocean view and if we wanted to take it it would be additional twenty dollars plus tax. The hotel didn't have any service except the bar. No resturant, coffee machine or information where to find anything. The rooms were dark and smelled so we opened the windows just to get fresh air. The elevator was so old that we avoided using it for fear of being trapped. In the morning as my husband was still packing I went downstairs to check out but was informed that as long as my husband was still in the room we could't check out. I then joined our friends on the terrace to have a ciggarette. Shortly after my husband came downstairs and checked out I was called to the front desk and was informed that I would have to pay additional two hundred and fifty dollars because I was smoking in the room and it would costs that much to clean the room. Since this was my fourth trip to San Juan to go on a cruise and I was well aware of the smoking policy (I asked the bar tender if I was allowed to have a ciggarette on the terrace) can you imagane my surprise to being accused of something that I did not do. My husband and I traveled all around the world and have never been accused of something like this. I tried to reason with them but I guess that at this so called hotel the management is always right and they would not let me leave. they decided to lower the fine to one hundred dollars and if we wanted to get to our cruise we had to agree to pay it. I guess when they saw me smoking on the terrace they decided that I was an easy mark for extra cash. I DID NOT SMOKE IN THE ROOM and because our window was open it gave them easy way to obtain extra cash. Since my husband makes a living from people that do not obey the rules (he is a defence attorney) I would never put myslelf in a position that would affect his reputation. The managment acquired one hundred and twenty dollars extra just from us. I have to wonder how many other people found themselves in the same position. Because of our experience I would advise travellers to stay far away from this hotel and spend the extra money to stay at a reputable hotel. I know that we will and will also caution other people and tell them about our bad experience. The only reasn we stayed here was the fact that our two friend are on fixed income and they wanted to stay on the beach for their first trip to San Juan.", "Date": "May 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Not too bad!”", "Author": "kspirit1", "ReviewID": "UR107819927", "Content": "Unfortunately, I made reservations before fully researching this spot and was a bit reluctant to stay here. I even had a list of backup hotels just in case I was really disappointed, but I was slightly surprised. Yes , I was prepared for the renovations, but it was good to see that the renovations were actively being done. I was under the impression that the renovations had been going on for years. If the renovations continue at this present rate, then next summer the place should be fabulous! Plus, there is a new hotel opening beside the Atlantic Hotel , so management must get their act together otherwise business will be lost.! My room was small ,but I really don't need much. Yes, the windows were filthy, but I as prepared for that . The bed resembled the one on the internet and it was so comfortable!!!! At one point I became slightly ill and it was nice to luxuriate in that bed. I slept easily. The management was very helpful. If I wanted to book a tour , more towels or anything. Reception /management was ready to assist. I arrived a bit early for check - in , the receptionist said \" No problem.! IYour room will be ready in 15 minutes!\" At the exact time, my room was ready! I was able to lie on the beach using the hotel's beach furniture. I enjoyed myself by watching the sunsets and sunrises. I am glad I stayed. here! Great location!", "Date": "May 11, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Boston,MA", "Title": "“Don't stay until the work is all done.”", "Author": "jomofrank", "ReviewID": "UR107302343", "Content": "Only thing this place has is that it is on the beach, other than that don't waste your dollars on this place unless the so-called \"renovation\" is done. Call ahead and check. The noise is unbearable. Beautiful view but that's it. If you want to take a chance don't take the room above the bar, I think it's more quiet out on the street.", "Date": "May 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "nj", "Title": "“Overall, a good stay”", "Author": "Househead", "ReviewID": "UR106238788", "Content": "Well we arrived on a Tueday and were able to check in at around noon. The place itself looks a bit run down, especially by the bar. Just look at the cash registers! The room was clean for the most part, the most impt being the beddings and linens, which were comfy. The vents in the bathroom were filled with dust and it didnt look like it had been cleaned for awhile. Also, there was a tall lamp and the inside of it wasnt cleaned for god knows how long because, that too, was dusty and needed to be cleaned up. The lamp and vents did not affect our stay in a negative manner, just something I happened to notice. The location of the hotel is perfect, i mean the price you are paying to have an oceanfront room is really cheap if you think about it. Compared to other hotels price, you cant do much better. The view and the breeze is just amazing and you are steps away from the beach. The bar is open early and you get few people coming in and out during day,which is confusing because this place has the potential to bring in large crowds just bc of location and size of bar. i think they are missing out on a gold mine because they are not running the bar correctly and their could be a dj working the tables providing entertainment. The drinks, sad 2 say, were not potent enough.---really not even close...they were being measured as if they had limited liquor to ration! There is also too much security going on, locking hotel doors at night and having to wait for someone to come let you in. Really annoying. They need to simplify everything over there..They should realize that people are on vacation and allow visitors. I have many friends in Puerto Rico, none of which were able to come up 2 my room. Very disappointing,as though you are not a responsible adult LASTLY, dont use the elevator. We got stuck in it and it is a scary, antiquated elevator. I dont really think oceanfront hotels have to be 5 star. You are there for the beach, views, and location. I pointed out some of the issues we had, but for the most part i would stay again and am looking forward to doing so.", "Date": "April 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Atlanta, GA", "Title": "“Okay - but won't go back”", "Author": "mmwatt930", "ReviewID": "UR105867066", "Content": "The good points are - great location, clean, nice shower, decent price. The negatives - Only 1 lock on door, VERY small room, small bed for 2 grown people, small sink area, could hear every door open and close = awake many times during the night, scared of the elevator, view of water cisterns, no lobby area / under construction.", "Date": "April 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Salisbury", "Title": "“Nice & Clean hotel, great beach view”", "Author": "marinemami", "ReviewID": "UR105798408", "Content": "We stayed at the Atlantic Beach Hotel for our vacation & it was nice. Clean & friendly staff. They were in the process of remodeling it the whole week we were there. Which was nice to see they were updating it. The rooms are updated & clean & rather nice. We wanted to spend more on shopping & site-seeing, than spending $ on a fancy hotel. Great value. It was a comfy bed & maid service was on point. Only place directly on the beach! Which we enjoyed! If your looking for a nice clean comfy place to stay go here. We enjoyed it.", "Date": "April 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bayahibe, Dominican Republic", "Title": "“Comfortable bed, quiet at night and nice sea view ...”", "Author": "dalila73", "ReviewID": "UR105388079", "Content": "One of the owner is french like me, we meet at the last moment, he was very friendly. The entrance is little cold, but I don't leave in the entrance, the room was very clean, nice sheet, pillow, hot water, comfortable bed. I went for smoking in the roof front of atlantic sea, so nice. Also there is, a hotel bar front the beach and the price they are good, and the personal friendly. I stayed there 2 nights. Just a surprise, but not a problem, there are many gays...", "Date": "April 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "new york", "Title": "“one more great stay at Atlantic beach hotel”", "Author": "maryse718", "ReviewID": "UR104846316", "Content": "Went to my favorite beach vacation spot,Puerto rico at the Atlantic beach Hotel; because I went few times to this place I was confident that I will be pleased; the staff is so nice,they always made sure I had everything I needed,from the beach chair to the beach towels,to help me with finding places to eat and ordering me cabs anytime I needeed; my room was always very clean ; could not have asked for more; I can't wait for my next visit.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“i loved it”", "Author": "malzie_89", "ReviewID": "UR104635872", "Content": "i absolutly had a wonderful time there!! the people were all so kind. the room was a little small however the reviews i read i wsa terrified. the bartenders are very kind and also attentive. the only thing i had problems with were the ants in my room i eventually purchased some raid and that did the trick. I spoke to some people that i met and i was the only person that seemed to have a problem with them! i did not know that this was a gay friendly hotel so i was very surprised when i got to the beach and every man was gay. After the initial shock i made some great friends and was even taken to my first gay club. as a single women i felt very safe and i would definatly travel to this hotel again and again and again!", "Date": "April 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Paul, Minnesota", "Title": "“Amazing, Great location at a fraction of cost.”", "Author": "jojo3269", "ReviewID": "UR103277119", "Content": "I loved this place. I was a little nervous at first for an amazing location at a great price but when I got there Eddie the manager made us feel right at home. Sure our room was a little small compared to The Marriott ( two hotels down) but it was very nice and clean. The central location to everything in the Condado area was great, we could walk to everywhere easily. We were spending 5 days before we went on a cruise I had a 10yr old with me and we spent almost everyday on the beach directly in front of the hotel. This beach is shared with the Concha ($600 a night) and the Marriott San Juan. I would have to say that the staff and the management made this place very special to us. Over friendly always offering to help in any way. We are already planning our visit back. Eddie your the best and thank you so very much. Joanne and Rosie from Minnesota", "Date": "April 8, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "", "Title": "“City of”", "Author": "Guy12398", "ReviewID": "UR102564645", "Content": "Great locations beatfull beach and people, but this hotel After the new managment, Staffs and management are very unfriendly with the gay people and comunity, with they rules!!! Giving us very anplesure experiences for more the one time for my group and other friends,", "Date": "April 2, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New York", "Title": "“Perhaps the worst hotel we've ever stayed in.”", "Author": "teamfoxcatcher", "ReviewID": "UR102368858", "Content": "Lobby-as-construction-zone was our first encounter with this hotel, and things went downhill from there. The elevator was dangerous and scary, the rooms were tiny and ugly, and the staff was beyond bad -- clueless, rude, and unhelpful. We feel lucky to have emerged relatively unscathed. Do not stay here!", "Date": "March 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Overall it was a good value for the price”", "Author": "sidekickgypsy", "ReviewID": "UR101528082", "Content": "The location was great. It was right by the beach. I don't understand why it got such bad reviews, although this place is not for the homophobic and the internet wasn't available in the rooms. However, you can use the internet for free in the lobby. The desk was really helpful with locations of restaurants and whatnot. The rooms aren't exactly five star but they were great to sleep in. If I were to do it all over again, I would stay in old san Juan just because the taxis are expensive and that's where all the action is. If you're going for the beach at a good price, this is a great place for if you want to explore the city, I would suggest staying in old San Juan and coming to the beach for a couple of days.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great Deal and location!”", "Author": "JorgeNChrsitian", "ReviewID": "UR99463176", "Content": "This hotel is great deal in the heart of Condado... We stayed at this hotel during our last three days in our 2 weeks trip to Puerto Rico. It was a great deal, good price, wonderful beds, it has a very fun deck with wonderful drinks and very helpful bartenders, good front desk service, however, the hotel needs a make over desperately.... I would have not mind pay a bit extra, if owners invest a bit of money in remodeling the building.... The location is simply excellent!!!! the hotel is in front of the beach with a magnific view.... and walking distance from everything...", "Date": "March 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Great location for a great price”", "Author": "tylerkreider", "ReviewID": "UR98428588", "Content": "If you're looking for a deluxe resort, this is not the place for you. If, however, you're looking for a place to sleep, which is right on a vibrant beach in San Juan, I fully recommend this hotel. The management is very friendly, and the hotel is walkable from nightlife, Old San Juan, and plenty of restaurants. Also, the bar facing the beach opens at 11 AM. Need I say more?", "Date": "February 28, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "NJ", "Title": "“You get what you pay for...”", "Author": "NjSusan", "ReviewID": "UR97648034", "Content": "You get a location, that's it. Hotel is in horrible condition. They have so much potential! We had a lovely view from our room, and though could hear the surf - could also hear other guests and doors slamming through paper thin walls. Bar is gross and dirty looking. Elevator something out of a horror show.", "Date": "February 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Denver, Colorado", "Title": "“A very nice stay!”", "Author": "CBussey64", "ReviewID": "UR97519621", "Content": "I blindly booked this hotel, read bad reviews, read good reviews, read in between reviews .... and I was happy with Atlantic Beach. Is it a 5 star hotel, NO it is not. The rooms were clean ... and the people on here that complained about sand on the floors it is right off the beach, what do you expect? The room was immaculate and clean, as were the bathrooms. The lady and gentleman at the desk were knowledgeable and very friendly. The guests were nice, and yes it is a mix of straight and gay but I don't care, that isn't why I rent a hotel room. It was steps to the beach and what a beautiful site that was. The ONLY complaint were other people slamming their doors during the night or being loud, but that can happen anywhere .... I would book a room here again. You can't beat the view.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "", "Title": "“A faded beauty, what a shame.”", "Author": "Selfabsobedsanfran", "ReviewID": "UR97123043", "Content": "Once a happening bar, it sits on top of San Juan's gay beach. The ocean breeze & the crashing waves don't make up for the over priced drinks & poor attitude. It's okay to be badly in need if a coat of paint but is a toilet bowl brush & bleach that hard to come by? At least clean the bathrooms!", "Date": "February 18, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“Its amazing that a 3rd world country as we call it can offer a much better experience”", "Author": "msacerio", "ReviewID": "UR95915273", "Content": "-Hotel is in horrible conditions, I am almost thought they used pictures from another hotel. -Overall plumbing very very poor condition. -Service? NONE! (room service may i get some towels? Yes! you can come down and get them yourself) -Elevator does not work -Mold and Mildew all around (smells everywhere) -Not accommodating if you rent car -You have to give a deposit for EVERYTHING -Over priced (base their prices on location)", "Date": "February 8, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Connecticut", "Title": "“Vacation”", "Author": "sasiris", "ReviewID": "UR92780667", "Content": "not what expect it. bed was very comfortable but other than that....did not like it at all...", "Date": "January 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Good deal, great spot”", "Author": "PoetMother", "ReviewID": "UR92419896", "Content": "The Atlantic Beach Hotel is in a great location, has a wonderful beach, and is very affordable. If you are a contemporary traveler looking for a reasonable small spot that is just a few miles from the San Juan airport, this will serve you well. It isn't fancy, but some people prefer a personal slant over generic trimmings.", "Date": "January 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Bargain hotel--clean room with no amenities”", "Author": "CWH202", "ReviewID": "UR91396970", "Content": "Overall, I thought the hotel was worth the money. It is in the same neighborhood as the big resorts in Condado and is right on the beach. The room I stayed in appeared to be newly renovated and was very clean. The room was simple--a bed, a desk, a tv, and a bathroom. There are really no amenities at this hotel. Go for a cheap, clean room in a great location. Do not stay here if you are looking for a pool, gym, restaurant, etc. The hotel does have a bar, but it was closed for most of my stay. The hotel advertises WIFI, but it does not work in the rooms. You have to sit in the lobby to get online.", "Date": "January 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Asheboro, North Carolina", "Title": "“Had a Great Time”", "Author": "ncstu1946", "ReviewID": "UR91150124", "Content": "This is the second time we have stayed at the Atlantic Beach Hotel in Conando Beach. If you're looking for a 5-star hotel with all the whistles and bells then this one isn't for you. If, however, you want a hotel with a very friendly staff that's right on the beach with very good rates then this hotel is for you. The hotel was in the process of rennovation but it was not intrusive to our stay in either mess or noise. The guest rooms have been redone since we were there last and though a bit small are comfortable and plesant. The new paint, marble floors and redone bathrooms are very nice. The staff went out of their way to accomodate any request we had while there. We definitely would go back.", "Date": "December 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Eugene, Oregon", "Title": "“Pretty Good Hotel”", "Author": "BJW2010", "ReviewID": "UR90726363", "Content": "We arrived from this hotel from the airport around eleven and had to pay $16 for a taxi. When we arrived the front desk was not manned. We waited a few minutes for the clerk. It was late and storming so we didnt go outside but there seemed to be a nice pool area and it was directly on the ocean. We checked in and even though we had payed in advance we had to give them a credit card so they could hold $100 in case we made damage. The room was very nice. It was clean, it was nicely decorated, and we had a picture perfect view of the ocean. The only problem: no air conditioning. It was storming outside so if we opened the window we got the bed and nightstands wet. It was not a very good sleep because we were very hot. Around 4am we decided we were thirsty. There are no vending machines so we had to walk to the walgreens up the street, which wasnt very far. Overall I had a fairly good experience. We checked out the next morning and even though they said we were not being charged for any room damage. They hold didnt come off my bank account for three days.", "Date": "December 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Welcoming,”", "Author": "iangelous", "ReviewID": "UR89113877", "Content": "hotel doesnt have that many amenities its a place where you can just stay to sleep shower and change they do have a bar down stairs and the beach view is incredible but thats just about it..... They recently remodeled the location and its looking fantastic..", "Date": "December 5, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“great location.”", "Author": "hkboxer", "ReviewID": "UR88698857", "Content": "We skipped a city in PR so had one night with out reservation. Booked one night in this hotel. The beach bar (gay) had some traffic during sun set but that was the only time I saw it with people. The bartenders were nice but the place needs a little bit of tlc. The bar area was not so inviting but the view was nice. There is a beach in front of the hotel and there are free beach chairs for guests to use. It was quiet and gay part of the beach is next to the hotel where some locals and visitors lay out. A guy rents out beach chair for 3 dollars. Most of the public area in the hotel needs some updating but it is clean. The room we stayed in was simple but nice, clean and newly renovated and had a view of the ocean. Our over all stay was ok. The only thing that might be a problem to others is you can not have visitors in your room. It is the hotel policy. Basically if you plan to entertain, you might have to consider other accommodation options. But if that is not an issue, the place is clean and very convenient to everything.", "Date": "November 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Orlando, Florida", "Title": "“Nice place to stay for the price”", "Author": "greensharpie", "ReviewID": "UR88264153", "Content": "We stayed here the last week of October. We chose the hotel because of it's location on the beach and not far from old san juan. We were looking for a hotel that was nicely priced and a good place to sleep at night , because we were out for most of the day..it was perfect for that. The people at the desk of the hotel were very friendly and we had fresh towels and a clean room each day. Did not have any problems. They even drug out the beach chairs for us when we went down to the beach. The water is very rough though, so we didn't swim, but the beach was pretty nice. Reading some of the other reviews, we knew there would be some gay people around, but it didn't bother us one bit, everyone was super nice and we had no issues at all. The hotel is right around the corner from the bus stop- warning, it is almost impossible to find a bus map! But we waited about 15 mins for the bus (costs 75 cents)to go into san juan and while in san juan we visited the forts by walking and the free trolley. The issue was trying to get back to condado by bus, waited nearly an hour for one at the depot..so it may be best to take a taxi back, which will run you 10-15 dollars. There is a dunkin donuts right down the street, a wendys and an excellent eating place called \"angels puerto rican food\" delicious! we stayed for about 4 days... a wed thru sunday..never had any issues with the loudness of the bar at night, you can only hear the ocean, we stayed on the third floor, ocean view. only complaint- dont stay there if you plan to watch tv alot- the tv was very old and no remote, but we weren't there for tv : ) so this is a great deal if you just need a place to sleep, if you are looking to stay in your hotel room all day, you might want to choose a fancier hotel : )", "Date": "November 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“It's Not the Four Seasons, but it's cheap, clean, and right on the ocean.”", "Author": "kcshoegurl", "ReviewID": "UR86781231", "Content": "Seriously, you will not be living a life of luxury at this hotel. And yes, the hotel is run down but it does have its charms. (That being the hotel staff, and the beach front bar... just make sure to hit them up at happy hour (4-7pm) for the $3 drinks.) The rooms are pretty small, but clean. Just make sure to either bring clothes that will not wrinkle , or a travel iron/steamer, as there are no irons in the room.. you have to use the community iron upstairs in the \"penthouse\" , which is the worlds oldest and smallest iron. And, prepare yourself for very little closet/drawer space. BUT! The beds are super comfortable, so it has that going for it. While the hotel does provide beach chairs, they do not provide beach towels (although I did hear you can rent them) so make sure to bring your own. Mark works the front desk at night and is awesome. He can tell you where all the hotspots are ,and give you some tricks and tips on how to get there. FYI .. you can totally barter with the cab drivers. It took us 3 days to figure that out. There are \"businessmen\" that hang out around the hotel, but at no time did I ever feel unsafe. They pretty much just kept to themselves. Also, if you decide to stay here prepare yourself for the condition of the building next door to the hotel. All in all our stay at the Atlantic Beach was good. Its a small little shell of what it used to be (apparently back in the day it used to be the place to go in San Juan...), and it looks like they are trying to renovate when and where they can.. just prepare yourself .. they have a ways to go. Oh, and avoid the elevator. Yikes.", "Date": "November 11, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "5", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Dallas, Texas, USA", "Title": "“A Horrible Nightmare - I'm A Hotel Manager!”", "Author": "HotelManager411", "ReviewID": "UR86507035", "Content": "I had booked a 6 day stay at this location, I understand that in life you get what you pay for but this place really killed it... not only do they not have individual A/C in the rooms, but the Central AC system they have sucks, my baggage was opened and left open while I was out of the hotel, they treat the guest at hotel as if you were trash, at least the tall older security man does, parking is dreadful, even if your going up to your room for 5 minutes, you need to go inside, get the front desk agent to open the garage and then come back out to get it... it gets to a point were they are bothered to assist you.. the hotel WiFi does not reach the rooms, and your are not allowed to bring anyone to your room, if they are not on the list, regardless if its your son, sister, brother or boyfriend it is not acceptable... overall the price is great, but when you stay there you will see why, I know this hotel was once a magnificent place filled with nightlife, now you simply have rude people working there, one night I came in with my boyfriend from the other side of the island and my boyfriend forgot his wallet, the security officer would not let us or at least him back in the room, regardless of the paperwork and regardless of his name being on the registration card.. Please Book A Night Here So You Can Also Share Your Story Of Terror", "Date": "November 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Great location and price.”", "Author": "JTNY1", "ReviewID": "UR85730811", "Content": "This hotel has a great location right on the Cordado Beach. Very nice, responsive and knowledgeable staff. The room we occupied(308) was updated and clean. The room was small but I didn't stay in the room much only to sleep a few hours lol. The bar area was great, over looking the beach and let me not forget the roof top deck. Great views of the beach and surrounding areas. This hotel is close to and within walking distance to shops, restaurants and casino's for those who like to gamble. I would recommend this hotel but make sure you request a renovated room with a private bathroom. Some of there room come with shared baths. And yes I will stay at this establishment again.", "Date": "November 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hull, Massachusetts", "Title": "“Nicest location on Condado Beach”", "Author": "enb4peace", "ReviewID": "UR84837373", "Content": "There is no doubt that this building needs a serious update, but if you can get past that. it has so many nice things about it.The staff, Nancy, Mark,Ivan,Louis, the gentleman who recommended Angels place to eat,are all so pleasant and accommodating.The rooms is small but clean.Sitting on the Patio Bar with the views and the trade winds is like being in paradise~I would go back again.The people of Puerto Rico are lovely and the sound of the Coqui is still ringing in our ears!~Thank you all!~Eileen and Peter Butler Mass.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Louisville, Kentucky", "Title": "“sweet little hotel”", "Author": "luna1122", "ReviewID": "UR80235401", "Content": "my boyfriend and i travelled to puerto rico for a few days on vieques, and the rest back in san juan. we'd found the site of the atlantic beach hotel, liked the look of it, and the price. we're a hetero couple but this being a 'gay hotel' didn't factor in one way or another...why would it? we'd read some of the negative reviews so were a tiny bit doubtful about it, but we really enjoyed it. sure, it's a little shabby. the elevator is sloooow and creaky. the phone situation is a little odd. (we'd accidentally drowned our phones while in vieuqes,so had to rely on landlines) but our room was squeaky clean, newly refurbished, all white and stark and minimalistic and pretty, the closet was roomy, the bathroom cute, the water pressure just fine, and the AC...well, it can't BE too cold for me, so i had no problem with it. best of all: the view. we opened our drapes and beheld sparkling blue/green waters and gently waving palm trees and white sand, just steps outside our door. the staff was universally pleasant and helpful, from the front desk to the bartenders, the drinks good, the beach chairs and towels free. we slept like babies with the sound of the surf lulling us. the neighborhood seems FINE to me, lively and busy, with tons of restaurants and shopping nearby, and we never felt unsafe. i'd definitely recommend this to open minded, laid back folks who just want a clean pretty room on the beach at a good price, and don't need frills or pampering. we'd definitely go back.", "Date": "September 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cape Coral, Florida", "Title": "“I LOVED IT”", "Author": "Adrianacro1", "ReviewID": "UR78142555", "Content": "I not gay, so I was very skeptical about this place. I can tell that is not the Hilton but for the price and the service, my money was very well spent. The view was gorgeous, you feel in heaven. My room was always clean, the bathroom is not a spa salon but it is very decent, hot water always available. The Bar in really nice, Ivan was our bartender and he is divine. Angel was our guy in the front desk, and meanwhile my friends were having fun with their gay partners he took the time to talk and spent quality time with me even that he is gay, and that is what I call service. The restaurants near by are really good and cheap. Everything is close, no more than 10 minuts away. And the hotel also offered different tours around the city and were GREAT. For sure I'll do it again.", "Date": "September 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Washington, DC", "Title": "“Former Gay Hotel goes Hetero, but beach is still gay--go figure?”", "Author": "jaonyc", "ReviewID": "UR74849124", "Content": "In the past this was the Premiere Gay Hotel in Condado with a large roof top club and exclusively gay clientele. Thus, the beach in front of the hotel was gay. The hotel has changed ownership and it is now marketed as a \"Gay Friendly \" hotel. Gone is the roof top club, the bar is pretty pathetic and in are the weekend strollers with families and kids...in a words \"NOT FUN\". The good news is that the rooms have been renovated, but the a/c is not individually controlled in your room (which may account for the large openning on the bottom of each room door for more ventilation). If you pay your bar tab with a credit card be prepared to pay an additional fee of 15% (illegal...hmmm, and no waiter tips on credit card). Some small details that need to be looked at, turn onthe water so you can rinse your feet when you leave beach, otherwise there is sand all over lobby and in your room. Huge exclusively gay hotel under construction across street that will probably bring Atlantic Beach to it's knees. Best to spend your money elsewhere and visit the unHappyHour as a guest.--bar staff are fun and worth chatting with.", "Date": "August 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“I loved this hotel and I will stay there in the future”", "Author": "mikah526", "ReviewID": "UR74432158", "Content": "Not only was it a nice hotel and a good price but the employees were so nice and welcoming, Just to name a few Ivan, Angel, Tino, Armando, All were so nice, Our rooms were clean the whole time, The hotel was right on the beach, its beyond gay friendly, There were nice places to eat as well but we found one right across the street from the gym next to the hotel called Orosco's so we eat there everyday, The clubs are like a 5 min cab ride away, The weather was so nice the whole time, and yes there were some men that stand around waiting for someone to pay them to \"hang out\" but that's just how it is there we assumed... : ) But but yes if you want to stay at a nice hotel that is right on the beach Atlantic Beach Hotel is it!", "Date": "August 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“What a bargain!”", "Author": "vero600", "ReviewID": "UR73600723", "Content": "I very much enjoyed my stay at the Atlantic Beach Hotel -- it was clean and comfortable, and it's a shame that it gets so many negative reviews. Perhaps I can clear a few things up. This IS a gay-friendly hotel. The crowd is a comfortable mix of gay and straight people, and the service is fine regardless of sex and gender. Homophobes, stay away, please. As for the comments accusing the staff of bias, I can only assume it has something to do with the fact that there are a lot of gay prostitutes who hang around the hotel, trying to get invited in, and frankly, I wouldn't want to let them in, either. This IS a no frills, budget hotel, and it's a good deal. At this price, if you expect luxury you're setting yourself up for disappointment. I was happy with my room, though the shower dripped and the A/C was a bit too cold (I just opened the window to let some warm air in). The view from my window was worth way more than I paid. In the future, if I go for a romantic vacation, I'll probably stay somewhere nicer and more expensive, but for a quick, cheap weekend on the beach, this is the perfect hotel. The location, on Condado beach, is within a popular tourist area with lots of hotels and restaurants. Oh, and it's ON THE BEACH. Sure, it's on a side street rather than the main road, but it's not exactly off the beaten path and it's not a particularly dangerous area. As I mentioned above, there are some shady characters who hang out outside the hotel, but if you don't mess with them, they don't mess with you. One thing I really loved about this hotel is the bar. The bartenders are super friendly and the beach view is outstanding. It's a really great place to just sit and chat and have a drink without having to get all dressed up and pay a cover. Also, the hotel provides beach chairs and umbrellas to guests, which makes a perfect spot for drinking pina coladas and enjoying the eye candy. I recommend this hotel to anyone with an open mind who wants to visit San Juan on a budget. It's a great deal, and I had a great stay.", "Date": "August 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Do NOT waste your money!! Bed bugs and rude staff!”", "Author": "Bruin98", "ReviewID": "UR73161911", "Content": "I just finished a week's stay at the Atlantic Beach Hotel with a friend and by the last day we couldn't wait to get out of there!! We had booked this place for the following reasons: #1: it's advertised as a \"gay-friendly\" hotel in many sites and gay travel publications, #2: the llocation, right in the center of Condado, #3: the price. To be as objective and real as I can be, I will list the good first: 1. Location: its true, it is righ in fron of what's considered the \"gay beach\" and at the center of all restaurants and shops, but then again, so are the other hotels AND you can still come to the gay beach for free because beaches are all public here. 2. Price: when you are on a budget and not a \"picky\" traveler, all you want is a clean place to sleep and bathe. By the look of the tiles in the bathroom and the furniture in the room you can tell they have done some remodeling. The BAD: where do I even begin?? 1. The staff: when we checked in, no explanation was given to us of what was around or nearby. Also there is one guy we named the \"hotel nazi\" because he keeps an eye on your every move; VERY uncomfortable. Yes, I know I'm gay, I don't need you to keep staring at me like I'm going to start an orgy or something. 2. The rest of the hotel is in serious need of a remodel: the bar is rund down, the elevator seems like it's about to give any minute (very scary!), and the front deskreminds me of a disorganized private investigator's desk from a bad 80's police show: paperwork pinned on boards and stacked all over. There's also a lingering smell of damp rags in that area. I know we are near the beach and all, but really? This is my first impression? 3. BED BUGS!! Every morning i'd wake up with itchy tiny rashes which I thought were due to mosquitoes. Then it ocurred to me to look at my sheets one day, and sure enough, there they were!! Yuck!! Do I needto go on?? 4. Heavy Atmosphere. I've stayed at plenty budget hotels before where I have felt like I've stayed at a 5 star resort because of the friendliness of the staff. Here I felt like I was in a dorm where my every move had to be analyzed in case I became a sex-crazed, out-of-control gay man! Seriously?? Even the locals would agree this is NOT the place to stay if you are a gay client simply because its in front of the gay beach or it has a \"gay-friendly\" bar. I learned my lesson. Next time I will spend a few more dollars and stay somewhere else!! In the mean time, I'm putting the word out there. If you are gay, STAY AWAY!! Use the gay beach during the day if you'd like, but then go to a nicer place to sleep at night where you are not treated like a prisoner!!", "Date": "July 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Isla de Vieques, Puerto Rico", "Title": "“Very Good Value”", "Author": "PRalltheway", "ReviewID": "UR71333407", "Content": "So really, what did you all expect for a hotel located directly on the ocean for $89.00? Nope, not the Ritz, but a really pleasant little hotel. For that price I received a clean comfortable room with an ocean view, and a very accommodating staff. I am really puzzled by all of the negative reviews here. The location couldn't be any better and there was never a time that I felt \"unsafe\". I own a small hotel in PR and I can confidently reccommend The Atlantic Beach Hotel for my guests traveling to Condado. We'll be back soon!", "Date": "July 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“One night stay”", "Author": "LauraVioleta", "ReviewID": "UR71048921", "Content": "I'm puertorican and live in san juan. Wanted just a one night room in the least expensive htl near the Vista al Mar area, where a fiesta was to take place all afternoon and evening. After reading reviews and checking prices I gambled on the Atlantic Beach. The Condado area of san juan is quite expensive. My bill came to $108 including an oceanfront room, one night parking and taxes. I found friendly staff. The building still needs more care. It is an old building and in front of the ocean it depreciates quickly. I found my refurbished room clean and very pretty. The new bed and white bedding were beautiful and very comfortable. Sparkling room floor and small bathroom were clean and very pretty. Room size just right. Funny that you cannot control the air conditioning, but it was ok (this was in july). Room on the second floor so I went up and down the refurbished stairs, bright and nice. The elevator needs a remake but it works. Oceanfront bar simple, comfy and friendly. Patrons low key, friendly and happy. The ocean in that area is somewhat too rough for me, I perfer calmer waters but still lots of adults and children were bathing. I found the area not dangerous but one must always be careful. I was not approached by anybody for anything and didn't see anybody like waiting for us as we went in and out of the htl. All that said...there is a new building going up across Vendig St. in front of the htl and nextdoors facing the ocean there is an abandoned see through shell of a same size and type building as the Atlantic Beach. Walking distance with entrance right on Ashford Ave. and sharing the same beach are the Renaissance La Concha and the Marriott plus other. The Atlantic Beach entrance, which is on Vendig St. could use a gardener and a painter. Can't figure why it's not been done. Conclusion: wish the owners would pay more attention to the front area. I'd go back if need be and would recommend with aforementioned flags. I'm posting some photos.", "Date": "July 15, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Do NOT Stay Here if you want to be in a NICE area”", "Author": "CaraF_20", "ReviewID": "UR69255342", "Content": "Our travel agent put me and my husband here on our honeymoon. We were scheduled for three nights, but stayed one and went looking for a better, safer place. The only good thing was the hotel had a nice view of the ocean. We had trouble finding the place because it is basically at the end of an alley and has only four parking spots (behind gates). It is an old, renovated building that has not been cared for well. The hallways are dark and dirty, the elevator does not work properly, and we felt unsafe in the general area. The room was alright, except it didn't have air control in the room and the door didn't fit properly so a lot of light came in from the hallway. The bathroom was basically a closet you had to step a foot into, and the shower was tiny. We decided to go elsewhere after walking to a nearby Dunkin Donuts for breakfast - the doors were locked, the staff had to allow you to come in. The general area felt very unsafe. We went to Old San Juan, which was much better, and stayed at The Gallery Inn.", "Date": "June 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Great time. Renovated rooms beautiful!”", "Author": "manamystery", "ReviewID": "UR68343639", "Content": "I just got back from my third stay at Atlantic Beach Hotel and it was great. The newly renovated rooms were great and looked like something out of the West Elm Catalog. Rooms were clean and service daily was great. Jack and the rest of the front desk staff were very friendly and accommodating, night and day. Armando the bartender was terrific and having the beach at the bottom of the steps was awesome. No, it's not the Ritz Carlton but more intimate with character and the ocean views are great. Will definitely be going back.", "Date": "June 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "4", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Santa Rosa, California", "Title": "“Very inexpensive but you get what you pay for at this hotel”", "Author": "Keith5186", "ReviewID": "UR66928532", "Content": "Old hotel that has been remodeled. Elevator was not working properly, hallways were filthy, rooms very small, sand on the bed sheets before we even sat on the bed. If that was not bad enough, there is no temperature control in the rooms. It was 95 degrees outside and 50 degrees in our room. When we complained about how cold the room was, the staff told us to try to close the vents because the entire hotel is the same temperature. The vents were not able to close so we froze for 2 nights. The hotel is positioned at the end of a very small street that appears to be an alley at first sight. This place has absolutely NO curb appeal. The hotel is also flanked by 2 abandoned hotels that are mere shells. Everytime we left the hotel there were always several men positioned on the street asking us if we wanted \"help\" with anything. The beach was nice but the staff told us not to carry anything valuable with us on the beach once it got dark. The outdoor bar was about the only redeeming part of this property. We expected SO much more since the hotel boasts its \"gay friendly\" status. We planned on staying longer but had to leave after 2 nights and stay at another hotel down the street.", "Date": "June 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Brewster, Massachusetts", "Title": "“Do not Stay there.. This is not a Hotel this a Cheap Motel”", "Author": "datadee2000", "ReviewID": "UR64951189", "Content": "I arrived on May 18th I didn't like the view the front of the hotel that is.. I gave it a chance..got to my room and was disgusted by what I saw.. the room was very old the door only had one lock it appeared that someone broke in there. I'm a single woman and ran out of there. I stayed at the Radissun a few blocks away more expensive but it was worth my peace of mind and safety--beware it looks like criminals go there.", "Date": "May 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jersey", "Title": "“Fantastic Place To Stay”", "Author": "tcotto", "ReviewID": "UR64695041", "Content": "I was a bit apprensive about booking this hotel based on some of the complainers here on tripadvisor. However, my wife and I took a chance and bit the bullet. We could not have been more pleased with our stay and the way we were warmly treated by the staff. The rooms were quite nice for a small hotel and the location could not have been better. The maids were very nice and left our rooms very clean and they always left extra towels each day in our room after our first request. As my wife and I are quite open minded to other lifestyles, we found that the few gay persons that we encountered in the bar area were very polite and seemed more on the professional side. Overall we will definately return to the Atlantic Beach Hotel and highly recommend it to our friends who might be passing thru San Juan.", "Date": "May 19, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“For one night, it was what we needed.”", "Author": "kejannic0206", "ReviewID": "UR64627488", "Content": "My boyfriend and I stayed at Atlantic Beach Hotel the night before leaving for a cruise out of San Juan. For us, it was what we needed for a one night stay. We got a good deal on this hotel which is why we chose to stay here. The rooms were OK. Small but clean. The elevator is a little sketchy. I got a little nervous going in it! I wanted to lay on the beach in the morning but they didn't have any chairs out. I was a little bummed about that. I would never stay here for a whole week, but if like us, you are looking for a place to spend a night or two, for the price it is worth it.", "Date": "May 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lawrence, Kansas", "Title": "“Fantastic location, good value”", "Author": "KSUboy", "ReviewID": "UR64056255", "Content": "We came to this hotel wanting 1) a place on the beach, and 2) a place to sleep. This was a very clean (we had room 205, a remodeled room with a great ocean view) room that served that function well. No frills (breakfast, pool, etc.) but we weren't there to hang out in the room. Room was very clean, staff was very friendly and helpful. the only issue (which wasn't that bad) was that we were right above the bar. The music was usually drowned out by the sounds of the ocean, but once in a while, a song was played that was a little too loud (when I'm staying in an ocean view room, I'd much rather hear the waves than Cher). Great location within walking distance of a great local market, old San Juan, and a ton of other sites. Be sure to ask for Rupert if you want a rainforest tour. Great stay, and we can't wait to go back.", "Date": "May 13, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Wichita, Kansas", "Title": "“LISTEN TO ME---DO NOT STAY HERE!”", "Author": "pichulita2", "ReviewID": "UR63941096", "Content": "As many of the other reviews... we saw a mixed review from really good to really bad... and unfortunately for us... it was the really BAD!!! It is VERY much a Gay oriented hotel... which is not a big deal if you dont mind the crowd..but a HUGE deal if the staff members are not polite, and nice to you if you are not a 6 foot atletic man! ( we were 2 females) The bar and view was nice, but the beach service clased awful early and you could not take towels to seat on their beach chairs. They would not allow to check in before 3 even though they were rooms available.... Another issue is that there were no towels in the room and they would bring us the towels. we had to go get them ourselves. Also their laundry fascility is a dump and their iron stainned my beautiful whiite blouse with rusty water that came out of the chainned to the wall ironning board and iron.... they did nothing about this, and only told me that they had no idea that there was no light and that the iron was bad since they bnever go up there... BIG Flag... Anyways... I am big on using reviews and I have to tell you that this place is just as it sounds... A HUGE lottery... you may get luck and not have problems, or you will hate your stay... I am not going back EVER!", "Date": "May 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Good Value!”", "Author": "NikkiZiv", "ReviewID": "UR63345899", "Content": "We traveled to San Juan to attend a destination wedding. Neither one of us has ever been to San Juan. We stayed for a week and was looking forward to exploring the area. The staff was very nice and gave us good tips on where to dine and gave us great directions to get around. The room was small, clean, light and airy. The bed was comfy as well. The location was great and within walking distance of many good restaurants. The hotel is remodeling so there is some old mixed with new which we didn't mind. This hotel is good if you like to explore the area you are staying in. If you want to lounge around the pool or beach and be waited on hand and foot then you need to spend more money and stay at big overpriced resort. There is a $50 deposit fee that they require upon check in. They give you a receipt and you return the receipt and they give you the $50 back. I was not aware of this prior to checking in but was ok with it when they explained that it will be returned at the time of check out (which we did receive). The two things I would liked to have had was an vending machine with snacks (there is a Walgreens one block from the hotel) for convenience, ice machine and a coffee machine (in the room). If there was an ice machine, we never found it. The hotel and surrounding area is safe. We had walked back from many restaurants and bars at 11:30 p.m. or later and felt safe. The only time I was truly annoyed was the second night we were there the Billboard Latin Music Awards was taking place and the Conrad Hilton and La Concha were hosting after parties. At 3:45 a.m., La Concha taught it would be a good idea to set off a professional firework display on the beach a couple of properties down from the Atlantic Beach Hotel to close the party. It sounded like the City was under attack. That is not the Atlantic's fault, just make sure you're not staying when the music awards is happening :) To sum this hotel up: Pros: Great price, great location, clean and helpful staff Cons: No pool (for those that don't like sand between their toes), no vending machine, ice machine, no in room coffee maker", "Date": "May 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Orange, California", "Title": "“Great Value for those who don't require sleep!”", "Author": "BillyBoy1230", "ReviewID": "UR62711424", "Content": "I just returned from a 4 nights stay at the Atlantic Beach. Rooms are freshly painted and clean. Basic accommodations with huge flat screen HDTV. Bathrooms are spotless and the beds are comfortable. Location is top notch! Right on the beach and is a gay friendly hotel with a beach bar. Lounge beach chairs and umbrellas provided free of charge to hotel guest. The biggest draw back is that all night long you hear people coming in all hours of the night and slamming their door. Loud talking in the hallway that just echos through out. If you don't require much sleep then this is the perfect location for the price that can't be beat. Staff is friendly and the beach is wonderful. Can be quit cruisey too. Especially on the weekends. Hustlers are out and about day and night so beware.", "Date": "April 29, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Harquer", "Title": "“Not Gay Friendly”", "Author": "Harquer", "ReviewID": "UR62110316", "Content": "If You're Gay Don't Give Them Your Business! This place is listed on several gay travel sites as being gay-owned/gay-friendly, though it was apparently sold a few years, it continues to misrepresent itself to gay travelers. The management is anything but gay friendly: they monitor guest's visitors and forcefully prohibit any they don't like, even if well behaved. My guest was asked to leave apparently just because he was the same sex and was in my paid-in-advance room and even though no loud or nuisance behavior was afoot. They also asked me, the guest, to leave -- then tried charging me for that very night! While part of this can be attributed to the tourist-trap milieu of San Jan generally, I definitely felt hostile discrimination. The hotel itself is located right on the beach, but that's the only redeeming characteristic. Yes, they provide courtesy beach chairs, but renting a beach towel costs $10! Yes, they have a bar, but if you want something more than a bottle of beer or rum&coke, forget it. Interior is very basic with tile flooring, which being on the beach might be understandable for cleaning purposes, but there was always sand even in the room! The bathroom has shower only and only half-sized sink. And no thermostat nor any individual climate control. I'm used to bare-bones travel including other parts of Latin America, but this was the worst value and least hospitable travel in my LA experience.", "Date": "April 21, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Buena Park, CA", "Title": "“Good budget priced hotel with some renovated rooms, right on the beach.”", "Author": "fabreps", "ReviewID": "UR62075522", "Content": "Make sure you get a renovated room as they are quite nice, but small. The showers are among the best ever! The beds are comfortable. The staff were very friendly and accommodating.", "Date": "April 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Beach front, friendly staff, perfect stay!”", "Author": "megleebak", "ReviewID": "UR61252855", "Content": "I went down with 2 girlfriends and we had such a fantastic time. The staff was super friendly and helpful. The room was clean and comfortable however we did wish for temperature control at night because the AC was on too high. If your intent is to spend the majority of your time on the beach this place is perfect. You walk down the back steps directly on to the beach where they provide chairs and umbrellas free of charge. We spent a lot of time at the beach front bar sipping on reasonably priced drinks and talking with the locals and other hotel patrons. The whole place has a very good friendly vibe. If I return to PR I will definitely stay here again.", "Date": "April 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "", "Title": "“Very adequate place to stay...great location!”", "Author": "MichelleN4", "ReviewID": "UR61041349", "Content": "I stayed two nights here after \"roughing it\" in Old San Juan for four nights. It's right in the middle of all the big hotels on Ashford Avenue and restaurants/shopping/Walgreens was not too far away. It is smack dab on the beach and the people at the front desk were very helpful and friendly. I asked for, and received a renovated room (see pictures) and it was a very comfortable place to sleep. I did have an issue with the maid not replacing the towels she took and I was afraid it was going to be an issue when I checked out at 6am...but it was not. That being said, it didn't have a lot of ambiance. The bar downstairs played the WORST music-I'm talking Britney Spears/MTV stuff and I would have preferred some salsa...especially since I was in PR. The music alone kept me from hanging out at the bar. As other reviewers mentioned, it is ground zero for Condado gay beach culture and I would have preferred not to see young, gay Puerto Rican men \"cruising\" the strip looking for love/cash. There is an abandoned building right next door and evidently things get steamy on the beach next door after hours. I don't write this to scare anyone away...as it wasn't a safety issue and as a female traveling alone I didn't feel unsafe, just know what's going on around you. I met a local, very friendly drug dealer right outside the hotel as well, too bad I'm not into drugs. I won't likely stay here again, though this has less to do with the hotel and more to do with the area. It didn't have the character that Old San Juan did...depends on what you're looking for. There wasn't enough opportunity for people watching or going out for this solo traveler, but it should suit couples/families just fine!", "Date": "April 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Nice, Quiet, Convenient and Friendly!”", "Author": "BklynMJ", "ReviewID": "UR60944758", "Content": "I went to this hotel with three friends for a short term stay of 3 nights/4 days. The hotel was right on the beach, quiet, and conveniently located amongst tons of cute restaurants and boutiques in Condado. They offered on beach bar service, chairs/umbrellas etc, free internet access (that was spotty on a few of the days) and a friendly/helpful/flexible staff. Although they didn't have a workout room, there was a fitness center right at the end of the street that offered 15 dollar day passes. The hotels on either side were no longer in use and there was construction going on down the street, but it was not noisy and it appeared that everywhere in Condado construction was going on anyway. There was also a convenient local bus route right along the outer road that took us to Old San Juan in around 20 minutes. If you want american style breakfast you may have to head to one of the american chains, but if you're adventurous you can also piece together a breakfast from the closeby grocery store. lastly, as a vegetarian I was nervous that the restaurants in the area would not have options for me, but they did and were very accomodating to a party that included a vegetarian(myself) someone with a nut allergy and someone with an allergy to whitefish!", "Date": "April 10, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "St Louis", "Title": "“Living on its past”", "Author": "DrBStL", "ReviewID": "UR59883607", "Content": "The Atlantic Beach Hotel at one point was probably a gay hot spot for a cheap, no frills hotel on the beach, conveniently located to restaurants and the bus line. Unfortunately, like so many successful gay bars and establishments, the owners pocket the profits and put off any improvements as long as possible. This hotel is now in the process of renovating the rooms and their apartment building, where i stayed. The desk staff was helpful and courteous. The renovation is superficial. One of my rooms had a contemporary new bed and attractive bedspread, but the other rooms looked like leftovers from the 60s in a floral pattern. The water pressure was terrible. Takes a long time for hot water to get to the third floor.They put in a new granite counter tops, but didn't have it sealed and any moisture at all left big spots until it evaporated. Wait until someone spills some wine or suntan oil and it will be there forever. The exterior of the hotel is chipping off. The Wi Fi only works in the lobby. None is available even for pay in the room. The bar is boring. The beach during the week (high season at the end of February) never had more than 15 people, and on the weekend had only 25: and most on the weekend were not gay. It's ok if you are on a low budget, but there are better places to stay if you can afford it.", "Date": "March 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“Comfortable Beach Hotel”", "Author": "Butterflyclub", "ReviewID": "UR59468882", "Content": "This Condado Beach Hotel was loaded with warm hospitality. The staff was excellent in making this solo traveler feel welcome. The staff was so friendly and willing to answer all my questions, such as giving me directions to cultural events and sightseeing. From this area it was easy to catch buses to Old San Juan, the art museums and many other places of interest. The room was very comfortable and the housekeeing staff did a wonderful job of refreshing my room daily without inconvenience. It really was the perfect location to spend time on the beach. It was also located near the tourist area where you could walk to several nice restaurants and plenty of shopping.", "Date": "March 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Chicago", "Title": "“Nothing like the photos!”", "Author": "casscris", "ReviewID": "UR59260608", "Content": "When we first drove up I was a little put off by all the graffiti on the buildings. My husband and I both thought the hotel looked a little run down and dirty. The lobby was very old looking. We arrived early as we just got off of the cruise ship. We had A LOT of luggage including valuable souvenirs we had purchased as well as a laptop computer. We were told our room would not be ready til around 3 - which was completely understandable. The gentleman told us they would hold our luggage and put tags on it. We were grateful. My husband helped him move our things into a back room which did not seem very secure. So my husband asked \"is our stuff safe here\" to which the man replied \"if not you can take it with you!\" We were just looking for a little reassurance! He could have just assured us that it was secure! Rude! The elevator really, really needed to be wiped down! I don't even mind so much how old it was -- it was dirty and it smelled like mildew! The halls upstairs looked ok, I was hopeful and having seen the photos on their website, I just knew our room would be nice -- NOT! The only thing similar to the photos were the white linens and the bathroom looked pretty updated, although the shower looked dirty! I was SO disappointed with the room! The hotel website DID NOT mention that they were in the process of updating -- I certainly would have requested one of those rooms and my review would be MUCH better! Room 301 - The lamp shades were water warped, TV was tiny with no remote, there was no AC control (very hot room, we had to open the door for a while just to get some air circulation from the hallway), towel had questionable stains, table needed to be cleaned. We went to Walgreen's and bought LYSOL! Sprayed everything in the room and the elevator and the doors! We were woken up several times during the night because of the partying going on just below our window in the patio bar but especially because of the LOUD guests in the hallways. This was a very noisy place. You can not swim in the water behind this hotel because there are big rocks, you have to walk down to other hotels and even at that there are signs warning you not to go into the water due to strong current. If you have kids, especially BE AWARE of this -- my husband is a very tall and strong man and the currents pulled him out with ease! As far as the comments I've read about prostitution as well homosexuals; There were a lot of questionable looking men right outside the door but I'm pretty sure that's a public area so I can't necessarily blame the hotel for that, if they were prostitutes even. However we made the decision not to be out at night as I did not feel safe! But during the day we liked it! Shopping was good, restaurants, etc. We figured out that this was a place where gays frequented and at first it was awkward because we're not \"urban\" people so we're rarely around that. But it didn't bother us at all, everyone seemed to mind their own business! Also the hotel charged us a fifty dollar deposit in addition to the night's rate which they did not tell us about. I didn't like that. The gentleman that worked the desk in the evening hours, older with glasses, used to be in the Navy - he was great, very nice, always smiling told us about the remodeling which made a lot of sense to us! He made sure I was able to connect to the internet with my computer! To the management/owner of the hotel I would like to say to you that instead of always making excuses for the things people did not like at your property, If you would just be forthcoming with things and at least consider making changes and stop blaming your guests for the mistakes, I think it would make your property a lot better. I can tell you that by the time we left, we agreed that we didn't hate it but we definitely would never go back, unfortunately!", "Date": "March 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "california", "Title": "“Great Location, small hotel right on Contado Beach.”", "Author": "dougm_95060", "ReviewID": "UR58990166", "Content": "Found this hotel after researching for first time to Puerto Rico, and was quite impressed with staff's prompt courteous responses to reviews. Altantic Beach Hotel was exactly as reviewed, and perfect for us: a straight late 50's couple. 2* hotel, with 3 or 4 * ocean view room. No noise at all, only ocean sounds. Although hotel shows its wear and age, especially elevator (which actually works perfectly), staff is in process of renovation, and they are very thoughtful of guests. Yes, it is gay friendly, which I have no problem with, but they are extremely accomodating and welcoming with everyone we saw. There are many great small restaurants close by, as well as Walgreens, casinos, gym, etc, and bus line to Old San Juan. The staff quickly sets up beach chairs and umbrellas right on sand for guests, and beach waiter brings drinks from the bar. As far as negative complaints I've read, I saw no rudeness from any of the staff. Criticism of the weather or waves too big are pointless. Atlantic Beach Hotel feels like a European 2 * hotel or Mexican, all of which we prefer to bland mega-hotels with their rude tip-hungry staffs.", "Date": "March 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gibraltar", "Title": "“Stunning location, great value for money!”", "Author": "StMawganE14", "ReviewID": "UR58361265", "Content": "We booked a two night stay at the beginning of a vacation from Europe to Sint Maarten. After a long flight from Madrid we wanted to get to the room and then go for dinner. Check-in was handled efficiently but without much of a warm welcome. The ocean front room was in good order with a reasonable sized bathroom which was clean and well kept. This hotel wins on location and value for money. Beachfront in Condado for this price cannot be beaten. The hotel needs refurbishment (this is obviously happening on the 2nd floor) but the elevator, reception and front of the hotel could all do with a careful makeover. Over our couple of days we used the hotel bar on a number of occasions and found the staff and the atmosphere friendly and welcoming. We will definitley return when next in Puerto Rico.", "Date": "March 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Texas", "Title": "“Friendliest budget place on the beach”", "Author": "TexasSanantonian", "ReviewID": "UR56750590", "Content": "O;K. this will be a strange review because we did not stay there. As first time visitors to S.J. we stayed in town , not knowing the facts about the beach. We were surprised to find that Condado is a wall of condos and hotels and that access is limited. We rejected the public entry because of limited facilities and were so delighted to find the Atlantic Beach where we \"shot it straight\" that we needed to rent chairs and an umbrella, use a restroom other than the ocean, and wanted access to a bar.. They could not have been friendlier nor more accommodating. We went there for 5 days and were treated as well as guests. Although this place is reviewed as \"gay friendly\" we just found it completely friendly and would recommend the hotel to anyone on a tight budget My wife and I will definitely consider it for a future stay .", "Date": "February 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Atlanta, GA USA", "Title": "“Great location â€“ Friendly Staff â€“ Good Value.”", "Author": "GumbyPTC", "ReviewID": "UR56609384", "Content": "This hotel is not new, and it is not a full service luxury hotel. We were on a floor that is not yet refurbished, and the furniture was well used but in good condition. With that said, we stayed in a hotel on a prime beachfront location with a beautiful ocean view for 1/3 to 1/4 the price of other beachfront hotels in the area. So, of course, you must have realistic expectations. The hotel is in close walking distance to countless restaurants, bars, casinos, and shops. The staff was friendly and professional. They were attentive and catered to our needs from check-in to housekeeping to the beach and bar staff. A beach attendant set up loungers and beach umbrellas upon request - all provided at no extra charge. He also made runs to the hotel bar. The rooms were basic but very clean. I spend roughly 5 months a year in hotels for business. This is the first time my bed spread/comforter was changed with the bed linens. The mattresses were comfortable and appeared to be new. The only complaint that I have is that the hallway is noisy and you hear other guests coming and going. If you have discourteous guests in the hall at night, it is really loud. My wife, college age daughter, and I had a pleasant stay and will return.", "Date": "February 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oakland, CA", "Title": "“European-style simple hotel with amazing location”", "Author": "MarkOakland", "ReviewID": "UR56054220", "Content": "We did a tour of the island staying at various places from large resorts to small independent hotels. This was one of our favorite locations. We planned to stay at the Atlantic Beach at the beginning and end of our stay but due to problems with storms on the East Coast, we had to cancel our initial reservations at the Atlantic Beach. Because we did so within their deadline (two days in advance) and in writing (by email), they were fine with accommodating our change in plans. So finally we only stayed there two nights. It would have been easy to stay longer at such a great location. The good: Our ocean-view room felt like it was in the surf. AMAZING. The first night we left our windows open at first, and I realized I would never sleep, the roar of the ocean was so loud. But when we closed the windows, the ocean sound was perfect. The building has central AC so closing the windows wasn't a problem. The rooms are small but clean, the bathrooms likewise ( though with good-sized showers - no tub). The not-so-good: Our room was next to the stairs so I was awakened by doors opening and closing and a few people talking loudly. One thing the hotel could fix would be the 1st-floor door which tends to slam. The door on our floor had a hydraulic closer to keep it quiet, hooray . The beds were fine but a little short for 6'1\" me. The elevator is old and rather loud too. If you are driving, parking is a little challenging, though the hotel helps you to work it out. We didn't use our car much because we weren't sure there'd be a spot for us when we returned - though there are parking garages nearby. The beach: The hotel provides beach chairs with an attendant so you can leave your stuff and go play in the surf. In February, the surt was pretty intense with a significant undertow and cross-currents. I had a lot of fun swimming in it but still had a couple of disoriented moments. My partner isn't a strong swimmer so I was glad that he mostly wanted to sunbathe. I found a couple of buddies to swim with so that somebody was paying attention if I ran into trouble. If I had kids, I wouldn't let them in the water, at least not at this time of year. When you come up stairs from the beach to the terrace bar, there is a place to rinse your feet, but it would be nice to have a shower there as well. The bar: We're a gay couple and enjoyed meeting people at the terrace bar downstairs which is right above the beach (a fun place to watch surfers). It was a mixed crowd, mostly gay men but not exclusively. The bartenders were friendly and attentive and the drinks were reasonable (especially during happy hour). There is a second terrace on the top floor of the building that we pretty much had to ourselves - super view! Would be nice to see it get renovated and used more. It has its own bathroom and shower as well as laundry facilities (washer, dryer, iron and ironing board - could use some attention). The area: Condado is close to everything - Old San Juan, the Plaza de Las Americas, etc. There are lots of restaurants within walking distance. We also walked to some gay bars in Santurce. You need to be street-smart to do that, but otherwise it's not a big deal, there are quite a few places to check out . I wasn't crazy about restaurants in PR in general, kind of pricey and not so special, but we had some OK tapas at Miro, and excellent lechon at Varita (better than what we tried in Guavate).", "Date": "February 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Michigan", "Title": "“location is the attraction for this hotel”", "Author": "jga_mcleod", "ReviewID": "UR55420019", "Content": "The location is right on the beach and close to everything that you might need during your stay. It is a short bus ride to Old San Juan. They are in the middle of renovations and it does take away from my ability to rate what it will be once it is finished. They need to spend more time paying attention to details, especially the lobby area it needs to be spruced up more. The room was small but up to date and clean. If location is your main concern then for the money it is a great hotel.", "Date": "February 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vermont", "Title": "“A Great Success”", "Author": "vtnorth", "ReviewID": "UR55323399", "Content": "When our taxi turned onto Vendig St. my wife and I crossed our fingures. Our first view was a narrow street with building construction going on and the 'O' was missing in Atlantic Beach Hotel. I had been in SJ while in the Navy back in the 60s and I really wanted a nice experience for my wife. And....that is how it turned out....very very nice. The rooms are small but newly done over and very clean. The beds are only double beds with matresses that could be more firm but we managed. The folks who work there are friendly with a capitol 'F' and very helpful. Being next to the ocean, a few steps from three casinos and a 75 cent bus ride from everything in the city; we could ask for nothing more. We plan to return next year.", "Date": "February 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Manhattan, NY", "Title": "“Dont Believe The Pictures On Their Website!”", "Author": "aastevison", "ReviewID": "UR54953620", "Content": "First the good- The hotel has a perfect location...directly on the beach and within minutes of old san juan, good eats, and popular nightlife. The hotels bar staff were top notch! Very friendly, adorable, and welcoming. Now the not so good- The hotel front desk staff. We got to the hotel after a very early flight, when we arrived the front door attendant was sleeping. Very secure feeling. The \"management\" staff was the rudest, most incompetent, bumbling set of fools I've ever come across. When I booked the room based off of the great price and the newly redone rooms (as the pictures would lead you to believe) i had no idea what truelly was in store for me. The room was tiny, by any standards. The tv was tiny and with no remote. (Not that a remote would have been usefull, you could touch both walls of the room with your hands extended.) The AC was not individually controlled and thus felt non existant. I attempted to approach the front desk manager and ask him to help me clarify the error that was made. I told him that i booked the room that came with two beds; his defense/responce was that i didnt book the \"ocean view room\". There was a distinct difference and I was clear in what I had booked. I called Orbitz and asked them to help me; the end result was the management told Orbitz if I wasnt happy with the accomidations that I could leave immediately. Thats customer service! They down right lied to Orbitz and told them I was in the upgraded room! What upgrade? The Hotels elevator was a throw back to colonial times; actually I think Chris Columbus must have used it. It felt like an electric casket...a smelly used one at that. Basice amenities- no toothpaste, shampoo, microwave, fridge, hair dryer...anything. Be thankfull you get a towel. The surrounding area (meaning right out the front door of the hotel) was apparently the neighborhood prostitute hangout. Puerto Rico, the people, the beach, the country side are all worth it, so at the end of it all does the hotel make that much of a difference? Heres what I've learned; you get what you pay for.", "Date": "February 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "boston", "Title": "“Just OK”", "Author": "shredBoston", "ReviewID": "UR54422323", "Content": "This is a well located, small hotel right on their little section of beach in the Condado resort area - 15 min walk from Old San Juan. Very small rooms with no chair or desk. Full size bed plus a single bed so the room was pretty crowded. Small Tv with cable. No internet connection. Clean efficient bathrooms - good maid service. nice desk attendants. Only public room is the outside, covered bar - no lobby to speak of and no food service at all. The place is a good deal for the price but there are NO extras in the hotel - you get your room, maid service and that's it. It's well located near many fine restaurants and will accommodate parking for your car if you're driving - for free.", "Date": "January 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "New York", "Title": "“I didn't think it could get worse! Website is all lies! Avoid at all costs.”", "Author": "BFNY1980", "ReviewID": "UR54361027", "Content": "So this was the second time we stayed at the Atlantic Beach Hotel. Back in 2009 we stayed there. The rooms were dirty and moldy but the weather was awesome and so was the staff. We didn't want to stay there again this year until I checked the hotel website and saw that they had renovated. This was also confirmed by the man I spoke with on the phone. We were quite surprised when we arrived and absolutely nothing was different. The website is a total lie. The pictures they have posted are so far from reality its scary. The staff has changed too. I'm assuming there are new owners or something. Last year the staff was amazing. This year the woman behind the desk, I think the owner, was terrible. The worst kind of person. She acts like she's running a boarding school. Also the cleaning staff attempted to steal my friend's iPod and I'm pretty sure he took off with my watch. It has yet to be seen and I never lose things like that. Bottom line: Do not stay here. Do not trust the website. But do go have a drink with Armando the bartender. He's the ONLY good thing about this hotel.", "Date": "January 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "New York City, New York", "Title": "“I should have heeded TripAdvisor... three-star price for a half-star hotel”", "Author": "kkua", "ReviewID": "UR53938973", "Content": "Because of the location (beachfront property), I wanted to give them the benefit of doubt. Boy was I was wrong. It all started with a lazy laissez-faire attitude of their staff and their web booking engine. Not only was it a non-secure site, it was not functional. The site is not Macintosh friendly, so I tried booking on Windows. I had to call them twice to remedy the problem before I could finally book for a simple overnight (Thursday around midnight going into Friday morning). Upon checking in, we thought we would have a nightcap at the patio bar before going upstairs. We then encountered a bunch of noisy gringos (20-something, brassy, sassy, loud, unrespectful, monolingual, obnoxious -- the stereotypical ugly American). After a quick gulp of the cocktail, we immediately left for the room (302). Avoid this room at all cost. The window was painted shut (and so was the subsequent relocated room) and the air vent was not functioning. They had the gall to ask me another US$100 for an upgrade to a bigger room, even when I'm only there for one night and the room was available. So, as a compromise, they moved us to 308. Got a loud awakening at 5am when the neighbors waddled into their rooms drunk (hallway and doors not noiseproof). The management mentioned there's an outside shower facility by the upstairs sundeck (sheltered). They allowed this for guest use, great particularly for late departing guests (flight at 8pm). Unfortunately, because of the storm, the shower curtain flailed everywhere, making it almost impossible to take a shower. No towels, soap or shampoo were provided (thank goodness I asked housekeeping earlier in the morning). Be sure you shower with some flip-flops... pebbles and sand everywhere. The patio area is also filled with broken glass. Only saving graces are free WiFi and the patio bar at the lobby. At US$105 per night plus an additional $40 in cabfare, I would almost prefer sleeping over at the YMCA or at a coushsurfing.com host. Video of stormy patio: http://www.youtube.com/watch?v=3jUtyNgArE0", "Date": "January 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "puerto rico", "Title": "“This place is disgusting and i didnt even went into the room”", "Author": "franchescaPuertoRico", "ReviewID": "UR53539970", "Content": "I made reservations with my husband so we could relax and have a weekend getaway. As soon as we enter the hotel i was disgusted. The floor was dirty like i hadn't been clean in months, the person that was in front desk was very rude. The pictures that they have in their website are very deceiving. Thank God that there was a problem with the reservation and we stayed someplace else. I wouldn't recommend this place to anyone it look like a cheap motel.", "Date": "January 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York City, New York", "Title": "“I'm not gay but this is the place to stay!”", "Author": "whiltelotus", "ReviewID": "UR53421615", "Content": "I have been traveled a lot and stayed many type of hotels from 500 rupee per night in India to 500 US dollars per night in Manhattan and Tokyo. It was the first trip to PR. I stayed the Atlantic Beach Hotel for four nights. The location is perfect and I could really relax with the sound of waves at their ocean view room and walking beach. It was reasonable rate even during the high season. Staff are friendly enough and they always welcome and respect any guests. Whenever I had requests them something(to adjust AC, extra amenity, recommend what to do, etc.), they responded soon. I will stay this hotel again when I have an opportunity to visit PR.", "Date": "January 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "new york", "Title": "“love that place”", "Author": "maryse718", "ReviewID": "UR52979976", "Content": "My 5th time at the Atlantic beach hotel;love the location,the so nice staff and what a great surprise this year,big renovation;the rooms are freshly redone,new bathrooms,new furnitures,new linens and the beach have new furnitures as well,I didn't want to leave ;I will be back very soon especially for the low price they charge;", "Date": "January 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Orlando, FL", "Title": "“I would consider other places...”", "Author": "idontfindscreenname", "ReviewID": "UR52791064", "Content": "The hotel is located in a very convenient spot of El Condado. I completed the reservation by means of their website. The total amount was $258.33 (including taxes) for three nights which I found cheap for a hotel in this area. However, they charged me without notice a $50 deposit which was refunded after my check out. I stayed in room 304. This room was very small, does not has at least a microwave, the TV was very old. The cable company is okay. The beach is nice, but the weather was not favorable. There was high speed internet in the room as well in the bar downstairs. I think that I paid too much for the quality of service received in terms of room, facilities and overall customer service. When I chose this hotel I thought that it was like a motel, but it is more like a guest house. I am a Florida's resident. According to my experience in Florida, I am completely sure that for the same price I would receive a better quality of service in similar areas like Miami/Fort Lauderdale/West Palm Beach.", "Date": "January 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "brooklyn", "Title": "“great place ,clean, nice atmosphere ,friendly staff”", "Author": "elieBrooklyn", "ReviewID": "UR52759719", "Content": "great place on the water walking distant to a gym .friendly staff very helpfull in guiding for restaurant and tourist site", "Date": "January 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New Hampshire", "Title": "“Hotel is Practical, Efficient, Friendly, Affordable and with an Excellent Location.”", "Author": "GringoNewHampshire", "ReviewID": "UR52262585", "Content": "Ten minutes and $15 from the airport, this hotel is ideally located from anything one could possibly want in a Caribbean getaway. There is no need to rent a car as everything is nearby. This affordable, unpretentious little place is undergoing some renovations, so if a little dust in the hallway is a problem to you, then spend three times more next door at the huge Marriott. Right on a beautiful beach with lounge chairs and umbrellas, mix with other guests or locals in the hotel club, or at the daily beach party, or keep to yourself. Vendig is off Ashford street and has every type of store, restaurant, and American amenity from Walgreens and Starbucks to Cartier, Gucci, Ferragamo, and Louis Vuitton. Deco architecture and local art are everywhere, and Old San Juan is a few miles away. It's a safe walk if you want some exercise, and you will pass other beaches as well as find many health conscious Puerto Ricans jogging at all times of day and evening. If you're a family or want a walled, locked-in-fortresses with no connection to the local atmosphere, culture, or vernacular, then this is NOT the place for you. If you're a single or \"young\" open minded couple who like easy-going places with real flavor, interaction with the locals, and proximity to just about everything, then I would suggest the Atlantic Beach Hotel.", "Date": "December 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Miami", "Title": "“GREAT VALUE FOR LESS , AWESOME”", "Author": "miami305_305", "ReviewID": "UR52145864", "Content": "I saw all the reviews and I did not wanted to pass throught that place. A few friends of mine called me and invited me to pass the day there, so I did. When I entered the lobby I expected something nasty but when I saw It was actually really nice. I spended time in the bar which has an expectacular view, and some pretty hot bartender's in the night time LOL. I decided to stay there because that's what I wanted, a place close to the beach and gay party's and clubs plus the staff it's so nice and helpful specially Manny and Armando. If you plan to stay somewhere close to everything, clean and nice I recommend this hotel.", "Date": "December 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Las Vegas", "Title": "“Great Venue, Good Value, Friendly Staff”", "Author": "Johninvegas", "ReviewID": "UR51638195", "Content": "We were stayingin downtown San juan and accedently came3 across this quaint hotel with a bar overlooking the beach. It is modest in terms of the facility, but decent and clean. I'd recommend it to anyone who just wants to hang on the beach for a reasonable rate and friendly staff. Gay friendly, but not esclusively so.", "Date": "December 21, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "San Francisco, California", "Title": "“Dumpy, Run Down, Dirty - what a shame!”", "Author": "lewisgm", "ReviewID": "UR49862190", "Content": "This place is kinda like an aging starlet who has lost her looks but keeps trying to party with the A list. I kind of don't get it. This place is in a GREAT location and has so much potential that I don't understand why the owner does not fix it up. On the good side, it's right on Condada Beach. You can walk to the waves in 15 seconds. And the air conditioning kept the place nice and cool. Maybe even too cool. But on the downside, where can I start? The paint is chipping/peeling, the it does not look like it has been redecorated since the late 50's, the window in my room was dirty, the carpets looked like they were about 25 years old, the plumbing was weak and made noises like it was struggling, the bathrrom was musty and had mildew. The TV did not work. It was not a hell hole but it was kind of dumpy. I would not stay there again.", "Date": "November 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "FT. LAUDERDALE", "Title": "“it's basically all true”", "Author": "CHALEA", "ReviewID": "UR28293391", "Content": "i read all the reviews and thought how bad could this place be? nasty queens on the internet? fussy about everything?? im a seasoned traveler..high to low end depending on the city and my needs at the time.. but i have never scraped the bottom of the barrel until now!!.. really.. just about everything you read here is true..the hotels a dump..run down and rust everywhere.. tv didn\"t work but fixed quickly.. hot water luke warm.. filthy floors ect..theair was fine on the second floor.. the staff however was awesome from the front desk to the bar.. so where did we go after paying $ 86.00 for this pit... 2 blks away to the holiday inn express wich is brand new..and average night 114,00 night.. fresh clean breakfast included.. and CENTRALLY LOCATED ALSO.. staff is awesome here.. and very very gay friendly.. down to the management!!.. questiions email me.. a ft. lauderdale traveler!!", "Date": "April 18, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "South Florida", "Title": "“AVOID THIS PLACE LIKE THE PLAGUE!”", "Author": "isail7c", "ReviewID": "UR28100833", "Content": "This hotel is THE WORST hotel I have ever stayed at! I am a mariner and I have stayed at hotels all over the world on the company nickel so likewise, I don't see the greatest places when I travel for business but this place takes the cake! We stayed 6 days and had to change rooms 3 times due to malfunctioning AC equipment-they have some sort of funkadelic floor by floor system that was so choked up with lint that I could have written WASH ME on one of the walls in my room. The shower had black mold growing on the times, the towels-some provided where so thread bare that it looked like fishing net. The furniture has not been updated since the early 70's. This place needs to see the good side of a wrecking ball to put it out of it's misery. Either the hotel owner is waiting for a good offer from a property developer or there is something new in slumlord hotelier school! Really this place at 90 bucks a night is criminal in what they are trying to get away with. i will say that the people working there try and ave very polite and attentive-the beach bartenders in particular but if you have the choice and are on budget travel-try to spend a little extra somewhere else! The place is a mess and should have it's license revoked by the local hotel commission. I just read this flight attendent's review and am amazed at his take on the place-oh well-to each his own I guess!", "Date": "April 15, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Fort Lauderdale, FL", "Title": "“Hated it!”", "Author": "robo17", "ReviewID": "UR24644863", "Content": "The hotel was dirty and out of date. We could not get maid service for three days and called five times for fresh towels after two days. There are no services available and the hotel is run like an army barracks. The staff is not friendly and being billed as a gay hotel it was a major disappointment. Stay at the Holiday Inn for a reasonable price and skip this hotel completely.", "Date": "February 16, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Jersey City, NJ", "Title": "“Run Down Hotel and Racist Staff”", "Author": "jerseyboi2009", "ReviewID": "UR24385690", "Content": "The hotel staff is very unfriendly. Hustlers hanging out in front of the hotel. Rooms are dirty without any climate control so room is either too hot or too cold. Mattress had bed bugs. They used to serve breakfast in the morning but not anymore yet rates are the same. Not recommending this for anyone unless all you care about is staying in the gay hotel", "Date": "February 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New york", "Title": "“people make the place”", "Author": "bigg1000", "ReviewID": "UR23461960", "Content": "It's an older hotel on condado beach. The hotel is in need of repair but I agree with the last review,the people are the attraction that will bring me back. The service was great and the front desk clerk Jon Pierre was very helpful checking me in and a wealth of information on the area and night life. I don't know what I would have done without him. The bartender was helpful and the morning crew aswell. Over all I had a great time and the rooms are 79.00 per night, near some of San Juan's best night life,anyone who books a place for that price need to understand its not the Marriot. I will be returning in march of this year.", "Date": "January 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Earth", "Title": "“Great location, outdated hotel”", "Author": "burbujasdeamor", "ReviewID": "UR23422361", "Content": "Location is perfect - right in the middle of Condado, right next to the beach. We had no problems with security like some of the other unfortunate souls. The staff and manager were super friendly and helpful, which was necessarily since the property is so outdated and many things were out of order: the elevator, key didn't work in our first room, TV sets half broken, leaky faucet/shower, etc. If it weren't for the location, I wouldn't pay $115 for the tiny room. Just go to the beach, use their beach loungers and buy drinks from their bar (friendly bartender will come to serve you).", "Date": "January 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Dirty and dangerous fun”", "Author": "coreychambers", "ReviewID": "UR22795215", "Content": "Unfortunately I have to give this fun gay hotel a bad review due to two major problems. The first problem was the gay-bashers/robbers hanging out right outside less than 50 feet from the front door. The second problem was the dirtiest floor that I have ever seen. The manager gets kudos for making an attempt to keep an eye on the suspected gay bashers/robbers. I did not complain to the management about the floor because I am not Puerto Rican and thought that dirty floors might be part of the culture. After all, American floors are usually dirty compared to Asian floors, for instance. The good news is that the Atlantic Beach Hotel has a fun nightlife, with a built-in bar. So, if you like bars, this can be a fun visit. My favorite part was the beachfront continental breakfast that was included -- only to be topped by the very attractive Puerto Rican native young man that I met for a brief, but very memorable romance. I can only recommend this hotel to the most foolhardy of nightlife-lovers. The average traveler might prefer a cleaner, safer hotel.", "Date": "December 17, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Atlanta, GA", "Title": "“Worst Stay Ever at the Atlantic Beach Hotel”", "Author": "tenpepper", "ReviewID": "UR22350113", "Content": "It was my first stay in the Condado area and it being a short weekend trip I wanted to be on the beach. Therefore, I left a much nicer, yet less expensive hotel a block away to be at the Atlantic Beach Hotel. Within minutes of checking in, my wallet, credit cards and all indentification cards were stolen from me in the middle of the day near the bar area of the hotel. It is not that I hold the hotel responsible for this (however, one would like to think that he/she was safe at the hotel), I got absolutely no assistance from them and had to seek out the police to file a report on my own (not that they were anymore concerned than the Atlantic Beach management and staff). Luckily the hotel had secured a credit card hold for my room. And although they had secured a much higher limit than the rooom rate, they absolutely refused to add a incidental (taxi fare) to the room charge to get me back to the airport. Basically I was stranded and it was the hotel's attitude and lack of concern that bothered me, especially since the theft took place on their property. The next morning when I did check out and tried again to get the hotel to add the incidental (taxi fare) to the ticket before it was closed out, the lady would not, nor would she call the manager to get apporval to do it. When she gave me their copy of my room charges for me to sign, I wrote on it that my credit cards, money and ID's had been stolen while staying there. The lady got furious at this and started yelling. After being told that the room had been billed successfully to my credit card, I had had enough of the Atlantic Beach Hotel and staff. I left without being given a copy of my room charges. It was my decision to leave a better hotel a block away to stay at the Atlantic Beach Hotel. And if it had not been for the theft, I would have accepted everything, even the extremely small, poor condition, over-priced rooms and would have had a good time! It's just the NO-CARE attitude from the management toward their guests is bothersome. One other issue I had was trying to get back up to my room as guests have to be buzzed back in. However, the desk staff were never at the desk and were out on the street talking to other people. Once inside, I felt like I was in a high school dorm on lockdown as guest are not allowed upstairs. You can not despute that the hotel is in a great location and that the bar area is fun and that the barbacks are the BEST. Nevertheless, I would recommend to anyone that they stay at another of the many hotels in the area and experience the Atlantic Beach Bar without staying at the hotel !!! Lessons learned ...and I learned the hard way!", "Date": "December 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, FL", "Title": "“Awesome Hotel!”", "Author": "Scorpiofl", "ReviewID": "UR19124811", "Content": "If you are expecting the Ritz Carlton, then book a room with the Ritz Carlton. The Atlantic Beach Hotel is a true Puerto Rico experience. I am big on cleanliness but Puerto Rico doesnâ€™t have the level of cleanliness as we do in the states. The good news is that the room was clean and you can bet I inspected it as soon as we checked in. Iâ€™ve been several other places in the Caribbean and they all have the same level of cleanliness as PR. I understand that everyone in different parts of the world doesnâ€™t live like we do. The hotel could use some polishing but so can most of the city. Itâ€™s a great tropical experience with beautiful beaches. The positive: The hotel is quaint, convenient, clean, FRIENDLY, very gay friendly, thereâ€™s a bar on the beach and itâ€™s affordable. I read all the reviews before booking a room so I called the hotel and addressed it THREE different times to make sure we would not encounter any of the things I read. They were very much aware of the online reviews and they were very concerned about their reputation. I could tell they were genuinely concerned about what I read and they assured me I would enjoy my stay. I actually think I met most of the staff and can name them all by name which would indicate they had a positive impact on our stay. There were four of us so we had two rooms and the hotel staff was right, we did enjoy our stay. Both our rooms were clean, the sheets were clean and anything we needed, the hotel staff took care of it immediately with a smile. The front desk person actually came up to our room shortly after we checked in to make sure our rooms were ok and to see if we needed anything. Yes itâ€™s correct; you cannot bring â€œtricksâ€� back to your room. Theyâ€™ve had a problem in the past with â€œhustlingâ€� so this is their way of eliminating shady business from taking place in the hotel. I totally understand and can appreciate their efforts to keep shady business out. It is perfectly located in Condado which is an area of San Juan within walking distance to many places in the heart of the tourist district. For $115 a night for an ocean view, you canâ€™t beat the price, location or individual attention you get from the staff. We WILL definitely book a room at the Atlantic Beach Hotel again next time we come to Puerto Rico. Thank you, thank you, thank you to the hotel staff for making our stay in PR an awesome one!!! Thanks to Emanuel, Joel, Nancy and her daughter, Dedrick, Jorge, Armando, Ernestoâ€¦I hope I didnâ€™t leave anyone out!", "Date": "August 19, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "winston salem", "Title": "“Dirty and Gross”", "Author": "wsguy", "ReviewID": "UR18261152", "Content": "If you are thinking about staying at Atlantic Beach, please reconsider. I stayed a week at this dirty hotel and could not wait to check out. The hotel refused to give us back our money if we checked out because we made reservations. The hotel is outdated, dirty, and just plain gross. The elevator is dirty, look at the light when you step inside plus it is slower than my 90 year old grandma. The beds are uncomfortable, the room was dirty, the floor was gritty with sand, and we found a used condom on the floor. We didnt even have a tv remote, microwave, iron, coffee pot, or a refrigerator. Plus the hotel was being renovated upstairs. We were NOT told of the renovation as we heard hammers and drills all morning. I also caught the desk clerk asleep at 3am when I went out for a snack. Another night I asked for towels 2 different times and the front clerk forgot. He never did bring the towels. Dont stay there. Trust me one step into this dirty hotel and you will know exactly what Im talking about.", "Date": "July 25, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "brooklyn, new york", "Title": "“Disgusting Room...Great Location”", "Author": "cosmicorbit", "ReviewID": "UR14706132", "Content": "The room at this hotel was absolutely disgusting. Stained sheets, dirty carpet, rusted ceiling fixtures, the bottom of the bathroom door was missing and there were hairs in the drawers. We were told that the room might not have been cleaned because the rooms aren't always used (I wonder why). They would not change our room. Only good thing about this hotel was the location. It was great. However, I would absolutely never never ever stay at this hotel again. The first night, I woke up 4 times afraid that something would crawl on me.", "Date": "April 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Check in / front desk": "5", "Overall": "2.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Hartford, CT", "Title": "“Just a regular hotel...”", "Author": "DORC68", "ReviewID": "UR14287133", "Content": "The front of the hotel seemed nice. The lobby needs a face lift but while we were there they were painting. The people at the front desks were very friendly and so were the bartenders. Our first room was very dirty and our view was an old abandoned building and we decided to upgrade to a bigger room with the ocean as our view but this room's door kept getting jammed inside and out. We couldn't get the key to turn and we struggled with the door for about fifteen minutes, finally went to the front desk and the guys assisted us. Funny how a place that makes lots of money cannot get a locksmith or change the locks. The only great things about this place is the location (four blocks awasy from fine shopping) and two blocks away from where the bus stop was to take the bus to Old San Juan. Also the bar is on the back of the lobby with the ocean view so one does not have to venture far for great cocktails. The beach is literally your own back yard which was great. The roof top provided beach chairs and great views and a shower but the place was dirty. Don't expect a four or five star * hotel.", "Date": "March 14, 2008"}, {"Ratings": {"Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Houston, TX", "Title": "“She was nasty even a decade ago, or so I now hear.”", "Author": "storkdoc", "ReviewID": "UR14024873", "Content": "DO NOT STAY AT THE ATLANTIC BEACH! The rooms were filthy. They apparently have zero interest maintaining the property, as seems to be the case on much of the Condado. The rooms were small (approximately 10' by 10'). Bar prices were outrageous. My significant other nearly castrated me when he set foot in the room. I wouldn't call it a \"roach motel.\" We didn't see a single roach. Roaches have to much pride. I stayed there because it's where \"family\" stays, for 2 nights pre-cruise. Never again. AVOID THE ATLANTIC BEACH!", "Date": "March 3, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Cincinnati", "Title": "“looks seedy and uninviting”", "Author": "Rivieraboy", "ReviewID": "UR13017146", "Content": "One thing I have to mention is that the wonderful Regis (bartender) is unfortunately gone. Other guys are good, but this business will definitely suffer without Regis. He was the only reason we came over to hang out at the bar even though the bar itself didn't look all that great. (we stayed at the Caribe Hilton). The beach is very nice in front of the Atlantic Beach hotel.", "Date": "January 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Overall": "4.0", "Value": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Great Location, Great Staff!”", "Author": "brand11", "ReviewID": "UR8217118", "Content": "We recently stayed here before and after a cruise. While the facilities may not be 5 star, the location and friendly staff more than make up for that! The hotel is located right on the beach with free beach chairs available to hotel guests and beach towels provided after leaving a refundable deposit at the front desk. The bar also overlooks the beach and is great for people watching or sitting back with a drink and enjoying the waves. The staff went \"above and beyond\" to make sure we were comfortable and were very friendly. From Chris at the front desk, Dedrick at the bar, Carlos serving drinks on the beach and providing lawn chairs, to Gabriel working the bar......everyone was outstanding! If you are looking for a 5 star hotel with impeccably decorated rooms, this is not the place for you. But if you want an affordable, clean room right on the beach with a bar on premises and an outstanding staff, you would very much enjoy the Atlantic Beach Hotel! I know we will be back!!!!", "Date": "July 22, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "arlington,va", "Title": "“Remember, It's not a 5 star hotel”", "Author": "BRGA", "ReviewID": "UR7939000", "Content": "It's located between 2 abandoned hotels. A lot of guys hang outside the hotel starting around 10 pm. The elevator does not work, if you want to use it for your luggage. My friend and I stayed in a non ocean front room. It was very tiny, the AC is always blasting, the bedsheets as well as bath towels had stains on them. The bathroom was dusty and very small, no windows to let the heat out. There are no microwaves or refrigerators anywhere, so if you're going to eat out, which most likely you will, eat all of it at the restauarant. A lot of our food went to waste. The staff were very nice, they have people at the front desk 24 hours. Watch out for the $3.50 cans of soda at the bar. Not the best place to stay, We definetely would not stay there again. You have Walgreens, restaurants, souvenir shops, and starbucks in the neighborhood.", "Date": "June 19, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Innkeeper in Massachusetts", "Title": "“worst place in Puerto Rico”", "Author": "Dikkk", "ReviewID": "UR7715497", "Content": "San Juan, Puerto Rico Atlantic Beach Hotel Date: March 10, 2005 Seemed nice when we arrived, we were told to drop the key off at the desk when we went out and pick it up when we came back, so we did. Upon returning after an afternoon of shopping, I went to pick up my key and the desk clerk claimed that I did not leave it off. I explained that I was only gone for an hour and I did leave the key with him. He got very rude with me and flatly refused to issue me a key without paying a $50 fee to replace the key. I had to pay the fee to get a key to my room. He handed me what looked like the key that I dropped off. { who really knows}. He was very rude and raised his voice to me when he refused to give me the key. I feel that I was scammed out of $50 and refuse to stay at this hotel with what appears to be a very unprofessional staff with bad public relations.", "Date": "May 30, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Rooms": "1", "Location": "1"}, "AuthorLocation": "riverside CA", "Title": "“Don't Do it!!!!”", "Author": "lorencito1", "ReviewID": "UR7585735", "Content": "Don't Do it! if you coming to puerto rico to enjoy the beautiful Island do it elsewhere.. This hotel is located between two abandoned hotels. The rooms are dirty , hallways are dirty. entering and exiting hotel is like a prison..or a pawn shop... you have to be buzzed in... you are not allowed to bring anyone to your room, no friends, visitors no one unless you pay $15 extra per person. First time i stayed there electricity did not work for half the day.. second time i stayed , water did not work for a full day.. we finally checked out of our hotel and are now disputing charges with credit card companies. Stay further down the street at hotels like \"holiday inn express\" much cleaner with a pool.. its walking distance so you can still enjoy atlantic beach bar or the gay beach.. but honestly this hotel is miserable.", "Date": "May 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“GREAT TIME”", "Author": "Fllblueguy", "ReviewID": "UR7294044", "Content": "My partner and I stayed at the ABH for a whole week. We had plenty of fun. It is true the hotel has some problems, especially how clean the rooms are, but was not that bad. They are little things that should be change ASAP like : 1- Ceiling Fans at the lobby 2- Iron board and Iron 3- Just dust the walls of some rooms. I dont know why people mentioned that the staff was rude. Everybody, from the lobby to the bar were very friendly and helpful. The location is great and the bar is right on the beach. Remember this is not a 4 star hotel, but has GREAT potential. The continental breakfast is very good and FREE. The hotel has this rule not to let anybody other than guest go to the rooms for security purposes and I understand that, but also we are adults and we are resposible for our actions. They have a very nice area at the PH level that can be use for many activities, but for some reason they dont use it. I will love to bring some friends and have coctails upstairs. The new bartender Regis (from France) is really, really good and I am sure he will bring many positive things to this hotel. Something else was the drink prices. For bacardi coctails it was a little bit expensive and also the drinks are week. I want to see a littlebit more rum on my PiÃ±a Colada. For the price that we paid, especially in high Season it was pretty good. Just to seat at the bar looking at the beach its priceless. I think the hotels is going to improve little by little for better. Also they need more than one person for the afternoon, only one person was at the bar and arranging chairs at the beach at the same time. I defenetely recomend the Ocean View rooms. Water pressure was very good for showering and closets were very good size. The beds were very clean as well as pillows. In general it is a nice place to stay, especially for the price. Everybody was very nice and we had a very good time. Also the beach is the best around. Other very pricy hotels around do not have the nice beach out front like the ABH. They also provide you with the beach chairs, umbrella, and towels. One of the managers was always very friendly and making sure we were ok. If you want to spend $300 a night at the MArriott ( room are old anyways) go ahead, but is not worth it. The Atlantic Beach Hotel was good enough for us and we had a lot of fun. We will come back again soon. :-) Did I mention HAPPY HOUR??? Monday - Saturday 5 - 7", "Date": "April 8, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“What a Dump !”", "Author": "chgosfs", "ReviewID": "UR7280860", "Content": "EVERY bad review that you read about this place is completely true ... what could be a gem on the ocean is nothing more than a bad cold sore as far as hotel and management are concerned ... the problem is, is that management doesn't care AND what's worse, after people read these reviews many still stay there anyway ... there is absolutely NO reason too ... there are plenty of much nicer places to stay either in the Condado area or in Old San Juan .... If you're looking for good food and shopping stay in the Old San Juan area ....", "Date": "April 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "New York", "Title": "“A piece of dingy paradise”", "Author": "9ine", "ReviewID": "UR7246320", "Content": "The rooms are a little dingy, bringing your own pillow case is advised, but overall its cheap and you can't beat the location. The bar on the beach is to die for, and the beach it's self is really nice. The staff was really freindly and you cant beat the free continental breakfast on the patio over looking the beach. This place would be perfect if they would just clean their rooms more and get new sheets. If you just want a chill vacation on a beautiful beach this is the place to stay. Overall I would go back again in a heartbeat.", "Date": "March 29, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Oak Park, IL", "Title": "“Beware - Out Traveler review”", "Author": "LosGatosKyle", "ReviewID": "UR7245856", "Content": "My partner and I switched our hotel reservation to the Atlantic Beach after I read about it in OUT Traveler. What a mistake. The place was so dirty we refused to stay there - and this after looking at two different rooms. The first one had a ratty looking bedspread and a lumpy mattress. I pulled back the sheets and not only found pubic hair but semen stains. We couldn't believe it, hands down the grossest hotel I've ever set foot in. The bathroom was dirty as well and the lobby had peeling paint. The bar stools were rusted. And this was all after OUT Traveler said the bar had been renovated. We refused to stay and then they refused to refund my money until I threw a huge fit and refused to back down. This place is a dump. Ignore OUT Traveler's continual pushing of this joint - for what reason I don't know.", "Date": "March 29, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "miami, fl", "Title": "“Much Better Places to Stay”", "Author": "Theotherguy1", "ReviewID": "UR6809369", "Content": "It may be a gay hotel but the service is terrible. After 1 night I left and switched to the Hampton Inn. Sure it was a bit farther but they had no problems with gay clients, great service, and no problem having friends visit.", "Date": "February 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Diego, California", "Title": "“Atlantic Beach Hotel may be a bit rundown”", "Author": "skywaitress", "ReviewID": "UR6732500", "Content": "but overall it's not too bad. I stayed at the Atlantic Beach late last August 2006 for the first time in several years. I was really miffed because the management has decided to restrict who can come and go from the guest rooms -- for no reason I could asertain other than the management has decided to appoint itself as the gay moral majority. I queried the the manager (or owner -- he didn't identify his role at the Atlantic Beach, except he lives in the penthouse), and his response to my query about this policy was \"we don't want that here.\" Who is we? I will find other accommodation when I return.", "Date": "February 2, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Feltham, United Kingdom", "Title": "“Dark, dingy rooms with poor AC. Go somewhere else.”", "Author": "toandfromtheairport", "ReviewID": "UR6572977", "Content": "From the outside, this gay hotel looks clean. The room I had at the rear of the property was very dark, in fact to read I had to go into the bathroom. The decor was extremely outdated and the air conditioning had no controls and was not cool enough. A total makeover is required to make these rooms habitable.", "Date": "January 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Jacksonville. FL", "Title": "“Go somewhere else..”", "Author": "hardriderbabe", "ReviewID": "UR6438734", "Content": "Not all the way clean, stained sheets, smokey... No parking. We had to change from the 1st room to another because the bathroom was not clean. Bring shower shoes!! The AC was central regulated by the hotel, so even though we don't smoke, we could smell the other people smoking in our floor. Noisy and poor customer service. The only good thing is a great location, in the heart of the tourist zone, and with its own beach. Beach chair and umbrella provided. It was relatively cheap, considering location. If you have a little more money go somewhere else. If you dont care about sleeping in a noisy environment on a bad bed, save some money and stay here. Will NEVER go back.", "Date": "December 13, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "JERSEY CITY,NJ", "Title": "“this place is a shame”", "Author": "JJAY74", "ReviewID": "UR5702844", "Content": "i have to say that this hotel is in a really bad condition if you read the negative reviews all are true.i wanted to stay here because as a gay person love to support my people. the facility is very old needs alot of work i stay here for 5 days,my first and last time this place it`s a shame!! please sell this hotel to someone that really love gay people. if you go to puerto rico get a drink in this hotel bar and look around and you will see that everything is true. but DO NOT STAY HERE!", "Date": "August 23, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "New York, NY", "Title": "“Water is mixed into their liquor...illegal?”", "Author": "francesco212", "ReviewID": "UR5651692", "Content": "I've stayed once before and decided to give it a second chance. I won't make the mistake again. The property has gone downhill considerably AND IT WASN'T GREAT BEFORE...just a few snippets from my recent 3 day stay: 1. I was told I could park along the gym on the side of the building by reception (everyone else seems to park there too) and 6 hours later had a $75 ticket on my car. They apparently like to target tourists' cars, I had a Hertz with neverlost in it so it was obvious and the cars in front/behind me has no tickets. 2. The room was filthy. The air conditioner was rusted so bad that I'm shocked it had the ability to freeze me to death- as it did. 3. I changed my arrival date within 10 days and they almost refused the change. Poorest cust. service I've seen and I live in Manhattan! I needed to change my vacation dates due to a work trip which came up. NOW FOR THE ICING ON THE CAKE... 4. My friend doesn't drink so she ordered a pineablle juice and I had a single beer, 2 drinks = $16 ($8 local beer and $8 juice). I haven't even seen those prices in my 6 years in NYC (yet). 5. THEY ABSOLUTELY MIX WATER WITH THEIR LIQUOR. THERE ARE TINY BUBBLES IN THE VODKA AND TEQUILLA WHICH MAKE IT CLEAR HOW THEY RIP YOU OFF, ALL ASIDE FROM THE FACT THAT 5 HARD DRINKS WON'T EVEN GET YOU BUZZED. IF YOU DON'T BELIEVE ME THEN ORDER A SHOT (JUST MAKE SURE THAT THEY USE THE SAME BOTTLE AS THE DRINKS THEY POURED YOU EARLIER). F.", "Date": "August 21, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NYC, NY", "Title": "“FANTASTIC VACATION”", "Author": "sierraalta", "ReviewID": "UR5629945", "Content": "We recently stayed at the Atlantic Beach Hotel for 5 nights and very much enjoyed our entire stay at the property. The location is directly on the beach and within walking distance to some great restaurants. The staff at the front desk and bar employees treated us great. The maids were also very nice, although there was a bit of a language barrier at times we were very pleased with the way they cleaned our rooms and they always left us extra towels. We definately plan on returning very soon to Puerto Rico and the Atlantic Beach Hotel.", "Date": "August 20, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Temple City, CA", "Title": "“Great location and right on the beach”", "Author": "A TripAdvisor Member", "ReviewID": "UR5413538", "Content": "I had the pleasure of staying at the Atlantic Beach Hotel in June 2006. This hotel is right on beach. I found the staff to be extremely friendly. The hotel offers a dining area which overlooks the beach so every morning I enjoyed having my continental breakfast while looking at the fabulous ocean! The rooms were clean and the bed was comfortable. The weather was quite humid so the air conditioning was a comfortable relief. The patio bar is the best in the area for atmosphere, music, and view of the ocean. Bottom line, I had a great time and loved the Atlantic Beach Hotel.", "Date": "June 30, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "New York, NY", "Title": "“Hotel did not refund my deposit”", "Author": "A TripAdvisor Member", "ReviewID": "UR5207671", "Content": "I had a reservation for a two week say at the hotel. I heard of a government crisis and did not feel comfortable going to Puerto Rico at that time. I called the hotel about 10 days before to cancel my reservation. The hotel refused to refund me my two day deposit. They were not courteous to me or cooperative. I have been going to the hotel for years and would have gladly put my deposit towards a future day. The refused and were very nasty. Now I now why this hotel has so many negative reviews.", "Date": "May 24, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Bronx", "Title": "“Had A Great Stay At This Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR5041291", "Content": "I wont say this was an excellent hotel but I enjoy my stay for six days with my partner. Everything was convinent for us, we both loved the beach and the good service they provided. Just one bit problem and that was it was no refergerator in the room we were in which i believe was the Standard room but not much I can complain for good price.", "Date": "May 7, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Another Positive Stay at The Atlantic”", "Author": "A TripAdvisor Member", "ReviewID": "UR4771718", "Content": "We recently returned on 3/23/2006 from our fifth annual stay at the Atlantic Beach Hotel. Based on our past visits we have never understood some of the negative commente made about this hotel. We have always found more good points about this hotel than negative. This year we were able to book our reservation directly thru their web site on their new reservations system which we found to be very quick and convenient. All of the rooms we have stayed in over the past 5 years have been absolutely fine with ample space and always very clean bathrooms with plenty of towels. All of the staff is really very friendly and helpful and the service could not be faulted. The location is ideal and so close to everywhere that we have always wanted to go while in Puerto Rico. We look forward to our sixth visit next year, and we will continue to recommend the Atlantic Beach based on our past five stays.", "Date": "March 29, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Dallas, TX", "Title": "“Wonderful Hotel/Location”", "Author": "A TripAdvisor Member", "ReviewID": "UR4771539", "Content": "I just returned from Puerto Rico and a 15 night stay at the Atlantic Beach Hotel. I have to admit to being worried about booking such a long stay at this hotel after a few of the negative reviews. But from the moment I arrived I knew it would be a great place to stay. All of the employees and management made me feel right at home from the day I arrived to the day I departed. They were all so friendly and helpful, and couldn't do enough for me. The hotel's location is perfect with a good selection of restaurants close by. The Atlantic Beach Bar was really HOT, and was always a great place for drinks and meeting locals. All in all, I had a very positive experience at the Atlantic Beach Hotel and have already booked my return trip for July 2006.", "Date": "March 29, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "N.Y.C.", "Title": "“i had a good time”", "Author": "adventurer searcher", "ReviewID": "UR4737874", "Content": "I stayed solo at Atlantic beach for 8 days at the end of March, and had a great time. It may help to have a somewhat limited expectations. It's not the Marriott, which for me is a plus. It is a great location, on the beach, in the center of the Condado, lots of places to eat, shop, or hang out. There are hot bars and dance clubs in Santerce, just up the hill,and the spectacular Old City a short cab ride away. I had a room facing the ocean, (very clean) and really enjoyed that. The rooms are modest but comfortable. It's true that the airconditioning is cold and the only solution is to tape over the ducts but, so what. I didn't care, as i was at the beach all day, at the bar in the hotel for happy hour each night, and otherwise with my friends out doing things. Staff was really friendly and helpful, from the beach boys to the front desk, to the cool Jamaican woman who cooks breakfast. Probably helped that the weather was perfect, clear and 85 degrees and beach full of hot guys, but that's really what i came for. There's a great terrace on the 5th floor, with a beautiful view, very private, very peaceful. check it out.", "Date": "March 27, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Buffalo,New York", "Title": "“Not a Bad Place”", "Author": "Aleoop2113", "ReviewID": "UR4724411", "Content": "I would like to say its not as bad as the reviews make it to be. I hear people talking about bugs and the place not being clean. What lies! I saw cleaning peoples every day changing the sheets and cleaning the rooms. The staff was very helpful and kind. Yes its not a five star hotel so do don't expect it. I went with my partner and 2 other guys. We all would agree that it served its purpose for the 2 weeks that we were there. There could be improvements but you get what you pay for!", "Date": "March 22, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "1", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Chapel Hill, NC", "Title": "“Lousy hotel, friendly staff”", "Author": "A TripAdvisor Member", "ReviewID": "UR4722365", "Content": "We didn't know that it was a predominantly gay hotel, but learned from the info desk at the airport. Taxi driver said we were the second straight couple he had taken there in 14 years. When we were there, though, it was mostly gay couples, plus some straight couples and families-- very subdued, in spite of the photos of cross-dressers in the lobby. The room was dumpy, uncomfortable mattress, fungus on ceiling. No control over the AC-- the room was FREEZING! Their only solution was to put tape over the vent. Argh. Still, the staff at the desk was always available with advice and a smile-- more approachable and friendly than anywhere else we experienced in San Juan. The hotel was right on the beach, and the beach was WONDERFUL. It was great to be right on the water.", "Date": "March 21, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Atlanta, GA", "Title": "“For the price - No complaints”", "Author": "A TripAdvisor Member", "ReviewID": "UR4721427", "Content": "My stay at the Atlantic Beach Hotel was exactly what I expected for the price. The rooms are small but when in San Juan, how much time are you going to spend in there. The room was cleaned daily and the beds were made, as well as all the linens replaced. The beach is one of the nicest around which explains all the people not staying at the hotel there. If you are an extremely high maintenance person, don't stay here. If you want something comfortable, clean, and affordable this is the place to stay.", "Date": "March 21, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Washington DC", "Title": "“Recent Stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR3258663", "Content": "This hotel is located in the Condado on the beach in San Juan. While the hotel is a great location and has a bar on the beach, this hotel has limited services, the front desk staff is unfriendly and is not helpful, the rooms are dirty, the bar is loud and you can not sleep, the hotel is in general a run down hotel on the beach. They charge top dollar for this hotel and for the money, you can find other hotels. I was told there was a hot tub on the roof - when I arrive there was no hot tub. Ocean view is through a small window. The breakfast is a muffin only in a dirty run down restaurant. I rate this hotel terrible in all aspects. Especially the reason you go to San Juan - the beach - is terrible, small and dirty.", "Date": "March 8, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "2", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Dallas, TX", "Title": "“FUN NIGHT”", "Author": "Worldtraverler08", "ReviewID": "UR3252964", "Content": "We always cruise out of San Juan, this time we stayed 3 night before our cruise..... the first night we got in late from our flight.... we hung around the hotel and had more than a few drinks at the bar. There we met the best bartender!! We had a great time meeting alot of people and laughing it up all night.... the next few days and night we explored the city, we always come back to a clean room, the service is always nice. We never encountered anything seedy or suspicious... besides every hotel has its dark corners. I would definately recommend a few nights here for any of my gay freinds!!!", "Date": "March 5, 2005"}], "HotelInfo": {"Name": "Atlantic Beach Hotel", "HotelURL": "/ShowUserReviews-g147320-d151833-Reviews-Atlantic_Beach_Hotel-San_Juan_Puerto_Rico.html", "Price": "$97 - $130*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1 Vendig St.</span> | <span class=\"extended-address\">Condado</span>, <span class=\"locality\"><span property=\"v:locality\">San Juan</span> <span property=\"v:postal-code\">00907</span></span>, <span class=\"country-name\" property=\"v:country-name\">Puerto Rico</span> </span></span></address>", "HotelID": "151833", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/c6/0c/c60caf636eba6e15ed140d63b69416f41large.jpg"}}