{"Reviews": [{"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Tubarão, SC", "Title": "“Convenient”", "Author": "hermes_br", "ReviewID": "UR89799397", "Content": "Nice hotel both for tourism or business trip. Good internet speed, nice (and free) selection of movies and the location is excellent. The room is large, but the bathroom looks seems to be taken out from a plane and installed in the room. The staff is efficient but not sympathetic at all.", "Date": "December 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ireland", "Title": "“Cannot be beaten for value”", "Author": "rollonemptynest", "ReviewID": "UR77011086", "Content": "An good budget hotel in an excellent location to use as a base for exploring the city. Unusual rooms that work well. The beds are just a foam mattress on a solid base but strangely enough are not as uncomfortable as some previous reviewers had noted (this comes from a person very fussy about bed comfort due to a back problems!) Buy breakfast and light snack foods in from the Aldi or Netto closeby if on a tight budget. Plenty of reasonably priced restaurants nearby but go armed with cash; many local restaurants do not take cards of any sort.", "Date": "August 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Delft, The Netherlands", "Title": "“Clean and tidy, friendly staff.”", "Author": "YSie", "ReviewID": "UR66420348", "Content": "We arrived quite late, around 7pm on a saturday, no more parking lot available :( ( they share a indoor parking garage with neighbouring Ibis Hotel ), so we have to park at nearby public parking, approx. 200m distance. We booked 2 rooms, but the Air Conditioner did not functioning on both room.", "Date": "June 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Excellent Hotel for Exploring Berlin”", "Author": "dermo1979", "ReviewID": "UR63907119", "Content": "I spent 3 nights here and was really pleased with the experience. The hotel is very modern, with clean rooms, that are well layed out. Toilet is seperate from the main bathroom. Room comes with kettle, microwave and fridge, so no need to avail of the breakfast there. Wide screen tv, with free movies if you decide to spend a night in. Free WiFi and interent. The hotel is in an excellent location, 10 minutes away from Brandenburg gate, across the road from metro station, and plenty of bars/restaurants nearby. There are some drawbacks with the hotel that may put off some people - no room service. The seperate toilet is quite small. No drawers in the room. That being said, I would not hesitate in staying at this hotel again.", "Date": "May 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Surrey", "Title": "“Good location and reasonable value for money”", "Author": "Jasmine101Surrey", "ReviewID": "UR48989409", "Content": "The room was quite well designed, good size, modern and functional with a decent, big shower cubicle. However, there were no drawers which was a bit odd and also the bed was VERY firm and the pillows quite small. It is in a good central location with a very nice restaurant opposite serving traditional German food - which actually can be quite difficult to find. Every other restaurant in Berlin seems to be Italian! Breakfast was not included in our £70 per night price and pretty expensive - around 12 euros each but there are plenty of places close by to grab a latte and muffin. The hotel is located just off a main road so can be a bit noisy if you keep the windows open but shut they provided good sound proofing. Wouldn't say the hotel was anything to write home about but as a base as a city centre hotel, we thought it offered reasonable value for money - as long as you like a hard bed!", "Date": "November 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Vevey, Switzerland", "Title": "“Nice room, convenient location”", "Author": "mojave", "ReviewID": "UR46919436", "Content": "I stayed two nights with my daughter. The hotel is in fact located 10 minutes away from Postdamer Platz, in the center of Berlin. The S-Bahn station is across the avenue. The room was nice, with a partition between the bed and the living space. Very good fitness room, two computers with printers in free use. For breakfast, choice of coffie and cake, included, or full German breakfast for 13 euros.", "Date": "October 15, 2009"}], "HotelInfo": {"Name": "Suite Hotel Postdamer Platz", "HotelURL": "/ShowUserReviews-g187323-d1520394-Reviews-Suite_Hotel_Postdamer_Platz-Berlin.html", "Price": "0", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Anhalter Strasse</span>, <span class=\"locality\"><span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "1520394", "ImgURL": ""}}