{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good value for money”", "Author": "MutineAndRiquet", "ReviewID": "UR128327035", "Content": "My wife and I stayed there for 4 nights for our first time in Sydney. When we booked and saw there was no bathroom in the bedrooms, we were expecting some kind of hostels, dirty, noisy and full of young backpackers. Well, this is really not the case, this hotel happens to be very clean and quiet. Breakfast was pretty decent (they even had gluten free cereal and soy milk) and the Internet access is very affordable. So I would definitely recommend this hotel if you don't mind sharing a bathroom to save several dozens of dollars a night.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Very pleasantly surprised!”", "Author": "Gogo6gogo", "ReviewID": "UR127916640", "Content": "Having stayed in Sydney on a number of occassions, I'd been subjected to very high accommodation rates. Being tight on budget, I didn't expect much here - with shared amenities. Wow. Hugely surprised. Yes - the room is small, but fully equipped. With crisp white linen, fluffy white towels and all that you'd need including fridge, safe, coffee station, ironing board, etc. Exceeded all expectations once I realised how good the location was!", "Date": "April 15, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New Zealand", "Title": "“Pretty good for the price”", "Author": "TKENZ", "ReviewID": "UR127702025", "Content": "We stayed at Y Hotel Hyde Park over the Easter period and thought it was pretty good for the price (hotel prices in Sydney can be pretty astronomical). Pros: * we were on the 7th floor in an ensuite room and had no issues with street noise or corridor noise at night * comfortable double bed (although one couple in our party was on the 4th floor and they had a king bed) * the rooms were pretty clean * very close to museum train station and buses (no issues getting there from the airport with luggage) * free breakfast was good - toast, croissants, cereals, juice and tea/coffee * good, basic hotel if you are just wanting somewhere to sleep Cons: * we had the air con down very low (maybe 12-15 degrees C) and it made the room cool enough to sleep but certainly not cold (as cold as I would expect for the temp). I wonder how effective it would be in summer * bathrooms were pretty small (but as to be expected) All in all I would recommend this as a good option for those wanting a cheap, basic hotel in a good location.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Aarhus, Denmark", "Title": "“Great budget accomodation”", "Author": "Katelijn V", "ReviewID": "UR127565865", "Content": "Great budget accomodation in the city centre of Sydney LOCATION: 2 min walk to Museum train stop (it can take you straight to the domestic or international airport from there!), next to Hyde park, close to central station and on walking distance from darling harbour and quarter quay (+- 20/30 min walk). ROOMS: rooms are quite OK, tidy and good beds. The shared bathroom is not that great but it does the job, bring some flipflops. BREAKFAST: included is just some toast and marmelade or some cereals. However some hostels make you pay 6 dollars for only this so quite reasonable. Fresh filter coffee is provided no instant coffee so that's a plus! Overall: it's OK, it's a budget hotel so what do you expect? This is very good for the price and location!", "Date": "April 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Great location to explore Sydney”", "Author": "floridasunset_9", "ReviewID": "UR127001623", "Content": "Arrived Sunday morning after a 24hr trip from the uk. Tired and in need of a shower we were hoping the front desk would be accommodating and allow us to either pay for an early check in or a room that was already made. No such luck. The guy at the front desk told us none of the rooms were ready and that the hotel was full from the previous night.we were advised we could come back at around 1300 to see if the room would be ready then. So we asked where we could go to freshen up - level 3. Well they were not in the best condition. Overflowing bins, hairs everywhere. We had booked a room with shared facilities..this was now being questioned if this was such a good idea. Back at the hotel, room was still not ready!!!! We then enquired about a room upgrade with an en suite. We paid the extra $55 per night as I really did not want to encounter the mornings shared facilities on a daily basis. Ask for a high floor we were on level 8 and it was quiet, we could not hear anything from neighbouring rooms. The rooms are basic but for a city you really only need the bed! Room was cleaned daily and all towels sheets were clean. Small amenities are supplied such as soap shower gel etc if you have forgotten anything. Dont know if this applies to rooms without en suite. Breakfast is brilliant. Cereal choices are good then toast and croissants. You can pay for a hot breakfast but the cereal was enough. The hotel is a great location. Nearest train stop is museum. However we prefered to walk through Hyde park to the harbour bridge it's about 20mins walk. Then 20mins to darling harbour. The 333 bus route can take you direct to bondi beach (it's ore paid only bus route but you can get the bus tickets from the 7 eleven on the corner) if you need info the front desk is more than helpful if you want no fuss no frills this hotel is perfect. Its also perfect for backpackers too. I would stay here again but will pre book the room with en suite.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Preston, United Kingdom", "Title": "“The only place to stay in Sydney”", "Author": "Damian66", "ReviewID": "UR126985267", "Content": "What an amazing, friendly, local place to stay in the centre of Sydney, Australia. I loved this place. It was cheap, clean, included breakfast, and full of friendly helpful staff. This will be the only place I stay at when I visit Sydney again later this year. Well done to the Y.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Melbourne", "Title": "“Get what you pay for”", "Author": "cekips", "ReviewID": "UR126318674", "Content": "The hotel is well sited for buses to the SE of Sydney and also close to Museum station servicing the airport and Circular Quay. Our 'luxury' double was a converted single room and rather tight. A good light breakfast is included. Helpful staff.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hereford", "Title": "“Basic but clean”", "Author": "DougalDogHereford", "ReviewID": "UR126174879", "Content": "Very reasonable rates, good basic continental Breakfast. The room was small but clean with a well equipt bathroom, the towels were changed either everyday or every other day depending on what you wanted. As i said the room was a bit cramped with 2 adults and 2 suitcases but for the price we couldn't complain, you are very centrally located and it easy to get pretty much anywhere in the city from the hotel, we walked most places but there is a ggod circluar bus and taxi's are everywhere. Would recomend if you are looking for good clean safe accommodation that isn't a YHA.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Awful customer service!”", "Author": "vermilion777", "ReviewID": "UR125776237", "Content": "Stayed here in May 2009, upon check in I discovered from the hotel's end I was only booked in for 1 night. The hotel manager tried to have an arguement with me but I was quick ot put him in his place - no initiative was taken and I had to wait 90 minutes on my mobile to my ttravel agent to get her to fax details of the 2nd night that was booked. Very bad service and its best to stay away!", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Warsaw, Poland", "Title": "“Good location”", "Author": "Alxandra_St", "ReviewID": "UR125044417", "Content": "Good location, very nice reception staff more hotel than hostel-like. Breakfast included in price which is great. Even if it's said \"light continental\" actually there are a lot of choice. Bathrooms were quite dirty and rooms had some strange smell inside. Close to city nightlife and Hyde Park. Costs more than any other hostel in Sydney.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Mix up and shared bathroom”", "Author": "0DavidKiwi0", "ReviewID": "UR124907917", "Content": "I booked a double room with private bathroom well in advance. I turned up and got a room with single beds and a shared bathroom! The bathroom was dirty and inconveniently down the other end of the hallway. Staff eventually admitted they keyed in the booking incorrectly but really that is not excusable. After staying in 100's of hotels never has this occur before. Apart from that, great location!! Just an unpleasant stay.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Bergen, Norway", "Title": "“Good value for money, and superb location”", "Author": "sitrona", "ReviewID": "UR124842838", "Content": "We stayed for a week in the beginning of feb in a studio room. The size was good, we also had an ensuite bath, and a minikitchen containing a fridge, microwave, toaster and a boiler. Room was clean when we arrived, and it had a cot as requested for our little baby. They did make the bed and gave us new towels every day, but the room was not cleaned. As this is more of a budget hotel I'm not sure if they are supposed to. I understand that vacuming the floor isn't easy with alot of luggage lying around, but our sink and shower showed no evidence of ever being cleaned the whole week. The staff (except the cleaning lady) was very nice and understanding especially the one night our little one had trouble sleeping and did unfortunately cry for a bit. Scary lady next door was not though. Thankfully she was moved/or moved om voluntarily. Breakfast selection was basic, but good, we chose to upgrade it for 5$ per person most days. Location is superb!! Very close to both Town Hall and Museum station, pluss within short walking distance to William st, where you can find several car rentals. Also short distances to pretty much everything in the CBD area and Darlinghurst, King Cross and Surrey Hills. We would recommend this to pretty much everyone, although the walls are a bit thin so bring ear plugs if you're a light sleeper. Most would probably not bring a baby, but we could hear our neighbours pretty well, as they unfortunately could hear us. Studio room did not feel cramped as a lot of other people say about the other rooms. Great budget choice, with superb location. (They did however not serve lunch as they advertised in the elevator, so maybe they should take that sign down). Will come back if ever in Sydney again. :)", "Date": "February 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Arvada, CO", "Title": "“Best Hotel value in Sydney”", "Author": "MacPoole", "ReviewID": "UR124734611", "Content": "So, you're in Sydney to explore: the Rocks, Circular Quay, Darling Harbour, Manly Cove, Bondi Beach, the Opera House and more. Who needs a suite? A room the size of a ship's cabin, and a shared bathroom (mens room and ladies room) is all you'll need because you won't be entertaining in your room. That, and an included continental breakfast (upgrade to eggs, sausage, bacon and hashbrowns for only $5 -- enough for two!), and you're set to explore. Conveniently located near every bus line in the city, the free 555 bus, and the Sydney rail Museum terminal, and you couldn't be better located. Plus, you can walk 6 blocks to Darling Harbor, 5 blocks to the Queen Victoria Bldg mall, and 2 blocks to the fitness center. Clean and quiet, but be sure to bring your 240 to 115 plug adaptors since there are none of those multi-outlets you find in pricier hotels.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brussels, Belgium", "Title": "“perfect location and quality”", "Author": "Cricca81", "ReviewID": "UR124627227", "Content": "The hotel is very well located (you have the train station nearby). The room was ok and cleaned . the only thing I did not like was the smell inside the room...maybe somenthing fell on the floor and the carpet keeped it. The room had not ensuite bathroom that was just outside it and very well cleaned and keeped. The breakfast was included! It was hard to find a place good and not crazy expensive in Sydney....but that was Yhotel Hyde park!!!", "Date": "February 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Smart hotel-hostel at great location”", "Author": "Belinda B", "ReviewID": "UR124511848", "Content": "Very much enjoyed my stay at this interesting accomodation that fixes features of a hotel and hostel. The dorm prices are high, but justified by the great vlue. The dorms have real comfortable beds, feel more like a hotel room than a hostel. Shared bathrooms are proper and convenient. Lobby looks better on the website, but still reasonable for spending some time. Internet/WIFI can be acquired for 15min to 7days at reasonnable prices. Breakfast is basic and included in the price. Add up to english breakfast is possible. Staff is friendly and helpful. Airport link is just 2min away as is the subway stop Museum.", "Date": "February 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Northampton", "Title": "“Great budget hotel in Sydney”", "Author": "Button121", "ReviewID": "UR124388998", "Content": "I visited Sydney for 2 days with my 8 year old son. The location is great for the underground but nothing is very far away on foot. Clean rooms, friendly staff, good breakfast and good value for money in what can be an expensive city. Recommend a trip up the Sky Tower which is close and a trip over to Manly on the ferry.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Milton Keynes, UK", "Title": "“Great location and nice enough rooms”", "Author": "pcuff1980", "ReviewID": "UR123752959", "Content": "We stayed in this hotel over New Year and so probably the most expensive time of the year. The location was very good being only a 10 minute walk to Darling Harbour, and a 2 minute walk to the railway station, we even walked back from the botanic garden on New Years in under 30 minutes so it was very accessible. The room was ok, reasonably sized with a tv but a shared bathroom. they do have private rooms too but they were more expensive and to be honest it was already more expensive than I wanted. You did also get free breakfast (restricted to cereal, toast, croissants) but better than nothing. I'm not sure if i'd stay here again or not but it would be dependent on the price really. Also there was a lot of street noise from the window despite it being firmly closed.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "perth", "Title": "“Excellent location, well priced”", "Author": "PerthEggs", "ReviewID": "UR123629006", "Content": "Stayed at Y Hotel Hyde Park for 6 nights in Jan 2012. It was very well located, a very short walk to Museum train station which meant we could get the train to and from the airport. Our twin room (no ensuite) was relatively big compared with other CBD hotels, and included a bar fridge. The ensuite bathroom was clean, and we never had to wait to use the facilities. The breakfast was fantastic, juice, tea/coffee, cereal, toast & croissants (pay a litte extra for fruit salad, cooked breakfast etc.) and was served in their cafe downstairs. Would recomend requesting a room on one of the igher floors as noise traffice is an issue. We were on 6th floor and found the first night to be very noisy but got used to it after then and was not an issue.", "Date": "January 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Worth every penny”", "Author": "Kay8383", "ReviewID": "UR123447547", "Content": "Worth every penny, good value for money. Good location, e.g. walking distance to Darling Harbour and shopping (George Street), buses to Bondi leave close by, short walk to train station with connections to the airport etc. Room was clean (only minus was the relatively small size). The hotel was quiet at night and the wireless internet connection in the room was a plus. Would deinitely stay again!", "Date": "January 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Home Counties", "Title": "“Good basic hotel, ideal location.”", "Author": "PoshRegan", "ReviewID": "UR123439624", "Content": "I have stayed here twice so far, and each time have had a good experience. The hotel location is excellent, right by Museum Station (part of the City Circle network) and walking distance to Circular Quay, Opera House, Darling Harbour and the Anzac Memorial. You can also easily get to Kings Cross and Oxford Street/Paddington (go to Govinda's for the yummiest food EVER!). The staff were friendly and professional at check in, and security is good as you have to swipe in at night with your keycard. I stayed in a double room on my first stay and a single on my second. Admittedly, they were on the small side and the decor was plain, but then again this is a budget hotel and I spent most of my time out sightseeing. They were well equipped with tea/coffee, fridge, TV, hairdryer and phone. My ensuite bathroom was not huge, but everything worked as it should and it was cleaned every day (as was the whole room). Regarding other facilities, there was a bright, pleasant, cafe area downstairs, which provided a continental breakfast (cereals and toast with coffee, tea and juice) which was included in the room price. For $5 more you could upgrade to a good-sized cooked breakfast, which I did before going out on long day-trips. There was an Internet kiosk with about 3 terminals, and you could buy specific amounts of time from reception, using Global Gossip cards. In addition, there was a guest laundry which was handy and fully operational during my stay (as far as I could tell it did not break down!) and guest kitchens were available, although I did not have to use them myself. Vending machines for snacks and drinks were provided too. The only thing which bothered me at the Y was that I could not figure out where the fireescape stairs were. Obviously, if a fire breaks out you cannot use the lifts to get out, and I just could not make out where they were. Other than that, I enjoyed my stay and would go back again.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Close to lots, without the pricetag”", "Author": "MartyB12", "ReviewID": "UR123268444", "Content": "The Y Hotel Hyde Park is excellently situated to be close to many of Sydney's offerings, and my girlfriend and I found ourselves being able to easily walk, or catch an inexpensive cab ride throughout our three night stay. Circular Quay with the Sydney Opera House and OZ Jetboating, or Darling Harbour with the Aquarium, Wildlife, Maritime Museum and others were both walking distance or $10-15 AUD cab rides. The room itself is spartan, and cheap for the area. But you get what you pay for, and the room was really just a place to lay our heads. The bed was not a relaxing spa bed. There was not a piece of art on the wall. The bathroom was utilitarian, with a sink, toilet and shower. The room did have A/C which was critical. A TV with a decent selection of channels, and a closet packed full with mini-fridge and dresser and no room to hang any clothes. Fantastic location and cheap are the positives of this spartan Y.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Twin Cities", "Title": "“Good Choice, But Match The Room With Your Needs”", "Author": "Lyzardo", "ReviewID": "UR122880705", "Content": "Stayed for four nights in October 2011. Location is good, right near Hyde Park and within walking distance of the harbor. Oxford Street was a bit of a wild mess the weekend we were there, so we stayed away later on. Started with a single traditional, but could barely fit our luggage and selves in the room. After one night, upgraded to a studio. More expensive but a beter choice for us. Breakfast was very nice, and the front desk staff were extremely friendly and accommodating. Overall, a nice place for the money.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Port Macquarie", "Title": "“Good value in the centre of Sydney”", "Author": "Debbie_in_Port", "ReviewID": "UR122786265", "Content": "The rooms are small and slightly dated and the bathroom very cramped BUT you can hardly beat this hotel for location. The check in staff were efficient and friendly and continental breakfast provided with the room, but I opted to explore Sydney's cafes each morning. As a cricket fan I used this a a base for the Sydney Test and was able to walk past lovely old houses on my leisurely 25 min stroll to the SCG. The choice for evening dining was extensive and varied, with Oxford Street in one direction and the city centre in the other.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“If you're looking for a great hotel opposite the park...”", "Author": "StevieG489", "ReviewID": "UR122547604", "Content": "..then try the Marriot! However, for everyone else there is the Y Hotel Hyde Park. I had a single studio which was basically the size of a prison cell. I'm not complaining though as I wasnt there in order to spend much time in the room other than to sleep. It seems to be the case that cleanliness is not great in any of the Australian hotels I've stayed in and the YHHP is no exception. Parts of the room were a bit grubby like the area around the tea and coffee facilities. Bedding and carpets were ok. No bed bugs thank god. En suite shower room was clean and modern. Water hot but pressure a bit on the low side. Aircon just about seemed to work. Breakfast is very basic. A choice of about 5 cereals, toast or coissant with butters and jams etc. Coffee or tea provided. The orange juice turned out to be orange squash and not even concentrated orange juice! I guess this is how they keep prices down. If you're looking to meet other travellers then this isnt the best place unless you are staying in a dorms as there is no bar/meeting area apart from reception or at breakfast. The clientel seemed to be a mixture of couples,singles, travellers, one or two business people. Staff seemed fine when I asked them for assistance. There's a nice asian/indian guy who walks around in a suit. He seemed the most pleasant of the bunch. I guess he deals with the conference business. The location is really good and you can walk everywhere or take the bus to Bondi. Museam stop from the Airport is so convenient (about $16.50 one way). There's a supermarket just east of the hotel on Oxford street if you need anything. It's 5 minutes walk. Overall I would rate the hotel as 'ok' and I would recommend staying there unless you can get a cheap deal at a more classier establishment.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Australia", "Title": "“Great value for basic centrally located functional hotel room”", "Author": "CincottaAus", "ReviewID": "UR122332154", "Content": "I have recently stayed two nights the the y hotel. I stayed with a good friend. We requested a twin room and received this upon arriving at the hotel at 11am and were lucky our room was ready ad were checked in straight away. The museum train station is less than a 500 meter walk to the hotel so the train is the quickest and cheapest way to get fronts airport to the hotel. I am not exactly sure what we paid as thus was a package booked through online company expedia but I am guessing it was around the $150 a nigt including continental breakfast. The room was very basic but clean and a suprisingly modern bathroom. The tv, hairdryer and coffee/tea facilities are neatly stored in the wardrobe with plenty of hanging space. The beds were comfortable and clean. We only uses the room to sleep in and not just hang out so if you are after somethin cheap and on a great central location this is the place to stay. A note about breakfast, if you do not like cereal or toast then eat out as there was no drag fruit or eggs included this is an added extra for only $5 for the Eggs with Bacon and the fruit is $5.50. In terms on central location of the hotel, my friend and I walked everywhere. Just make sure you have some water and good walking shoes. In saying that I spent the whole one wearing thongs anyway. We were able to walk back towards the museum train station and get a number of different buses to bondi junction shopping centre and also further to bondi beach which by TE way I liked manly much better. TE bus trip cost about $3.50 one way. The ferries operate to manly from circular key and not coat around $14 for a round trip and try go very frequently. Overall I would stay here again as it's great value in Sydney and had a great time.", "Date": "December 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Aylesbury, United Kingdom", "Title": "“Good location, good value.”", "Author": "RovingRich", "ReviewID": "UR121859899", "Content": "We chose this hotel based on our budget and its central location. Our room was not ready when we arrived although we had not been provided with any previous information as to a check in time. The desk clerk was efficient although not overly friendly and allowed us to leave our luggage until the room was available. Some of the staff were much more friendly and helpful than others. Our \"deluxe\" room was rather basic with white walls, no pictures and limited furniture. The double bed consisted of two single beds pushed together. Although there was a tempting balcony area outside, this was not accessible for \"health and security\" reasons. The walls were thin which was not ideal when the couple next door arrived back for a drunken shouting match in the early hours of the morning two days running. The room was clean and there was a TV, fridge (inside the wardrobe for some reason), safe and tea and coffee making facilities. The only available socket was inside the wardrobe so we had to boil the kettle balanced on top of the fridge in this location! The view from the room was mostly of the office block next door although we could see tantilising glimpses of a park from certain angles.There was quite a lot of traffic noise as the windows did not appear to offer much sound proofing. The breakfast was a basic buffet style incorporating cereals, jucie, bread and croissants although there was the option of upgrading to a cooked breakfast for an extra $5. There were complimentary newspapers every day. Internet access could be purchased for $10 for 24 hours or $3 for 15 minutes. The central location approximately 5 minutes walk from Museum station was ideal for exploring Sydney. We would consider staying again in future but on the other hand if we could afford to stay somewhere nicer we would!", "Date": "December 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Gross shared bathroom”", "Author": "ohmyling", "ReviewID": "UR121553086", "Content": "Despite the good location of the hotel and the reviews of previous tourist, i was extremely disappointed at the sight of my room. I know i didn't chose deluxe but that doesn't mean that my room has to be so small until there isn't any space to walk. In addition, the thought of sharing a bathroom is not actually that a big deal. But i got a shock when i visited the bathroom for the first time. its dingy, reeks of urine and slimy. Worst of all, the showers give you extremely hot or cold waters. Attempting to get a warm shower at the end of the day is just impossible. I'm not sure about the rooms with their bathroom so i can only discourage you from getting the rooms with shared bathroom if you really want to rest well in the hotel for at least a few nights. I should add in that the cups and water boiler in the room was covered with dust upon check-in. GROSS.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Bargain in Central Sydney”", "Author": "easytoplease61", "ReviewID": "UR121533013", "Content": "Recently only two nights were available at the Best Western Stellar and I had to scramble for a third night. The desk clerk at the BW directed me across the street to the Y Hotel at Hyde Park as in YWCA. $98/ night small room very clean, shared clean bathroom. cont. brkfst inc. Not deluxe but clean and functional. I would stay here for an overnight anytime", "Date": "December 8, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“donâ€™t expect any flexibility”", "Author": "Michael M", "ReviewID": "UR121247866", "Content": "Hotel was fine rooms were clean and the location is good. However I was very disappointed with the poor level of customer service. I phoned the hotel 4 days in advance to let them know my trip had changed and that I would be arriving a day earlier and leaving a day sooner and was told this was fine and just to let the tour operate know, which I did. Turned up on the day and got a rude receptionist who informed me there were no rooms available and refused to help me find another hotel. If you book with this crowd donâ€™t expect any flexibility once they have your money thatâ€™s it.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Cheap and Cheerful”", "Author": "Gregor H", "ReviewID": "UR121049233", "Content": "I stayed here for 4 nights with my girlfriend in November 2011 and chose the hotel based on other reviews and the price. The staff were polite and helpful and the general appearance was clean and tidy. The room was small with the wardrobe filled with a fridge and safe leaving no room for cases and for some reason the TV fitted inside but as I was spending as little time as possible in the room this was not really an issue. The bed was comfortable and the shower hot and powerful. The breakfast served in the morning was cereal, toast, crossiants etc and it was decent enough My only complaint was on the last day eating breakfast I noticed a bug (I suspect a small cockroach) on a nearby table. A member of staff came by and brushed it on the floor and left it alive and cleaned the table and walked off!! no idea why she didn't kill it or remove it. Other than that a plesant stay. You get what you pay for.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hamilton, New Zealand", "Title": "“Perfect”", "Author": "Phil H", "ReviewID": "UR120771866", "Content": "I stayed 3 nights with my 24 yr old daughter in Sydney for specialist medical tests. Both of us found the room (twin deluxe with two single beds) very adequate. My fastidious daughter remarked that the bathroom and room was very clean - so that's a plus to get that comment from her! Location is excellent for downtown attractions. Close to rail and buses and of course Hyde Park is a nice stroll.. Very pleasant and helpful staff. The breakfast was certainly adequate to start the day. Liked the other guests also - good ordinary folk of all ages and nationalities.Felt homely. OK - so it's not the flashest place in town but would definitely stay again as it is good value for the location and nice staff just top it off.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Good location, fine room”", "Author": "LRoss00", "ReviewID": "UR120501096", "Content": "I stayed here at the end of my Australian holiday. We had a room with a shared bathroom. The room was small but have everything we needed. There was even a TV and small fridge in the closet. The bathroom was located next door and we never had trouble with it being full when we needed to use it. The location is great, just across the street from Hyde Park and down the street from Chinatown. The hotel is clean, but could use a little refurbishing. It was a fine hotel but on my next trip to Sydney I'd probably try out a new place.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Good for budget travellers”", "Author": "desire348", "ReviewID": "UR120415793", "Content": "I initially booked the dorm, but with 2 pieces of luggage, its difficult for me to pack/unpack, the noise from the road which I could not bear made me change to a double deluxe room. Wow, it was heaven, the room is nice and quite and very clean. It is still good value compared to other double room in town especially that good location. The only downside is you need to walk up a slope to reach the hotel, and I took the train at museum station to the airport, it was tough pulling my luggages to the track as the station does not have a lift.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kunming", "Title": "“Highly recommend for affordable Sydney stay”", "Author": "KunmingPanda", "ReviewID": "UR120215244", "Content": "The hostel has very nice quiet rooms at affordable prices. It also has a tiny kitchen (limited to just microwave and fridge). In the crazy expensive Sydney this is a very nice budget option if you want a quiet room away from noisy party goers. The only downside to what is a very nice hostel/hotel is the staff. With one exception (a nice lady) they were the most incompetent staff I came across in Australia. Really in need of extra customer service training! but despite the rude and incompetent reception desk staff, I'd still recommend the hotel highly as it's very hard to find an affordable hotel in central Australia that is quiet.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wales", "Title": "“Good value”", "Author": "kd247", "ReviewID": "UR119813799", "Content": "Me and my partner stayed here for two weeks we found that to be a little too long and if we returned to Sydney would only stay for a few days. The hotel is basic but clean and has fairly good facilities. It could be improved by having better cooking facilities in the kitchen e.g. cuttlery, oven, hob and so on (There is only a microwave, toaster, kettle, ice machine and fridge). I would only recommend this hotel for short stays as it can be noisy especially if you have a room that is low down or facing towards the road. The walls are very thin so if your unlucky and get noisy guests in the room next to yours it can be a pain. The rates are reasonable compared to other hotels in the area. The location is great, most of the cities highlights are within walking distance.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Ok place for the price”", "Author": "winm163", "ReviewID": "UR119199908", "Content": "Stayed in a 4 bed dorm on level 3. Road noise is a bit noisy if you're trying to sleep early, might be better if your room on higher level. Got breakfast with the stay, cereals, toast, coffee and tea. The room temperature setting is either wasn't working properly or bit difficult to figure out how it works, found out room can be too cold or too hot. Overall cleanliness is average.", "Date": "October 11, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Ashburn, VA", "Title": "“Good Location, Decent Accommodations”", "Author": "sgtmorrison", "ReviewID": "UR118584072", "Content": "Just got back from a stay at the Y Hotel. I did much research for our trip so I can hopefully provide some insight to assist others. PROS It is a very close uphill walk from the Museum subway station. Free breakfast is included each morning. They offer cereal, juice, assorted breads and coffee for free. Anything else must be purchased. We got a shared facility room. Offered a different room (end unit) when the first room had a sliding door that did not lock. We lucked out because the new room was much bigger with a table and two chairs. Flat screen TV, with assorted Australian channels. Fridge was included (even though it was in bad shape) and served to keep water and other things cold. Internet use is not included, must pay a by minute fee. I believe it was 1 dollar for 15 minutes of time. Offers airport shuttle for $28 AU dollars for two people. Using the subway from the international terminal will run you about $31.40 AU dollars for two people. So a bit of savings. Many places to eat of all variety to eat around the hotel. CONS The first room we got was tiny and a few others we saw were tiny. The bathrooms are not clean. On my floor (8th) the same dirty toilets were the same each day....dirty. The sinks were dirty. The showers were dirty. The male facility had two toilets and one shower. I had to wait for the shower for about 45 minutes. The staff was fine, but a few were rude when we asked questions. The sheets on the bed were dirty with hair on the sheets and comforter. The room keys often would stop working so we had to go to the office to get them working again. TIPS: The FREE shuttle is Bus 555. Runs until 3:30pm except on Thursdays where it runs to 9:30pm. This bus stop is just left down Liverpool St. near the subway station and will take you in a loop and up to Circular Quay (Sydney Harbor, Sydney Opera House) for free. The 380 or 333 bus will take you to Bondi Beach. You can buy bus tickets from the stores near the bus stops. Overall, I will recommend, but only if you get a room with your own restroom. As they say, location is everything.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hertfordshire", "Title": "“Good base; clean and comfy”", "Author": "ctranter", "ReviewID": "UR118354190", "Content": "Not much to fault about the place really. As a couple travelling on a budget hostels often work out inconvenient and expensive. The yhotel was a great option for a cheaper double room for us - as we have no problem sharing a bathroom. We stayed here twice during our aus trip as we liked it so much the first time. The location is excellent, really couldn't be much more central to most of the places you'll likely want to go - and very close to the station. The rooms are very nice, well cleaned, comfy beds, with a tv and fridge. Very well kitted- out. The bathrooms are on each floor and are very clean too. Breakfast is pretty good too and the staff were happy to refill the food if it ran out. All in all has a slightly 'impersonal and sterile' feel, which frankly I found refreshing and pleasant especially after a lot of times in busy grubby hostels. But is clean, comfortable and at the price we got it online - great value for money (cheaper than us staying in a 12 bed dorm at some of the sydney hostels). Didn't have much call to use the staff but they were very friendly in general. Internet, as with lots of places in aus, is fairly expensive though - 'global gossip' system if I recall.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Reno, Nevada", "Title": "“Comfortable and clean.”", "Author": "Nellyellyjelly", "ReviewID": "UR118220119", "Content": "I stayed back in July for a week and was very happy with the hotel. I work as a front desk clerk myself, too, and was happy with the service I got when I checked in. I had a corner room on the highest floor, and even though I'm used to really big rooms I found the room cozy. I was also right across from the shared bathrooms which was very convenient. The fridge and microwave were very nice touches, and the bed was comfortable. I also was really happy with the breakfast, too; and I did upgrade my breakfast once or twice for the $5. I was a little confused when I realized I didn't have a phone in the room, but it was no big deal. It was nice to be so near everything, and Hyde Park really is lovely. I would stay here again, no doubt.", "Date": "September 17, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Barcelona", "Title": "“Very good experience !”", "Author": "Beling", "ReviewID": "UR118049187", "Content": "We had a double room and it was a very big room on the 4th floor. The bed was queen size, so it was very big and extremely comfortable. We had a big window we could not open for safety reasons, but we could see the light every day and the sun shining within our room. The warderobe was not so big, but you have everything you need for your stay, even an iron machine and some blankets. The bathroom was old, and some pieces within it have disappeared and have not been repaired, but the most important thing is that you can have a shower or even a bath with hot water and at a comfortable level, so no worries. The hotel location is great, near Hyde Park and 20 minutes walking distance from the Opera House and main amenities such as Sydney Tower, St Mary's Cathedral, Botanic Garden, and so on. I highly reccomend this hotel in terms of location and right price. Moreover, the staff is very friendly and kind and they really helped us at our arrival (check-in is normally at 2pm, and we could enjoy the room from 8am onwards at no extra charge!!).", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Montreal", "Title": "“Its fun to stay at the Y...”", "Author": "NessyBear", "ReviewID": "UR117350882", "Content": "YMCA that is... It never occurred to me that the Y stood for YMCA and not hYde park, anyways it didn't matter, the hotel is excellent, clean, secure and comfortable. If you are not looking for luxury accommodations and staying at a hotel is just to get some z's and to take a break from your day exploring the city this is the place. You have a wide array of rooms to choose from, I will suggest that if you have an extra $20 per day go for the room with private bathroom. Continental breakfast is included (6 types of cereal, croissants, toast, butter, jam, coffee and juice) but for an extra $5 you get 2 eggs, sausage, bacon, hash brown potato, beans and a tomato. The location of the hotel can't be beat, right next to Hyde Park and a couple of blocks from Downtown Sydney. Museum Metro Station (subway train) is just a 2 min walk and the gay area is just two blocks away. Circular quay is either a 45 min walk or a 10 min ride on the train. Again if you are a traveller on a budget or just need a clean, safe and well located hotel where you can rest I will definitely recommend the Y Hotel.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "New York", "Title": "“Great location - a little worn”", "Author": "holeyanna", "ReviewID": "UR117309211", "Content": "Stayed here for 3 nights - great location, on the south side of Hyde Park - easy access to two metro stops and 10 minute stroll to Cockle Bay Wharf and Darling Harbour. The daily breakfast was convenient but the rooms were a bit worn for the cost. The room had an underlying smell of body odor, with a lot of soap. Other than that the room was relatively clean as was the bathroom (we had an en suite bath). We unfortunately had a fire alarm go off at 600 AM one morning, but the remaining two nights were uneventful thankfully. However, we had a room facing the back of the building - so we had the pleasure of hearing the garbage trucks every morning.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Excellent location, wonderful staff, safe and clean.”", "Author": "Sphinxie", "ReviewID": "UR117146537", "Content": "I have stayed at the this Y 7 times. Each time I found it a wonderful experience. I have stayed in the shared rooms (4 beds with lockers bathroom down the hall) single rooms (bathroom down hall) and in the Single with private bath. The entire hotel was always clean and the staff friendly. The multilingual staff was an unexpected perk for me, speaking only English. I met many wonderful new friends who only spoke their own language, but we hit it off and someone from the front desk was always willing ( and able!) to translate enough between us to get the ball rolling for us to begin our friendship and expand our world. As a woman in her mid 40's I found the area safe and located perfectly for all transportation modes. I could walk to the Opera House and Circular Quay. The Subway was right across the street as were busses and the beautiful Hyde Park. Unlike some areas in Australia, Sydney never sleeps, so have fun! Biggest surprise: I lost my Credit Card one night answering my phone in Hyde Park on the way back to the hotel. I didn't know it was missing. The next day I was walking through the park and a young man called to me saying he had seen me drop it the night before but I was on the phone and didn't hear him call to me then. He had taken it to the Police station! Not only that but he then escorted me to the station where I retrieved it in tact. For friendliness across the board Australia has it :)", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Sweden", "Title": "“Very nice with great location”", "Author": "DocSweden", "ReviewID": "UR116926473", "Content": "Stayed four nights in a double room with shared facilities. Clean room and toilets/showers. Daily housekeeping good, they even changed our blankets once. Reception was very helpful. Continental breakfast as you would expect, but for just $5 extra you get a full English breakfast.Great location near public transport, only five minuts walk from Museum Station where you can take the train to the airport.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "1.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Launceston, Australia", "Title": "“Do not stay here!”", "Author": "dpt-turner", "ReviewID": "UR116374332", "Content": "When we checked in the room was clean, but did not stay this way. Daily housekeeping was very poor! All they did was change the towels or shower was left wet, mirror dirty, bed un made and the toilet dirty every day! Considering we were there five nights it was not acceptable. For what we paid for the hotel it was good value location good walking distance to all attractions in the city and the breakfast was included in the rate which made it even better for value. But the room wasn't even kept clean during our stay which wasn't good enough, would not recommend this place to anyone. But if you don't mind holidaying in a dirty hotel room definitely stay here!", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Galway, Ireland", "Title": "“It was an ok hotel,very good location”", "Author": "Moley1230", "ReviewID": "UR116354791", "Content": "Hotel is in a good central location, our room was a delux twin room, it was small, I had to lift my 2 heavy suitcases over the beds in order to have room to open them. The ensuite bathroom was clean and modern , had nice towels, flannels and soap, lotion and shampoo. Water pressure in shower wasn't great but was adequate. Room had TV, fridge, hairdryer, safe, tea/coffee, iron and ironing board, which was brilliant. Beds were nice and comfortable. I did find the room a bit cold despite adjusting the fan and temperature etc, I think the temp controls are just a decoration!. We got into bed to keep warm and that was fine, Carpet wasn't the cleanest, there were alot of hair grips on the ground that weren't mine and during the 3 nights we were there, they were not removed or cleaned up, to be honest, I didn't walk on my bare feet in the room as I really felt the carpet was dirty. Reception were helpful and friendly. Breakfast was fine, simple but it was plenty for us, I enjoyed it. Overall, good location for the money, cleaning could be better but I'd stay there again.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Monchengladbach, Germany", "Title": "“Budget location very close to Hyde Park”", "Author": "HecBarca", "ReviewID": "UR116179988", "Content": "Stayed three nights in the dorm style rooms. Rooms are small but clean and well equipped. No views to Hyde Park but possibly best budget location in an actual hotel close to Hyde Park. Had shared facilities which weren't as bad as previous reviewers noticed but clean (though only 1 shower per ~15 double rooms). Service at reception is exceptionally courteous and you feel very welcome. Offers airport transfers and free breakfast.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "2", "Service": "4"}, "AuthorLocation": "Zibo, China", "Title": "“Great for a quick stay, a little pricey”", "Author": "mcfarljw", "ReviewID": "UR115884901", "Content": "I was only in Sydney for the day so I stayed at this hotel based on the price and location. From the door of the hotel I was able to walk around most of the downtown area with ease in a day. I definitely wouldn't stay in this hotel for more than a day or two as the rooms reminded me of small Japanese rooms. For a little bit more money you could find a more standard sized room in the city. I only stayed for one night so I can't comment on the housekeeping issues, but the front desk staff was very helpful.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent location-housekeeping could be better”", "Author": "cupcake51", "ReviewID": "UR115414976", "Content": "This hotel is in an excellent location opposite Hyde Park, close to the CBD with lots of bus stops nearby including the free bus into Sydney-however we walked into Sydney everyday when we stayed here-all the citys attractions are within easy reach. When we arrived we had to wait for an hour for our room as it wasnt ready and the head of housekeeping was not very apologetic about this-I asked if we could have a drink and he flatly refused! Not a good start. However the staff at reception were generally helpul. We stayed in two rooms-the first being a four bed dorm-which was quite spacious but could have been cleaner-the second was a twin room which was cleaner. The communal toilets and showers could have been alot cleaner. The hotel has a kitchen which all the quests can use-but really it needed a kichen on every floor- but this was good as it had a microwave and was kept clean. Our floor was taken over by a group of Rugby players from New Zealand who unfortunately did not have a great deal of respect for the other guests and made alot of noise particularly around the communal TV areas-the staff knew what was going on but choose to ignore it. The breakfast was poor-there was very little to choose from. Basically this is probably the best value hotel to stay in in Sydney as far as price and location are concerned but housekeeping needs to be better and staff need to listen and take action on issues affecting guests,", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "2"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Excellent Location, 3 Star with 3 Star Service (Housekeeping sucks)”", "Author": "UpinderS", "ReviewID": "UR115033222", "Content": "I booked a King +1 bed room with pvt. bath for my family at AUD 171 per night (incl. breakfast) for 5 nights. Price wise its reasonable, esp. since AUD is going strong so its worth the price. Location is excellent. Downtown, Syd. Central, proximity to public transport (bus to bondi, Museum Metro station), monorail, etc. Beds were comfortable, blankets were dirty, carpet was dirty. Housekeeping didn't add any value as well, dirt on the carpet was same end of the day on couple of occasions. No specific place to keep your big luggage, TV location is too high to watch (neck hurts after some time). Breakfast is very basic, but fresh and same variety all the days. Still have the taste of those Croissants and corn-flakes :) Gotta pay AUD5 per person to get eggs, sausages, etc. Internet available at AUD 1 for 15min slot. No free Wi-Fi. Better get the pre-paid local data plan. Transport to Airport available at AUD 12 per person. Better book a cab if more than 3 people going to airport- turns out to be the same you'd be paying for shuttle service. All in all good experience, except the housekeeping.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "3.0", "Value": "2", "Service": "4"}, "AuthorLocation": "Christchurch, New Zealand", "Title": "“Ok room, poor facilities, average at best - expensive for what it was”", "Author": "michael_buddle", "ReviewID": "UR115031526", "Content": "A great location but an average stay. Checked in quickly and efficiently and all was good until the evening. The sliding door to the shared \"balcony\" didn't open, the toilet facilities were average (cleanliness wasn't great and the shower head didn't fit the holder so you had to wedge it just so), plus the fuse to the TV and in-room fridge shorted, meaning we couldn't watch movies and the fridge started to drip at about 2am! (to be fair, a night manager came up to check the TV when we complained and offered to get a new room for us, but it was 11pm so we declined) Free buffet breakfast in the morning as part of our package was welcome, even if it wasn't spectacular. However we had the cleaner trying to get in before we had checked out (despite a Do Not disturb sign on the door); this along with the points above and the almost unconcerned attitude of the reception staff to our concerns on checkout made this one place we will not go back to. For over AU$150 per night we expected much better.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Preston, United Kingdom", "Title": "“Too many problems, wouldn't stay again”", "Author": "ashulton", "ReviewID": "UR114667724", "Content": "I wouldn't stay here again. We booked in here for 5 nights and thought that it seemed like a good hotel on first impressions as they let us check into our room a few hours earlier than we would normally be allowed. Unfortunately it was all downhill from there. We had a double room with an ensuite bathroom which was on the 6th floor overlooking an enclosed garden. The bed was comfortable and we had some good nights sleep there, however the service from the front desk was appalling at times. It seemed that we had problem after problem. My cousin called the hotel and said that she left a message with reception for us, but we never got it, despite checking regularly with them. We then made use of the laundry and were told the wrong price and also the wrong length of time that the dryer takes so we ended up setting it off shortly before the laundry closed. Luckily no one came to close it! The third problem we had with them was that they didn't have a clue how much the calls cost from the room and we had to wait ages while they called the phone company to ask. The fourth problem was that my husband's pyjamas went missing! He left them on the bed and when we came back in the evening they were missing. We asked about it and nothing had been handed in. Lastly the hotel itself does not provide free wifi and the basic breakfast is very basic. You have to pay $5 extra for a cooked one. Tip - don't bother with the breakfast and buy something delicious from the place on the corner. I definitely wouldn't stay again.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Saint-Pierre De La Reunion, Reunion Island", "Title": "“Reasonable budget option, but avoid if it's relaxation you're after”", "Author": "Andy974", "ReviewID": "UR114296799", "Content": "The bizarrely named but modern Y Hotel Hyde Park is essentially an upmarket backpackers hostel. On our floor - the 6th - toilets & showers were communal and shared with the other guests on the floor (some of whom walked the corridors in their underpants to take a shower). This came as a surprise. The air-conditioned rooms are clean, and are equipped with small fridge and tea/coffee making facilities. The double bed was comfortable and the sheets were crisp and clean. Breakfast was a bit stressful because at peak times (between 8 and 9) all tables were taken and often queues started to form, with guests waiting to pounce on the first table to be vacated. It's in a good situation, and quite good value for money. However, if it's luxury or peace and quite you're after, this probably isn't for you.", "Date": "June 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Hamilton New Zealand", "Title": "“Location brilliant, breakfast can keep you going until mid-afternoon..”", "Author": "MumandSon_10", "ReviewID": "UR114151729", "Content": "I booked in here after reading reviews on Trip Advisor, & getting a really good deal on Agoda. It was rated overall in the top third of hotels,& this is justified.On arrival I was upgraded to an ensuite, which was a pleasant surprise (experienced by another recent reviewer.) The breakfasts are terrific, eaten slowly you can honestly live off it until lunchtime and beyond. There is a luggage storage available, the hotel is brilliantly located, Opera House, ferries, Bridge, Dept stores all within 20 minute walk, or even faster with the free bus doing an endless loop on Elizabeth Street. Only down side traffic noise, (also mentioned by another reviewer), even 7 floors up, it did wake me several times on my first night, but I coped. After all a fee of $150 NZ per night including breakfast with a compact but tidy room/ensuite, in the middle of Sydney did still meet my needs for 3 nights. The loud-mouthed oiks who woke me at 2am, on my first night there did shut up when I told them to ,otherwise I would have rung management, and I think they would have responded positively.", "Date": "June 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Basic, clean and simple 3 star hotel”", "Author": "fattwink", "ReviewID": "UR113288880", "Content": "My partner and I stayed in a deluxe room. We were in Sydney for an event and did not want to spend an arm and a leg on accommodation, which is exactly what Y Hotel Hyde Park was good for, budget accommodation. The rooms were clean and simple, although a little plain. The bathroom was a little outdated also, but was clean. Location wise, it is a 5-10 minute walk from the Museum train station or the free CBD shuttle bus. Overall, we would probably not go back to this hotel because we are more used to flashier hotels, but if we had a budget restriction or hotel prices were inflated due to events, we would definitely stay at Y Hotel again.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Auckland", "Title": "“Brilliant location, facilities and very friendly staff!”", "Author": "skodietk", "ReviewID": "UR113261436", "Content": "This hotel is reasonably priced for a double room with ensuite. Don't be fooled by it being the YWCA. Its not super modern or flash but respectable, clean, secure, tidy and friendly service. Breakfast included which was great value and the home-made warm croisants were to die for! The location is superb. We are definitley planning on going back there and have recommended to others.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Guildford, United Kingdom", "Title": "“Excellent value for money in a great location”", "Author": "Luce_87", "ReviewID": "UR112110658", "Content": "This hotel was fantastic value for money as we got a great deal on hotels.com. The hotel is located next to Hyde Park and is a 10 minute walk from the fantastic Darling Harbour. There were plenty of places to get food and Circular Quay is only a 25 minute walk. This might seem like a fairly long walk but you walk through Hyde Park which is lovely and you can opt to walk through the Botanical Gardens, which are beautiful on a sunny day. Our room was a very simple double room with a comfortable bed and a fridge. Unfortunately we had a problem with the air con which sparked and then turned part of the wall black! We immediately contacted reception. The manager was extremely apologetic and we were moved rooms in less than half an hour. Our new room had a balcony and we had our breakfast upgraded to full English instead of continential. Do not let this discourage you as this was just bad luck. The staff are very friendly and the internet isn't bad value. It's best used on the computers in the dining room rather than on a laptop in the rooms as the signal strength is weaker.", "Date": "June 7, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Malmo, Sweden", "Title": "“OK but not great”", "Author": "IandM", "ReviewID": "UR111663963", "Content": "This is an OK budget option, especially since it includes (a rather uninspiring) breakfast. It's more a hostel than a hotel, and if you think that's OK, you'll probably like this place. If you're after boutique or a fancier hotel standard and are prepared to pay more, stay somewhere else! There's also a big difference between the pricer rooms and the cheaper ones: again think hotel/hostel and you've got it. It's excellent value for money, though, so if that's a priority, this place is hard to beat. And the Surry Hills/Hyde Park location is nice.", "Date": "June 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Perth, Australia", "Title": "“It stinks!”", "Author": "honestly12", "ReviewID": "UR110535225", "Content": "My only problem really was that when we got to the room there was an overwhelming stench of sweat maybe. We were then offer the choice of two other rooms which equally stank! One however had balcony view, from inside, the doors don't open! In the end we had to open the windows for a couple of hours and spray the carpets with air freshners. p.s Out of the 3 rooms only the first one had windows to let in fresh air so if you got balcony view you have to stay with the smell! Also they have shared toilets as a hostel would. Very weird.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Surprised at how good this hotel was”", "Author": "sydneysurfer1990", "ReviewID": "UR110065781", "Content": "When booking for this hotel online I didn't think it would be very special seeing as it is a budget hotel. I was very surprised at how clean and how good the location was for touring Sydney. The service was very good, we got clean towels every day and everyone was very friendly. The continental breakfast was a bonus. I would definitely stay here again!", "Date": "May 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "upstate ny", "Title": "“Very nice”", "Author": "grant8370", "ReviewID": "UR107851639", "Content": "NGood location, breakfast and rooms. It was a bit noisey in the middle of the night,", "Date": "May 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "England", "Title": "“Great little place”", "Author": "dancingqueenuk", "ReviewID": "UR107152109", "Content": "We stayed here in a female four bed room, and a double room. Both rooms were quite modern and good value for Sydney. The beds were made everyday and you were given clean towels daily. The free continental breakfast was a bonus. From the hotel you could walk to the bus stop to take you around Sydney and supermarkets and other shops were in walking distance - a good location for the price. The staff were friendly at the front desk. The rooms could have been a bit cleaner- a bit dusty around the corners but that's the only negative. I would stay here again.", "Date": "May 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Leeds", "Title": "“Good value place in the centre of Sydney”", "Author": "Mark098", "ReviewID": "UR106081728", "Content": "The rooms are basic and little worn but perfectly adequate and very good value especially considering the location. We were on the 6th floor and there was still some traffic noise but that may just be the price to pay for the location.", "Date": "April 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Excellent budget option in the middle of Sydney”", "Author": "glennomeister", "ReviewID": "UR105741260", "Content": "Have stayed here twice now. Fairly basic rooms but certainly not bad and fine for the price. We stayed in shared facilities rooms but there are ensuite rooms as well. Continental breakfast is included in the room rate. The location on Wentworth St just near the south east corner of Hyde Park (short walk from Museum Station) is excellent. Payment is expected upon check in.", "Date": "April 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "New Zealand", "Title": "“A Bit Smelly”", "Author": "Shaz024", "ReviewID": "UR102097595", "Content": "When I got there someone was complaining at the reception desk that the rooms looked nothing like the pictures, and I have to say thats true. This backpackers hotel is very good value so I guess you get what you pay for but I did not expect it to smell bad. When I walked in to the room I could smell a real musty smell coming from the vent and the communal female toilets also had a smell like they hadn't been cleaned in a week.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ipoh, Malaysia", "Title": "“Great location, can't go wrong for the price”", "Author": "lunarJade", "ReviewID": "UR101465041", "Content": "We stayed three nights at Y Hotel Hyde Park recently (twin private room, shared bathroom). Generally clean and surprisingly, we never had to wait to have a shower or use the toilet. Especially liked its central location in CBD, near Hyde Park and bus stops with Museum being the closest train station. It's walking distance to QVB and Chinatown. For the price we paid for the accommodation inclusive of breakfast, it is great value for money. The continental breakfast was basic but pretty good. We would not hesitate to stay here again on our next visit to Sydney.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“The Bed Bugs Bite!”", "Author": "FelicityJade", "ReviewID": "UR100684910", "Content": "My friend and I stayed in a twin room for two evenings. The room was a great size for travelers that only need a bed for a couple nights. Fantastic location, only 50 meters or so from Museum station. The room was also very quiet, surprisingly. as it was on a main road. On the downside (Sorry there's a few things) the Television was located in the wardrobe and kept loosing signal. This was very frustrating when we were trying to keep up to date with the World news. My friend and I suffered from bed bug bites all over our body. The nasty things bit everywhere, even on our palms and face. Management took this situation seriously after we asked them to double check the beds and they found traces of the bugs. (They first denied that there was no traces) The Management team resolved the issue by calling in exterminators and refunding us for one night stay. Would defiantly not stay here again.", "Date": "March 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "australia", "Title": "“Excellent location, comfortable room at a reasonable price”", "Author": "kirkw00d", "ReviewID": "UR99335667", "Content": "We stayed one night in a twin room with ensuite and were happy overall. The room was a good size and the beds were very comfortable. The bathroom was small but functional. The room and bedding were very clean, although some of the grouting in the shower and on the bathroom floor was discoloured. One less satisfactory aspect of the room was the bizarre location of the television on the top shelf of the wardrobe at one end of the room (the photo of the twin room on the hotel website shows the television hanging on the wall opposite the beds). The included self-service continental breakfast was basic (juice, selection of cereals, breads and croissants, coffee and tea) but was tasty and plentiful. The reception staff were pleasant and efficient. A major advantage of this hotel is its good location at one end of Hyde Park, within walking distance of Central Station and most of the major sights of the city centre, and with good access to public transport.", "Date": "March 7, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Good location, but that's it....”", "Author": "bmadel", "ReviewID": "UR98308215", "Content": "Very unhappy with this hotel. Yes its a budget hotel but I still expected better. Rooms terrible, smell very bad! Bathroom smelt and had ants... Discovered bed bugs!! Not cool!! Tv in wardrobe... with fridge... good location but that's it. not recommending and will never stay again! oh and fire and evacuation alarm went off at 7am for no reason...", "Date": "February 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "melbourne", "Title": "“Great Vaule for Money.”", "Author": "nthmelb", "ReviewID": "UR96645103", "Content": "For the price you pay for this budget hotel, the hotel is great. You pay exactly for what you get. Room was very clean, Aircon worked great, Tv was fine. Shared Bathrooms were spotless. Never had to wait for a toliet or shower.. Breakfast was more than fine... Great budget Hotel...", "Date": "February 14, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Pennsylvania", "Title": "“For hygiene reason, I won't stay”", "Author": "gaby_pa", "ReviewID": "UR96555248", "Content": "As stated in the Y Hotel web site, taxi ride from airport is $25. This information is not up-to-date. We paid $48 for one-way taxi ride from the international terminal to Y Hotel Hyde Park. I suggest taking the airport shuttle for $14 per person. Get $2 coupon from the brochure or online reservation. Y Hotel is strategically located opposite the Hyde Park. If you like Korean food, it is just one block away on Liverpool Street (exit the hotel then turn left). Woolworth supermarket is on George Street, about 10 minutes walk. Free Wi-Fi is available at nearby McDonalds. For inexpensive dinner, walk along Oxford St. Breakfast is very much basic. It is all-you-can-eat bread, mini croissants, tea and coffee. For hot meal (eggs, bacon, hash browns), $5 is charged. We were disgusted with the male common bathroom on 6th floor. I told the front desk there were no liquid hand soap. Until the day we checked out, still there was no soap. How can you leave the bathroom without washing your hands with soap? My friend had diarrhea on the first day we stayed. The brown stains in the closet was not scrubbed or cleaned. Again, we questioned the bathroom cleanliness with the front desk on day one. They replied it would be cleaned. But when we checked out, nothing was done. The manager on duty was not available. As a conclusion, if you care about basic hygiene, we do not recommend to stay at this hotel. The bathroom at the gas station is cleaner than the bathroom on the 6th floor.", "Date": "February 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "england", "Title": "“Great place to stay.”", "Author": "20050156", "ReviewID": "UR96105239", "Content": "When booking this hotel i got it at a cheap price, so i was expecting a bit of a dive. But to my suprise it is an amazing place to stay. The staff cannot do enough for you, the room are spacious and very clean. It is in an amazing location just a few mins walk to the centre of sydeny, seconds from the hussle and bussle of Oxford street. it is an all round great place to stay.", "Date": "February 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“A Well Located Good Value Hotel”", "Author": "Dazc459", "ReviewID": "UR93857246", "Content": "We stayed at the hotel over Christmas, and were very happy with all aspects of our stay. We stayed in a room with a bathroom located just along the hall, and the room was good value, particularly over the Christmas period where prices for accommodation in Sydney increase significantly. We found the staff to be very helpful, and the food from the cafe was of a good quality. Whilst the decor in the common parts was a bit dated, the hotel was clean and we would definately stay again should we revisit Sydney.", "Date": "January 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Very good value for Sydney”", "Author": "winzouze", "ReviewID": "UR92819161", "Content": "Cheap, clean, nice breakfast, very small room, but clean. Shared bathroom ok, private bathroom no idea of how it looks like. Ideal location, right at the center of Sydney, making it very easy to visit the city, either by bus, or underground.", "Date": "January 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Verwood, United Kingdom", "Title": "“Excellent value for money”", "Author": "ruthtraveller", "ReviewID": "UR92301045", "Content": "Stayed at the Y Hotel for over two weeks. It was an excellent base for exploring Sydney with Hyde Park on the doorstep for those 'chill out' times. Everything was clean and very well organized. I had a single room with TV, fridge and tea/coffee facilties. It was a light and airy room with plenty of space. The shared toilets and showers were kept very clean and were only a few steps away. The only minus was probably the shower temperature as it fluctuated a lot during busy times. The kitchen facilities were a little sparse with really just a microwave. The breakfast provided was good with plenty of everything to set you up for the day. Overall was a very good place to stay for a longer period.", "Date": "January 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“A lovely central place to stay and great value too”", "Author": "Punka_3", "ReviewID": "UR90452563", "Content": "The room was clean and the bed. comfortable with good facilities such as air con, Internet access (a fee applies), fridge, tea/coffee facilities and a great quality breakfast. The only thing missing was an ensuite bathroom, but the communal bathrooms were close-by and clean so it wasn't too much bother. I'd definitely stay here again.", "Date": "December 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Auckland", "Title": "“Close to all city sights-good hotel”", "Author": "kiwideni", "ReviewID": "UR88154683", "Content": "This hotel was perfect for my sister and I. We spent 4 nights in this hotel in a twin room on the 7th floor. While it's not 5 star it was definitely comfortable and exactly what you need if you spend all day out in the city exploring and only come back to sleep! Our room was quite small had two single beds, a desk with 2 chairs and a wardrobe which contained the tv, mini fridge, plastic kettle, coffees, tea and milk. The only thing the room didn't have was an ensuite bathroom. There were shared facilities on every floor although there are rooms available with an ensuite. The shared facilities included 2 toilets and 2 showers and were kept reasonably clean. We had a continental breakfast included in our stay which was basic but enough to get you started for the day. There is also a kitchen located on the 3rd floor but is only open during certain hours. This hotel is a great base hotel for the city. Less than 5 minutes walk to the shopping district, 10 mins to Darling Harbour about 15-20 mins to The Opera House and pretty much opposite Hyde Park. The Museum train station is also the closest train station being right around the corner. All in all a very basic hotel but a great place to stay, I will be staying here again when i return to Sydney!Only thing I would recommend is asking for a room away from the street as it can get quite nosy at night with police and ambulances coming past at night.", "Date": "November 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Australia", "Title": "“Last place I'd ever choose to go again”", "Author": "ColossalYouth", "ReviewID": "UR87629292", "Content": "I had to take my wife to Sydney for a hospital appointment and the booking of the hotel was rushed, so I chose this place without doing much research. I had believed that, for $185 per night I might get a decent room etc. I realised it was part of the YHA but thought this was a flagship hotel and, for the price, would be more plush. We arrived to discover that checking in was more like trying to get planning permission from the local council. When we eventually got to the room it was stark, drab, worn and freezing cold...the air-con was broken. I thought that perhaps opening the doors onto the verandah might get in some warmer air, but after pushing through the \"grey with age\" net curtains and dragging the screeching door back I was presented with a \"dog-end strewn\" concrete rectangle. My wife suffers with arthritis and the cold air and, frankly, depressing aura in the room was not making her a happy bunny. Having not touched anything in the room we decided to checkout immediately. The manageress was summoned by the receptionist and we had another unpleasant experience. The manageress was very young and unpleasant. She didn't care about our experience, just that \"we had booked so can't cancel\". We eventually got a $20 refund! So ended up $165 out of pocket and with NOTHING in the way of an apology...the manageress treated the encounter more like we were crossing swords in a divorce court. We moved up the road to the Sheraton where, for $243 per night were treated with respect and had a very comfortable room. At $185 per night these people need to provide something a little bit less like a hostel for the homeless and they need to treat guests with some respect. With other \"proper\" hotels charging the same or only slightly more, this is a no go. NEVER AGAIN!", "Date": "November 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Rome, Italy", "Title": "“never again”", "Author": "doerthe", "ReviewID": "UR87122569", "Content": "This 3.5 star hotel is no better than backpackers accommodation. it does not have a telephone in the room. The promised internet access didn't work. The room decor appears to be from the last century. The room smell made me puke. The room is laud. The service was unfriendly. I have stayed in about 7 different Sydney hotels in the last 3 month. This the by far the worst. Never again.", "Date": "November 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ashford, United Kingdom", "Title": "“Excellent choice of Hotel.”", "Author": "worrabsj", "ReviewID": "UR85148720", "Content": "An extremely good value hotel for our stay in Sydney. The rooms were clean, shared toilet facilities were spotless and the continental breakfast was more than adequate to start the day. The staff could'nt do enough for us and in particular Sunawee on the front desk really put herself out for us when organising a tour. It was an ideal location for visiting the sights with the free buses just round the corner or everything within a short walking distance. Will definitely use this hotel when we return to Sydney in the not to distant future.", "Date": "October 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "traveling!", "Title": "“you'll find better, though wouldn't mind returning”", "Author": "ruysolorzano", "ReviewID": "UR81459208", "Content": "Location is the key element in this hotel. The rooms are small and average, with a strong (really strong) smell of cleaning liquids (I realize you can diminish the smell if you turn of the AC or, better, if you put in on heater... since the AC is the one \"perfumed\" with those antiseptic aromas!). Good for 2 or 3 nights.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Small but clean and comfortable rooms, good services and in a great location”", "Author": "CultureClaire", "ReviewID": "UR80554513", "Content": "We stayed in a 'deluxe' room (I think that's what it was called), which in reality is deluxe for a hostel, not a hotel. But, having moved from a noisy and cold hotel elsewhere in Sydney, we found the Y on the Park great - the rooms and bathrooms are pretty small but very clean and comfortable, and very quiet. There's internet, laundry, a basic breakfast (which you can upgrade to a lovely cooked breakfast for about $5) and the staff are very helpful. We stayed there at the end of winter and the airconditionin/heating unit wasn't working properly in the room. We called reception and they arranged for it to be fixed while we were out that night. It's in a good location - just a short walk across the park to central Sydney. I don't know what kind of room rates you would get booking on the internet, but we booked through a tourist information centre in Sydney and got a double room with breakfast for $107, a very good price for this area. I would definitely recommend this place if you are on a budget but don't want to stay in a shabby hostel or old-fashioned B&B.", "Date": "September 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“I do not know what planet it is from?”", "Author": "milescheifetz", "ReviewID": "UR78321921", "Content": "The reason why I state this is that every time the lift opened, it feeled like a sci-fi movie, in a different world. Lvl 3, where you obtain ice (as it is not delivered to room) was where I encountered people sitting in corridor, who told me to shut-up as their kids were sleeping. Kitchen was closed, and in the end, could not get ice. Next level was like an office block; one above that appeared to be an art gallery. Bathroom dated and rusty, kitchen facilities in room ok, ironing board had no cover-had to use towel, door would not open to balcony, reception lazy & would not rise off chair, but did give me towels...if you go down to get them. Restaurant not open for dinner, reasonable prices for lunch, good for breakfast. Was not worth $400 for 2 nights; more like $50. A good place for an hour or so. Ending on a positive note, they did let us sleep till 1 pm, instead of 11.", "Date": "September 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Y hyde park - very good stay, better if not over the street”", "Author": "asorairam", "ReviewID": "UR77928183", "Content": "Booked a double room for my parents there, following the past opinions on this website. They stayed 19-26 August 2010, winter was finishing (no bed bugs yet, if any), in a double ensuite with third bed, wheelchair accessible (wasn't our need) They stayed as well for one other night on 1st Septemper always in a double ensuite, this time with no third bed. FIRST ROOM: very big, it is a double ensuite but hosts as well a third bed (which takes out some more room that could be needed to access the wardrobe but it's perfectly fine). Clean and tidy at arrival, on the second day the bed wasn't done properly (just pulled the blankets back up, without even replacing the quilt in the right position - it was almost only on one side when we left and we found it so) We noticed as well that the upper shelf inside the wardrobe wasn't clean at all, we just placed our luggage there so no problems but you could notice the black shadows after putting the suitcase on the white linen. Bed is confortable, electric plugs are right behind it (just follow the cable from the bedside lamp), one is inside the bathroom and there was another inside the wardrobe right next to the drawers. Maybe the curtains do not shade enough the light, the room doesn't face the sun directly but it is likely that you are woken up by the light coming in (if sensible to light like me at least, mum told me she woke up at 6.30am and thought the light was on). As well, since the room was above the road, they heard traffic noises, especially from ambulances who passed quite often. BATHROOM clean, the room is wheelchair accessible so no separation between shower and rest of the bathroom but good pavement system that prevented ponds to stay there :). Both shower, mirror and sink were at lower heights, still for the wheelchair access (unconfortable mostly for the shower which couldn't move up the structure). A bit unconfortable having the horizontal bar at the back of the WC, but the most inconvenient thing (and craziest I've seen so far) is the mirror placed on another wall then above the sink: how am I supposed to make up (if woman) or shave (if man) or wear contacts (either sex)?? You know, I usually wash my face right before (and in case of shaving, even after)... SECOND ROOM: much smaller than the first one, obviously, but still very wide to live in. Not being wheelchair accessible, bathroom was again much smaller but with things set higher (mirror, sink, toilet) and shower separated by a glass door. Mirror this time was above the sink ;) This one was facing the inside courtyard of the building, and was much quieter. I recommend trying to get one of these if you're very sensible to traffic sounds or you live in a very quiet place. ALL ROOMS are provided with fridge, safe and a kettle to make your own tea (teabags are also there). On the booklet it says you can have a hairdryer by leaving a refundable deposit at the reception but we found one in the drawers (some previous guests left it). Anyway, if you don't want to carry your hairdryer this migth help. BREAKFAST: continental breakfast provided consists in cereals, milk (cold), hot tea and hot coffee, jams, bread (to be toasted on a sort of open-oven which is veeeery slow to heat up things, much slower than a toaster anyway). There is an upgrade to a \"full breakfast\" available for 4.50$, I guess that includes bacon&eggs and alike 'cause we've seen people eating them; but we didn't feel the need to upgrade. KITCHEN: no real cooking facilities: you can heat up something already made, but do not expect to cook from scratch ;). It's on the 3rd floor and there is only a few cutleries, a microwave and tea/coffee/sugar to replace that in your room. Haven't seen the kettle, but might as well be there. The microwave can be used to enjoy the lunch available at the reception (6$ presenting your room key, in winter it's a soup and sandwich). CHECK-IN/OUT INFO: check in is usually after 1pm/2pm, especially if the rooms are still to be cleaned. Check-out must be done by 11am. In both cases the hotel has a locked room (opened by the receptionist on request) and some safe lockers to keep your luggage for the half day you may need, without any extra charge. NOTES: Environmentally-friendly contradiction: customers have the possibilities to not have the bed sheets changed (they would do it every 3rd day of your stay) by placing a certain card on the bed in the morning when they leave the room (card do be found next to the hotel textbook of instructions) and as well they can choose the towels not to be changed (don't know how often they would do it) by hanging them on the bathroom racks (otherwise, just leave them on the floor). As a contradiction, hand soap is changed each and every day even though it's just slightly used.", "Date": "September 2, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Schweiz", "Title": "“Large & Central”", "Author": "sildenaviel", "ReviewID": "UR68991248", "Content": "Very large former hostel with small, quite basic rooms. Reasonably quiet. The included breakfast covers only basics, everything else is charged extra. Overall rating should not be more than two stars. Therefore, the hotel is a bit on the expensive side. The location is convinient for sightseeing an shopping, but not prime. Overall, I would only choose this hotel again for a very good deal.", "Date": "June 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bath", "Title": "“Love this place”", "Author": "Travellerpop", "ReviewID": "UR68049672", "Content": "Great location and there is a lundry in the building, the free breakfast is good and the rooms are not bad. They are not five star but fine for a budget place in sydney and I would definitely stay here again. Book online though as when you book at the front desk it costs more weirdly.", "Date": "June 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Auckland", "Title": "“Great location, clean, helpful staff”", "Author": "Fernweh2007", "ReviewID": "UR67228033", "Content": "We stayed at the Y Hotel Hyde Park during May 2010 in a double with shared bathroom. The best thing about this hotel is definitely its location, with most of the city centre in 15 to 20 minutes distance. It is pretty much at the southern fringe of the area that most tourists would be interested in. The room itself is very small. Just enough room to walk around the bed. But there is a TV, a small fridge, a small desk and a safe. Very clean, but my senses suggested that there were quite some dust mites in the cover sheet. We solved that problem by requesting an additional blanket to cover it. Staff at the reception was very helpful in this regard (as they were with other requests we had, e.g. plates and cutlery for self catering). We had one single bathroom (shower, toilet) for disabled directly on our door step and other shared facilities reasonably close by. Overall very clean. Towels were changed daily. We were happy with the continental breakfast. Everything that one would expect from a continental breakfast with a really good choice of cereals, toast and jam, coffee/tea and even pain au chocolat. We had read mixed reviews on this hotel/hostel before and had kept our expectations low. With that as a starting point we were happy and we would stay again at this place. But bear in mind, this is really a mix of a hotel and a hostel. If you wish to stay at a nice hotel you may be disappointed. If you look for a nice hostel (upper range), this may just be your choice. Should we come back to Sydney it will probably be again our choice.", "Date": "June 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Thunder Bay, Canada", "Title": "“Good Budget Place to Stay in Sydney, Australia”", "Author": "worldtravellers123", "ReviewID": "UR66103835", "Content": "Y Hotel Sydney This is my review of the time I spent staying at the Y Hotel IN Sydney, Australia I stayed here as my first spot to stay on Arrival in Sydney. It was very easy to access and not far at all from the airport. It was easy access to get to the Opera House and Sydney harbour, an only 15 minute walk. As well a free bus service was offered with the stop just outside of the door of the hotel. Very easy access to Hyde Park, as well several food stores and eating places within easy walking distance of the hotel. The hotel itself was quite basic but good. It had a good check in process. As I was early, they did offer a luggage storage area. Then later in the afternoon, I had quick check in and good run down of the area. Easy access to get to my room and the elevator worked very well. Room was very basic, but the price was right for what one would be getting. It was funny how the TV was located in the closet and I had to watch it sideways from the bed, otherwise ok. Had a good selection of coffee and tea with a nice water kettle. Bathroom was good size and provided a good hot shower on demand and very good. Plenty of clean white towels were provided as well on the stay. Not much of a view from outside of the window, but that was ok. As well, the hotel provided a decent included breakfast every morning. From toast and cereal, as well plenty of coffee and juices, very nice. Overall, I would recommend this hotel for anyone on a budget who wants to be near downtown Sydney and have easy access to the Harbour, but are not afraid to walk there. I would recommend this hotel for Single people or even families and couples on a small budget. I would suggest anyone to stay at this hotel when in Sydney, Australia.", "Date": "June 1, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Good price but horrible stay!!”", "Author": "trak83", "ReviewID": "UR64348298", "Content": "My partner and I booked the Y Hotel with 3 of our friends (3 rooms in total) for a weekend to celebrate my partner's birthday. The location was pretty good but the hotel was shocking! We paid the extra and had the deluxe rooms which looked nice on the website but were horrible in reality. The rooms were very small and dirty, with stains on sheets, walls and floors. The bed was uncomfortable, really hard with bed bug. The mini bar was empty and the TV mentioned on the site was extremely small and was placed inside the wardrobe on the top shelf so you couldn't see it from the bed (there was nowhere else you could site in the room.) Continental breakfast buffet was included in the price but we paid extra to upgrade to a full breakfast. Not worth the money!! The food was inedible and we needed to find a cafe to get a proper meal. They also run out of danishes, bread and milk at 7.30 in the morning, so continental wasn't really an option. I'm glad we only stayed there for the weekend, though I would have paid more to go elsewhere!!", "Date": "May 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Madison, Wisconsin", "Title": "“Price was right, but glad I didn't spend a lot of time there”", "Author": "knickertraveler711", "ReviewID": "UR61952610", "Content": "The location and price (WELL below other hotels in Sydney) attracted me to the Y Hotel Sydney, plus I found several reviews indicating it was safe and generally clean. I was in a single room with bath. The room itself was incredibly small but adequate. I was surprised that it even included a small refrigerator, hair dryer and safe. As far as cleanliness ... well, the bathroom was spotless and cleaned daily, the carpet passable, and sheets were clean. However, memories of the bedspread still linger. It was a dark sueded fabric on the outside, with a quilted off-white fabric on the underside. The underside had several large, unsightly stains, so unpleasant looking that I could scarcely bring myself to touch the bedspread. In hindsight, I should have called and asked for a clean one. Suffice it to say the Y Hotel would do well to revisit its bedspread cleaning schedule, this colored (literally) my stay there.", "Date": "April 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Ijsselstein, The Netherlands", "Title": "“Good location, but dirty!”", "Author": "Ingriddv", "ReviewID": "UR60172003", "Content": "Three years ago my husband and I stayed at the Y hotel City South. We were impressed by this hotel, but because it is a bit further away from the city center we booked the Y hotel Hyde Park this time. After entering the room we immediately regret that we booked this hotel. The room was dirty: blood stains on the carpet and lots of dust everywhere (especially in the airconditioning and exhaust fan ducts!). Beside that the air in the room was terrible and the bed unconfortable. The location of this hotel is great, but next time we stay in Sydney, we will book the Y hotel City South again.", "Date": "April 2, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "merseyside", "Title": "“Ask for a room change if you're not satisfied!”", "Author": "rei11y", "ReviewID": "UR60005067", "Content": "We arrived at the hotel around 9pm after flying to sydney expecting a lovely room as the pictures on the website suggested... we were in for a shock. we got into our room and it was grubby, it smelled musty, it was worn down and scruffy, the air conditioning didn't work and the drawers were grotty =\\ yuk. we were travelling to bondi the next day for a few days then returning to the same hotel for the weekend and were absolutely dreading it. when we arrived back on the saturday morning the lady on reception handed us the room card with the samenumber room we had stayed in so we refused to stay in it. we told her about when we had stayed in it a few nights previously and she was quite snotty and rude with us. she gasve us a key card for a room on the 8th floor and said she doubted there would be much difference but it was the best she could do! haha lovely customer service. we got to our room on the 8th floor and literally prayed to god before we stepped in. we couldn't believe the difference it was like a different hotel absolutely lovely room. even the shared facilities were nicer! my advice for this hotel is if you go and get a horrible room demand a room change you may be pleasantly suprised!", "Date": "March 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Very Clean, Great Location”", "Author": "travellingwings", "ReviewID": "UR56742211", "Content": "We stayed in a double ensuite room in the Y Hotel for 5 night in January. The rooms were very clean and well equipped with good facilities. This hotel is centrally located and great value for money. The rate includes a basic breakfast. The cafe was not open while we were staying. They have good internet facilities and the reception will organise a shuttle bus to bring you to and from the airport. All the hotel staff were very friendly. Most of Sydney's main attractions are in walking distance and there is a bus stop to Coogee beach and Bondi beach around the corner from the hotel. All in all our experience was very good at the Y hotel and I would stay again if we return to Sydney.", "Date": "February 22, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Australia", "Title": "“Well located, good, clean basic hotel”", "Author": "JeremyAustralia", "ReviewID": "UR56723997", "Content": "I recently stayed at the Y Hotel Hyde Park for a conference that was being held at the hotel. Whilst I had requested a room with an en-suite bathroom, these were all booked, and only a \"traditional room\" with a shared bathroom was available. I was expecting a very basic hotel with basic facilities, and that is what the Y Hotel had on offer. The room, whilst very small (barely larger than the double bed) was clean. The bed was comfortable and the linen was good. It was perfectly adequate and good value for the price (about $75 per night). My only gripe was the shared bathrooms. There was 1 male bathroom on the floor with 1 shower and 2 toilet cubicles. Thankfully I was up early enough not to encounter too much traffic, but this seemed less than adequate for the number of rooms. Overall, the Y Hotel met with my expectations for it (which were quite low), and was pleasant enough. Next time in Sydney, I will be back staying at my usual hotel - the Shangri La (although at 5 times the price).", "Date": "February 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Hove, United Kingdom", "Title": "“Great location but a little drab”", "Author": "Mlinaqetu", "ReviewID": "UR53499265", "Content": "We booked into a clean en suite double room. It was basic and not too roomy, but for the location it met our needs. The hotel booklet asked that if you want to boil the kettle to do it in the bathroom whilst having a shower due to the thermal heat detectors in the room.... A continental breakfast is currently included in the price with the option of upgrading to a hot egg and bacon breakfast for $4.50 each. We chose this hotel as it was advertised as having parking available, on arrival we found that the parking is in a private multi storey car park a couple of blocks away and it cost $20. This wasn't ideal but as we were there it had to do. This hotel is in a really good location, near to shops, especially Coles supermarket. The Harbour Bridge and Opera House are in walking distance.", "Date": "January 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "cheshire", "Title": "“Good budget accommodation”", "Author": "rowvet", "ReviewID": "UR52992754", "Content": "A very good hotel in a reasonable location - with very good transport links. They were very helpful as we had to check in later than anticipated and our luggage actually arrived after us. Good breakfast which is included if you are in a double room although you may have to pay if in a dorm.", "Date": "January 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mumbai04", "Title": "“Nice stay”", "Author": "mumbaicity", "ReviewID": "UR50552388", "Content": "A nice and non-expensive hotel. There are many kinds of rooms and as a student I chose to share it with one more girl. The rooms were clean and airy. I had to share the toilet but it was quite clean. The overall experience was good and would like to stay here again if I visit Sydney. The location is pretty good as it is not very far from Darling Harbor.", "Date": "December 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Oodnadatta, Australia", "Title": "“This hotel is easily Sydney's best value hotel.”", "Author": "NuggetAdelaide", "ReviewID": "UR49159288", "Content": "The Y hotel is close tothe CBD and within walking distance of most of Sydney's inner attractions. There is the Hyde Park opposite and plenty of public transport nearby (including the Museum railway station). The hotel is very clean and they give you a breakfast every morning. The Y is not a luxury hotel but makes up for this with friendly, courteous staff and easy acessability.", "Date": "November 14, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Sydney", "Title": "“Depends on the room type!”", "Author": "red0ne77", "ReviewID": "UR49089953", "Content": "I stayed in a standard room that had shared bathroom facilities- and would not recommend this. The shared bathrooms were pretty grim, and i upgraged to an ensuite which was far better. If you are going to this hotel, dont expect luxurious communal facilites or particularly friendly staff and make sure you stay in an ensuite room!", "Date": "November 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Christchurch, New Zealand", "Title": "“excellent location and great customer service”", "Author": "paula-from-nz", "ReviewID": "UR44343380", "Content": "A huge thank you to Billy(?) at reception who went out of his way to get us to the airport on time when our booked shuttle bus didn't up. He rang and gave the company a good talking to and then went out of his way to ensure we weren't late to catch our plane. The hotel itself has fairly basic rooms. We had a twin with shared bathroom facilities - which were nice and clean. Breakfast was included and basic with just toast and cereal, tea and coffee but for the price you can't complain. There were lots of choices of spread and cereal and they also do hot breakfasts for a small additional charge. The location is great, just a very short walk to museum station - maybe 3 minutes away. I would stay here again, you can't beat the location and the price is very reasonable.", "Date": "September 25, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Charleston, South Carolina", "Title": "“Perfect Location”", "Author": "mjwriter", "ReviewID": "UR32423810", "Content": "For the price you can't really go wrong with this choice. Even if you are a thirty- something like me, you will find a room to your liking. My sister and I stayed in a twin with en suite bath and really enjoyed ourselves. first of all, the location is great. You are a few minutes walk to the subway, dining and a pharmacy. it is rather run down so don't expect it to be really nice. However, it is comfortable and where we were (in the back away from the smoking rooms) we rarely heard any noise. They also have a laundry ($2 a load) and a cafe downstairs where you get cereal in the morning with the price of your room or you can pay extra for a cooked breakfast. We felt really safe there and we were two women traveling. The carpet was rather nasty so make sure you take footies or something. Just expect it to look like a hostel and you will not be disappointed.", "Date": "June 16, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "3.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Manchester", "Title": "“Good cheap base to explore the city”", "Author": "HelsInTheSun", "ReviewID": "UR28936585", "Content": "The reception area of the hotel was quite modern and spacious. When we arrived we were told that our rooms were ready which was good. We checked in very fast and arrived at our room. It was very small with a musty smell about it. It was clean(ish) but the room was very small with a tiny double bed to share (we had asked for a twin room). It was ok for a base to explore the city although I did feel that we were quite a bit of a walk out of everything and as we were only there for a few days I would have rather been closer to the centre so that we were not wasting time getting around. For the money that we paid for the room though I cant complain and we actually got breakfast included in the price too which was good to start the day! After travelling up the east coast of Oz we came back to the Y on the Park hotel for the last two nights and we were given a much nicer room on a higher floor with two twin beds and a little bit more space. This made a huge difference to our stay although the rooms still smelt musty and the room next door was being fumigated as there had been ants come in from the balcony. We shared facilities and each and everytime I used them I was suprised at how clean they were, so I could not fault them at this. On the last day of checking out, the manager Billy or Bobbie (shaven head from middle east) helped me with a problem I had with my airline and he spent time on the phone helping me out which I thought was very kind of him. I would recoemmend people stay here if they are on a budget but would like to explore this expensive city!", "Date": "April 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Tokyo", "Title": "“Given the location and price, very good indeed.”", "Author": "tnbms16", "ReviewID": "UR25665296", "Content": "Within easy walk of the harbour, and Hyde Park right on the doorstep. The room was small but had everything I needed, including a safebox. Staff were helpful, though perhaps not quite as efficient as they could be. Breakfast OK. Internet. All in all, a hassle-free place to stay.", "Date": "March 5, 2009"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "England", "Title": "“Perfect for New Year with friends”", "Author": "kat1978", "ReviewID": "UR23519898", "Content": "Selected the Y on the basis of price over New Year in Sydney. Booked through the hotel website originally for 2 nights, but later emailed them to extend to 4 nights and received prompt emails back to sort this out. On arrival we were pleasantly surprised. Our triple traditional room was quite spacious with a big window over a balcony (which for safety reasons we could open or go out onto?). The shared bathroom was very clean and we rarely saw anyone else in it so felt very comfortable in there. The location on Hyde Park is great, a few restaurants and a 7/11 are close by. Darling Harbour is just 10 mins walk and the Opera House about 15-20 mins. The included breakfast was decent with a large bowl of cereal, toast and juice/ coffee, setting us up well enough for the day. The reception staff were helpful and we had no problems leaving our luggage in the store room on the final day, then coming back and using the bathrooms before heading off to the airport. Based on price alone, I would recommend here anyway - but additionally it is certainly a comfortable, well-located base from which to explore Sydney.", "Date": "January 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sheffield, UK", "Title": "“Good location, value for money and clean.”", "Author": "KennyM83", "ReviewID": "UR20362177", "Content": "When we planned our backpacking trip of Australia in 2006 we expected that some of the places we would turn out to be actually not very nice, however, almost without exception, the places we ended up staying were extremely pleasing. The Y on the Park in Sydney was great value for money and had a location which meant it was easy to reach the major attractions of the city â€“ especially the landmarks. The communal areas of the property had a good atmosphere and the staff were extremely helpful when we were looking for information, directions and to book excursions. There was some basic food provision in the communal area which were available during normal â€œofficeâ€� hours, however, vending machines made up for this small gap. We booked a private room and were given a complementary upgrade to one with a bathroom when we checked in. The room was clean and the bed comfortable.", "Date": "September 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“Good budget hotel with great location”", "Author": "garryoak", "ReviewID": "UR18484783", "Content": "We stayed at the Y Hotel for 4 nights in a double deluxe room. The room was nothing special, but it was clean and was adequate for our needs. The included breakfast was cereal, toast, and juice - again, nothing outstanding, but it was fine. What really makes this hotel worth staying at is the great location for the price. It is right across Liverpool Street from Hyde Park and a five minute walk to Museum train station. It's about a 20 minute walk through Hyde Park and along McQuarrie Street to Circular Quay and the Opera House. The hotel is also located right at the beginning of Oxford Street, with lots of shopping and restaurants. I would definitely stay here again if I was looking for moderately priced accommodation in Sydney.", "Date": "July 31, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Napier, New Zealand", "Title": "“pleasantly surprised... eventually!”", "Author": "ruthzmail", "ReviewID": "UR16862543", "Content": "Having read the reviews on T.A. we arrived at the Y with some trepidation. We had booked 5 nights there after much searching for reasonably priced , but not too basic accommodation. We were given our room key and were really upset at the room, described as Double Deluxe, it was very small, the TV was on the top shelf in the wardrobe at the side of the bed! it would have been impossible to see it and nowhere to sit. We went straight back to reception and they patiently found us another room for our first night , a really nice 2 king bedded room!! The 2nd night we were moved to a very pleasant king bedded studio, which was perfect for our needs, even had a balcony. The staff were all very friendly, efficient and helpful and i would recommend the Y to budget conscious travellers who don't expect 5 star luxury. The 'free' breakfast was adequate and we just bought extras from the very nearby supermarket to make it more interesting. Cooked is available at very reasonable extra cost. The hotel is so well located, it would be had to imagine a better location, especially if, like us, you want to walk everywhere! All the main sites were within a 15 minute walk. There is traffic noise, it's slap bang in the CBD, but the actual hotel was very quiet. We would definitely stay again and would recommend to selected friends! Sydney was GREAT, so much to do and not enough time!!", "Date": "June 11, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Rotterdam, The Netherlands", "Title": "“expensive for what you get...”", "Author": "vike010", "ReviewID": "UR16480677", "Content": "You know you can't trust websitepictures when you book a hotel. But this is absolutely the worst case I've seen. The pics are nice, but the place is horrible. A very noisy room, because the windows are too old and couldn't even be locked properly. The room was way too small as I couldn't even open my suitcase on the floor. The rooms and halls smell like cigarettes. The bathroom is very clean and the location is great, but in average you can state that you're paying too much for wht you get.", "Date": "May 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "McDowall", "Title": "“Budget accommodation - do i need to say more?”", "Author": "MarkDom", "ReviewID": "UR15740290", "Content": "I booked this accommodation as my family and i were going down to Sydney for a long weekend, and i must admit this place is AWLFUL! My first impression was of the foyer area, which was tidy and the guys on teh counter were friendly and very helpful with directions around Sydney. My impression quickly changed as soon as we went into the lift and onto our floor. The hotel has a musty smell of cigerettes. We orignally booked a dorm room thinking it would fine considering we were just using this as a base to explore sydney however after seeing the room we quickly new that it wouldn't easily fit 4 people comfortably. We upgraded to room with a shower. Much to my releif as i didn't really want to be walking down the corridor in my PJ's. The rooms aren't clean at all. The bedding had to be changed due to it was dirty, the cleaners don't clean under the bed and if you want to have a shower make sure you bring thongs to slip on. The balcony area is absolutely filthy with beer cans, dirty, cigerette butts and people's clothing on the floor. The hotel is noisy at night as the hotel is located between 2 hospitals. So if your looking for a full night sleep i would suggest this hotel isn't for you. In saying that the beds were comfortable and it was a place to put your head. The hotel is in much needed TLC.", "Date": "May 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "auckland", "Title": "“Good quality budget hotel”", "Author": "aucklander16", "ReviewID": "UR15329648", "Content": "I knew when I booked that the hotel was budget, but when I arrived there I was pleasantly suprised. I stayed in a single deluxe room and expected a really tiny room, but there was loads of space, a double bed would easily fit in there with room to spare. The room was at the back of the hotel so there was no traffic noise. The bathroom is compact, with walk in shower, basin and toilet. The double wardrobe was good, and it contained the personal safe, small refrigerator and small televison. Also an electric kettle is provided with tea/coffee. A previous reviewer noted the body lotion provided in the toiletry pack is good - I agree with her! The included breakfast is toast and cereal, they provided a choice of four different cereals, white or wholemeal bread, good selection of toast spreads, tea coffee and orange juice. Hot breakfasts are also available for purchase if desired. There is a good supermarket a short walk away on Oxford Street, which is handy for anyone staying in the area. Museum train station is close, but it is an old station, there are no lifts, so you have to carry your bag up the stairs. Overall it is a really good place to stay if you want to save money. I stayed in a room with a bathroom so I don't know what the other rooms with shared facilities are like.", "Date": "April 24, 2008"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Vermont", "Title": "“Don't stay in the dorms!”", "Author": "RoamingTheGlobe", "ReviewID": "UR14335672", "Content": "I booked this hotel on the recommendation of a friend, who had stayed in a double room and loved it. I was traveling solo, so I booked the female backpacker dorm (4 beds). The lobby was very nice, but when I stepped out of the elevator to get to my room, the look was quite shabby. The room wasn't bad at first glance, but after inspecting the beds more closely, I didn't like what I saw. The top sheet was very dirty and the linens were stained. Lockers in the rooms were tiny and several had old key locks that were rusted shut. Bags of fellow travelers filled the small spaces between the beds (bag storage is available, however). It didn't take long to decide that I wouldn't be staying there, but I had a look at two of the ladies' bathrooms on the way out. It was 2:00 in the afternoon and they were disgusting. There were dirty paper towels and pools of water everywhere. After checking back into the hostel I had just left that morning, I came back to the Y and canceled my reservation. I got a full refund, no questions asked. Definitely do not stay in the dorms here. It's not difficult to find budget accommodation of equal price with a much higher standard of cleanliness elsewhere in Sydney.", "Date": "March 17, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "New Zealand", "Title": "“You get what you pay for”", "Author": "annabanana99999", "ReviewID": "UR14222929", "Content": "Location is fantastic. Room was OK. Bath had not been cleaned in ages - we had to scrub it prior to use. Evidence of prior bed-bug infestation on one of the matresses! There were 3 adults and one child in a triple delux room. Every day we had to request something that had not been replenished like towels, flannels, coffee etc. Beds were made daily but no cleaning - we stayed for 4 nights so really needed the bathroom cleaned eventually! Would stay again but only because of price. Definately not the 3.5 stars they rate themselves.", "Date": "March 11, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Decent budget option”", "Author": "tfcfan", "ReviewID": "UR14072556", "Content": "A bit on the downmarket side. My room came with shared facilities and there was only one male shower for the entire floor. Breakfast was basic, but was included in the room price. Staff were helpful and welcoming. Room prices are very low given the central location and if you're prepared to accept a basic level of comfort, this represents a decent value for money option. The hotel is a short walk from Central station, but if you're coming in by train from the airport, get off at Museum station, which is even closer.", "Date": "March 5, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Cork", "Title": "“Central, clean accomodation.”", "Author": "TedC", "ReviewID": "UR13713959", "Content": "Stayed there in January over the first weekend of the Sydney Festival. Booked a studio for 560 AUDollars for four nights. Room was relatively clean with daily maid service. A bit tight but served the purpose adequately - bear in mind it is a hostel. Breakfast was ok and I found the staff helpful with any queries. Location is just off Hyde Park, on the junction of Liverpool Street & Oxford Street. Nearest station is Museum, about two minutes walk. 10 minute stroll to Darling Harbour, same to QVB. Budget accomodation - you get what you pay for. Would stay again.", "Date": "February 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "rural NSW", "Title": "“Why you should stay at the Y”", "Author": "humblebug", "ReviewID": "UR13185922", "Content": "Can't speak more highly of the Y. Located in the centre of Sydney, it is very clean and comfortable, relatively modern with a low-moderately priced tarriff. Our room was compact but very well appointed - air con, ironing board and iron, tea/coffee making, fridge, TV, safe for small valuables, beds were very comfortable, breakfast was included in tarriff. Highlight for me was the bathroom - again compact but impeccably clean, fabulous shower, and the best thing... the mirror did not fog up!! We will definitley be staying at the Y in the future!", "Date": "February 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“great location!”", "Author": "Gaudi1234", "ReviewID": "UR10099188", "Content": "stayed 5 nights Great location near downtown and oxford street. Walk everywhere! (almost :) 2 minutes walk from museum station (train from airport) Very very small room (deluxe twin) with fridge. Renovated bathroom, spotless Continental breakfast is fine Fair price for what you get (hotels are very expensive in sydney)", "Date": "October 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Akron, Ohio", "Title": "“Great deal”", "Author": "embryonic4", "ReviewID": "UR7657186", "Content": "I found out about this hotel using this website and must agree that it is a great deal. It has many different options when it comes to the accomadations available, from dorm room to hotel room. The best part is if you rent a dorm style room you get some of the benefits of staying in the same place as a hotel, security, service cleanliness that you may not get in a normal youth hostel. No matter what type of room you choos the prices are cheaper than any other hotels in they area. This is not because it is a \"roach motel\" but because it is run by a non- profit women's organization. So feel confident in booking your stay there. I flew down to sydney then ayer's rock and cairns for my trip to australia, then returned back to Sydney for five days. I pre-booked my hotels for myy first part of the trip. I was so impressed with the y on the park during my first part of the trip that i booked it again for my return to Sydney. I stayed in the dorm style room for the first part, then booked a regular room for the second. Despite sharing a bathroom with others I never had to wait to use the shower or anything the restrooms were kept clean and were evenly distributed.", "Date": "May 20, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tenterden, United Kingdom", "Title": "“A1 BUDGET LOCATION”", "Author": "andygeering", "ReviewID": "UR7161537", "Content": "Having stayed there before, i had no hesitation in returning there to stay. The only downside is the staff could be more helpful. Apart from that it's excellent value for money compared to the neighbouring hotels i.e. the Marriott etc. Would defintely stay there again.", "Date": "March 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "East Anglia", "Title": "“Central location”", "Author": "Yaxina", "ReviewID": "UR7154621", "Content": "Good location in the centre of Sydney. Close to bus route to Bondi Beach. If you are looking for en suite accomodation, ensure this is clear on your booking form.", "Date": "March 13, 2007"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Excellent locality for budget stay”", "Author": "ltamb", "ReviewID": "UR6909440", "Content": "Stayed @ the Y for 5 nights in Feb, because of its locality and reasonable reviews on Tripadvisor. Pleasantly surprised by a number of things.Firstly <20 mins from airport via excellent train links, only 2 stops to the main hub of Sydney (Circular Quay Station), <5mins walk to Museum station even with luggage this was a walk in the park. Secondly the park, the Y sits on the corner of Hyde Park,leading onto Botanic Gardens, great for a stroll if you don't want to get the train to CBD. The Y itself is looking a bit tired but is adequate for cheap accommodation. Room was large, I booked a double with shared facilities, not shy bout communal showering etc, but the guys shower/toilet 'block' had only 1 shower so repeated attempts for a shower may be required, I only had 1 occassion when I couldn't shower when I wanted. Cleanliness of the room was ok, a nozzle on the vacum to go round the edges of the room carpet would be of benefit, however I was only there to sleep @ night! Staff very friendly in all areas; breakfast servery/reception/cleaning/maids etc with exception of 1 male receptionist,though not enough to affect my stay.", "Date": "March 4, 2007"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "3"}, "AuthorLocation": "UK", "Title": "“Great Location on a budget”", "Author": "Tappetts", "ReviewID": "UR4957788", "Content": "If you're looking for cheap no frills hotel in a great location look no further. We stayed in a deluxe room with garden view (not much of a garden) this meant it was quiet as not on the street side. Cost AUD$130 per night. The location is great within walking distance of everything and if you're lazy theres loads of taxis going past. This isn't a 4 star hotel but its clean and cheaper than almost anything else we looked at. We thought the staff were helpful (hired a car for us from just down the road, great for going into the blue mountains - better than a coach trip). Sydney is amazing, if you want to spend your money on the sights and not the hotel go to Y and spend your money on the bridge climb!!", "Date": "April 11, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "2", "Rooms": "3"}, "AuthorLocation": "Goulburn, NSW", "Title": "“Y on the Park - OK for a cheap stay”", "Author": "runningloz", "ReviewID": "UR4474851", "Content": "I stayed here twice within a fortnight. The first room was overlooking the main road and a little noisy. The second room was higher and quieter. I had one of the rooms with the communal bathrooms and found my room small, but neat with everything I needed. The bathrooms were clean and I never felt threatened using communal bathrooms (my uni days are long behind me now!). The location is brilliant - close to the city, the sights of Oxford Street and Hyde Park. Breakfast was basic but adequate. My only real complaint was the desk staff - no matter who was on duty they were surly and could be a bit arguementative. But for budget accommodation in the heart of Sydney (walking distance to my work at the time!), I couldn't complain.", "Date": "February 20, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "3.0", "Value": "3", "Service": "2", "Rooms": "3"}, "AuthorLocation": "Oxford, England", "Title": "“Ecnomoy Class Lodging in a First Class Location!”", "Author": "DrOxford", "ReviewID": "UR4389811", "Content": "If location and budget are your two main criteria, this is definitely the hotel for you. My girlfriend and I stayed at the Y on the Park in October during an extended holiday where economising with accomodation was important and chose the Y after extensively researching hotel options in Sydney. Located on the southeastern corner of Hyde Park, the place is ideally located for exploring Sydney and the surrounding area - a nice 10-15 minute walk to the opera house and harbour via the park, 5 minutes to George Street and shopping district, 10 minutes to Darling Harbour, and 2 minutes to an underground station (15 minutes to airport). The Y offers various rooms to suit any budget and need, though, with that said, it probably is not worth staying in anything more than a Traditional Room (communal bathrooms) - we found the AU$90 a night to be the value-line between the Y and a normal hotel. The Y has a nice feel to it, but it is a budget hotel. Our Traditional Room was well outfitted (TV in the closet, safe, iron, tea kettle), but very dusty and unclean - we had to request cleaning service twice during our 4 night stay. Likewise, the duvet and sheets had seen there day. The staff were relatively helpful, though seemed put-out by our request for a clean room. On the other hand, the communal showers were quite tidy and well-kept. The standard breakfast is just that - standard! A bowl of cereal, a small cup of juice and coffee. Everything else is extra. If you are a budget traveler or a hostel-er, the Y is probably your best bet in Sydney based on the price and location. You will get more from it than you would a YHA or a Backpackers. If you are traveling in Sydney and less-financially concerned, I would definitely look for something else. As I stated earlier, if you want anything more than a Traditional Room you will get less from staying at the Y than you would at a similarly priced hotel.", "Date": "January 26, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New Zealand", "Title": "“good hotel”", "Author": "DurgaNZ", "ReviewID": "UR4111876", "Content": "Stayed for 2 nights in November 2005 & found the staff friendly, the place clean & the bed comfortable. Good value for money & a great location, handy for shopping & visiting many attractions in Sydney.", "Date": "November 14, 2005"}], "HotelInfo": {"Name": "Y Hotel Hyde Park", "HotelURL": "/ShowUserReviews-g255060-d1523597-Reviews-Y_Hotel_Hyde_Park-Sydney_New_South_Wales.html", "Price": "$63 - $184*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">5-11 Wentworth Ave</span> | <span class=\"extended-address\">2000</span>, <span class=\"locality\"><span property=\"v:locality\">Sydney</span>, <span property=\"v:region\">New South Wales</span></span>, <span class=\"country-name\" property=\"v:country-name\">Australia</span> </span></span></address>", "HotelID": "1523597", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/e1/3c/1b/hotel-frontage.jpg"}}