{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Abingdon, Oxfordshire", "Title": "“Not like a European NH”", "Author": "MikeMatejtschuk", "ReviewID": "UR125883237", "Content": "Reception desk and foyer decor might give the impression that it is a European style NH hotel but it isn't. Paper-thin walls so when someone coughed you thought they were in the same room. I think they are modernising from the bottom up so we may have been unlucky to be on 6th floor. Cleanliness not up to European standards in bathroom for instance. Between 6 and 7 one morning we had three wake-up calls, having ordered none, and no real apology. Breakfast just about passable, but nonchalant omelette guy who clearly wanted to be elsewhere. Location is fine (you feel fairly safe but it's loud and rather youth-oriented, with some barely-appropriate behaviour in the streets) and there is a good restaurant with ethnic Mexican food just over the road(Fonda del Refugio, which is excellent value for a good restaurant in a capital city).", "Date": "March 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Banbury", "Title": "“A good hotel for a short city stay.”", "Author": "BobblenoseWarwicks", "ReviewID": "UR125596018", "Content": "Spent 3 nights here at the beginning of our Mexico tour.Rapid elevators to our 8th floor room, which was large & comfortable. Any room maintenance issues promptly dealt with; all the staff we met were very helpful. Buffet breakfast very acceptable including Mexican dishes, good selection of breads, pastries & pancakes & tropical fruits. Rather a strange system of cooking omelettes - chef was behind a glass screen ('ealth 'N safety?) tho' you helped yourself to fillings for your omelette (from dishes open for everyone to cough on!) & passed them under the screen to be cooked. Restaurant seemed rather small for size of hotel, tho' we usually managed to get a table without too much difficulty. Plenty of restaurants for dinner within walking distance of the hotel. Zona Rosa is VERY busy in the evenings, but we felt perfectly safe.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Zumaia, Spain", "Title": "“It´s \"ok\" Hotel, but..”", "Author": "Anoshk", "ReviewID": "UR124972707", "Content": "its a ok hotel, soft bed, clean sheets. The Breakfast wasnt the best, been there for almost two weeks an always take de same breakfast, the dinner isnt better. The area close to the hotel is not pretty, near by Zona Rosa. the front desk employers mmmm could be better, the bellboys are nice people.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ambergris Caye, Belize", "Title": "“Great Time”", "Author": "George C", "ReviewID": "UR123841127", "Content": "My friend and I went for a weekend stay in Mexico City back in December and stayed at the hotel. The location is excellent, close to where you can get in touch with the mexican life: clubs, tacos mexicanos, shopping and a great view of the Angel de la independencia a few streets from the hotel. the Frontdesk crew was helpful. the Maids always made the room very clean and comfortable all the time.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“NH Mexico City”", "Author": "Michael_Anchorage", "ReviewID": "UR121791225", "Content": "Location Location Location! NH Zona Rosa and is situated next to tons of shopping, trendy and uspscale boutiques, dining, and night life. Room accommodations were great staff spoke English and were helpful. Service is excellent several long term employees at this hotel. I've stayed here in the past and it was nice to see some of the previous faces. Police on every other street corner. I felt more safe here then my own neighborhood.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "", "Title": "“Average”", "Author": "Steve69small", "ReviewID": "UR120551619", "Content": "Hotel is located in the zona rosa which used to be a good area,unfortunately it now seems to be the centre of male prostitution. The hotel is looking a little jaded but the staff overall are helpful and friendly", "Date": "November 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“congrats!!”", "Author": "megane m", "ReviewID": "UR119548331", "Content": "i been in that hotel the last week and have to say that when we arrived the girl at the front desk (sandra ) was so friendly and kindfull with us I can see that she really knows her job... she help during my stay in that hotel, NH sona rosa has to hire more people than her. I had a bad room cause we found it dirthy and she help to move to another room. The restaurants wasnt bad, but when the guys have lot people there attitud is not the best regards Megane", "Date": "October 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“Good Mexico City location”", "Author": "Manuel V", "ReviewID": "UR119089337", "Content": "NH has a very good location in Mexico City close to the \"Angel\" statue on Reforma. Can walk to many places. Located in Zona Rosa the hotel is in a safe area.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Santo Domingo, Dominican Republic", "Title": "“Good service, good location, good price”", "Author": "Lailygarrido", "ReviewID": "UR102909729", "Content": "This hotel fullfilled my expectations. The only problem I found was that you can hear noise from the next room at night, not too loud but some noise can be listened. The room was clean, good space, the service was excellent, very kind people, reasonable price, good location, fast room service. If I have to go to Mexico City again, I will choose this hotel again.", "Date": "April 5, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Jose, Costa Rica", "Title": "“Nice Hotel”", "Author": "lrimolo", "ReviewID": "UR94172685", "Content": "Stayed there for 18 days, the food was ok, service ok. For a business travel is amazing they charge $10 daily for wi-fi on the 21th century. besides that, the hotel is excellent.", "Date": "January 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Canberra, Australia", "Title": "“Never go if you want to be safe”", "Author": "AndreaRSoriano", "ReviewID": "UR87953555", "Content": "Location is not so bad, but there are better choices nearby. Unless you are forced to pay 35 usd (which you have to pay in a terrible exchange rate in mx pesos), you get a terrible room in the 5th floor. The minute you come out of the elevator a horrible sewage smell tries to kill you. The carpet is dirty and ragged, the room door seemed like it had been previously forced open. The bathroom is rusty and doesn't even have a floor mat. They advertise a king size bed, but it's only a tween one, and beware of the quilt as you may find some disposal inside from the previous guest. The staff was completely rude and only the chef tried to resolve our situation, after the two hotel administrators showed no professionality.", "Date": "November 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Mexico", "Title": "“Terrible Room - Abuse Of NH Good Francise Name”", "Author": "allaromano", "ReviewID": "UR86574438", "Content": "I obtained a Standard Room via Hotels.Com The picture of the room/hotel looked good, what you would normally expect of a NH Branded Hotel but what was supplied was complete rubbish. Here is the list of decifficiens I supplied in a written note to the General Manager: -Terrible 5th Floor Carpets -Poor joinery between carpets/tiles/marble -picture frame not hung straight -stain on the bed cover -room 511 carpets are disgusting -cracked marble on the basin -faded chrome on the taps -no soap holder in the shower -no bath mat on arrival -no complimentary water (Mexican water is not drinkable) -your internet and parking upgrade for 400 Pesos is obscene -No king size bed (despite a picture of one being shown on hotels.com at time of booking) -bedside lamp shade not straight I had a 3 night booking and presented the above list on the first morning. Despite the written alert, the bed cover was still not changed. I had to take it down to the reception area where the duty manager said \"if you want, I can get house keeping to change it for you\" to which I replied \"you can safely assume that my being here at reception with the soiled bed cover and my prior written note is an indication that I do want it changed.\" I paid 900 pesos for the room (apprx US $90) and it is complete rubbish. The standard room with all its faults is an abuse of the NG branding. I recommend with al sincerity that you avoid the NH Mexico City. I have stayed at the London NH hotel and found it to be perfect. NH Mexico City is rubbish. I asked for a bath mat on the first night as it was not present when I first entered the room. One was sent to my room. On the morning after the room was made up there was still no bath mat. I asked the Duty Manager \"where is the bath mat. Is a bath mat not included in a Standard Room?\" to which he replied \"no it is not.\" I said, \"what about the slippery floor? Water on tiles is a recipe for diaster\" his reply \"bath mats are not included in standard rooms\" That sums up the place right there.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“AVOID AT ALL COSTS!”", "Author": "Kristopher1980", "ReviewID": "UR75691494", "Content": "This hotel is the worst experience in my life. The pool doesn't work. The business centre is out of order. The water is not hot, just barely warm. For entire day a loud construction was going on in front of my door. The ceiling in the corridor was leaking. The sauna didn't work. My reservation was not honored. I was forced to pay 600USD for two nights, even though I had a voucher stating that I have already paid for the room. The manager didn't care about my complain. And at the end we both got poisoned with a salad. Disaster. See the photos and AVOID AT ALL COSTS!!!", "Date": "August 17, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Northern California", "Title": "“NH Mexico city NOT for tourists”", "Author": "opticguy", "ReviewID": "UR56584665", "Content": "This is a hotel that caters primarily to buisness travelers. As tourists my wife and I found the srevice to be poor. Twice we had dirty bath towels put in our room. Overall houskeeping was fair, but we had wine glasses from our first night that were never removed from the room. The sound proofing to the next room was awful, you could hear everything that was being said at normal conversation levels. I have travelled all over the world and have never stayed in a hotel that did not have an alarm clock in the room...until now. When asked, they suggested we use our cell phone, only trouble is that they only work in the U.S. If we needed to know the time we had to call the front desk. Overall, not the worst hotel I have ever stayed at, the location is great but I would not recommend it. Try the Hotel Royal accross the street, it is a Best Western, the staff was very helpful to us even though we were not staying there, but we will try it next time.", "Date": "February 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Ixtapa, Zihuatanejo", "Title": "“Clean, convenient and good service Hotel”", "Author": "Chuck560217", "ReviewID": "UR46000362", "Content": "I spent a week in the Hotel for a Company Seminar and the food, housekeeping and meeting space was always on time, great location, convenient for shopping and sightseen.", "Date": "October 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Puerto Vallarta, Mexico", "Title": "“Nice Hotel Great Price”", "Author": "optionsf", "ReviewID": "UR32893273", "Content": "I got a fabulous deal on an online discounter, and stayed in a nice executive king room with a view. The gym is small but useful, there's a pool, breakfast was good and the service was just fine. Much better accomodations than the Eurostars Suites Zona Rosa, although not a suite it's more comfortable. Not sure what all the drama's about from other reviews. Internet access pricey, but for the price I got it doesn't matter. The location is really great, convenient to nightlife in Zona Rosa and to the Reforma.", "Date": "June 22, 2009"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Satisfactory business hotel”", "Author": "Yamster", "ReviewID": "UR17306926", "Content": "I was in Mexico City for work for two nights, and I got a corporate rate through the organization I was working with (around US$90/night). The hotel is in a convenient location as far as accessing public transportation. My room was clean and given that I spent so little time in it, it was perfectly adequate while not being anything special. I'm a fluent Spanish speaker and I used to live in DF, so I really didn't need to rely on hotel staff for anything, so I can't comment on service. For the price I paid, I have no complaints.", "Date": "June 28, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Come and go, a busy hotel”", "Author": "Pumiko", "ReviewID": "UR11208361", "Content": "Me and my friend stayed there 4 nights. No rudeness mentioned on these pages was experienced. Bell boy Jesus is absolutely amazing, he speaks very good English, he knows everything and is ready to help. The few contact we had with the reception was normal and the staff at the breakfast was very friendly all the time. Our arrival was at 9am and the room was ready for us. We also went to have a breakfast right after checking in and never had to pay for it - we still don't know if it was a gift or a mistake... The breakfast itself was satisfactory and filling. The room was on the 4th floor, spacious but nothing special. We loved the beds, both large. No problems with the cleanliness but the fittings in the bathroom were a bit rusty. The location of the hotel is perfect both for sightseeing and entertainment. The street is a bit noisy in the mornings and our particular room didn't have much of daylight or warmth by the sun, as the view was blocked by another high hotel. NH is also a large building, people are coming and leaving, lot of time spent waiting for the elevator which usually comes packed. Anyway, we didn't spend much time inhouse, so the impersonal atmosphere was no bother for us.", "Date": "December 2, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Austin, TX", "Title": "“I was a repeat NH customer, until I stayed here . . .”", "Author": "Batz", "ReviewID": "UR11057390", "Content": "I booked what I thought was a great rate at the NH hotels corporate website. The rate was to include breakfast, two welcome cocktails, and a bottle of tequila. The tequila never happened, and I had to argue with the frequently rude reception staff to get the welcome cocktails. This is what I call 'fraud' and I would warn prospective guests to triple-check everything with the property management prior to checking in. Based on my experience, it's obvious that the hotel is not compliant with the NH reservations network. Additionally, our reservation was for a queen-sized bed. But, after checking in and getting a single bed, I was told that 'standard rooms' have 'standard' beds. I insisted on a bigger bed, and was put into a different room on a nicer floor, though the bed was the exact same size. I then insisted on a room with two beds, and was accommodated only when I threatened to cancel the 2nd-6th nights of our stay. Management was nowhere to be seen, and the busy meeting/conference rooms on 1st and 2nd floor made using the elevators a miserable experience during the day. Get on the elevator in the lobby, stop at floor 1, and 15+ people cram on, to go the 2nd floor. They get off, and another 15 cram on, to go to the first floor, even though the elevator is going up, and so on. The beds were like rocks; I don't understand the concept of hard-as-rock beds. Why invest in beds at all, if they are as hard as the floor? The room was stylish, though the appointments were somewhat dated, and the bathroom tiny. The floor got soaked each time the shower was used, and housekeeping was stingy with towels, even though I requested a few extras due to the shower problem. The shower head was old, and the water pressure was ridiculously strong, wasting hundreds of gallons of water in this city where clean water is scarce. There was no clock in the room, nor on the t.v. The wakeup call one morning never happened. The lock box/safe was tiny. Apparently rooms on the upper floors of the hotel are udpated and cost more. We were originally put onto the 5th floor, which I would characterize as 'stanky' due to the ugly, old, and stained carpeting in the hallways and the room. When we were moved to the 6th floor, the room was much nicer just due to the hardwood floors. Breakfast was the best part of the stay. The restaurant was clean and well-appointed. There were little things like having skimmed milk on day 1, but not on any other day, that give me doubts about the quality of the management. One other example for this point: it's unacceptable to wait 10 minutes for a cup of coffee when there are roughly the same number of staff on the floor as there were seated customers. The food was OK, and thankfully the variety included European style sandwiches, pastries, and cheeses, which was good because the hot Mexican and American dishes weren't always hot. On one day, most of the yoghurt cups had serve-by dates printed on them that predated the current date. Overall I rate this hotel poorly because of the reservation 'bait-and-switch' that NH shamelessly administered on its website.", "Date": "November 25, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bourg en Bresse, France", "Title": "“worst service ever”", "Author": "dominiquedefrance", "ReviewID": "UR10497268", "Content": "We staid at this hotel just recently and the experience could not have been worse. The service at the hotel is so rude and horrible. At check-in the reception staff permanently dealt with other things and let us just stand there and it took 25 minutes to check in. We had booked for 2 nights - a single and a double room. The receptionist asked us 3 times if we needed 2 keys for the double room (which we needed) in the end we got one key. Both keys were valid for just one night - so we had to get down to the reception again and re-valid our key after trying to open our doors the next day. NH hotel is perfectly located in the Zona Rosa. We disregarded the bad service and booked for one more night. To make sure that we could stay in our rooms we double checked with the reception the evening before our 3rd night should start and everything seemed fine. The next day we went again to the reception and there was Yan, a rude and unfriendly employe - not know how a hotel reception team member should behave and treat guests. She was so rude, told us that we would have to move rooms as she did not know and I told her that everything had been fixed the evening before. She continued to be rude, all of a sudden dealt with one of the bell boys, turned towards some other guests and did not care of us anymore - it was so embaressing. All of a sudden she turned back and asked for the written reservation. We told that we didn't have it with us and she said she would need it. I told her that they didn't ask for a written reservation at check-in neither and that I saw the eveninmg before that they had our additional night reservation. She turned back to somebody else and we had enough and left. The service at the restaurant is horrible too - bad organisation an dthey do not remove the trash and used plates from the tables - chat in a corner. You order som cold milk for your coffee and the waiter enters the kitchen and never comes back. Through the glass window you see them chat with the cooks. Even if you show up late and there are just less than 10 people in the restaurant they still do not clean up their mess and you have to get up and get your own coffee even if there should be a coffee service. The last day we had breakfast somehwre else as I did not want to start the day with so much unprofessional stuff. But this whole ignorance obviously is the hotel 's permanent system. I immediately wrote and email through the hotels website and told them about our trouble and asked to get a contact to management. Can you imagine that even after the second contact we still have no answer? This hotel seems to me without any captain and nearly ship-wrecked - no service - no smile - no care about guests and it will have been our very last stay at a NH hotel!", "Date": "November 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Have a gay ole time”", "Author": "gilead", "ReviewID": "UR7722845", "Content": "I had never been to Mexico City before, and was going for Memorial Day Weekend. I was trying to choose the perfect hotel in Zona Rosa, which is the gay district. I narrowed it down to Galeria Plaza and NH Mexico City, because both had pools. After reading all the reviews from several websites, I decided to choose NH, and I am glad I did. I felt the location was ideal. It is right off Amberes Street which has several gay establishments. And it is very close to the Insurgentes metro station, so you can get to wherever you want to go. The customer service was excellent. The lobby is beautiful. We stayed in the discount priced rooms, which are fine for $69-95 per night....nothing fancy, but all the basics (except a clock or radio). Just as nice as a Comfort Inn room in the USA. There was 1 computer with free internet in the lobby which was helpful. The other computer was not connecting to internet for the 4 days we were there, but we managed with the one. The pool was lovely, and our room looked out right over it. But as important as it was to go to a hotel with a pool, we never ended up using it!! The gym has a great view..and some cardio machines and dumbbells. Don't plan on doing a major work out, but you can pump up before the club or bar if you want. Lastly, do not call anyone's cell number from the room--the cost is astronomical. Even a Mexico City cellphone number is not considered a local call, so 30 minutes ended up costing $22. There is an excellent public phone system using cards, for very cheap. Use those. And also get the fresh squeezed juice for sale around the corner from the hotel entrance Mon-Sat.", "Date": "May 30, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Alicante", "Title": "“Great hotel, great location”", "Author": "Pablicius", "ReviewID": "UR7154095", "Content": "This hotel is a average one, in the business hotel segment; for me, this means it is a very good one: clean, comfortable, big rooms, and perfect service. Perfectly comparable to the original NH hotels in Spain. I loved the variety of the buffet breakfast, including mexican and international dishes, some of them changed daily. Location is extremely central (you can see the golden angel of Plaza de la Independencia from the hotel), in one of the safest areas of Mexico City (Zona Rosa). This is also an area where there are a lot of bars and clubs right behind the corner, so good for those who like nightlife. It is also the a gay/lesbian area of the city. There is on THEATER inside the hotel, at ground level. When I was there, the play was Monologos de la Vagina, which had been on stage for more than two years. Tickets were 240 pesos, I think I remember. Here you pay for internet access; you can buy from 1 hr to 1 day; 1 hr, the relatively most expensive purchase, is 30 pesos (I think one whole day is like 180 pesos; not sure, though); they give you one code, and then connect to the internet, cable or wifi, at the room; there you can only access one certain web page where you write your code to get the access, indicating how much time you want to use; you do not need to repeat all the process every time, the same code is good as many times as you want, they will keep charging it in your account as you keep buying more surfing time directly from your laptop. I do not know if this is expensive or not when compared to other hotel in the city. I paid a little less than 1000 euros for 9 nights, breakfast and internet included.", "Date": "March 13, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "California", "Title": "“Great Hotel, Friendly Staff in the Heart of Zona Rosa”", "Author": "meco", "ReviewID": "UR6928549", "Content": "My sister and I visited Mexico City on February 07 and stayed in the NH Hotel Mexico City 3 nights. We were impressed on the service we received and how friendly the staff were. There was security 24 hours a day. Never felt unsafe. Our room was always clean with no odors. WE don't smoke and it was nice to get a room that we couldn't smell it. They have cable TV with English Channels. We didn't watch much TV but just in case the readers would like to know. The breakfast buffet offered at the hotel was good if you like small breakfasts, but not great. They lack variety. I recommend readers to go to Sanborns Restaurant. Is only a block away from the hotel. We know that a lot of travelers are concerned with safety in Mexico City. With the new government in place, they have doubled the police force and you can really see it. You will feel safe. They have FREE internet services, a plus to keep in touch with family. I will highly recommend this hotel and will definately stay here again. I love Mexico CIty. !!", "Date": "March 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cleveland, Ohio, USA", "Title": "“Loved this place!”", "Author": "downtownrub", "ReviewID": "UR6109706", "Content": "My partner and I stayed here for 3 nights. Great location in the wonderful Zona Rosa area. Very close to the metro. Great staff. Great value. Great experience.", "Date": "November 12, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Good hotel, good location, different than the rest”", "Author": "brian_washdc", "ReviewID": "UR6030482", "Content": "For my recent business trip I tried to stay at my usual favorite hotel in Mexico City, Condesa DF, but it was booked solid for the week. So I read the reviews here at TripAdvisor and picked the NH Mexico City. Having read the warnings about the non-renovated rooms, I paid up to a higher rate US$140/night and got a nice, renovated room. The rooms are nicely decorated and the bathrooms are stylish. I've stayed at other NH properties in Amsterdam, Madrid, Buenos Aires, and elsewhere, and I've always appreciated the design of the rooms and the style of the lodging. I would have to say that the NH Mexico City is consistent with the chain and I would stay here again. If you're in a renovated room, you have access to the Club NH on the 14th floor, which was a very nice lounge with a beautiful view of downtown Mex City, flat screen TVs, and nice furnishings. They have an ok breakfast buffet here, but it's way overpriced, at 140 pesos plus obligatory tip bringing it to over US$15. The only other complaint I have, and it's actually one that might keep me from staying here -- the internet connection. They have WiFi access, but the connection itself was unreliable and even when it was working, the throughput for downloading files was unimpressive. I do a lot of moving of files and I could not successfully download a 100MB file on the connection because it was so slow, and it would cut out at times. To have paid more than $11/day for a connection so unreliable felt like highway robbery. Curiously though, they only billed me for two days when I used it for four days. PROS: --Good location --Reliable service --Stylish, clean accomodations --Larger rooms than other Mex City hotels CONS: --Overpriced breakfast (but you could eat in a restaurant nearby on the street for much less if you want). --Slow internet connection (also MXN120 per day). --Most confusing hotel invoice I've ever received...the numbers didn't add up, and there were confusing taxes all over it.", "Date": "October 30, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "New York City", "Title": "“The Lobby is Deceiving”", "Author": "airportsarefun", "ReviewID": "UR5592045", "Content": "I just got back from a four-night stay at NH Mexico City. The lobby looks newly redecorated and makes a decent first impression. However, once I stepped into the hallway of the 7th floor where my room was, I thought I was in a different hotel! An ugly and dated carpet lead the way to my equally dated and ugly room. The ceilings were low with several cracks. The beds were ultra firm (which I didn't mind) and the fixtures (light switches, bathroom mirror, etc) were crookedly attached to the walls. Overall the room (dingy and staid) was the complete opposite of the hotel lobby which exudes a modern and sleek feeling. I had gotten a great discount online and had read on this site to be aware that that this might afford me one of the pre-renovated rooms. I should have taken heed. I could have paid the extra $25US to upgrade to an \"executive\" room but wanted to deal as little as possible with the front desk. They were unhelpful and futzed up my reservation. I was locked out of my room the last night. When I got to the front desk I was told that I needed to present my room coupon by the same woman who checked me in and took my coupon. She said she never took it. Rather than argue, I went to the business center to print out the coupon again. The printer wouldn't print and the ladies at the business center had no clue why. I finally asked to use the computer they were using. Also, housekeeping had a tendency to knock as they opened the door to my room every morning at 8:30 AM. It served as great wake-up call but if you intend to sleep in be sure to put the \"No Molestar\" sign outside. My suggestion is: only stay at NH if you plan on getting an upgrade (although I haven't actually seen the upgraded rooms) and don't expect the best service. Otherwise, the location is central and enjoy the free internet stations in the very deceptively nice lobby.", "Date": "August 9, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "3"}, "AuthorLocation": "Roamin' The World", "Title": "“! It was Nice but Rough”", "Author": "mrbluesjr", "ReviewID": "UR5436899", "Content": "As you enter, you walk into a very modern, well lit lobby with two free internet stations available. The visit began with an extremely friendly Alejandro helping us to our room and making interesting suggestions. The room was OK. Not quite clean. But we noticed a card on the desk that offered an upgrade to a suite for $25 USD. Within minutes af the time the upgrade order was placed, the power to the room went out. Four hours later, we still had no power(most of the hotel had power) and had not been moved to the new room. Guadalupe (I didn't learn her last name) was quite surley and downright rude at the front desk when my wife attempted to procure an upgrade room with electricity. Within five and one half hours of our arrival to the hotel, we had a decent room. All of the doors are hollow. You can hear everything that goes on in the hall, doors to other rooms, etc. The beds were very nice and comfy. The upgraded room had a great bathroom. It is located in a great part of the city. We only had breakfast at the restaurant, but it was very good, at a good price(for a hotel). There are many great hotels in this area and at the price of a nights stay at the NH, it would be wise to pick another, nearby hotel. Glenn Patrik", "Date": "July 7, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Mexico city", "Title": "“Very bad customer service”", "Author": "Ezra", "ReviewID": "UR5373341", "Content": "I've stayed several times at this hotel, in the renovated rooms with access to wireless internet. This time I reserved through priceline at $59 per night. When checking in I was told that I my rate was not for the nicer rooms, and internet was not available in them. This irrated me somewhat because all those limitations are not stated in the reservation. I went up to the room and all the plugs near the desk where 2 prongs..versus the needed 3. I called reception for an adapter/extension, and they informed me that they were all out that I could buy one at the gift shop. I found this unacceptable, and walked out of the hotel. Please be aware that if you book a special rate through a website like priceline you will be treated like a second class citizen having to sleep in the broom closet.", "Date": "June 22, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "3", "Service": "4", "Rooms": "2"}, "AuthorLocation": "Germany", "Title": "“So so”", "Author": "A TripAdvisor Member", "ReviewID": "UR4828697", "Content": "Nice breakfast buffet and internet in the lobby, but our room was very old, not really clean, dirty and humid carpet, badly painted, water dripping all the time in the bathroom, safe deposit in the room did not work, looked as door had been opened by force during a visit by previous guest.", "Date": "April 2, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Atlanta, GA", "Title": "“We Love this hotel, location and service.”", "Author": "A TripAdvisor Member", "ReviewID": "UR3777200", "Content": "After reading other online reviews of this hotel (in the Zona Rosa of Mexico City), I was very hopeful our stay would be excellent and all my expectations were met. This hotel (we paid about $85/per night) is excellent. It's renovations are all complete and it is gorgeous. We enjoyed excellent service (assistance with booking tours was easy and great), a clean, new, modern room and amenities and even wi-fi access. If you stay on a higher floor, you have an excellent view - we were on the back side of the hotel and could see Mexico's best known \"monument\" on Paseo de la Reforma and all the highrises along that street. The only issue we had was that it was a little pricy for wi-fi- $12usd per day and the speed was only fair. I plan to return the N-H hotel.", "Date": "August 16, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Munich", "Title": "“Only 50% of the hotel is renovated!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3760879", "Content": "NH says on the internet that the hotel is newly renovated. This is only partially true because they've renovated only the lobby, the elevators and approx. 50% of the rooms. So, if you are unlucky you get a room equipped with furniture from the 80s. The receptionist explained that when you book online you do not get the newly renovated rooms (which they show online)!", "Date": "August 14, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "San Francisco, California", "Title": "“Nice hotel..in a great location”", "Author": "A TripAdvisor Member", "ReviewID": "UR3576599", "Content": "I stayed at this hotel in november of 2004, a pleasant time of year to visit the great Mexico City I might add. This hotel is very centrally located in the \"Zona Rosa\" which is the touristy part of Mexico city. It is within walking distance to the independencia angel monument (which is something you must see in person to truly appreciate). As far as the neighborhood goes..it is best described as modern-hipster..kind of like the castro district in san francisco...though with a younger vibe. Read..very alternative lifestyle evident here. Though the area is very urban i did not once feel threatened...and felt much safer there than in many American cities. The hotel is nice..but not extravagant..the restaurant is overly pricy and so is the gift shop. The lobby was open and well lit...and the staff was courteous. The room was fair...the carpet seemed dated..and the water in the shower seemed very hard (though since I have never been to any other hotels outside the U.S. I am not sure if this phenomenon is more widespread). All in all it was a nice stay. though, this is mostly due to the hotel's location and proximity to the area's museums and monuments than to the attributes of the hotel itself.", "Date": "June 20, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Luxembourg", "Title": "“Back again!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3016548", "Content": "On our trip through Mexico we stayed three nights at the NH Hotel Mexico City. Everything was excellent: a very clean and calm room (on the ninth floor), with all comfort you can imagine (till toothbrushes, toothpaste, wax for shoes, ...), the breakfast buffet was tremendous and the staff was friendly and competent (spoke even french!). We felt that in this hotel all is made so that the customer feels himself well. Be sure that, if once we come again to Mexico, we will stay at the NH.", "Date": "January 19, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "bodrum turkey", "Title": "“ask for a new room”", "Author": "taniabh", "ReviewID": "UR2592876", "Content": "i stayed here in august with my sister and my husband. the room is nice and we got it for $70 a night, but make sure you ask for the new ones as some have not been re-done yet. the area is a little bit seedy - it is the pink zone, what is the equal of a red zone if you see what i mean. i think the guide books are wrong about the area as we did not see a lot of tourists. if you are girls travelling alone i would not stay there. the service is fine. and now the new lobby and resturant is open it is looking a lot nicer. the pool is small and old. there are a lot of places to eat in the area and the metro is a close walk if you want to use it.", "Date": "September 22, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York, New York", "Title": "“Great rates, Great service!”", "Author": "RocioSilva8", "ReviewID": "UR2503434", "Content": "The NH Hotel in Mexico City was very nice the rooms are clean the furniture is new and no carpets!! Which makes it feel even cleaner. All the people who work in the hotel are very nice and attentive. Location is excellent right in the middle of Restaurants, Shopping, nice to even walk around and browse. I felt very safe in this are also there are police around the clock at night and even tourist police! What better place to stay at!", "Date": "August 30, 2004"}, {"Ratings": {"Cleanliness": "2", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "New York, NY", "Title": "“Give it a year!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2268996", "Content": "I just got back from a long weekend with friends (2-5 July) and stayed at the NH Mexico City (formerly Krystal Zona Rosa). The place is currently undergoing renovations, and so the room we got was not the same as the photos you can find online with the dark hardwood floors. Our room was clean and comfortable (though the carpet by the door needed changing/cleaning), air conditioner was strong and bathroom was of a good size (though had a moldy smell...good thing we brought scented candles). After I checked out, a fellow guest said that she was in a renovated room, so be sure to request for one. The lobby and ground floor restaurant will be closed during July and August for renovations, so there might be some inconveniences. There will be another restaurant though on the 2nd floor during this time. Breakfast buffet was good but expensive. But then there are other places to try around the hotel. The hotel is conveniently located, and we felt safe walking around the area even late at night/early morning. The staff was very friendly, helpful and efficient; check-in and out were a breeze. I'd give this place another year when the place is completely renovated. I think it will look and feel like a boutique hotel. But room prices may be higher.", "Date": "July 6, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Atlanta", "Title": "“A good choice”", "Author": "cat lips", "ReviewID": "UR1375042", "Content": "The hotel staff is very friendly and courteous, and they are more than willing to help. The hotel needs some upgrading, but it is in reasonably good shape. It is kept clean and the hotel's restaurant has a good selection of food at reasonable prices. The breakfast buffet looked wonderful, but it is expensive. The hotel is located directly in the Zona Rosa. You can walk to any place in the area, and it seems safe so long as you don't wander off too late. I would definitely stay at this hotel again because for the price, it is well worth it.", "Date": "October 3, 2003"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York, NY", "Title": "“The place to be!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1260919", "Content": "The hotel is Fab. It has a swimming pool to relax in during the hot day, and all the hottest nightlife below. The rooms are very comfortable and the entire establishment is very safe. We love the constant security in and around the hotel. The staff is great. My family and I always stay at the Krysal when we visit Mexico City. One of the hottest hotels right in the midde of La Zona Rosa! If you want the best and to be in the middle of it all this is the place for you!", "Date": "August 26, 2003"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "MontrÃ©al, QuÃ©bec", "Title": "“Krystal...good deal!”", "Author": "A TripAdvisor Member", "ReviewID": "UR750679", "Content": "Hotel Krystal in Mexico is a good deal. For 120$ Us you get a junior suite wich is spacious and comfortable. It's centrical, near of everything and the personnel is warm and sympatic. Food is great but a bit expensive, taxis too. on a quality-price base, it's an excellent choice.", "Date": "November 13, 2002"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Phoenix, AZ", "Title": "“In the Middle of The Night Life”", "Author": "A TripAdvisor Member", "ReviewID": "UR726618", "Content": "After many visits to Mexico City, I seem to always return to the Krystal Rosa to stay. It may not be the most luxurious, but the location makes it my choice. The Krystal Rosa is conveniently located in the Zona Rosa area of Mexico City. This is a beautifull area with restaurants, shops and a blocked street for pedestrians only. It is the gathering spot for many of the local night set groups. There is food, music and action. The Krystal is also just two blocks from the Insurgentes Metro stop. Rooms are simple and adequatley furnished. The staff is superb! The food in the hotel is little better than most of the fancy restaurants in Mexico City, just barely adequate. But then why eat fancy in Mexico when great local food abounds. The Krystal Rosa is near to the action and is classy.", "Date": "October 28, 2002"}], "HotelInfo": {"Name": "NH Mexico City", "HotelURL": "/ShowUserReviews-g150800-d152467-Reviews-NH_Mexico_City-Mexico_City_Central_Mexico_and_Gulf_Coast.html", "Price": "$81 - $118*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Liverpool 155</span> | <span class=\"extended-address\">Zona Rosa</span>, <span class=\"locality\"><span property=\"v:locality\">Mexico City</span> <span property=\"v:postal-code\">06600</span></span>, <span class=\"country-name\" property=\"v:country-name\">Mexico</span> </span> </span> </address>", "HotelID": "152467", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/5e/36/5e360123c32822dc8cd5703a600a4b2a6large.jpg"}}