{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Suppose there has to be down sides at the price they charge”", "Author": "Sneak111", "ReviewID": "UR126667350", "Content": "On arrival the receptionist tried to charge us for two rooms instead of one. To be fair this may have been down to the booking agency, though the dates the receptionist gave us for when we were supposed to have booked were completely different to the date when we actually booked, suggesting the hotel had our booking mixed up with someone else. The area is horrible and we were harassed by beggars a couple of times walking from the tube to the hotel. We could deal with both these problems and they would not stop us booking again as the hotel is convenient for access to central London. HOWEVER (and it is a big however), as others have stated, the rooms are uncomfortably hot and this definitely would prevent us returning to the hotel. Turning the air con down to its lowest setting does ease the problem slightly from unbearable to merely stifling. It was impossible to get a good nights sleep. This is a shame as the hotel is good for the price. The rooms are small, but not too small, and they are comfortable with good complimentary refreshments, tea, coffee, biscuits etc. Didn't use the bar but it also looked nice. I notice the manager reads these reviews so perhaps he could explain why the rooms are so hot as it ruins an otherwise good hotel.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Southam, United Kingdom", "Title": "“rude, obnoxious and unfriendly hotel staff”", "Author": "wilma r", "ReviewID": "UR126205622", "Content": "Upon my arrival the receptionist was rude and very unhelpful. The room was exceptionally small and smelt of damp. When I checked the mattress it had stains on it. The room was extremely hot and felt claustrophobic. when I complained I was told what do you expect for the money you've paid. I followed up my complaint to the GM who has not had the common courtesy to respond, but hardly surprising judging by the attitude of his staff. Considering this is the hospitality industry there was nothing hospitable about my stay, In fact I've stayed at many establishments across the world and encountered far superior service as opposed to this over rated poorly run establishment.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“The truth!”", "Author": "Eliz C", "ReviewID": "UR126080108", "Content": "I recently stayed in this hotel with my boyfriend for my birthday. It is a lovely hotel not in the best location but tube and train stations are just a few minutes walk away. The bedrooms are small but nicely decorated however they do get hot but that is what the air con is for. The view from the room was just awful. The only thing I would say is that the staff aren't friendly at all and some couldn't speak much English. With the restaurant being closed in the hotel and us not knowing the area we wanted somewhere local for dinner. We looked online and found some restaurants but the staff couldn't understand and tell us directions, I think the staff should take time to know the area as I feel it's part of the job to be able to recommend and explain to tourists where things are. Breakfast was okay but the service needs to be stepped up a notch.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Rooms are way too hot. Awful nights sleep”", "Author": "Macy W", "ReviewID": "UR125016471", "Content": "This is my 2nd time I have stayed at the Quality Matrise Hotel in Maida Vale, well actually Kilburn. The first time was August 2011 where the room was unbearably too hot. No sooner was I applying my make-up it was dripping off. The window is super glued down, therefore doesn't open and the air con does not work. I had the most awful nights sleep ever. I complained via email twice but had no response. The 2nd time I stayed was in February 2012. I did not want to book here again but my partner talked me into, convincing me that the room was probably too hot as it was summer the last time I stayed. How wrong was he. We paid extra for the VIP room (£99.00), however the VIP room which was on the third floor was exactly the same room I stayed in before ( a standard double) which only cost £79. There were no chocolates on the pillow, as stated, nor was breakfast included again as stated. Yet again when we went to bed all night long we were tossing and turning sweating like pigs. The air con didn't work . NEVER AGAIN! NOT BE FOOLED BY THEIR NICE WEBSITE", "Date": "February 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Southsea UK", "Title": "“A Pity”", "Author": "Trevignon1", "ReviewID": "UR124244983", "Content": "Good value, not a bad location and clearly a lot has been spent on the hotel so feels very comfortable but........the beds are tiny throughout and the rooms themselves are also very small. We booked a 'VIP' room but all that that gives you is breakfast, two mints and some toiletries still a tiny room with a tiny bed It's a shame because it is good value and the staff were very helpful but if you want a good nights sleep you're doomed.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Winchester, United Kingdom", "Title": "“Clean and tidy”", "Author": "Charlotte M", "ReviewID": "UR123630845", "Content": "Not bad for a stopover hotel - clean and tidy and pleasant service. I had a room on the VIP floor so got a good sleep away from street noise. Comfortable bed, and will stay again.", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Company Business Trip”", "Author": "jeffcollins2012", "ReviewID": "UR122917005", "Content": "Very smart & small boutique style hotel, great for business but not really large enough for a family trip", "Date": "January 11, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Andover", "Title": "“Pleasant stay”", "Author": "Ugne A", "ReviewID": "UR122860470", "Content": "I had a very pleasant stay at this hotel. Not a lot to fault apart the waiter at the breakfast seemed not very bothered at serving or even explaining how breakfast works.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Rude staff make a bad hotel worse”", "Author": "MiaMe", "ReviewID": "UR122414565", "Content": "We stayed here for 1 night on Boxing Day night and it was underwhelming. When we went to check in we approached the desk where the French receptionist didn't look up from his paper work until he was quite finished. When he finally looked up he just said 'Name please'..no hello, no happy christmas..so nice start! We have a year old so needed a travel cot. When we got up to the room it was tiny. No room on the floor for the travel cot and luggage. I went back down to the desk to ask if there was a bigger room we could move to - I was prepared to pay for an upgrade however, I didn't even get that far. Our charming receptionist simply shrugged and said all the rooms were the same size and there was no point in moving. So no point apparently. Of course, when I asked the man who came with the travel cot if all the rooms were this small he said no of course not, we were in one of the smallest... The room over looked a back year covered in graffiti and we overlooked a box covered in bird droppings - NICE! On the positive side, the room was spotless and the shower was excellent..", "Date": "January 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nicosia, Cyprus", "Title": "“small but stylish, no window but central location”", "Author": "chrouNicosia_Cyprus", "ReviewID": "UR122169457", "Content": "we stayed at this hotel for 5 nights in a double bedroom. We were warned from the start that the room had no window so we entered a bit scared of what w could b facing... It turned out that the room was rather small but yet surprisingly stylish, clean and new! I really liked the decoration and the double bed was extremely comfortable. Its right next to Kilburn Park Station so its very easy to get to Marble Arch, or you can hop on bus no 98 and get to Oxford Street in 25-30 minutes. The staff was helpfull as well and Kilburn High Street is very busy and you can find a lot of shops on it. We wiill definately be back! Enjoy!", "Date": "December 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tadley, United Kingdom", "Title": "“Convenient hotel with helpful staff”", "Author": "paullegate", "ReviewID": "UR122131487", "Content": "I stayed at The Quality Maitrise Hotel for one night using Reward Points in a VIP Room. The hotel is conveniently situated on Kilburn High Road, a few minutes walk from Kilburn High Road Overground Station, trains every 20 minutes to London Euston (journey time 10 minutes). Kilburn Park Underground is a five minute walk from the hotel. I was warmly greeted and I was given a VIP room situated facing the main road however due to the good sound-proofing there was absolutely no noise. The room was fairly small but was fairly luxurious with extremely comfortable bed, tea and coffee facilities/biscuits and chocolates. The bathroom was well equipped with powerful shower. The TV did not work in the room, I like to watch the News Channel in the morning. I tried to get the TV to work but to no avail, rang the reception and the lady was most helpful by changing batteries in the remote and connection etc but could not get the TV to work. She advised a change of room. The new room was immediately above the original room and was slightly smaller in size, equally well equipped and the TV worked with a large range of Freeview channels. Breakfast was excellent with continental buffet selection and a cooked breakfast could be ordered on demand. Great hotel with helpful staff, I would eagerly return.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Newcastle, United Kingdom", "Title": "“No good.”", "Author": "lovetravel1991", "ReviewID": "UR121707215", "Content": "we payed quite abit of money to spend 4 nights here. The room was tiny, the air conditioning didnt work so the room was very hot which made for an uncomfy nights sleep. The bed was a small double with a hard matress and there were stains all up the walls on the carpet and the bed sheets. Also the tv had rubbish reception. We didnt include breakfast on the price but decided to try it on our last day, we payed nearly £8 each for a slice of toast and some cerrial. we were not offered a cooked breakfast and were not even acknowledged by the waiter untill paying for the bill and there was no orange juice left. There was only 1 cheese and nothing much else to choose from.The only good thing about the hotel was the location. very disapointed on the whole.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Great Modern Hotel!”", "Author": "travellingqqq", "ReviewID": "UR121669410", "Content": "The decor and room was sharp and modern, very nice. The bathroom shower was amazing! The bed was very comfortable and there was no noise issues. We ordered dinner a couple times with room service, and there was no charge for that, and the food was good and a reasonable price. Great area to catch a bus and visit different parts of london, and a starbucks was right across the street where we had our breakfast each morning, and also a few shopping stores. It was our first time to London and we would definitely stay at the hotel again. The only problem we had was that it took us two hours to find the place... we took the wrong bus with all our luggage, it was frustrating. So be sure you communicate to them before you arrive so you know where it is.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Fabulousa!!”", "Author": "LouiseZaphony", "ReviewID": "UR121554398", "Content": "Wow, what cracking accommodation!! Me and my hunky boyfriend came to stay here for 2 nights over the weekend! We had an excellent time ;) Excellent location just 5 minutes from the tube station! Tesco express and Starbucks directly over the road so super handy! Only thing I could fault would be that the double beds have never seen double! Iv seen bars of 2 finger kit kats bigger! Best thing about the accommodation was definitely JAMES on reception!! What a swell guy! So super helpful and friendly, really knows his stuff and will bend over backwards to help with anything!! (ladies he's also super hot and I'd have tried to snap him up for myself had I not been with my boyfriend Greg!! Shhh) Overall I highly recommend this hotel to people of all ages! U won't be disappointed!", "Date": "December 9, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Dispute the bill with the Police”", "Author": "NickA121", "ReviewID": "UR121340455", "Content": "My family and I consisting of my partner and infant son stayed in this hotel for a month at a negotiated daily flat rate for a VIP Room. We in general found the same experiences as just about everyone else who has reviewed the property in this forum - both good and bad - but what was unique about our experience was the entertainment of having the police called by Adil the 'owner' of the hotel to attempt to throw us out after my attempting to 'discuss' an incorrect bill. The hotel website <http://www.qualitymaitrise.com/index.html> clearly states that \"OUR VIP Room offer added benefits such as free daily passes to Bannantyne Health Club located three minutes walk from the hotel, cooked breakfast , chocolates on the pillow, complimentary still and sparkling water, and ELSYL range of toiletries and 15% discount at Rafkins.\" We never saw a single health club pass, and after providing over £2500 of custom to the property over the period of 4 weeks, I was presented with a month-end bill for food at Raskins (it's hard to figure what to call it; it's not a restaurant, more like in in-house canteen) that included extra costs for cooked breakfasts that were supposed to be included with the VIP room rate, and nowhere was there evidence of having received the offered 15% discount for the various dinners and drinks. When I challenged this incorrect bill, the in-house staff were unable to do anything about it, and when I requested 'head office' to call me about it, I was rudely rebuffed by the company accountant who was the acting manager. Escalation to the 'Director' who was named Adil the owner resulted in his trying to apply an abusive ploy at intimidation and coercion with an attempt to turf my family out on the street with less than one hour notice. The local police were summoned by the Owner/Director to apply pressure for me to not only cave in to paying an extra £90 for the incorrect breakfast charges and non-existent discount, but also to leave the hotel immediately with an ill son with fever. The Owner/Director was dismissive and non-responsive but finally we agreed to a settlement that included his voluntary inducement to \"write off\" the entire food bill, so that my family and I would leave the hotel immediately (instead of extending for several days to suit our travel plan). The police told me that the Owner/Director had complained that I was 'disturbing the peace' by seeking redress for the incorrect bill (despite my having taking no more threatening action than writing an e-mail). As soon as the police left the building, the Owner/Director went back on his word and undertaking with the police and not only charged the full food bill without corrrection or discount, but did so without first providing me with a final bill or opportunity to review and approve the charges to the charge card on file. The police were very heavy handed in trying to force me to submit to the Owner's administrative abuse and when I called back to enquire about the broken agreement in front of them only just moments before, I was told that there is nothing they can do, and that I can reference the file number in going to small claims court (as if I've got time for that on a limited time trip from America!). The general staff were trying to do the right thing, but the management of the hotel not only provided no customer service atttitude, but also went back on a verbal agreement in front of police. I had to endure another police visit that evening to assure my family's ability to stay an extra night to allow my son to recover his health and us to find another more hospitable property. Bottom line is that stay if you want but get everything explicitly in writing and do not trust anything that management say to you; also check your bill very carefully before you leave, my bill had a spurious charge of £297 plus the incorrectly applied cooked breakfast charges. Do not expect an ounce of customer service attitude from management and don't bother paying £4.75 for Soup of the Day it's likely to be from a can probably from Tesco across the street despite being described on the menu as being 'freshly prepared in-house'. And the \"bar\" in Rafkins hasn't had working beer taps for months so hope you like bottled beer (you'll have to ask for a glass to drink it). Maintenance is also not a strong suit in the rooms as the first room we had did not have an operative air-conditioner, which is essential even in November because the windows are nailed shut, and the second room had loose light fixtures and broken toilet accessories that were not attended to for the whole stay.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Great Value for Money”", "Author": "AMehere", "ReviewID": "UR121183249", "Content": "Stayed at the hotel on a business trip from Nov,6th onwards for 5 days. The rooms are definately refurbished with 'new looking' furniture, carpet and bathroom. The shower is fantastic and something to look forward to. The reception is very very helpful. Was looking for a sports shop and James guided me spot on.Thanks James...Kilburn High Tube station is 2 minute walk but do not confuse it with Kilburn Overground station which is diagonally across the street.You can reach Oxford Circus & Picadilly Circus on the Bakerloo like without any change of train. That was very convenient. Neigbourhood has a Sainsbury,Tesco, M&S supermarket (all open very late), Subway, Argos, pubs...all within walking distances. Breakfast was very basic but for a supplement of GBP 2.20, you can order a huge 3 eggs omlette good enough for two. Free WiFi on the room was very fast. Lift is modern and quick. Stayed in room# 210, the only negative was the huge stain in the ceiling above the shower spout...request the hotel to pls fix..very ugly looking..spoils the look of the bathroom. Also selection of channels on TV is very limited. Will definately stay on my next trip.Loved the modern look and functionality of the hotel as compared to the Victorian old world charm of the other hotels.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Needs to seriously look at themselves !”", "Author": "Steveobuff", "ReviewID": "UR120971923", "Content": "Stayed here for two nights as I was attending a family funeral. Rooms are small and I had what they call a VIP room so I would hate to see the regular rooms! But what really annoyed me was even though it states in their guest directory in the room that they have a limited night menu available until 7am when I called at 22.45 I was told that the kitchen was closed! I advised the member of staff that I just wanted a sandwich and a coke from the night menu. She said that they don't do room service and had never heard of this. Yet when I told her it was written in the directory I had right in front of me she didn't want to know. So ok no food so I said I would go down and just grab a coke and a water from the bar. Got their stood at the bar counter and was told they were closed! What! Oh we close at 11 she said. My watch said 22.55! A complete joke and a complete lack of customer service ! Would it have been that difficult to get me a coke and a water! So off out into the cold of night to find a shop which I did succeed in. Very very annoyed at the quality maitrise hotel! Not a 4 star hotel.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "North West England", "Title": "“Some pros but too many cons....”", "Author": "Shorrj01", "ReviewID": "UR120586762", "Content": "My friend and I stayed here just for one night, having booked a twin room online at a good price (for London!) When the confirmation came through it did state the room had no window so we were expecting that. On arrival at the check-in the receptionist asked if we still wanted a twin room. We said yes, and she asked her other colleague on reception to 'do her a favour' and gave her our room key. She disappeared off and when she returned the first receptionist asked her 'Is it ok?' to which she replied 'yes'. It all looked very peculiar We were then given the key and on first glance the room looked fine with plea sant decor and a stong smell of air freshner (as though perhaps it had just been sprayed). The twin room was compact and. very hot. We put the air con on and it soon cooled down. However, we quickly noticed that the air con unit was dripping from the ceiling onto the carpet and on closer inspection I would think this is a pretty regular occurance as there were water marks on the base of the bed. I went to tell the lady on reception who seemed to be surprised but I suspect they are aware of this as a problem. They offered to move us immediately but they had no more twin rooms, meaning my friend and I had to share a very small double bed, which isn't ideal if you are not a couple and does not make for the best night's sleep. Also the room was so hot (it was November!) and we needed air con on all night, which was noisy. We used the toilet downstairs near reception which was filthy dirty and had no lock. It clearly had not been cleaned for sometime, which I always see as a marker for how much the hotel cares about cleanliness and its customers. The pros: It's a short walk from Kilburn Park Tube, there is a safe and mini fridge in room, a great shower and a tesco express across the road for supplies. You can also leave luggage in a safe room. However, we stayed the second night in a Travelodge and that was cleaner, the rooms were bigger, had a window and I'd much rather pay less and stay in a clean functional room than pay this kind of price expecting a four star hotel, which wasn't any better than a budget chain.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Midlands, UK", "Title": "“Good location, well equipped rooms”", "Author": "finchaa", "ReviewID": "UR120452442", "Content": "The reception area of the hotel is very plush and smacks of grandeur which is a lovely welcome to the hotel. Whilst the rooms are small, they're well equipped with fabulous power showers. The beds are not the largest doubles, but they're comfortable. The rooms don't have iron or ironing boards but we were provided with one within minutes of asking for it. However, on our first night the hotel was incredibly hot, air conditioning did little to temper the heat (and we were staying on the first weekend in November) and when I suggested tot he receptionist the following morning that the heating was too high it took a while for her to take on board my feedback, instead suggesting that I didn't know how to use the air conditioning (all of our group were wilting overnight!). Anyhow, when we returned later that day the heating had been adjusted to a much more suitable temperature. The hotel has a bar but it closes at 11pm. Kind of pointless?? The breakfast offering was fine, though by Sunday the small pastries were stale (lord knows how long they'd been there, judging by the taste and feel of them... days). The service at breakfast on Saturday was appalling. After waiting for 15 minutes for the waiter to take our breakfast order, hubby went to the kitchen to ask if he could order only to be told that he'd be right over. When he came tot he table it transpired the waiter didn't speak English (we wanted a full english with poached eggs) and so our order arrived (incorrectly) after a further 20 minutes. So, having sent that back we finally got our breakfast order almost an hour after we went down to breakfast!! Sunday's service was much better so maybe this was a one off? Whilst the decor of the hotel is lovely, there are some details that are overlooked. The tap in our room was falling off, the room was dusty and bags of rubbish were left in the corridoors. I'm tempted to say the hotel is \"all fur coat and no knickers\" but it's not quite that bad. However, my advice would be to make sure the details don't let down the gloss and glamour that is the first impression.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Good location, very good design”", "Author": "NNaaZZ", "ReviewID": "UR120168392", "Content": "Stayed 2 days, everything was ok. We arrived 5 past 2 pm, the room was not ready, we had to wait a couple of minutes (got a free cafe). Not a so called budget hotel: shower was ok, no problem with the hot water, bed really good, room clean, everything on reasonable price!", "Date": "November 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Buyer beware”", "Author": "R0binsRule", "ReviewID": "UR119039892", "Content": "This hotel makes false claims about its rooms. The 'executive rooms' are a complete con and not at all as described. I would not advise anyone to stay here.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Warrington, United Kingdom", "Title": "“Mushroom growing in my room!!!”", "Author": "Neil L", "ReviewID": "UR118992570", "Content": "I booked into this hotel 13.09.11 on business for 3 nights on the proviso that it was cheaper, yet still luxurious, option to the Marriott located 100 yards down the road. On checking in, my colleague and I discovered that the VIP rooms we had booked weren't available, although were told that the additional charge is for use of a gym and a higher floor, and that the standard of accomodation is the same in all rooms. On entering room 202, i noticed that it was small, yet stylish, but there was a strange smell. This appeeared to be coming from a very large damp patch on the carpet next to the open bathroom door. Now, I'm a tolerant person, and I know these things can happen when people stay in hotels and don't always look after the rooms as well as they would their own home, so I didn't make a fuss. However, it became apparant that the carpet wasn't just stained it was actually wet. never the less, I said nothing and spent night there. The following evening, my colleague and I had some work to do, so grabbed some food and headed back to my room. She also commented on the smell and the stain when we enetered. Having stayed on my own, I hadn't at this point bothered to close the bathroom door, however, my colleague paid a visit, and when she exited the Bathroom, closed the door behind her. That's when we saw it. A mushroom growing out of the carpet and skirting boards behind the bathroom door. And not just a bit of fungus - a full mushroom, about 1.5 inches in height. Not only is this revolting, but it begs the question - how long has it been since the room has been properly cleaned? I would imaging a mushroom to take at least a couple of weeks to grow, no? I immediately headed down to the front desk and reported the problem. I was met with shock, admittedly, but also that the hotel was full and they couldn't move me. They assured me they would move me in the morning and apologised again. However, I had to ask them to at least come and take care of it - no offer was made to remove the offending item. To this I was met with 'I'll see if I can get someone from the restaurant to take care of it', which doesn't inspire me that hygiene is at the forefront of their minds - I mean, did it end up in the breakfast the day after? After about an hour, the desk clerk, having been unable to source someone suitable from the restaurant to take care of this, knocked on my door, 'picked' the mushroom from the carpet and gave the rest of the damp and stained carpet a half-hearted rub with a sink sponge and some non-descript cleaner spray. She was again apologetic, but generally useless to my plight - I could have done what she did myself using gear out of the bathroom. The following morning, I packed and moved out of the room. When I returned from work, I was given a new room (fungus free) on the third floor - 302. This room was fine (as long as I try and avoid the memory of next doors banging headboard at 3am). The following morning I checked out quickly due to having a busy day, fully intending to address the whole matter with the hotel management on my return home. However, on my return home, and checking my reciept, not only had they not comped any part of my previous 2 nights in a room that, frankly, defies all health and safety laws, but they had the cheek to charge me more for my third night - presumably the higher floor made it a VIP room, and yet there was absolutely no difference in the facilities, products, size or standard of the room that warranted an additional £16 charge. One could argue that I actually had more for less in the cheaper room, although I only wanted room, not a mush-room. I will never stay at this hotel again. Regardless of whether or not the mushroom was isolated to one room, it says a lot about the standard of cleanliness. Clearly the rooms aren't cleaned thoroughly, otherwise the fungus wouldn't have matured so beautifully. Be afraid - be very afraid...", "Date": "October 6, 2011"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "nottingham", "Title": "“Rude receptionist made me change my mind”", "Author": "asukuki", "ReviewID": "UR118450247", "Content": "Called to book a room, I looked on their website and saw it for £109 for Sunday 30 Sept. When this lady named Domineca took my call she was very strong that it was not possible as in \"her computer\" only says £119, they way she spoke was very rude and she carried on saying \"I don't know what you saw on the website, I am telling you the way it is\". Someone should deal with this lady. I would not want to find myself alone in the hotel and call for help when she is the one to assist customers. Very bad.", "Date": "September 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "kent", "Title": "“Nice one night stay”", "Author": "porkchap", "ReviewID": "UR118422076", "Content": "I booked this hotel for one night for my partners birthday, Kilburn is a great location as it is out of central london but on the door step of the tube. We checked in at 3pm with no issues spent about half an hour in our room for a quick wash then went out returning at about 11pm. Yes the room was a little small but it was clean with nice decor and had a very nice bathroom. I have nothing bad to say about the hotel but the only thing i would say would be that i paid extra for a \"VIP\" room but as far as i can tell all that made it VIP was that it was on the top floor which made no difference as there was no view and the windows do not open but the AC was good. Lastly the mini bar was empty (not even a bottle of water) and as it was a birthday stay we probably would have got stuck in so the hotel missed a good up sell.", "Date": "September 21, 2011"}, {"Ratings": {"Location": "3", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Nykoping, Sweden", "Title": "“Great value and close to the tube”", "Author": "CannnotSleepOnPlane", "ReviewID": "UR118125977", "Content": "A nice and clean hotell, though the beds where quite small. Not a central location but close to subway (Kilburn Park on Bakerloo line) witch can take you to many of the most visited areas like Oxford Circus, Picadilly and Waterloo. If you are a party animal the taxi home when subway´s not in service cost a bit. Near the hotel is a Tesco, a few pubs and across the street a club open until late.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "British Columbia", "Title": "“The service was excellent; room not so great.”", "Author": "aces11", "ReviewID": "UR116540618", "Content": "Very nice people working here. We were first given a room with broken AC, so they moved us (I see that others had the same problem with that room!). New room had AC (thank goodness!), but was extremely small with only a double bed!! You had to turn sideways to get in and out of the bathroom. TV was very small, albeit a new, flat-screen. Not much room for anything in the rooms!! Excellent service in the restaurant and at the front desk (but employees do need to work on their English). Very close to the tube station which was convenient. Good price, but would look at other hotels closer to downtown London. If you don't mind the room size (you're only sleeping there afterall), then would say try it.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“brilliant for the price”", "Author": "stephen l", "ReviewID": "UR116508971", "Content": "I got this room at a bit of a bargain apparently but would have happily paid more. I only stayed one night and the only member of staff I met was brilliant, nice and chatty and generally helpful and polite. the room was very small yes and the view wasnt a beautiful park view or one of the river. it was a nice sized bed, enough room to store 2 average sized suitcases and pack away your clothes. the tv works and had a dock for my ipod. the bed was extremely comfortable. room was very clean. the bathroom was clean and modern with an amazing shower. had a kettle in my room with complimentary cookies, instant coffee and tea. there was a mini bar but I didnt use it. Location was right next to the kilburn park (3 minute walk) and directly oposite a tesco and startbucks. I've stayed in some of the best hotels in the world (wynn hotel las vegas) and worst (carter hotel ny) and i know what I like in a hotel to get the best from my stay and this had it.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Egypt", "Title": "“Actually I liked the hotel ,good value for money”", "Author": "shahy", "ReviewID": "UR116256464", "Content": "I stayed in room 210 , me and my husband from 16th july till the 25th of july . i was amazed by the closeness of the location of the kilburn park underground station , or the bus station in front of the hotel entrance . The location was perfect for me primark and M&S food and starbucks very close and tesco express right in front of the hotel and with unlimited oyster card , u can go everywhere . the room had ipod dock and LCD tvand a fridge , hairdryer, safe and most important free internet connection ,the bathroom was nice , great hot water , nice shower cabinet , and towel heating rack , my only concern about was that the bed was a bit smaller than usual double queen beds, the tv didn;t work quiet well with its remote control , and the window doesn't open at all , the staff was extra nice the receptionst was very nice , veronicka and elyien .the breakfast staff was amazing , Bako , Mohamed , they make the best cappaccinos ever , the chief was always nice and always doing fresh pastries . we had a good stay . we paid GBP896 for 9 nights with breakfast,This is a good value for money , i would definitely stay here again", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Poole, United Kingdom", "Title": "“Stay away from here!”", "Author": "Chantelkg", "ReviewID": "UR115234038", "Content": "This hotel is horrid. See picture attached with the view from my bedroom. It took over an hour to move rooms despite the hote having multiple vacancies. The receptionist - albeit new - was ineffecient. I moved to an equally poor room where you could hear trafffic and the noise from outside. Due to the view from the hotel, I did not want to eat a meal there so merely ordered ice cream which was old and frost bitten. I was not initially offered any compensation so when I wrote to the manager - he offered 50% of my next stay. I don't think so. I'm still waiting for a response to my further two emails. Never ever ever again... sooooo much better elsewhere.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "1.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Impossible hot”", "Author": "timboj", "ReviewID": "UR114925830", "Content": "Two issues - Aircon and TV. Upon checking in I was informed the air-conditioning was broken and they would have normally rung ahead to warn guests but in this case they had not. I was offered a (warm) bottle of water and an electric fan. Upon reaching the room the temperature was ridiculous and the window was sealed shut. I checked for availability in local hotels as an alternative but nothing available so I had to literally sweat it out, did not get any sleep The hotel seemed otherwise OK but a little small (it does sell itself as boutique so can't complain!). All but one member of staff was indifferent about the problems and no apologies offered in the morning. On a more general point the TV service has many of the free digital channels in th eUK which was good but the control system was very slow (no good for channel hoppers) and the picture quality abysmal.", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Derby, United Kingdom", "Title": "“Exceeded expectations”", "Author": "AMBARNICOAT", "ReviewID": "UR114861627", "Content": "Myself and a colleague were booked in for an over night stay to attend a conference. We found the Hotel to be in a great location with Tube station close by, and Tesco Express and Starbucks across the road. The rooms although a little small were very clean and modern in decor and offered everything that was required for the trip. We had a meal in the hotel restaurant and breakfast the next morning which was absolutely faultless, as was the helpful and polite staff that were serving. Would recommend people in the future to stay here as I had a very enjoyable experience", "Date": "June 29, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "nottingham", "Title": "“will never go back”", "Author": "jasperNottingham", "ReviewID": "UR114675117", "Content": "we arrived at 3pm on Saturday and couldnt get into our room as the system was down and we were given no alternative so we went sightseeing without being able to wash and get changed. Noone came to help and the receptionist spoke poor english.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Calgary, Canada", "Title": "“Pleasant experience”", "Author": "missaelle", "ReviewID": "UR114277380", "Content": "Had read mixed reviews about this hotel before booking and was a little hesitant but the price on a hotel booking website was too good to pass up so we booked it anyways. Arrived early in the morning at around 10am knowing that we would not be able to check in but the very nice receptionist showed us where we could store our luggage and told us to check back at around 1pm to see if the room would be ready. We arrived back at the front desk a little past noon and were informed that we could go up to our room. We booked an executive room so it had a window but were told that none of the windows in the hotel could be opened but we found the AC to be very good. Shower was great with lots of hot water and good water pressure. The only negative was we could not get the in-room safe to work and despite the many attempts of the front desk staff the safe could not opened. We were allowed to store items in the manager's safe but it is definitely not as convenient as the in-room safe. Location is good. Tesco Express right across the street, which was good for stocking up on snacks and beverages. Coin laundry right next door. Underground station was 2 minute walk away and 10 min or so ride to all of the central london attractions.", "Date": "June 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Charlestown, Nevis", "Title": "“I didn't know that a closet could also be a hotel room”", "Author": "Mihajlovic", "ReviewID": "UR110373637", "Content": "Cramped and tiny, and not exactly the most posh or trendy neighbourhood either, don't stay there.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Never again!”", "Author": "Bowds50", "ReviewID": "UR109666691", "Content": "We had been upgraded to an executive room which meant you got a free bottle of water and a small window that would not open. The room was stifling hot and the only way to have any degree of comfort was to keep the air-conditioning on ( very noisy). I then found a cockroach in my bed and was moved to another room that had no windows. I stayed up all night as my faith was shaken in the cleanliness of the rooms. Having had no sleep, I then came down to a breakfast that looked as if it had been standing for days - so my colleagues and I left , minus breakfast to return to Euston station for a hearty meal. A complete disaster - never again.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Cork, Ireland", "Title": "“This hotel ruined my holiday”", "Author": "spark72", "ReviewID": "UR103938640", "Content": "The title speaks for itself. Initially the hotel looked very nice. We were able to overlook the fact that the room & bathroom were so small. On arrival we had to contact reception to ask if we could move to a room that had a window that we could open to be told that all the rooms in the hotel had only got windows that couldn't be opened. Rooms hot & stuffy & very clastrophobic. We also got a room overlooking a load of dumped rubbish..not very appealling. Again overlooked this. The bar was relaxing and the food was fine. Our biggest disgust came when we were relaxing in our room on the last evening of our holiday and a MOUSE ran across the room and went behind the head board. TOTAL DISGUST. Receptionist moved us to another room but couldn't relax there at all & ended up leaving the hotel & having to travel back to heathrow @ 5pm in the evening & having to organise accommodation for our last night at that stage. I have a phobia about mice and to have to deal with something like that while on holiday is just disgusting. Don't think I could ever stay in a Quality hotel again.", "Date": "April 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Whittlebury, United Kingdom", "Title": "“A trully abysmal experience”", "Author": "Cliveh61", "ReviewID": "UR101629807", "Content": "To say that this hotel could not give a damn is an understatement 1. When I arrived, there was no-one on reception and I had to wait for over 5 minutes despite being in a hurry for an event 2. The TV did not work. I reported it, nothing was done 3. The bath was missing a plug and thus could not be used 4. The radio/ipod was missing a power lead and hence could not be used 5. The room had biscuits, milk, cups etc.. – but no kettle – I could not have a drink 6. The room had only 3 hangers and no hooks 7. On leaving, when asked if I had had a good stay, I recited the above list – the receptionist merely shrugged her shoulders as if to say \"why should I care\"", "Date": "March 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Orlando, Florida", "Title": "“Good value for the pounds you pay”", "Author": "roxy657", "ReviewID": "UR101409293", "Content": "We just got back from a 4 nights stay here and were overall pleased with the accomodations. It was a great value at about 100 pounds a night. Really close to the underground which is great, about 15-25 minutes on that to the main attractions of London. The room was big for Europe, but by American Standards it was pretty small. Bed was hard and pretty uncomfortable but I will admit that I am pretty picky in this area. Nice hot water in the bathroom (almost to hot!). If you are planning on spending most of your time exploring the city and not a lot of time in your room this is perfect! Starbucks is across the street plus a really great bar called the Westbury as well. If you are in to saving money there is a Tesco express across the street as well so you can stock up on snacks and save some funds. I could not have asked for a better location, out of the way, everything you need right there, and not to far from the city! And they have free wi-fi which is really hard to find and a must for my fiance!", "Date": "March 24, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Swindon", "Title": "“There is a reason why it is cheaper than other hotels in the area...”", "Author": "NAAB", "ReviewID": "UR98749434", "Content": "The price looked too good to be true. £79 inc breakfast. The Bad: 1. First room had no window. 2. Second room had sealed window overlooking dumped rubbish. 3. Bathroom had a very stale smell. 4. Room temp 30C+ 5. Air con did not work. 6. TV remote only worked within 30cm of the TV 7. Only 1 of the 5 draught drinks working The good: 1. Only 2 min walk from tube 2. Nice room decor 3. Cont' breakfast OK", "Date": "March 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sutton Coldfield, United Kingdom", "Title": "“Beautiful hotel with a bit of noise and a soggy carpet!”", "Author": "Mrssjam", "ReviewID": "UR88822104", "Content": "We stayed at the Quality Maitrise hotel for my birthday. It was snowing outside and we both felt really sorry for the girl on reception as she must have been freezing, every time the front doors opened there was an icy blast that blew all her papers everywhere! The hotel itself looks amazing! Ultra modern and very very stylish! Our room was very nice, the bed was a little hard and there was a large pane of glass leaning on the wall at one side of the bed, when we drew back the curtains we realised this was the secondary double glazing and as it was freezing outside we decided to replace it ourselves! The room itself was not very big, it was a struggle for both of us to walk round the bottom of the bed at the same time. The mattress was also quite hard. Ans there was a long blonde hair on the bedside table! Eww! We went downstairs to Rafkins Bar and Restaurant after seeing what they had to offer on an advert in the lift and on leaflets left out on our bed. The restaurant serves until 10.30 and has a good selection of drinks. However not much of the food advertised in the room or in the lift were on the actual restaurant menu which we found a bit strange. It was a bit of a struggle ordering as the staff did not speak fantastic English, a couple on the next table ordered a Corona and ended up with a Coke and I ordered Sherry Trifle and ended up with Apple and Raspberry crumble (this wasn't even mentioned on the menu so I have no idea where it came from!!!!). The food we ordered was very good though. We got back to our room and this was the first time we had taken our shoes off. We realised that there were big soggy patches on the carpet, it definitely wasn't from our shoes and was very wet to walk on. At this point it was around midnight so we decided to leave the matter and mention it on check out. The room we were in (301) was very noisy. It was right next to the lift and where the maid trolley was kept so you could hear people walking past all night and then the maids chatting about uniforms in the morning. You could also hear noise from upstairs and every hour or so we were woken through out the night by a loud clicking and squeaking noise which we assumed was the heating. Amazingly though, there was no noise from Kilburn High Road. The only saving grace was the shower. It was amazing even if the door was broken and sprayed water all over the bathroom floor. When we were about to check out there was a knock on the door, even though we had the 'Do Not Disturb' sign on the door. It was a random man with a key card in his hand. He wasn't wearing a uniform but said he had to fit the pane of glass in the room for us and it would only take a minute. I explained that we had already done it ourselves and he scuttled off, key in hand! When we checked out we weren't even asked if we had had a good stay, the girl on reception was probably too cold to think about asking! So I mentioned that the carpet was soaking wet in the room. All she said was 'Oh, I'll mention it to house keeping'. The hotel was ok for the price and we would probably stay again if we could get it at the same price but only because it is cheap for London, not because it was very good!", "Date": "December 2, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Galway, Ireland", "Title": "“Worst hotel ever”", "Author": "Galwaygirl7_10", "ReviewID": "UR86113982", "Content": "This has to be the worst hotel i have ever stayed in. The room was a shoe box that you couldnt walk around without banging your leg off the end of the bed. The bath room was so tiny you had to walk in sideways so as not to bang into the towel rail and i am not large. the shower was fine as long as you didnt want to move your arms to wash your hair or self. We arrived back from our day to a room that was filthy had not been cleaned and was actually dirtier than how we left it. there were marks in the shower as if someone was standing in it with dirty shoes and pink stuff around it and on the tiles outside it. truly disgusting. On requesting to move to another room on the 1st night we were told hotel was full and we would be moved 2nd day but true to form all we got was ignorant responses from the receptionist on asking that morning. When we returned and saw the room in this apalling state we complained and again requested to be moved and yet again we were told that Hotel was full even though in our 2 nights and days there i was able to count on one hand the amount of people we came across. Truly the worst hotel ever with the rudest receptionist i have ever have the misfortune to come across. Stay well clear as the rooms are not as described and experience is hellish to say the least. Coming from Ireland our hotels are far superior to this and they could learn a thing or 2 about how to treat paying customers. Very disappointed Irish traveller.", "Date": "November 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "warwickshire", "Title": "“great hotel”", "Author": "sianay", "ReviewID": "UR83364306", "Content": "I stayed at the quality hotel with a friend for 2 nights. We found it and booked it on a london hotel website. The reviews we read were good so decided to give it a go. It told us the hotel was in maida vale but it was much closer to the kilburn park underground. On the map it looked like we were going to have to walk a bit which we didnt mind but when we got there it was only up the road, we had a tesco express right opposite and plenty of places to get food and drinks. We arrived at about 11.30 but knew we couldnt check in til 2.00 so we decided to have a walk around, we were told that we could leave our cases there so we didnt have to lug them around. We got back to the hotel at 1.30 and the receptionist said we could check in even though we were slightly early. She was extremly helpful, polite and friendly. The reviews we had read about the rooms said that they were too warm and very small, it is true that they were slightly warm but we just put the air conditioning on and we were fine, as for the size, it was fine for a few nights but maybe you would want something bigger if your stay is longer. The room was very clean and the decor was lovely and you could hardly hear any noise from outside and virtually nothing from other guests. The only thing we had to report to reception was about the mini bar, normally the fridge is locked and you have to get a key from reception but the lock was broken on ours and we could access it. There is a list with the fridge contents and prices an when we checked this we found that a few of the items were missing. As we hadnt had these ourselves and didnt want to be charged for them at the end of our stay we phoned down to the front desk and just mentioned it. The receptionist on duty apologised and made sure we were not billed. Everytime we left or returned to the building we were always acknowledged by whoever was on reception. Checking in and out was simple and quick, the location was nice as it was not at the centre of all the buzz but not to far out and only 2 mins from the nearest tube. Overall we both had a very pleasant stay and have nothing to complain about (which is very rare for us!)", "Date": "October 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "london", "Title": "“Don't judge a book by it's cover”", "Author": "khmerkiwi", "ReviewID": "UR82681712", "Content": "Felt ripped off - no window, broken tv, thin walls, unhelpful management, way over priced", "Date": "October 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Stavanger, Norway", "Title": "“Disappointing service in this new hotel”", "Author": "PowderSparkle Posted by a Choicehotels traveler", "ReviewID": "UR82301815", "Content": "When I came in to the hotel I was quite impressed. There was lovely chandeliers in the reception area, and the hotel looked nice and new. Location wise I know the area, and the hotel is not far from the tube station at all. However, lovely as the hotel was, the service provided (or the lack of it) ruined my experience. I stayed at the hotel from a thursday to monday, and there are several things I was disappointed with during my stay, one of them being that the keycard didn't work 4 times, and I had to go back to the reception and have them sort out the card. On the saturday when I came back to the hotel I tried to order roomservice as I was going back out shortly after. I called them repeatedly, but not once did they answer the phone. I called reception and did not get a response there either, so I had to go to the Tesco across the road to get dinner. When I passed the reception on the way out, no one was there. On my last night when I arrived back at the hotel with a friend who was staying with me in my double room the last night, the room hadn't been cleaned, and when I asked reception they said they would make sure it was cleaned the next day. I informed them that I was checking out the next day, and requested new towels as the ones in the room had been used. I was told I could not have them until housekeeping got there the next morning, and only got them after asking repeatedly. The hotel also don't have a luggage room where items could be left during the day, and as my flight was not until late monday, on my departure day we had to leave the luggage in the reception room. There were bags and suitcases everywhere, it looked messy, and didn't feel safe, anyone could have walked in taken them. The hotel is lovely and new, but the service was awful. Hopefully the hotel will sort out these problems in the future, but I won't be staying again.", "Date": "October 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "kr.sand", "Title": "“Looks good on the outside but....TERRIBLE on the inside...”", "Author": "alexKr_sand", "ReviewID": "UR81868926", "Content": "We booked 2 rooms for 6 days stay in july. Holiday. Got a room with no windows. Claustraphobic as hell. Broken tv. No hairdryer,(all these items were advertised on the website) bathtub was broken in both rooms. We asked to get another room because of the window situation and got a bigger room with an awfull smell of vomit an smoke. Windows couldnt open. When entered the bathroom, the sink was clogged with vomit. Disgusting! We had to fix it ourselves because we were to tired of complaining to the receptionists (only the women were rude, never the men.) Everyone had iphones so we were pleased that the hotel came with docking stations. Or not. >The one room got a broken docking station and the othe didnt get one at all. Crappy breakfast with three selections of food. Cereal, cheese or crossaint. enjoy!", "Date": "October 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Nottingham", "Title": "“Very nice, but, tiny!”", "Author": "h_abdulkarim", "ReviewID": "UR80708817", "Content": "This is a very beautifully designed hotel, with state of the art technology. The Tube station(kilburn park) which directly takes you into Oxford St and major attractions is within a waking distance. The staff is helpful and attentive to customer requirements. There are many shops, restaurants, and pubs near by the hotel! The only shortfalls are: rooms are very tiny and would ONLY fit two persons! We had a toddler with us, and the cot would not have been an option as the room hasnt enough space! We booked through bookings.com and got the VIP Room, although it said there are slippers and additional free stuff (such as water bottles) we never had any even though we recurrently asked for them!", "Date": "September 23, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Do not stay here”", "Author": "Haych001", "ReviewID": "UR78609621", "Content": "Very tiny, claustrophobic rooms even by London standards and not in a great area of London. Paper thin walls so you can hear noise in adjoining rooms. Booked a QS bed and got a old hard double then were told it was a QS.....don't think so! Room was more like a bedroom with an ensuite. Safe was broken and we couldn't get it fixed. Blonde receptionist rude and didn't even acknowledge guests when walking past, however young man very very helpful and nice. Would not recommend staying at this hotel.", "Date": "September 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Dissapointing i booked an executive room...”", "Author": "buggsy55", "ReviewID": "UR78582536", "Content": "Dissapointing i booked an executive room and i was given a small room with no windows and a tv that didnt work i did ask for someone to try and fix it nobody bothered the decor is nice and generally the service is good wouldnt stay again though", "Date": "September 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“COMFORTABLE”", "Author": "Daria_10", "ReviewID": "UR75769730", "Content": "I have stayed there only for 2 nights and I must say the hotel looks very elegant. Rooms are clean and comfortable with all necessary facilities. The food is good in resonable prices. Staff is friendly and helpfull. Very close to tubes, buses and many shops arround. I will definitly go back to this hotel on my next trip.", "Date": "August 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Wales/England", "Title": "“DON'T BOTHER LOOKING!”", "Author": "Miffed-from-West-Mid", "ReviewID": "UR74607494", "Content": "Prices have gone up incredibly from the time this hotel has opened. It is now on average about £159 a room/night whereas the much better Marriott down the road charges £115 for a much bigger room, more spacious better appointed hotel. Judging by the empty restaurant in the mornngs and evenings, other people seem to be of the same opinion. This is a Quality Inn when all is said and done - a budget hotel with far from budget prices. Don't bother staying here until they bring the prices down!", "Date": "August 10, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Cawood", "Title": "“No Hot Water. No Windows!!!!!”", "Author": "CawoodRedmen", "ReviewID": "UR70584540", "Content": "Arrived after 4 hour drive to find I had been given a disabled room (sinks by your knees) with no window(hot). Tried to have a shower but no hot water. Tried again in the morning but stil no hot water. Asked reception who said that the boiler was broken and there was nothing they could do til the manager arrived. Needless to say...........I departed before the manager came in and asked the reception to get the manager to call me so I could complain about my stay. Surprise surprise no phone call. What an awful hotel!", "Date": "July 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Luxembourg", "Title": "“A very nice hotel”", "Author": "AgPLU", "ReviewID": "UR70581792", "Content": "A very nice hotel. Got a room with no windows at first but we changed for another one with no problems (as there were a few available we were even offered to choose). Nice design and very clean. Breakfast included, which is a big advantage compared to other hotels which offer breakfast for 15 pounds per person. Rooms not very spacious but this is normal for London. Not in the strict centre so prices more attractive but sub nearby which will take you to the centre in 10/15min. After midnight there is a night bus which stops just in front of the hotel, it takes more time but very convenient. All in all, we had a nice stay and no unpleasant surprises.", "Date": "July 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "belfast", "Title": "“Hot Hot Hot”", "Author": "Maria L", "ReviewID": "UR69417299", "Content": "We stayed in this hotel for one night, we were in London for a concert, the hotel itself was clean and really modern, however the air conditioning didn't seem to work, not only was our room like a sauna but so were the hallways. The manager tried working with us and had the A/C working by the time we got back, but it stopped in the middle of the night we couldn’t sleep in the room, and didn’t even cross his mind to apologise for the inconvenience. The room was quite small, had an iPod docking station which was great, nice bathroom and paper thin walls. This hotel is only been running for a year or so, teething problems should be well sorted by now, even instructions to work the A/C in the room would be handy. Rafkins (internal restaurant) menu leaves a lot to be desired. The hotel is close to a lot of ammenities, with a great bus service and metro near by, however I would not stay here again.", "Date": "July 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Manchester", "Title": "“Style over substance”", "Author": "Rach1405", "ReviewID": "UR68006198", "Content": "After reading the previous reviews on this hotel, my partner and I decided to take our chances and try the Quality Maitrise. When we we arrived at our room, it had not been cleaned after the previous guests, but we were given another (clean) room immediately. Good points: Excellent shower, clean (eventually!), quiet, relatively cheap for London and the staff weren't rude. Bad points: rooms were very, very hot, which is saying something as I usually wear three jumpers in summer. The windows didnt open, and when we complained, the staff member said he would change the air con setting on his computer but we noticed no difference. The hotel seems to go for style over substance - quality of the furnishings were poor, especially the bed (worst nights sleep I've had in ages). To class it as a 4 star hotel is a bit of a stretch of the imagination.", "Date": "June 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "manchester", "Title": "“Simply brilliant!!!! We will be back!!!”", "Author": "danielle8869", "ReviewID": "UR67611313", "Content": "I stayed in quality maitrise hotel for three days as a long weekend break in london with my boyfriend, we thouroughly enjoyed staying in the modern and fashionable hotel the staff were friendly , high standard of cleanliness and the rooms were very nice i had great lie in and the showers were just amazing my boyfriend had to beg me to get out of them, one criticism being the rooms being quite small but the hotel made up for that .We came to a bit of shopping and found it was very convenient for us as central london was a few train stops away it was great!. I definitly will not hesitate to come back.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Auckland", "Title": "“Not what the pictures show”", "Author": "RankinAuckland", "ReviewID": "UR65973453", "Content": "We recently checked in to this hotel and then checked out once we had seen the room. The pictures of this hotel do not represent the true standard of this hotel.What appears to be a spacious and roomy lobby is a small reception area, and the rooms are not much better. Even though the hotel was opened in 2009 (according to the plaque on the wall) the rooms are very small, and tired. Our sink plug didnt open, and the so call room safe wasnt even bolted to the floor! The staff were pleasant but rather off hand, and didnt have a clue when asked if they had any maps of the city for sightseeing purposes, a must in big city like London. It is also a long way out of centra London, making it an expensive taxi ride into the heart of the city. I was generally was very disappointed, as the hotel looked very nice on the internet. A real let down. In my opinion, not a good choice for a hotel in London. We promptly checked out and headed for a muchnicer and roomier hotel in Kensington.", "Date": "May 31, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "2"}, "AuthorLocation": "west mids", "Title": "“really 4 stars?”", "Author": "menna72", "ReviewID": "UR64236854", "Content": "very suprised that this hotel has a 4 star status. staff were friendly but lacking in professionalism, particulary in the restaurant where we had to wait a long time for our breakfast and were left without cutlery and drinks. when it did arrive we were suprised to find that the sausage and 'bacon' were not pork; this was not made clear when we pre-ordered on-line. again reception staff were friendly but seems to be poorly trained. checking in and out presented problems with receptionists not being aware that we had paid in advance. although described as a boutique hotel the rooms lacked the quality of finish you would expect; the walls were paper thin and the room noisy during the day and morning, although quieter at night. the card for the air con was also not working properly and when we rang to we were not advised that the handy man was unavailable until we rang again and were told to move the card around to get the aircon working. during our wait the room was stifling. the room was also very small, although clean and tidy. generally disappointing. presents itself as a high quality hotel but is very rough around the edges. nice wallpaper and chandaliers do not compensate for it's amateurishness.", "Date": "May 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "somewhere between London and Brittany", "Title": "“LOVE it!”", "Author": "Blogmum", "ReviewID": "UR63966241", "Content": "Have stayed here three times over the last couple of months with work trips. Will definitely go back and would recommend to anyone needing to stay in the area, or who wants a cost-effective way to be in London (20 mins on the tube and you save a fortune on central London hotel prices). The staff are lovely: I can't praise them enough. Friendly, helpful, and most of all, great at fixing my TV which broke on election night ;-) The rooms are nice - not big, but adequate, clean, and stylish. The free wifi is very welcome, and reliable too. I'll definitely stay here again.", "Date": "May 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Northamptonshire", "Title": "“Rude, arrogant staff”", "Author": "oil1978", "ReviewID": "UR63959816", "Content": "I attempted to check in but had to wait for the staff to finish their conversation in Spanish while they complained to each other about how busy they are. My key was thrust in my face with no direction on how to find my room. When I got to my room the tv did not work - I phoned reception and asked for it to be fixed and was told they would come back to me in 5 minutes. 20 minutes later I phoned again and a very aggrivated recptionist told me to give her 15 minutes - I asked what she would do after 15 minutes at which point she became more aggrivated and said \"if I can't get it fixed, I won't be talking to you\" I asked her if I would be moved if it could not be fixed at which point she laughed and told me they were full. Needless to say I heard nothing and being pregnant I could not face the further aggrivation of arguing with such an unsavoury woman. A truly terrible experience", "Date": "May 12, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "london", "Title": "“Quality??? I think NOT!!”", "Author": "Betty099", "ReviewID": "UR63914459", "Content": "I tried to book this hotel online for Valentines night and the website was down!! 3 months later I notice that they have taken £105 from my account. When i tried to get it sorted the hotel were unhelpful, not able to understand me or listen, a complete disgrace. Avoid this hotel and more importantly its website at all costs!!!!!!!!!!!!!!!!!", "Date": "May 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bristol", "Title": "“No complaints here”", "Author": "EllieandJulian", "ReviewID": "UR61292401", "Content": "Stayed here for 1 night prior to business meeting in the capital. We booked the day of travelling and our rooms were ready for us when we checked in at around 8pm. Staff were very polite, both on reception and in the bar area. The bar prices incidentally (I thought) were very reasonable, considering it's a 4star hotel in London! I stayed in room 111, which was larger than the rooms my colleagues had, but all 3 were fine for purpose. The decor was modern and the room was clean. Good features were the large rainforest shower, the new 32\" flatscreen TV, and ipod/phone docking station. The bed was fairly comfy, not too soft. Plenty of storage if you wanted to stay for more than one night. Only (tiny!) gripe I had were there were only two pilows in the room, which would have meant a trip to reception to get a few more, if I was travelling with hubby. But fine when on my own. We didn't eat in the hotel (although the Asian food looked really nice), there is a nice rustic Italian 1 or 2 doors down if you fancied something different. There is a tube station minutes from the entrance, which is also very handy.", "Date": "April 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“Quality Maitrise Delivered - Hidden Gem !”", "Author": "petersanderson1973", "ReviewID": "UR60307144", "Content": "I stayed at the Hotel for two nights and loved everything about it The room was stylish and of a high standard, the bed was really comfy and the bathroom were clean and modern. The shower was fantastic !. The hotel has free WI FI throughout which is really fast and I choose to work on my lap top in the restaurant aea on the ground floor enjoying a latte.. The Hotel is obviously new so everthing was immaculate and stylish. I would definately return to this Hotel, all the staff were friendly and made me feel welcome. Breakfast was sufficient but could be improved by having more options. The real bonus was I saved £59 vs Marriot across the road which was not even as nice.", "Date": "April 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Oxford", "Title": "“Quality Maitrise- We loved it!!!!!!!”", "Author": "Raufy", "ReviewID": "UR59365406", "Content": "Read reviews before booking and decided to take the plunge and book. I can't praise the Hotel enough, it did exactly what it say's on the website. Although our room was small, it had all the facilities of a five star and was spotlessly clean, the real bonus was the shower, amazing!!!!!!!!!!!! The WIFI was fast and free. The reception and hotel staff were both warm and welcoming. Breakfast was okay but could be improved. My girlfriend loved the food in the restaurant which was excellant.I have stayed in some real dives in the past in nearby Paddington costing much more, at £99 this was great value and only three stops on the Bakerloo line from Kilburn Park to Paddington ( 4 mins). Would return, no question. Best kept London Hotel secret!", "Date": "March 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "France", "Title": "“Disgraceful & a sheer waste of money !!!!!”", "Author": "mikepro32", "ReviewID": "UR58930967", "Content": "'QUALITY MAITRISE' - the name itself does not do justice with the service I experienced at this disappointing hotel. From check-in to check-out it was a total disaster, unwelcoming receptionist to lack of information provided at check-in made us feel that we have checked in at a student hostel where one is expected to find their own way out for everything. Having travelled for hours in the euro train one would expect a decent and comfortable place to rest but NO this hotel ruined our whole trip. The breakfast was too stingy and service was extremely slow and bad. We had to go across the road to have some decent breakfast instead. The receptionist at the check-out did not seem to know what he was doing and took him 15 mins to process the check-out, and thanks to him we missed our train. I strongly recommend not to book this hotel !", "Date": "March 18, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Recently refurbished comfortable hotel”", "Author": "pseudonomad", "ReviewID": "UR57668002", "Content": "Stayed 1 night, Located in Kilburn, good travel options, opposite a starbucks and near a supermarket. Very dodgy surrounding areas, but has regular police patrols,hotel recently refurbished, everything was fantastic, very clean, standard sized rooms, coffee and tea making faciilities. Everything is above standard except the guy at reception walks in to our room by mistake, 10 minutes after giving us our room key, he was genuinely apologetic but it made us feel uneasy", "Date": "March 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "wirral", "Title": "“excellent value and very stylish”", "Author": "familyWirral", "ReviewID": "UR56890515", "Content": "We had not planned to stay here but our booked accommodation was awful and we were desperate. The hotel found us good rooms and we were able to check in by 11.00 which saved our weekend.Staff were great and we loved the furnishings and continental breakfast- highly recommended", "Date": "February 23, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "1.0", "Value": "1", "Service": "1", "Location": "5"}, "AuthorLocation": "Romsey, United Kingdom", "Title": "“MASSIVE Disappointment - Avoid Like the Plague”", "Author": "phastings", "ReviewID": "UR56381593", "Content": "My girlfriend had booked us, along with my mother and her sister and brother-in-law into this hotel as a surprise for my 30th birthday. The location was chosen specifically for its position on the North London Line to make a quick journey to Islington where a lifetime's worth of friends were waiting to surprise me. On arrival, despite the fact that my girlfriend called that morning to confirm the booking, we were told that there were no rooms left and we had been transferred to a hotel in Harrow. I arrived an hour late for my own birthday party. The staff were totally unapologetic apart from offering a complimentary drink which we had to gulp down to get to the other hotel. To top it off they refrigerate their real ale.", "Date": "February 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "UK", "Title": "“An excellent gem and great value for London”", "Author": "Wellington4", "ReviewID": "UR55971949", "Content": "I have stayed at this gem of a hotel getting on for 10 times over the last 4 months. It's just great and suits my needs perfectly. I have read all the other reviews and can only assume that I must be staying at a different hotel. The hotel is 3 stops north of Paddington on the Bakerloo line and the only a few minutes walk from Kilburn Park underground station. This is ideal for getting into the centre of London and also for the train out to Heathrow. The hotel is welcoming and the reception staff are generally pretty efficient, although then do seem haphazard at times. The rooms are well appointed and I find them to be very comfortable. yes - they are small, but that is London for you. And in my experience you will not get better for the price. Prices in the centre of London are much higher and the quality much lower. Just try some of the places around Paddington and you will understand what I mean. I have found that the cheapest prices can be found by either phoning the hotel or by going to their own web-site. I am staying again this week and have a rate of £75 (£88 after tax) for a VIP room. For a comfortable and modern hotel, this cannot be beaten. It's my guess that the negative reviews are from people who want to keep this place for their own usage and don't want it to become too popular !!", "Date": "February 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Broolyn NY", "Title": "“its just OK...but, wont return”", "Author": "Lyricalpen", "ReviewID": "UR55568396", "Content": "The hotel was just barely alright. I am not picky, clean sheets and clean shower I’m usually happy! When I arrived to the property, I asked to check my bags, the man who checked me in said for me to put my bag by the mirror in the lobby. I did as he asked with the expectation that someone would take it to the bag check. Tip in hand, I waited and waited, no one came to help… I asked the gentleman what the deal was, he seem bothered by my inquiry, and said again to leave my bag there, I told him I am not comfortable about leaving my laptop “by the mirror” he took it and put it behind the desk. I was upset, but figured it was a new hotel, and they just did not have the space for a bag check… I was so tired…Oh well..moving on…. •The bed was terrible.. the site boast about orthopedic mattresses after my stay there, I need to see a orthopedist! •The shower was awesome. •My bathroom sink was dirty, but I carry disinfectant wipes with me, and sorted it myself! GLOB of dried toothpaste on the outside of the bowl, and nastiness on the inside. •The shower was awesome. •The room was tiny, but good for one or two.. •No internet access for 1.5 days. ( I was there for business, so that was hard to deal with Thank god for Starbucks! ) •No hot breakfast the oven and stove were broken for the first morning. •The shower was awesome. •Restaurant seemed like it was a chore for them to cook for you, I only ate there mid day, and each time I tried, It was painful. •Reception needs to hop on the bus, and go up and down the high road to know what is in the neighborhood. That should be implemented as week one job training. I know that street better than the front desk employees. And I am from New York!!! I asked where I could get some items printed for our presentation- they sent me to a internet café, about 3-4 blocks up the high street.. just in case you need one, there is a excellent print shop less then a block from them (go out the door and to your right)! •Only one person I dealt with at the hotel had a clue. That was the lady who checked me out of the hotel. They guy who checked me in was RUDE! And the girl at night, although pretty, was just pretty..she did not know anything when I asked, how you get here, or there. On the check out day….My flight did not leave until much later in the evening I asked them to hold my bags, you would not believe that the girl who checked me out of the hotel, asked me to follow her. She UNLOCKED a door, and told me to put my bags in the storage closet. So there is storage. HOLY STORAGE! I will never stay there again, if I can help it! Mainly because the beds were bad for my back. Lazy employees you get everywhere, people sometimes miss things when they clean, human error.. internet goes down every now and again, and stoves don’t work at times. Stuff happens… but between the beds, and the lack of good customer service, Id rather not return. They need to reinforce the value of customer service. Listen if I had a bad bed, but everything else was near perfect, I would totally recommend the place. They do a good burger and chips and the place is decorated nicely. Unfortunately there was not one point that made this stay worth it.. with the exception of the awesome shower", "Date": "February 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Location": "2", "Rooms": "4"}, "AuthorLocation": "dublin, ireland", "Title": "“great hoel lovely room shame about kilburn...”", "Author": "pvallely", "ReviewID": "UR54000157", "Content": "we arrived into the hotel and booked an executive room for one nite. This was 170 pounds for one nite, new years eve after all room well stocked and loked the part of an excutive room fridge fully stocked but very expensive. great staff and overall a good expierence was disapointed taht breakfast was not included for the price we paid thought it should have covered it overall though great expierence.... another downside was teh area kilburn was quite rough and did see some young fella been thrown threw a window new years eve but should not eb a reflection on hotel", "Date": "January 21, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Birmingham, UK", "Title": "“Beware of them overbooking and transferring you to Wembley! Phone them to confirm you booking!”", "Author": "binkybecky", "ReviewID": "UR51050787", "Content": "This hotel totally ruined my trip to London. I arrived late (9pm)to check in after meeting friends all day in London. I was told I did not have a room and they had no contact details to contact me from as their reservation sytem is USELESS! They had overbooked 6 rooms that night, and I heard this was not the first time. They told us they had a room at their sister hotel in Wembley 2 tube stations away (it was 6 and meant extra exspense, it was in zone 4!). The hotel was horrible and toilet seat was not cleaned, staff were terrible! It was a 30 minute taxi ride from Maitrise. They arranged a taxi to Wembley and back again so I could make my way into Central London. I was told I could have a taxi back to Wembley at the end of my night. WRONG! They left me in the pouring rain to make my way back to Wembley. I had to liaise with the taxi company myself, who went out of their way to collect me (after standing in rain for 50 mins). The taxi company could clearly see the poor attitude of the management at this hotel as they actually lied to me about the return tax, the driver felt sorry for me! Mr Ali Imran (so called Manager) be ashamed of yourself! We met an Austrian couple who was in the same predicament, not a good impression to make on foreign visitors to England!! If you are booking to stay at this hotel don't! If you must, check that your reservation is confirmed and pray that you get what you want because Mr Imran and Mr Lopez will not go out of their way for you or provide good, decent customer service! I will be taking my complaint further as I am apalled, sickened and disgusted and have never received such poor service!", "Date": "December 11, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "1", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Double check the rate you are quoted versus the rate you are charged”", "Author": "michmoch7", "ReviewID": "UR50957632", "Content": "Booked my parents into this hotel for 1 night - booked it online through laterooms.com which quoted rate of £138 but when checked in they were charged £146! Breakfasts are a rip off £8! Specifically asked for a room which did not overlook Kilburn Road but when we checked in were allocated a room over the main road. Will go elsewhere to quieter hotel in Maida Vale which offers better service at comparable rate per night and considers requests of guest prior to arrival.", "Date": "December 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "lala land", "Title": "“Small but cozy”", "Author": "CambridgeJimbo", "ReviewID": "UR49918027", "Content": "I'd recommend this hotel if you want something conveniently priced and located. I went there based on the reviews of this site, so I felt confident that I was getting a good deal. I was right. The rooms are cozy and modern. It being London for about 100 quid a night (or less), this fits the bill well. The rooms don't leave much for walking around in. And, I wouldn't want to use the toilet if I were over 6'3\" or 225 pounds. But, for us average-sized people, it's a cozy place to hang out and hang your head. It's probably most appropriate as a nice base for going out on the town and needing a comfy bed and modern amenities. Although, my girlfriend did not like their shampoo and the bathroom soap can dry your face. Not to worry though b/c there's a Tesco's across the street. Their restaurant, Rafkins, have good service, although it took 15 minutes to get my breakfast sandwich out of the kitchen.You may need to order some food b/c the continental breakfast is on the light side. And their coffee is paper thin, but hey Starbux is across the street, too. It's a good corner of London to spread some money around for comforts as you do it up in town!", "Date": "November 23, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Portsmouth", "Title": "“a very cozy boutique hotel”", "Author": "iambear", "ReviewID": "UR49880683", "Content": "I stayed here for a weekend at the end of November despite some of the reviews I read on here, not that they were all bad but I got the impression the bad press may have been mainly start up problems and I can say that I had a very pleasant stay. The room was exactly like the pictures on there website, very chic, clean and comfortable with all mod cons, it was abit on the small side (the bed was definiely a standard size - with a lovely feather quilt), theres no denying that, but it did the job, this may have been a problem if you were there for a week but for a weekend break where we planned on spending pretty much every waking hour out in London the room was absolutely fine. It didnt have a window either but I'd say this was actually a plus, as unless you're somewhere really really nice in London the view out of a hotel window isn't going to be anything special and it meant that there was no outside noise and we slept comfortably in a very dark room, they have air con in these rooms to replace the lack of fresh air and it worked fine. Its essentially opposite a train station too which is 5 mins from Euston so its easy to get everywhere. All in all a great stay and will be visiting again. Amber", "Date": "November 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Chicago", "Title": "“Customer service”", "Author": "greatandswell", "ReviewID": "UR49490816", "Content": "I stayed in the hotel Maitrise in London for four nights. I arrived from the US at about 10:30 in the morning. I asked whether I could have access to my room. I was told that it was the hotel policy that access not be allowed until 2 PM, unless I was willing to pay 40 pounds more. I of course refused, left, and did not return until the evening. At that time, the people on the desk had changed. I asked about this so called 'policy', and was told there was no such policy. I requested that they inform the morning desk clerk. In general, the staff was unhelpful and, in the case of one person, completely either misinformed or untruthful. On the plus side, the rooms were clean.", "Date": "November 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Well situated, good rates and profesional staff”", "Author": "VRRLondon", "ReviewID": "UR48529077", "Content": "The hotel is situated in area 2 close to the center.Just in from of the hotel there is a bus stop, where i use to take the number 98 to go to Oxford Circus, from there i could arrive to anywhere.It´s just took me 20min to arrive by bus but of course always depending on the traffic.Also there is a metro station just 5 min walking from the hotel...So it was good conected. Great food at the restaurant,i liked the open kitchen, clean a tidy.Good and profesional service. I could find the room pretty sweet,confortable and modern with all the necessary facilities to feel at home, good bed by the way! Great customer service. Definitly i will come back! :)", "Date": "November 4, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Luton, Beds", "Title": "“Charming hotel, handy links.”", "Author": "fishfilleter", "ReviewID": "UR48142255", "Content": "Booked here with some trepidation after looking at reviews. We were going to a concert at Wembley. This is easily accessed from Kilburn Park Underground and Kilburn High road overground. Tesco metro (7am-11pm) across the road, plenty of other shops and restaurant/take-aways around. Check-in may seem a little impersonal, but is just a cultural thing. Hotel is generally clean and tidy. Our room, although compact, was very comfortable with good quality fittings and fixtures. Double glazed windows did the job of blotting out noise from the high street. Air con kept the room warm in October, when we went. Didn't hear any noise from the bar, it was Saturday and there was a DJ. Inclusive breakfast was plentiful and fresh, some guests had the cooked breakfast which looked like a childs portion and nouvelle cuisine. Overall a good one night stay for us and would recommend.", "Date": "October 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Northants", "Title": "“Beautiful Boutique Hotel”", "Author": "scolex", "ReviewID": "UR45972794", "Content": "We stayed here for 1 night as we were going to a restaurant in Mayfair. The hotel reception is lovely and the staff were very friendly. The room is not the largest I've ever stayed in but it was perfect for our stay. Decor was nice and so was the bathroom. The bar downstairs was very lively but we couldn't hear any of the noise in our room. The tube is a short 3 min walk away. I would definately stay at this hotel again and would recommend it to friends.", "Date": "October 6, 2009"}], "HotelInfo": {"Name": "The Quality Maitrise Hotel", "HotelURL": "/ShowUserReviews-g186338-d1526183-Reviews-The_Quality_Maitrise_Hotel-London_England.html", "Price": "$155 - $1,266*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">53 - 59 Kilburn High Road</span> | <span class=\"extended-address\">Maida Vale</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">NW6 5SB</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "1526183", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/3f/b3/3fb3b532a69b84736c221e98276f627e6large.jpg"}}