{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Novotel Barcelona”", "Author": "Peter726 Posted by an Accorhotels.com traveler", "ReviewID": "UR128328079", "Content": "Everything was just great. Special highlight: the buffet breakfast, which, provided you book it as part of a deal, is fantastic value for money.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Ra'anana, Israel", "Title": "“New facility very good location”", "Author": "amby1891", "ReviewID": "UR127901011", "Content": "We spent 4 days at the Novotel Barcelona on April 2012. We were a family of 4, two adults and two teenagers. The stay was very good. We took the Novotel family package that allows getting 2 rooms at a reduced price. The hotel location is excellent. Not in the crowded middle of town, but yet very close to a metro station (line 1) with very easy access to all city attractions. The rooms looked new and clean. We stayed at the 7th floor, and besides the fact that in the mornings the elevators tend to be very crowded and the wait to go down tends to get long, we were happy with our rooms. The breakfast buffet was excellent! It includes real coffee machines, an omelet cook that will cook your omelet of choice, and the jewel of the crown fresh breads and pastries just out of the over, The baguettes and croissants are as good as the ones in France and other prime Europe locations. To top it off, kids under 16 eat free so that the cost is very reasonable also. The pool at the roof the hotel seems very nice. It was too cold to experience but I am sure that in summer the pool is a significant attraction. Opposite of the hotel is a big shopping center with a huge supermarket. We used it a lot for some of our lunch and dinners. Overall a very good experience. If we get to Barcelona again, I'll be sure to go to this hotel again.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Nice hotel”", "Author": "SteveBM", "ReviewID": "UR127403060", "Content": "Stayed here for 2 nights with my wife. Our room was clean and light but not particularly big. This was fine as we were only using this as a base for exploring We arrived using the RENF and Metro service from the airport, to Cort and then onto Glories. The hotel is a short walk from the Metro. Opposite the hotel is a Tram stop on line T4 which was also handy for getting about. Opposite the hotel is a shopping centre with a large Carrefour, Starbucks and various other shops and restaurants. We used the Carrefour to buy breakfast supplies and breakfast was expensive, and very busy (we travelled during the Easter holidays) On the first night we used the hotel restaurant and sampled the 22 Euro buffet which was actually pretty good. The hotel staff were helpful and polite and the general ambiance is that of a busy city centre hotel. There is a small gym and pool on the roof which is pretty good but sadly despite our best intentions we didn't have time to use. Too much sightseeing and sleeping to do! I'd stay again for a functional hotel within easy reach of all the sights, but not right inside the tourist district.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“Smart hotel, great location, free internet - perfect!”", "Author": "Nandu T", "ReviewID": "UR127312737", "Content": "Novotel Barcelona is one of the very best hotels I've stayed at. It is a modern hotel, and the internal decor was to a very high standard - more boutique, than business. The porcelain shone, and I sampled both the bath - deep and luxurious - and shower - strong, if not exactly a power shower, but a a little unpredictable on temperature - ranging from lovely and hot to tepid, from minute to minute. The free internet (accessed by a code supplied by reception) was super-speedy - a joy, compared with my fairly fast home broadband. Breakfast was hearty enough for all tastes, ranging from continental to full American/British. I also had dinner one night - the restaurant was swish, the service impeccable, and obliging, and the food good, if not outstanding. For business or pleasure, the Novotel Barcelona City won't disappoint!", "Date": "April 5, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“good hotel but skip the bar”", "Author": "MyGosha", "ReviewID": "UR127158319", "Content": "New hotel, good Novotel standarts inside, stuff helpful, breakfast very good, everything fresh and good selection. You can walk to Sagrada Familia and I had a room with Sagrada views - spectacular. Torre Agbar is next to the hotel and looks dramatically at night with cobalt blue and red lights. Close to transport and across the street from rather good shopping centre with biiig Zara :-) Skip the bar, it closes early and girl is disappearing every time she makes 1 drink. She refused to make me a coctail 15 minutes before they close the bar (because they close in 15 minutes it was the response and mine was that she still has 15 minutes to make my coctail then, she was very unhappy but she made it). Big minus because of the bar but overall good hotel with free intenet access.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Cluj-Napoca, Romania", "Title": "“City brake in Barcelona”", "Author": "DoruP", "ReviewID": "UR126921071", "Content": "We stayed for 2 nights over the weekend in March 2012. First impression: we took a taxi from aeroport to hotel and cost us 30 euros! But at the hotel, the staff on front desk changed our bad impression - very helpful and friendly. We were staying in a suite and its looks very modern, new and comfortable (also very clean). There's free wi-fi in the rooms, access code you will get from the front desk. Our suite was located on the corner with a beautiful view towards the Torre Agbar. Breakfast was very consistent, with Spanish specialties, Hamon, eggs, ham, corizo , cheese, several kinds of jam, fruit and coffee. The hotel it's not far from the Sagrada Familia, aprox 15-20 minute walk. The bus from Barcelona City Tour (hop on, hop off tour bus) does stop right outside. We used this tour bus and was very affordable. Ticket price for one day is 24 euros / adult. We have had a great time here, and we will certainly return. And we recomand this hotel to everyone!", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dublin", "Title": "“Overall 7 out of 10 - highs and lows”", "Author": "GromitDublin", "ReviewID": "UR126726697", "Content": "Stayed here in March 2012. Plus points: The hotel is just a few minutes walk from Clot station which is where the train from the airport drops you, so it's handy for getting in and out of the city. It's not far from the sagrada familia, maybe a 15 minute walk and is near the glories metro station and some tram lines There's a very large supermarket and shopping centre just down the road and some cafes The staff seemed nice and were helpful The room we got (on the 18th floor) had great views of the city The bed was comfortable and the bathroom was clean and had a good shower Wifi is free Minus points Some of the worst pillows I have ever slept on The roof terrace pool was closed even though it was warm and sunny enough that I got sunburnt. The jacuzzi was empty (i.e. no water in it). The roof terrace bar was closed, and all the lights were turned off, even though guests were buying drinks at the bar downstairs and going up in the lift to the roof and sitting up there. Breakfast was €18 per person for the buffet. I had gotten a room rate only, as most of the time, I don't want a big breakfast so don't want to pay for it. However, there might be one occasion during my trip that I would like the hotel breakfast. Not at €18 though, particularly for a buffet (i.e. making my breakfast myself). No actual glasses or cups provided, just paper cups for tea and plastic cups wrapped in plastic wrapping for water, which is a waste of plastic. So, 7 out of 10 which I am rounding to 4 out of 5! Not the most central hotel, but it seems a bit cheaper than those that are more central. On balance I think Novotel is a good choice on that basis.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Nice modern hotel”", "Author": "missmaya24", "ReviewID": "UR126714673", "Content": "Stayed here 2 nights. The front desk staff was very friendly and helpful. The continental breakfast had a good variety from traditional Spanish dishes to pancakes to pastries. Skip the bar. The bartender poured us a drink then took off. The rooms are very modern and comfortable. There's free wi-fi in the rooms too. An important thing to note is major construction is in progress across the street and doesn't look like it'll be done anytime soon.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Honolulu, Hawaii", "Title": "“Believe the Reviews. . .Recommended Place to Stay”", "Author": "FitDude", "ReviewID": "UR126616928", "Content": "Except for its distance from Las Ramblas (10-15 minutes via Metro), it is difficult to say anything negative about my 3 day stay this hotel, and even its location is not a major problem. As is typical with this mid-level chain (its lower end sister hotel Ibis is just down the street), my “queen bed with sofa” room on the 11th floor was clean and modern, and somewhat larger than the average European hotel room, particularly the bathroom, although the open shower design did manage to still leave water on the floor, albeit not as much as my flood experience at the Novotel Zurich Airport. The bed was comfortable and the room was quiet and cleaned promptly each day regardless of when I left. The TV had plenty of channels, and TV sound in the bathroom was nice, as was the power window shade operated from bedside controls. Free in room Wi-Fi was appreciated, but too slow to watch video or make a Skype call, although fine for e-mail and web surfing. Wi-Fi in the lobby had faster speeds. The roof-top gym was modern but only marginally equipped with well maintained machines, and includes a dry sauna and sun deck overlooking the city. The hotel is located directly across from a large shopping mall which includes a supermarket. The Glories Metro station is just over a block away, where you can get to virtually anywhere in central Barcelona in 20 minutes or less. The staff was efficient and responsive. I would strongly recommend this hotel which was reasonably priced at 75 euros/night, although not the breakfast at 18 euros/person.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Modern, clean hotel in good location”", "Author": "GioVale20", "ReviewID": "UR126557087", "Content": "We stayed at the Novotel Barcelona City for one night in March. The hotel is located just a few minutes from the Metro Stop \"Glories\" from where you can reach the Rambla or Placa de Catalunya in just a few minutes. The hotel is very modern and delivers what you expect from a Novotel (i.e. modern, clean and functional infrastructure). Even though we checked-in at 10am already, we were given a room. The reception staff was very friendly and helpful throughout our stay. Our room was of medium size and very clean. The bathroom was one of the best I saw in my travels. The following morning we ate breakfast, which was really good with a nice mixture of pastries, cheese, meats, yogurt, etc. All in all a very pleasant experience and we would go back anytime. The price-quality ratio was excellent (we paid EUR 111 for the night including breakfast for two).", "Date": "March 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great location, good hotel”", "Author": "PiperToronto", "ReviewID": "UR126415290", "Content": "I just got back from a trip to Spain and stayed at this hotel for 4 nights. I love the location - it's close enough to the main sights (4 metro stops on the L1 line to Catalunya - no transfers) and from there you can walk down La Ramblas or walk north along Passeig de Gracia to visit Casa Battlo and/or Casa Mila. I also walked to Sagrada Familia from the hotel one morning - it took approx. 20 mins. There is a shopping mall right across the street but there's not a lot of shops there...I went there to pick up necessities and some snacks/drinks at the large supermarket and there was also a Japanese buffet restuarant that was a bargain - 8.95 Euros for lunch during the weekdays and approx. 13 Euros for dinner. As for the hotel, I found it very clean and modern. My room was on the 18th floor. It must be soundproof as I barely heard a pin drop outside the door. The bathroom was very spacious. Only complaint was the lack of a shower door so it everytime you took a shower, the floor was wet but that was easily fixed by asking for an extra bath towel to mop up the excess water. Lots of counter room to put all your various toiletries. The pull-out couch was very uncomfortable though...I woke up every hour my first night as my back and neck was aching so much but I think I got used to it because I didn't have any aches and pains after that. The usual amenities were provided such as a safe, flat screen tv, kettle with tea and coffee, etc. One thing I should mention is that lack of wi-fi connection...it is free but the connection was bad and the signal kept on dropping..sometimes you can get in, sometimes not...it was very frustrating...it could be due to the fact that I was on the 18th floor which is the second highest floor. Overall, I was very pleased with this hotel. If I am ever back in Barcelona, I will definately stay here again!", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Nice Hotel”", "Author": "Bluehill", "ReviewID": "UR126318096", "Content": "Visited on a business trip. Nice place to stay. Modern, well equipped, just what you need.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Novi Sad, Serbia", "Title": "“Excellent location”", "Author": "Sam A", "ReviewID": "UR126081326", "Content": "Easy to reach hotel and well located. Staying for 3 nights.Nice walking area. Internet connection should be much faster by today standards. Hope to visit soon.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "bournenmouth", "Title": "“Well located helpful staff great choice”", "Author": "southcoasttraveller", "ReviewID": "UR125944291", "Content": "stayed for 3 nights in March. Found hotel by chance on internet - what a great choice. Well located - 3 mins walk to Metro. Staff could not do enough to help and gave some great advice. Room overlooking all of Barcelona - suggest you ask for this side? Would recommend.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Aberystwyth, United Kingdom", "Title": "“novotel hotel barcelona spain”", "Author": "patap186428", "ReviewID": "UR125888066", "Content": "We spent two nights here at the end of February. We Found the staff in reception and dining room to be very helpful. The hotel is close to metro station and we found it very easy to travel around using the metro and also very cheap.", "Date": "March 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Swansea, United Kingdom", "Title": "“One night stay”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR125124052", "Content": "Good business hotel with excellent wifi and working areas. Out of the way for tourists though with very little to see and do in the surrounding area. Waiter in restaurant seemed uninterested after I had elected to sit alone at a 4 person table under a light (for reading) rather than the dingy corner he wanted to put me in. Otherwise, excellent", "Date": "February 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cardiff, Wales", "Title": "“Good location, friendly staff, comfortable & clean rooms, can't fault it!”", "Author": "HOLIDAYoholic", "ReviewID": "UR124863145", "Content": "I stayed at this hotel on the 10th-13th February and couldn't fault it. We found it to be in a good location near the Glories Metro stop which allowed us to travel easily anywhere in the city, and taxis also stop directly outside the hotel. The Hotel was very clean and tidy, both in the reception and bar area, as well as in our room. The bed was comfortable and cleaned daily by the chamber maids. The bathroom was spotless and our room had a flat screen tv and plenty of power sockets. Me and my partner also went up to the roof (just to sneak a look) and although too cold in February to use the pool, I can say that both the pool and gym looked very nice on first appearance (we did not actually use either of these though). We did eat in the restaurant only once for an evening meal, this was only ok. It was nothing out of the ordinary and service was a little slow, however the food was satisfactory and the staff were polite. I would still however say there are better places to eat in Barcelona outside the hotel. I did spend a lot of time at the hotel bar, and although a little pricy for drinks, it was comfortable and not stuffy at all. I also noticed (although did not use) that they had PC's near the bar available for use (should you not have your laptop with you). Wifi at the hotel was also free, I did use this on my mobile and had no problems. For a hotel in the center of the city and considering the price that we paid for our room, I would definately stay here again, as I think it was great value for money.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "", "Title": "“Pretty decent”", "Author": "alkof", "ReviewID": "UR124813326", "Content": "Clean, tidy with friendly staff. Convenient, contemporary design rooms with a lot of natural light. Metro nearby.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Zagreb, Croatia", "Title": "“Good, especially for business travels”", "Author": "grickavjestica", "ReviewID": "UR124794340", "Content": "Nice hotel, rooms spacious enough, bathroom very clean. What I do not like is open wardrobe but that is a standard in these hotels. Great view to the whole city from the terrace on the 19th floor. Breakfast OK, but not more than that. Free internet access in the rooms, which was important to me. Location fine, just 15-20 min walk to Sagrada Familia. And other parts of the city easily accessible by metro or tram. Staff very nice and helpful. Good service at check-in and -out. The conference area well organized. I would definitely recommend this hotel for conferences and seminars.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Excellent hotel and great staff!”", "Author": "Joanna O", "ReviewID": "UR124677101", "Content": "This was my first visit to Barcelona and I loved it:) The hotel is excellent, not located in the centre, however everything is easy to access by metro, trams or hop off hop on bus. Very close to local shopping centre. The rooms are the usual Novotel layout, very clean (I am bit obsessed when it comes to cleaniness of bathrooms) and spacious. Loved the music being played in the corridors (you don't get that in UK and it's just such a nice touch). The staff in the hotel was excellent, it was our first visit to Barcelona and we had probably millions of questions and they were always very kind, professional and patient. The gave us very good advices about getting around, finding places to eat and what's the best to see. They just couldn't be more helpful, and they made our stay very enjoyable.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Tokyo, Japan", "Title": "“Somewhere between poor and average”", "Author": "Marcotripo", "ReviewID": "UR124451698", "Content": "Actually stayed here in 2010, but TripAdvisor doesn't let me enter a date further back so I'm just click the oldest date available in the pull down menu (March 2011). So, please understand this review may be dated. This is a Novotel Hotel which means the pictures always look better than the actual hotel. The actual hotel has plenty of street parking, but it's tough finding a spot during the day. But, if you arrive late afternoon and plan to use public transportation, you're in luck. Okay the rooms--which is always most important for me since that's really what I'm paying for--they are adequate. But, there are lots of smokers at Novotel and their HVAC system pumps the air from smokers rooms into non-smoker rooms. Yuk. (My wife just looked over my shoulder and said, \"I remember that place, it has the smoke room,\" so beware). The bathroom is clean and the room, while dated, was okay (aside from the smoke). The service at the front desk was absolutely terrible. Novotel isn't always good (Madrid Novotel is great), but this one was exceptionally bad. I really would not recommend this place to anyone except a smoker who wants a cheap room and uses a taxi.", "Date": "February 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Excellent. In the @22 business district. Not centric, but very close.”", "Author": "mdacal", "ReviewID": "UR124337443", "Content": "Excellent hotel, in the @22 business district. Not centric, but very close to it. This is a new bisiness district in Barcelona, so dont expect classic european buildings and typical bars. Its all about modernity. Big modern hotels, malls, cloth stores, etc. Although is very close to the center. Next to \"La Barceloneta\" beach district. Great pool in the last floor. Great views.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Suffolk", "Title": "“Great hotel, great price”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR124306284", "Content": "Really nice hotel, friendly staff. A little way out of town but easy access to metro, etc. A good 25 minute walk to Catalunya Square and Las Ramblas but a nice walk. Sightseeing bus stops outside hotel. Price really good as I got a deal. As a parent, even though we weren't with our kids, it was great as they had interconnecting rooms and a kids area with X-box's, etc. Our son would've loved it. Only downside was cost of breakfast - 18 EUROS is extortionate for a buffet breakfast!", "Date": "February 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Rio de Janeiro, RJ", "Title": "“Affordable standard of quality with good city access”", "Author": "Somewhere_Special", "ReviewID": "UR123094382", "Content": "Having lived in Barcelona for over 6 years it was strange that we were staying in a hotel in Barcelona... that said we knew the location well, and it's ideal to get into the city centre (metro, bus and Tramvia stops within minutes), or a 25 minute walk. Equally both shopping centres in Avenida Diagonal can be reached by walking or a few stops byTramvia. The upper floor room (where we stayed) had good city and sea views. The room itself was standard Novotel design (which is modern clean and tasteful furnishing) so we were more than satisfied. Equally the bathroom was modern and had everything we needed. Staff were very helpful and speak both Spanish and English. Would stay here again for sure.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Very good hotel, close to the metro”", "Author": "KTA2207", "ReviewID": "UR122822279", "Content": "We were 3 young couples, spending our New Year in Barcelona and we decided to stay at Novotel. Very nice stay, the personnel was friendly, although not very well informed- we asked what time was the Magic Fountain in Placa Espanya \"performing\" and we were told 9pm. we asked again, at a souvenir shop in the city center and it was actually from 7.00-8.30pm.. At arrival, the check-in was done very fast and we were given 3 rooms at the 16th floor, with wonderful view of the Agbar tower and La Sagrada Familia, and even Montjuic and the port in the distance. the room was very clean, great big comfy bed. Breakfast- the food was excellent, a large variety of everything, but they had, in my opinion, a very bad system- an employee would check you on the list, and then would walk you to your table!it took a few minutes to every person, and so..every morning we had to stay in a queue for about 10 minutes before entering the breakfast room. Not nice at all! Also, during our stay, they had a problem with the running water- we didn't have any! this happened 3 times, even on the 31st of December, at 9pm- when everybody was getting ready to party. but they eventually fixed it. The metro station-Glories was about 5 minutes walk, direct line to Catalunya, the center of Barcelona, and the place from which La Rambla begins. Also, just across from the hotel you can find Glories shopping mall, not so big, quite small actually, but very handy. Overall, a nice experience!", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lausanne, Switzerland", "Title": "“Full mark !”", "Author": "hwakil", "ReviewID": "UR122502514", "Content": "I am a loyal Accor guest, and this was my second stay at this hotel. the hotel is new (opened 2010), so all facilities are quite modern. The staff are efficient and friendly, one day I forget and put the room cleaning side the other way round so it was showing \"do not disturb\" in stead of \"Please Clean my Room\" and when we returned in the evening we discovered that our room was of course not touched, we called the reception asking for help at least to change the towels, and even this was after hours of cleaning service, a smiling lady came to check the status of the room, we told her the we just need the towels change at least, then we went down for dinner, when we came back back we found the room spotlessly cleaned and tidy, that is a customer service. can't explain more than other reviews about the great location of this hotel but now, thsi is our favourite hotel in Barcelona which we visit every year.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“My experience”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR122499427", "Content": "During my stay, the hotel was very full, (maybe because it was between Xrmas and new year) crowded elevators, so I had to go down by stairs several times. especially in the morning. Very few elevators to the number of rooms... The internet signal in the room was very weak that I could not open some sites and as it was full, I had to wait to use the hotel´s computer.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Perfect Place to stay in Barcelona!!!”", "Author": "chuiku2", "ReviewID": "UR122401430", "Content": "Novotel Barcelona City is the perfect place to stay in Barcelona. It is about 200m from the Glories Metro Stop and a few steps from one of the most beautiful buildings ‘Torre Agbar’. The hotel is also walking distance from another of Barcelona’s most famous landmarks ‘La Sagrada Familia’. The rooms in the hotel are excellent. Every requirement is catered to. The views from the rooms in higher floors are excellent. You can see much of the city from the top. There is an outdoor pool on the terrace; but only usable during summer months. There is also a fitness center on the roof. From the hotel you can get about anywhere to the city to see the important landmarks. There is also a direct tram to the beach right in front of the hotel. The area around the hotel is much safer than most of the other parts of the city and it is OK to come back late at night too. The hotel has a nice bar and also a restaurant. The restaurant food is quite tasty and generous in portions. The only thing I did not like was that you had to wait to be seated even though there were hardly a couple of people in the restaurant. Even then, since I was a solo traveler, I was shown to a small two-person table which was relatively small to keep all my stuff and also have the food. I would have preferred sitting at a larger table, given the fact that there were very few people in the restaurant. One other thing was that the waiters at the restaurant were in a constant hurry and as soon I finished one course they were clearing the plates and then bringing the next course. As soon as I finished my food too, they brought me the bill and I guess expected me to clear out. The reception staffs were much more efficient and helped in choosing the best places to visit via convenient means of transport. There is free wifi at the hotel but it is not very good. It breaks every time you move from a spot and is not even consistent throughout your room. You have to choose a place to sit and use it and can’t use it in motion. Although there is excellent coverage throughout the lobby. It even breaks inside the restaurant. And you need to reenter your username and password again each time which is a pain. One advice also mentioned in your room is Barcelona is not a very safe city. It is prudent to use the safe in the room or at the front desk to store your important documents like Passport and also money, etc while out sightseeing. People try to rob you by distracting you by staining your jacket or shirt and while you are cleaning it off, your valuables vanish. It was tried on me, luckily I escaped.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "ottawa", "Title": "“Good Location Good Facilities”", "Author": "canadawolfinottawa", "ReviewID": "UR122233991", "Content": "I stay at a number of Accor Branded Hotels when I travel so I generally know what to expect before I get there ...yes, they can be expensive but you get what you pay for in the larger European cities .Breakfast is very expensive here but go across the street to the Mall and use the outside down stairs to the outside courtyard as there are lots of places to eat at here.The Mall also has a HUGE grocery store/Carrefour so you can buy ready to eat meals or make your own meals if you are on a budget . There are lots of Fast Food places in and outside the Mall . The Hop On Hop Off bus stop is on the same side of the street as the Mall . It is an excellent way to see the whole city,,buy the 2 day ticket as you will want to get off at a number of Gaudi places and explore them especially the Park . You could walk to Sagrada Familia from the hotel if you really wanted exercise . I did it twice and I am a senior . Agbar, the cone shaped corporate tower is right beside the hotel so you cannot get lost day or night . The staff at the desk are OK.. some are totally excellent some but some are lazy and you really have to butt into their private phone conversations to get their attention . As it is a popular hotel you will have to be patient when checking in or out at prime times even though they have 3 or 4 on staff .The security guard is ALWAYS standing guard over the desk ..why, I have no idea ?? It makes you feel like a criminal ! Lets make him less obvious ! There are 3? free MAC computers to use in the lobby towards the left of the bar .The bar lady is totally excellent as she will give you all kinds of Barcelona travel tips .She is always smiling ..she should be at the front desk .The guard gets bored guarding the desk and he will come over and check to see what everyone is using the computers for ...nosey begger !! I found this annoying ! The room is excellent ..no complaints .Great shower !! Ask for a higher up floor for the views facing Sagrada . A good quiet hotel away from the city center . a little .expensive but it is well worth it. Tip ...if you use the metro be very ,very aware of the Barcelona pickpocketers .Watch out for the \"drop your guard scam\" involving a local couple asking for directions or spilling something on you , etc . .NEVER have anything in your back pockets even if they are velcroed or even zippered ..they are professionals ! Barcelona is a wonderful city ..just be on your guard !!", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Great location and excellent value”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR122084075", "Content": "We stayed for 3 nights with my family (spouse and 2 teenagers). The hotel has an excellent - close to subway, shopping mall (with Carrefour and many restaurants) and tram station. Clean and new furniture. Staff was very friendly and helpful.", "Date": "December 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Haifa, Israel", "Title": "“not cost effective”", "Author": "yosi55", "ReviewID": "UR121618459", "Content": "We book this hotel very late. Prices were almost duble the othe hotels same level and dectance from city center. Hotel itself is O.K. but price does not refelct it's worth. Room was stink from smooking,so at late night I cahanged the room. Recomandation: go to other place", "Date": "December 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lisbon", "Title": "“Very good hotel”", "Author": "Zaganov", "ReviewID": "UR121569483", "Content": "Good location, warm and helpful staff, wonderfull view from the 18th floor.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh, UK", "Title": "“Great hotel, excellent stay”", "Author": "alXpucu", "ReviewID": "UR121524360", "Content": "We stayed at the hotel for 3 nights in March 2011 and for sightseeing - the nearest metro station is just a few minutes' walk away and the main palza is probably a 30-min walk from the hotel. The location of a shopping centre literally across from the hotel was also a plus. We didn't have breakfast at the hotel and preferred the cafes at the shopping centre instead. The hotel itself was a very good value for money - we managed to book a 2 for 3 nights deal that they offer on weekdays. General cleanliness was excellent, and so were the rooms - exactly as in the pictures on the website. The nice view from the rooftop pool is also and added benefit - even though it's only open for use in the summer. Staff were really helpful and friendly and we really had no issues with the hotel so would recommend!", "Date": "December 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Crewe, United Kingdom", "Title": "“Excellent haven in busy Barcelona”", "Author": "pmd76", "ReviewID": "UR121078582", "Content": "I stayed here for 6 nights in November whilst on a city break in Barcelona. The hotel is in a commercial district, only 3 mins walk from the metro (Glories) and there is a tram stop outside the hotel. The hotel is very modern and clean. The room was large with a minibar, safe, kettle and free Wi-Fi. The rooms have views across the city. There is a large bar area as well as downstairs seating where guests can enjoy comfy chairs and a drink. Breakfast was served in the restaurant and has a wealth of different foods on offer. Cereals, breads, cheeses, meats, cakes etc.. There is also hot food which is freshly cooked by chefs behind the serving counter. I also ate in the restaurant and the food was of a very high standard. The menu is limited but there is something for everyone. There is a modern shopping centre across the road that has a number of reasonably priced restaurants as well as a large supermarket. I would definitely recommend this hotel for anyone wanting a quieter stay in Barcelona without wanting to be too far out of town.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London", "Title": "“good hotel away from centre”", "Author": "HHHYYY", "ReviewID": "UR121019227", "Content": "Room is clean and has basic amenity. Mini bar, safe, hairdryer shampoo and so on. No bathtub. Althought the shower room is large enough, it only has a shower booth. 5-7min walk from metro station, Glorias. Bus stop is only a min away from the hotel so it is easier to get to central area. Staff are friendly and helpful. Speaks various languages fluently. Bed is ok but sofa bed is not that comfortable as we expected. This hotel is good value if you don't care for much about sightseeing of old central of Barcelona. Or it is good if you have long stay in Barcelona.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“Good value for money”", "Author": "FdV62", "ReviewID": "UR120828135", "Content": "I stayed here for 4 nights to attend a conference at the CIBB which is about 3 kilometers from the hotel. The Novotel is located on the 'Diagonal', a broad road with good running / walking / cycling area in the middle of the road. Bicycles can be rented for a deposit from various stations close to the hotel. The rooms are simple but well appointed. It was very clean and the service was as expected. The hotel provides good value for money as a business hotel. The minibar drinks and the restaurant / bar are very reasonably priced. Simple breakfast starts from Euro 3.50. Overall a very good experience.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Good value excellent service”", "Author": "Rmlondontx", "ReviewID": "UR120793326", "Content": "Great hotel - about 7/8 mins from metro. Easy access to the tram to the beach. Staff was very friendly especially the person who worked with kids at breakfast. Rooms were clean and modern. Pool was nice just cold while we were there", "Date": "November 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Chicago, IL", "Title": "“Excellent business hotel, but uninspiring location”", "Author": "freiburg13", "ReviewID": "UR120687453", "Content": "This Novotel provided much more enjoyable experience than the one I stayed in London. This is primarily business hotel surrounded by other business hotels, shopping mall and infamous (but interesting) Torres Akbar. It is convenient to CCIB where I attended conference. Metro station is nearby, but the only interesting place you can walk to is Poblenou district. Rather than location, it was excellent: tasteful rooms, nice modern design, no problems with the service. Excellent value for the room. Didn't eat overpriced breakfast, cannot comment on the food. Hotel has nice facilities, even hammam, but off-season their bar and pool on the 19th floor are closed. All in all, good hotel for business.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“excellent hotel”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR120408170", "Content": "I stayed 1 night with my family (2 teenagers) and I chose family room. The room is spacious, clean and very quiet, so we could sleep well. The receptionists were friendly and they could give me suggestion about the suitable ticket of public transport for us. The breakfast menu is various and the taste was very nice, unfortunately there was no available menu for vegan, except fruits and potatoes.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“What can I say, it's a Novotel!”", "Author": "RPMol", "ReviewID": "UR120394268", "Content": "Hotel rooms are cheaply decorated, poor quality towels and amnities. Remote for the TV wasn't working but no replacement or repair possible in the evening because the maintenance department wasn't working! Please come back tomorrow morning! Location from CCIB is not too bad.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Kual Lumpur", "Title": "“Convenient, any which way you look at it!”", "Author": "AirBizTraveller", "ReviewID": "UR120376725", "Content": "This was my second time at this hotel I must say its about as good as it can get in Barcelona. Besides being new and all it is also not much of a walk to the Glories metro and just across the road from the mall. I did not discover the mall as I thought it was only a small Carrefour. But I was surprised to find that it was actually quite a huge shopping centre. The hotel offers a good rate for parking (18€ per day) and saves you the trouble of leaving your vehicle outside as it is rather unsafe. From the hotel you can move around conveniently by metro and tram lines. There is a jolly good pizza restaurant across the road that gets you a pizza and a beer for under €8!", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Havana, Cuba", "Title": "“It s amazing. Absolutely amazing!!!!”", "Author": "distance10", "ReviewID": "UR120045717", "Content": "Maybe one of the best Novotels around Europe. The room, the bathroom and their equipment is the typical for the Novotels, but the difference here is the Staff. They are all extremely friendly, very professional, and most important the hotel is very clean. Ask for rooms on higher floors for a panoramic view of Barcelona, and don t forget to visit the pool on the terrace. The hotel is good situated next to the Glorias metro station, but if you are a little bit fit, I would recommend you to walk to the La Sagrada Familia( it gets only 10 min. walk). Near to the hotel, you will find a lovely shopping center, with plenty of Cafes, restaurants, a supermarket and many many shopping possibilities.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Kansas City", "Title": "“Nice Hotel Overall”", "Author": "WillieC", "ReviewID": "UR119973032", "Content": "We spent two nights here pre-cruise late October 2011. The hotel is a typical Novotel - contemporary design and furnishings, decent sized rooms and nice Euro-style baths. It is not in the city center but is just a short metro ride away. The metro station is just down the street a very short walk. Our room was on the sixth floor with a view of the Tower Agbar (just down the street) and the Sagrada Familia (which we were able to walk to about 3/4 mile). The room was clean but the carpet had been burned in one spot (probably an iron) and needed to be replaced. It did not impact the room but it was unsightly. The room had a sofa, queen sized bed, work desk, digital safe, minibar with items for purchase (it had enough room to hold our wine as well). There is also a water kettle and instant coffee and tea in the room. Housekeeping was excellent and kept the room clean. Note there is no ice machine (typical for Europe but the bar will provide ice if you want to traipse down to the lobby). The hotel will store bags for those like us that arrive early. There is no charge for this service. The lobby was very attractive and quite busy at most times. Lots of airline crews stay here even though it is about a 30-35 minute ride at least to the airport. Our taxi from airport to hotel cost around E35 as I recall. We did not use the hotel dining room but it looked quite nice. The rooftop terrace offers great views and has a pool which we did not use as it was too cool for swimming. There are several places to sit here as well. The exercise center is also on this level and had a nice selection of equipment. Right across the street is a large shopping center that has a Starbucks and several places to eat. The restaurant right on the entrance to the center is quite good and reasonably priced. It is called Canas y Tapas. There are also several places to get pastries in the mornings to take back to the hotel. Do not expect to walk over to Starbucks for a latte early in the morning - they do not open until 10am! Have a coffee con leche instead at one of the little cafes. Overall we were happy with the Novotel. It is just a bit removed from the old part of Barcelona but the metro makes it convenient.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great location”", "Author": "KandAC Posted by an Accorhotels.com traveler", "ReviewID": "UR119786982", "Content": "Loved the hotel and its location: just across from a shopping mall with loads of restaurants to choose from. The no. 7 bus stops in front of the hotel and takes you almost to the gates of the Barcelona stadium. The Barcelona Bus Turistic hop-on/hop-off bus also stops in front of the hotel, and the Glories metro station is just around the corner. I have only three complaints: 1) air-conditioning seemed to be lowered at night so the room got quite warm; 2) the three lifts sometimes had difficulties in handling all the traffic at peak times and 3) wi-fi in our room on the 18th floor was a bit hit and miss.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Surrey, UK", "Title": "“Nice hotel but shouldn't be called a City hotel”", "Author": "AFrequentTraveller", "ReviewID": "UR119748552", "Content": "The hotel is in the technology area of Barcelona not in the area where most tourist attractions are so you will need to use bus, tram or metro to get into the city. The hotel itself is very modern and its newness is evident by the lack of experience of some of the front desk staff. Rooms are on the small side but very comfortable and also quiet. As has been described before the hotel struggles when it is full to deliver an acceptable level of service. The pool on the roof is good and there are great views across the surrounding area and the nearby Torre Agbar certainly looks spectacular at night. We only ate breakfast in the hotel, which was pretty good although long waits for a table on occassion. We found a nearby street which had lots of reasonably priced restaurants frequented by locals where the food was excellent and prices very reasonable. If you exit the hotel and turn right and right again onto the main road, walk three blocks and turn right - in a couple of hundre yards you will enter the restaurant area. A great day trip is to take the train to Monserrat which is very impressive - takes about one and a half hours from the hotel via metro, train and furnicular. Avoid the weekends if possible, especially Sunday, as it is very busy.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montreal, Quebec, Canada", "Title": "“Wonderful place to stay”", "Author": "555Carol Posted by an Accorhotels.com traveler", "ReviewID": "UR119433184", "Content": "My husband and I stayed there 3 nights prior to our cruise. We found it to be a wonderful hotel with great staff. We would definitely stay there again. Location is great if you don't mind walking a bit. Lots of restaurants close by and having the mall across the street was great. After visiting La Ramblas, we were quite content to get back to our hotel in a quieter district.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Good Hotel, great staff - WIFI needs improvement”", "Author": "momap", "ReviewID": "UR119332433", "Content": "Relaxing and quiet place, nice view from the roof top. Great value hotel, location is close to shopping and public transportation. One inconvenience was the WIFI, very weak, inside the room no signal, we had to stay in front of the elevator to connect to internet. Desk staff very helpful - we forgot couple paintings in our room, called hotel from the airport and they managed to get them in the airplane, just before closing airplane doors !", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Newcastle, Australia", "Title": "“An afternoon in Barcelona”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR119318141", "Content": "nice hotel, clean , good sized room. A little bit out of town. about half an hours walk from town centre but 5 minutes on the Metro which was 5 minutes walk from the hotel. Friendly staff. We had dinner the hotel restaurant which was also good", "Date": "October 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lima, Peru", "Title": "“Very nice hotel, excellent location!”", "Author": "Jeedr66", "ReviewID": "UR119307337", "Content": "This is a fairly new hotel in a very modern part of Barcelona within the City center. It's located next to the controversial but very noticeable \"Torre Agbar\" (Agbar Tower) and very close to the \"Sagrada Familia\" (one of Barcelona's main tourism attractions). The Barcelona Metro station (\"Glories\") is one block from the hotel and the Tram stops literally in front of the hotel. Across the hotel is the \"Les Glories\" shopping center and a few blocks (a couple of Tram stops away) is the \"Diagonal Mar\" mall. Tipical cab fares to the \"Paseo de Gracia\" (\"Passeig de Gracia\") or the \"Gran Vía\" areas, run between 8 to 12 EUR. Like I said, the hotel is very new and modern. The rooms are very confortable and make a very efficient use of the space (tipical of the Novotel hotels). It has an underground parking garage if you need to park your car while in Barcelona (there is a fee of about 18 EUR per day). The staff was always very friendly at all times. In general we had a very nice stay at this hotel. Certainly recommend it!", "Date": "October 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Athens, Greece", "Title": "“Brilliant”", "Author": "imouzakis", "ReviewID": "UR119130535", "Content": "An exellent city hotel. Relatively bear the center. Very quite. Transportaion availabilities very close. The rooms have an \"IKEA like\" atmosphere but in general very cosy and very clean. An very nice resturant wth relatively good prices. Breakfast is also very \"rich\". Free Wifi with good signal. Overall a very good choice for traveling in magnificent Barcelona.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "West Palm Beach", "Title": "“Nice hotel, close to the metro”", "Author": "jaymakins", "ReviewID": "UR119112974", "Content": "The hotel is very nice. The breakfast buffet is good, and the computers are free. But no free wifi. If you need an outlet converter or iron you have to put a deposit down at the front desk. The room as very nice and comfortable, but there was a slight odor in the room. It may have been from the water, I'm not sure, but there was an odor. The location of the hotel was very good because it was close to the metro.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Panama City, Panama", "Title": "“Very nice rooms, excellent service.”", "Author": "JMI75", "ReviewID": "UR119081676", "Content": "This is a brand new property, rooms are very nice, although a bit cramped. We stayed with 2 children and we were at the limit. The staff is very helpful and knowledgeable, they provide excellent service. Although there is a metro station 2 blocks from the hotel, location is not a strong point if you are touring the city.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Very good”", "Author": "Newton1976", "ReviewID": "UR119078699", "Content": "Nice place, excellent the smimmingpool at the 19th floor with a nice view all over the city", "Date": "October 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Fort Lauderdale", "Title": "“Ridiculously overpriced for what is offered”", "Author": "FloridaJudge", "ReviewID": "UR118876175", "Content": "Basic, adequate hotel that is nevertheless very overpriced for location and facilities. Nice views of the city and Sagrada Familia from upper floors. Sagrada Familia is a comfortable walk away, but everything else quite a distance.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "brisbane, australia", "Title": "“Mostly very good”", "Author": "ohmiso", "ReviewID": "UR118799451", "Content": "As the hotel is pretty new the room was fine and it was very clean. The breakfast was good. The hotel was reasonably priced for the standard, especially given it was F1 weekend which has proven expensive in other cities. We stayed on a very warm weekend in May and were disappointed to find we couldn't use the pool. Service was OK. We arrived at 10am after 30 hours of travel and despite asking were told they wouldn't be able to get us in before 2pm. We went over to the Glories shopping centre and went back at 1.30pm when, fortunately, we were checked in.", "Date": "September 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Losone, Switzerland", "Title": "“nice stay for a family”", "Author": "Pascal T", "ReviewID": "UR118774868", "Content": "we spent 4 days in Barcellona and the novotel was just great for us. it is near the center our rooms were on the top of the building. Service and breakfast very good. we reccommend it very much.", "Date": "September 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Southend-on-Sea, United Kingdom", "Title": "“needs better wi fi”", "Author": "rayfish999", "ReviewID": "UR118490431", "Content": "We stayed in this hotel for 3 days in September 2011 , its very definetly a business hotel, a bit formal and not really suitablle for a relaxed vacation stay,its got a stylish business class interior and the room was comfortable with modern designer fittings as you would expect in a stylish city such as Barcelona. The rooms where at a good price when compared to central Barcelona hotels but the meals where expensive especially as you can walk across the road to the Glories shopping centre where there are a multitude of restruants open from 8 am to 10 pm ( except sunday when just a few are open)and eat for a fraction of the cost of a meal in the hotel restruant Although its righ on a main artery, Its not really central so taxies are required to get to and from central Barcelona or, if you can master the transit system, there is a very efficient service into the centre by tram , bus or metro at low cost, also the open top tourist bus has a stop just across the road. The main problem for me was the wifi internet connection was very poor. the only way to get on line was to stand just behind the door of the room where the computer rated the signal as low, otherwise the signal within the room as very low and impossible to get on line. I find it incredible that a business hotel had such a poor connection with no LAN port available. To sum up, a good value business hotel with poor WIFI, modern clean and comfortable,", "Date": "September 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“'jazzy'”", "Author": "Jacobwilliam", "ReviewID": "UR118403047", "Content": "Fantastic value for money, perfect location, and what a view. In my 13 year old daughter Cerys' words \"amazing, pretty jazzy\"", "Date": "September 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ipswich, Suffolk", "Title": "“Wonderful stay - highly recommended”", "Author": "PaulandJulie", "ReviewID": "UR118351849", "Content": "We stayed at the Novotel for 3 nights and it was fantastic! We had a room on the 16th floor with amazing views. The room was clean and spacious (normal Novotel standard). We had breakfast inc in our deal and there was plenty to choose from along with chef cooking omelettes to order. The pool/bar area (on 19th floor) is especially welcome after a hot days sightseeing again with excellent views over beach/city. There is a shopping centre opposite the hotel which was ideal for evening meals and again we recommend this. The metro is a five min walk from hotel and very easy to use. We cannot fault this hotel and would definately stay here again.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“A fine hotel”", "Author": "Branko55", "ReviewID": "UR118175177", "Content": "Had to book at very short notice so we opted for the Novotel as we couldn't afford to risk the the five days we were spending in Barcelona by staying in a dodgey hotel. Great location, helpful and attentive staff. After a hectic day enjoying all of what Bercelona has to offer it was great to come back to the Novotel.", "Date": "September 15, 2011"}, {"Ratings": {"Location": "4", "Overall": "3.0", "Value": "3", "Service": "2", "Rooms": "3"}, "AuthorLocation": "West Hollywood, California", "Title": "“Great location but......”", "Author": "Babyface777", "ReviewID": "UR118102521", "Content": "This hotel is on great location, shopping mall nearby, 5 min walk literally. It is near Sagrada Familia attraction too. Hotel is clean, usual art deco Novotel. Unfortunately, staff is slow and not so attentive. I requested for iron/board late night, after calling several times they said it is coming however it never came. No one called back and I do not know what happened. Elevator takes forever especially during the morning rush of check out's and people going out. I wish they will improved this situation.", "Date": "September 14, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Helsinki", "Title": "“Modern, comfortable hotel”", "Author": "NordicSun", "ReviewID": "UR118012985", "Content": "Got a great deal with free nights in this hotel. Very satisfied with the room. Breakfast was something to be waiting for each morning. Great selection, beautiful premises. The location was fine, good connections by bus or tram. On the opposite street, there was a nice shopping mall. Roof top gym and pool were great.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Bruxelles", "Title": "“Nice hotel, nice view, well located”", "Author": "nicomedbxl Posted by an Accorhotels.com traveler", "ReviewID": "UR117787923", "Content": "We spent 3 nights in this hotel. Rooms are nice, well furnished and soundproofed. Cable TV with lots of foreign channels. We had a room at the 17h floor with a nice view on the Torre Agbar, Sagrada Familia, the sea, Tibidabo, etc. Small swimming pool on the roof with Hammam. We did not have breakfast because of the price and the facilities available just at the corner...Also, the Glories Shopping Mall is just in front and so is the metro station which is very practical. Only 4 stops to Plaza Catalunya.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Clean, modern and affordable”", "Author": "8401", "ReviewID": "UR117787421", "Content": "We chose the Novotel Barcelona City for a nights stay pre-cruise and found it to be a great choice for the night. There is a shopping center across the street with a grocery store which was great to pick up a few things to bring with us on the cruise. It was challenging to find a \"family room\" in Europe so we were pleased to find they had rooms to sleep more than 2. This way we didn't have to get a separate room for our teenage son. We went up to the rooftop pool for awhile but it was kind of windy and most of the loungers were taken already plus the water in the pool was cold so we didn't stay too long. But it's a nice ammenity, especially if you have younger kids. They didn't seem to mind the cold water. We asked for suggestions on places to eat dinner and were directed to a great pedestrian area a few blocks away with lots of little restaurants & cafes to choose from. We purchased the breakfast with our room and were pleased to find it to actually be a nice buffet with a lot of options (hot and cold). Everything from eggs & various meats to pastries, cereals & fruit. And a pot of \"American\" coffee for the table!! Definitely worth including the breakfast. I would include pictures but really the ones already posted here are accurate and I would just be duplicating some of the same shots. It was no frills but clean and convenient. Can't go wrong for the price.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "uk", "Title": "“Good hotel for one night stopover in Barcelona”", "Author": "hilarytravel", "ReviewID": "UR117660441", "Content": "The staff were friendly. They dealt efficiently and professionally with a problem with the internet booking. The room was adequate but small. The on roof pool was delightful but was small. The views of Barcelona from the pool and adjoining cafe amazing. The picture of what looks like a jacuzzi isn't - it is a babies pool - very disappointing. The location is good, next to a shopping centre, tram stop and taxi's right outside. Easy access to central Barcelona. There are not enough lifts for the number of people using them. There is safe underground parking which is available after checkout time.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Bendigo, Australia", "Title": "“Just a hotel”", "Author": "Carla D", "ReviewID": "UR117466193", "Content": "we spent 3 nights at Novotel City and it was pretty average. view was lovely, service shoddy. we were not assisted with our luggage or shown to our rooms. when I requested an extra pillow I was advised that there were none available. pool only open from 11am to 7pm, so no early swims. Will spend my time and money elsewhere next time.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Wirral england", "Title": "“Not up to usual standard”", "Author": "joe7544", "ReviewID": "UR117368981", "Content": "Having stayed in a number of Novotels across Europe they all deliver a pretty standard product which allows you to book the chain knowing what you are getting . However my experience of the chaos that greeted my arrival at this hotel was not quite what I was expecting . The reception was littered with families ,air crews and irate business men all waiting for rooms. I waited three hours for a room to be allocated without eeven an explanation or reason from the receptionists.. The rooms were clean if a little worn and shabby . The roof pool and spa was a bit cramped. The real entertainment comes in the shape of the tthree lifts that service 19 floors of rooms . Some people waited up to 30 minutes during the morning to access a lift through the sheer number of people using them . I Will certainly be seeking alternate accomodation nexo time in the city.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Dublin", "Title": "“Great hotel, highly recommended”", "Author": "DublinFionaC", "ReviewID": "UR117119870", "Content": "Just returned from family trip to Barca. Having stayed in different Novotels and always had good experience this one was no exception. Hotel was excellent. We had a family room with queensize bed and double sofa bed for the four of us (2 ad and 2 children), it was clean, bed comfortable and bathroom was lovely. Air con very effective too. We had a buffet breakfast included in our rate which was great - they had plenty of lovely food - something for everyone's taste all served in a large area so no queues each morning. They even had nespresso coffee machines which really impressed me. The terrace on the 19th floor had amazing views along with pool and lovely comfortable loungers - although quite small it was great for an hour or two away from sightseeing. They also have a gym and sauna. This hotel is in a great location as we didnt want to stay right in the centre. Hotel was easily accessible to Las Rambas by metro only 4 stops to Catalunya and we walked it in about 20-25 mins. The open top bus (recommended) stopped just across the road. The tram also stopped at top of the street. Hotel is right beside the Torre Agbar tower which is a great landmark for finding your way home. We really loved this hotel and would definitely stay again next time we visit Barcelona.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Nice hotel with good location but poor room service”", "Author": "Andrew H", "ReviewID": "UR117086483", "Content": "First impressions of this hotel were good, slick check in and upgraded to a suite, nice! We visited the outdoor area on floor 19 which is lovely and the views from the room were good, generally we were very happy with the hotel. However unfortunately there were a couple of issues. We ordered room service at 10pm and it failed to arrive within an hour, and room service closed at 11. I called room service, no reply, so I called the front desk who were quite curt and tried to put me through to room service, but surprise, surprise, no answer, so the lady on the front desk said she would call me back. 15 minutes later and she called back to say the meals were 'in the lift' right now. 20 minutes later they arrived and looked like they had been under a food heater for some time. Not ideal, but as it was not late and the choice to food to eat quite limited we accepted the meals. The other issue is maybe just personal, but what they call atmospheric lighting in the rooms I would class as just plain dark! A few extra lamps would be more than welcome. We also had breakfast which I found perfectly acceptable and would book again. I would stay at this hotel again, but I would not order room service!", "Date": "August 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edinburgh", "Title": "“Loved Barca!”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR116822884", "Content": "Such a lovely hotel with brilliant views and great service. We were upgraded to a suite upon our arrival. The terrace view was amazing and it was such a treat sitting up there on a bright summers day. The location was good too. Just round the corner from a metro station which will take you everywhere in the city. Out son in only 4 and he also loved the hotel. Slight downside was that the English Satalite channels did not work apart from the news and the bed wasnt the comfiest.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Watford, United Kingdom", "Title": "“Great Hotel, Great Location”", "Author": "Richard N", "ReviewID": "UR116671454", "Content": "Good quality hotel, in great location on Avenida Diagonal near Torre Agbar (a building similar to London Gherkin) and the Glories Shopping Centre. Tourist hop on / hop off bus stop right outside with a readily availble supply of licenced cabs in rank right outside. We had been told the Ave Diag was not the best place to stay but it felt very safe (with two young boys aged 5 &8) and room had a safe and secure parking (we are told this is a must for a car with non Spanish number plates). It was all reassuring. Room was very clean and the air conditioning was effective. Staff very helpful - although took a little coaxing to get the help initially. Expensive, but we thought it was worth it.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Lovely new rooms and friendly staff!”", "Author": "Irene B", "ReviewID": "UR116520098", "Content": "I had an amazing experience. The hotel is well connected to the historic centre, clean and new and quiet. The staff is incredibly friendly and the breakfast is amazing! The hotel has a roof terrace from which there is an amazing view. Would definately reccomend it!", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Gothenburg, Sweden", "Title": "“Not bad”", "Author": "ma65", "ReviewID": "UR116441034", "Content": "Location is fine. Although not walking distance to the Rambla or Passeig de Gracia, it is a very short walk (one minute or two) to the underground where the red line takes you to Plaça de Catalunya in about 5 minutes. As we arrived by car, the Novotel presents the considerable advantage of a large and safe underground parking (paid, about 19 euros per day). Although Novotel advertises itself as a family friendly hotel (“kids stay free”), it should be noted that kids under 16 do indeed stay free, but in the existing bedding, which is (apart form the parents’ bed) a rather narrow sofa bed (120 cm broad). This may be fine if you are travelling with toddlers, but it hardly works with two teenagers… What's more, the rooms are quite small and once the sofa bed is unfolded, there is very little space left and certainly no room for an extra bed (even if they would offer you one). The bathroom door is of glass, so if someone puts on the light in the bathroom in the middle of the night, it wakes up the other ones in the room. Not a very good idea, really… Breakfast is fine, but nothing exceptional, and hardly worth the 17 euros charged (per adult, kids get a free breakfast). And yes, there is a rooftop pool, but it is quite small.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Miami", "Title": "“Very good for European hotels”", "Author": "elmoro", "ReviewID": "UR116388973", "Content": "Had a hard time finding a hotel with 2 double beds and a reasonable rate. This hotel did it for us. Stayed 1 night before our NCL cruise out of BCN with family (kids 10 and 7). Modern, clean, helpful and nice reception staff. They also stored the luggage for us (for free) during the morning prior to the cruise. The room has huge. I think we got upgraded to a suite but not sure as I was too tired to ask upon arrival. Great value, great location with a shopping mall a block or two away to get emergency clothes or a bite to eat. Also close to a metro station. Taxis ready to take you anywhere. Fare to the port was about 10 euros if I remember correctly and took about 20 minutes on a weekend (city had no traffic!). One note/caveat: my wife forgot a jacket inside one of the closets. The next Sunday, after returning from our cruise, we went to the hotel and inquired to see if it had been found. Unfortunately, it was not found according to the reception and housekeeping staff. I find this a little strange but not much i can do.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Gdynia, Poland", "Title": "“Nice location. Above Novotel's standard.”", "Author": "ash729", "ReviewID": "UR116302134", "Content": "I've slept in many Novotels. And this one is much different. Above of all Novotel standards you will get fantastic view of the sea plus amenities like pool on the highest floor. Someone can complain about construction works nearby. But if you have the room on the right side and floor, this is just negligible. We were upgraded to family room in which we found 2 TVs, nice but cool glass desk and modern finishing of rooms. Location of this hotel maybe is not central, but near is commercial area, metro and tram lines. Also have easy access from bus station, even on foot. You can also catch the local market just on the other side of the Glories roundabout.", "Date": "August 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great roof terrace and convenient for metro and tram !”", "Author": "Mrspricklepants", "ReviewID": "UR116265964", "Content": "Great size interlocking rooms, the pool and roof terrace area is amazing with great views over the city and the cucumber (torre agber). Great value for families.", "Date": "August 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Epping", "Title": "“Will consider staying here again!”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR116239457", "Content": "Great location! Staff are excellent and always willing to help... time to time.. there's a language barrier kicking in.. but it's understandable... be patient and ask the question again in adifferent way...", "Date": "August 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Would definitely stay at this hotel again”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR116174340", "Content": "Excellent service. Stayed in a very clean family room with a 13 and 9 year old. The only downside was the room size. It could have been somewhat larger and the room overlooked a building site. Lovely terrace and pool with fabulous views across Barcelona. Excellent location and good food.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Las Vegas", "Title": "“Good value in an overpriced city! Recommended for sure!”", "Author": "rabfel", "ReviewID": "UR116049079", "Content": "We liked this hotel very much. The staff was amazing, they were friendly, knowledgable and always willing to go the extra mile to help. We took advantage of a special rate accor hotels has for families where you get a second room for 50% off if traveling with children. The rooms were nice, clean and very modern. TV slightly small but flat screen. Beds were comfortable and rooms have a pull out sofa bed that according to m kids was not at all bad. The restrooms are nice and spacious, very modern though so the shower is see through... Yo are within 10 min walk of La Sagrada Familia, there is a rather ig mall accross the street with many restaurants and shops. We found the food in the hotel to be good, breakfast was a bargain and so was dinner compared to the prices outside. We didn't like the breakfast room because it stunk of bacon tremendously buhe dinner buffett is served in the restauran which is very nice and very good! Excellent food for the dinner buffet, a fraction of the cost for the same food that yiu pay through the roof outside including Paella. I would absolutely recommend this hotel to fzmilies wih children. BTW it is a 25 to 35 euro ride from the airport.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney Australia", "Title": "“Great end to a fabulous holiday”", "Author": "LHC20", "ReviewID": "UR115948274", "Content": "We stayed at the Novotel Barcelona at the end of a 12 day cruise (another review) for 3 nights. We found the hotel to be modern and room was very comfortable. Service at the font desk was friendly and efficient. The hotel is situated right next door to the Torre Agbar, an unusual bullet shaped building. Although not close to Las Ramblas, a $6 euro cab ride will get you to the city centre and all cab drivers know where the \"Torre Agbar\" is on your return. They served an express breakfast in the lobby, a danish or sandwich + coffee for $4.50 euro. Although on the last day we found a bakery just down the road that made the best pizzas and croissants. There is a large shopping centre across the road Les Glories which had a Zara store. The only disappointment was that the PC in the lobby for guest use was \"out of service\" on the 2nd day and still not repaired by the end of our stay. However, front desk was accommodating and printed out our boarding passes for us. Would definitely stay here again.", "Date": "July 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Espoo", "Title": "“Room with a view”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR115785361", "Content": "We spent 12 days in Novotel Barcelona City and everything was great. The room in 17 th floor was amazing and the view was wonderful. Room was very silent and we also liked the pool area in 19 th floor. Breakfast was very good and possibility to use internet was also very good. There was metro and tram very near so it was very easy to move everywhere. We liked very much and maybe we will come back some day.", "Date": "July 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Good place to stay to see city.”", "Author": "AJMTrips", "ReviewID": "UR115784953", "Content": "Stayed here before and after a cruise. Location is not very central, but close to metro and tourist bus, so it is easy to get to all the attractions in the city. Rooms clean and bright, rooftop pool looks nice, although we didn't try it as we were busy most days in the city. Buffet breakfast on the Saturday was held in the function room rather than the restaurant. This was a little crowded, and some of the food was not very hot. On normal week days, it was in the restaurant, which was much better.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "South Africa", "Title": "“Great hotel”", "Author": "blackspaniel", "ReviewID": "UR115562216", "Content": "We stayed in this hotel from 26 to 30 June 2011. This is a great hotel and very good value for money. We stayed in a double room with sofa bed for our two teenagers, and the room was very comfortable, modern and clean. Bathroom of good size with big shower. Check in went quick, and there was no problem for us to check in at 23h00. Staff was friendly and very helpful. The hotel is modern, clean, and breakfast was available for us at an extra cost. Only the two adults pay for breakfast and the children are free. The breakfast was good, consisted of jogurt, fruit, breads, pastries, egg ,bacon etc. The hotel is very well located, nearest metro station is about 3 min walk from hotel, from this metro you can reach La Ramblas in two stops, easy to get to Camp Nou, Familia Sagrada, Port etc. Will definitely stay in this hotel again, and will recommend it .", "Date": "July 20, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Jose", "Title": "“average hotel. not bad but not too good either.”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR115489678", "Content": "1) the shower door does not work. this make us taking shower on the bath tub instead of in the shower to avoid water flooding the floor. 2) the sink water stopper dont work for both sink, until got fixed the next day. 3) the food in the hotel is terrible and extremely expensive. no wonder we did not see more than a few people even on Saturday night. 4) the service is on the low side. I got trouble calling to the airport from using the public phone and none of the staff were willing to help.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Montreal, Canada", "Title": "“Worst hotel I have been in Europe in my life”", "Author": "Montreal35457382", "ReviewID": "UR115429427", "Content": "My company as a contract with Barcelona Novotel 20 rooms a night for the whole summer, we waited 2 1/2 hours for our room, and there was a whole lot of other customers who waited as long! The lobby was like a war zone with people sleepin everywhere on there sofas! There was not enough staff at the front desk 3 persons at check in? When I finally got my room, I notice the bed had no bed sheets? only a duvet cover, I was wondering if the cover was change front previous guess? Kind of weard! Half of hotel room have no view over looking an office building accross which is less then 100 feets...hotel is far located middle of no where...in a residencial area...no where to eat close by...a good 40 minutes walk from the beach. They advertise free internet? Maybe they should charge and have I speed...it take about 2-3 minutes to get any pages open on your browser.... When I came back at 22:00 at night to my hotel, I needed a new password for the internet, there was still a line up at front desk and only one clerk, I gave up and left. Absolutely no service in this hotel....they need more staff.... They I thought maybe I can enjoy the pool on the roof...well it is close...and the lounge adjacent was quite dirty...not really the kind of site you want to see when you pay that kind of money for an hotel. I would not recomand this Hotel unless you are on a budget and get a crazy deal for it, because its not worth more then 75 euro a night...and what you might save you will pat the difference in taxi fare.... cheers", "Date": "July 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“AClub”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR115417206", "Content": "On Cecking into hotel showed my gold A Club card time around 300pm was given a room overlooking a work site,on a lower floor no view.The lifts were inadequate for the amount of rooms long waits . Would not stay or recomend this hotel for any one .", "Date": "July 16, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Aircondition switched off”", "Author": "apomaz1", "ReviewID": "UR115343601", "Content": "Poor service at the reception The employees bored to talk Aircondition was switched off due the economic crisis,we couldn't sleep at night Room was overal as any novotel Very bad smell when you enter the hotel entrance they should do something about it It is not possible to remain at the lobby with that smell", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Oslo", "Title": "“A nice hotel for a family on vacation in Barcelona”", "Author": "tunafishOslo", "ReviewID": "UR115336413", "Content": "We liked the hotel a lot. The hotel was both close to the beach (25 minutes walk or 10 minutes with a taxi) and close to the city centre (4 stops on the metro). It was a modern and clean hotel with frindly staff. We liked the top terrasse a lot, with a little swimming pool where the childen could swim and play. Children under 16 years had free breakfast. We would recommend this hotel to other families.", "Date": "July 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "barcelona", "Title": "“Super hotel”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR115290807", "Content": "good service and offers (swimmingpool etc.) We would like that the restaurant have had at ala carte menu also. Very good rooms, and we will stay there again if we come back. xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx", "Date": "July 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Nizhniy novgoroda", "Title": "“Very good hotel.”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR115243123", "Content": "Very good suite. Big bathroom. There is a second restroom. Hotel lacated Near trade center. Good restaraunt, but not liked bufet. Hotel have a sauna, pool and fitnes center and Room for play children.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Agde, France", "Title": "“This was our second stay - we love it!!”", "Author": "john_jane_carver", "ReviewID": "UR115186534", "Content": "This hotel is a little way out of the tourist centre of Barcelona but it is in very easy distance to one of the metro stops and a very quick journey to the centre. It is an excellent hotel and was opened less than 2 years ago. The hotel has 19 floors - on the top is the pool, sunbathing area and pool bar. It is spectacular with wonderful views all over the city. There is a good on site restaurant where we've had good meals. Breakfast is served here too - nice varied choices. The staff are friendly, efficient and helpful. The first time we went we went we stayed in room on the 18th floor and asked for it the second time and got it. It's a wonderful double aspect room with fabulous city views. The hotel is clean and well kept. there is an excellent shopping centre just across the road. We will definitely go back.", "Date": "July 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bilboa", "Title": "“Excellent hotel”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR115146222", "Content": "Excellent hotel - very helpful staff - every aspect of stay was great. Would recommend to anyone travelling to Barcelona. Transport is easily accessed and there is a great shopping centre within five minutes from the hotel.", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Rochdale", "Title": "“Good quality hotel in perfect location”", "Author": "MatherFamily", "ReviewID": "UR115142232", "Content": "We stayed here for 3 nights for a 50th birthday celebration and were not disappointed. The hotel is in a great location as it is outside of the main city centre but is near to a metro stop which is only 5 minutes to the heart of the city. An added bonus is that one of the open top bus tours stops right outside the hotel with options to do tours on both an eastern and western route around the city which take in all of the main sights / tourist attractions. We found this a great way of seeing everything in the limited time we had and we hopped off the bus at various points around the city. We chose the hotel mainly because of the 19th floor rooftop pool and found this a great way for our children to unwind after a busy day whilst we took in the fantastic views of the city. Breakfast was included in the deal we got and was nice but we didn't consider it to be worth the advertised price. We did eat in the hotel on one evening but found the buffet food to be overpriced and not particulary hot. We had much nicer meals in the restaurants in the shopping centre opposite; Ginos Italian restaurant is particularly recommended. All in all a great birthday in a great hotel in a great city!", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Florida", "Title": "“Lovely hotel geared both to families and couples”", "Author": "socarras4", "ReviewID": "UR115091535", "Content": "we stayed here 2 nights before our cruise. The staff was very nice and the rooms were great for a family of 4. central location, walking distance to restaurants and the metro. Also, the rooftop pool and view is amazing. the hotel had a very good restaurant on site. We would definitely stay there again", "Date": "July 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "øystese", "Title": "“Novotel Barcelona”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR115028902", "Content": "Novotel Barcelona is a nice hotel situated 10 minutes from the city centre. The staff is friendly and the pool area located on the top of the building is magnificent. The rooms are clean and modern. Children under the age of 16 stays for free in all of Novotels hotels", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Houston, Texas", "Title": "“Excellent value... will be back!”", "Author": "trabeler1", "ReviewID": "UR115015437", "Content": "We chose this hotel based on good reviews and were not disappointed. Novotel offered a 4 nights for 3 rate and did not charge extra for children. Although located a little outside of the city, the hotel is only a block from the Glories metro station. 3 or 4 stops on the metro and you're at Las Ramblas. The hotel is clean, comfortable, and quiet. The staff seemed a little overstretched at times... for example it took three calls to get an iron brought to the room. We did not use the restaurant at the hotel since there were more options at much cheaper prices at the large mall across the street.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Portugal", "Title": "“Great views over the city, near public transports”", "Author": "JotaPortugal", "ReviewID": "UR114996118", "Content": "Great views on the 19th floor over the city. Near Tram and Metro lines that easily connect you to the main attractions in the city. Next to Glories shopping center and Carrefour Hypermarket.", "Date": "July 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "TOKYO Japan", "Title": "“Smooth as it should be in Novotel style”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR114921580", "Content": "The hotel is a bit outside of the CBD and major shooping areas, and almost nera to the consturction sites. The new constrcution is unfinished due to the curreent econnomic bust. The hotel boosts its location and nearestness to La Sagrrada Familia. From the top roogf, we can see it , but we have never tried due to our sightseeing schedule. The hotel is contemporay built to the Novotel standard specifications. The spaciousness is OK, but the toilt is not separted and only ensuite shower faiclity is available. The modernity ensures of the cleanness. The service is a littele bit unattentative to our eyes, while admittedly up to the standards of this class. It can be said that it is worth the money.", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "New Delhi, India", "Title": "“Beautiful hotel, amazing rooms, a great choice”", "Author": "Ghost71", "ReviewID": "UR114876234", "Content": "Located very well in the heart of the city. The metro is only 5 minutes walk and Glories Mall right opposite which has very good eating & shopping options. The rooms are excellent and very modern and the buffet breakfast is a must. The terrace pool is fantastic. Would love to go back..", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Very helpful, great rooms”", "Author": "travelfan93312", "ReviewID": "UR114868461", "Content": "This is a great hotel. The staff was extremely helpful. Susanna Sanchez went out of her way to verify our flight reservations, make dinner reservations, arranged early morning taxis for the family. There is a Hop on - Hop off bus for Barcelona City tours directly across the street. The subway is nearby. The pool is on the top floor with amazing views of the city. Ask for a room that ends in 31; example 1331, 1531, 931.... Great corner rooms with views of the city. I would recommend this hotel to everyone.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent location & service at Novotel Barcelona City!!”", "Author": "nazi062011", "ReviewID": "UR114838432", "Content": "I read reviews on this hotel on the Trip Advisor and I am so happy to have chosen it. The location and service was beyond what I had expected. There is a mall conveniently located across the street from the hotel. Starbucks and a grocery store which we could pick up fruits, water, bread etc. The hotel is a few minutes away from the metro and 4 stops away from the city centre and the Ramblas. This was my third trip to Barcelona and this hotel was definitely the best one in terms of convenient and location. Will definitely go back and recommend to everyone. The restaurant at the hotel has excellent meals as well. A great rooftop pool as well. It is also 15 minutes walk away from the beach. Can not go wrong with this hotel!!!!", "Date": "June 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hereford", "Title": "“Mid-week stay in Barcelona”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR114807798", "Content": "the hotel was easy to find, having researched its location and the nearest Metro station (Glories) on the L1 (red) line. The reception area is bright, modern and airy, and there are a number of lifts to speed up check-in and room transfer. We were very lucky to have a room on the 18th floor (of 19), so we were afforded great views of the city from above. the bed was extremely comfortable and the shower was great, in a modern and clean bathroom. Our favourite part of the hotel was the rooftop bar and pool area, which was very relaxing after a day's sight-seeing.", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Boston", "Title": "“Excellent experience overall”", "Author": "Buckaroo-8th", "ReviewID": "UR114673462", "Content": "For a family with elementary school-aged children this hotel is outstanding. They can accommodate the parents and two kids in the same room with the little ones sharing a sleep sofa. Ours were quite happy with this arrangement. You probably can't waltz comfortably in the remaining space but presumably that's not why you're in Barcelona. The rooftop pool (with fabulous views) was a big hit as was the kids' play corner in the lobby. The fitness area was well equipped for a hotel although ventilation could be improved. The hotel is and feels new and all spaces seemed clean and in excellent repair. The breakfast is outstanding if a bit pricey at 20 Euros per adult. The children eat for free, however. The staff was very friendly and helpful throughout. There are only two downsides worth mentioning and neither bothered us very much. First, the hotel is a bit out of the center and the immediate area does not have \"obvious\" tourist attractions. Having said that, there are ameliorating circumstances: 1) a mall right across the street where you can conveniently get some groceries, snacks, or a piece of clothing you forgot to pack, 2) a metro station two blocks away from which you can get to the heart of Barcelona in about 5 stops, 3) a half dozen new office/university buildings in the immediate vicinity which architecture mavens would definitely find interesting. Second, while we were there a number of larger groups (package tours perhaps) came through, seemingly staying for a single night. Nothing wrong with that, but it did tend to gum up access to the reception and elevators and it seems like something that the hotel management could improve on.", "Date": "June 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Zelzate, Belgium", "Title": "“Excellent stay in the shadow of the Barcelona landmark Torre Agbar building”", "Author": "Luc Spiessens Posted by an Accorhotels.com traveler", "ReviewID": "UR114144815", "Content": "Splendid location of the hotel near teh Torre Agbar landmark building and easily accessable by car. We used the reserved car park on -3 floor and took public transportation (metro - tram) from the hotel to enjoy Barcelona. The car park bill could be settled at the hotel reception desk which is convenient because the pay machine in the car park does not accept credit cards. Check-in at the reception went very smoothly as by chance the friendly staff member was Dutch and addressed us in our native tongue. He was so kind to explain the metro system and handed a map of the underground network. The room on the 8th floor had a wonderfull view on the city, was clean and overall nice to stay. The rain shower in the bath room was a nice new item to our Novotel experiences. Free of charge WIFI in the room and the bar using a 3 day personalised access code for security. Well appreciated - some large hotel chains still charge for internet usage. Breakfast buffet was plentiful and nice but very expensive compared to the many desayunes opportunities there are across the street in the Glories commercial center. (The hotel also offers a less expensive Bar Breakfast). Dinner is served in a modern, stylish, nice setting with open view kitchen. Our dinner tasted very well and was relatively inexpensive. The bar is the highlight area of the hotel: colourfull and spacious seats that really suit young people best. The lady in the bar that worked the evening shift during our stay, should be commended as \"employee of the month\". She worked very hard and quickly, always kept a nice smile on her face even when the bar was swamped by returning guests from an evening out and all of them wanted a last drink at the same time. It was a joy to see her remain calm and well organized. Things like this make a stay at Novotel Barcelona City a pleasant one.", "Date": "June 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Skopje, Republic of Macedonia", "Title": "“The best experience in Barca”", "Author": "marice81", "ReviewID": "UR113831152", "Content": "This is the hotel with the best food and the best breakfast ever! It is very close to the city center, very nearby the hop-on hop-off stops of buses. It is very peaceful hotel. The overall service is excellent. The minor problem is that some of the personnel speaks English badly but you can always find somebody that will help you.", "Date": "June 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Al Jubail, Saudi Arabia", "Title": "“Nice place to stay before and after a cruise from Barcelona”", "Author": "kimhhuang", "ReviewID": "UR113407886", "Content": "We stayed here after a cruise out of Barcelona. Wish we stayed there before the cruise as well. It is located across a shopping mall with a Carrefour in it so if you're traveling with family, it's great for getting any needed supplies (water, fruit, snacks, toiletries). There are a number of restaurants to choose from and a good selection of fast food (McDonald's, Subway, Burger King, Pollo Compero). Hotel is close to the port, L'Aquarium,. It's easy to get around in Barcelona. We loved the hop on hop off city bus tour. You can see Sagrada Familia from here.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Abington, Massachusetts", "Title": "“Very nice hotel, great location.”", "Author": "JPusateri", "ReviewID": "UR112455504", "Content": "The staff is helpful and pleasent, the roof top pool and leisure area with a bar is supurb! They have an excellent Gym on the roof as well. This was a very comfortable hotel for our 2 night stay after a cruise. We were able to hop on the bus across the street for a great tour of the city and there was excellent dining and shoping all a short walk away. This hotel has spectacular views of the city and port from its roof top area. I thought for a big city the price was reasonable for good quality.", "Date": "June 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Its a hike!”", "Author": "luv2travel520", "ReviewID": "UR112195740", "Content": "The hotel itself was great. Large room, modern amenities, nice breakfast and free wifi but it was quite a long walk to many of Barcelona's famed locations and attractions. If it's your first visit to Barcelona I would recommend staying some where more centrally located. But overall a great hotel for a decent price.", "Date": "June 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "england", "Title": "“Fantastic time, we would certainly go back”", "Author": "hawk9", "ReviewID": "UR111598298", "Content": "Lovely hotel, very clean and staff extremely helpful. Great location, we used the metro at Glories to get to all tourist sites and used the 10 journeys for just under 8 euros, which made it much cheaper for a family of 4 than the tourist buses. Great shopping and restaurant complex just 2 mins walk from hotel, where we had a couple of really nice meals. Ate at hotel restaurant twice, nice food, reasonable prices but not a huge choice. Hotel pool and sun terrace lovely for the end of a busy day site seeing. A great holiday - no complaints. We had breakfast included, fantastic buffet, we ate well at breakfast and didn't need to have anything until our evening meal", "Date": "June 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Lyon, France", "Title": "“Good experience!”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR111461030", "Content": "Other than transportation - OK for TAXI but a bit more difficult with public transport - this hotel is good choice. The Barcelona City Tours open bus stops 40 meters away, which can be convenient to some. There is a Mall with great shopping 50 meters away. Great staff, rooms, and the breakfast was good.", "Date": "June 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“GOOD STAY BUT ...........”", "Author": "Praline23", "ReviewID": "UR110680110", "Content": "We were at the barcelona city from May 23 to may 29- We choose this hotel because it was not in the center of the city( downtown is only 4 metro stations) - We wanted a quiet area. The metro station is only at 2 blocks - there is a shopping center across the street with a Carrefour grocery store . Bus and tram are at our door. I read the commentaries on breakfast and honestly this buffet breakfast is one of the best we had in Europe- from cereal, cold cuts- hot meals- fruits, etc... What else can you ask for? We ate two nights at the restaurant -- Food is ok - you definitely can't spend your week there - menu is limited . The only complaint I could do for the neighbourhood is there are no restaurant around ---it is really a business district and in the evening , there is nothing around- Now , my big deception: I MAINLY choose this hotel because there is a pool and I read the commentaries saying that the pool was not opened ---We were at the end of May - temperature is around 28oC and the pool is still not opened-- They are hiring students in the summer to act as a life guard - the pool is probaly 12 feets - ??? - I will definitely wrote a note to Novotel and Air canada vacations- they should put on their websites that Yes there is a pool but opened only 2 months /year !!! - The worst part is that we hesitate between this hotel and their neighbour ( which their pool was opened) but I choose Novotel because of their reputation...Too bad for us ! Of course the pooe beeing closed , the bar of the pool is also closed- probably opened also 2 months/year . I would recommend this hotel if you dont care about a pool !!", "Date": "May 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great hotel, friendly service”", "Author": "gina876", "ReviewID": "UR110242293", "Content": "When we first arrived at the Novotel in Barcelona we thought it was too far away from the main placa - place Catalunya. However we soon discovered it was only 4 metro stops away. The metro operates 24 hours and is packed so doesn't feel creepy travelling on the train late at night. The rooms are very spacious and clean - the hotel seems brand new. I needed a physio when I got here and the hotel staff went out of their way to help me find an english-speaking one close by who turned out to be great. Helped me get rid of my migraine so very appreciative of the service here. The breakfast is absolutely huge - massive buffet of eggs bacon chorizo etc and cereals fruits pastries. Great value for the quality of hotel", "Date": "May 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Nice modern hotel”", "Author": "kakijalan", "ReviewID": "UR110183805", "Content": "Location a bit further from the centre of attractions, but only 2mins walk to nearest Metro station that will take you directly to Plaza de Catalunya in abt 10mins. The hotel is modern and one of the best feature is the rooftop pool and patio, which affords a gorgeous view of the Agbar Tower and the sea. The rooms are well equipped and modern. Staff are very helpful and friendly. And they've got colourful furniture in the lobby area... in line with the vibrancy of Barcelona", "Date": "May 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Broxbourne, United Kingdom", "Title": "“OK - location not great”", "Author": "HertsFamily21 Posted by an Accorhotels.com traveler", "ReviewID": "UR109865349", "Content": "Booked this hotel for 2 nights in May over the F1 race weekend, travelled with husband, 2 children aged 5 and 4 and my mum. Although the location of the hotel was excellent for travel to Montmelo for the Formula 1 track (Clot train station is a 5 minute walk from the hotel), it was too far from any of the sights of Barcelona. Therefore we needed to take a taxi whenever we wanted to go to the central city sights or the beach. Another drawback was that the taxis only took 4 passengers and there were 5 of us so we either had to take 2 taxis or wait/book a 7 seater. On the upside, the Metro in Barcelona is excellent, cheap, user friendly and reliable. Buy a T10 card for about 7 Euros for 10 trips anywhere on the Metro and can be used across the whole family! Bargain! The hotel rooms were ok - not what I would classify a 4 star as they are basic (no shower cap, body lotion, iron or ironing board, no choice of pillow type). Also one side of the hotel faces an office block so no view at all. Reception area very nice and modern, with a childrens play area and xbox. The breakfast was really nice, loads of choice, fried eggs, pastries, nespresso coffee machine, and even some spanish breakfast items. Fitness centre was lovely, on top of the building with fab views, great sun trap, a gym, lounge area and pool. Receptionists service could have been better. They didn't have a clue about the F1 race that weekend and didn't offer assistance to find out for us. We had to get on the web to find out where the station was in order to travel there and luckily it was only a 5-10 min walk away. Then on the Saturday evening we noticed some very helpful leaflets on the reception desk detailing the different types of options for travel to the racetrack! Bit late we thought. Our flight home was at 10pm therefore we asked for a late checkout but they were not even interested in finding out for us. The concierge asked a colleague and his response was \"No No!\" in a very abrupt way, even though we noticed in our room information that family rooms could check out at 5pm. All in all, nice hotel facilities if you like basic rooms, good breakfast but dont mind being away from all the sights and sounds and buzz that is Barcelona. Next time we'll pay more but stay centrally or by the beach.", "Date": "May 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Good base from which to explore a fabulous city”", "Author": "MByrne0141", "ReviewID": "UR107387684", "Content": "This hotel was very conveniently situated on the Diagonal in Barcelona and so perfect if you want to explore the city. the reception staff were helpful and friendly and spoke English, French, Catalan or Spanish. There is a rooftop swimming pool and bar but both were closed during the afternoon we wanted to use them. The room was simply decorated and perfectly comfortable. There was a bath and a shower. We were disappointed by the buffet. No menu was supplied, only a price and so we had no idea what we would be eating. The starter was varied and tasty but the main course; lamb, pork, lasagne or pizza (not the kind of cuisine I would expect from a French chain) was over-cooked and cold. i would go back to this hotel to stay but would not eat there.", "Date": "May 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Maribor", "Title": "“bogdand barcelona”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR106819758", "Content": "Safty problems - it was not possible to exit on security exit!!! Very dangerous in case of fire! Our room was next to elevator therefore to noisy. The breakferst place it was use is not appreaciable for 4* hotel. The stuf in the hotel was generally kindly and helpful .", "Date": "May 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Helpful & friendly staff”", "Author": "ludodl", "ReviewID": "UR104771109", "Content": "I stayed at the Novotel for 3 nights beginning of April 2011, it was a pleasant hotel, good value for money, clean, small rooms, very friendly and helpful staff, especially with the children. A small corner for them with toys, playstations and cushions. The breakfast buffet is big with various internal and local food, good quality restaurant and not too expensive. Queues can be big at peak time in the morning or evenings. There is a computer available for free, with printer, perfect for printing your flight boarding pass. Each staff member speak at least 3 langagues, reception quick and efficient. Taxi are waiting outside the hotel, around 8 euros to go to city centre. The hotel is situated next to the Tore Agbar, a metro station, a pharmacy (even open on a sunday...) and a big shopping mall. I was however disappointed with the closure of the swimming pool, it was not advertised on their webiste or at reception. My kids were ready to go but apparently they had no staff available to survey the pool, the guard was only coming a week after.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Fantastic hotel!”", "Author": "KathrynLpool", "ReviewID": "UR104736929", "Content": "We stayed for 2 nights with a 5 year old. We were on the 18th floor with great views. Room was very comfortable. Our 5 year old was thrilled with the play area/den in reception. Breakfast was amazing! A really enjoyable stay and would definitely recommend it to anyone travelling to Barcelona.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Best choice we could have made!”", "Author": "AP28", "ReviewID": "UR104074693", "Content": "We pretty much chose to book at Novotel Barcelona based on the reviews we found here and the good deal we managed to get. Safe to say, we were not disappointed in the least. The hotel was really easy to find from the metro (which is really close by - like a 2 minute walk), and you can see it by looking for the building that resembles London's Gerkin (it;s right next to it). Across from the hotel is actually a shopping complex, which ranges from restaraunts, clothes, computer shops and supermarket (Carre Four). There is plenty here, and worth looking around, though it tends to house the bigger shops - H&M, Zara, Sub-Way etc. Check-in was very easy, and there is a very modern and swanky bar area that you can sit in as well. The receptionists also recommended us going to the top floor - you can get some amazing photos from the terrace, where you can actually see the tops of the Sagrada Familia. It's also worth coming here in the evening to get some unique photos of Barcelona. The rooms are absolutely lovely with a big flat screen tv, and plenty of English channels. The bathroom was also big and clean, though we did find it odd that there was no lock! The only tiny problem we had was that we asked to have our tea selection refilled after this was forgotten by the maid (who cleans daily), and this was actually forgotten by the receptionists. Upon asking again, the different receptionist apologised profusely and fixed this straight away. Like I said, it was a minor problem. The hotel, whilst not in the direct city centre, is very close to the metro, and it takes about 10 mins (or less depending on where you go) to get to the city centre and the main sites. If you've used the Underground in London, you'll be fine with the Metro. At check out, the manager also offered to look after our bags if we wanted to do some last minute sight-seeing, though we didn't take this up. All-in-all we've had a great stay here :-)", "Date": "April 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New Berlin", "Title": "“Nice Stay”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR102239115", "Content": "I enjoyed my stay at the Novotel Hotel. The continental breakfast was fantastic. The hotel was located very close to the subway for easy access to different areas of the city. The hotel did seem to be in a less touristic part of the city, which was both a pro and con.", "Date": "March 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Great location”", "Author": "FaberJ Posted by an Accorhotels.com traveler", "ReviewID": "UR101885758", "Content": "Arriving in Barca at the hotel late in the evening, first thing you is the beautiful Agbar Tower right next door. To make it better, after a day's work in Barcelona you see this view from the roof-top (small) gym. Look at bit to the right and you see the Sagrada Familia as well. All in all, a very clean hotel, with free fast WIFI (great if you are not only there for leisure) and good public transport options. And if you don't want the minibar drinks, there's a supermarket across the street.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“a great hotel and great location”", "Author": "skrooz", "ReviewID": "UR100406182", "Content": "I actually chose this hotel based on the great Trip Advisor rating. A lot of people rated it high and, I totally agree. The room was a good size for a traveller like me. The breakfast buffet was awesome! They had excellent service. I was impress that they had separate dining areas for families with children and that they have a playroom for kids. The location was great. It was about a block away from the metro station which was quite convenient. I like that it was away from the noise of the city. Also, the free wifi was a tremendous help in keeping in touch with my family.", "Date": "March 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“Very helpful staff- very clean hotel”", "Author": "gapyeartradge Posted by an Accorhotels.com traveler", "ReviewID": "UR98814377", "Content": "Although the hotel is located slightly away from the city centre, it was a fantastic place to stay and myself and my family thoroughly enjoyed our time there. The views from our window were impressive and the staff were so helpful. It was a shame we couldn't use the swimming pool as it is incredibly picturesque being located on the rooftop. Would thoroughly recommend it. Even the tour bus stops nearby. The only downside would be lack of restaurants nearby.", "Date": "March 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dublin", "Title": "“Great weekend in Barcelona”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR98692896", "Content": "We had a great holiday in Barcelona there are plenty of things to see and do. The Hotel is 5 mins walk from nearest metro station. The rooms were lovely however there was no bath only a shower in the bathroom. It is very easy to find the hotel because of the guerkin shaped building beside it. We did have an issue with bad service the first morning at breakfast but when this was brought to the Manager's attention it was rectified and the service greatly improved.", "Date": "March 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Great time had in Barca!!!”", "Author": "cicismum", "ReviewID": "UR98128657", "Content": "Stayed for 3 days with my Husband and 2 sons aged 8 and 11. Had one room on the 8th floor, good size, enough room for all the family. Rooms was very clean, coffee making facilities and great bathroom with shower. Didnt have breakfast so cant comment. Hotel Location was fab for us as didnt want to stay in the centre of Barcelona. The Hotel is very accessible by metro nearest station glories, tram which takes you to the Marina end of Barcelona and the bus, Number 7 goes from outside the hotel to near to placa de catalunya in the centre of Barca. Highly recommend buying a T10 card which means you can make 10 journeys on any mode of transport in the city and more than one family member can use the same card - saves a fortune!!! Opposite the hotel is a shopping centre containing a Carrefour were we bought food for lunch and drinks for in the room. There are restaurants and fast food places within the complex also. We would recommend Kurt and Gut for breakfast and evening meal and Farggi makes nice crepes and waffles!!! Any qquestions please ask.", "Date": "February 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bangkok", "Title": "“Good hotel for business”", "Author": "EakPhanunan", "ReviewID": "UR96382556", "Content": "+ We can checkin earlier at 11AM. That's wonderful for a guest that was just arrived by 15-hour flight. I could change my dress, take a shower and prepare for the upcoming meeting without having to do that in the lobby like before. + Location is great. Very close to metro station Glories. Opposite is a large shopping complex with Carrefour that you could stock your drinks/foods for the night. + Room is very clean and brand-new. I see no black spot or stain in the bathroom at all. Additional sofa bed is comfortable too. - Breakfast is the same every morning. But you should choose it anyway, as there's no convenience store in this city.", "Date": "February 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "champhol", "Title": "“very good”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR96134372", "Content": "good food, good staff, excellent position in town, safe and clean parking", "Date": "February 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Athens", "Title": "“All in order (goods/services) as expected!”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR95579398", "Content": "I used accorhotels.com to find and book a hotel at Barcelona, finally choosing Novotel Barcelona city. Staying at this hotel covered all expectations from check-in to check out!", "Date": "February 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Love this hotel and would definitely stay again”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR94710002", "Content": "Staff were professional and very helpful. Location was excellent - close to the Metro. Had a lovely view of the Akbar tower. Having Carrefour and Zara opposite the road adds to appeal...", "Date": "January 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Erzenhausen, Germany", "Title": "“Awesome stay”", "Author": "AFDerrick", "ReviewID": "UR94243820", "Content": "This hotel was great. We decided to stay here an additional night and the hotel staff was more than accomodating. The view from the roof was incredible unfortunately we did not notice it until our last night there. The breakfast was incredible. It was a little far from the subway but not too bad and right next to one of the sights of Barcelona, a big bullet shaped building that lights up at night. Would stay here again if I go back.", "Date": "January 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New Delhi", "Title": "“More than expectation”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR94041953", "Content": "New, modern hotel. Friendly staff, always forthcoming & eager to help. Clean, comfortable rooms, well lit & good amenities. Well located with restaurants & shopping at doorstep. Above average & exceeded my expectations. Would recommend for both business & holiday.", "Date": "January 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Well Located Novotel Hotel for Awesome Barcelona!!”", "Author": "osasako Posted by an Accorhotels.com traveler", "ReviewID": "UR92824022", "Content": "The hotel is a 5 minute walk from Gloria station with easy connection to Clot and into La Rambla. Fantastic shopping centre just across the road at Glories with Spanish fashion chains like Zara, Massimo Dutti, Mango, Berskhka and Pull and Bear. Free Wi-fi in the hotel, free use of computers. Excellent standard as always from a Novotel hotel.", "Date": "January 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "tyne and wear", "Title": "“Nice hotel. Shame about the service”", "Author": "strudledoodle", "ReviewID": "UR92478797", "Content": "I had 4 rooms booked for 9 nights and had made the booking 11months previously upon arrival I was informed that payment hadnt been taken from my card and would have to pay again,this was almost £3000 and as I called my card company they confirmed payment had been made in sept 2009 but as the hotel was delayed in opening the payment was lying dormant. Luckily I had enough spare credit and after 2 days of argueing I reluctantly repaid (claimed it back once home and Accor managed to trace original payment) My concern was what would have happened if I hadnt had the spare credit was with 8 adults and 4 children we would have been stuck in Barca with no where to stay so please please confirm with hotel prior to travelling that you have actually paid. Other than that the hotel itself was good,rooms quite small for families but big enough for a couple. Bathroom was lovely,huge shower and lots of space for toiletries. Windows in the room were floor to celing and had a great blackout blind. Breakfast in the bar area is great value 2.50euros for coffee and a pastry and kids eat free! it was so good we didnt bother with even trying the buffet breakfast, Pool is on the roof with stunning views across Barca right over to Montjuic and all across the sea front and right back to the gothic cathederal. Metro is only 200meters away and cheap as chips,we got the family pass with 70trips and still had spare when we left. there is also a tram that goes to the beach and right down avenue diagonal(pass can be used on that as well) there is free internet in the lobby which was great and also free wifi through out hotel. we ate in the main restaurant on our last nighth and had the set menu which was fantastic value we wished we had tried it earlier in our stay. There is a shopping centre across the road with a huge carrefour and having a decent fridge in the room we stocked up and all sorts of stuff. After the arguments over payment we found the reception staff were rather rude to us for the rest of the stay as they would do everything possible to not speak to us. House keeping staff were great altho 3 days the room was not cleaned by 5pm and we had to request it to be cleaned earlier. overall great location and good hotel but the reception staff need training in customer service and hopefully they have sorted out any further issues regarding payments", "Date": "January 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Singen, Germany", "Title": "“Best location”", "Author": "Hennyreinhardt", "ReviewID": "UR92323049", "Content": "We were family with 2 children, got a room in 10th floor. Negative : The room was smell (smoke) even we asked for a no smoking room and the sofabed was painfull. In the receptionist there were only 2 people to serve many guests in long queue. Positive : Located in central city, easy to get public transport, and opposites is a huge shooping centre. Very nice breakfast.", "Date": "January 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "schinveld", "Title": "“great value for price”", "Author": "asmeeth", "ReviewID": "UR91312588", "Content": "we enjoyed our stay at this Novotel. The staff at the reception was friendly and helpfull, and the rooms are modern and clean. We would definitely stay here again. From the airport we took the train/metro (train to Clot/metro to Glories) on a T-10 ticket (7.95 Euro) for the 4 of us, with 6 tickets to spare !!! The shopping mall across the street has lots of shops, a large supermarket and several restaurants.", "Date": "January 1, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Very good hotel....”", "Author": "bmalhado", "ReviewID": "UR90536781", "Content": "Excellent hotel with very good localization near the metro...", "Date": "December 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“Shame about paper cups and coffee supply”", "Author": "BobbyS_11 Posted by an Accorhotels.com traveler", "ReviewID": "UR90396447", "Content": "This is a good(could be great hotel) easy to get to from Glories Metro (MAX 5MINS) easy to all areas massive shopping complex across the road ideal for the wife while I was doing other things.(Sleeping)METRO is so easy T10 ticket MAKES TRAVELLING so simple in BARCA 1.60 EURO from airport to hotel and 5mins later than the taxi other people took 30e with tip.I WOULD STAY AGAIN NO PROBLEM AT THE RIGHT PRICE,we paid 55e per night for this it was a superb hotel.Bobby S PLYMOUTH", "Date": "December 21, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "4", "Rooms": "1", "Location": "3"}, "AuthorLocation": "london", "Title": "“Could be Faulty Towers in Spain!”", "Author": "mansmanreality", "ReviewID": "UR89950245", "Content": "So we knew a lot about Novotel as the old brnad was appauling but the new design hotels have a lot to offer. Or so we thought. We had stayed previously at Novotel in the City of London and had a wonderfully quiet and relaxing overnight stay. The rooms standards were so much higher than the old room stock and the mattress, pillow and bedding offerings were fantsastic. Barcelona City was the opposite! Having booked we contacted the hotel by emailto understand a little bit more about how to get to the location. No real help was provided except they copied the confusing information form the internet that we had already seen. We email the hotel 3 days before our outbound flight to ask about early check in and late check out. They only responded after a reminder email on the evening before the flight and expecting us to pay 50% of the rate for the early arrival and 50% of the late stay. A real rip off. We flew at 0625! At check in we were 'told' that we need to sign a security form that was not in English and the receptionsit who wore a badge showing that she spoke English - though couldnt - could not explain what this was for. Apparently it is a police requirement though heaven knows why they cant have a translated version of it to assist guests who dont usually sign without understanding a legal document. This hotel boasts free high speed wifi internet in the room though this wasnt working and the external 'support' department were unavailable to resolve the issues. SO Room 1 had no internet and no bath. Room 2 had no internet and a broken sink Room 3 - this is when we started to take pictures - was apparently a suite, had no internet, smelt of damp and had a big leak coming through the bathroom ceiling Room 4 had no internet and the aircon was broken. This room also had 'fudge' stains to the toilet floor, a broken bath mixer tap, electrical lighting cabling hanging from the bathroom mirror and 'residue' stains to the toilet walls. Look at our pictures. Ironically at check out they did not suggest a discount of any kind until I impressed on the front office manager that we would not be paying the full bill. I thought this was a real cheek. There were 2 things to praise though. Again the bedding and mattress. The best I have found anywhere and the breakfast offering. Though noone paid any attenion to any of the guests needs at breakfest the offering was great. Surprisingly i paid the only compliment at check out to the breakfast offering and it was immediately refunded! It strike us that this hotel is very badly run, most staff (a couple were really lovely) have an appauling attitude, the general manager was always 'unavailable' and there is a noticable absence of any satisfactory maintenance program. Couple this with the rather arrogant suggestion that you would pay an extra 50% of a daily rate to stay and extra 2 hours it surely means a place to avoid....................... Shame really because if this hotel have the managers it needed, the right attitude and the honesty to respect its guests it could be a great place to stay. Our advice, unless you want an argument, attitude, lack of attention and a restless stay, your money it better spent elsewhere. Enjoy Barcelona! Having b", "Date": "December 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Montreal, Canada", "Title": "“Nice but a little far from the city center”", "Author": "Traveller12311", "ReviewID": "UR89687241", "Content": "Nice new hotel, nice rooms and good service. However the hotel was a bit far from the city and not entirely in the best area. Very nice rooftop pool!", "Date": "December 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Espoo", "Title": "“Good stay”", "Author": "Alexhell77 Posted by an Accorhotels.com traveler", "ReviewID": "UR89234981", "Content": "Everything was fine. One room service dude was not able to speak English but the rest of the personal did good. Internet in the room is wireless and with password. No cable. With all these, nothing to complain. Relaxing and pleasant stay.", "Date": "December 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Canada", "Title": "“Beautiful View”", "Author": "Teresa055", "ReviewID": "UR88390553", "Content": "Maybe not the greatest location. There is a good mall nearby and the metro isn't too far. You don't really get an authentic Barcelona feel in the area. However, it is a very good value for the nice new room. It had more amenities then any other European hotel we stayed in during our trip. It had instant coffee and a tea kettle which was rare on our trip. The roof top pool was a plus since we were there in the summer. The views are amazing. The negative which previous views have stated are the long elevator wait times...which I think is pretty minor.", "Date": "November 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "cork", "Title": "“Great Hotel”", "Author": "jackjerko Posted by an Accorhotels.com traveler", "ReviewID": "UR88138294", "Content": "found hotel quite close to trams and metro also very conveient to city centre attractions", "Date": "November 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Jubail", "Title": "“not a novotel as I know”", "Author": "Ammori Posted by an Accorhotels.com traveler", "ReviewID": "UR87638642", "Content": "first, the idea of saving mony by not hiring a bill boy to carry customers luggage is giving a bad impression of what the service would be. second, there was no clothes cabin in the room, only a bar next to the room door to hang the clothes on which make my room always messy. I like the idea of free internet and the bar and reciption employees are perfect. I recommend fixing hose of water next to the cabinet in WC belive me its good idea.", "Date": "November 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "cardiff", "Title": "“Good Hotel”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR87488170", "Content": "Good Hotel. Good location for shopping, seeing the sights & business. As there are good restaurents near by probably best not to eat in the hotel", "Date": "November 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Niteroi, RJ", "Title": "“Good hotel”", "Author": "asbarreto", "ReviewID": "UR86924077", "Content": "Rooms are comfortable and new. The view from our room was amazing (18th floor). It is not near the main tourist attractions, but there is a metro station really near, so it is not a problem. There is also a great commercial center in front of the hotel, with lots of restaurants, movies and also a supermarket. There are several breakfast options, but i don´t recommend since they can all be considered expensive. A much better option is to have your breakfast at the commercial center. I had some problems with the room service too, because they simply didnt answer the phone. The pool on the terrace was also not avaibale. Free internet was great. So, its not perfect, but its ok.", "Date": "November 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Solihull", "Title": "“A good stay”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR86755534", "Content": "The only problem we experienced was locating the hotel - not yet on my navigator and no sign at street level so we drove past it twice. Excellent room, friendly staff, good food. A good walk from the city centre - great for the tram and metro. Will stay again", "Date": "November 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Grand Cayman", "Title": "“Location, Service, Maintenance- a disappointment”", "Author": "Leandraky", "ReviewID": "UR86388648", "Content": "I wasn't going to publish a review until I heard back from Novotel HQ (it would only be fair to share their professional response as well) but to my surprise I didn't receive a response, so I figured I'd share my letter to HQ without a satisfactory response and announce that without a reply we have decided never to stay in a Novotel property again. We just returned from our short stay at Novotel Barcelona City and I would like to bring to your attention our dissatisfactory experience. Upon our late night arrival, we were greeted by a kind gentleman at front desk. He acknowledged our anniversary and that our room had a nice view of the city. When we arrived to our room on the 17th floor our door would not open, we had to go back down and request assistance to which someone from the engineering dept. assisted with the jammed door. In preparation for bed after a long day of travel, we noticed the bathroom sink drain was clogged and left a dirty residue. We did not report this immediately; we just wanted to go to bed. In the morning beginning at 9am and every thirty minutes thereafter, our slumber was interrupted by housekeeping barging into our room twice without knocking . We put the Do Not Disturb sign on the door and the third and fourth time they did knock before invading. By then we decided to get up and leave to allow your housekeeping to clean as our patience (and housekeeping's) were running thin. In the rush, we did not report our clogged sink which remained clogged for the rest of the day. After a long day of touring the city, we returned from our ventures and requested a late check out. The late check out was kindly granted until 2:00pm. We enjoyed our early morning site-seeing and returned to our hotel room at 1:30pm for a quick shower and to retrieve our things. A housekeeper greeted us in our room with “You were supposed to check out today.” I explained to her we had a late check out at 2:00pm. She left all her things in our room and left to investigate this herself. Waiting for her to return, we ended up removing her cleaning trolley from our room to shut the door. Promptly at 2:04pm as we were about to leave feeling angry and agitated from the constant interruptions during our anniversary weekend, we were once again summoned to the door by your housekeeping staff requesting our departure. The sink remained clogged. A minor problem such as a clogged sink, a jammed door, or an accidental invasion by housekeeping is unfortunately quite common when traveling, however we resided in your hotel for less than 48 hours and we experienced all of this problems, the last being of highest severity. The likelihood that we will recommend a Novotel property after our weekend is extremely unlikely. I hope to hear a response from management in regards to our weekend stay. Residing in North America, I've heard of this hotel chain before and from online reviews I expected more from Novotel; not only do we read these reviews, we also contribute our own. I look forward to hearing from you, And P.S Tripadvior, the pool was disgusting and dirty with litter and sludge floating on the top.", "Date": "November 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Weymouth", "Title": "“Great Stay at the Novotel Barcelona City”", "Author": "mjcmoppel", "ReviewID": "UR85839329", "Content": "Spent 5 nights on a leisure break with wife and teenage daughter. Staff were very friendly and helpful - maps, transport, wifi code for my daughter's iphone etc. Great views from the hotel and a very good quality breakfast. Opened in April 2010, the hotel is really nice and in a good location for the Noblenou Rambla nearby which is a nice area for a drink and meal.", "Date": "November 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "UK", "Title": "“Excellent rooms”", "Author": "unspecified", "ReviewID": "UR84675128", "Content": "The best part of this hotel is the rooms and decor. You're greeted with a very pleasant, modern lobby and the rooms are just as pleasant. Huge room with sofa, desk, king size bed, tea making facilities and lots of space. The bathroom is also huge and well-furnished, and everything is spotlessly clean. A really nice environment for resting - being a business district it is very peaceful at night, too. There are a few small negatives, however: the location isn't great, it's just a little bit far out of town, although the metro is reasonably close by and the Sagrada Familia is within easy walking distance. The breakfast buffet is not good value for the money - the selection is surprisingly poor, although the Novotel offers a cheap \"express\" breakfast at the bar which is much better value. Finally, the Internet connection is very slow (but at least it's free). All in all, however, this is an excellent hotel and I'd have no concerns about recommending it to anyone.", "Date": "October 24, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Bursa, Turkey", "Title": "“Average Hotel with High price”", "Author": "sayuri399 Posted by an Accorhotels.com traveler", "ReviewID": "UR83686778", "Content": "At first side, you will like hotel. But, inside everything in the room is broken or dirty. There is a noise, when you try to move in the bed. Carpet and sheets are dirty. No slipper. There is just one small window with apartment side, so there is really small amount of sun light at the room. Moreover during check-in, I came like 11 am at the hotel. I told them I had indirect flight, and did not sleep at night. But, they did not make an favor and give my room like 2 pm. Although there is no need of payment during check-in, they want me to do payment to get the room!! (I did my reservation with credit card, so they have guaranty). Breakfast is not suitable for a vegetarian. They just have variety of sausage. small amount of cheese and other products. no olives in barcelona!! The only thing that I loved about hotel is location!!!", "Date": "October 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "", "Title": "“Good value and transport links”", "Author": "Bmena", "ReviewID": "UR83630047", "Content": "It is easy to get from Barcelona airport to Clot Arago station. It is then only one metro stop back to Glories Metro which is an easy walk from the Novotel. The cheapest way to do this is on a T-10 ticket which will also work for the tram outside the hotel to go to the beach. Our room was clean and spacious and with a cracker view of Torre Agar. For the price we paid the value was superb. Check in and out were both effeciently completed and reception staff were pleasant any time we spoke to them. As a very light sleeper I was delighted with how quiet and well sound proofed our room was and the air conditioning was the quietest I have come across. The only negative was the bad smells near the lifts at reception and on the roof. Even allowing for Spanish drains this was off putting. It is worth noting the pool is seasonal only and was closed when we were there..", "Date": "October 15, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "wigan", "Title": "“Good hotel, good location - recommended”", "Author": "nicksys", "ReviewID": "UR83437216", "Content": "Stayed at Novotel Barcelona City having booked it at best price on laterooms.com. Arrived at 12 as advised for 1 night as cruising the next day. The room wasnt ready but they v happily help luggage till later. Although not ideal - the service was good. 15 min walk to sagrida familia and the metro and tram are v close by - esp the metro! The room itself was excellent, roomy and 4star quality. The piece de resistence is the pool and views and bar on the top floor - wow! 270 degree views of the city and most importantly the sea, harbour, familla sagrida. When walking out and about - look for the 'torpedo' building that is lit up at night - its next to the hotel so helps with navigation! Didnt use the restaurant or breakfast facility but the kids liked the free internet. The lobby area also was excellent.", "Date": "October 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Akureyri, Iceland", "Title": "“Excellent hotel”", "Author": "Helgi60", "ReviewID": "UR83283808", "Content": "It's been a while since I've stayed at a Novotel. I liked it then and I liked it now. The hotel is very nice and clean, the service excellent, the room perfect. Everything in good working order. The service at the restaurant was a bit slow the only time I dined there, but the breakfast was excellent. The location is not bad as there are plenty of shops and restaurants just across the street and the subway station is not far away. I hadn't meant to stay at the Novotel, but there was no room at the neighbouring Ibis, so I decided to upgrade. I don't regret it.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sao Paulo", "Title": "“Good brand new hotel, but free internet access not fast enough for VPN connections”", "Author": "RBRSaoPaulo", "ReviewID": "UR82804070", "Content": "I have stayed at this hotel recently and they have free internet access (Wi-Fi). If you are going to use only the internet, the speed of connection is fast enough. On the other hand, if you need to establish a VPN connection with your company, the speed of connection is quite slow. I requested a faster connection option (even if it was necessary to pay), but they did not have it. My suggestion to the hotel is that they look for this alternative, otherwise, business people may prefer other hotels. I would not stay there again if a faster connection does not become available. Good facts about this hotel: restaurant (fantastic food !!), cleanliness, new Points to improve: internet connection speed, add a curtain or a door to the box (otherwise, water from the shower spills out of the box - as it does not have a door).", "Date": "October 10, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Mtl, Canada", "Title": "“Great hotel to visit Barcelona!”", "Author": "MarcRoy", "ReviewID": "UR80011995", "Content": "Our stay at the Novotel Barcelona City was great. Below are my pros and cons of this hotel. Pros: - Price: good value for the price we paid (approx 130 euros per night) - Brand new hotel with nice rooms - Shopping mall accross the street with supermarket and plenty of restaurants - Nice pool on the top floor - FREE WIFI!! - The Clavaria restaurant in the hotel is actually quite good! - The hotel is one block away from Torre Agbar (see pics) Cons: - To visit Barcelona, you will need to take the Metro station every time but Playa Catalunya is just 3 stops away. - Modern rooms but not practical..no alarm clock, AC plug in the bathroom... - Service is just ok. Small details like no printer working in all 3 internet stations. And don't start with special requests....you can gorget it... I would definitely recommend this hotel for anyone who wants to visit Barcelona but does not want to pay high prices asked for Las Ramblas district.", "Date": "September 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "York, United Kingdom", "Title": "“Good Value, Handy Location, Good Facilities but Service could be better”", "Author": "MattyB93", "ReviewID": "UR78982959", "Content": "I booked this hotel for a week for me and my family (Wife and two children 7yrs and 9yrs) we had visited Barcelona before so knew roughly the location. It is a little out of the main area but is only a long walk or five minutes on the metro or tram, there are stations for both just outside. That said there are of plenty of things nearby (resturants, a shopping mall). The hotel is a typical 'chain' hotel which is fine as you know what to expect at the price you pay (lets be honest you can pick these type of hotels up for a decent price if you book indvance) The place was clean, modern and had what you expect, however the really plus point was the roof top swimming pool, terrace and gym. This was great and meant we could chill out by the pool before going sight seeing, this is great if you have kids of any age. The views from the pool are great too, you can see pretty much all of the city and the sea. The area around the hotel is very modern and alot of development is going on so there is building work going on, although this didn't impact on us at all. The downsides are the service is a little disapointing, we had to keep asking for things like an extra pillow (several calls and trips to reception) and on our last day we had to que for 20 minutes to get breakfast (prior to this they had two area's for breakfast on the ground floor and lower ground) but for some reason they closed the lower one on our last day. So in all it is generally good and I would go back, but if you are very demanding and expect things when you click your fingers give it a miss (or chill out a bit and think about how much you have paid)", "Date": "September 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens", "Title": "“Just perfect city hotel”", "Author": "ifd", "ReviewID": "UR78757802", "Content": "Just perfect city hotel. Great location, very easy to go around the city as there are tram and metro stations and the tourist buses are passing just in front of the hotel the whole day and there is a big shopping centre just opossite the hotel. We had a wonderful view of the city as we stayed at the 16th floor. Fantastic roof garden with restaurant and pool.The restaurant at the ground floor was very good and the breadfast also.The receptionists were very helpful.", "Date": "September 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Lisbon", "Title": "“Good hotel, but beware with the pickpockets”", "Author": "LisbonTravel", "ReviewID": "UR77157426", "Content": "Excellent hotel and a good service, but pay very atention to the pickpockets at the Glòries metro station and at the Glòries comercial center. The city of Barcelona it is not handling very well with the pickpockets problem.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "DonaldG", "Title": "“Excellent Value for money”", "Author": "DonaldG_9", "ReviewID": "UR74749581", "Content": "I stayed here for 3 nights with my wife and daughter aged 9. This is a new hotel and is spacious, modern and clean. Our room was on the 17th floor was equipped with flat screen tv, minibar, large bed (also a sofa bed), air conditioning, electric blinds and a speaker system in the bathroom - so you could listen to tv while in the toilet! The public areas are very nice, comfotable chairs and sofas in reception, free internet terminals, a kids play area plus the rooftop bar and pool was very plush and offered great views of the city. The location is not within walking distance of any tourist spots or near a Bus Turistic stop, however a Metro station is only 5 minutes walk away which is on the line for Placa Cataluna and Placa Espayna. There is a shopping mall across the road, which is handy for fast food outlets and the supermarket for other essentials. Taxi fare were 40 Euros to the Airport and 20 Euros from the Cruise Terminal. Minus points - reception was always busy, so checking in and out took a while. Staff although friendly seemed a bit disorganised. Also the hotel rooms are on Floors 7 to 18, and there is only 3 smallish lifts - sometimes it took a while to wait on an empty elevator - especially if you were carrying suitcases. Overall for what we paid (100 euro per night), this hotel represented excellent value for money.", "Date": "August 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Moita, Portugal", "Title": "“Good Hotel”", "Author": "booLisbon", "ReviewID": "UR73004436", "Content": "I've stayed in Novotel Barcelona City for 5 nights with my husband and children (10 and 5). Good price, children didn't pay. A good buffet breakfast included on the rate. Free internet. Amusement areas for children. Pool in the roof with an outstanding view over Barcelona, very secure. jaccuzi was being repaired. We went and visited Barcelona by car, marvelous GPS ;-) the hotel was well located, always a free parking place in the neighborhood.", "Date": "July 30, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Peachtree City, Georgia", "Title": "“good location for metro & bus but not within walking distance of most tourist attractions”", "Author": "bbeerbower", "ReviewID": "UR72069986", "Content": "This is my second trip to Barcelona for vacation. I love this city as it is so full of life and so much to see. My most recent stay was June 2010 with my extended family of 10 including children ages 10-14. We stayed here 4 days prior to going on a cruise. Barcelona is a city that seems to fill all of its rooms on the weekends so if you are planning a trip to Barcelona on the weekend, I'd reserve your hotel well in advance. The Novotel Barcelona City is a fairly new hotel in a good location. There is an older mall across the street with average restaurants, Starbucks and a grocery store (lower level with dept store upper level). The entire area is being renovated. The metro is 2 blocks-there is major road construction @ Glories on the way to metro. There is a bus stop across from hotel. I ate an evening meal at the hotel restaurant which was quite good and reasonably priced. Breakfast was expensive so I elected to eat at the mall. Rooms were clean & beds comfortable. There is an enclosed pool on top floor with a nice city view which the children enjoyed. The service at this hotel is below average for a business hotel. Novotel usually has fairly good business hotels but this one lacked the expected service. Check in and out was slow and the staff seemed very confused. Even though the staff spoke English, I felt that they really didn't understand what I was saying. There were many different nationalities and I got the impression that they didn't understand each other either. Maybe because this hotel just opened, but there seemed to be a noticible problem with the service and with employees knowing their jobs. The rates were good and this was one of the few hotels that had family rooms that could accommodate our large party near the city center. The other hotel we stayed in was the Hilton Diagonal Mar which was also a very nice hotel but further away from the city center near the beach. It was also more expensive. bbeerbower", "Date": "July 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“Good rooms but bad service”", "Author": "Fish0072", "ReviewID": "UR71071181", "Content": "We stayed at the Novotel Barcelona City for 3 nights on holiday through Spain. As the hotel is new the facilities and rooms were of a good standard and comfortable. The main problem we experienced was the level of service at the hotel, whether this is due to poorly trained staff (as the hotel is new) or other reasons, it was disappointing as the hotel is a great product and I am the type of traveler that would rate good service over the amenity and 'newness' of a room. While breakfast was included in our rate it was quite frankly, a joke. The staff on arrival were very dis-organised and on one morning had to line up for 20 minutes just to be seated! We thought this was because the hotel was very busy and there were not enough tables, but once we did get into the dining area a number of tables were empty or just not cleared which reflected poorly managed and trained staff in clearing the tables and the staff in seating the guests. Once we did get seated there was no offer of tea or coffee and on most occasions had to request it myself. The food also was very average. On check in we were offered no information either about the hotel facilities or Barcelona itself, the reception staff equally seemed very badly managed and trained, this included most nights returning to the hotel and not even being greeted by reception staff (some of which preferred to stand next to the main door smoking) Don't they realise how bad this looks for your hotel? At the time we stayed and as it is a Novotel feature they were offering great rates for families and children so this resulted in lots of children! So got a bit tiring dealing with kids playing in lifts, running through the lobby and pushing you out of the way at breakfast. So if you want a hotel that doesn't value service I would recommend this otherwise stay away! Lift your game Novotel, I stay in many hotels across the world and a friendly smile and simple greetings and good service go a long way above groovy furnishings in a great stay for your guests!", "Date": "July 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Good quality”", "Author": "AnitaBrazil", "ReviewID": "UR70434978", "Content": "It's pretty standard Novotel, i.e. you'll find there what you expect of a Novotel. The location might not be the best for tourists, as it isn't that central, but it is very easy to reach other areas through subway (L1) or cab (which is very cheap in Barcelona). The rooms are spacious and clean, the bed is comfortable. The breakfest is good, although nothing special - if not part of the rate I'd suggest going to Starbucks in Les Glories (mall across the street) or at the bar, but not taking the buffet. On the 19th floor they have a bar, fitness and swimming pool. It is a very small swimming pool and the bar could be better, taking the advantage of the wonderful view.", "Date": "July 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Serres, Greece", "Title": "“\"One of the best hotels I've ever been\"”", "Author": "ippok", "ReviewID": "UR69413045", "Content": "I spent three days in this modern hotel with my family, and everything was perfect. Large room and bathroom, clean hotel, good service, kind people. Also, very good and varied breakfast: Variety of coffee, fruits, sweets etc. certainly deserve more than 15 euros for it. Best value for money......", "Date": "July 2, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "New Delhi", "Title": "“Nice, comfortable hotel - but a bit far from the fun parts of the city!”", "Author": "NSethi", "ReviewID": "UR69226991", "Content": "This hotel is located in a new part of town, so it's a little far from the fun parts of the city. We didn't head to a club or a bar at times as we got too lazy to walk some distance to take the metro. The rooms are nice, they gave us one on the 18th floor with a great view of the city, but the service is so-so. Also, the breakfast is avoidable.", "Date": "June 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Halifax, Canada", "Title": "“Great stay, love this hotel”", "Author": "dartmouthgirl", "ReviewID": "UR67532242", "Content": "We spent two great nights at the Novotel Barcelona City in June, before embarking on a cruise. The hotel just opened in March/10 so there weren't many reviewes when we booked but we got a great rate. What a wonderfully pleasant surprise. The hotel is positioned as a business hotel, but is quite family-friendly. We had a triple room: a queen-sized bed plus fold-out couch for our daughter who is six. Breakfast at the bar was 3 euros for a coffee and pastry. Free internet in the lobby + free wireless in the room (slow, but free). Best feature: an incredible rooftop pool and bar with stunning views over Barcelona. Incredible. The pool wasn't listed on the hotel website when we booked, so perhaps it's new. The room had English TV channels, a minbar and great tub. Location is great: on the Avenida Diagonal within 3 minutes walk of the Glories subway station. It's also across the street from a tram stop AND a shopping mall. There's a Carrefour grocery store in the mall: great place to grab a baguette and bottle of wine.", "Date": "June 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Excellent hotel, very family friendly”", "Author": "Pat-DL", "ReviewID": "UR66791380", "Content": "Spent 3 nights in hotel, 2 adults and 2 kids (11 & 9) in a family room. Found it difficult to get hotel in Barcelona that would easily cater for 2+2 in one room and was very happy with the Novotel city. Second bed was a sofa fold-out that was fine for the kids. Room was very comfortable and quiet - the power shower was brilliant! . Breakfast was excellent - lots of choice of pastries, fruit, and a cook to do eggs whatever ever way you wanted. We ate dinner in the restaurant one night and found it to be Top Rate, and much better vakue than the places we ate at La Ramblas. Close to the restaurant is a little playroom with a few toys for young kids and a couple of X-boxes for the older ones - small touch but kept ours happy while we finished our meal. Is a new hotel, which has pros and cons - very clean, top floor looks great though pool wasn't open till end May. Some of the staff a bit clueless, but all were good natured and helpful. Main hiccup was when we got stuck in the lift for 10 mins, but help was at hand quickly and of course the cultural hotspots of Barcelina were forgotten when our kids phoned home - \"we got stuck in a lift!\" seems to be the highlight of the trip for them. Location is beside the Torre Agbar (Gherkin tower) which meant it is easily located from pretty much anywh isere in the city. We got a taxi direct from Barca airport which cost €35 (€10 of which was for 3 bags). It is a 5 min walk from Glories metro station, where we never had to wait more than 3 minutes to catch a train. Across the road from a large shopping centre with plenty of shops and restaurants. Quieter location than La Ramblas, no sense of atmosphere around the streets (and less chance of pockets picked). Overall, delighted with the hotel - would definitely stay there again next time, whether on our own or with the kids.", "Date": "June 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Fuengirola, Spain", "Title": "“Good Stay...”", "Author": "Narathip", "ReviewID": "UR66475719", "Content": "It's one of the new nice clean and smart 4 stars hotels in Barcelona. The hotel location is a little out of Barcelona centre like La Rambla and Catalunya Square, but within easy reach of the metro (L1 (Red Line) Glories Station) back to the centre. They also have a nice restaurant serving breakfast, lunch and dinner for the reasonable price and just opposite the hotel is a big shopping centre and supermarket which is really convenient. We really recommend this Novotel Hotel for a short break in Barcelona to everyone.", "Date": "June 4, 2010"}], "HotelInfo": {"Name": "Novotel Barcelona City", "HotelURL": "/ShowUserReviews-g187497-d1532202-Reviews-Novotel_Barcelona_City-Barcelona_Catalonia.html", "Price": "$124 - $242*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Avenida Diagonal 201</span> | <span class=\"extended-address\">(entrada por calle Granada)</span>, <span class=\"locality\"><span property=\"v:postal-code\">08018</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "1532202", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/6a/bc/6abc9f72b611e2d97d2a3ac347e5cfc96large.jpg"}}