{"Reviews": [{"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "1.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Seems to have it all, but ...”", "Author": "IsraeliCouple", "ReviewID": "UR115770461", "Content": "We came to Mexico city only for one night to catch the flight back home. We pre-booked it using an agency and hoped for a good place for our last day. We were quite disappointed. We booked a double room, with private bathroom, TV and AC, but we got ... A TV without any single English speaking channel (though we scanned). The AC was a standing movable one which was more of a fan then AC. The internet didn't work (one of the crew helped us and call to confirm the flight details). We ate lunch in the restaurant, it was a 3 course meal but it was served a bit cold. The quality was ok, but not suitable for an hotel. The breakfast wasn't that good either. The better sides are a helpful and kind crew and a very good location, just a walk away from the main historical zone. All in all, we expected a much better place (and didnt mind paying). The place itself is an old hotel and its standards are low. We wouldn't have stayed there more then a night.", "Date": "July 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "bc", "Title": "“Do not stay there, the worst place we ever stayed in in Mexico”", "Author": "roperanna7", "ReviewID": "UR101263002", "Content": "Rooms looked ok, but closer inspection showed, dirty bedspreads, antique towels, plug ins that did not work., switches missing for lights, No hot water during the day,and sometimes just tepid in the evening.The breakfast was palatable but inconsistent. There was one awesome waiter who did whatever he could for us and it was a pleasure to leave him a big tip.He deserved it after running the restaurant single handed.and providing good service. Rude front desk people in the evening. The location was amazing right in the centro. In otherwords spend a little more and get a nicer place and do not book this place sight unseen like we did. The rooms are listed at 90 dollars a night but we paid 50 and glad we did.", "Date": "March 23, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Rio de Janeiro, Brazil", "Title": "“Awful hotel but in a good location”", "Author": "julie_0301", "ReviewID": "UR45412079", "Content": "The location is great, the rooms are small, with cockroaches and they only have rooms with bathtub. I went with my mother and she had problems going into the shower because of the tub, so I asked for a room without the tub and they said they don’t have! So I asked for a room for disable people and guest what they don’t have as well (isn’t it the law?) The Continental Breakfast is just like the hotel… awful don’t pay the hotel with it. If you don’t drink cafe or orange juices just like me forget! They don’t have anything else. Also, if you choose for a fruit you don’t get the juice. The toasts are made in a dirty plate so it has a terrible taste!! After the first breakfast there I started going to 7-eleven to buy chocolate and donuts. The staffs, mostly, are nice and willing to help you. I had problems with the morning receptionist but except for her, I didn’t have problems. They claimed to have parking and cable TV. Well they don’t! I needed parking twice and both times I was told it was full. The cable was out because I don’t know what…", "Date": "September 29, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Taiwan", "Title": "“very bad.”", "Author": "discovery1982dna", "ReviewID": "UR26648171", "Content": "my frined and me stayed there for 2 nights and found another much better hotel around the metro station. the room is not clean and very old. no internet and you need to go out to find a internet coffee. I asked them for replacing a broken chair in my room and they said yes then forgot. the breakfast is bread and juice only. The waiter asked us tips in Spanish and interrupted our conversation. the waiter didn't speak English and hinder us from asking someone to translate. It was a real hassle. location is good but you can find other hotels near by the metro. it cost me a whole morning to find other near by hotel and moved out.", "Date": "March 23, 2009"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "4", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Wyoming, Michigan", "Title": "“rooms were clean”", "Author": "A TripAdvisor Member", "ReviewID": "UR4627407", "Content": "The lobby is the best part of the hotel, you can tell that once this hotel was very luxurious. The rooms are very old and need major work. We stayed at the hotel for 2 days and nights and I had trouble breathing because of the sewer gases that entered the hotel through the air conditioner. But then again, you smell the sewer in all the historic district of Mexico City. I would not stay there again and do not recommed it.", "Date": "March 16, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "3"}, "AuthorLocation": "St. Paul, MN", "Title": "“For Travellers ...Not Tourists....”", "Author": "A TripAdvisor Member", "ReviewID": "UR4560604", "Content": "If you want to be part of the Mexico City scene, then the Ambassador Hotel is for you. Clean and reasonable, friendly staff, and a bar that is right out of the movie set of Casablanca. \"Old world\" comfort. This is a hotel for travellers, not tourists. If you enjoy immersing yourself in the culture that you are visiting, then the Hotel Ambassador is a great place to stay. If you want to be an American with Americans, than stay at the Sheraton.", "Date": "February 28, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Guaynabo, Puerto Rico", "Title": "“Not great, not bad... do not stay for comfort”", "Author": "Cooberson", "ReviewID": "UR2862739", "Content": "I just went this past weekend (26-28 nov 2004)... and found the hotel kind of old. I think 4 stars in Mexico are 3 anywhere else. The look of the hotel is antique... and kind of messed. No air conditioner (they do have, but only the fan worked). We changed rooms, lookin' for one w/ a working a/c, but there were none. The location of it is superb... in front of Alameda park, right on Juarez street, a couple of blocks from Centro Historico. it's close to Reforma, where you can go to Chapultepec park and Museum of Antropolgy. I,ts located next to a Fiesta Inn, a mall and cinema complex.... that made my trip worth thewhile, but don't stay in this hotel looking for comfort... Oh... the T.V.'s had a few cable channels a couple of hours in the night! Yep, that kind of hotel.", "Date": "December 4, 2004"}], "HotelInfo": {"Name": "Hotel Ambassador", "HotelURL": "/ShowUserReviews-g150800-d154645-Reviews-Hotel_Ambassador-Mexico_City_Central_Mexico_and_Gulf_Coast.html", "Price": "$333 - $500*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Humbolt 38, Centro Historico</span>, <span class=\"locality\"><span property=\"v:locality\">Mexico City</span> <span property=\"v:postal-code\">06050</span></span>, <span class=\"country-name\" property=\"v:country-name\">Mexico</span> </span> </span> </address>", "HotelID": "154645", "ImgURL": ""}}