{"Reviews": [{"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "2.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Salida", "Title": "“NOT a good idea!”", "Author": "MzMurf", "ReviewID": "UR116385157", "Content": "The ad on the Best Western website said there was shuttle service from the airport. When we finally found how to call from the airport, we were told that we had no resevation, even though we had a confirmation number in hand. When my husband asked (after having to get the mananger) to have a shuttle pick us up anyway and we would settle it when we got there, we were told that there was no driver available (around 3 pm) and we would have to take a taxi. So, 210 pesos later (around $20), we arrived to more denials of our resevation and then finally it was miraculously found. The room was decent but when we went to the restaurant for dinner, it was so empty we couldn't even find a cook. Finally someone came and assured us that the restaurant was open (at 7 pm.) We left, no feeling too secure about that! The next day we asked for a shuttle to the airport and were told there was none but we could get a taxi for 120 pesos! We asked for a large, authorized taxi since that is what the sign all over the airport says, and a small, unmarked car came for us. My husband refused it and then a large, unmarked van came. The hotel assured us it was OK, he works for us. Over my husband's objections, we took the van, which was now 140 pesos! We got to the airport OK but the drive was somewhat harrowing. I would not recommend this hotel. We thought the BW name would assure some security and familiarity, but not so!", "Date": "August 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "5", "Location": "1"}, "AuthorLocation": "Amsterdam", "Title": "“good hotel but far away”", "Author": "AmsterdamPeter", "ReviewID": "UR94246789", "Content": "this standard Best Western hotel is oke of course, but be aware that the hotel is 45 min. walk from the Zocalo (Central Square) and 30 min walk from the nearest Metrostation (with bad connections). The hotel lies in a unattractive neighbourhood and is only interesting for large tourgroups.", "Date": "January 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Tampico, Mexico", "Title": "“Very good service...as always”", "Author": "Lilitu71", "ReviewID": "UR74477011", "Content": "This is the fourth time we stayed at this hotel, and their service remains as good as always. Clean rooms, clean bathrooms, nice amenities, restaurant ok, very friendly and helpful staff, no noise, free of cigar smoke, etc. Its located 7 blocks from Juarez Avenue, one of the main avenues of the city, and near Balderas and Juarez metro stations. My only complain, the internet connection...very poor most of the times, we needed to go downstairs to the reception area in order to get good signal.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Hastings", "Title": "“Great hotel - about 20 years out of date”", "Author": "judrop500", "ReviewID": "UR50101134", "Content": "We were upgraded to a suite at this hotel for our honeymoon. It was huge and had a fully operational jacuzzi, but the furnishings dated back to the 1980s, and it is in grave need of a makeover. Make sure you top up your Spanish before you go as very few of the staff, though pleasant, speak English.", "Date": "November 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Austraila", "Title": "“handy, clean and a reasonable price”", "Author": "teemacAustraila", "ReviewID": "UR46970878", "Content": "this hotel is situated in the historico center of town, close to all the attractions, the service and staff were great, free wireless, aircon and breakfast included", "Date": "October 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "St Louis Missouri", "Title": "“Awesome Place to Stay ~ Very Large Nice Rooms ~ Great Location!”", "Author": "vocalvibe1", "ReviewID": "UR27243502", "Content": "This was a great hotel for the price~! It was very large, the colors are beautiful inside the room. The bathrooms are ultra luxurious with all marble floors shower and sink. They have great bath towels. The beds are very nice, not too hard or soft. The sheets are very good as well. The TV was great and other furnishings nice. A/C worked very well. The Restaurant had a full breakfast included with our room that was great. We ordered from the menu and had the fruit and pastry buffet and it was all included! We wanted ice and they brought it to our room. The only draw back that I saw was that the view from our room was into the center of the building so we were looking at air conditioners and such....but we were not in the room that much so it really was not a big deal. The only other thing is that, we were under the impression that we were able to take the hotel shuttle to and from the airport at no extra charge. This is not true. The hotel does not have their own shuttle. They have a taxi service that they work with. The taxi is a local driver that owns a small car. He charges you regular rates....we were charged 130.00 pesos in March 2009 to go to the airport. That's a little over 9 dollars in U.S. Funds. That is ok, just a little miss leading. Other than that, it is in a part of town that seems to be close enough to everything. Alameada Park with the very expansive public market place is 7 blocks from the hotel. You just turn left out of the hotel and walk 7 blocks and your at the market in Alameada Park...its great. Soooo, definitely, I will be back. The front desk staff seemed to always have someone there that spoke english enough to help me. Although my fiance in Mexican so we were ok either way. I love it here......Will be back for sure~!~ Donna G ~ St. Louis, Missouri & Pedro M Tlahuelilpan, Hidalgo, Mexico/St. Louis Missouri ~ We Stayed in Hotel on March 28th and 29th 2009", "Date": "April 1, 2009"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Good value for money”", "Author": "LarryWastoday", "ReviewID": "UR22149455", "Content": "The hotel was great value for money. OK, it could do with a bit of an update but the room was very spacious and had all the comforts you would expect plus some more (a sofa, for example). The rate we paid (the cheapest for this hotel), included parking (guarded, in the building itself) and a good cooked breakfast. The location is quite good too: a 5-10 minute walk from the centre (Avenida Juarez and Plaza de la Solaridad), 5-10 minute walk to the closest Metro station and a 20-25 minute walk from the Zocalo (or take the Metro). The road the hotel is in is a little rundown but feels perfectly safe. Most of the staff speak little or no English and this may account for some of the previous negative reviews. We found the staff polite and reasonable. On balance, better than expected.", "Date": "November 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hermosillo, Sonora", "Title": "“Average”", "Author": "UntiredTraveler", "ReviewID": "UR11121329", "Content": "I was with my family in this hotel in the end of September this year and all I can say is a good hotel, it needs a little maintenance indeed but the location is pretty good and you can feel safe thinking you're in a dangerous city, taxis are always available and the staff is helpful, that was the most important thing it could happened to us as my little boy needed drinkable water and they provided with no extra cost!! I recommend it to anyone.", "Date": "November 28, 2007"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "1", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Good hotel, not for tourists, non-friendly staff!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4328931", "Content": "I stayed on the Estoril in a bussiness trip, it has not a good location for tourists, the room is expensive, its air conditioning is excellent. Good bathroom. The attention of the staff was terrible!!", "Date": "January 6, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“good value for money!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2591712", "Content": "The hotel was more than perfect. It is located in the center of mexico city, not the fanciest part, but close to all the tourist atractions and the metro (which was a great way of transport, costs 2 pesos which is like 10 cent). The staff was especially nice, and its not their fault that the exchange rate in the hotel is a theft. The thing to do is to change money in the bank or in the change houses. The restaurant is ok, not the best food but the service is good and its not too bad as there are not a lot of good looking restaurants on the area. The rooms were the best. They are huge, confortable, big bathroom and very clean. the only thing is I had to ask for another pillow as the one they have is a rock... Another thing I didnt quite liked was that you have to leave a deposit to use the safe in the lobby and even to get a remote for the tv, it was a bit anoying but you get your money back afterwards. We had a great time in mexico city and the best western estoril hotel was a very nice place to be if you are traveling with a budget.", "Date": "September 22, 2004"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "4"}, "AuthorLocation": "Monrovia, CA", "Title": "“not the friendliest staff”", "Author": "A TripAdvisor Member", "ReviewID": "UR2218635", "Content": "The hotel was nice. Rooms were spacious. Terrible view of a parking lot. No nice restaraunts nearby. Most of all, the staff was not the friendliest. Everytime I would ask a question they looked at me as if I were stupid. And I spoke to them in spanish!!! Second, several times I cashed american dollars into mexican pesos....and found out later that they were not giving me the correct exchange amount. For every american $20.00 I should have received $222.20pesos..which is $22.20 american dollars. My friend and I must have exchanged at least $200.00 for mexican pesos! I haven't calculated exactly how much they shorted me..but i'm sure we left them a nice chunk of change for them to take home and we didn't even know it! The whole staff is very dishonest! BEWARE to anyone who stays at this Best Western, make sure they know that you know what the exchange value is for every american dollar! And if you plan to make reservations inside the hotel for a tour of the city make sure you don't get ripped off like we did. We paid the man $150.00 american dollars and he pulls up in his 1982 4-door oldsmobile (falling apart) and asks us if we're ready to go! We thought we were going in a tour bus! On the way back from the Pyramids his car starts smoking from the engine and breaks down in the middle of the highway! We were stuck out there for atleast 2 hours. If you're gonna reserve a tour make sure you are going in an actual tour bus with an actual tour guide. The tour is not worth $150.00!!!! We should of paid him $60.00 for all three of us! BE VERY CAUTIOUS!!!!!!!!", "Date": "June 23, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Atlanta", "Title": "“a mixed bag”", "Author": "cat lips", "ReviewID": "UR1375037", "Content": "The hotel itself is very nice. The lobby and bedrooms are very clean and modern. The restaurant is reasonably priced and the food is more than adequate. The hotel's location is not the best because the area is mostly commercial, so in the evenings there is not much to see and there are very few restaurants in the area. The biggest disappointment was the hotel staff. Some of the front desk personnel were not nice at all. Also, we were told that if we called the hotel while we were out site seeing, the hotel would send a reliable taxi to our location to return us to the hotel. However, when we called the hotel, the front desk said that the hotel could not call a taxi for us. Hence, we were forced to take public transportation during rush hour. The hotel needs to be more responsive to its guests.", "Date": "October 3, 2003"}], "HotelInfo": {"Name": "BEST WESTERN Estoril", "HotelURL": "/ShowUserReviews-g150800-d154643-Reviews-BEST_WESTERN_Estoril-Mexico_City_Central_Mexico_and_Gulf_Coast.html", "Price": "$65 - $95*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Luis Moya 93</span>, <span class=\"locality\"><span property=\"v:locality\">Mexico City</span> <span property=\"v:postal-code\">06070</span></span>, <span class=\"country-name\" property=\"v:country-name\">Mexico</span> </span> </span> </address>", "HotelID": "154643", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/c7/b9/c7b974a6b02d0c1fe0a647b18b0dc6577large.jpg"}}