{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Tampa, Florida", "Title": "“No ice machines available for3 of 4 floors.”", "Author": "TampaBayFan", "ReviewID": "UR128466726", "Content": "There were not enough clerks to handle the incoming at 11:30PM. The towels were dingy and small. They did not refresh bathroom soaps and shampoos. The rooms did not feel that clean.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Saint Cloud, Florida", "Title": "“BED BUGS”", "Author": "lovelyjad1", "ReviewID": "UR122327114", "Content": "THESE ROOMS ARE INFESTED WITH BED BUGS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! I stayed the night in one of the rooms here and when we first walked in it look as if the ceiling was caving in from water damage leaking down the walls and it was hot and moist the frezzer/ frige was off and had to wait till it cooled down. The table broke as soon as I set a bag on it. The shower had no pressure, and when I woke up I noticed a bug crawling on me and I thought to myself NO WAY, went and pulled back the sheets and as I thought BED BUGS all in the sheets. I went down and told them I wanted my money back but it was only 5am and no one answered the door so went back got what I needed to get done came back before check out and told them I wanted my money back and they told me I planted the bugs there. WTF I think not why would we pay for a week and plant bugs? hello!!!!! I told my guy to call the police and as we were doing this they went to the room with the maid and started getting rid of the sheets and what ever else they could. I yelled at them so bad they finally gave me the money back and we left. I would like to find a way to shut these people down cause who in their right mind would want to stay here anyways?", "Date": "December 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brockville, Canada", "Title": "“Great People”", "Author": "roy_taz69", "ReviewID": "UR115668837", "Content": "The family and i really enjoyed our stay. All the staff was very friendly, and helpful. Being from Canada we didn't know much about things around here. The the staff at the hotel were extremely nice and helpful, and didn\"t mind any questions i had. And there was alot of questions. Next time i come down this way i will definately stay here again.", "Date": "July 22, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Asheville, North Carolina", "Title": "“Worst Hotel Ever”", "Author": "nctravelingmomma", "ReviewID": "UR105324671", "Content": "This hotel wasn't our first choice but it was the closest hotel that had enough rooms and fit our budget. The older motel we had stayed at the night before on our way to Florida was actually better than this one. When we arrived in the room, it was stifling hot and smelled. We turned on the air but it never did really get cool in the room. One of the kids went in the bathroom and couldn't find the toilet paper. After hunting for a few minutes, I managed to unearth a roll that was nearly gone. There wasn't any more. We ended up having to go to the other room to get some. When I went to put the kids to bed, I found that the comforter had just been pulled up and the bed wasn't made underneath. Rather than call housekeeping, I decided to make it myself, which is when I realized the sheets were dirty. The fridge wasn't plugged in so we pulled it out. There was probably a year's worth or dirt and cobwebs behind it. The ice bucket still had melted ice in it and there was mold on the lid. At that point, we called the front desk to complain. The attendant was rude and told us we would have to wait until the next day when the maid came. Since it was so late and one of the kids was sick, we decided to go ahead and stay. The shower was terrible. There was a crusty, used washcloth in the corner of the tub. There was no water pressure. When you turned the knob for the shower, it would only give you cold water. If you put it over on the bath setting, it only gave hot water. We had to run the bath and then let it cool for a while before we could put the kids in. The next morning, we went to make coffee and found an old filter still in the coffee pot. It had mold growing in it. Even if we'd been able to make coffee, there were no cups to put it in. My sister went downstairs to get some coffee and food from the continental breakfast and all they had was coffee. When the maid came by, we explained the problems with the room and were assured she would take care of it. We stripped the bed and left the fridge pulled out so she could see the dirt behind it. Then we left for the funeral we were in town for. When we got back, the room was even worse than it was when we left. The bed had been remade with the same dirty sheets. The towels had been replaced with even dirtier ones than we had before. We still didn't have cups, soap, shampoo or extra towels even though we had specifically asked for them. The people at the hotel, staff and clientele, made us nervous. Some people got into a fight outside our room. There were drunks out in the parking lot yelling and carrying on. When we were in the pool, there was a guy walking around the pool with a tracking bracelet on his ankle. We were standing on the balcony and the maintenance guy walked by and was craning his neck to look up my sisters skirt. There was some sort of bugs in our room. We're not sure if it was fleas or something else. All of us were itching and had bug bites all over us. The wifi also didn't work.", "Date": "April 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lauderhill, Florida", "Title": "“AWFUL”", "Author": "tifa_11", "ReviewID": "UR93862304", "Content": "Customer service was horrible. we got lost and the lady refused rudely to help us find the hotel. The blankets were worn out and should be thrown away. The day of check out, the representative laughed at me because I was concerned about my charges since the system was done. And I still got overcharged...don't stay there.", "Date": "January 20, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Jacksonville,Fl", "Title": "“DO NOT STAY HERE!!!!!!”", "Author": "dakins35", "ReviewID": "UR91695396", "Content": "I guess the old saying \"you get what you pay for\" is extremly true for this place! I guess my clue should have been while I was standing at the check in and the front desk people were arguing and cursing, about the homeless people that were basically refusing to leave. The hallway to our room reeeeked of urine and cigarette smoke (this is supposed to be NON smoking rooms). we open the door to our room and the ceiling looked as if it was about to cave in from water damage. the bathroom was disgusting and the refridgerator did not work! the carpets were so disgusting I would not let my children take there shoes off much less sit on it. Our room had a view of the pool, it was nasty green you could not see to the bottom. there was NO water pressure and the door to the room did not lock! we went immediatly to check out, so they appologized and moved us to a \"better\" room! NO SUCH THING EXISTs in this place!! the only difference is the door did lock and the ceiling was not falling in. The Fridge worked but had mold growing in it and the fire alarm was laying on the counter with the wires sticking out of the wall. The handle in the shower came off when we tried to turn it on and then there was only scolding hot water!! needless to say we checked out first thing the next morning!! I would not let my DOG stay at this slum if it was the last place on earth!!!", "Date": "January 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Tallahassee, Florida", "Title": "“NIGHTMARE”", "Author": "marimongay", "ReviewID": "UR88793063", "Content": "My stay here was a NIGHTMARE. We were on our way from Miami to Tallahassee and had to stop here because my husband had food poisoning and wanted to rest. We noticed it was on SHADY LANE. Thought that was funny until I was harassed by some scary man outside after checking in. We ran to the room. My husband took a shower and then I did. We both noticed that the water pressure was basically non existent and the temperature of the water went from freezing cold to cold. Parts of the wall were coming apart and it looked like it came out of some alien movie because it had a bubbling appearance. The last straw however was the next morning. At around 9 am someone knocked on our door disregarding the do not disturb sign. They said we couldn't have the dog without paying an extra $25. I said fine. We had been in a hurry the night before and didn't report the dog. He was barking and they discovered us. I have no problem paying but how was I supposed to know this guy was legit? So I ask if I can pay at check out. He says he needs the money now. I tell him I only have 2 $20's and he says I can get my change at check out. I freak out and tell my husband but he says just give it to the man. Ok. We go back to bed. 10 minutes later. KNOCK KNOCK. Housekeeping. I open and she says just wanted to make sure you were still here....? The do not disturb sign didn't give it away apparently. After that KNOCK KNOCK. I open. She says oh you're still here? I say what time is check out?! She says 12. I look at watch, it's 11:30. I close the door and say we will be out by checkout time. I begin to pack the car and housekeeping lady walks by clearly noticing me. 11:45 she knocks again. If we stay any longer the hotel will have to charge us another day. My husband is hurled over the toilet but we made an immediate exit. I go to the front desk where the man sees me and gives me my change and I walk away. No exchange of words. The most rude and unprofessional people I have ever dealt with in my life. Will never be staying here again even if we are dying.", "Date": "December 1, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Soddy Daisy, Tennessee", "Title": "“This place is Totally disgusting!!!!!!!”", "Author": "susieanderson", "ReviewID": "UR69549509", "Content": "When we pulled in, the motel looked deserted-which should have given us a clue since it was a holiday weekend. The hallway to our room smelled like urine as did our room. The furnishings were ok but stained. The refrigerator didn't work. The bathroom was gross. The room was so bad we didn't let the kids sit on the furniture or walk around. They weren't even allowed to sit in the tub. We were also worried that our vehicle would get broken into so my husband went to check on it during the night every 2 hrs. We have stayed at the econo lodge in other cities and never had encountered a place this bad.", "Date": "July 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Kanata, Canada", "Title": "“This place was a dump!”", "Author": "CanCruiser", "ReviewID": "UR45502720", "Content": "This self-titled 'resort' was 'under construction' when my family arrived. I booked it on-line as it seemed nice for the price, given the photos and description. Unfortunately I had never stayed in Orlando before, therefore was unaware that we booked the furthest hotel from Disney and International Blvd. What's worse is that upon our arrival we were told that an incident happend in the pool, therefore the pool was to be closed for a few days. One of the visiters had 'accidentally' released the contents of a fire extinguisher into the pool. We could barely abide by the fact that the room and facilities were sub-standard, but my son was extremely dissapointed not to have access to the pool. The restaurant was hardly open, and when it was, it was really a bar with very loud music. The staff was unknowlegeable and unhelpful. The room was ill-equiped, and when things were asked for (such as a working coffee maker), they had to be reminded multiple times. Oh, guess what - the pool still wasn't opened by the end of our week-long stay! Given that there are other hotels closer to the amusement parks, shopping etc. I'd defintitely tell people to give this one a pass.", "Date": "September 30, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "San Francisco, California", "Title": "“Not Worth It !!!”", "Author": "acsfoguy", "ReviewID": "UR45087656", "Content": "OK!!! Where do I begin? There is so much, guess I'll start at the very beginning. I went to the Econo Lodge website, and booked the room from there. Everything there went fine, booked the room, got the confirmation, then printed it out. Easy, simple & fast. Everything from that point went down hill. Upon arrival at the hotel, I entered the lobby; Sort of run down, sort of old, but that didn't really matter to me. Walked up to the counter, and waited. Behind the counter, in a back office was \"Harsh.\" Harsh saw me, we made eye contact. He then proceeded to ignore me for a good 5 minutes. He carried on his conversation until he was good and ready to deal with me. When he decided to assist me, I handed him my confirmation. He then spent what seemed like another extended amount of time doing something on the computer. Shortly after being on the computer, his cell phone ranged. He stopped everything and answered it. I was then subjected to a 3-5 minute long conversation in Hindi. When Harsh was finished with his phone conversation, he went over to another computer. He spent an equally long amount of time on it. He then looked up at me and asked, what kind of room did I want. That sort of shocked me! I said it really didn't matter as long as there was a fridge. As we had insulin that needed to be kept cool. Harsh soon handed me the card key, and we were on our way. When I got to the room, everything seemed ok, but upon walking in and further inspection things were anything but good. The carpet was filthy, it hadn't been vacuumed in a while. There was no fridge, no microwave, no internet. Amazingly, the bathroom was spotless. It was 90+ degrees (32+ Celsius) outside and very humid. We were sweaty and just wanted to get cleaned up, and rest up before heading out. No one wanted to go back to the front desk and deal with a disinterested front desk clerk. So we made the best of it. It was upsetting that we were given a room without a fridge, especially after making a point of asking for one. Our stay at the hotel was short (thank God) only 2 nights. We were visiting friends in St. Cloud. Therefore we spend all of our time with my friends. Only used the hotel as a place to shower & sleep. We stopped at Walmart in St. Cloud and bought a cheap styrofoam cooler, filled it with ice, and used it to keep our beverages cold. Our insulin was kept cool in my friends fridge. It would have been nice to have a fridge in the room. At the end of that first day, my friends gave us a lot of food to take back to the hotel with us. Needless to say there was nothing in the room to heat it in, or refrigerate it in. (except our cooler) The next day we hardly spent any time in the room. We were up and out by 8am and back at 2am. (18 hours later) We returned to a room that was untouched by housekeeping. That was unacceptable. I went back to the front desk to complain and get some clean towels. While on my way to the front desk I passed a storage room. The door was partially open, and the housekeeping cart was in full view. It was loaded with clean towels & soap. I took what we needed and headed back to the room. So far, I've only spoken about what we experienced with our arrival and the room. The hotel is a totally different story. To be fair, I guess all that I can say about the hotel is that it's undergoing some sort of renovation. That is the only explanation I can see for whole wings of the hotel cordoned off with yellow tape. Also that can explain why there were open trenches all around the hotel with all sorts of exposed pipes. That might explain why it took about 5 minutes for us to get any type of warm water for our showers. Like I said earlier, it was hot & humid there. The hotel did not take care in the disposal of garbage. When I arrived I noticed all the garbage cans around the hotel were full. The next morning they were overflowing. When we finally left, there was no change. All the trash cans were more than overflowing with garbage. It may seem like this stay was a total disaster. Well it was, but there were a few positives. There were washers & dryers at the end of each floor. It seemed like all the vending & ice machines worked. And with everything else lacking, our room had an iron and ironing board. Other than the ice machine, we didn't use the other amenities. All in all, I can not and will not suggest this place to anyone. The overall lack of customer service, the condition of the rooms, and hotel in general makes this a place that I would stay away from. There are other hotels in the area, check them out!!! I wouldn't even suggest this place as a last resort.", "Date": "September 27, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Royal Palm Beach, FL", "Title": "“Worst and most disgusting place ever..!”", "Author": "FemaleSavage", "ReviewID": "UR35348113", "Content": "First, off let me start off by saying that they are false advertising over there! The photos on the internet made it look lovely but when in actuality it is a piece os S**T, it the worst place ever there are bombs and and drug users outside of the MOTEL(not resort or hotel) and to be honest the ones working there are drug users and were drunk most of the time! The rooms smelled horrible and A/C was loud and barely working the bathroom was filthy and disgusting and the hallways were nasty and unsafe, With all type of people hanging outside and no towels or rags, but honestly im glad i brought my own! The only half decent thing was the vending machine by the pool thats it!!!! SO PLEASE DONT WASTE YOUR TIME, EFFORT R MONEY! HAVE YOU EVER HEARD THE SAYING \"YOU GET WHAT YOU PAY FOR\"!", "Date": "July 21, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "ZABYMES", "Title": "“If I knew!!!!”", "Author": "DolemiteNPAM", "ReviewID": "UR20798755", "Content": "First i apologize 4 my english i m from FWI the first night was horrible we have to change room 3 times after we check in !! 1st one (non smokin one ) smell like... cold tobacco and other smells.. ,2nd one toilets was out of order and 3rd smell less and toilets was ok then we took this one . i wont be to long just a few examples of our 13 days buy incense to purifying the room / ask a remote fot tv get a bad and then must buy my own / ask to vacuum the room cause of pieces of glasses and dust on the floor/ buy towels to dry ouselves; towels of the hotel were yeerk!! / noisy A/C / have to ask for changing sheets and cleaning certains parts or the room! during the stay last but not least meet our friends the cokroaches!! never again!!", "Date": "October 11, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Cape Coral, Florida", "Title": "“Never Again !!!”", "Author": "Kymasabe", "ReviewID": "UR16239079", "Content": "The website made the hotel look great but in real life it's a dump. Our room smelled moldy, there was little or no hot water, barely warm, the tiles were literally falling off the shower wall, the A/C was loud, no remote for TV, housekeeping left us two bath towels for familty of four and only 1/2 roll of toilet paper. Calls to front desk were unanswered, the pool water was green, the ice machines barely work, and there are some shady looking long-term residents at this hotel. Don't waste your money here, for a couple of extra $, there are MUCH better hotels right down the street", "Date": "May 20, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Crestview, FL", "Title": "“I would have payed twice to go elsewhere!”", "Author": "dgarrett1963", "ReviewID": "UR14831598", "Content": "I booked through Skoosh (may never do this again-totally incorrect information). The photo and description on the actual motel site seems harmless enough for a low cost motel. Then you arrive to find that it is no longer owned by America's Best Inn and is privately owned (under rennovation, they say). I did get the king size bed I asked for but there was no sleeper sofa (that I had requested for my small child). In fact no one knew where it had disappeared to...instead, they took two hours to bring up a fold-away bed. It was literally springs covered by cloth- no padding (I used the comforter from our bed and folded it up as cushioning for my child to sleep on). The air conditioner was noisy and had to be run all day and night to keep the room bearable (it will never cool a room in the hot summer). The room was nasty, noisy and the bathroom was tiny. The light and fan in the bathroom did not work and was never fixed during my stay. This meant that you were sweating as soon as you stepped out of the shower). The reservation site promised free shuttle service to Disney, free continental breakfast, a whirlpool and kiddy pool. None existed. This place was so far away from Disney that it took 40 minutes to get there. There is practically nothing near the motel (oh I forgot; they called themselves a resort...). Most of the people staying there live there by the week and have taken over the motel. The whole location smelled like an old bar. Everything was permeated with stale cigarette smoke. \"People\" had their pitbulls in the hallways. We had previously arranged to check out of one motel with only double beds to get this one (after all, the motel site said it had all the same ammenities). I would have paid $200 a night to get into a good motel after the first 30 minutes there, but my wife was already so upset that she didn't want to take any more chances. After tons of stress and our marriage still intact, we managed to salvage what was left of our vacation. This experience has totally changed how I will book motels from now on....I will pay for only the best! This place is a dump and needs to be condemned immediately!", "Date": "April 6, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Ohio", "Title": "“WORST PLACE EVER!!”", "Author": "catiebug6686", "ReviewID": "UR14783593", "Content": "This hotel was HORRIBLE! When we pulled up it looked like that pictures from the company's website. However the office looked just like the restaurant out front and we didn't know it was the office. So we drove all the way around the property looking for the office. At the back corner of their property there were people throwing furniture off of the top balcony into a truck (and it definitely didn't look like they were remodeling)! Between our trip itinerary from our booking website and the hotel's website we were told that we would have a microwave, refrigerator, in room internet connection, and an alarm clock. Since we arrived an hour before check-in we went to a grocery store to get some necessities for the week. We did have a micro-fridge in our room but it did not work. Which made for some tasty cereal in the morning. We did not have a microwave, so we had plenty of things we could not use. We tried to plug our cellphones in next to one of the beds and the outlet did not work. When we went to plug them in behind the nightstand there were candy wrappers there. We did not have hot water and it smelled like sulfur. The bed linens smelled horrible and the place looked like it hadn't been vacuumed in a VERY long time. We had what looked like a closet in our room, however, there were no doors on it. There wasn't even a bar to hang anything up. There was no remote to the tv and no alarm clock. The soap and shampoo in the bathroom weren't even from our hotel. They were from TWO different hotels. The first morning after waking up we decided to switch hotels. We called around and every other hotel was booked until after Wrestlemania. Since we got up early every morning and came in late every night we decided to toughen up. One afternoon after returning to the hotel we saw something crawl under the patio door to the room across the hall from ours. Neither one of us knew what it was but it walked like some kind of lizard. And we still stayed. After coming in later (1am) from Wrestlemania we found a 2.5 inch cockroach on our wall (see the attached picture). And we packed all of our belongings and left immediately. I do not recommend this hotel for ANY ONE! I laugh at the fact they call it a resort. Since coming home, I have developed some kind of eye infection. I don't know if it is from the hotel or not, but be aware anything is possible there!!!!", "Date": "April 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "beaufort", "Title": "“holoycowBeaufort”", "Author": "holycowBeaufort", "ReviewID": "UR14766141", "Content": "I must admit when I first reserved my room with hotels.com I was a bit concerned because of the price that they gave me (inexpensive). After making the reservations I googled the hotel, I read all the reviews, out of all 24 reviews that were posted only 3 of them were good. I got extremly nervous because I was traveling with two little girls. the hotel was described to be filthy full of hookers and drug dealers. I called hotels.com back and expressed to them my concerns, they assured me that we would be OK. I am not a high maintenance person at all, my concern was the two little ones that i was traveling with. Because most of the reviews stated that the hotel was dirty I packed our own linen, towels, cleaning supplies and plug in air freshners. After traveling for what seemed like 24 hours i arrived at the hotel, the front desk area is very nice, the recepionist that checked me in was an older gentlemen that appeared not to be having a good day (busy day). I was so nervous what our room was going to look like, when we went into the room it was clean and it smelled like Pine -Sol. Granted the hotel is very old with old appliances but it was not even close to the way every one had described it. We stayed at the hotel for a week not once did I see a drug dealer, hookers are anything. House keeping came to our room every day to service us but being that I had brought our own supplies I did not need their service. The girls enjoyed the pool, the only disappointment they had was the game room was under renovations, the hotel personnel was very nice and helpful.", "Date": "April 3, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "GA", "Title": "“hmmmmmm”", "Author": "Trixie20", "ReviewID": "UR14069085", "Content": "My first impression of the hotel was not good...it looked run down and somewhat out of business from the street. The gentleman at the front desk was nice enough to let me check in an hour early...when we got to our room, the door was propped open and the housekeeper told us that there had been a couple in the room before us with 4 dogs and that they were \"airing\" out the room...lol...I went to turn on the air conditioner and a hideous smell came out of it...not to mention there was hairy mold growing on the the vent....we did not have a microwave and the TV did not have a remote...the telephone was falling apart and had terrible static....when my son went to take his shower, the water was cold....the sheets were clean but the bedspreads smelled disgusting....on the way to Disney World the next morning, I stopped by the front desk to ask for a microwave and hot water and was assured that it would be handled....when we got back to the hotel after enjoying a long hot day with Mickey, nothing was different in my room so I went back to the front desk (the phone would not ring to the front desk) and asked to be moved, which they did with no problem (of course they were not able to give me a room with a pool view, but since the pool was green and had ducks swimming it it, we didn't care...lol)....the second room did have hot water, did not have bad odor and was MUCH cleaner, and we had a microwave....much better....over all, I would stay here again if i could be sure of getting the second room...it was definatly worth the small price I paid, but the hotel is a little far away from Disney and other Kissimee attractions...", "Date": "March 5, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1"}, "AuthorLocation": "north carolina", "Title": "“Discusting”", "Author": "curlybirley", "ReviewID": "UR14068014", "Content": "When we first pulled up I was just thinking ok , I guess I am going to get what I paid for , but maybe it will be clean !! ha I was so wrong . I walked in and immediatley looked at the place, and there was stains all over the sheets and a bloody something on the wall. In the shower there was hair all over the wall and the toilet had big stains of something in it. I had to go but things to clean the room with. Ontop of all that the first night we were there some other guest had a key to our room , which was rather scary! It looked like there was a bunch of crack heads that lived there ! Out side my room all I could see was a old car with dead bolts of the trunk. If that doesn't tell you something I don't know what will. House keeping didn'tcome at all , I checked out and went to a different hotel the second day because I was scared to step foot out of my door! There were cops there every other night and people were just weird . I was sitting in the room and some guy was outside my window (sliding glass do that didnt open) witha fiftth of liquor singing and dancing to himself!! DO NOT GO HERE !!!! DO NOT bring your children to this hotel ! it is the nastiest thing i have ever been to !!", "Date": "March 5, 2008"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "little town", "Title": "“Caution .......... don't stay here....... woooooorst ever”", "Author": "hqq5", "ReviewID": "UR13504404", "Content": "Dirty Dirty !!!!!!! This was not ran like a hotel more like low income housing. Has many rooms rented by the month to locals. Don't do it ... You will be sorry. !!!!!!", "Date": "February 12, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "london", "Title": "“ohh... my god..”", "Author": "david046", "ReviewID": "UR12481027", "Content": "we stayed there with my three kids during the x-mas new year holiday for visit to theme park etc. first day we given the room were stinky and dirty carpet and we asked another one and it has no shower head no tv, no phone , air conditioning machine loud as my jet plane. chairs broken table dirty and bed sheets and under sheets are only good for tramps. after 3day fight i got another room, which is not too bad, but it has a dirty carpet. It sticks as u walk. Bath is very old and dirty. and hot water not hot at all. I was fed up so i put my bed sheets on the carpet all over the place to walk over, and brought some new sheets from house keeping for us to sleep. During the stay my kids had tummy ache and skin allergy. But i am not sure who to blame for this, but could be the dirty hotel. It has swimming pool but closed during my stay. they said it is not ready (something to do with ph balance.) It is located end part of kissimmee and about 15 mils to Florida center. My advice is don't go unless you want to know the life of tramp. I wish i read these review befor i go.", "Date": "January 9, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "1"}, "AuthorLocation": "vineland", "Title": "“dont stay here!!!!! ever!!!!”", "Author": "superman122475", "ReviewID": "UR11999860", "Content": "ok i paid for house keeping and every time the house keeping lady was around i asked her to clean the room..she never did. i went down to the manager and asked him why i paid for house keeping and the maid doesnt want to clean my room..he didnt have an answer..i asked for a refund he told me it was impossible to get it back. i stood there for 16 days and not once did i get my room clean..it was so bad i had to buy my own little vaccum and buy my own towels n bed sheets..this is a horrible hotel that isnt run right. the management sucks!!! the carpet was very dirty, the bathroom floor had stains...the bath tub wasnt clean. the mini fridge did not work properly..the only reason i stood so long was because it was the only place that was giving weekly rates..if it had not been for that i would of left the 2nd day. this by far is the worst hotel you can stay..im surprized i didnt get robbed or killed in this place.", "Date": "December 27, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Peoria,Illinois", "Title": "“Great Rooms...Greater Price !!!”", "Author": "brandon34744", "ReviewID": "UR11084350", "Content": "Having read the other reviews about the East Palm Resort, I was appalled to read such lousy reviews about such a great place ! What did these people expect ? Five Star amenities at a 2 star price. The rooms are large, the beds comfortable, and the other amenities are great.During our week long stay, If ANYTHING was not as it should be, the Front Desk Staff, the Housekeeping Staff or the Maintenance Staff did whatver was necessary to remedy the problem. We felt as if we were guests in someone's home, rather than in a commercial establishment !! All of this for less than a good dinner in an excellent restaurant. The staff was ready to answer any questions we had whether it be directions to the parks or where the best specialiity restaurant was. All in all, an excellent stay. Can't wait to go back !", "Date": "November 26, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Walterboro", "Title": "“A nightmare”", "Author": "simplecustomer", "ReviewID": "UR11068709", "Content": "We booked for 3 days but one was too much to stand. This is a short description: condom wraping on the carpet, dirty carpet and looked like they don't vacuumed in a long time, horible smell, spider webs on the ceiling, dust all over, bathroom sink and bathtub almost stuck, 3 little towels and not clean ones, bed sheets were not changed (hair in bed and dirty pilow covers - we had to ask to be changed), cups were not sealed and looked used - over all I have never seen something like this in my life. Make yourself a favor and just avoid this place.", "Date": "November 26, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Ky", "Title": "“Worst hotel ever”", "Author": "KyRob", "ReviewID": "UR8676368", "Content": "This has to be the worst hotel I have ever stayed in.We checked in late thursday nite for a week stay to do the Disney thing.We all changed in swimwear to take a dip to find that the pool water was green so we declined to swim.The next dat Mgmt.posted a closed sign on the pool.We tried to get a shower { I have three kids with me and my wife } the next morning only to find out the've had a pluming problem and have NO HOT WATER !!The room was dirty and very rundown The staff was very understanding when I checked out the next morning.A company named Spirit booked this place for me.....Thanks", "Date": "September 8, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Location": "1"}, "AuthorLocation": "atlanta", "Title": "“your better off sleeping in your car”", "Author": "dl3", "ReviewID": "UR6907529", "Content": "We booked this hotel through a time share package so we had no choice about what hotel we wanted to stay in. They were disorganized and unaccommodating. We never actually got to see a room because the first night our room was damaged and the second the owner put someone else in our room! We stayed in the lobby till 4am the second night while they figured out what to do with us. They tried to put us in a room that was admitted to being dirty with bugs. There were ashes, cigarette butts, and stains on the carpets. A few times when they called other hotels there was a vacancy but it was more than they wanted to pay. The man behind the desk talked about how unreliable the housekeeping staff was and that their best rooms were not that clean. This was the worst hotel I attempted to stay in and this includes the hotel I stayed in in Cambodia for 3 dollars a night.", "Date": "March 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kissimmee", "Title": "“Hotel for great weekly rates!!!”", "Author": "mouse232", "ReviewID": "UR6060529", "Content": "I searched all over for great weekly rates!!!! This hotel had the best value in the area!!!! I would be willing to go back!!!! Thank You!!!", "Date": "November 5, 2006"}, {"Ratings": {"Check in / front desk": "4", "Overall": "1.0", "Value": "1"}, "AuthorLocation": "Florida", "Title": "“Unbelievable Rat Trap”", "Author": "Raymond131", "ReviewID": "UR5984509", "Content": "We have NEVER stayed anywhere like this before, and believe me, we have stayed at plenty of hotels. The first room we were assigned had a bathroom door that would not close. The second room to replace the first had a back glass door that would not lock, a non-functional front door (we had to go to the front desk everytime we needed access to our room because the card-lock would not work), a maintenance man that showed up in bare feet, a sink that would not drain, and mold and mildew all over the bathroom walls. We were offered a third room, but declined because it appeared to be where the hookers lived and there were no parking lot lights. AVOID AT ALL COSTS!!!", "Date": "October 22, 2006"}], "HotelInfo": {"Name": "Econo Lodge Inn & Suites", "HotelURL": "/ShowUserReviews-g34352-d1547286-Reviews-Econo_Lodge_Inn_Suites-Kissimmee_Florida.html", "Price": "$35 - $94*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2323 E Irlo Bronson Mem Hwy, Building B</span>, <span class=\"locality\"><span property=\"v:locality\">Kissimmee</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">34744</span></span> (Formerly East Palm Resort)</span></span></address>", "HotelID": "1547286", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/80/55/80558f323babdaf6e2d47880ea8eb4881large.jpg"}}