{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Toronto", "Title": "“A poor excuse for a hotel”", "Author": "June H", "ReviewID": "UR126335344", "Content": "First, let me start by saying that I have had wonderful experiences at Four Seasons hotels around the world (Paris, London, Istanbul, Maui, etc.). However, the Four Seasons hotel in Toronto is a sad, pitiful joke. The restaurant (Avenue) has the rudest seating staff you could ever imagine. The restaurant manager is completely unconcerned about how badly customers are treated and is not at all interested in trying to set an example to the other employees. I will never, ever stay or dine at the Four Seasons in Toronto again. It is a poor excuse for a hotel and is doing a lot of damage to a brand that is known elsewhere as a five-star hotel chain. The one in Toronto is barely a two-star.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Madeira", "Title": "“Definitely not the best Four Seasons”", "Author": "JC64Madeira", "ReviewID": "UR126256731", "Content": "I understand the hotel is soon to close, and to be converted into residence apartments. Rooms are large but old, and not to FS perfect standards. And no door stoppers in rooms, so one keeps hearing doors slamming every now and then. Service on the other hand was almost perfect. I had room service once and late dinner at the bar and food/service was excellent. Housekeeping efficient and polite (although should check Ihome clock time display). Concierge and receptionist staff are very helpful. Breakfast: no buffet, a la carte only with irregular service. I look forward visiting the new FS Toronto next time.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mississauga, Canada", "Title": "“A very good hotel in the heart of Toronto”", "Author": "Denby155019", "ReviewID": "UR125747169", "Content": "Your stay at the Four Seasons will be excellent. You are near great restaurants and high end shops. The Royal Ontario Museum is just a few steps away.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Luxury combined with excellent service”", "Author": "Trakette", "ReviewID": "UR125498547", "Content": "I had a one night stay for a business meeting. The quality of the furnishings and linens was excellent. L'Occitane toiletries were lovely. My only small quibbles were the lack of a coffee maker and also the bath was smaller than I would have liked. I put my salt/slush stained boots out for cleaning and this hotel beat all others in the quality of the cleaning/polishing job they did. The food was excellent, and the service at all times superb. Everyone - wait staff, housekeeping, desk staff - was uniformly courteous and pleasant without being obsequious. I was sorry that this was just a one night stay.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pasadena, California", "Title": "“Fantastic service, great location”", "Author": "Valhallapix", "ReviewID": "UR125359261", "Content": "Although a new Four Seasons is opening up nearby, and this lovely hotel is showing her age, I had a wonderful experience in the hotel. When I checked in, I was coming down with strep throat and had a speaking engagement the next day. The hotel arranged for a doctor's visit, sent someone out to buy antibiotics and then made sure I had chicken soup and tea with honey. They took such amazing care of me! Room service was prompt, and the room was huge, clean and well appointed (although not to my particular tastes).", "Date": "February 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "toronto", "Title": "“Now is the Time!”", "Author": "stokelToronto", "ReviewID": "UR125245349", "Content": "For more than 30 years, the Four seasons Yorkville was one of Toronto's prime hotels. Movie stars and the rich and famous flocked to it's rooms. Toronto is in the middle of a condo boom and now the Four Season's 4 stars need to be upgraded to five stars to complete with the plethora of 5 star hotels now open just south of the hotel. The hotel will be closing soon to make way for more condos and the 4 seasons is moving from Avenue Road a couple of blocks east to Bay St to earn its fifth star. SWMBO and I decided to spend Canada's Family Day at the grand old dame in the tony Yorkville neighbourhood. We don't stay in many 4 stars and as far as quality service, the hotel still earns it's status. Not so much with the rooms and public areas. Our room 1407 was in the southeast corner of the building. The views were quite spectacular of the mid-town part of Toronto. The room was adequately large with a nice faux antique desk, an armoire with the television and mini-bar, a queen size bed, a comfy overstuffed chair and a high quality sound system. The closet was a small walk in and there was a large balcony with cast iron furniture (too bad it's February). The health club is feeling a bit dated but both the whirlpool and the indoor/outdoor pool were warm and welcoming. There is no coffee makers in our room but the staff brought one up. They don't subscribe to the powdered 'whitening' trap, so you have to order the milk or cream separately. There is something to be said about drinking coffee black:. Fewer calories and you don't have to call for room service. The staff were welcoming, friendly and helpful. I certainly hope they will make the migration to the new building. Overall the night we spent at the hotel was most enjoyable. We dined at Bistro 990 (see separate review) and enjoyed walking through the streets of downtown Toronto late at night. Toronto may not be the most beautiful city in North America, and it's not the biggest, richest or most sophisticated. It is however, one of the safer cities and being able to walk to our restaurant and back through the university district was worth the price of admission.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent Place to Stay in Yorkville Toronto”", "Author": "LindaCC_10", "ReviewID": "UR125001144", "Content": "Recently stayed one night for a business event. Was very impressed with the professional service at the front door and the front counter (they welcomed me back even though 5 years had passed!) . The room was immaculately clean and well appointed. Bed was a bit soft for my taste, but pillows were amazing! Highly recommend. Smack dab in the middle of trendy Yorkville, Toronto downtown. Numerous restaurants and lots of shopping options nearby.", "Date": "February 21, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Caversham, United Kingdom", "Title": "“Mixed”", "Author": "njhlab", "ReviewID": "UR124861655", "Content": "It's a little unfair to post a review of this hotel so close to it closing down, as it is very tired (although very clean). The reason that I have done so, is to draw attention to their excellent customer service. I arrived at the hotel with nasty blisters on my feet and they had their first aider in my room at 7am in the morning bandaging my feet. It was most appreciated.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, British Columbia, Canada", "Title": "“Excellent facilities and location.”", "Author": "Sam M", "ReviewID": "UR124618934", "Content": "$15.75 per day for Wifi! Yikes!! Staff is courteous and professional. I would love to stay there again anytime.", "Date": "February 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hamilton", "Title": "“Excellent service and great location!”", "Author": "76sunflower", "ReviewID": "UR124501033", "Content": "This hotel has been consistently excellent with service! I have stayed here many times for work and have found it very convenient and the staff very helpful. Most rooms are in good shape. I did have a problem with my room this time and they switched me immediately to another room.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Derbyshire", "Title": "“Great hotel, great staff, shame its going”", "Author": "OrvistheDog", "ReviewID": "UR124266717", "Content": "This is a truly great hotel and its a great shame its closing. I arrived on a Sunday evening when reception was very quiet and had one of the best check-in experiences ever with the friendly check in and personal welcome from the concierge. I just had time for a swim in the outdoor pool in the snow before my first meeting. The whole stay was superb but I sensed the hotel was well below its normal occupancy with its imminent move to a new property nearby. Every member of staff I came across was exceptional and I had a great view of downtown Toronto and the CN Tower from my room on the 30th floor. If I had one gripe there was no coffee making facilities in the room. I know that's a Four Seasons trait but we don't all want room service all of the time.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "shanghai", "Title": "“Cookies & Milk, Champagne & Lemon Ricotta Pancakes”", "Author": "dannyrogue", "ReviewID": "UR123721233", "Content": "Not much to say other than the Four Seasons Toronto is just a great hotel with all the perks and amenities one would expect at a five-star hotel anywhere around the world. The rooms are clean and comfortable, the facilities are first rate, and the service is top notch. The hotel concierge was always helpful and provided many recommendations, and the lemon ricotta pancakes at breakfast are the best pancakes I've ever had anywhere (seriously). A couple other nice service additions were a bottle of champagne and box of chocolates on my first night there, as well as cookies and milk for the kids. I would recommend this hotel for business travelers, families, couples, romantic stay-cations or anyone looking to splurge on a fancy hotel for a night or two.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Fantastic”", "Author": "mervin83", "ReviewID": "UR122794153", "Content": "The very best service of a very high class. I was upgraded to a higher room without even asking and enjoyed a very quiet stay in a comfortable room that was slightly old world but nevertheless with high quality french bath products. I felt like they knew who I was and they never hesitated to carry out any request pretty much faultlessly. As the property nears its end and a new one is created, it is my hope that the effortless and relaxed atmosphere carries over.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Burlington, Canada", "Title": "“a regular”", "Author": "boxsterbenz", "ReviewID": "UR122681881", "Content": "i stay in this hotel several times a year when i attend board meetings in toronto. it's a really nice hotel in a wonderful location: close to the royal ontario museum, royal conservatory of music, theatres, university of toronto, etc etc. shopping is first class in the neighbourhood and the restaurants are plentiful in the area and quite good. (parking is a bit rich but then you're at the four seasons!)", "Date": "January 6, 2012"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Stately, but time to refresh”", "Author": "6van", "ReviewID": "UR122299407", "Content": "Stayed four nights \"Boxing Week\" visiting friends. We are confident the aging hotel has first-class service but we didn't try any of the restaurants, utilize the concierge or conference facilities, so all I can comment on is the room. Booked superior king room at corporate rate at just under $200/night, which is at least over $100 less than the regular rate that week. Room was spacious, clean, comfortable and especially quiet. Bed was excellent and housekeeping fine. However, the bathroom was small with outdated fixtures (low counter-top, low toilet) and the plastic on/off knob for the shower was something you'd expect at a budget motel. On the plus side, the location is superb, with boutique stores, coffee houses and trendy shopping nearby. A new hotel will be opening in 2012, and it's probably a good time to refresh the Four Seasons brand in Toronto.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "New York", "Title": "“It's not how the Four Seasons should be. It's alright but not great.”", "Author": "lostnyctraveler", "ReviewID": "UR122296738", "Content": "The dining was great but the rest felt outdated and in urgent need of a refurbishment. Unless the renovate, I wouldn't return to this hotel. Sad to say this on a Four Seasons but it's the truth :-(", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Alberta, Canada", "Title": "“Unreal”", "Author": "wqh", "ReviewID": "UR122202801", "Content": "The service was amazing and the rooms superb. Highly recommend!!", "Date": "December 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Toronto Four Seasons-the best service”", "Author": "Wayne T", "ReviewID": "UR122178236", "Content": "This is a hotel that really goes it of it's way to attend to your every service need. Great staff in every department. Many staff have been with the 4S for years, know their guests and how to treat them well. This hotels runs with precision. Concierge desk is also very well experienced and can procure tickets and reservations to just about anything you can dream of!", "Date": "December 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great staff, hotel soon to be relocated to a new tower”", "Author": "Jennifer S", "ReviewID": "UR121858454", "Content": "I stayed four days in end of November / early December and attended a dinner event for 400 at the hotel mid stay. The staff are lovely, helpful, personable, but not intrusive. The hotel is lovely - interesting glass sculptural decor in the restaurant, uncomfortable chairs. The pool area is dated but the rooms are comfortable. The hotel itself is scheduled to close next year and relocate nearby, so some of this is understandable. Would have appreciated better (any!) information in the room on nearby restaurants and attractions like the Royal Ontario Museum. The gala dinner for 400 was extremely well executed in terms of food and drink. The ballroom was glittering, spacious and beautifully decorated for the event. Some problems with audio-visual execution during the event but that may have been a third-party vendor. Excellent business centre. The rack rate versus event rate for a standard queen room on the 10th floor differed by more than $200/night. They make it up on the room service: chicken soup, toast and cheese for $43. On heading home, be sure to say you want the flat rate to the airport -- although the City sign in the cab says flat rate or the meter, whatever is less, once the meter was on, no flat rate. Ah, cabbies!", "Date": "December 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "CT", "Title": "“The Grande Dame of Toronto”", "Author": "MisterOpinion", "ReviewID": "UR121762114", "Content": "I first stayed at this hotel in the 80's. It was in many ways the first deluxe hotel anywhere that set new standards in service and staff excellence. The excellence of the service and staff attitude is still evident all these years later. It's scheduled to close sometime in 2012 when a new high-rise 4S opens a few blocks away - but until then it's still worth incorporating this hotel into your plans. The thing that struck me - is this hotel is spotlessly clean. The rooms - while a bit 70's-80's looking with repro antiques type furniture (and totally wacky Ikea type louvered wardrobe doors) are very well kept. You could probably get on your hands and knees with a magnifying glass and find no dirt or fluff. The bed was comfortable with high quality linens. The bathroom was small - but all such hotels had that size bathroom when they were built - but again, it was spotless. Good quality soaps etc. I ate in the Cafe on the 2nd floor - very bright and colorful - for dinner it was empty - but they had a interesting Prix Fixe menu which was very good - the only comment I'd make - is that dessert (which I wouldn't normally eat but was included) selections were all pretty much the same - cake/pudding type of concoctions and the \"yoghurt parfait\" was just a disappointment. Chef--put a sorbet on there or something! The Cafe does a great trade at lunch - and while good, I thought a touch pricey. The 2nd floor also houses the banqueting facilities and did have a slight marie-celeste feel to it. There was something - a store maybe - that used to be there called Truffles? It looked rather sad, like a mall closing down - why not do what department stores do when dressing their windows - put up some kind of screen that says \"pardon our appearance...\" -- or maybe the imminent closure makes it unecessary! When I stayed there years ago - I am sure the lobby had more color to it - some chinese urns or Foo dogs used to be there and reflected the eclectic heritage of 4S? It now is just a plain lobby - could be an apartment building -- which I guess may be next on the cards? Anyhow - Four Seasons have some of the best staff in the hotel industry and it continues to show here. Mr Sharp -- \"Bravo!\"", "Date": "December 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Thanks to Isadore Sharp”", "Author": "Concierge34", "ReviewID": "UR121341429", "Content": "I was in Toronto in April for a Congress and during the confrence one of the speaker was Mr. Isadore Sharp who is the founder of Four Seasons Hotels. Next day our dinner was organised in Four Seasons Hotel. To be honest yes the hotel is old but the service quality is perfect. Their Concierge service was excellent. He recommended a very nice tour schedule for us. Restaurant atmosphere is as always in Four Seasons. Very nice food. I met with one of the Manager who is from Istanbul. Staff was amazing. What I onbserved in Canada is people are so kind.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“A fantastic Group Conference Event at the Four Seasons Toronto.”", "Author": "Valerie B", "ReviewID": "UR121244874", "Content": "Our Business Group Conference was an absolute hit at the Four Seasons Hotel Toronto . This hotel is classy, service is impeccable and the location if amazing for those who enjoy shopping or just gawging at the great shops on Bloor street . We had Mr. Dimitrios Zarikos, Regional Vice President and General Manager as a guest speaker at our conference and he absolutely blew us all away with his \"savoir faire\", his ability to recognize the needs of their clients and to ensure your stay at this hotel is a memorable one. He was infact quite funny and entertaining. The hotel, location, rooms, staff, service and the food were all top notch ! I certainly give this hotel an A 1 rating.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Boston", "Title": "“Enjoy it while it lasts”", "Author": "boston65", "ReviewID": "UR120998854", "Content": "I need to admit I am biased - we've had many great stays at this hotel and have very fond memories. The hotel is scheduled to close in March of 2012 to be replaced by a new building just down the block. Yes, the rooms are a bit tired, but the linens are perfect and everything is spotless. The ambience comfortable but not trendy. What makes this hotel is the people, the service is perfect. The folks here go out of their way to help, to make kids feel welcome and to tend to anything you throw at them. Enjoy a classic hotel experience while its still around.", "Date": "November 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Agoura Hills, California", "Title": "“You get what you expect when you stay at the Four Seasons Toronto.”", "Author": "scott f", "ReviewID": "UR120997269", "Content": "Everything you would expect in a quality hotel you get at the Four Seasons Toronto...", "Date": "November 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Every detail attended to”", "Author": "MelbourneGracie", "ReviewID": "UR120837769", "Content": "Thoroughly enjoyed our five night stay here. First impressions were great with the very professional and friendly staff who greeted us, the gorgeous flowers at entry level and a large and comfortable room. We attended at wedding at the Four Season while we were staying there and it was fabulous. Loved the surrounding area which is dense with restaurants and up market shops. Easy access to the rail system to access downtown and the rest of Toronto.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Dusseldorf, Germany", "Title": "“Comme ci comme Ã§a: good service but outdated property”", "Author": "YoshiDus", "ReviewID": "UR120693738", "Content": "Be careful: as mentioned before FS will open a new hotel in 2012. This property is certainly outdated. So if you are looking for a brand new hotel with all the usual modern gadgets, this might not be the one to choose. Nevertheless we got a exceptional good rate combined with complimentary perks like a suite upgrade and free breakfast and lunch so I have to admit that this made up for the outdated property. In contrast service was good as expected from as FS. If I would have paid the rack-rate my rating would have been considerably lower!", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kitchener, Ontario, Canada", "Title": "“Yorkville Toronto Treasure”", "Author": "Jim B", "ReviewID": "UR120693187", "Content": "The Four Seasons Toronto lives up to reputation. Upper scale part of town, around the corner from all the fine shops on Bloor St, Holt Refrew Department Store, and all the smaller quaint boutiques. I stayed there with a friend. We had a small suite, french doors closing off the bedroom, a designer approved living area and private dressing room. Great bathroom with all the amedities except a flat screen. Smelled great, clean, and expensive. The lobby is adequate, a weird entrance if I recall, you go through the parking garage, there are cars lined up in front, not so grand but well protected. A maze of stores outsirts the building. A nice eatery for people watching windows Yorkville Ave, and a second floor restaurant I found boring. A busy place at TIFF, again one of the better places in town. It is somewhat midtown as the lake and Harbourfront would be a 20 minute drive or subway, as is the theatre district. The Hyatt is just across the Street, and lots of smaller boutique Hotels close by as well, Dining great choices in this area as Fashion Shopping. The ROM Museum right on the corner and Saffafrass bistro a block away in Yorkville, fun for an afternoon cocktail. Starbucks close by as well. I enjoyed this stay and my very selective NYC friend will Only stay at Four Seasons Hotel while in Toronto.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“So recommended !!”", "Author": "starclare", "ReviewID": "UR120673942", "Content": "Love this place, luxury without being pretentious ! a most relaxing and lovely hotel!!", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Very nice hotel”", "Author": "Syd A", "ReviewID": "UR120295601", "Content": "This is a very good choice right in the heart of the City. One of the few highrise hotels in Toronto with Balconies. The room was great, spacious, with a pretty decent view of the city. Although people have complained that the decor needs an update, I found the rooms to be great, with a comfortable bed, separate sitting area and a big balcony. Front desk staff were very polite and helpful. The food wasn't too great however. But given the dining options around the area, this shouldn't be a deterrent.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Philadephia", "Title": "“Toronto Trip”", "Author": "Steven B", "ReviewID": "UR120156281", "Content": "Rooms need upgrading. Room was dark Need new TV's Should have free wi fi in rooms & meeting rooms.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Nice but no longer enough”", "Author": "Dom S", "ReviewID": "UR119598098", "Content": "After 12 years I came back to stay for one night in this 31 story hotel in the heart of Toronto. Although the reception was kind and I appreciated the upgrade they gave me, the hotel and definitely its bath rooms looked as they could need some new investment. When I put on the air-condition to heat up my room, the door that connected my suite with the one next door began to rattle. I had to put a towel into the empty space between the door and the wall to get this fixed. When I finally got ready to take a shower I found the bathroom had no walk-in shower and most of its tools seemed somehow outdated. I got further irritated when I could not find the usual white hotel slippers when I came out of the shower. All this looked somehow more splendid 12 years ago...", "Date": "October 22, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“No consistency”", "Author": "irene2211", "ReviewID": "UR119497343", "Content": "Stayed in this hotel for a conference. I was very excited for my stay as I am a hotel snob and will only stay at 5 star hotels. I love having the luxury while I am away. I was very disappointed when I checked in. The front desk was not friendly and not unfriendly they were just there. My room was nice but as others have said the hotel is dated. They have not fixed it up since they will be moving tho their new location in July 2012. As I watched the wait staff during our meals they treated everyone differently which I thought was not very nice. The best thing about this hotel is the housekeeping staff. They seem to be the only ones smiling in the hotel. The morning I checked out I walked through the lobby with my arms full of garment bags and luggage not one staff member asked me if I needed help. I have never seen poor service like that from hotel staff. I had just been at the trump hotel where I was treated like the hotels only client, at the four seasons I felt like no one cared about anything. I do live in Toronto so I hope when the new four seasons open they raise the bar.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Victoria, Canada", "Title": "“Service Great but Hotel is Getting Old”", "Author": "GIMD", "ReviewID": "UR119462217", "Content": "I stayed here for four nights in October for business. The service was great as expected but the hotel is showing its age. My room had a small bathroom and a CRT style TV! I have not seen one of those in a while. The room was in need of updating but was still quite nice. They are building a new Four Seasons hotel just a few blocks away and clearly are putting their resources into the new building. It is scheduled to open next year and I am sure it will be great. Overall, the current hotel is okay for an aesthetics point of view and the service remains great. If you can get a decent rate, it is a good choice. When the new hotel opens next year, I am sure it will be the place to stay in Toronto.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kitchener, Canada", "Title": "“It's all about the service...rooms are tired”", "Author": "musicmansimpson", "ReviewID": "UR119417460", "Content": "It's very tough to decide what to rate this property. I think everything has to be in the context of what is paid for the hotel. This hotel is normally quite expensive; however, I paid a corporate rate which was half the going rate on the website. I also booked a standard room, but got upgraded to a two-room suite. The service is fantastic, but the rooms are actually a little sub-standard for Four Seasons -- which is a shame considering this is the original Four Seasons hotel. The lobby is stunning, the service from the staff is wonderful, but the rooms are tired. The decor is old, and just...tired. It's sort of like the King Edward hotel..It's not updated decor, but it's not stylish classic either. For stylish classic see the Four Seasons Paris, or the St. Regis New York. This is just 1980s-1990s Golden Girls hotel decor. That said, at my rate, I was absolutley delighted with my room and with the hotel. If I paid twice as much, I'd probably be a little cheesed off, as the value would have been terrible.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newmarket, Canada", "Title": "“Lovely stay.”", "Author": "Bo V", "ReviewID": "UR119280471", "Content": "Lovely stay. Friendly staff and great amenities. Enjoyed the rooms and services and would recommend the hotel to anyone. The business centre was very convenient and had great internet access and allowed private office-style cubicles. Great experience.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“Nothing great...”", "Author": "kinetics65", "ReviewID": "UR119117668", "Content": "The other reviews give me the impression I was at a different hotel. I just thought it was \"okay\" and not great quality. I didn't get a bucket of ice,or turn down service. My bed was nothing special related to sheets or mattss. When i got outside, the doorman called a cab. My boss and colleagues got in the cab and we looked at each other and commented how could the four seasons allow such a disgusting cab to be used by it's clients. The next day we organized our own cab service. Not happy about paying for the internet so I didn't but needed to. Traffic could be heard through out the night. Ac unit only had a temp gauge and no fan speed. Had it had a a high fan speed I might not have heard the Traffic. p.s trash pick up is at 430am.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kitchener, Ontario", "Title": "“Elegant but expensive!”", "Author": "Bailey144", "ReviewID": "UR118716805", "Content": "We stayed at this hotel in order to attend a wedding and a brunch that were held here. It is an excellent luxury level hotel. Everyone was helpful and attentive. Our room was lovely and nice and quiet. We liked the added touches: l'Occitane toiletries, white terry bathrobes, ice in the ice bucket and a turn down service. The hotel has a great location, at the corner of Avenue Road and Yorkville. Although the Toronto film festival was running, we didn't spot any celebrities. The view from the brunch room on the 32nd floor was spectacular!", "Date": "September 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hong Kong, China", "Title": "“Good business hotel”", "Author": "JennyKiz", "ReviewID": "UR118432333", "Content": "Was in town for a conference at the hotel, stayed here for two nights. Was expecting a glamorous lobby, Four Seasons type, but was greeted by a very watered down, business hotel type of lobby. I'm guessing this might be typical for Toronto Hotels? The room was bigger than usual though, and the bed was very, very comfortable - made it hard for me to get up in the morning. Service was very friendly and helpful. The toiletries were from L'occitane - definitely more than your typical wholesale shampoo and body wash crap. Only bad thing was that it would have been nice if they let me check out late - I surely could have used a nap in the afternoon before my 15-hour flight.", "Date": "September 21, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Gatineau", "Title": "“Most amazing hotel stay!”", "Author": "ottawa_real_estate", "ReviewID": "UR118179979", "Content": "Most amazing hotel stay ever, the turndown service and friendly, helpful staff all made this a visit to remember!", "Date": "September 15, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Canada", "Title": "“Classic. Enjoyed it.”", "Author": "guybeachbum", "ReviewID": "UR118060276", "Content": "This hotel is very well-run. Staff are friendly and helpful. Room was HUGE with excellent toiletries (an added bonus). The ball room on the upper floor (should you get a chance to get up there) has fantastic views of the downtown and through to the lake. Location is very central for shopping in Yorkville. A short subway ride or 10-15min walk to Queen/King/Front streets. A great place to stay in TO!", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Service": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“5 night stay in luxurious setting.”", "Author": "tuttle7457", "ReviewID": "UR117789979", "Content": "A luxurious treat in the heart of Toronto. To be expected of a luxury hotel. Rooms are spacious, and our views were excellent. Parking and internet access are pricey but convenient.", "Date": "September 7, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Chicago", "Title": "“An old Four Seasons - and not in a good way”", "Author": "prpro70", "ReviewID": "UR117721710", "Content": "It is sad to see such an iconic brand known for its style and class look so run down. I stayed here for 6 days (combo business/personal). The hotel looks much as it did in the 80s - furniture, furnishings and soft case goods (drapes, rugs, carpets, etc) hasn't changed either and that's a shame. I did have a nice corner suite with a balcony, however, the balcony was pigeon poop heaven. Too bad because otherwise I could have sat on the balcony looking directly onto the Hazelton and wished I was staying there. The room was allergy central so the housekeeper nicely set out a humidifer because she thought it would freshen the room and clean the air. I will say the shower water pressure was fab and location fantastic. During my time there I had many a baquet style meal in conjunction with our work events. The food was pretty good for The service wasn't exactly up to par either. They thoughtfully delivered a slice of bday cake for my bday. It wasn't great so we only ate a few bites. Two days later the cake still sat in our room, housekeeping just left it there. Sad, she was very sweet but that aint the FS way at all.My reco - if you have stay in the area go to the Hazelton or Park Hyatt. Note: the FS is opening its new hotel just 5 blocks away in Sept 2012. Ah til then...", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Cambridge, Canada", "Title": "“- excellent service, supremely comfortable beds, great breakfast, heart of Yorkville...loved it!”", "Author": "Robin A", "ReviewID": "UR117491899", "Content": "Went to see theatre district to see a show and checked in early for afternoon shopping, walked along Yonge and Bloor, did Yokville, Eaton Centre, taxi ride was only 11 dollars for ride to show... left our car all day in the lot as parking was 30 overnight and for 24 hours - can't beat that for Toronto..... Had a great stay!", "Date": "August 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bolton", "Title": "“Very amazing location”", "Author": "Kyle M", "ReviewID": "UR117379778", "Content": "This was an amazing place to stay it's very clean and close to everyjing. It's close to nightclubs bars and an elegant town.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Albany, New York", "Title": "“Loved The Four Seasons Hotel in Toronto!”", "Author": "epangb8534", "ReviewID": "UR117234202", "Content": "We attended a wedding in Toronto. The reception and morning after brunch was held in The Four Seasons Hotel. Our experience at The Four Seasons was phenomenal!!! Everything was perfect: check-in, room with view, restaurants, location, concierge, staff,...", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lexington, Kentucky", "Title": "“Excellent service! Food Wonderful!”", "Author": "Donna M", "ReviewID": "UR117139211", "Content": "Could not have been more pleased and satisfied with my stay at the Four Seasons Toronto. The staff was most helpful and pleasant and catered to our every need, and the food wonderful! A great experience...will miss the old hotel, but the new Four Seasons will be just as fabulous, I have no doubt!", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Fabulous stay, great staff”", "Author": "anm123", "ReviewID": "UR116997905", "Content": "Our family of four stayed at the hotel for 3 nights and we were very impressed with all their personal touches for our 2 kids. The room was nice and comfortable, a bit dated in the decor, the bathrooms had amazing water pressure. The staff was incredibly friendly and made us feel most welcome. The gym/pool area is small, but sufficient. The location is fantastic. I would definitely recommend this to family/friends and would absolutely return for another stay!", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Bermuda", "Title": "“Very nice personal touches by the staff”", "Author": "mrduffy", "ReviewID": "UR116960282", "Content": "We've stayed at this hotel before and always enjoyed it. It's in a great location. The staff is friendly and helpful. They go out of their way to make kids feel welcome which is nice. I'd say the rooms could use a bit of updating but other than that it's a nice place.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "East Hardwick, Vermont", "Title": "“Staff is excellent-Hotel is beautiful and very clean. Central to most in Toronto.”", "Author": "Deborah_Hartt", "ReviewID": "UR116921426", "Content": "Just in town for a wedding, but how wonderful to be treated like royalty at our hotel. The staff was as professional and courteous as any I have ever met. The rooms were clean and beds were really comfortable. Sheets are quality and soft, as were the pillows! Within walking distance to dozens of restaurants, clubs, shops, etc...Flower display in the foyer is worth the trip.", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "orchard park, ny", "Title": "“Wonderful Hotel!”", "Author": "lskwara", "ReviewID": "UR116661178", "Content": "We stayed here the weekend of 8/6/2011 to celebrate our 17th anniversary. We decided to bring our kids ages 7 and 12. This was a very last minute trip and everything went extremely well. My husband called in the morning, reserved a suite, told them we were bringing our children and it was our anniversary. We were greeted immediately when we arrived, they opened the car doors for everyone, took our luggage and showed us where to check in. At the front desk we were greeted by name, even the kids, and wished a happy anniversary. They had a wagon full of goodies for the kids to pick whatever they wanted.....that was a big hit! In our room there was a plate of four gourmet chocolate chip cookies, two glasses of milk on ice (for the kids) and a piece of cake with \"congratulations\" written in chocolate. It was a very nice touch! The bellman immediatetly brought some ice in a stainless steel ice bucket.....that was nice too. So far the service was impeccable! The room was great! We had a separate bedroom with a king size bed and full bathroom. Everything was very clean. The kids could either sleep in the pullout sofa bed or twin beds. We elected the twin beds which were already setup when we arrived. This was nice because then we could still use the sofa without the bed being in the middle of the room. There was another full size bathroom for the kids to use......that came in handy. Our bed was very comfortable......pillow top mattress with a down duvet and down pillows. I'm paranoid about all the bed bug stories you hear in the news so I always check the beds wherever we go......the mattress looked brand new. We also had a great view of downtown Toronto! We had dinner in the hotel restaurant. The food was very good but the service was a bit slow and the waiters were somewhat aloof. Not a big deal but worth mentioning. Check out is at 12:00 noon, but we were running late so I called the front desk to let them know. They immediately called me by name and said it wasn't a problem. Check out went just a smoothly as check in. This kind of service should be expected in a five star hotel and we were not disappointed! Everything was wonderful and we would definitely stay here again! The cost of the room was a bit pricey but we slurged since it was our anniversary!", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Beautiful hotel, will be back.”", "Author": "Priya P", "ReviewID": "UR116629759", "Content": "The staff was great, close to shopping, and restaurants. Excellent service, very clean. House keeping check up on you to see if you need anything. Very comfortable bed, pure luxury.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“I won't stay anywhere else!”", "Author": "J10155004", "ReviewID": "UR116399394", "Content": "We just got back from two nights at this hotel, and we had an amazing time. The room was beautiful, and rest of the hotel for that matter, was beautiful. Some reviewers have complained of dated, old, or musty rooms -- I don't know which hotel they stayed in, but it certainly wasn't the same one I visited. The wallpaper and paint looked new, the carpet was clean, the furniture was beautiful, and we had the most amazing view of the city and the CN tower from our balcony. The bed itself was possibly the most comfortable surface I have ever slept on. The hotel staff were amazingly polite and professional. We were always greeted by name, with a huge smile. A staff member opened the door for us every time we approached, and they even pushed the revolving door (I'm imagining someone complaining about that not happening... \"I had to PUSH the door ALL BY MYSELF\") We used in-room dining for breakfast both mornings, and each time the food was delivered quickly by a very courteous staff member. The coffee was hot, the food was warm, and with a $75 food credit included in the cost of the room, the price was right. The concierge was very helpful, arranging tours of the city, suggesting restaurants and nearby attractions, and making sure we had everything we needed to enjoy the weekend. It certainly wasn't an inexpensive trip - close to $300 per night after taxes, but it was worth it. We were close enough to downtown to easily walk anywhere we wanted but far enough away that we weren't kept up the noise (in fact once we shut the door to the balcony we couldn't hear anything outside), the room and view were gorgeous, our breakfast was included for both mornings, and housekeeping stopped in twice a day while we were out. I would recommend this hotel to anyone staying in Toronto for any length of time. It was an absolutely wonderful experience", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Newcastle, Ont, Can", "Title": "“A wonderfula place to stay and be pampered.”", "Author": "juljefjos", "ReviewID": "UR116315289", "Content": "I had a great time. The staff are very polite and helpful. The bed was extremely comfortable.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Montreal, Canada", "Title": "“Overall average, not 5 stars”", "Author": "Shinybijou", "ReviewID": "UR115972108", "Content": "We were greeted nicely and our room was pretty clean and well stocked. However, what turned us off was the staff at the breakfast place. He was very slow, rude, with attitude. Of course, we complained about him to the hotel, for which they only gave us a coupon for an upgrade next time we go there. Not very motivating to go back. Only thing that would make us go back is there Afternoon Tea (High Tea). The tea experience was delightful. Next time, I'd just stay at another place, have breakfast at another hotel and go there just for tea.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3"}, "AuthorLocation": "Oakland, California", "Title": "“A bit tired for a Four Seasons”", "Author": "gnat23", "ReviewID": "UR115917971", "Content": "Well located hotel in Yorkville. Conference was at the hotel which was very convenient, and given the conference rate it was adequate. Had I paid full four star price I would have been disappointed. Rooms were nice on surface, but a look at details revealed old and tired fixtures falling out of bathroom wall, older wallpaper etc. Hair dryer was tiny little travel dryer you find in a lower star hotel. Staff were pleasant and helpful and conference food was fairly good.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“We felt at home, everything was just perfect. The best service, wonderful room, good food, nice spa, central location.”", "Author": "Chambesy", "ReviewID": "UR115628353", "Content": "We had booked a suite with two extra beds in the living room. The price/quality ratio was very good in comparison to other hotels where we had stayed on the same trip in Cambridge (MA) and New York. Service extremely friendly and efficient. Everyone seemed to go out of their way to make us feel happy. It started on the first day when we had to leave shortly after arrival in the afternoon and I hadn't eaten at all. The bar in the lounge where afternoon tea was being served quickly prepared some sandwiches for me in a lunchbox to take away. Concierge advice quick and useful. Swimming pool nice. Excellent bathroom products. Good beds. Luxury combined with personal service. When our daughter fell ill during our last night and had to be taken to the hospital it took two minutes to have a first-aid trained staff member in our room! Very impressive. And after a long night in the hospital the hotel called us to offer we could stay as long as we wanted instead of the usual 11am check-out time. We didn't have to ask. We hope to have a chance to return to Toronto soon!", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto", "Title": "“Still our favourite in T.O.”", "Author": "Ridgesas", "ReviewID": "UR115481888", "Content": "Stayed here for the weekend to celebrate our Anniversary. We were married here at \"Windows\" 10 years ago and keep returning to celebrate our anniversary each year. We live 30 minutes outside the city so we enjoy the break an a little R&R. The building is a little older than some of the newer hotels that have been built over the past few years and is due to be replaced over the next few years. Even though the building may be old, from the moment you walk in it is typical Four Seasons. Understated luxury, top notch service and very clean. We had a one bedroom suite on the 18th floor with a great view. The suite had two full washrooms, two full closets which was very nice and a nice sitting area and very comfortable bed. We used this hotel as a base for exploring the city. We rented a couple of bixi bikes and rode along the Lakeshore Avenue trail and had a great picnic. We also lounged around the pool and deck area which was quite lovely. The staff is wonderful. The concierge was able to get us great tables at some of the best restaurants around the hotel and were extremely helpful. While we are looking forward to the new hotel, we are a little sad that this property will be closed down as it is a truly great hotel and the \"flagship\" of their portfolio. We will definitely return once more before the lights go out.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Jerusalem, Israel", "Title": "“If it's in your budget definitely choose the Four Seasons Yorkville”", "Author": "Lasndownelady", "ReviewID": "UR115333718", "Content": "Experience unpretentious luxury and comfort in the heart of Toronto, Hotel staff are most attentive and the hotel's attention to detail is superb,. Enjoy a wonderful hotel experience.", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Beautiful Hotel in the Heart of Yorkville”", "Author": "M0LLYM00", "ReviewID": "UR115158934", "Content": "I stayed here as part of an organised trip, the standard at the hotel was exceptional. Breakfast was amazing and the choice fantastic. ( ask for fresh fruit in addition and request a doggy bag) Products in bathrooms smelt wonderful beds amazing , so comfortable, we were on the 30th floor and the view across Toronto fantastic We drank in the hotel bar one evening and did have to keep an eye on the bills we were signing as our waitress made far too many errors!!", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Ontario, Canada", "Title": "“The place to stay for the Toronto experience”", "Author": "G10b3tr0tt3r", "ReviewID": "UR115019205", "Content": "I have stayed in many hotels in Toronto but the location of the Four Seasons is by far the best. There is so much happening around you- from great shopping to great restaurants. It has been said, yes, the hotel is a bit outdated but it isn't dirty or run down. The beds are the most comfortable beds I have ever slept in. I wish I could have experienced more of the hotel (pool, dining) but I was too busy enjoying the city- like I said, it is so close to a lot of the great parts of Toronto. You are walking distance from Bloor, Church and Yong Street. FYI- there is a Starbucks just outside the lobby doors of the hotel.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Maxwell Smart Magic”", "Author": "PFoggSydney", "ReviewID": "UR114900525", "Content": "We booked in the Park Hyatt across the road, it was way below Park standards, so we checked out instantly. What a good move. Yes the 4 Seasons Toronto is old, the new one is being built down the street,nevertheless it is a very good hotel. OK the dÃ©cor is very Maxwell Smart but the staff makes this place sing. They are friendly and efficient and take pride in there work. Our suite was on a high floor, with great views of the city, and excellent morning sun. The cafÃ© was a good place for a drink and dinner, and it is also very much a location scene. In the end I became quite attached to my journey back to sixties. You could imagine the men in the tuxedos and the women in their ball gowns and cigarette holders floating down the hallways.No matter how flash the new 4 Seasons Toronto is when it opens, it is unlikely to match the soul of this old darling. A treat.", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great stay”", "Author": "pnkcarnation", "ReviewID": "UR114694980", "Content": "Stayed here one night, with a corporate discount in a superior room. The room was nicely appointed and well maintained, if a little dated. It can with a balcony, which would have been nicer if it was furnished. Bathroom was average size and marble. Bed was super comfortable. Turn down service was average, though a welcome sight after an evening of work! The best part was by far the pool. Being a Sunday afternoon, it was fairly uncrowded, and the service was impeccable- what you would expect from the Four Seasons. Had some lunch on the terrace (fairly reasonable, though I did order chicken fingers from the kids menu). Free bottles of water and iced punch were welcome on a hot day. Just a really relaxing experience. Over all, would I stay here again without the corporate rate? Probably not. There are many other hotels within the same price range with more modern accommodation that I would want to try. That being said, if you want to be guaranteed superb service then I would recommend it.", "Date": "June 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“A bit tired but still classy”", "Author": "iirashid", "ReviewID": "UR113209437", "Content": "Once Toronto's flagship hotel. But now other trendier places to stay are popping up everywhere. The Four Seasons is building a new hotel nearby and its resources may be stretched. The rooms are a bit tired and out of date. But the quality and service are still top notch, the restaurant and bar excellent and the location can't be beat. Still a star....", "Date": "June 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Lovely Stay!”", "Author": "Peachez008", "ReviewID": "UR107705486", "Content": "I had the pleasure of staying at this hotel for one night while on a business trip back in February. This was my first time staying at a Four Seasons and I must say, the hotel and my room were quite lovely. The staff at the front desk were very polite and professional.The only thing I would improve on is their room service. I had ordered breakfast to be delivered to my room. They did ask me what time I would like it to be delivered, and although it was delivered on time, it arrived more on the cold side which was unfortunate. However, seeing that this was a business paid trip and I was in a hurry to get to the airport, I didn't make a fuss about it. I did appreciate their business center with free internet access and the ease of checking out. Now based on the price, I'm not sure I'll be so quick to stay at the Four Seasons for leisure as there are so many places in Toronto you can stay for less and are very nice as well but if your company can manage to have you stay at this hotel, it's all good. It's a great place to stay for business purposes and if you want to treat yourself or can find a good deal, you'll enjoy your stay.", "Date": "May 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“impeccably professional without any pretentiousness”", "Author": "louie39", "ReviewID": "UR104613408", "Content": "The staff throughout the hotel were perfect - friendly and helpful without ever being overbearing. Food, whether room service breakfast or in the restaurant, was extremely good (though my only complaint is the coffee was terrible). The room was extremely comfortable, and I loved the L'Occitane toiletries. A very good hotel.", "Date": "April 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Probably one of the best hotels in Toronto”", "Author": "WorldTravel_2011_88", "ReviewID": "UR100352799", "Content": "I stay in hotels often but I didn't really know what to expect as this was the first time I had booked a stay at the Four Seasons. I started with really good impressions as soon as I entered when the staff came over to greet me and immediately made me feel at ease. They were very professional and helpful. But the real surprise was when I opened the door to my room. The room was huge! the bed was really comfortable and first class! For the price I paid, I would say this is probably one of the best value for money I have ever experienced. The staff went out of their way to make my stay the best, and I would definitely recommend this hotel to other travellers!", "Date": "March 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Fantastic Hotel!”", "Author": "VeroniquePalmer", "ReviewID": "UR99950883", "Content": "One of my best international stays ever! That bed is something I will never forget. Pure sleep pleasure!! The hotel staff on all levels were super friendly and highly efficient. Even down to the room cleaning lady who was just so lovely and courteous. I also had an issue with my laptop cable which they sorted out in less than half an hour, which was a lifesaver as I was there on a conference. Absolutely brilliant experience, can highly recommend them.", "Date": "March 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“The most amazing '' service experience '' in the world !!!”", "Author": "carolinetrepanier", "ReviewID": "UR95276043", "Content": "It is a very comfortable trendy hotel, with beautiful beddings, trÃ¨s '''branchÃ©e'' , ... like many others, what really makes a difference and all the difference in the world is the authenticity of everyone working there, eager to serve you and make your stay the most amazing one ever... with respect, authenticity, professionalism ... I was treated like a rock star, a princess ... without being one ! I will be back !", "Date": "February 2, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "New York City, New York", "Title": "“Not up to standard for other Four Seasons”", "Author": "NYC2Ohio", "ReviewID": "UR85889174", "Content": "The service was amazing, as expected from Four Seasons and up to par based upon previous experiences. The lobby was beautiful when we walked in. I was excited to stay at the Four Seasons in Toronto, but I was disappointed with the old smelly room and the smelly carpet in the hall. Granted they are the first Four Seasons, but they need to update. Maybe, we just got a bad room due to the wedding rate. I felt like were were at the Holiday Inn.", "Date": "November 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Danville, California", "Title": "“One of the best in Toronto”", "Author": "Ayeletb", "ReviewID": "UR85509156", "Content": "This is one of my favourite hotels in Toronto because it's a reliable, gorgeous and very comfortable. I got there early and they had my room available, which was great. I had the trainee and he was good. Yes, they have wireless and it's expensive but at least, they have it and I bought the 5-day plan. Since I had a lot of work to do, it worked out great. They also have a car service to the financial district in the morning. You just need to book it ahead of time. The beds are super comfortable and it's just an overall great experience. I hope it will be available next time I am in Toronto.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ontario", "Title": "“I love the Fairies!”", "Author": "crossfitgirl", "ReviewID": "UR84785762", "Content": "Another great stay at the Four Seasons. My favorite thing about this hotel are the fairies. After leaving my room for dinner I came back to the curtains pulled, my toiletries organized and lined up, and slippers by the bedside. Their timing is perfect. Room service in the morning was superb and only took 21 minutes from the time I ordered till it arrived. Also, was given an upgrade to a suite. WOW!", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kelowna", "Title": "“Great”", "Author": "KelownaReview", "ReviewID": "UR84094378", "Content": "I stayed here for 2 nights and it was fantastic! The rooms were clean and the staff were unbelievably friendly! Love this hotel!", "Date": "October 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria", "Title": "“Excellent hotel if you get the right price.”", "Author": "Victag", "ReviewID": "UR70930476", "Content": "After reading many reviews for this hotel, I was reluctant to book due to complaints about old decor and some other negatives (perhaps these people prefer metropoliain style decor which this hotel is not) . Well I got a great deal so decided to take it and was I ever pleased. Not only did we have the best service I have ever experienced at a hotel, but our room was clean, tasteful and comfortable. Being able to use the minibar fridge to keep some personal items cold was a plus, but the items provided came at a large additional cost. Our kids were treated like royalty which they loved, and were given some teddy bears, cookies and milk. We used the pool and it too was clean and adequate. Having life jackets for the kids to use was another bonus. Being from a small town, there was a bit of city noise that we were not used to. The computer in the lobby helped us do pre-boarding for our flight the next day. All in all, another great stay at the 4 Seasons with the amazing service that will have me coming back again.", "Date": "July 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "somewhere", "Title": "“A nice hotel in Yorkville”", "Author": "MrEPGB", "ReviewID": "UR70334015", "Content": "First of all, I have experienced many different categories of hotel, ranging from paradisiac luxury to 1star hotel in the middle of no where. This hotel is fortunetaly closer of the top: the check in was fast and efficient, the lady was very nice, as many canadians are, We had two deluxe rooms, they where spacious and well appointed. Sadly the TV was VERY old and could be updated, same goes for the bathroom, which was rather small. The beds were simply the best I have ever slept in Finally breakfeast was a delight All in all, a very good hotel, but it *could* be put up to date with the latest technologies", "Date": "July 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Vancouver, B.C.", "Title": "“It all depends on the rate you pay”", "Author": "AdvisorKing", "ReviewID": "UR69591357", "Content": "I stayed at the Four Seasons Toronto for two nights on business while I attended a conference. I did not pay for the room because the conference organizers provided me with the room as a conference presenter. But when I checked in, it did appear that the conference rate recorded on the check-in document was $150 per night. I received a corner-balcony room on one of the upper floors. It was a very nice room with plenty of space. The fact that it was on a corner (with windows on one wall and a sliding glass door on the other) was a significant bonus for me. I didnâ€™t see any of the regular rooms, so I have no way of knowing whether they would have similarly impressed me. The hotel mainly services business customers, so it had the same look and feel as most business hotels of that class. The hotel has a very convenient on-line airport check-in kiosk/terminal in the lobby. With a combination of touch-screen and keyboard, along with pre-loaded airline website links, it is very handy and eliminates the need to request the services of the business centre to simply check in for a flight. There were some negative aspects of my stay. None of them are major, but combined they might make me think twice about staying here again. Room service was expensive. The evening I arrived, I ordered a clubhouse sandwich with a dessert and an inexpensive glass of wine. The total cost, which included no discretionary tip, was $67. In addition, the internet access cost $16 per day. There were some elements to the room that were showing its age. The TV was an older style model. The remote control was so worn that the volume control did not work properly (pressing it once would make the volume increase or decrease by five steps instead of one). The bathtub spout streamed water when set to â€œshowerâ€�. In addition, I am so accustomed to receiving a newspaper at my door that I found it odd that one was not provided, even given the nominal value of the newspaper. Their staff serviced the room twice on my second day there. Some customers might think of this as a valuable service, but it was completely unnecessary and, because I wasn't expecting it, it seemed a little creepy. I returned to my room that night to find the radio on with classical music playing. It sort of made me want to check the closets, just to be sure. On the other hand, the staff were all extremely friendly and efficient. When checking in, the desk clerk came around the desk to present me with my room card-key (Iâ€™m not sure why, but it seemed like a nice touch). And on check out, when I asked about storing my bags for the day, the desk clerk came around and took my bags, rather than simply pointing me toward the bell desk, which is what I was expecting. Overall, the complaints are relatively minor. However, they are easier to take at $150 a night (or zero, in my case) compared to the rate I see today on Expedia for the same two days of the week a couple weeks from now ($445 per night!). Also, keep in mind that the hotel is in the Bloor/Yorkville area, which isnâ€™t particularly convenient to the main downtown financial centre.", "Date": "July 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "BC", "Title": "“The Best of the Best”", "Author": "pesky11", "ReviewID": "UR68345624", "Content": "Four Seasons never disappoints. This location is great. Nice shopping and dining all around. Easy access to all of Toronto's amenities. I love this hotel. One of my all time business favorites.", "Date": "June 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "here, now", "Title": "“Still got it, but just...\"”", "Author": "romaroamer", "ReviewID": "UR66592656", "Content": "Some other reviews have been pretty harsh, and it's certainly true that the Four Seasons is beginning to show its age around the edges. But the rooms and bathrooms are clean, linens are crisp, bed is comfy, location in Yorkville is unbeatable, and overall it's a pleasant and pleasurable stay. My modest room on 16th floor had a small, lovely balcony too, for a soft and restful close to the day. I like cleanliness, comfort and just a titch extra space or luxe; Four Seasons delivered.", "Date": "June 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Very good service, high standard hotel, lovely location”", "Author": "MauveOrchid", "ReviewID": "UR66176187", "Content": "We had our wedding reception here and all went superbly well. The venue, decoration, catering ,logistics all flawless. We also stayed there for a week, a few days in a superb suite on the 29th floor , and a deluxe room on a lower floor. In terms of cleanliness, room quality and overall feel and comfort of this hotel, i can't find a fault. it definitely lives up to its 5 stars however at present it would need some updating and renovations in order for it to be as exclusive and unique as some of the other four seasons worldwide. I believe they have the intention to build a brand new four seasons a few blocks away and demolish this one, watch this space- i'm sure it'll be fabulous. If i had one negative comment it is that i expected a nicer, grander main entrance : there is a small side entrance on hazelton avenue but the main hotel entrance is more suitable for an entry by car then by foot (as it is also the car park entrance i.e. covered- no entrance directly on avenue road).", "Date": "June 2, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Awful Hotel-Stay away”", "Author": "------", "ReviewID": "UR64003578", "Content": "How would you like to pay lots of money for a hotel room and get the equivalent of a Motel 6 room? Then the Four Seasons Toronto is your place to be. The hotel has never seen a renovation since the early 70's. The staff think they are working in a first class hotel but they have a false sense of their surroundings. In the past 6 months I have traveled to the following Four Seasons Hotels and have been very disaapointed: Philadelphia, North San Diego, Palo Alto and Toronto. By far this is the worse of them all however the others were not spectacular either. I have discovered the Leading Hotels of the World collection and they have some very nice hotels. Check them out at www.lhw.com", "Date": "May 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Perfect Location”", "Author": "lrdjbb", "ReviewID": "UR63114109", "Content": "The Four Seasons is right in the heart of great shopping and restaurants. While it is still an impressive hotel, the rooms could do for a little update - they have a slightly dated feel to them.", "Date": "May 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Needs a Bulldozer put through it.”", "Author": "jolly999", "ReviewID": "UR60204533", "Content": "Quite possibly the most disappointing Four Seasons on the planet. Staff fine but building so tired. The Hazleton opposite knocks spots of it.", "Date": "April 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ontario", "Title": "“Wonderful!”", "Author": "DavidE1152", "ReviewID": "UR58993106", "Content": "As with all Four Seasons the service was superb! (I hear they actually time how long an elevator stays open so you can get your luggage in without it closing on you!) The staff were polite and very helpful. No attitude here. As for the decor for those who thought the rooms were outdated it sounds like trendy young things who are complaining. I found the decor warm and tasteful. Not like these soul less modern hotels where everything is steel, leather and glass. True, the architecture of the building does reek of '70s bunker but they are building a new hotel which hopefully will be more pleasing to the eye. Overall an excellent hotel with an excellent location close to the best shopping.", "Date": "March 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "NY", "Title": "“Great service, super old hotel”", "Author": "nycanuck", "ReviewID": "UR56682886", "Content": "We just returned from a nights stay at the Four Seasons in Toronto. Check in was polite and courteous, valet parking was a breeze. We were in a suite on the 15th floor in the corner with a large balcony. The room was so outdated, it was almost ridiculous. The suite was clean, but just so old! There was a tiny tv (probably 24 inches) that looked like it was about 20 years old in an armoire in the living area. The bathroom, while clean, looked like it was from the 1970's. No space, and everything was just so old. The bed was comfortable, and the hotel did seem very quiet for being in the middle of the city. We booked a room that included a $125 food and beverage credit, so we ordered room service for breakfast. The food was ok, the service for the breakfast was good. Location of the hotel is great, but really, in general, more is expected of the name Four Seasons. I am Canadian from Southern Ontario, and I first stayed in this hotel many years ago when I was a young child. Sadly, I think that the fixtures and the rooms are the same as they were many years ago. For a city of its size, Toronto has a severe lack of beautiful hotels to choose from. Looking forward to the opening of the Ritz Carlton and the new Four Seasons. Like I stated earlier, the service was great, but, for the money, there really has to be better options other than this hotel in Toronto. If you have ever stayed at another Four Seasons, you will be disappointed with this one.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Calgary", "Title": "“Heartbroken - Expected more from a five star”", "Author": "Notam", "ReviewID": "UR55210362", "Content": "Check-in was fast and efficient. I was afforded a great corner suite with a balcony and a view of the CN tower. The bed was lovely and room layout was more European than a larger American style; I am cool with that. What surprised me was there was no guest directory in my room (?). There was a directory of other Four Seasons properties (at this point, I wish I was at any of those!) I had no idea what restaurants were at the Four Seasons, check-out time, health club hours...., then I couldn't find the shoe scuff (they don't provide one). Then I couldn't find the coffee maker (you must request one). Basically the room felt stripped. I disliked the old school TV in the armoire with the volume which involuntarily changed. I do like L'Occitane toiletries, so that did score points with me and turn down each night was superb. Health club was good; liked the small but efficient indoor/outdoor pool. I did not find the service consistent to five star standards (sorry folks). I did appreciate the location and the occasional service that was consistent to the Four Season brand.", "Date": "February 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Ottawa, Ont.", "Title": "“Great Location, Amenities & Service”", "Author": "newschool_ski_bum", "ReviewID": "UR54010990", "Content": "Stayed at the Four Seasons for my girlfriend's birthday. I was a little surprised to be honest to see some of the photos of this Four Seasons, as like many people say its a bit outdated. However, from the moment I arrived, you knew you were at a 5 star hotel. The valet quickly took care of my car and all my baggage, and the doorman welcomed us to the hotel. Check in was a breeze and the hotel had placed a couple things in the room for my girlfriend's birthday, just as I'd asked. The rooms are nice, clean and pretty big for downtown Toronto. They could probably use a bit of a facelift, but nothing major. The service at the hotel was outstanding. We needed a reservation, they made it for us and provided us with a printout with the restaurant's address and everything. Our neighbours at the hotel were being extremely noisy and they took care of it immediately. We had an issue with the room service and the hotel management worked with me until they made sure I was happy with the outcome. There may be some more modern hotels in the area, but none of them will compare to the tried, tested and true customer service of this chain. I will be back to the Four Seasons in Toronto.", "Date": "January 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Toronto", "Title": "“Amazing Service”", "Author": "Jeff99Toronto", "ReviewID": "UR53331147", "Content": "I have to say Four Seasons is the best Hotel I have been in Toronto. Service is outstanding from start to finish.", "Date": "January 13, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "U.S.A", "Title": "“good as usual”", "Author": "philipexperience", "ReviewID": "UR52316431", "Content": "the usual four seasons experience. The service is efficient and the rooms well appointed. This hotel is in a good location.", "Date": "January 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Alberta", "Title": "“Nice Room, Some management Issues”", "Author": "Altasaurus", "ReviewID": "UR49264776", "Content": "My wife and I stayed for 3 nights in November 2009 in a very pleasant mini-suite with king bed and separate sitting area. The location is indisputably the very best in Toronto for shopping, dining, museums and getting around. The subway is very handy and taxis in Toronto are clean, fast and reasonably priced. You certainly don't need a car unless you are heading out of town. This hotel is being replaced in about 2 1/2 years with a larger building 2 blocks East (at Bay). We had one room service dinner late one evening that was very good and very promptly delivered. We also had drinks at the Avenue bar. Very pleasant. There were a couple of glitches with service, which were definitely not up to Four Seasons standards. Check-in (at 2:30 pm, not a particularly hectic time) was incompetent, and took almost 15 minutes. I was told that our room was not ready and then offered an upgrade, at a considerable extra charge. I have objected to this in other reviews. I am a good customer of Four Seasons hotels. If you have a vacant upgrade, why not reward your good customers? I guess I don't get it. Anyway I told the reception clerk that I objected to paying extra. We eventually negotiated a lower cost, but not until after he had disappeared into the back for about 5 minutes. It reminded me of the car salesman \"checking with my sales manager\". The other glitch was minor but odd. There were no bar glasses or wine glasses in our suite (normally there should be at least 2 high ball and 2 wine glasses). I called down to housekeeping to send some up. They said, \"We'll have room service send some\". The wineglasses from room service sat there for the next 2 days, never removed, never replaced. Otherwise housekeeping was fine.", "Date": "November 15, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Toronto", "Title": "“Overrated”", "Author": "Frosty306", "ReviewID": "UR48052575", "Content": "I was arriving from out of town and arrived past midnight. As all business travellers can relate, by the time you arrive you usually would want to check it quickly so you can rest before your business meetings the next day. The check-in counter lady obviously is not aware of this and proceed to ask me 20 questions about my preferences and background so she could check off her \"service\" list. For the amount I paid I expect high quality service that is expedient at 1 in the morning and also beautiful rooms. Four season as a five star hotel does not compare to Sofitel in either service or facility.", "Date": "October 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "North Carolina", "Title": "“Outdated rooms made up for by excellent service”", "Author": "CarolinaToTheWorld", "ReviewID": "UR40833432", "Content": "Stayed in August 2009 on a 3 day business trip to Toronto. My initial impression was not great as the room was very dated, first time I've seen an old CRT TV in a \"5 star\" hotel this year! That said room was good size and comfortable. But what saves this hotel is the service. Staff were very pleasant and very efficient. Never thought I'd say this in a review but I'd recommend the room service! Very good food and served very nicely, and they tell you that service is already included instead of sitting there waiting for you to fill in the 'extra tip' section! If they can renovate the rooms to bring them up to date I would imagine this place would be hard to beat. Still if you can get a good deal I think this is a very worthy hotel right now", "Date": "September 11, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Westlake Village CA", "Title": "“No Changes Encountered on Our Annual Trip to TO”", "Author": "TravelingTGS", "ReviewID": "UR38785745", "Content": "Our annual summer trip up to Toronto to visit the wife's relatives always finds us at the Four Seasons. We've been staying there for twenty years. The decor of the rooms is so out-dated it's almost back in style, but at least they upgraded the TV's. The rooms are very clean, with two visits per day by housekeeping. I do understand they are reluctant to put any money into refurbishing when the new mammoth Four Seasons is under construction on Bay near Bloor, but the fold out sofa bed in the parlor (Deluxe Executive Suite) is so uncomfortable, sagging, with jagged frame edges poking you in the back, we had to order up a rollaway bed. It's just not possible to sleep on this bed! Even the kids complained. Otherwise, everything was the same as usual. The service was excellent, food was good, but some of the staff seemed a little edgy. My wife had the same feeling, as did another family we chatted with by the pool. Don't know the reason...perhaps a new manager or something. One thing that really ticked me off, which has nothing to do with the Four Seasons, is that Ontario now imposes yet another tax on the traveler which isn't mentioned when you book the room. They have a destination tax, which they call a \"fee\", which in our case was $21.00 per night, x 5 nights. And if you can believe it, they then charge GST on top of the \"fee\". Outrageous! A tax on a tax, and double GST for a room. That, the current exchange rate, and the discontinuing of the tax rebate for visitors makes this an increasingly expensive trip. (Oh yeah...internet is $15 a day). The hotel is worth it, but OUCH! Anyway, the Four Seasons is still the best hotel in Toronto by far. We are looking forward to the opening of the new mega-property.", "Date": "August 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Excellent service but ultimately did not deliver.”", "Author": "luv2travelnow", "ReviewID": "UR37589158", "Content": "We selected this property because of itâ€™s proximity to meetings and Bloor Street Shopping. We were very anxious to experience the Four Seasons brand. The service was exemplary. Check-in was swift, and welcoming. A couple of requests to the concierge for assistance in setting activities for clients was sterling. Truffles was very good. Itâ€™s very understandable that regulars would appreciate the quality of personal service and return to experience it. However, for the price, this property is in dire need of renovation. Itâ€™s cachet as a Four Seasonâ€™s hotel will not sustain the dated and aging space for much longer. In this current competitive marketplace we felt that the value as a leisure hotel was not there. We certainly appreciated the value of the service for our business needs, but the dated image was not a plus. Weâ€™re torn, because the staff try so hard and execute so well, but, I think would not return to visit this property again unless it was renovated.", "Date": "August 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Toronto", "Title": "“Best Choice in TO.”", "Author": "Ridgesas", "ReviewID": "UR35685386", "Content": "Stayed to celebrate our wedding anniversary. Overall this hotel and staff are excellent. The rooms are spotless and clean. The service cannot be beat. The restaurants and room service is second to none. Truffles the fine dining resteraunt is one of the best in Toronto. For another nice resteraunt that is 2 minutes away, try Bellini's on Yorkville Avenue. It is a few doors down from the Four Seasons. Excellent food, service and atmosphere. Staff is accomodating and will think of everything and respond before you can even ask. Location is in midtown Toronto, a 3 min walk to the subway, 5 minutes by subway will get you downtown. Walking distance to great shopping and dining. We will be back in the future.", "Date": "July 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Excellent Service as Usual”", "Author": "EvanR", "ReviewID": "UR34014883", "Content": "My wife and I just returned from a three night getaway and the staff of the Four Seasons were everthing and more. Jason and Genevere and the concierge's desk were amazing with show tickets, and dinner recomendations. The staff at the outdoor pool and the bell staff were extrememely helpfull as well. The hotel might be dated but it is made up for with the staff and the location in charming Yorkville.", "Date": "July 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Huddersfield", "Title": "“A great hotel”", "Author": "HWO32", "ReviewID": "UR29753598", "Content": "I have been lucky enough to stay at the hotel twice now, and really enoyed my experience. The lobby area is a little small, but the staff are really helpful and make you feel very welcome. There are quite a few lifts too, which are really fast so no hanging around! The bedrooms are very comfortable, with great facilities and amenities. I had dinner and breakfast in the Studio Cafe, and both were very nice. My handbag broke whilst I was staying at the hotel, and this was fixed for me within an hour - which was really helpful. The hotel bar has a really good vibe - and the cost of drinks is as you would expect for the hotel. There is a pool in the hotel, and although I did go and see it, I didn't get wet - it looks great though! The hotel is in a great location for shopping, with Bloor St very close by. Enjoy your stay.", "Date": "May 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Waupaca, WI", "Title": "“4S Delivers”", "Author": "WaupacaTraveller", "ReviewID": "UR28383514", "Content": "Great location and a classy, clean facility are the best featrures. Staff are very attentive and helpful. Rooms are clean though furnishings are a bit old. I love this place for business in the city. Pool and gym are small compared to newer four seasons properties, but are in good shape and have new equipment.", "Date": "April 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Beautiful Hotel and many don't know, original Four Seasons”", "Author": "tcoop92", "ReviewID": "UR26417870", "Content": "I love this hotel! I have stayed here many times over the years. I always get a Four Seasons Executive Suite on a high floor. Try getting one on the South side of the hotel because that way you will have a view of the Toronto skyline (CN Tower, etc...) but the North side is pretty as well. The restaurants in the hotel are fantastic, we come here many times just for dinner or lunch or afternoon tea. Firstly dinner, there are two options: Truffles - the perfect place for a truely special occasion. Very formal and intimate, the food is extremely gourmet but LOVE IT! Studio Cafe - perfect for lunch or dinner. Very casual and fun waiters. The mac and cheese (even though on the kid's menu) is good for any age! Lobby Lounge - Afternoon Tea here is the best in Toronto. Amazing service. Lovely elevated area off the main lobby with floor to ceiling windows that sun just flows in through on a nice day. There is also a bar, Avenue, which I had lunch in once. For lunch it was not very good because the atmosphere was rather cold. But nice in the evening as a bar. Back to the hotel, while the pool is a nice feature, it is on the small side. The neat thing is that it is indoor/outdoor. For events, I have been in both the Main Ballroom (wedding) and Windows which is on the top floor and has a panoramic view of Toronto (corporate). Both settings were sensational, especially Windows! Sad that they will tear this down in a few years and move down the street to the new one.", "Date": "March 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Nice location”", "Author": "calster", "ReviewID": "UR23348661", "Content": "Since we couldn't find anything affordable at a warm location for the New Year's weekend, we decided to head for cosmopolitan, but COLD Toronto. The Four Seasons hotel is a nice property. Nothing exciting, but clean. The lobby is actually quite small and unassuming. A lot of staff, usually smiling. View from the upper floors are quite incredible. We had an Executive suite and again, nice, clean, but nothing exciting. Elevators were quick...but it's winter, so fewer guests. Since so many dining options in the area, did not visit the restaurants. The menus were impressive, however. The gym is well equipped with 4 treadmills, two recumbent bicycles, 2 elliptical trainers and one stairmaster; all have private televisions, headsets provided. The sauna is quite large. The whirlpool at the back of the facility is also large. The heated indoor/outdoor pool was awesome. Swimming while it was snowing was pretty darn cool. Reminded me of the Blue Lagoon in Iceland, but on a much smaller scale. Pool is maybe 30 ft long at most, so no real swimming as exercise to be done. The location is great. Yorkville has tons of restaurants, boutiques, department stores, a Whole Foods and a couple of subway stations nearby. The Royal Museum is also just a block away. The University is a block away as well. The concierge staff is incredibly knowledgable and gave us great advice. If you like Indian food, there is a great little Indian place just down from the hotel on Yorkville St. The FS staff go to lunch there. We ate there twice because it was sooooo delicious! It's called Utsav. Nice place. Kind of bland. Not as incredibly luxurious as other Four Seasons properties, but I would definitely stay here again.", "Date": "January 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Marietta, Georgia", "Title": "“Great service, but needs a facelift”", "Author": "Jim_In_ATL", "ReviewID": "UR22747959", "Content": "I've stayed at several Four Seasons properties and i have been using the NYC property as the benchmark Four Seasons. You can't get better than that hotel in North America, ok the Four Seasons in Paris might be a bit better, probably the world's best hotel, but in North America, the NYC I.M. Pei designed hotel is the best. That being said, I was not expecting the Toronto property to be as nice, but with Toronto being the Four Seasons world headquarters, I was expecting well above average. What we got was the impeccable service, being treated like they've known us for years, flawless check-in, walking up to the concierge desk I was addressed by name (how do they do that?), calls to room service answered on the first ring and I was addressed by name. The room was spotlessly clean, but dated and the bathroom was disappointing. No separate shower, and small. Nothing to really stand out. Why would I select \"above average\" and not \"average\"? Because the service does set this place apart from the others. Would I stay here again if I was going to stay in Toronto? Probably not. I would stay at the Westin Harbour Castle or the Delta Chelsea for less than half the price.", "Date": "December 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Yorkville", "Title": "“Great Place”", "Author": "LuxuryLover129", "ReviewID": "UR22618977", "Content": "Although the Four Seasons is on the more expensive side when you could stay at a very nice boutique hotel for less, you dont just pay for the room, you pay for the experiece:; the courteous staff, the nice rooms. I satyed in a suite which was very nice. Every luxury possible. If more on a budget and want supremem luxury i would reccomend a boutique, but if you need double beds and want a pool ( not a lap pool) there is no place superior. I also reccomend Truffles for diner or lunch.", "Date": "December 10, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Would Someone Please buy Room Service More Carts/Trays”", "Author": "The_Lewis", "ReviewID": "UR20692669", "Content": "Let's start with the obvious - it is a Four Seasons hotel, so in general the service was very good. The trade-off for that is always that the Four Seasons' rooms are small imho. What was unusual this trip was the room service. First, no-one picked up the telephone when I called for room service, very odd. Second, the room service clerk called three times on Sunday morning to ask to remove our breakfast tray. If the hotel is that short of breakfast trays, perhaps the hotel should invest in more trays. Other than that very minor comment, we enjoyed our Four Seasons' stay including the warm welcome from Florencia at the front desk.", "Date": "October 7, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Four Season tries hard.”", "Author": "LastMinuteDecision", "ReviewID": "UR20530982", "Content": "I'll keep this short and sweet. The Four Seasons Toronto is an aging 5-star hotel. You can see how it would've been a classic, 5-star hotel in, say, the 80's. But it was desperately in need of updating, when I stayed there. I have a rule I try not to break when it comes to booking a hotel in advance. I won't stay anywhere there is polyester floral bedspreads. And our King Suite ($500/night) had 'em. Luckily, we were staying there with our dog. As such, I bring a sheet to cover the bed, since our large dog likes/needs to sleep in a soft bed. In the pictures, it's easy to see how much nicer the bedroom would look with updated bedding, etc. I will say that the pet policy is two-fold. On the one hand, they do a bang-up job of \"welcoming\" (ahem) pet guests. On the other hand, their pet policy doesn't allow the dog to be left alone in the room. I hope anyone staying at this hotel with a dog is only in town to walk their dogs or sit in their hotel rooms and watch television. Because with no ability to leave the dog at \"home\" alone, you can't: eat in the hotel restaurant, go shopping, take in a film, go to a museum, use the hotel's gym, etc., etc. If you're only at the hotel for a place to sleep for the night, then you might really appreciate the doggie amenities we found. They include: breed-appropriate-sized dog dishes on a mat; bottled water for the dog; two hand towels and a bedspread with your dog's name embroidered on them; some doggie treats; and a dog magazine. Had the hotel had a more reasonable pet policy, I would be glowingly recommending this hotel for pet owners. Alas, I can't...knowing what I know. The place needs to be refurbished with more modern amenities. That said, our King Suite was comfortably sized, and everything worked properly. It did feel a tad dingy, though. There are some newer (or more recently renovated) hotels in Toronto I would likely recommend before the Four Seasons...which is a shame, because it has the potential to maintain itself as a premier Yorkville hotel.", "Date": "October 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Still the best in Toronto's big hotels”", "Author": "Payam81", "ReviewID": "UR20274774", "Content": "This was my first stay at a Four Seasons in a while but I was again treated to their excellent service nonetheless. Rooms are in the process of updating with new furniture. I was upgraded to a King room (originally booked queen) upon check in. My requested extra towels and amenities were at my room whit in 5 minutes of the request, something that sometimes takes several calls at, oh say, the Marriott on Bloor St. just down the road. Overall the personal service reminded me again of why I stay at Four Seasons.", "Date": "September 22, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "jakarta", "Title": "“Not worth the price”", "Author": "appletini82", "ReviewID": "UR19615950", "Content": "This is the first Four Seasons that I have stayed at,but if every Four Seasons all over the world is like the Toronto one,I wouldn't stay at another Four Seasons. The furniture is not only outdated,the shower curtain in our bathroom has black stains.This is Four Seasons!Surely they could have done better!We booked a Standard room and it was cramped compared to other 5 star hotel rooms that we have stayed in. This hotel just isn't worth my $500/night.", "Date": "September 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Gulfport, Mississippi", "Title": "“More like \"One Season\" vs \"Four Seasons\".”", "Author": "mississippi64", "ReviewID": "UR18991365", "Content": "My wife and I are huge fans for the Four Season's and could not wait to stay at their flagship Canadian property in Toronto (their corporate headquarters). The staff was professional, curtious and knowledgable. However the hotel is extremely out of date. The bathrooms are in desperate need of an upgrade. The furniture was old and the rooms were worn-out. The concierge was the high point. They made several restaurant recommendations that were terrific. I read the reviews on this website before I made our reservations. Frankly, I did not trust them. I thought there is no way that the Four Season's flagship property is that out of date. Well...I will never make that mistake again. Location and staff are great. Perfect Four Season's quality. Unfortunately, the hotel is not worth the money.", "Date": "August 15, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Canada", "Title": "“Exquisite service in a slightly ageing hotel”", "Author": "FansofEurope", "ReviewID": "UR18848106", "Content": "My wife and i stayed from a Thursday night to a Sunday and really enjoyed the hotel. It is a 35 year old property and that means smaller bathrooms than newer hotels, but the room was lovely. The service from check in to departure was absolutely exceptional. Room service was fast ,courteous with very tasty food. The pool area is small and older but the service was again excellent. Restaurants were friendly and efficient. Overall I would recommend this hotel to anyone.", "Date": "August 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Three and a half seasons”", "Author": "AGR1980", "ReviewID": "UR18753501", "Content": "This hotel was eveything that I could have asked for in a hotel, but I have to say, with the Four Seasons name attached, I was expecting slightly more. The customer service was wonderful, the fitness center was one of the best, there was classical music playing when we entered our rooms....I just though they were in dire need of some refreshing. The furniture, bedding and bathrooms were a bit tired and not what I would necessarily expect from the Four Seasons brand. That said, I have no complaints about my 3 day stay and I was informed by a Toronto local that they will be opening another Four Seasons at a different location in the city in the near future. Will definitely be checking it out the next time I'm in Canada.", "Date": "August 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Bordeaux, France", "Title": "“No way”", "Author": "Jay175", "ReviewID": "UR18676505", "Content": "It's a bit of a joke to say this one of the best hotels in Canada. There is no way this is a 5 star hotel. Yes the service is very good, but when you don't need anything it lets you see how old this place is. The rooms are outdated and the bath for example was one of the worst I seen in years. The is no sound proofing, and from the 19th floor you could hear every car, bus and motorbike that went past as if it was in the room. As tourists we didn't feel at all at ease, this is a business hotel that is used by people paid for by businesses. We had breakfast here one day, and talk about over the top... $20 plus tax, plus tip for a cup of coffee and a croissant... no buffet...!! Come on... I'm not surprised there were only 4 people in the place at 8.00am. The location of the hotel however is very good, as once again is the service. We will not be staying here again, even at half price.", "Date": "August 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Wonderful Service”", "Author": "Fearful", "ReviewID": "UR17078808", "Content": "We were guests of the hotel for 3 nights (June 13-16 ) while attending a wedding which also took place there. We had a special rate of approximately $235.00. We are repeat visitors and have been to the hotel 3 times previously. Perhaps that is the explanation for the upgrade to a deluxe room with king size bed. I agree with many that the service is very good. I had neglected to make a brunch reservation on Father's day to celebrate that as well as my daughter's birthday. No problem: a call a few days before to the hotel resulted in us having a table at Avenues for brunch despite the restaurant being full. Avenues is a gorgeous contemporary room- furnished beautifully, great art, and lovely and accomodating service (can't decide between the crab cake and the French toast? we'll give you both), but the food was disappointing. We were even escorted to the elevator several times. Many of our wedding weekend clothes were creased as a result of packing. Again, no problem .They were whisked off to be pressed - beautifully - and returned promptly at the time requested. But note a huge price of over $100.00 for 4 garments. I also agree with many that the rooms are very ho hum. They are somewhat dated and are uninspiring. Our bathroom was very small and I don't believe that any 5 star hotel truly earns the honour if they offer a vinyl shower curtain. Moreover, we had to call for toiletries that were not restocked as well. Much apologizing about that omission. Turn down service every night, but sadly no chocolate. The hotel is truly a gracious experience: a warm cocoon. But if you want a fabulous room, pay accordingly or stay elsewhere.", "Date": "June 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canada", "Title": "“LOVE this hotel!”", "Author": "moovstr", "ReviewID": "UR16882239", "Content": "I LOVE this place! The location and service are incredible! Amenities, comfort and view were amazing. My vacation started in Toronto then we went to Boston, NY and back to Toronto. There was a week from the beginning of my trip to the end and we stayed at the Four Seasons in Toronto both times. When I returned at the end of my trip, the head door man remembered my name and welcomed me back - he knew I was gone! Amazing service!", "Date": "June 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "East Lansing, MIchigan", "Title": "“The secret is the service...”", "Author": "Halinmich", "ReviewID": "UR16565058", "Content": "So, first of all: this place isn't cheap. It's about the priciest indulgence one can give themselves for a Toronto stay. And the rooms alone are not worth it--though spotless, they're not opulent, and pretty out-of-date. Given all this, the service is impeccable--best I've ever had--and thus I've stayed here three times. Yorkville people-watching is fun, and I loved hanging out in the Lobby Bar or the Avenue Bar and checking out the comings-and-goings of the rich and famous. Also fun to walk down the street and have dinner/drinks at Sassafraz (have the concierge make you a reservation though). Staying at this hotel is what traveling first class on a large luxury ocean liner must have been like 70 or 80 years ago, when the table linens were spotless and pressed, and any and all requests were executed promptly and flawlessly. Four Seasons is addressing the need of a makeover by building a new hotel which will be open in a year or two, so until then I'll make do with this one. Once you get used to Four Seasons service, you'll never want to stay anywhere else. Book your room on the hotel website as an 'Escape to Toronto' package and you'll even save a little off the rack rate!", "Date": "June 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vienna, Austria", "Title": "“The Place to stay at Toronto”", "Author": "Oli-on-trip", "ReviewID": "UR16174206", "Content": "Stayed for 4 nights at the Four Seasons Toronto. The location at Yorkville is perfect next to many good restaurants, bars and shops. The ROM and the next subway station are also only arround a minute away by walking. The food at the restaurant was awesome including the breakfast. The bar was a good place for people watching and to enjoy great drinks. The staff was very attentive and friendly. Valet service and housekeeping remembered who we are and were really helpful. Our room was spacious and cozy. The bathroom was not the biggest but lovely. We had a fantastic view over the city thru CN tower. The bed was comfortable and the room calm so we had slept well.", "Date": "May 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "L.A.", "Title": "“5 Star All the Way”", "Author": "BuddyMalloy", "ReviewID": "UR14773918", "Content": "Stayed for two nights, a Saturday and a Sunday, recently with my wife. It was a getaway before the birth of our first baby. And boy, did we make the right choice. From the moment we got out of our car to the moment they packed our trunk when we left, we were treated like royalty. Let's start at the beginning. The room was great. The furniture may be an older style, but everything was in immaculate condition and perfect working order. Very, very comfortable. The staff set up a DVD player for us in our room, no problem. The bed was heavenly, and robes were provided without us having to ask. The room, the bathroomâ€¦even the balcony, everything was extremely clean. Carpet was nice and thick and the hotel seems to have gone through a renovation recently. On our 2nd day, one of the staff noticed we had put some beverages (too large to fit in the minibar) on the balcony to stay cool, and they brought in a small fridge, and moved our beverages into it. Wow, that's service! Truffles Restaurant. Dinner on our first night. I believe this is the only 5 star restaurant in Toronto and it lives up to that rating. Both the service and the food were beyond excellent. When I asked for something not on the menu, it was no problem. When my wife requested a special dessert because of a medical condition, no problem. The staff even mentioned that they'd spoken to the chef about it and the chef had ensured the main course ingredients were tailored slightly to fit her special diet. Room Service. Dinner our 2nd night. and breakfast both mornings. Wow, just as good as the restaurant. Everything was delivered as ordered and everything was fresh and hot. The mutigrain bread may have been the best I've ever had. Ooohhh...the bread. Avenue Restaurant. Had lunch there one day. It was packed but service was still very good. Food was excellent. Workout facility. I think their pool is a tad on the small size, but it is unique. It's open year around and is 20% on the inside, 80% on the outside (you swim under a partition...and the pool is heated). Good size hot tub, and very nice work out room. Juices, water, coffee, tea and fresh fruit are provided free of charge. Front Desk Staff and Valet. Excellent. Valet were always courteous to open the door for us, and our car was brought up without delay (the daily parking charge includes in/out privileges). This is a great hotel in a great location. Right in the heart of Yorkville, with access to many restaurants, shops and cinemas. Sure, you're going to have to splurge but in our case it was worth every penny. Hope you enjoy your stay as much as we did!", "Date": "April 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Classy Comfort”", "Author": "Hotelero1", "ReviewID": "UR13078190", "Content": "While this hotel is over 30 years old and can't compare to many of the newer Four Seasons properties, it has aged well. The public areas are immaculately maintained and the rooms are very comfortable. We were upgraded to a suite which is the size of a small apartment - two bathrooms, a parlour and a king bed. After five days we felt right at home and really did not want to leave. While the decor and furnishings are a little fussy and outdated, the emphasis is on comfort and in that it succeeds. As expected the service was professional and courteous, although the Concierge and Reception staff were merely perfunctory. The location is fantastic - within walking distance to the Yorkville shops and several museums, and ten minutes by taxi or subway to downtown. An excellent choice for a business or pleasure trip to Toronto.", "Date": "January 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Super Guest Services!”", "Author": "MarcoPolo001", "ReviewID": "UR12357071", "Content": "Everytime I stay at this property, I am impressed with the concierge. They got me last minute reservations at the best restaurants which were already sold out. The location is just great in the middle of Yorkville. Its the place to be in this town.", "Date": "January 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Not Impressed”", "Author": "Charrynn", "ReviewID": "UR12209482", "Content": "I stayed here for work. It's OK. Nothing special. Certainly not what one would expect of a Four Seasons. The gym\\pool was impressive, although rather small. My colleague who is probably 6'4\" was given a room with a twin bed. Unbelievable...", "Date": "January 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "new york", "Title": "“Bad Architecture and Decor -- With Excellent Service.”", "Author": "nycinvestmentbanker", "ReviewID": "UR11974096", "Content": "First, the good news.... We love love love the Four Seasons and we have a great affinity for this hotel due to some personal connections. The service is beyond compare. Every question to management was answered with a 'certainly' and a smile. The hotel also has a certain 'celebrity factor' for those celebs shooting film about town. The location is beyond compare with great shopping, parks, and restaurants nearby. However, if you stay, you should be aware that the hotel is rather old and has become dingy. Rather than upgrade this property, Four Seasons is building a new hotel about a block away (ground unbroken). So, you will have to enjoy such things as small tubs, dingy carpet, low ceilings, odd decor and uneven temperatures in suites. The gym and pool remain unupdated in over a decade. Think slab concrete with limited equipment and no views. Also, i would not feel like a spa treatment here as the facility is simply not luxurious. The menu for room service is not bad but it is not spectacular either. We would like to have seen more Canadian items and quicker, faster food delivery. Instead, most meals were luke-warm and lacked variation. However, service was nice. Our checkin was probably the best ever and every problem we had was addressed. For example, a maintenance worker walked in on us changing even though we had a 'do not disturb' sign and had asked him not to. Unfortunately, an internet upgrade in the building was unannounced and much time was spent on fixing it so I could write this review. Management was apologetic and made things right but it should never had 'come to this'. Overall, this is the grand dame hotel of Toronto and the birthplace of the Four Seasons concept (thanks, Izzy Sharpe). However, this Four Seasons is not typical of the overall experience except for the politeness of the staff. We hope to see some major renovations or the new building up very soon. We would also love to see this Four Seasons establish itself as the headquarters for the chain and introduce wonderful new ideas here instead of lagging the entire chain. Why not try out a new concept or menu idea here? Many intelligent clients would be very willing to give you their honest response.", "Date": "December 26, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Nice service, great gym, but strangely out of date decor”", "Author": "ValueSeekerRW", "ReviewID": "UR10882796", "Content": "I stayed here a couple nights for business. I came in very late (around midnight) and was greeted warmly and even upgraded to a one bedroom suite. The suite was certainly large, but the decor was dated and worn, and really didn't exude the luxury one would expect. The gym is fantastic. The machinese are well maintained--I wish I had more time to make full use of the facilities which included a pool, hot tub and fruit juices/coffee in the morning. The location is great---I didn't realize how close we were to the Royal Ontario Museum which is dynamite. Studio Cafe on the premises is excellent.", "Date": "November 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Three Seasons Hotel Toronto”", "Author": "5starsforme", "ReviewID": "UR10830292", "Content": "After reading the other reviews for this hotel, it almost feels like we stayed at a different hotel! What cookies, robes and cute little sponges for the kids? We didn't get anything like that. We have stayed at many Four Seasons and have never been so unimpressed. The rooms were dingy and small and although we were assured by Amex that we were eligible for an upgrade if available, the hotel staff told us that we were not. In general, the staff was friendly and the room service orders were brought quickly. But there was nothing special about the hotel in general. It feels like time for a makeover.", "Date": "November 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“Best Hotel in the World - READ if you have kids”", "Author": "ontmom", "ReviewID": "UR10739512", "Content": "What a fantastic hotel - I won't be able to say enough! We arrived for a 2 night stay for special occasion I set up for my husband, with our young children. The children were greeted with stuffed animals and up in our room, found fresh, warm happy face cookies, tiny robes and slippers and the hotel arranged wine for our special occasion ensuring the ice for the wine was fresh (even though they had no idea when we were arriving!!!). But the true measure of this wonderful place was the staff. I had set up babysitting for the children so we could eat at their 5 star restaurant on the second night of our stay. Unfortunately, our son became ill with an ear infection during the first night and the hotel bent over backwards to help us - sending a doctor on call to our room (this in Canada where NO doctor makes house calls) within one hour (he was on the phone with us in under 5 minutes). They ran to the store for medicines. They allowed us a late check-out so our son could sleep before we left early and did not charge us for the last minute cancellation of our babysitter or the triple confirmed second night of our stay. They treated the children as if they were the most important guests at the hotel and went out of their way to acknowledge them at every opportunity. They had a super reasonably priced kids menu - room service hamburgers which were HUGE were $7 with fries, works and served just as you would expect to be served as an adult- $5 hotdogs, $4 salad/veggie trays - all for kids - french toast etc. in the morning with nothing over $5. Absolutely outstanding! We had a beautiful two room suite that was VERY reasonably priced and perfectly appointed - with two bathrooms! I could not thank the staff more and wanted to write this review as soon as we got home so that every parent booking a trip to Toronto could benefit from this place - WORTH EVERY CENT!!!!!!", "Date": "November 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Elk Grove Village, Illinois", "Title": "“Far From The Maddening Crowd”", "Author": "Mr_Observer", "ReviewID": "UR8605435", "Content": "For the best \"Rest & Relaxation\", you must consider staying at the Four Seasons on Toronto's Yorkville area. Here, I found the best of two worlds \" Far From The Maddening Crowd\" - peace and quietness. Unless you are a writer, you can't appreciate this fully. This property was impeccable maintained and the staff prompt, friendly, and knowledgeable (some of my pet-peeves). Dining places near the hotel (in my opinion) were upscaled and great. Just about \"everything\" you would want to get (while on vacation) was readily available in the many shops in this Yorkville area and if you want \"bargains\", just walk across \"Bloor Street\" and there you are! The more you walk SOUTH of Bloor Street, the more \"conjested\" it became as you got into the downtown area of Toronto. During the time I was there, the \"Caribana Festival\" was climaxing and the streets (south of Bloor Street) were filled, both day and night, with party goers and roving groups of \"young folks\". But all of that seemed to \"disappear\" once you cross \"northward\" of Bloor Street. Will I return to the Four Seasons again? \"YOU BETCHA!\"", "Date": "September 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "precious68", "Title": "“Four Seasons is amazing”", "Author": "precious68", "ReviewID": "UR8518772", "Content": "Just returned from a long weekend at the Four Seasons Toronto. It was a \"girls\" weekend - so there was no better location in Toronto stay - in the middle of Yorkville, in the midst of the best shopping, dining, and neighborhood in the city!! Service at the hotel was beyond compare! The staff are amazing, and go out of their way to ensure you are happy!! Rooms were average - nice bedding, but the real difference between the Four Seasons and other hotels is definitely the service. Food is great, and Avenue Bar is quite a place to people watch, especially later in the evening. I highly recommend this hotel.", "Date": "August 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Danbury, CT", "Title": "“COMPLETELY Lives up to its reputation! GREAT Hotel”", "Author": "NCGeechieGal", "ReviewID": "UR8213404", "Content": "Believe me...anyone who gives the Four Seasons Toronto less than an EXCELLENT rating probably doesn't get out much and really doesn't know hotels very well. As a constant business traveller who spends more time in hotels internationally than I do at home, I can say that the FS is a FABULOUS hotel with all of the amenities you could ever want in lodging. Short and sweet: GREAT staff, EXCELLENT food (and mojitos), COMFORTABLE, well appointed rooms with a micro-sound system that is IPod/mp3 compatible. FS takes customer service to a COMPLETELY different level. Never any hassles, bill surprises or rudeness. I usually stay on the 28-29th floor and have a nice view of Lake Ontario. The location is superb with an arts theatre a couple of minutes walk away and it's just around the corner from high end shopping on Bloor st in Yorkville. If you're in the area, you must check out Holt Renfew--the window dressings during the holidays are fantastic! Toronto is a GREAT city and the FS epitomizes it!", "Date": "July 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ponte Veda Beach, FL", "Title": "“There is a reason why Four Seasons is the best of the best!”", "Author": "Windstory", "ReviewID": "UR8085626", "Content": "I was thoroughly impressed with the Four Seasons Toronto and as avid Four Seasons travellers understand why this company is cream of the crop. My wife and I brought our three children for an annual trip to Toronto to visit family. The room set-up was a two bedroom suite with an incredibly comfortable king size bed in one room, a large parlour room and a second bedroom with twin beds perfect for my children! After making my resrevation online and calling a few days later to check all was in order, the reservation's person asked for the ages and names of my children. I did not think anything of it at the time, but upon arrival to our room the hotel had prepared lovely room service plates for each of them, and my youngest had his name spelled out with sponges on the side of the bathtub! Right from the moment we arrived we felt like royalty. The Front Desk agent spoke to all my kids using their names, and presented them with lovely little stuffed toys. They were so thrilled, especially that the agent knew their names... they thought that was great! Every staff person from the Housekeepers, staff in the elevator, bell staff, door staff were smiling, friendly and genuinely seemed happy to be there and ready/willing to serve. Pool area is great for families in the summer. They have a large number of loungers and also provide a full menu from the pool bar so your children can go crazy in the pool and you can relax with a good book out by the pool and pass the day away. In terms of location no hotel in the city can compete. Trendy Yorkville is where you want to be when travelling Toronto and the Four Seasons is smack in the middle of all the shopping and nightlife. Overall a 10 out of 10! Will be back next year for sure!", "Date": "July 9, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Not so Four Seasons...”", "Author": "sheshelala", "ReviewID": "UR8020027", "Content": "Four Seasons is diminishing there overall reputation with this hotel. I understand it is old, and one of the first Four Seasons ever constructed - which is why I don't understand the lacking service. Even when room rates go down, service should never be compromised. The staff arn't helpful at all. Its almost like pulling a tooth to get something out of someone. The doorman never opened the door, but were simply talking to he other doorman at the stand.The front desk needs a lesson or two in customer service, and a possible smile with a \"how are you today?\" I work in the hospitality industry - so many I judge to harshly. But given that this is the Four Seasons, they should realy focus on providing extraordinary service to all. If its there service that sets them apart, they need to rethink their approach. At other Four Seasons', you can spot the GM walking through the hotel, asking guests about their experience. I never once even saw a manager and I was there for a full-week. Truffles is great. Avenue and the Studio Cafe are great as well. But this hotel needs some serious attitude overhauls with there staff. Maybe hiring people that look good in a suit is the wrong approach. Find people that exibit that sense of providing exceptional customer satisfaction.", "Date": "June 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "White Rock, BC", "Title": "“Nice but rooms not as great as expected”", "Author": "ProNavigator", "ReviewID": "UR7819400", "Content": "We stayed here for three nights in March. I expected a more luxurious hotel based on the Four Seasons reputation and website. While the common areas are indeed lovely, and food and beverage quality good, the room decor fell flat. It didn't feel like a luxery property and I had little desire to spend time in the room relaxing/reading/taking a bath (small tub). The bed itslef was very comfortable and the linens and towels up to par to the Four Seasons but the bathrooms are small with no fan, and overall the lighting was dim. Another beef is that the Lobby bar shuts down early with the alternative being the noisy Avenue bar, not a great place to sit and chat. This is a great location for shopping on Bloor St and is close to the ROM and University. I certainly felt safe running alone in the morning. There is a great bakery just up the road for croissants or muffins. We also had a fantastic dinner at a nearby restaurant called Joso's - I highly recommend it if you like fresh fish.", "Date": "June 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Poor Value, Great Service”", "Author": "SumNetGuy", "ReviewID": "UR7586199", "Content": "Stayed at the Four Seasons to treat myself. At $350, I expected more than a tiny room with average furniture and fixtures. The room looked and felt no nicer than most three-star properties. The service is lovely, and the location fabulous -- but a poor value for the money.", "Date": "May 10, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Kent", "Title": "“Can recommend”", "Author": "FSWKent", "ReviewID": "UR6715264", "Content": "I stayed at this hotel in December 2006 and can definitely recommend it. Couldnâ€™t afford it normally but I got a good corporate rate through work. As some previous reviews have stated, this hotel does have rather old fashioned rooms. However, the standard of cleanliness and the helpfulness of the staff is very good. They treat their guests exceptionally well with no hint of any snooty attitude you get at some luxury hotels. I didnâ€™t eat in any of their restaurants so canâ€™t comment on the food. Concierge very helpful with booking tickets for Greyhound bus to Niagara when I am sure they are more used to booking limos. Very frustrating as she had to hold on phone for ages with one of those dreaded â€˜automatedâ€™ phone systems but she couldnâ€™t have been more amenable. If you donâ€™t want to pay hotel prices for breakfast, can also highly recommend the Over Easy Diner, 208 Bloor St. W. up the road from the hotel, we had breakfast here every morning and it was always good. If I did go to Toronto again and could get a good rate I would definitely stay here. S Walters, Kent", "Date": "January 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“No Complaints with the Four Seasons”", "Author": "marc1976", "ReviewID": "UR6083180", "Content": "My wife and I stayed at this hotel in room 2115 from November 3, 2006 to November 5, 2006. The room was paid for by my wifeâ€™s employer so I do not know how much it cost. Overall we were very pleased with the service, accommodations, and location. The hotel is located in the Yorkville section of Toronto and in a nice area for shopping and restaurants. The room was of average size, but very clean and did not show any age. The bed was very comfortable and had an ample number of pillows. The television had about 60 channel selections and looked like it was brand new (other reviews mentioned old televisions). The bathroom was spacious with a large tub and had all the amenities we would need. I have never stayed in a hotel that had such strong water pressure in the bathroom, which was a plus. The turndown service was also appreciated. I very much enjoyed the health spa. It had complimentary robes, free water bottles, free fruits, and was open until 10:00 pm every night. The pool water was very warm and you could swim outdoors or indoors by opening a partition. The whirlpool was great with water that was not too hot and had the strongest jets I have ever experienced in a hot tub. They also had a nice exercise room which I did not use. The room also had a balcony with chairs. Although it was cold, this would have been a really nice place to relax in warmer weather with a nice view of downtown Toronto and the CN Tower. I was very impressed with the friendliness of the hotel staff. They were very polite saying hello whenever they saw me. When I asked George and another male front desk staff member for information about any nearby Chinese food restaurants, they went out of their way to help by giving me very detailed instructions about getting there, calling the restaurant for a reservation, and recommending a certain dish. My wife and I usually go on a lot of vacations every year and we can afford to do sp by not staying in expensive hotels and cutting travel costs as much as possible. We had previously visited Toronto about four years ago and stayed at the Toronto Marriott Eaton Centre and were very impressed with their accommodations. There was not a whole lot of difference between the Marriott Eaton Centre and the Four Seasons, except for the room rates and room size, which are much cheaper and larger at the Marriott respectively. I very much enjoyed my stay at the Four Seasons and really did not have any complaints, but I feel your money could go a lot further at a less prestigious hotel with similar amenities. Marc T. Hardekopf", "Date": "November 7, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Vancouver", "Title": "“Tacky decor and unhelpful staff”", "Author": "YVR_guestservices", "ReviewID": "UR5773059", "Content": "This was my first time at the vaunted Four Seasons in Toronto. Its reputation is legendary and it is the flagship of the Four Seasons chain. That said, what's promised and what's delivered are very different. Much is made of the 4S's Yorkville location. Yorkville is not as chic and the sidewalk cafes not as elegant as one would think. The cafes are loud and overpriced. There are a number of trashy nightclubs in the neighbourhood and after hours their customers are up and down the street roaring motorcycle engines and blasting music from SUVs. Hardly conducive to a good night's sleep. On this basis alone I would stay away from the 4 Seasons! The decor is dated, fussy and worn. The trend in hotels these days seems to be towards simplicity and comfort; the 4 Seasons seems to be on a quest to have the largest number of fabrics, finishes and trims in each room possible. Everywhere I looked I saw worn upholstery and chipped paint and trim. The staff seem to think they are GUESTS at a five-star rather than EMPLOYEES. I happen to like to keep a large glass of ice water beside the bed at nightwhile I sleep. I called down to the concierge to ask for a larger glass and the response was, \"You can use the glasses on the vanity.\" Thanks a heap - I know I can use those glasses, but I didn't WANT TO. Because of problems with my company credit card I had occasion to need help from the front desk a number of times, and each time, the same story: people who were more obviously wealthy and had the corresponding enlarged sense of entitlement were allowed to butt into line or simply interrupt a conversation. I was speaking with a front desk agent and a 5th avenue matron type stood right beside me, clacking her nails on the counter. After I had been there several minutes she simply leaned in front of me and asked the girl to call her a taxi! Without a bat of an eye she asked the lady where she was going and so on, at which point the lady next asked for a good hair stylist, then for a copy of the wine list to be sent to her room...and the agent completely forgot about the guest she was already with! Granted the lady's manners were atrocious but the agent should have had better customer service skills than to allow one guest to take over from another. I was walking by again about 30 minutes and overheard this agent COMPLAINING ABOUT A GUEST to another agent, within earshot of anyone approaching the desk. Very classy. Overpriced and overrated the 4 Seasons is one place I wish I had never slept in. In my opinion they are coasting on their reputation and doing nothing to earn it. Avoid, avoid, avoid!", "Date": "September 6, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "West Hollywood, CA", "Title": "“Extremely Tired Suite”", "Author": "trippmahan", "ReviewID": "UR5725730", "Content": "I am a huge fan of the Four Seasons brand and was very disappointed with how tired my suite at the Four Seasons Toronto was. Given that the chain is developing a new property in Toronto, I don't imagine much will be done to improve the existing property. While the location is good, the building is dated. The pool area and gym is in dire need of an update. Service was fantastic as it always is. The hallways seemed to be redone and were fine. Overall, I just couldn't recommend this property.", "Date": "August 29, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Treated my daughter wonderful”", "Author": "A TripAdvisor Member", "ReviewID": "UR5475783", "Content": "We came to visit the FS Toronto for a long weekend. When we arrived we were upgraded to a Jr. Suite Deluxe with two bathrooms. we were a little confused because of all the complaints we have read about this hotel. Our room was recently redone, and actually upto our expecttions with Four Seasons. The hotel itself could use some modernization, but it still bleeds excellence. The staff made our infant daughter their princess. Every request we had, and even things we did not ask for we given to us. I commend the staff on a job well done. We try to stay in Four Seasons whenever we can, and while this may not compare to the FS in Maui, Chicago, Palm Beach, Miami, or London, it still is better than the rest in Toronto. We have stayed at its so called equivalant, the Park Hyatt, and the FS is still superior.", "Date": "July 17, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "2", "Service": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Great service only takes you so far”", "Author": "A TripAdvisor Member", "ReviewID": "UR5186601", "Content": "I've stayed here about ten times, because the people I go to Toronto with always want to, and it's hard to argue with the Yorkville location (which I think is the best in town) or the unparalleled service, which is why I've given it a four. I certainly think it's nice to be greeted by name every day, and if that's what you are after, look no further. But I'd rather have a nice, new, updated bathroom, with an incredible shower and maybe some new bedspreads, and so next time I'm going to try something else. I really think they should take the exorbitant prices and use them to r.e.n.o.v.a.t.e. It doesn't have to turn into some uber-hip dark place to get nicer -- just new bathrooms, new fluffier towels, and some color scheme my great grandmother did not have in her living room. People in town are starting to call this place the Holiday Inn. It's the flagship Four Seasons property and doesn't even come close to their other outposts.", "Date": "May 21, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Toronto, Canada", "Title": "“Wonderful birthday”", "Author": "somebody_else", "ReviewID": "UR4830693", "Content": "We were there for a 70th birthday celebration. Every person we dealt with treated us like royalty, beginning with the doorman, who whisked our luggage into a secure room as we headed inside. \"We have a policy never to leave luggage unattended\", he explained to me. How different from so many other hotels, where you often see piles of luggage in the lobby and outside, with minimal attention paid to them. We were upgraded to a suite, and the check-in agent walked us to the elevator. The room was immaculate and the turn-down service included another cleaning, not just towel-refreshing and bed-straightening. Wow! The bathroom amenities are by L'Occitane de Provence, and small wonderful. Dinner at Truffles was FABULOUS - our waiter was attentive, charming, knowledgeable and yet still gave us lots of privacy. The manager sent champagne to our table, in honour of the birthday. The food was delicious, from the bread at the table, through the complimentary amuse-bouche of duck, through lovely appetizers (including a caesar salad that wasn't on the menu, but they were happy to prepare), through the main courses (especially the chicken served with bacon-wrapped truffles), and let me tell you about the desserts! The Grande Marnier souffles were gorgeous, served with a grande marnier cream sauce. My berries with ice cream (also not on the menu but they were happy to oblige) were perfect and at the peak of freshness. The chef came out to the tables to ask if we had enjoyed our meal and if we had any questions. They also served us a complimentary chocolate birthday cake and complimentary chocolate truffles! This was the most amazing meal any of us had ever eat! en. We were so sorry to leave the hotel. But when we did, the valet brought our car up and had put 2 bottles of water in the cup-holders for us. We are definitely returning!", "Date": "April 3, 2006"}], "HotelInfo": {"Name": "Four Seasons Hotel Toronto", "HotelURL": "/ShowUserReviews-g155019-d155564-Reviews-Four_Seasons_Hotel_Toronto-Toronto_Ontario.html", "Price": "$302 - $542*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">21 Avenue Road</span> | <span class=\"extended-address\">One block north of Bloor St.</span>, <span class=\"locality\"><span property=\"v:locality\">Toronto</span>, <span property=\"v:region\">Ontario</span> <span property=\"v:postal-code\">M5R 2G1</span></span>, <span class=\"country-name\" property=\"v:country-name\">Canada</span> </span> </span> </address>", "HotelID": "155564", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/e3/f5/e3f5946ac4dfc491e500411674c4c8c31large.jpg"}}