{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "", "Title": "“Bed Bugs--Room 609”", "Author": "I_Love_Vacation_MN", "ReviewID": "UR128338084", "Content": "We stayed at Meininger Berlin Hauptbanhof in a \"triple\" (Room 609), along with bedbugs. The room was really a small dorm room with 2 bunk beds for 4 people. Although we did not have to share the room with anyone else, it did not seem like a triple. My son had stayed in a much larger triple in Meininger Salzburg and raved about it. We discovered the bedbugs on the last day after three nights and reported the issue to the front desk. The staff seemed unconcerned and had no management on duty to address the issue. They said they would check it out but did not offer us any hope that it would be addressed and offered no compensation. I e-mailed a complaint to Meininger and they did not respond until after I sent it to them again. Meininger's response was simply to apologize. The beds were comfortable, the location was convenient, and the breakfast was good. However, because of the bedbugs and lack of concern by this chain, I do not recommend this place.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "berlin", "Title": "“THEF PROBLEM IN THE LOBBY AND THE ROOMS”", "Author": "meiningerBerlin", "ReviewID": "UR127982835", "Content": "This Hotel is not really a hotel but almost a Youth Hostel! Good location near the Central Station. Clean but very small rooms, too crowded even after midnight, many drunk young people during the night! But the greatest problem are the thieves in this Hotel! We were a group of 57 people. Somebody came in one of our rooms and stole many things and also somebody stole a handbag with a camera from our group in the Lobby!", "Date": "April 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Loughborough, United Kingdom", "Title": "“Excellent hotel such a good location”", "Author": "wixey", "ReviewID": "UR127153047", "Content": "Really friendly staff and the rooms were excellent. There was a good bar and close to aldi. The location is great as it is literally at the exit to Hauptbahnhof so you can get anywhere quickly. Plus it was only 10-15 min walk to brandenburg gate! Was good value too!!", "Date": "April 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great value in an ideal location”", "Author": "John H", "ReviewID": "UR126347988", "Content": "Just returned from a few days in Berlin with a group of friends. We stayed at the Meininger Haupt and it ticked all the boxes. It is perfectly located adjacent to the main station which made it ideal for getting around the city. The prices are excellent value. The rooms are simple, clean, and warm all you need for a short city break. The reception staff were very helpful and spoke good English. Our group probably doubled the age profile of the other guests. Most guests were young people but we enjoyed the buzz and felt very comfortable in the environment.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great hotel and good value for money, but unfriendly staff”", "Author": "Bea_7seas", "ReviewID": "UR125990602", "Content": "I loved the rooms, modern décor, well furnished, very clean, comfortable bunk beds, in room facilities and great value for money! Perfect location right next to the central station in Berlin mitte. However, Staff was very unfriendly. Seem to be bothered when ask for directions or recommendations: one of them was very rude when we asked him which area to go out as we were new in town. Key cards were deactivated every day and we had to come downstairs all the time to ask for a new one, they also seemed to be upset any time we asked for a new one...and it was their fault! When we rent the bikes (12€, which we considered very expensive as we also saw them cheaper around the city...) they didn't mention anything about the packages they had...well, we found out later that for 12.50€ we could have the bike, breakfast, Wifi & coffee to go! we mentioned it when returned and they said it was not possible to have it...but no one had a good reaction about it..in the end I've got free wifi after complaining. They should offer this in advance to avoid customers disappointment... They also didn't no give us any map, or indications for the cycling in the city...and one of my friends lights bike didn't work, which was a bit unsafe. We complaint and they ignored us... I guess they need to give some extra training to their staff", "Date": "March 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Damascus, Syria", "Title": "“a very good hotel”", "Author": "maaloula", "ReviewID": "UR125558935", "Content": "great location 50 meters from berlin main train station 2 min walk to airport bus (txl) cost about 3 euro.10 min walk to branderburger gate most of the hotel guests are young . breakfast cost only 5 euro", "Date": "March 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fareham, United Kingdom", "Title": "“Good, cheap hotel”", "Author": "jtellison", "ReviewID": "UR124577644", "Content": "Took a school group here last weekend. Excellent location for railway system and for easy access to the main sights of Berlin - Reichstag, Brandenburger Tor, etc. Staff very helpful and deal with problems quickly. Food average and edible and there is plently of it if you want it. Meal times a bit of a melee as everyone seems to want to eat at the same time. For groups is ideal, but rooms for staff, at least in our case, were away from students. Not ideal if you want to keep tabs on them. Games room a let down - two pool tables which double as serving tables at meal times. Internet access free. TV plays English World News in public areas. Rooms for groups basic but adequate. Staff rooms OK - great views of Reichstag if you're on the right side of the building. Would consider staying here as a private visitor and would recommend it if you are taking a group!", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dendermonde, Oost-Vlaanderen, Belgium", "Title": "“Perfect Weekender”", "Author": "KristofVdE", "ReviewID": "UR124288254", "Content": "We stayed there 3 days and had a wonderful time. Location isn't perfect, it's a decent walk until you're at the Brandenburger Tor and the real city center. You can also use the metro and buslines which all start at the Hauptbahnhoff. The rooms are small but clean, the ensuite bathroom is also small but has all the neccesairy things and is very clean. It's a new building and the furniture is all Ikea. For breakfast you have to pay extra but it's worth it. There's plenty of food and it all is of decent quality, don't get there too late though or all the good stuff is gone. The restaurant does get crowded and sometimes it's difficult to find an empty table. There's also a small kitchen available in the restaurant to cook your own meal! Make sure to check our the coupon wall in the restaurant, there are some interesting savings on them for museums and shops!", "Date": "February 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Brilliant”", "Author": "kiwi369", "ReviewID": "UR123810411", "Content": "Nice place, clean, friendly and good location. Should have free wifi in the rooms instead of just the lobby", "Date": "January 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Fredrikstad, Norway", "Title": "“A good choice for a City trip!”", "Author": "jpjFredrikstad", "ReviewID": "UR121110115", "Content": "The hotel and rooms are basic, no frills, but you have all that you need - a comfortable bed, TV, and a nice bathroom. Nothing fancy. But it can be a bit noisy, probably because the hotel is quite cheap, it is full of teenagers and many of them were loudmouthed. Overall, a great hotel and great value. We'll definitely come back.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "buckinghamshire", "Title": "“Cheap, next door to the Hauptbahnhof and very, very clean”", "Author": "linden-s", "ReviewID": "UR120324692", "Content": "I knew this was a typical 'travellers' hotel' so didn't expect much, but we were sightseeing until late and leaving early so we just wanted somewhere to sleep. We couldn't check in until 3pm but were able to leave our luggage free of charge in a locked room - however bear in mind it's not supervised so anyone staying there has access to the room, but there are small lockable compartments in reception for valuables. We had a lovely surprise in the room - spotlessly clean, comfortable bed and an excellent shower - all very modern and well appointed. There were several power points in the room in convenient places for computer (to watch dvds in bed) and hair straighteners etc near the mirror. There was some noise from the corridor at one point from a group finding their room, but nothing to really complain about. There's notices up saying they don't allow parties or alcohol in rooms, so if anyone was really making a row I guess you could notify reception and they'd put a stop to it. Not somewhere I'd want to stay for a holiday, but for proximity to the station for an early train it's perfect.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great hotel, great value”", "Author": "Priscila C", "ReviewID": "UR119691998", "Content": "This hotel is located beside Berlin's train station and also connects to the U-Bahn subway line, thus the location is great. The building looks fresh and colourful, and the staff is very helpful and friendly. We booked one room for 3 people and got a 4 ppl instead with no extra charge. The rooms are well organized and spacious. The hotel does not have a parking lot but public parking is available accross the street, which is free on Sundays. The hotel offers a $5.50 euro continental breakfast which is pretty good actually, with fruits, bread, cereal, milk, coffee, juice, etc. and also covers internet wireless access. The hotel has a lounge at the lobby where you can chill out after a long day walk.... I did see young travellers as well as family and solo travellers staying there, which made us feel really comfortable. Overall, great hotel and great value. Will definitely come back.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mumbai", "Title": "“Comfortable Stay.. Good Atmosphere.. Great Location!!”", "Author": "Travelenthu123", "ReviewID": "UR118774961", "Content": "When I booked the hotel, I did so purely on reviews on the booking site. But I was even more impressed when I got there. Its a great hostel. The atmosphere in the common areas and the crowd was great for a hostel although they do position themselves as a hotel also. The breakfast was good with a good but not great variety. The location was amazing. I got here by a train from Frankfurt with not so light luggage. I got out to the exit and this palce is right adjacent to the Main Berlin Train Station. Couldnt have been better. I decided to walk the major attractions. The Reichstag is just a few hundred meters opposite the hostel and you can walk all the major attractions along the same road 9cant recall the name). The price was great for the location. Steep for a hostel but cheap for a hotel and the location. The station itself had a lot of great places to eat that helped. Would strongly recommend this to anyone visiting Berlin.", "Date": "September 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hong Kong", "Title": "“Good location”", "Author": "snowmanlau", "ReviewID": "UR118722690", "Content": "Meininger is located next to Berlin Hbf, which is very convenient if you are carrying a heavy backpack!! The reception staffs are helpful and nice. Sometimes you have to wait few minutes for help at the reception as lots of people are queuing there. It won't take too long to walk from the hotel to some main sites. It takes 45 mins walk to Berlin Dom. The room (4-bedfemale dorm) was not that spacious but kept very clean with standard hostel furniture. You have to bring your own lock for using the locker. Although the hotel was full of teenages and locating near Hbf, it was very quiet all the time during our stay.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Izmir, Turkey", "Title": "“A traveller hub with the narrowest bed I have ever seen”", "Author": "empee3", "ReviewID": "UR118575526", "Content": "Meininger Hotel at the Berlin train station is an 9-floor hotel with a constant flux of travelers of all ages from all around the world. Check-in lines are long and the lobby is crowded. Despite the large number of travelers common facilities and the rooms are surprisingly clean. However, our twin bed room was too small. The beds were the narrowest I have ever seen. Other than that, the room had everything we needed and appeared to be brand new. Perhaps the most overlooked feature of the hotel is the roof terrace, which has a terrific view. Wi-fi in the lobby works just fine and the continental breakfast for 5.50 euro features a variety of breads, two sorts of cheese, cereals, eggs, juice, milk, tea and coffee. The breakfast room is a bit too small for the capacity of the hotel and can get very crowded. The reception staff consisted of friendly English speaking students who were helpful. Pros: new rooms, price, staff Cons: narrow beds, small lobby, long check-in lines", "Date": "September 25, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "3", "Rooms": "5"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“One of the cleanest hostels I've ever been to”", "Author": "flyingkiwi84", "ReviewID": "UR118281359", "Content": "Meininger was a great stay - it is very big so don't expect the personal touch but the room we had was excellent, absolutely spotless and looked brand new. Also an excellent location just outside the main train station so an easy connection to and from the airport. Easy walk to the Brandenburg gate and other main sites too. Highly recommend.", "Date": "September 18, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Barbados", "Title": "“A Rather Indifferent Start Turned Into a Great Stay!”", "Author": "BGIWorldTraveller", "ReviewID": "UR118158188", "Content": "I stayed at this hotel for two nights and generally I had a fantastic time. My stay there got off to a rocky and indifferent start for two reasons. Firstly when I arrived, I waited 20 minutes in a queue to check-in. One would think for a hotel with 296 rooms, there would be more than 2 persons at the front desk. Secondly, after I got to someone, I was given room 103 on the first floor. My first enquiry was, what about the rooms higher up? I booked in January 2011 for a September 2011 stay and the lady I was dealing with told me that the hotel was fully booked and there were no rooms higher up. The fact alone that she couldn’t look me in the eye and say it hinted to me that she was lying. Nevertheless, I took the key and proceeded to the room. When I got into the room I was in for the shock of my life! Bare in mind, this was a single room I booked. It was literally the smallest hotel room I’ve ever seen in my life! So narrow….with an even narrower bed. Take a close look at the attached photos. I immediately went back downstairs and spoke to a different person, a guy this time and explained my dissatisfaction to him. In less than five minutes I was given a key for a much larger room on the 8th floor as well as an apology. I really loved the room I had, it had a very new and fresh feeling to it. Flat screen television with several English, French and German channels, telephone, electronic shutters on the window, fully equipped bathroom including hair-dryer etc. All the basics you need. Wi-Fi was available in the room, but this you had to either pay for, or purchase breakfast and get the passcode for free. The views through my window were spectacular. I could clearly see the Reichstag, Deutsche Bank Tower and the river boats on the Spree. The room was also immaculately clean and faultless. Take a look at the attached photos. Breakfast is not included in the room rate but can be purchased separately for €5.50. I decided not to do this as they were several cafes and other places to get much cheaper breakfast in the Berlin Hauptbanhof next door for a much cheaper price. The breakfast at the hotel is continental and included juice, coffee, tea, cereal, cheese, hams, bread etc. There was also a very space cafeteria-styled eating area as well as a good bar. There are a couple vending machines and also drinks for sale in the reception area, once again, they are much cheaper at the train station next door. The sodas the hotel sells for €2 can be bought for €0.99 across the road. On the top floor of the hotel is another bar and balcony area with very stunning views of the station and other areas of the city. My two disappointments with this hotel were that it always seemed like I was waiting 3-4 minutes for an elevator (they are only two) to get to my room. Additionally, there was always a queue at front desk whenever I passed by and the hotel is extremely busy… lots of human traffic in and out all day. I had to wait ten minutes just to purchase a voucher to use one of the computer terminals in reception. Nonetheless, this is an excellent option for those needing to be close to the Berlin Hauptbanhof or just generally need a good central location. In all probability, I will stay here again on a future trip to Berlin, despite my request for a top floor room being ignored by the first front desk agent I came into contact with. That was really my main downfall with this hotel.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Southampton", "Title": "“Great Place, Price, Location”", "Author": "atmontejo", "ReviewID": "UR117827776", "Content": "Would recommend this place to anyone. Was so well priced and especially for a capital city. Wasn't too far from the city centre. Has the main train station outside so can get the metro to anywhere pretty quickly. Was there on a stag weekend,everyone was happy with the place. It is modern clean has a nice bar which is well priced. You can check out at 1pm for 5euros, well worth it after a heavy weekend. I look forward to returning to Berlin and will stay here next time and that will be with the Wife and Baby Daughter.", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Lund, Sweden", "Title": "“Great location, reasonable price”", "Author": "swz19", "ReviewID": "UR117390204", "Content": "Pros: Hotel was in a great location right next to Central Station, very convenient for seeing the city and getting places. Reasonably priced. Nice personal bathroom. Friendly staff. Cons: Air conditioning was broken, room was smaller than pictured online, breakfast was mediocre. For the purpose of my trip (to sight see and party in Berlin with 3 other young guys) this was a great hotel. The cons didn't affect the excellent overall experience we had at the hotel and on our trip.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Modern, comfy and super-urban chic!”", "Author": "Inga_S_11", "ReviewID": "UR117035101", "Content": "Leaving from Meininger Hotel this morning, me and my partner decided that we will miss this Hotel and the atmosphere almost as much as the city of Berlin itself... Overall we absolutely LOVED the experience of staying there. Room: I accidentally booked one twin room with two beds instead of a room with a double bed but that was my fault for misunderstanding the deal... It was fine nevertheless! Upon arrival, our room seemed relatively small. However we got used to it and we realized that due to the fact that there is much storing space so you can get your stuff out of the way, the room is quite comfortable. Needless to say it is very modern and nicely decorated, with a huge window offering a view to the station. Beds: VERY comfortable with super soft and fluffy pillows and covers. Bathroom/WC: small but fully equipped (hand soap, shampoo, blow dryer, towels, toilet paper, napkins, etc) and VERY comfortable shower (glass doors). Sleep quality: our room had a view to the train station. Throughout the night, you can see the trains as well as hear the announcements at the station. I got used to the announcements and the passing trains and I LOVED it, as it adds a very futuristic urban twist to the whole experience. I understand that someone else might find this noise to be a nuisance but for us it was a plus, a feeling that we are in the heart of Berlin and feeling its pulse. Location: cannot get any better!! A stone's throw from the Central Station of Berlin where from you can go everywhere. Also a walking distance from major attractions such as the Reichstag, the Branderburg Gate, etc. Staff: super-friendly, young and modern. Gives you the feeling that you are in a student house or something. And they are professional and helpful at the same time. Breakfast: NOT included in the room price, you have to pay 5.5 euro extra (per person). However, we found it to be the cheapest and best deal as in Berlin to get a full breakfast you have to pay more (around 8-9 euro). Breakfast is served in a well-lighted, super-modern and urban-chic lounge with a rather pleasant atmosphere. The breakfast buffet does not offer a huge variety of stuff as I have seen in other hotels, however everything you might need is there. You can serve yourself as much as you like, and also it is served until unusually late in comparison to other Hotels (11:30 in August). I presume that this is especially useful to late-sleepers and party animals! Cleanliness: perfect, the maid comes in every day, and she can also change your towels if you wish so. All in all the room was so neat! Wi-fi: this is a downside, that you have to pay if you want wi-fi in the room,and wi-fi in the lobby is pretty slow. However, there are a few public computers where access on key sites (such as transportation and berlin info-related) is free. Overall we didn't bother with wi-fi but someone who absolutely needs it as, for example, to work, should be aware that this is not the best wi-fi spot in the universe. Airport transportation: like I said, it is a stone's throw from Berlin Central Station. It is directly connected with airports. The station itself is a marvel to look at! Value: dare I say that you get MORE that what you pay for! We expected less for the price we paid, we thought we would have just some basic accommodation and a place to shower and sleep. However it turned out that our hotel room was an experience in itself and something that we will miss! Overall experience: perfect! I would recommend this to anyone who likes a modern, urban aesthetic and who doesn't mind a little noise and a youthful crowd. If you're looking for a more low-key and quiet stay then this is not your place. But if you're feeling energetic, youthful and adventurous, then this is quite the bargain!", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Middlesbrough, United Kingdom", "Title": "“Perfect for early/late arrivals and short stays”", "Author": "ombro", "ReviewID": "UR116804884", "Content": "Location is ideal for arrival and departing from Berlin Hauptbahnhof, making it ideal for short stays. Opening the room windows makes it a lot noisier due to the summer beach bars and main railway station very close by. However, this wasn't a major problem if you leave the room closed. Only a short walk from the Reichstag, Brandenberg Gate etc makes it a decent start point for exploring Berlin. Wireless Internet is only available in the lobby area, not on the higher floors, which is another minor drawback. Aside from that, the double rooms are well appointed and very tidy. You have everything you need, including nice extras such as a flat screen TV and shower gel provided. Rooms themselves are a bit like a cheap hotel rather than a hostel. Beds in the double rooms can be pushed easily together or apart. Quality of rooms is very good.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Preston, United Kingdom", "Title": "“Clean, Modern & good location”", "Author": "LCowgill", "ReviewID": "UR116699408", "Content": "Easy to find location and also easy to connect to anywhere in the city. Rooms are clean with a good sized bathroom. I was impressed with the quality of the hotel for the relatively cheap prices. Breakfast was an additional 5 euros per day with the usual choices of bread, juice, condiments, fruit, tea, coffee etc. Good lounge area on the ground floor with free WiFi", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York, New York", "Title": "“Excelent basic hotel..”", "Author": "trvlrfrmny", "ReviewID": "UR116679009", "Content": "Their rooms are good except one thing - they have the worst pillows I ever met in any hotel. I appreciate public services they provide - free internet, inexpesive rent of computers, public kitchen, washer and dryer, very cheap international telephone calls. Rooms are airconditioned. Location is very convinient - right at the train station. Sandelman's tour guide picks up people from the hotel lobby. Three bus tours stops a 10 meters from the entrance to the hotel, etc. By the way, avoid red and safari tour buses, take yellow. The staff is very helpful.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Best Quality Hostel”", "Author": "Greg1989_11", "ReviewID": "UR116363613", "Content": "The hostel is amazing in every way, the location couldn't be better literally about 150 yards away from the central station, the atmosphere in the hostel it great full of young and vibrant people and the service we got was second to none plus the rooms were set to an amazing standard for a hostel and we had unreal views of Berlin from our room. I would definitely recommend this place as its not just cheap but also very cheerful. Go here if you want all the famous sights and great nightclubs at your doorstep.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "2.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Central Location”", "Author": "Torsten_Krause", "ReviewID": "UR115889716", "Content": "To start with - my rating of this place is for \"Hotel\", if rating against \"Hostel\" the rating would turn out way higher ... Particularly the breakfast - what in terms of quality is ok - reminds of Hostels, where it is self-service (including returning plates and cups after finishing breakfast. In walking distance to the main railway station, it is centrally located and all sightseeing places are in easy reach by public transport system. Primarily offering four bedrooms the majority of guests is coming from school classes - hence a fairly young group of travellers. The booked double room was very small, the (twin)beds a little narrow, but long enough for tall people. The place itself is pretty busy day and night, wheras the nearby trainstation hardly gives any noise, the guests well do. Can recommend for a short stay, but don't expect too much. The sraff at reception is very friendly and helpful, despite the reception usually being pretty busy", "Date": "July 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Teenagers”", "Author": "Virginia-Vegas", "ReviewID": "UR115611497", "Content": "I was surprised when i came in... There were hundred of teenagers hosted there. The hotel was not bad, but it is not for a business, or holidays trip, but great for tour sons!", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Warsaw, Poland", "Title": "“A disgusting, overexpensive hotel”", "Author": "fcancalon", "ReviewID": "UR115445841", "Content": "Do not look on the appreciation stars (2.5 to 3) given on tripadvisors by other travellers. The hotel itself is probably providing a lot of positive opinions. What you will discover: - absolutely dirty, stinking and microscopic room - no bed prepared, you have to install yourself the bedlinen - the bedlinen equipment is dirty - no paper in the toilet (dirty) and only one (dirty) towel for all the family - the reality of the real bedrooms is not at all what we can see on the official hotel website - the staff is unpleasant, arrogant, unefficient A good point for those who appreciate that: you will benefit from beautiful ladies (probably more attractive than in the NY Sofitel) knocking at your door every hour during the night, wishing you \"welcome to Berlin\" with a very pleasant smile. By the way, the week-end special price for such a room was over 100 EUR. Perfect joke...", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Doha", "Title": "“'Love its accessibility & would likely return!”", "Author": "Flash-10nc", "ReviewID": "UR115423883", "Content": "Arriving early at 6am had its CONS, we had to agonizingly wait in a crowded & hot lobby till 2.30pm to get our room. Our room was quite small & cramp for a family of three. The typical hotel Breakfast of eggs, sausages, cereals, juice, etc is optional. For its PROS, we loved its proximity to the state-of-the-art Haufbanhof. You could walk leisurely to the German Parliament & straight thru to the Brandenburg Gate. We'd love to return to Berlin again. Overall, service was good.", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4"}, "AuthorLocation": "Stoke-on-Trent, United Kingdom", "Title": "“Really good value for money, excellent transport links.”", "Author": "LisaParker13", "ReviewID": "UR115385311", "Content": "My partner and I stayed here just after Christmas 2010, we booked it last minute and got a really good deal (we payed around £120 for 4 nights bed and breakfast). We chose this hotel because of where it was (right outside Hauptbahnhof- the central train station in Berlin) so we thought we would be able to get around easily from there. It was incredibly easy in fact, once you got used to how the train system works! But there were lots of trains going to every area of Berlin with it being the central station, so location of the hotel proved excellent for us. On arriving we were really pleased with the quality of the rooms, nicely laid out, modern and very clean. We had a lovely view from our window of the Reichstag, and everything looked so picturesque because of all the snow :) Breakfast was nice too- continental but lots of choice. If we were to return to Berlin i would definitely consider staying here again.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“love it!”", "Author": "jenjab25", "ReviewID": "UR115289504", "Content": "staying at this hostel was more like staying at a hotel, when we arrived we thought for sure we were at the wrong place since it was fairly cheap, DIRECTLY beside the train station and so nice. Our room was a bit snug but it was clean and the staff was very friendly and helpful. The breakfast that is offered for % euros is very good and all u can eat so its a good way to fill up without spending too much money. The crowd staying there varied in age but the atmosphere was still very good. There is a roof top that you can go on as well which was really nice. The only downfall of this hostel is that you have to pay for internet but that still would not hold me back from going again.", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Santa Clara, California", "Title": "“Near train, but nothing else.”", "Author": "travelNOW222", "ReviewID": "UR115002101", "Content": "It served its purpose. It was clean. The rooms were semi-cheap. And they had beer 24 hours a day. It's steps from the train station, so if you like to sleep with the window open, ask for a room that does not face the tracks. Otherwise, if you sleep with the window shut, you cannot hear a thing. Yes, it's filled with young kids and students, however if you are just sleeping here it is not bothersome. But they are EVERYWHERE. so if you want to drink, eat, use the elevator, watch the sunset on the rooftop deck, etc., you will be with 15-21 year olds who are loud and obnoxious. If this sounds no good, do NOT stay here. other than that, its great. and a nice walk to everything else never hurt anybody. ;) oh, p.s one lady at the counter thought it was ok to argue with guests. that sucked.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Cortlandt Manor NY", "Title": "“Don't plan on sleeping - Noisiest hotel ever”", "Author": "dborchardt4", "ReviewID": "UR114991938", "Content": "This hotel backs up to a rowdy hostel whose party gets started at 10pm and goes on all night. Sleeping in a bar would have been quieter. We complained to a staff that just stared at us blankly. The concept of actually sleeping at the hotel was something they didn't quite get. The people were still outside our window drinking and shouting at 8am. Horrible and unbearable. On top of that they wouldn't believe our Expedia confirmation that we paid for 4 nights. They tried to kick us out, then held us up and robbed us. They charged twice what we had paid in order to stay one more night (that we had already paid for). Still haven't gotten our refund. We had no idea of where else to go so that's why we stayed. terrible idea DO NOT STAY AT THIS HOTEL", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London", "Title": "“Good Value & Location”", "Author": "ironfiek", "ReviewID": "UR113365383", "Content": "We found the hotel to be friendly, comfortable and ideally located for a short stay in Berlin. The concept is a bit different as many other people have commented on. We found this a good thing as the staff seemed pretty relaxed and it was no problem to sit in the lobby munching on some sandwiches we had made ourselves in the kitchen. Only negative I should mention is that there are only two lifts. Its not really a problem as the stairs are fine but if you have a lot of luggage and are staying on the top floor it can take a while to get a free lift at busy times...", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Excellent hostel; location cannot be beat.”", "Author": "melanieinsthlm", "ReviewID": "UR113159872", "Content": "We stayed at the Meininger Hauphtbahhof in February 2011 during the Berlinale film festival. It was my third time in Berlin and it was definitely the best place I've stayed at, and I will definitely stay here again next time I'm there. The hostel is literally steps away from the Hauphtbahnhof, and you could not ask for a better location. We stayed in a private room, which was spartan but clean, with a decent sized bathroom. In spite of the Berlinale, the rates were unbelievably cheap! This was my first Meininger experience but this chain has become my go-to hostel chain. It is definitely not a party hostel (which I personally avoid), and when we stayed there was mostly filled with school groups and young festival folk. If you're looking for something clean, quiet, and affordable, I would definitely recommend this hostel. Free wifi in the lobby, computers available for a fee. Breakfast available for a fee, but we didn't eat it, choosing to buy things from the train station instead. Towels provided in the private room. Small kitchen available for guests. Bar with a variety of options. Great rooftop terrace; wish it hadn't been so cold or I would have spent more time there! Staff was quite helpful and sold us a Berlin Card when we checked in. My only complaint is that the room was really, really cold in the wintertime. Highly recommended!", "Date": "June 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Functional and very convenient”", "Author": "jimrob233", "ReviewID": "UR113114967", "Content": "We spent 2 nights at this hotel to give us a chance to explore central Berlin before going on a cruise. It was ideal for that purpose. The hotel is a strange mix of 3 star hotel, student hostel and scout hut. Don't stay here if you're looking for 5 star luxury. The hotel rooms are basic but have everything you need for a short stay. You get a typical buffet style German breakfast. If there's a school party in, you might have to search for somewhere to sit, but it's all good-natured and cosmopolitan. There's free wi-fi in the reception and bar area. There's also a kitchen where you can prepare your own tea and coffee, and if you're prepared to wait your turn, there are a washing machine and tumble drier. The hotel is right next door to the main railway station which is also a hub for the S-Bahn, U-Bahn and buses. That makes it very easy to get to any point in Berlin from the hotel - and more importantly to get back.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "West Midlands", "Title": "“Good base, good location, full of young teenagers!!”", "Author": "Mr Fereday", "ReviewID": "UR113113159", "Content": "Stayed here recently for a 12-man Stag-Do in Berlin. Obviously we didn't spend a huge amount of time in the rooms but I felt I should give a few comments for potential travellers looking at this venue. Rooms -- Small but very clean and modern. Can be turned into twin beds very easily!! Location -- Very convenient for Hauptbahnhof station BUT we had to travel for all nightlife which we visited. Close to river & Brandenburg Gate. Food -- Breakfast was the usual continental affair but fine nevertheless. The only problems we found was that the roof terrace bar (lovely views from the 9th floor) was never open, so you had to use the elevator back to the ground floor - get the drinks - then elevator back up! What a pain! Also, if you wanted a quiet location then this may not be for you. The hotel seemed to have coaches full of 'school-trips' arriving every day and they were very noisy!!! (Nearly as noisy as our Stag-Do!!!). Also, with the window open you could hear the ariival/departure announcements from the train station day and night.", "Date": "June 13, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Donji Milanovac", "Title": "“Easy way to stay in Berlin”", "Author": "MickoDM", "ReviewID": "UR106858196", "Content": "Hotel is on great location, close to many attractions and just beside main station in Berlin so it is easy to go everywhere in Berlin from this location. Inside, it is very simple, clean and functional.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Stenungsund, Sweden", "Title": "“Nicer than expected- value for your money”", "Author": "Schiotz", "ReviewID": "UR105656116", "Content": "a low price option with much higher standard than i expected. Rooms were nice and clean, free internet available in the lobby, breakfast great value for the € 5,50. Only negative thing I can think of is the pillow- probably the worst ever! Good \"free\" guided walks around Berlin.", "Date": "April 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Zlin, Czech Republic", "Title": "“Modern, profi-standard ho(s)tel”", "Author": "Jan_Zlin", "ReviewID": "UR105524758", "Content": "Next door to Berlin Hauptbahnhof (main train station), very kind, helpful staff at reception, luggage room available both before/after check-in/out (free). WiFi at reception free (quite busy), in rooms and PC at receptions charged. Daily cleaned, modern rooms, beds selfmade, towels for charge. Very nice, clean bathroom. Sufficient breakfast buffet (for 5-6 Euro fee), easy shopping and eating at train station (very modern building from 2006, no noise of trains at all), 10 minutes walk to Unter der Linden street. Think carefully (rather ask) about room type you book (4 bed minidorm is not the same as 4b family room !) Great view from roof terrace (sitting nests, tables for evening coffee...)", "Date": "April 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "australia", "Title": "“Functional & über convenient to all forms of rail travel”", "Author": "AustraliaFox", "ReviewID": "UR102593004", "Content": "Found this hotel on De Bahn website and booked directly. Checked in following 11 hour rail journey from Budapest. Foyer buzzing with groups of young people. Reception friendly and efficient. Room functional hostel style but with coat hangers! Bed firm and comfortable with two separate duvets. Bathroom (shower only) small but adequate. Window looked out to one of the elevated rail platforms. However, noise levels from trains/station announcements/school groups/fellow guests barely noticeable. Location: SBahn, international travel and Metro all on 'doorstep' plus helpful advice from reception staff if needed. Surrounding area looks like a preliminary building site but a short walk to Invalidenstrasse and the Sandkrugbrücke crossing the Berlin-Spandau-Channel with its stark memorial to a shot escapee. There is a restaurant on the banks of the canal, snack type food is available on the Hauptbahnhof otherwise there is little in the way of food or nightlife in the area but Food: breakfast only (not included in room price) adequate buffet style meat, cheese, cereals, breads, tinned fruit etc. Coffee AWFUL instant nasty stuff. Range of tea bags ok. OJ - strange chemical taste. Guest kitchen available. Can buy good coffee at bar behind reception area. Wifi and internet available. Bar on roof not open in March but access available for excellent view (and some smokers).", "Date": "April 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "liverpool", "Title": "“Berlin Bargain!!”", "Author": "singoLiverpool", "ReviewID": "UR101566335", "Content": "Excellent hotel, clean and comfortable, a stones throw from the main station. A ten minute walk from the brandenburg gate. The hotel was 113 euros for a 3 night stay. The tourist bus stops right outside the hotel, which is 20 euros on the bus, but 15 euros if you buy it from the hotel! Staff are very helpful and speak good english, definitely recommended.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "oswestry", "Title": "“Excellent Value and Location”", "Author": "OswestryLyn", "ReviewID": "UR96493751", "Content": "Travelled with a group of sixth form students. We arrived early and the rooms were ready and close together on the first floor, superb view of the Reichstag. Reception staff very friendly and helpful. Location excellent for access to Hauptbahnhof and transport network. Rooms very modern, good facilities. Nice breakfast. No issue with noise quiet at night which was a nice surprise especially as the hotel was full for the Berlinale Film Festival. Had a medical emergency and staff excellent. Would recommend.", "Date": "February 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow", "Title": "“Great location,great value!”", "Author": "Cleo1514", "ReviewID": "UR93780903", "Content": "Stayed in this hotel from the 9th-12th of January with my friend and we had a great time. We arrived too early for check in but were able to leave our luggage in a luggage room and get out and explore the city. The hotel is really well located for walking- about 10 minute walk from Brandenburg Gate and the Holocaust memorial and if you're willing to walk you can easily get about the city on foot. If you prefer to take public transport you are right next to the main train station and trains run reasonably late. It is also ideal for airport transportation about 35-45 minutes by train. The room itself was great, very new, modern and clean. Quite basic but definitely comfortable. We paid 97 pounds for 2 people for 3 nights so really couldn't complain at all. Breakfast was 5.50 per day...bit steep but was much easier than messing around trying to find something to eat and especially thinks like tea and coffee. The hotel also has a guest kitchen so if you want to you are able to cook your own dinner, breakfast etc. There is free wifi in the lobby which is high speed, only free if you have your own laptop or smartphone.Was very handy to contact home using Skype. You can use the hotel computers and internet for a fee or connect to wifi in your room for a fee so it would also be suitable for business travellers. Overall we had a great stay in this hotel and in Berlin overall, it really is a fantastic city, lots to do and not bad prices either!", "Date": "January 19, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "New Zealand", "Title": "“Good value, but noisy”", "Author": "NewZealandAmandab", "ReviewID": "UR93644844", "Content": "I stayed here for five nights from 2 January. I had a twin room as a solo traveller on the third floor. The room was spacious and spotlessly clean when I arrived. The location was tops, right next to the main train station. My room looked right over the railway station yet I had no noise from it whatsoever. The noise I did have, and there was lots of it, were from other guests - noisy talking, tvs at all hours of the night and even on one night, a barking dog. The lobby was like a zoo - and for this reason I decided I did not want to eat breakfast here. On my first night I had four different people knocking or banging on my door looking for their friends. This was really annoying and I wondered what sort of place I was staying at. However, this did not happen on the other nights. The internet terminals in the lobby were 1 euro for 20 minutes. The railway station is absolutely huge and has all kinds of shops and restaurants. It is about an easy 20 minute walk to the Brandenburg Gate. After my first day of sightseeing I arrived back about 6pm to find the room not cleaned and then 5 minutes later the cleaners were knocking wanting to come in and do it then. I wasn't too impressed really at this time of the evening. Overall it was okay as far as the rooms go, except that they need to put a water glass in the bathroom - there was nothing to drink out of. Also I think that they could do with more staff working on the reception. As for the night noise problem I solved that by turning on my airconditioning up high and listened to that running instead of everything and everyone else. I would stay here again due to the location by the station and the price only.", "Date": "January 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Great value hotel, great location, clean and basic”", "Author": "EUTraveller22", "ReviewID": "UR91522558", "Content": "We stayed here for a 4 day getaway for Berlin's massive New Years Eve street party. We're a young thirty-something couple, and we travelled with another couple our age. The location of this hotel at the Hauptbahnof made getting around Berlin an absolute breeze. It was also located walking distance to the Brandenburg Gate, which made NYE's so easy for us. The hotel is basic but great. It was clean, quiet (especially considering it's proximitiy to the train station - with the windows closed, you couldn't even hear the train station...), and the bar and free wi-fi in the lobby were great. If/when we go back to Berlin, we would definitely stay here again.", "Date": "January 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“good value hotel for a family room near train station!”", "Author": "INNALOO", "ReviewID": "UR90761703", "Content": "I was travelling around Europe via train and arrived from Prague. The hotel is very convenient as it is right next to the Berlin central train station. We have a room with 2 bunk beds that sleep 4 of us. Room was quiet, clean. If you are looking for a family room near train station, you can't go wrong with this hotel in Berlin.", "Date": "December 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great location, room had a funny smell.”", "Author": "Kfizzo", "ReviewID": "UR89781047", "Content": "This hotel is in the perfect location, right next to the train station! The room is a decent size, and the bathroom is quite big. There are two negatives I would have, the room had a bit of a funny smell, it was kinda of like stale smoke, but it is a non smoking hotel, and the room I booked was a double room, but it was two singles put together, that kept sliding across the base. But once you were asleep you did not notice. The staff were very friendly and considering how many people are coming and and out of the hotel, their demenour never changed, and you have free wifi downstairs. This is not a overly flash hotel, but it is relatively cheap.", "Date": "December 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tel Aviv", "Title": "“Great hotel, great location!”", "Author": "Ivy-Mae92", "ReviewID": "UR86968103", "Content": "Awesome hotel! I traveled with two other friends, we all had a great time there. It was very clean and on an excellent location - just outside the central train station, and only a few minutes away from the Reichstag. The service was great - we had a misunderstanding about the payment, and the staff helped us out. It didn't matter to us, but it might make a difference for you: There are no nightlife near the hotel. Also, there are many young people and the lobby can be loud. Things that bothered us: 1. We couldn't sleep with the window open, because there was some noise. (of the announcements of the trains that are coming, not of the actual trains) 2. There is free wifi in the lobby, which is great, but it didn't work for 2 nights out of the 7 we stayed there. Overall, we had a great time!", "Date": "November 13, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Duisburg, Germany", "Title": "“next to berlin hauptbahnof”", "Author": "hgaur", "ReviewID": "UR85003965", "Content": "Its location just next to central station is excellent. I stayed here for a weekend. The checkin was quick and swift. The staff is very helpfull and easily approachable. The rooms were decent. We had taken a buffett for the breakfast. this was also very nice. I will recomment staying in this hotel to our friends", "Date": "October 27, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Rooms": "4", "Service": "3", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Can't beat the location”", "Author": "lird5", "ReviewID": "UR84040093", "Content": "This new hotel is situated in a great location next to the Hauptbahnhof so within walking distance of many sights. The check in /out desk was very busy - they could do with more staff. The room was basic and a bit cramped but all new, clean and fairly quiet considering how busy the hotel was. Visit the roof for great views. Breakfast was good. Free wifi in the lobby.", "Date": "October 19, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Meininger Hotel Berlin/Hauptbahnhof”", "Author": "ElpidaT", "ReviewID": "UR83995482", "Content": "The hotel is in a prime location next to the main station in the centre of Berlin. You are just around the corner from the city's many centres, bars, shops, clubs and attractions. The Reichstag and Chancellery are just a 5 minute walk away. Numerous sightseeing tours start directly in front of the hotel. Public transport connections are excellent thanks to the proximity of the main station. The main attraction of the hotel is the roof terrace on the ninth floor which offers breathtaking views over Berlin. All the hotel's modern, non-smoking, air-conditioned rooms are equipped with flat screen TV, telephone and hairdryer. Free wireless internet access is available in the lobby and all public areas. Their lavish \"all you can eat and drink\" breakfast buffet is the ideal start to the day, available for a small additional charge. Enjoy a very special stay in this modern hotel, thanks to its wonderfully relaxed, cosmopolitan atmosphere. It provides a meeting point for people of all ages, backgrounds and nationalities.", "Date": "October 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver", "Title": "“Conveniently located, modern”", "Author": "admybf", "ReviewID": "UR83518358", "Content": "Across the street from Berlin's central railroad station. Modern hotel with a breakfast buffet. Part of it doubles as a hostel, so there are often younger-aged people traveling together or school groups staying here.", "Date": "October 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "York, United Kingdom", "Title": "“top class”", "Author": "marathonmon", "ReviewID": "UR81232794", "Content": "best spot if you are running in the marathon,plus its next to the main train station. very clean staff very very helpfull", "Date": "September 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Great location, spotlessly clean, but poor air conditioning”", "Author": "unspecified", "ReviewID": "UR81070672", "Content": "Right next to the Hauptbahnhof is a fantastic location for getting to other places - a quick S-Bahn trip either East or West takes you to all the key areas for tourism and nightlife, and you're very close to the Reichstag and Brandenburg gate - both excellent to visit at night. The roof bar on the hotel also makes a great place to relax in an evening, and the view's not at all bad. Despite being right next to the main station, noise is not a noticeable problem. Breakfast was varied and good value, and the rooms are spotlessly clean. Wonderful shower and plenty of space in the bathrooms, and the bunk beds were solid and quite comfy. Main complaint is that the air conditioning simply couldn't cope with the 30+ degree temperatures of a Berlin summer - so be warned if you're visiting in the height of summer (the same will go for a lot of hotels, though). In summary - great location and exceptional value. It's definitely a place I'd return to, just in slightly cooler weather!", "Date": "September 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Germany", "Title": "“Great place to stay in Berlin”", "Author": "lisboa100", "ReviewID": "UR79795874", "Content": "I stayed at this hotel for 1 night before ongoing on trip to Copenhagen. The hotel is brand new and is exactly as advertised on their website. Rooms are clean and comfortable and have some storage facilities. I recommend this hotel, since is right next to Berlin Central Railway Station and all major tourist attractions are within 5 stops on both east and west directions. Berlin is a very big city and being central is essential to fully enjoy the city. It can also be easily reached after a night out. Free wireless internet connection is only available in the lobby and in the rooms there is a charge. If you do not wish to pay the 5.50 Euros for the breakfast, no problem at all, there is a good bakery right next door offering breakfast from 2.90 Euros. Inside the central railway station there are plenty of restaurants, a supermarket and a 24 hours pharmacy. The only negative points about this hotel are noisy teenagers in the public areas, but then this is not the hotel fault. I strongly advise potential guests to check out the German school vacation timetable (it differs from state to state) and choose a date when the teenagers will be at school. Most of the reception staff is friendly and polite, I only had a problem at check-in, although I approached the reception in German, the employee insisted in speaking in English. I live in Germany and I had already had a few similar experiences, this all, but polite. But one cannot judge the whole hotel, because of just one employee. I wrote the review in English, so that, it can be available to a wider public.", "Date": "September 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Well connected hotel”", "Author": "atomicspaceship", "ReviewID": "UR79685884", "Content": "I'd stayed at the Meininger in Vienna on a business trip last year and been pleasantly surprised, so when it came to a break in Berlin I booked the Meininger Hauptbahnhof. My partner was sceptical due to the unique hostel/hotel mix, but we both agreed it was an excellent choice. The amazing new central station is a minute's walk away meaning we could get all over the city by U-Bahn and S-Bahn incredibly easily and the TXL bus from Tegel Airport drops you off almost outside. Rooms are clean, modern and well equipped for what you pay for. Also I found the bed comfortable - and I say that as someone who has real problems sleeping in hotel beds. Staff were also polite and we found breakfast perfectly adequate for what we wanted, although a little pricey under the circumstances. The only downside was just one hand and bath towel in the bathroom and you have to pay a deposit for additional towels at reception. Apart from that I'd recommend it.", "Date": "September 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“Fantastic location, clean, friendly and good value”", "Author": "Tantanna", "ReviewID": "UR77190039", "Content": "Spent a week in this great hotel. Fantastic location, 5 minutes walk from the Reichstag, right next to the huge and beautiful main station. Rooms were quite small but had hanging, storage space plus TV. Extremely clean and all run very efficiently. Pay extra for all you can eat breakfast - bread, cheese, tomatoes, cucumbers, cereal, yogurt, apples, etc. Very lively and friendly, full of people enjoying Berlin. Staff very friendly. There's a quite small kitchen for guests to cook in and a bar and space to hang out. The station is enormous and packed full of every fast food chain you can think of plus more healthy ones selling fruit and yogurt pots. Also a supermarket - so we at there quite often. Hotel is very good vaue for city centre and amazing to be so close to major sights such as Reichstag. Views from the roof terrace are beautiful all across the city. Only downside is that we slept with window open and I was woken by the train announcements early in the morning - but I am a light sleeper and after a few days got used to it. Really recommend Berlin and staying in this hotel. Meininger seems a very well organised, good value, friendly chain of hotels.", "Date": "August 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "North Bellmore, New York", "Title": "“Poor Man's Luxury Hotel”", "Author": "AEM7AC", "ReviewID": "UR74989889", "Content": "This is a good hotel, but it's not a great hotel. Admittedly, it's in a good location given it's location right next to the main station, but for now other than the main station itself, there isn't much to see or do. The Reichstag is a bit of a distance away and may be too far for some to walk to. MInd you, that isn't too much of a problem since the S-Bahn connects to Alexanderplatz or the area around Kurfürstendamm in a few minutes, and the U-Bahn is a nice shortcut to Unter der Linden and the Brandenburg Gate. Since I stayed in a single room, I can't comment on the hostel facilities, but I will note that the rooms are well appointed with modern, near-designer grade furniture and bathroom fixtures. The photo featured on their website of the room is effectively what you'll get, so there's nothing misleading on the part of the website. The bed is a bit harder than I'm used to, and the pillow was large and fluffy, but I I suspect this is more in line with European tastes. The rooms were clean with fresh linens and towels. The housekeeping staff does a good job of keeping the hotel clean. I'll also note that the flat panel TV was a nice touch, and featured mostly German-speaking channels with France 2 and BBC World News as the only real useful channels for Anglophones. I happened to have a view on the south side of the building, so I lucked out with a relatively decent view of the city from my sixth floor room. If you're a railfan, you may want to request a room on the north or west portion of the building to get some track views of the station. Despite being next to the main station, it's not relatively noisy as long as the windows are closed. If the windows are open, then one may hear a periodic siren from a police car or an errant announcement from a station or a train or car passing by. If you're ultra sensitive, it may be a problem, but otherwise, it's just background noise and nothing more. As for the breakfast, the 5 Euro fee is effectively an convenience fee for providing some bread, deli meats, yogurt, basic cereals, and orange juice. It's not bad, but it's not exactly the widest selection either. One thing I'll note is that the hotel skews heavily toward younger travelers. If you're intimidated by the prospect of being around young, pretty European tourists, then I suspect you won't like the vibe here. One must remember that this is a hostel too, and there are lots of young people on vacation. During my stay, they were quiet and well behaved and don't bother the older tourists, but one must take that into account if you're choosing to stay here. I'll also note that the wi-fi isn't free in the rooms. Yes, it's free in the lobby, but sometimes, you may want a private browsing session, and you'll simply have to pay up to 25 EUR for that. I'll also note that the air conditioning in my room wasn't of much use, but luckily the windows can open to a relatively wide angle allowing lots of fresh air in. As I said before, it's a good hotel, but it's not a great hotel. If one wants to have a relatively nice modern looking hotel at 75 euros a night in a relatively decent compromise area between both halves of the city, then it's not a bad place. If you're on a budget and not willing to splurge, then go elsewhere or hope for a good discount online. If you're looking for a beautiful room with no compromises, then this hotel will never make you content. If you're looking for a way to feel special while not spending too much money, then this hotel may fit the bill.", "Date": "August 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Perfect Location to enjoy Berlin”", "Author": "AjarnDavid", "ReviewID": "UR71707224", "Content": "Meininger Hotel is next to Berlin's main central train station. The front desk staff were patient and very helpful. I also arranged many one-day tours with Free English Tours and a few other tour companies whose brochures were available in the front lobby of the hotel. This hotel is really like a five-star youth hostel and a great place to meet other international travelers of all ages. Free internet is available on the first floor, which also has a bar with a TV -- perfect to watch sports events. There were many high school groups staying at the hostel, but they seemed to mesh well with other travelers of all ages. I didn't notice any problems except a little overcrowding as guests waited for the two elevators. If you keep your window open on Friday and Saturday nights, you can hear the partying pubs and dance clubs on the nearby river. That's a reminder to GET OUT and PARTY !! But if you need the rest, just shut the window. Rooms were comfortable. I stayed in my own room on the sixth floor which overlooked the city landscape of Berlin. I think the hostel dormitory rooms are ideal for travelers who want to save their Euros. I locked my key in the room one time, but the staff were really cool and gave me a replacement key card.", "Date": "July 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "England", "Title": "“Excellent Rooms & Location - Very Poor Food”", "Author": "NigelC4", "ReviewID": "UR67998762", "Content": "Overall an excellent value for money hotel within easy walking distance of all the main sights. However, the hotel is used by lots of schools and colleges so do not expect a quiet sit in the reception area or bar - it really is not going to happen. That said, there were no issues with noise at night when trying to sleep as there seems to be good sound proofing between rooms and floors. The hotel does offer breakfast and evening meals, which we booked - however, the quality of food is awful and not worth the money - lots of places to eat within a 2min walk so forget eating at the hotel.", "Date": "June 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Location! Location! Location!”", "Author": "thisiskristine", "ReviewID": "UR64045659", "Content": "This is the ideal hotel! The location is unbeatable! The train station is right next door and the sights such as the Bundestag and the Brandenburg are about a 5 to 15 minute walk, which is great if the weather permits! I stayed here alone, but had two beds anyway. The room was fairly large and I had a great view. The only downside is if you are a light sleeper and depending where your room is situated you may be able to hear the trains, but it's not too bad. The bathroom is a good size with amenities. There's a rooftop bar, but sadly, the weather wasn't too nice, so I didn't get the chance to check it out. There's breakfast in the mornings and I think it's 5 Euros paid upon check in. This is a great hotel and really you can't be the convenience to the train station.", "Date": "May 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Perfect Location, Reasonable Prices”", "Author": "EuropeanTourist201", "ReviewID": "UR58331091", "Content": "A newly-built well-maintained property. Location cannot be better. It is literally at the doorsteps of Berlin main railway station and a short stroll to several major tourist attractions. Most of the [young] staff at the reception is really friendly. As it is a den for youngsters, sometimes it can become a bit noisy, but take it as fun. Noise and youngsters go hand in hand. Enjoy it.", "Date": "March 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great place to stay if what you need is a clean, practical stopping off point while seeing this amazing city.”", "Author": "cityscraper", "ReviewID": "UR57256660", "Content": "I went to this hotel as part of a large group of students. Our main aim was to have a nice stopping off point for the evenings and that it be practical - as we had to get everywhere by public transport and walking. For a cheap as chips and central hotel it was fabulous! It was a 10 minute walk to the Reich-Stag (parliament) and a 30 second walk to one of the biggest train stations in Berlin. The rooms weren't enormous, but perfectly adequate allowing plenty of storage and sleeping space. And plugs - that might seem odd but for me - hostels never have enough. The room was equipped with a TV and radio, full length mirror, bathroom facilities. Pretty basic - but we weren't there that much. The best bit of the room by far was the view. I can't swear every room has this view but all the rooms I went in had what I would say is one of the best city views I have ever seen. It was amazing. As for the decorations: To be honest, it looks like a super trendy ikea showroom! If you did happen to find the rooms to cramped- there is a roof terrace and large lobby were guests are invited to hang out which was great for us. I'd definatley recommend this hostel however, if you are the sort of people who will spend a lot of time there it might not be ideal. But if you want to experience the city, save some money and still not sleep in a pit this is a great choice. The best hostel I have ever stayed in and better than a lot of hotels I've stayed in!", "Date": "February 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Yorkshire", "Title": "“Hostel or Hotel - its both!”", "Author": "YorkshireDalesman", "ReviewID": "UR57233325", "Content": "Don't be put off by the thought of this being a youth hostel. It is..and it isn't. I had read the reviews and, because I was leading a discerning group of 50 and 60-somethings, the mention of kids made me start to think twice about my booking. However, when we arrived by train and saw how close the Meininger was that sealed it. Yes, there were lots of teenagers of varying nationalities in the lobby and bar areas during the evenings but they caused no problems at all. Yes, there was one isolated incident of \"adolescent high jinks\" but waiting an extra few minutes for the lift is surely better than possibly sharing a hotel with a gang of immature, middle-aged drunks on a stag weekend - and usually British, sadly!. I must also say that during our stay there was no disruption around our rooms at all. I think it's because the younger guests are accommodated in group rooms on the first few floors. They don't frequent the higher floors where \"normal\" guests are. The en-suite rooms themselves are not massive but they are spotlessly clean and more than adequate if you are out and about all day. How much time do you want to spend in a hotel room anyway? The breakfasts were plentiful with a variety of cereals, bread, fruit, meats and pates, cheese and preserves. You will never have to ask for anything; the buffet is constantly replenished. I can't say the same about the evening meals though. We arrived around 7.30pm, having travelled for 12 hours, and a relaxing meal in the hotel was planned. However, we were advised by the ever helpful staff that the single menu of roast chicken, boiled potatoes and salad was aimed at the kids. They did point us in the direction of some good eating places two S-bahn stops away but, on re-entering the station, we found the food court catered for most tastes and served beer too! By the way, that railway station has to be on your places-to- visit list in Berlin. For Brits, imagine Lakeside, McArthur Glen or Meadowhall with trains on all levels! Not only is the hotel handy for the station, it is within walking distance of the Reichstag and Brandenburg Gate. There is a taxi rank outside and the hop-on/hop-off tour buses stop near the front doors. And do visit the top floor (that door at the back of the lift opens) and enjoy the superb views across Berlin. Overall, we all enjoyed our stay at the Meininger and would not hesitate in staying there again.", "Date": "February 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Irish Aussie", "Title": "“More HOSTEL than Hotel”", "Author": "DJ-Travellers", "ReviewID": "UR54832329", "Content": "If you were a young packpacker you couln't go wrong here. The place is so close to the main Berlin train station which is what we wanted. We had a twin room that was a generous size and very clean. The receptionists were extreemly helpful. The only downside I have is that there were younger residents than I running up and down the corridors in the early hours of the morning and late at night! Immiture boys pressing every button in the lift before you get in etc. Would be a great HOSTEL but not very good HOTEL. Wouldn't like my parents staying here.", "Date": "January 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "london", "Title": "“Good, clean, well located accommodation”", "Author": "cmgallag", "ReviewID": "UR51458618", "Content": "Stayed at the Meininger for 3 nights with a school trip. As other reviewers have said the rooms are quite small but are very clean with good facilities. The location of the hotel is great for the S and U Bahn (just make sure you head towards the Washingtonplatz exit of the Hauptbahnhof) and there's also a direct train running to Schoenefeld. Breakfast is more than adequate with different types of bread rolls, ham, cheese, toast, cereals, yoghurt etc and it's also on until quite late - I think maybe 10.30am on the weekends which gives you chance for a lie in. As we were part of a school group we also had dinner included, the food again was great and if you didn't like what was on offer there was again bread rolls with ham and cheese to fill you up. The bar and reception area is nice and clean and there's a pool table in the breakfast room. They also have 2 pretty big luggage storage rooms. The internet terminals in reception are pretty reasonably priced in comparison to others that I've encountered. My only gripe would be that service at the reception can be pretty dire (and miserable) depending on who is working. I had to wait 15 mins just to collect keys and some of the employees like to ignore you standing in front of them and act like the simplest things are a problem. However despite this if the trip were to run again I'd definitely stay here and would even stay here if I were to travel to Berlin on my own.", "Date": "December 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Fareham", "Title": "“excellent location, rooms and service”", "Author": "mizzy71", "ReviewID": "UR51408517", "Content": "Hotel is right next to the station and only a short walk to the Reichstag. Rooms were clean and compfortable. Breakfast buffet was good. Would definitely stay here again.", "Date": "December 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Great new hotel and excellent value”", "Author": "joshua06", "ReviewID": "UR51067577", "Content": "Stayed at the meininger hauptbanhof recently with 17 others on a group booking. €49 per triple room was an absolute bargain for this hotel. Great location 2 minute walk to the main station. Plenty of taxis right outside front door to go anywhere in berlin. Nice moderm reception area with fast efficient service, all of the 6 rooms checked in within 10 minutes. Rooms were not massive but big enough, lcd tv on wall 3 single beds and walk in shower. I have stayed in many 4 star hotels which did not have the cleanliness and comfort of these rooms. Bar area was clean and modern with cheap drinks. All in all i would recommend this hotel highly for it's price and location to the station.", "Date": "December 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "MALTA", "Title": "“Excellent hotel, especially for groups of students”", "Author": "Tano", "ReviewID": "UR47761976", "Content": "I have just returned from a four day visit to Berlin, having stayed at the Meininger Hotel. This hotel is next door to the Hauptbahnhof Central train station, making the hotel an ideal place to stay if one is travelling with trains. The hotel is only a five minutes walk from the Bundestag and a few more minutes to the Brandenburg Gate. The hotel is basic yet very clean. The breakfast is basic yet adequate. The hotel does not have the benefits & fringes of a 5 star hotel, yet it is good value for money. It is ideal for teachers visiting Berlin with groups of students. Students are well catered for the whole environment is compatible with young people. Internet is available for free from the reception (laptop) or at a basic price from one's room. The only item I would suggest to the hotel is to change the pillow as it is too big for confort. I would stay again at the hotel, even when travelling with my family on holiday.", "Date": "October 26, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Alba", "Title": "“Could do better”", "Author": "IainMacIain", "ReviewID": "UR47168885", "Content": "Excellent location for transport, being just a minute away from main train station, Hotel warm and clean. I find the check out time of 10am a bit restrictive though, especially when you have to wait or negotiate with cleaners to get into your room on arrival - and that's after the check-in time. Breakfast was sufficient at 4.50 euros but very packed, probably due to everyone having to beat the check-out time! A little flexibility and understanding would make the stay more enjoyable.", "Date": "October 18, 2009"}], "HotelInfo": {"Name": "Meininger Hotel Berlin Hauptbahnhof", "HotelURL": "/ShowUserReviews-g187323-d1557166-Reviews-Meininger_Hotel_Berlin_Hauptbahnhof-Berlin.html", "Price": "$66 - $196*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Ella-Trebe-Strasse 9</span>, <span class=\"locality\"><span property=\"v:postal-code\">10557</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "1557166", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/07/be/07befd1af29b6dc6b523a64d3141cc994large.jpg"}}