{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Whistler, BC", "Title": "“A visit to Vancouver to see \"Cats\"”", "Author": "nosniborard", "ReviewID": "UR128302252", "Content": "The hotel has been upgraded and we had no complaints regarding the accommodation or the staff.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Golden, Canada", "Title": "“Perfect for a family!”", "Author": "Fussybutfair69", "ReviewID": "UR128085800", "Content": "Yes, it is older......but DO NOT let that get in your way. Superb location for families, clean, with friendly staff. Very close to Stanley Park and English Bay. More variety of restaurants than you can shake a stick at within a two block radius, but also a 30% discount in house on evening dining. Great having a fridge in the room, and a market for odds and ends in the mini-mall attached. The kids loved the pool, and having a walk out balcony to take in the view was a treat. We would use this hotel again in a heartbeat!", "Date": "April 17, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Seattle, Washington, United States", "Title": "“good value”", "Author": "Michael S", "ReviewID": "UR128000969", "Content": "Stayed there as part of a groupon promotion. The accommodations are dated, but clean and the location is great. The area is fun to walk around and just off the beaten track of Robson. There is a movie theater on the bottom of the hotel for easy access to a quick flick if desired. We'd go back again.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Older hotel, but it has nice views.”", "Author": "Marchouston1987", "ReviewID": "UR127838380", "Content": "The coast is on the older part of downtown. The rooms looked like they were from the 80's. Everything worked fine in the room, except for the low water pressure. The ceilings in the shower are a bit short too. If you're over 6' it could get annoying. This was my first time in Vancouver, so I didn't know what part of town was the best for a young guy. I learnedthat gastown is the newest most active area. The hotel is only a short walk from Stanley park, and some amazing views. Even though the rooms were dated, they were nice. Overall it was a good experience.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Great Location”", "Author": "Dr_Bob1", "ReviewID": "UR127401816", "Content": "We stayed 11 nights at the Coast Plaza. The hotel decor is a little tired and there were signs of wear and tear in the shower. However, the suite was spotlessly clean and quite well-appointed. The view was excellent. The hotel is well-placed in the West End and is within walking distance of almost everything in downtown Vancouver, and is also next to Stanley Park. Staff were friendly and helpful (they responded to a 'broken TV' call withing 5 minutes {though they fixed this by moving the bedroom TV into the living area and took no further action}). We've stayed here before and will do so again.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great location”", "Author": "cengizg29", "ReviewID": "UR127189710", "Content": "This hotel is close to many of the attractions you would want.... Stanley Park, restaurants, Robson street is a few blocks away, theatres in the hotel area", "Date": "April 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Calgary", "Title": "“Family get away”", "Author": "Charles D", "ReviewID": "UR127158263", "Content": "Excellent location for English Bay and Stanley Park. Lots of restaurants close by, good atmosphere in the area. Hotel rooms a little tired looking but clean and very helpful staff.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Washington Crossing, Pennsylvania", "Title": "“Location, location, location!”", "Author": "Wanderluster60", "ReviewID": "UR127149934", "Content": "The hotel rooms are in serious need of complete renovation but the location of the hotels is probably the best in all of Vancouver! Easy walk to fabulous beach, the sea wall, Stanley Park and tons of restaurants. We put up with the crappy rooms for the great views overlooking English Bay (ask for Bay view!) and the great location!", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oregon", "Title": "“Nice hotel, service and location”", "Author": "SnorkleNut", "ReviewID": "UR126759845", "Content": "We had TravelZoo coupons for a two-night stay. From our call to book the room to our checkout, the service we received was excellent. The concierage desk was very helpful in giving maps and marking the best routes to areas we wanted to explore. Being able to park our car in the covered parking garage was nice. We were on the 17th floor which had been updated and had a nice view of the rooftop garden. The hotel is located near many restaurants and in a safe area close to Stanley Park. We would definitely use the hotel again when visiting Vancouver, BC.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Revelstoke, Canada", "Title": "“Good experience”", "Author": "Tim P", "ReviewID": "UR126716584", "Content": "Large room, upgraded due to low season. excellent views, good staff. recently updated.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great View!!”", "Author": "Banana9999", "ReviewID": "UR126572419", "Content": "My family stayed here while visiting. Great service, friendly staff clean rooms, excellent location. Will recommend again for future visitors :))", "Date": "March 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kamloops, Canada", "Title": "“Awesome Views and Location!”", "Author": "cynlouhoo", "ReviewID": "UR126563973", "Content": "I waffled between giving this hotel a 3 or a 4 rating. The views and location make it a solid 4 for sure! Pros: -Location! So close to the beach and Stanley Park and countless amazing restaurants. -Super comfortable beds! -Spacious suite (we had a 2 bedroom on 32nd floor). It even had 1.5 bathrooms! -Amazing views from 2 balconies! Ocean, Stanley Park, and Lion's Gate Bridge views.....beautiful day or night. -Full kitchen in our suite -Free Wireless Cons: -Outdated decor throughout mixed with a few newer pieces. Bathrooms and kitchen were super dated! -Kitchen not properly equipped. Bare minimum of dishes, etc. Tiny coffee pot. Old, loud dishwasher and an old microwave (took more than 3 minutes for popcorn and burnt bag before popping all the kernals!) -No pool towels. Had to bring towels from the room. Room had just 4 bathtowels in it. -Parking $25/day (though this is not uncommon in the area). -Tiny TV in the massive livingroom. -Small dining table with only 2 chairs. Seemed a bit strange for a large 2 bdrm suite with a full kitchen. -Basic and minimal single use toiletry items. Large refillable bottles of lotion and bath gel in both bathrooms might be good from a enviromnental point of view, but from a safety and cleanliness point of view, not good at all. Overall, the views and location probably outweigh the list of cons, but if you are fairly picky and like updated rooms, you may be a little disappointed. And, if you don't get a room with amazing views, you may be a lot disappointed! Most definately this would be an awesome location for viewing the fireworks (if you book a view room). Bring binoculars!", "Date": "March 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Large Rooms, But Hotel is Not Fully Renovated”", "Author": "kayehm", "ReviewID": "UR126396313", "Content": "Booked via Hotwire for the Family Day weekend in February. The hotel was in a state of being renovated. Piles of carpet in the lobby and carpet in hallways was to be replaced over that weekend. The room was very large and clean - but definitely not renovated. Still old furniture from the 80's with old bathroom fixtures and very worn carpet in the room. Beds at least appeared to be new. Great location near the beach and Stanley park meant I didn't have to spend much time in the room.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chetwynd, Canada", "Title": "“Gorgeous view, walking distance to the beach”", "Author": "justmy0pinion", "ReviewID": "UR126244838", "Content": "Nice rooms, walking distance to lots of attraction. Stayed on the 25th floor with an amazing view. Friendly staff, clean rooms. Quiet even though it's in a busy area.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Arlington, Washington", "Title": "“major disappointment”", "Author": "Debbie4593", "ReviewID": "UR126045019", "Content": "We purchased a great deal through Travelocity for a superior suite and were VERY disappointed. The room was extremely outdated, the room was large but sparse - hardly any furniture at all and the kitchen & bathroom were horrific. The pool/hottub area was not any better. I couldn't believe how outdated this entire hotel was, especially since Vancouver had just hosted the Olympics, I was expecting something so much better. Clearly, the pictures posted of the rooms were NOT what we got. This was by far one of the lousiest hotel rooms I've ever stayed in. The view was awful - our room was facing a horrible part of the city - run down buildings and homeless people everywhere. Plus, we were located right next to the elevator and the bedroom was against the wall of the elevator shaft, so we heard the elevator all night long. TOTALLY NOT WORTH THE MONEY - GO SOMEWHERE ELSE!", "Date": "March 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "toronto", "Title": "“Vancouver's Best-Kept Secret!”", "Author": "CoyneToronto", "ReviewID": "UR125848191", "Content": "This hotel has huge, clean rooms with balconies overlooking English Bay, the mountains and Stanley Park (or city views, if preferred). It has an enormous indoor pool (by hotel standards) with opens at 6:00 every morning. It's only minutes away from downtown on foot and the street below is rife with restaurants offering everything from fine dining to fast-food and everything in between. There's even a mall below the hotel at street level with a large supermarket, interesting shops and believe it or not, a full-size movie theatre. The staff are polite, friendly, helpful and very efficient. In short, this is a very well-run hotel in a choice part of the city. There's virtually not another one like it anywhere in Vancouver and there's nowhere else that we would choose to stay--regardless of price!", "Date": "March 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great conference”", "Author": "MacCameron", "ReviewID": "UR125375509", "Content": "Stayed here for ICT conference. Food was fantastic. Most impressed with food servers and staff.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“They made me feel like we weere staying there for too little $$$”", "Author": "cyntia n", "ReviewID": "UR125362861", "Content": "I got a great deal online for this hotel and we stayed 2 nights. Although it has a great location and the rooms are quite large and clean, the front desk staff pointed out a couple of times that we paid too little money for the room and immediately dismissed any requests we had (extra towels!!!)...too bad!!", "Date": "February 28, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Fantastic views”", "Author": "Olga2410", "ReviewID": "UR125076556", "Content": "We stayed at Coast Plaza Hotel and Suites with friends for just one night. It was a quick weekend gateway from Seattle, US. Location is great! But views from the room were just fabulous! Room was ok - very simple. We were away almoust whole day and came at late night, so couldn't explore hotel facilities in fully. Check - out morning was very sunny and warm, so we could fully enjoy fantastic views from the 24th floor.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“++++++ Excellent Hotel and Service”", "Author": "William B", "ReviewID": "UR125054945", "Content": "Six star service for more then affordable rates. I highly reccoment!", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Coquitlam, Canada", "Title": "“Perfect location and great value!”", "Author": "Christie F", "ReviewID": "UR124840222", "Content": "We got a great deal on our room, and when we arrived they gave us a few free upgrades for my husband's birthday. The room was a very good size, with a spectacular view! The pool and hot tub were great. The location is perfect to check out Stanley Park, lots of excellent restaurants, And English Bay. We would stay here again in a heartbeat.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "manchester", "Title": "“Really good place”", "Author": "UKDavidN", "ReviewID": "UR124217152", "Content": "Enjoyed our stay here last month despite not being in one of the renovated rooms. Views are great due to lack of nearby hotels; staff very friendly; pretty good location though its a bus ride downtown; free leisure facilities next door are great.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edmonton", "Title": "“Great hotel made better by some wonderful upgrades”", "Author": "KJMCC", "ReviewID": "UR123695862", "Content": "Was very happy to see Coast has upgraded this property. Had a fantastic stay. Flat screen tv's, new beds, new kitchen in the suite. Incredible view of English Bay. Same great staff as before...and now the product matches the team.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Edmonton, Alberta, Canada", "Title": "“An Old Favorite”", "Author": "onedery", "ReviewID": "UR123383398", "Content": "I go to Vancouver fairly often and try to stay at the Coast whenever I do. This has been the case for more than 20 years now! So, yes it is not a new Hotel. But the location can not be beat, and the staff are always helpful and fantastic. The rooms are ok - they try hard. it is not luxurious, but more than comfortable. I shall return!", "Date": "January 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "duncan", "Title": "“Location is the highlight”", "Author": "vekel", "ReviewID": "UR122143741", "Content": "This hotel is in a primo location for walking the sea wall, going to Stanley Park, and for shopping in some wonderful stores. The restaurant choices are fantastic as well. We did purchase a promo room and quite honestly they should have given us a promo room. The room we got was OK but it didn't encourage me to visit again. I know they had better rooms available because it certainly wasn't busy. I have stayed at this hotel before and had the newly renovated room and it was nice. The older rooms appear dirty and I would not have a bath in the tub. I usually check the bedding in any hotel and found this hotel to be acceptable. I think they should promote the nice rooms and if they run out of those, then offer the other rooms. This would have worked nice for us and I would have felt taken care of.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Seattle, WA", "Title": "“Had a good Stay at the Coast Plaza Hotel & Suites”", "Author": "Puttersea", "ReviewID": "UR121714689", "Content": "This is probably about the 10th time I have stay at the establishment so I thought I would finally write a little review on my current stay in this Hotel. First off I want to mention that this was a Priceline reservation and prior to the reservation I went in and requested a Upper Floor room. Of course the people in reservation were quick to advise me that with this type of reservation nothing is guarranteed. Of course with me being a frequent priceline/hotwire user this did not phase me. We arrived at the hotel around 4:00 p.m. Pulled into the parking garage, no parking attendant on duty with a sign that says \"will return in 15 minutes\". Well what to do? Well we went ahead and went on in and checked in. Everything was fine with the parking, just remember to bring your license plate number to the front desk. Checkin process was smooth, except he proceeded to tell us that the highest floor we can obtain with a priceline reservation was the 10th floor. Wasn't to thrilled about that considering there are about 34 floors of rooms in this hotel. But, the 10th floor was acceptable. Of course, he was willing to upgrade us for $20. a night to a higher floor. No special occassion for this trip so \"no thanks\". But at the very end of the process he said he will put us on the 17th floor. \"Score!\" It pays to be nice. Parking: $25.00 per night. Ouch!!! (Never understood why hotels charge for parking for their guests, but we all know the word \"GREED\" don't we). HINT: If you self park your car on the otherside of the hotel off of Nelson Street and use the automated machines it is only $20.00 a night and it is still the hotel parking garage. I mentioned this to the front desk and they had no idea about it. Go Figure. Pets: $25.00 per night which is about standard to Vancouver hotels. However, this hotel is the best for pets as it is only a few blocks from the park. HINT: There is a offleash dog park South on Comox street about 8 blocks. Elevators: We had no problem with the elevators except when we checked out. Took us forever to get an elevator down as everyone was leaving at the same time. Otherwise, I felt they were acceptable. Room: I thought our room was very clean and the view nice. They now have LCD TV's in the rooms which I don't remember them ever having before. We had a full kitchen which was nice. One of the floor lamps was very wabble and all I had to do was re-tighten it up. Not sure why housekeeping had never done that. Bathroom was pink and clean. How cool is that!!! Overlall even though furniture and fixtures were a little outdated, I was happy with my room. It was very quiet at night. It was even missing a can opener and the promptly brought one to our room. Pool/Gym: They have free access to the gym next door, they won't tell you this when you have a priceline reservation, but I have stayed there before and the gym is nice. The pool and jacuizzi area was nice and the jacuizzi was hot and the locker room with sauna was clean. Check out: Automated check out from the television which I always like. Well that pretty much sums it up. Overall I was happy with this trip. I don't think I would care to pay full price for this hotel especially in the summer months, but for a priceline/hotwire reservation it is very nice.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "3.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Disgusting!”", "Author": "HollsZ", "ReviewID": "UR121327681", "Content": "My room was not clean. There were TOENAIL clippings on the carpet by the bed. Sink and tub were not cleaned thouroughly. I complained at the front desk and they didn't try hard enough to make things right for me. I ended up with no compensation for my awful experience but the promise to \"take good care of me next time\". There will never ever be a next time.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "", "Title": "“Very friendly staff and great location - Building needs a facelift”", "Author": "wmdolman", "ReviewID": "UR120644275", "Content": "My husband and I stayed at this hotel for one night as part of a weekend vacation package that we won through a radio station giveaway. We checked in about 2 hours early, and were given a room right away, which was in a fairly quiet corner on the 17th floor. For a standard/basic room, it had a great view of the mountains, highrises and a sliver of English Bay. My first impression of the staff was great. The bell staff are extremely amiable and friendly. They helped us with finding a taxi and directing us to a few tour stops we did on the trip. The front desk clerks were very kind and helpful during the entire trip. I was a bit apprehensive at first to stay at this hotel, after reading that this is a converted residential apartment block built in the late 1960's or early 1970's and converted into a mixed-use commercial hotel. The beds were brand new and very comfortable. The duvets and bedding were also brand new. However, the 1980's Dynasty crystal lamps and chintzy curtains didn't compliment the great bedding. The bathroom is another story. You kind of walk three decades into the past as you walk toward the bathroom. The bedding and television (flatscreen) seem to be from this actual decade, the furniture and curtains are from the 1980's, and the fridge seems to be from the 1970's. The bathroom is very outdated. Hopefully, they are doing remodeling and upgrades in phases, starting with the bedding and television sets. The tub is one of those old ceramic larger tubs from the 1960's, and the toilet is purple. The wallpaper seems to have been changed in the 1980's. A classic Honeywell thermostat sits on the wall, and mirrors our outdated one from our 1950's home. Even with the ecclectic hodgepodge of furnishings and styles, the room was fairly quiet and comfortable (even with a large convention taking place in the hotel during our stay). The swimming pool was in the basement, and it was very large and clean. One problem is the very cramped and slow elevators. We waited for an elevator for 7 minutes before giving up and sojurning up the stairs. And when you do get an elevator, it barely will accommodate 5 people comfortably. Try that with lots of luggage. All in all, the hotel does need some more work, but I think they are heading in the right direction. This location can boast a convenient trek to Stanley Park and Robson Street, as well as a short journey to a built in mall downstairs in case you forgot to pack that must-needed amenity, such as a portable umbrella, to weather a rainy November Vancouver day.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "", "Title": "“Very Disappointing for a Coast”", "Author": "Fate_tw", "ReviewID": "UR120173094", "Content": "Where to begin...this is an old building, and it shows. It's desperately in need of updates. There are 4 elevators for the hotel, all are extremely slow. The room I was in looked straight out of the 70's, from the purple fixtures in the bathroom to the polyester tailored bed spread that gets washed once a month. The lino in the kitchenette had holes in it, the wall paper was coming apart at the seams. There was mold on the roof in the bathroom, likely due to no ventilation available. Thank goodness the wi-fi is free, because when you can maintain a connection (router was constantly booting me) it's extremely slow. There was a mild wind one night which kept slamming a vent somewhere on the building right outside my window, was extremely frustrating. Will not be staying at this Coast again.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "108 Mile Ranch, British Columbia, Canada", "Title": "“Fabulous location and staff”", "Author": "Heather W", "ReviewID": "UR120155567", "Content": "I just recently stayed here for 4 nights and enjoyed every minute. This hotel is close to many amenities, very friendly staff, great food & very quiet. One night we walked to sea bus and took a great ride over to Granville Island to eat dinner, the other nights we wandered around until we found any ethnic food we wanted, we also had dessert at a fabulous little bakery. ALL WITHIN WALKING DISTANCE !! The hotel is very clean, very quiet and the pool and hot tub were fabulous. I will be back with my family next time !!", "Date": "November 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Vancouver Island", "Title": "“Suite spot in Vancouver......”", "Author": "serene-goddess", "ReviewID": "UR120000892", "Content": "Good value. In a fab.location. The west-end is a vibrant neighbourhood close to all the highlights of Vancouver. Short walk to Robson shopping and the city but close to the beach and cafes . I love having a small kitchen when I am in the city.....chill the wine , keep left-overs from great local eateries ,store fruit and yoghurt for an early breakfast. The decor is dated and the wallpaper was starting to peel in a few corners .....definately need new linens and duvets ....that would help. But for the price and location ....it is a good home away from home. The pub was packed on thurs.eve ....30% off & a hockey game! Average pub fare. Always come home to the friendly staff at Coast plaza. We did miss feeding the squirrels at the front door!", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "West Vancouver, Canada", "Title": "“Tattered at the edges”", "Author": "NorthVancouverBobo", "ReviewID": "UR119996316", "Content": "An old apartment complex turned into a hotel. Great location and adequate accomodations. I was put off by the continental breakfast which consisted of obvious previously frozen miniature sized pastries. I was expecting more for the price. The staff were very professional and friendly and did their best to make me feel welcome. I would recommend it for its location above all, just don't expect anything fancy.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Shropshire", "Title": "“Great location, good food and a welcoming hotel.”", "Author": "BigJohnShropshire", "ReviewID": "UR119545994", "Content": "My wife and I spent three very comfortable nights in this hotel. It compared extremely well with the other 4 star hotels we had stayed in in Montreal, Ottawa, Toronto, Banff and Jasper. Very handy location for the incomparable Stanley Park and for Denman and Davie Streets, Sunset Beach, West End and English Bay, but somewhat out of the way from the city centre,Waterfont and Gastown. Nevertheless, city transport is great and nowhere seems too distant on foot. A great variety of eateries within a stonesthrow of the hotel. The large lobby was manned by friendly, helpful and knowledgeable staff, the banks of lifts kept waiting time to a minimum and the rooms on the 18th floor were spacious, clean, comfortable and well appointed - apart from a lack of overhead lighting, which made reading difficult. The swimming pool was larger than many - some 18 x 14 metres & reasonably warm, the whirlpool and saunas were good. TVs in the bedrooms were large & modern, writing desks & armchairs were functional, hanging space was generous. We enjoyed tasty meals in the restaurant and the brasserie. Good steaks and fish & chips. Friendly & efficient service and reasonable prices for wines & beers. My only complaints were that the top floor proved inaccessible and, as with all the other Canadian hotels we stayed in, the pillows were too large & the loo paper too thin!", "Date": "October 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Great location”", "Author": "tstsa", "ReviewID": "UR119532148", "Content": "We recently stayed here for one week and it was great. We selected a King suite with a kitchen as we wanted to have breakfast there. The room was a great size with a wonderful view. It was a little tired and could use with some updating especially in the kitchen and bathroom. The room was very quiet and had a big balcony. The location made it perfect. Close to stores and restaurants as well as Stanley Park. The bed was very comfortable as well. The staff were all very polite and efficient. Would stay here again if in Vancouver even though it is not a fancy hotel but had everything we needed.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Stanley Park and English Bay -- Perfect Location”", "Author": "Johann806", "ReviewID": "UR119483058", "Content": "We have stayed at the Coast Plaza many times over the years. We always enjoy our stay and this trip was no exception. This hotel meets all of our requirements: clean, great location, value, and it has great staff too. English Bay and the seawall are practically just outside the door and Stanley Park is Just minutes away, as are Coal Harbour and False Creek (Granville Island). Easy public transportation on Denman makes it easy to get anywhere in the city. There are MANY restaraunts on Denman covering a broad range of cuisines. If one is looking for a relaxing stay with easy access to fabulous walking and views and food, I can't think of a better location. Our 22nd floor room had a view of English Bay. A grocery store in the complex at street level is convenient to get fruit and other staples.The kitchenette with a fride is very useful on a longer stay. My only negative comment is that, in our room, Wi-Fi was very slow. We are looking forward to our next visit.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Tranquil Location With Pleasant Surrounding Walks”", "Author": "DiggoryLondon", "ReviewID": "UR119454308", "Content": "During our three week visit to Canada my wife & myself stayed in this hotel twice. On the first occasion we were allocated Room 1802 which had a balcony with a view of the harbour. The second visit found us in Room 3205 this gave us not only harbour but mountain views. When booking in - should you have a head for heights - take up the offer of a room at the top of the hotel - you will not be disappointed with the views. This is a really good hotel, all the staff are very friendly & helpful. It was very clean and both of our rooms ( and bathrooms) were furnished to a good standard. Whenever we passed a member of the cleaning staff in the corridor we were always greeted with a smile & a 'good day' followed by an enquiry as to whether everything was correct with our room. Being English ( & not a coffee drinker) it was pleasant to find extra tea bags had been placed in our room, this was an extremely nice thought. We had the continental breakfast which was more than sufficient. The restaurant waiter proved to be a valuable source of information regarding places to visit & more importantly in which order. The harbour, beach & Stanley Park are all within walking distance. Although this hotel is slightly out of town in a more suburban setting it resulted in a more tranquil stay. However, within 20 minutes of walking you can be in the centre of the city. Following our two visits, I would definitely stay at this hotel again.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“always a treat”", "Author": "amoamore", "ReviewID": "UR119190496", "Content": "when in vancouver i always stay @ the coast plaza. while conveniently located ( a 15 minute walk to granville and well serviced by public transportation) i appreciate the location in the west end as it is just removed from the hurly burly of downtown and adjacent to both english bay and stanley park. very relaxing i am usually upgraded to a high floor ( it pays to ask) and the views on all four sides of the hotel are spectacular. most if not all of the rooms have balconies so fresh air is immediately adjacent to the room. the rooms are large and comfortable. staff are uniformly kind, efficient and charming. the hotel sits above the denman shopping mall so there are plenty of services right below you including a low cost super market. there is an overabundance of good restaurants at all price points within a 1-10 minute walk. room service comes up from the coffee shop in the lobby and is extremely reasonable. on my last stay i had scrambled eggs, canadian back bacon, hash browns and toast and jam for $10. !!", "Date": "October 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "kamloops,B.C.", "Title": "“A Feel Good Hotel”", "Author": "clubmed63", "ReviewID": "UR119000761", "Content": "I have learned from reading Tripadvisor for several years now, that everyones' expectations are different. For me, the important features of accommodations are that I am greeted with a warm and efficient attitude. Staff should be trained to always remember who pays their wages. As far as the accommodations are concerned, I have stayed in many hotels in various countries, from Europe to Asia and here at home and my main expectations are that the room is CLEAN. Otherwise I am not demanding since I mainly stay in budget hotels. Now, to my review of the Coast Plaza Hotel; I attended a conference for two days, Sept 30 / Oct.01 with my wife. The booking was pre arranged. We arrived at approximately 4p.m. and were greeted by Shannon at the desk. I asked her if it was possible to get a view room and although the hotel was apparently booked quite full, she could give us a choice of a room with a king bed on the 7th floor or a room with two double beds on the 19th floor which we chose. You see, it's all about service. Thank you Shannon. Both my wife and I were happy with the accommodations. The room was a good size, approximately 18 ft. square not including the hallway or bathroom. The fact that it had a rather long hallway made the room seem larger since you did not walk into the room directly. There were three closets; one in the bathroom, one in the hallway and one in the room proper. (never seen that before!) As mentioned in many reviews, the furniture was dated, but I don't stay in the room for the furniture. It was perfectly o.k. and in good condition. As I mentioned above, I look for cleanliness and this room was that. The bathroom was interesting in that it had a fore room with a sink vanity and another sink vanity in the bathroom proper which makes it convenient for two persons using two sinks at the same time. The bathroom was clean and had all the required amenities including plenty of towels. The room had a refrigerator and a coffee maker, a flat screen t.v. which was a little far from the bed due to the size of the room but no big issue. There is a portable air con, and, although we did not use it because of the time of year, I did turn it on momentarily to test for noise. It was acceptable in my opinion. Both my wife and I agree the bed was great; like sleeping on a cloud (if that were possible) and of course, clean linen. There is a beautiful view from the balcony partially facing English Bay and The North Shore. The hotel is situated in a very convenient and pleasant location of the west end with many shops and restaurants on Denman and Davie Streets. We walked along English Bay to the little ferry boat which we took to Granville Island. There, we roamed around the overpriced shops and listened to some wonderful pan floutist from Peru in the square. Wonderful and memorable. A buffet breakfast was provided in the conference room on the upper floor (The Horizon Room) which was tasty, consisting of scrambled eggs, hash brown potatoes, sausage, bacon, fresh fruit, fruit juices, coffee, tea and buns. For our coffee breaks we were provided with Nanaimo bars, brownies, cookies and more fresh fruit with coffee and tea, altogether, very good. Did I have any negatives? Yes, I will mention a few issues that I saw. A couple of resin chairs on the balcony would have been nice. I did not want to take the inside wooden chairs onto the balcony due to possible damage from weather. A microwave would have been nice, and also an iron and ironing board. Perhaps you can get an iron if you ask at the desk. I did not try, so I don't know. Another thing, I did not see any robes in the closets, since the hotel has a pool, it would make sense to provide robes so that one can go to the pool via the elevator in a robe. Again, perhaps robes are available upon request, I did not ask. These are not complaints, only observations and suggestions. The only complaint I have is the cost of parking. $25.00 per day to park a car, in my opinion, is outrageous!!! Although my parking was paid for by the conference I would find it very difficult to stay in this hotel for this reason alone. You are pretty much held hostage to pay that if you book at this hotel and drive there from out of town. I think that guests should get a break with a lower parking rate since the rooms are already priced at a premium rate. Thank you for reading.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver", "Title": "“Decent hotel, Great location.”", "Author": "westcoastcutie", "ReviewID": "UR118996589", "Content": "A decent hotel in a great location. Room was big with a sitting area, table, and full kitchen. Conference facilities and catering were fine. Rooms were a bit expensive but overall I would be comfortable staying here again.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Calgary, Canada", "Title": "“Okay Stay but Dated Hotel”", "Author": "PsychRN12", "ReviewID": "UR118976103", "Content": "I stayed here for a conference that was occurring in the same hotel. My stay was okay but this hotel is definitely showing its age. The lobby and service were excellent. My room was on the 22nd floor and had a fair view of English Bay. However, the furniture in my room looked quite old. There were scratches and dents on the tables and chairs. There was no desk for working. I had a full kitchen but very dated appliances. There was no central air conditioning, rather there was a small portable unit that did not have a thermostat on it. The bed was comfortable but the pillows were flat and the linens were old (I had a bedspread that looked like it was from the 90's). The TV would go fuzzy from time to time depending on where it was positioned between the bed and the living room. One of the more interesting features were the pink porcelain toilet and bathtub (again, looked like out of the early 90's). Food was great - especially the 30% off for all orders from hotel guests. As well, internet was free though could be very slow depending how many people were on at a time. Access to a full fitness club was a nice touch. The pool was okay, but located in the basement and had no natural light. The conference rooms were hot and stuffy most of the time. Also, this hotel attempted to charge me $70 when my travel plans changed and I needed to check out a day earlier. I was not aware of this and was also told by the staff the night before that this would not be an issue. Ultimately, the fee was waved. My stay was okay, but I expected more from the Coast name. Though I did only pay $149/night with conference rate, this hotel costs much more, therefore I would expect more from it. The location was great being very close to downtown, English Bay, and Stanley Park. However, the price for what you get is a bit expensive.", "Date": "October 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Would have been perfect if it wasn't for bed bugs!”", "Author": "jessicat783", "ReviewID": "UR118938411", "Content": "This hotel had the perfect location! It was within walking distance to the coast (hence the name Coat Plaza) and many yummy restaurants. The hotel was dated, but comfortable and spacious. We were really happy with our one night weekend getaway until I got home and noticed that I was covered in bite marks. Considering we were pretty bundled up while we were outside and the location of the bites (all on the lower half of my body - feet, legs, stomach) I have to believe the only place I could have been bitten was sleeping under the covers at the hotel. It really was a great, affordable place, but I am so disappointed that maybe things weren't cleaned as well as they should have been.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tsawwassen, Canada", "Title": "“Nice hotel, great location”", "Author": "g2fly", "ReviewID": "UR118870704", "Content": "We booked our hotel through expedia and were happy with the rate we got (we found out later that if you find a better deal than the hotel offers, they will beat the price). We arrived on a busy night even though it was mid-week (Kings of Leon concert night), but even so the service was fast and very friendly. We were upgraded free of charge to a suite and given a voucher for $25.00 off at the restaurant (so we had a lovely breakfast for next to nothing the next morning). The hotel was attractive and clean, I don't personally care much about the age of the decor (hate the reno industry) as long as the hotel is well-maintained and in very good repair and the Coast Plaza is. Our suite had a sitting area with an attractive view, a kitchen and dining area and a separate bedroom. The bed was moderately comfortable but the street noise made sleeping a little difficult. Ear plugs might be a good idea. We didn't have the time to use the spa facilities. They were pricey but supposedly excellent. The location of the hotel is perfect for anyone who wants to enjoy the west end of Vancouver - walking distance to the clubs and restaurants. We will stay here again.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent”", "Author": "Chilled66", "ReviewID": "UR118816832", "Content": "Stayed for 7 nights at the Coast Plaza, first impressions were it was a little dated but we were (without request) upgraded to a suite with complementary breakfast which saved us a fortune over the 7 nights stay. Looking at some comments and photos I think we definately got one of the better rooms as it was spacious with a kitchen and seperate lounge area. We were on the 25th floor so had great views of Vancouver and were really pleased with the location, just a short walk away from the beautiful Stanley Park and busy Denman Street. Ok so you could hear the generator and we were right next to the elevator but as we only used the room for a base we weren't too bothered by it. Staff were more than helpful and polite. Would recommend this hotel.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "St. Albert, Alberta", "Title": "“Tired Hotel in a Beautiful Setting”", "Author": "RAL46", "ReviewID": "UR118718474", "Content": "The Coast Plaza is frequently referred to as the Coast at Stanley Park. This high rise hotel has a distant and obstructed view of Vancouver's world famous park, but it is actually closer to English Bay and the cafe culture of Denman and Davie Streets. The hotel was built in 1969 as the Denman Street Inn, and includes a small shopping centre and cinema at the street level. In the past 42 years, it has changed hands and brands twice, and has been part of the reputable Coast chain for over twenty years. Large signs in the lobby proclaim its history and outline some multi-million dollar upgrades that are forthcoming (and, in many areas, badly needed). My wife and I arrived at the Coast at the four o'clock check-in time, but were informed that the room was not yet ready (fortunately, we were permitted to park in the underground parkade). We walked around the area, enjoyed the sunshine, ocean views, and crowds at English Bay, and returned at least twice to be informed that the room wasn't quite ready yet. When it finally was, we were given two drink vouchers to reward us for our patience. The room was on the twenty-sixth floor, overlooking the park, bay, and many high rise apartments and condos. Our first impression was not good: two double beds rather than the queen-size we were expecting. However, when we checked our (on-line) reservation details, it did in fact say \"Superior Room 2 doubles or 1 Queen\". Seeing as how we had waited so long to finally get our room, we chose to put up with it. The room itself was just okay--older carpet, spreads, etc., but clean and in good repair. A free-standing air conditioner was wedged inbetween the curtains and what turned out to be my bed. Considering the hotel was rather old, we assumed this was an afterthought, and at night, it was a toss up between the noise of the conditioner and the traffic noise (even on the 26th floor!) if we opened the patio doors. A large but empty-of-seats balcony was an unusual feature (although not a surprise as we had stayed at this hotel some years ago). The bathroom was a mixture of figure colors (dusty rose toilet) and styles, but functional. We didn't eat in the large, bright restuarant, but it looked fine, and the prices were reasonable. The pub (Comox Street Long Bar) was bright and roomy: we enjoyed great nachos and our free drinks as we watched our beloved football team (Edmonton Eskimos) on one of the many TVs. The English Bay area is a great place to enjoy the west end of downtown Vancouver: lots of interesting and diverse cafes, bars, shops, etc. The Coast, as the anchor hotel, is an okay place to stay, with friendly, accomodating staff, but hopefully, upgrades will actually happen. Hotel check-out was fine, although we thought the parking, at $25 a day (even for hotel guests), was steep.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Victoria, Canada", "Title": "“Loved the location, needs updating”", "Author": "bellasnow", "ReviewID": "UR118447814", "Content": "Really liked the located in the west end, so many stores and amenities are right around the corner. The one bedroom suite was very spacious. We asked for a room with a view but they said we'd have to pay extra for that? I guess I should have said a room on a higher floor since they put us on the first floor... with no view at all except facing the hotel generator? Not sure if it was a generator but it made noise. Room was nice and spacious, but I found it to be very dark (even though it was sunny outside) Kitchen lights didn't work at all. There were no regular lights in the bedroom either, except for the table lamp. I read many reviews prior that the rooms need updating so I knew what to expect! Overall a decent hotel to stay in if you get a good deal on a room. Disappointed we couldn't get any room higher up though.", "Date": "September 22, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Manchester", "Title": "“Do stay here”", "Author": "LostInSpaceMan", "ReviewID": "UR118063612", "Content": "This hotel is very convenient for the bars and restaurants on Gilford St. It's clean and the staff very helpful.", "Date": "September 13, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Bowen Island, Canada", "Title": "“A wonderful getaway”", "Author": "FrequentTravellerBC", "ReviewID": "UR118061780", "Content": "What a great location and facility. We were lucky enough to be upgraded to a beautiful suite with commanding view of English Bay beach whichnis only a block away. There has to be about 50 restaurants within a short stroll, a huge food store and drug store in the mall below the hotel itself. Stanley park is only a few blocks away! FREE wireless Internet too!", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great Location, A bit dated”", "Author": "Mr-Travel21", "ReviewID": "UR118005958", "Content": "I stayed here August 2009, as the last stop of my west coast road trip with three friends. The hotel is in a great locations, the room was a good size with a kitchenette, and a balcony. The hotel is dated tho, and the bedroom with the two beds are literally next to each other maybe a foot of space between them. Not impressed with it but besides that its a great locations, close to bars, shops, and the beach.", "Date": "September 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Rooms far too dated”", "Author": "Charlie_Anna_Jen", "ReviewID": "UR117710822", "Content": "Mixed feelings about this hotel. Location is good and staff were friendly. Parking was easy under hotel, although costs $25 plus tax per day. However, the problem was the rooms. We booked a 1 bed suite which was large but was like stepping back into the 70s (including the kitchen). Keen to spend as little time as possible in there. Also booked room with sea view but really looked into other flats (and the balcony is pretty horrible). Also room by lift which was pretty noisy, but not a major problem. The whole hotel needs a makeover, but particularly the rooms.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Bellmore, New York", "Title": "“Great stop before the cruise.”", "Author": "stacy81598", "ReviewID": "UR117708194", "Content": "We stayed here with two families (2 rooms- 4 adults and three kids) in August before leaving on our cruise to Alaska. This is an older property, but it was clean, and the rooms are huge with a seperate bedroom and kitchen. The view from our side was amazing. The restaurant was excellent and the kids loved the indoor pool (the hot tub was out of order). The staff was excellent and quick.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Needham, Massachusetts", "Title": "“Great Hotel!”", "Author": "lisaj2020", "ReviewID": "UR117631494", "Content": "We have only good things to say about our experience in Vancouver. Our one bedroom suite was very spacious for our family of four and well-priced since we stayed for 7 days. We were truly and happily surprised by the attentiveness of the front desk and concierge. Any request we had was handled promptly and in a friendly manner. Location on English Bay is absolutely fanrtastic! We loved the quick walk down to the beach and all the cute restaurants and quick lunch places on Denman street. Also, the supermarket and pharmacy located in the adjacent mall could be accessed via the hotel elevator which was very convenient. Overall, an excellent stay and highly recommended!", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "2.0", "Value": "1", "Service": "3"}, "AuthorLocation": "los angeles", "Title": "“Outdated hotel, poor value for the money”", "Author": "mayasl", "ReviewID": "UR117560636", "Content": "The hotel was well located and the suites are spacious. However, the room we were given overlooked a construction site where work started every morning at 7 AM. Everything in the room was outdates, old and falling apart. The closet doors in the bedroom could not open much because they hit the bed. The fridge was falling apart (e.g. when the fruit drawer finally budged it fell out). I would have accepted all this if the (special Expedia) rate we were charged were not $280 a night! For that rate I expect something much better. The quality, in fact, was that of a low priced motel.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "boston", "Title": "“felt like i was part of a neighborhood”", "Author": "billwestroxbury", "ReviewID": "UR117230336", "Content": "Wonderful room and facilities, exceptionally helpful staff and perfect relaxing location. Literally steps to great neighborhood restuarants (went to Cosca twice), a block or two to the water and to Stanley park, and a 7 minute bus ride to shopping and the central downtown (this is also only a 7-8 block interesting walk.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Solid hotel in a Great Location”", "Author": "mchekaluk", "ReviewID": "UR117110751", "Content": "Just off Denman near English Bay. Slightly dated but well maintained and no complaints from me. Big, fairly comfortable rooms. Room service is good and they don't rip you off like other hotels. I've stayed here a number of times and I love the location. The draw is Denman and Davies. Lots of food choices, and English Bay beach/park is right there. Perfect place for a romantic night or weekend away, highly recommended.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Boise, Idaho", "Title": "“They tried but failed”", "Author": "Dana P", "ReviewID": "UR117103318", "Content": "When we arrived at the hotel I asked for a lower floor they gave us a room when you looked over the balcony you saw the heating and cooling system for the hotel and by the way our room did not have central heat and air we had a small air conditioning unit in the front room of the suite that looked like a portable unit and we had to open up the sliding glass door to cool the room and the bedroom came equiped with a electric fan that you would have on a table top and plug in. with the door open it was so loud because of the hotel fans we could not hear the tv or each other the beds were marginal but the room was clean and we appreciated the kitchenette.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Seattle, WA", "Title": "“Dated, but solid”", "Author": "familyprince", "ReviewID": "UR116958897", "Content": "This is my second stay in this hotel, the other being seven years ago. First, the location cannot be beat, on the West side near the water and not far from Stanley Park. The front desk people are very nice and efficient, not the greatest, but very good. The parking garage in under the hotel and is a little pricy, mine was picked up by work, but factor in about $20 per day. Easy access to the hotel from the parking garage. The first level of the hotel is retail and includes a grocery store and a drug store. The grocery store is not very good and over priced, but nice to have access to. The rest of the retail is not very useful. Room is dated, older rugs (pulling up some at the seams) and air conditioning units are portable and only cools the living area. The bedroom has a fan, which worked fine but is strange for a hotel. All room have a small kitchen, which is nice to make some breakfast and a night time snack. Bathroom is nicely sized and clean, nothing special, just solid. Be careful to not get a room anywhere near the elevators if you get a middle floors room. They are very active and noisy at night and some of our work party had issues. I was on the 27th floor and although I noticed the sound, they rarely came up that high so I was not bothered. On the lobby level is two restaurants, one is a pub with a very limited eating menu and the other is a full service eatery that is, IMHO, overpriced for the food and service. Better off going into the neighborhood which has an endless supply of food and drink. Even a liquor store less than a block away. Overall, a solid hotel in a nice area of town. If you get a good price, this place is worth a stay.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Qualicum Beach, BC", "Title": "“Warm Welcoming & Exceptional Service”", "Author": "Gema28", "ReviewID": "UR116832417", "Content": "From the moment I arrived, to the day I checked out of this hotel, all the employee's were so warm welcoming and helpful. This really is \"service with a smile\". Very friendly, clean, well managed and great location. Shannon at the front desk checked me in efficiently and was so pleasant & professional to interact with. Janet in the restaurant was equally cheerful and efficient. The housekeeping staff were really attentive and polite...and kindly came each evening with cold water and chocolates...such a nice personal touch. The location of this hotel is the icing on the cake. Wonderful ocean views from the rooms (stunning sunsets!!) and a couple of minutes walk to the sandy beach, shops and restaurants. It is a great \"home away from home\"!! Thank you!!", "Date": "August 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great stay with kids”", "Author": "Kathini", "ReviewID": "UR116684117", "Content": "The staff were fantastic at making my kids feel welcome at the hotel. They were given stuffies and colouring books when we checked in, and the man at the front desk recommended where to eat that would be appropriate for kids. The crib they brought in for my 22 month old was good, but the foam mattress was very thin and split open along the side. I ended up just wrapping it in a blanket. Parking was expensive at $25 for 24 hrs, but it was really safe and secure.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Redmond, Washington", "Title": "“Great Location. Great View of the Fireworks”", "Author": "joggerbill", "ReviewID": "UR116569248", "Content": "My buddies and I stayed here after a 2-day bike ride from Seattle that ended in the hotel parking garage. The staff was helpful in correcting an error made with our reservation. Our room was clean and spacious with a great view of the fireworks celebration in the harbor. The beds were comfortable. There were ample toiletries and plenty of towels. There are many restaurants in the area and two Starbucks within waking distance. The housekeeping staff provided extra chairs to us for viewing the fireworks. I think the rooms were a bit overpriced but it was worth it for the convenience of being able to take the elevator to our room rather than transporting our luggage blocks to another hotel.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Ontario", "Title": "“Run Down and Out of the Way!”", "Author": "Maple1981", "ReviewID": "UR116169287", "Content": "I stayed for 3 nights while attending a conference at the hotel. My first impression of the exterior was old and was dingy. It was also off the beaten path (about a 15 minute walk to the centre (Robson and Burrard) and the same to Granville island - although the walk along the water and beaches was very nice. The room decor was very dated and old looking. The beds had bedspreads and old sheets and blankets. In fact the light yellow/beige sheets had holes in them. Any hotel that charges over $200.00/night should have nice white sheets and duvets! Please...no dirty bedspreads! The staff offered to give me extra sheets to stay warm because I told them I would not use the bedspreads. To my surprise, the gentleman at the desk said \"I would not use them either\". I've stayed at the Sheraton and Hyatt for less and they were awesome. I would not stay here again - unless you want to be in the west end and don't mind an old dingy hotel with bedspreads and worn sheets!", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“We enjoyed it and we'll be back!”", "Author": "rachelkurt", "ReviewID": "UR115982443", "Content": "Our suite was spacious, had a full kitchen and a wonderful view on English Bay and the Ocean! Linda and Vince were instrumental in ensuring we enjoyed our stay and were assigned a suite that matched our needs. Thanks to the whole team! Rachel", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "London", "Title": "“Pleasant hotel, helpful staff but needs a refurb and location could be an issue”", "Author": "ayresee", "ReviewID": "UR115953354", "Content": "We stayed here for a week in 2 blocks during our holiday and on both occassions got upgraded as there were 3 of us, we also got free breakfast which I'm not sure is standard or from the upgrade but this made a difference financially. They also give everyone 30% off the food bill in their restaurant which has good standar fare if you dont fancy venturing very far. All the staff we dealt with were very pleasant and were happy to go that extra mile. The pool is in the basement but is a decent size. The only downsides are the whole hotel seems a bit dated although there seems to be a refurb in the pipeline and its location may be an issue as whilst very good for Stanley Park and English Bay is a bit of a walk/short bus ride to downtown.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lewisville, Texas", "Title": "“There cannot be a better value in Vancouver!”", "Author": "terryl0we", "ReviewID": "UR115827282", "Content": "Although my room was not available until the afternoon, the wonderful staff \"pre-registered\" me, and the concierge relieved me of my bags. Once in the room I was very pleased with the essential comforts...but, the view was truly amazing! I was in room 3105 and had a full 180 view of the city! I too noticed that some updates within the hotel will be a welcome...but, for this seasoned traveler...there is no better value in Vancouver!", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0"}, "AuthorLocation": "Philadelphia, PA", "Title": "“Great location”", "Author": "lyau394", "ReviewID": "UR115426100", "Content": "Front desk staff was very friendly. I had a suite on the 17th floor with a great view and jacuzzi tub. The location was close to many restaurants and Stanley Park. Only a 20 minute walk to the convention center. Will definitely return!", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Vancouver, British Columbia, Canada", "Title": "“Large rooms, but needs an update”", "Author": "bbon98", "ReviewID": "UR115369006", "Content": "We booked this room because it's in a great location, close to many great restaurants and interesting shops. Our first room was quite large with a kitchenette. It felt as if we were thrown back into another decade. The bed was comfortable. However, the noise from the elevators was too loud. The front desk was accomodating at request to be moved. The next room was even bigger, no kitchenette, but that was fine. The room was enormous, it had a cloak room, wet bar, and meeting table. This room was in need of an update as well. The sofas were very old and tired, the blankets were thread-bare and this bed was lumpy. I felt as if I had gone back to the 1980s. However it had an amazing view. Just beautiful, we spent most of our time on the balcony. Pros: Location, Cost, Friendly staff, huge rooms, and terrifice view Cons: Lumpy bed, very tired decor, thin blankets", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“Good value now, renovation pending”", "Author": "Edgy0416", "ReviewID": "UR114965374", "Content": "This hotel seems to be 1960s construction, with little renovation since (the concrete exterior is showing its age, the furniture is getting a little beat up, the toilet in my bathroom frequently took 2 flushes to clear completely, etc.). A major renovation is pending (allegedly underway, though I did not see any signs of it), and this should bring the hotel back up to the 3* level. Unfortunately, it will probably also raise the price to the lofty levels that are typical of Vancouver in the summer. In its current state, there is still a lot to like about the hotel. The staff was very helpful. The rooms were very clean. The area is very quiet (all I ever heard in my room was the nearby elevator). Also, the wireless is free ... but as slow as molasses (officially 1 MB/s.; that's a generous estimate) , in my experience. The hotel is located in a residential area near downtown ... S/F houses, high-rise apartments, many restaurants and shops along Denman St. (1 blk. away) and Davie St. (2 blks.). There is a neighborhood mall beneath the hotel, with a grocery store among other shops. Very much like Europe. There are refrigerators in the rooms, so you could buy food there and take it up to eat. It took me between 20 & 25 minutes to walk to the convention center at Canada Place (Google Maps says 25 min.). It is a pleasant walk with nice scenery. About the first half of the walk, down to Georgia St., is through a residential neighborhood, & the rest through the commercial center of downtown.", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Atlanta, GA USA", "Title": "“LARGE SIZE ROOM, BUT BADLY NEEDS UPDATING!!!”", "Author": "jainsea", "ReviewID": "UR114964065", "Content": "My two grown daughters, a son-in-law, my granddaughter and myself stayed here for 3 nights - June 19,20 & 21, 2011 - we were in room 2501. The three good things I can say about the hotel is that it is in a great location(!), it had a great view, and the room was large - a large living room with a sofa bed, a kitchen, a bathroom and another bedroom with 2 double beds. However, everything was badly in need of updating and very diplapitated looking. The bathroom tub had stains in it and the whole bathroom looked like it was done in the 1950's. One of my daughters and I each slept in a double bed in the bedroom, and we now believe that the beds had bed bugs. I felt like something was crawling on me and was itchy every night, and she developed a rash of little red bumps. The sheets were very old, not crisp and white, the bedspread was very worn and it looked like those TV commercials where the kid jumps on the bed and all that dust comes out in the air. There was a closet in the bedroom but you couldn't open the door of it all the way, as one of the beds was in the way and couldn't be moved because of the size of the room. This hotel really needs a drastic facelift as soon as possible !!!", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Good deal, tons of space”", "Author": "tropicaltravels6", "ReviewID": "UR114814471", "Content": "I booked this for one night on priceline, not knowing the hotel we'd get, just one downtown. My husband and I arrived very late from Tahiti and just spent the night here. We got a huge suite though, it was nice to have the space. They did not have kitchen things though, maybe you have to ask for them. We went out for a late snack as we were hungry. If you want anything in the area after 11pm, good luck most things are closed. But you can take a cab into the action. The front desk clerk was so nice and friendly at check in. She joked we had tans and must be coming back from somewhere. I hadn't noticed, but I guess compared to most people here who are pale, our slight tans were noticed! She said hi and good night to us as we came in and out of the lobby bringing our luggage up and the cart back down. I would stay here again, but now I live in Vancouver, it was only temporary before we found a place to live. The only thing I'd suggest is having something vegan available on the night room service menu. There was nothing for us so we had to leave to find something near by and it was scarce!", "Date": "June 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Saskatchewan", "Title": "“Great location, needs a renovation”", "Author": "Saskgal64", "ReviewID": "UR113934689", "Content": "We stayed here because of the location and because it had a pool. I was surprised at the rundown look of the room and the bedding, drapes, etc. for the price we paid. Because we used travel reward points, we didn't have much of an out-of-pocket charge, but pricey it was. The room was clean and comfortable and had a nice sized tv, but don't expect duvets and beautiful carpet. We enjoyed the location which was only a couple of blocks to the ocean and Denman Street is lined with restaurants, cafes and specialty food stores. We walked to Robson where all of the shopping seemed to be. It has underground parking as well, which was handy.", "Date": "June 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“The Best in Abbotsford by Far!!!!”", "Author": "CadAlec", "ReviewID": "UR113683993", "Content": "Ive stayed with many of the Hotels in Abbotsford and this is by far the best. The front desk staff are inviting, warm and quick to recall your name and any special requirements. I have an allergy that prevents me from staying in rooms cleaned with traditional cleaners and sprays. H/K always ensure my room is free of sprays and chemicals unlike other properties Ive stayed with where they simply say there were no chemicals used. The rooms are a good size and have a desk right in the room. I won't be staying anywhere else in Abbotsford again!!", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Kitchener, Canada", "Title": "“Decent hotel with great staff”", "Author": "lone_palm", "ReviewID": "UR113172095", "Content": "Stayed at this hotel in late May while working on a project that included meeting rooms in this hotel. A regular Vancouver visitor, I haven't stayed in this hotel in several years. The hotel has been going through some uprades, and I found the room to be large enough, clean and comfortable. The WiFi connection worked throughout the hotel wherever I was working, which was a plus. Very impressed with how pleasant, professional, and helpful the staff were - checking in and out, helping with luggage, and the banquet staff. The location was good and it has ample access to amenities. Only less positive comment would be the wait for, and speed of the elevators. Found that a bit disappointing, but overall a great stay and I will go back.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Albuquerque", "Title": "“Excellent location! Concierge A+ with recommendations and helpfulness.”", "Author": "momraven", "ReviewID": "UR112474376", "Content": "Hotel room came w/ a microwave and refrigerator. Many grocery stores in the area. Coffee that came w/ the room unusually good. The hotel staff made our stay memorable w/ its efficiency and graciousness! The hotel is at an excellent location--lots of great walking, stores, wonderful park, etc. We were extremely pleased with the hotel staff and location and would definitely stay there again!", "Date": "June 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“great experience”", "Author": "rusty3998", "ReviewID": "UR108877664", "Content": "I travel for business and choose to stay at the coast plaza on a regular basis. The accomadations are comfortable, location is incredible, clean rooms, friendly staff. Very much a home like atmoshpere and yet has all the ammeneties you could want.", "Date": "May 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“wonderful pet friendly property with warm personable and efficient staff”", "Author": "jskokan99", "ReviewID": "UR107281064", "Content": "You just can`t beat the location of this hotel..situated beside Stanley Park,English Bay allowed us to enjoy nature,fresh air and incredible views after a day of work. The West End is so interesting with great restaurants and it is such a safe place to enjoy a stroll. Its like a resort town within the city. The hotel is older but VERY CLEAN and very friendly. My room had a great new bed and new sliding doors onto the balconey.The hotel continues to improve and invest in their property. Our company will continue to make this property and location our first choice when attending Vancouver for business and pleasure.", "Date": "May 7, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Lame for marathon runners”", "Author": "MARandJWR", "ReviewID": "UR107038778", "Content": "We were in Vancouver for the marathon last weekend - this hotel was not awesome for us because they would not extend our checkout time from noon to 2pm. We'd asked in advance if this was possible and the person said that 'it should be no problem'. Well, it was a problem and there was no way around it. It's a nice hotel in a great location, but they were not so awesome when it came to helping us out with the marathon logistics - needless to say, it was stressful and we wished we'd stayed somewhere else. Also, no mini-bar, so no mini fridge to save snacks. Additionally, as an FYI, the only parking option with this hotel is valet.", "Date": "May 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Loved it!”", "Author": "kenbug", "ReviewID": "UR106379098", "Content": "We loved this hotel. We stayed in a 2 bedroom one and a half bath water view suite with a full kitchen (we reserved a one bedroom suite but were upgraded at no additional cost). The room was located on a corner of the building on the 32nd floor. It had two outdoor balconies with views of Stanley Park to the north and a sunset view of the water to the west. Both views were excellent. The suite itself had a large size living area. Positives: 1. 24 hour reasonably priced room service which included delivery bottles of alcohol. This was great for us because we wanted to make ourselves some mixed drinks but failed to bring along some Vodka. No problem, the room service menu included a large variety of alcohol, a simple phone call and 5 minutes later we were in business. We also ordered breakfast and a late night sandwich and both were excellent. 2. Free van service to downtown area. 3. Super friendly staff. Very nice, very responsive to our requests. 4. Underground on site parking. Check out time at noon, but we were allowed to continue to park until 6:00 p.m. at no additional charge. 5. Nice hotel location close to Stanley Park and beach area. Negatives: 1. Location is cab ride away from downtown area. Can take hotel provided free shuttle but times that this runs are limited. 2. Room furnishings are somewhat dated. Popcorn ceiling in room may bother some. Also, no wide screen flat panel TVs in our room. We did have 2 TVs but they were old square variety with smallish screen. This was no problem for us as we were not there to watch TV but this may bother some. Hotel also has an onsite lounge and restaurant. We didn't visit either but they look nice. Bottom line for us: Loved it! Excellent room views, awesome staff, and nice 24 hour room service menu made this one of our better hotel experiences.", "Date": "May 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Benfleet", "Title": "“Great hotel with superb staff”", "Author": "BenfleetFalklands", "ReviewID": "UR100154939", "Content": "We have been to the Coast Plaza every year for the past six or seven, twice on organised Thomas Cook tours and the rest of the time under our own steam. We have always found the hotel clean and comfortable with spacious rooms. The staff have always been friendly and attentive and nothing seems too much trouble for those working the concierge. The hotel is ideally located for English Bay, Granville Island and Stanley Park. My wife and I have come to regard the Coast Plaza as part of our Vancouver holiday. A good word, too, for the Long Bar which is attached to the hotel. It does some amazing food and drink deals during the week, such as 20 per cent off everything on (I think) every Thursday. The food is great and there's a deal on beer every night. There's live music at at weekends. The staff are great and, as mere tourists, we've always found the locals more than friendly. A great hotel.", "Date": "March 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "manitoba", "Title": "“Terrific long term stay”", "Author": "plap8", "ReviewID": "UR99719967", "Content": "My wife and I stayed for 30 days in Feb and early March at the Coast Hotel taking advantage of their long term stay program, which had, what we thought was an excellent rate for Vancouver. This was actually more than a home away from home experience. The staff couldn’t have been more friendly or helpful. Our one bedroom suite had a king sized bed, large living area and fully equipped kitchen. Our view overlooked Stanley Park and the mountains although we understand that the view on the other side of the hotel of downtown Vancouver is equally impressive. There were guest laundry facilities on the 26th floor as well as a pool, sauna and hot tub in the basement. Hotel guests also had use of the attached fitness centre next door. On the ground floor of the hotel complex was a No Frills grocery store, pharmacy and a discount movie theatre. Guests also received a 30 % discount in the hotel restaurant at night. The location of the hotel made it very conducive for walking. Stanley Park is just 2 blocks from the hotel and we walked the park and seawall often. The promenade along the marina at the north end of Denman Street had excellent views of the mountains and took us all the way to Canada Place. It is a 20 minute walk from the hotel to shopping at Pacific Centre in downtown Vancouver. When we didn’t feel like walking or if it was raining (which it did occasionally, it is Vancouver in winter after all) we took the bus. Transit service in Vancouver is excellent and a discount ticket package was available across the street at 7 Eleven. This location had an endless array of good affordable restaurants to choose from. As an example there are restaurants specializing in Japanese, Mexican, Thai, African, Italian, Greek, Ukrainian and Korean cuisine as well as pizza and burger places. We were seduced in dining out much more than we planned because of the great selection and competitive pricing. The hotel had a great Prime Rib buffet on the weekend and a delicious Indian buffet one night a week. We also enjoyed live music in the lounge one night. Our original intention was to get away from the cold in Manitoba but our stay at this hotel exceeded expectations.", "Date": "March 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Richmond, Canada", "Title": "“Fantastic location”", "Author": "KGill", "ReviewID": "UR99526014", "Content": "We stayed at the Coast Plaza Hotel for two nights in March 2011. We were looking for a hotel within walking distance of some of Vancouver's parks and restaurants, as we didn't want to bring a car. The Coast Hotel's location is ideal - the beaches of English Bay are minutes away, and the restaurants of Denmand and Robson streets are also within easy strolling distance. Buses that run downtown and to SkyTrain/Canada line are nearby, too. Perfect! The hotel rooms themselves are spacious, and we were happy to have a fridge and microwave. Things are a bit dated, but everything was clean and in working order (the TV reception was a bit fuzzy, though). Unfortunately, the wi-fi network's signal was weak and unusable in our room (1209), so we ended up at the Starbuck's around the corner when we needed to go online. We never saw nor heard anyone from the hotel staff after we checked in (which is a good thing), so no problems there. I'm puzzled by the 'milk and cookies' mentioned by a past reviewer, as I saw no sign of them during our visit. The drugstore and grocery store in the attached mall were convenient, as was the 7-11 across the street. This is a good hotel for people who plan to be out and about, and want to be near some of vancouver's highlights.", "Date": "March 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Premium Jacuzzi Room is fantastic - check their specials.”", "Author": "misssharon", "ReviewID": "UR99323725", "Content": "The Premium Jacuzzi Room is gorgeous for a romantic evening away. The jacuzzi is not just a jetted soaker tub like some places - it's a fully tiled area with a deep hot tub in your room that looks out on the city lights. The main area of the spacious room has a desk with two chairs, two sofa style chairs, a television that separates the jacuzzi area from the bed. The furniture and decor is older, but is classy and well-kept enough to not look out-dated. The king bed was very comfortable, with an assortment of pillows and night tables on each side. The closet is decent enough for hanging your wares on their wood hangers. The bathroom is a little small, but you'll be enjoying the jacuzzi anyway. The hotel provides standard toiletries (shampoo, shower gel, lotion) in larger pumps bottles for green practices, as well as smaller-sized service items for you to take with you. Breakfast was excellent. We ordered a Coast breakfast, as well as an Eggs Benedict (our voucher covered two Coast breakfasts but the only charge the additional $1 difference) plus coffee and OJ. It was excellent. The only downer was the morning we were leaving the maid knocked on our door well before check-out three separate times. It was a little annoying in the middle of breakfast, but we could have put out our privacy sign too. If she was wondering if we had already checked out, she should contact the front desk instead of bothering us so many times. But it probably an isolated incident, and wasn't a deterrent to the stay. We bought a Stay, Play and Gourmet package that included a $75 voucher for The Boathouse (excellent resto and walkable), free parking ($25/day normally), and free breakfasts ($30 value). The package costs an extra $50 more than the room so it may be worth seeing if there's one when you're staying here.", "Date": "March 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Felt like home”", "Author": "Delphin14", "ReviewID": "UR98392611", "Content": "I stayed recently at the Coast Plaza. I had stayed before once. Because I was going to be between homes for a few days, I had needed to find a hotel not only for myself but one that accepted cats and for some reason hotels don't always accept cats. The Coast does! My hotel suite was larger than my apartment! As much as I wanted to move, I almost wished I could just live at the hotel instead! I had a great view of the city and while I stayed there, I felt like it was not only like home but like a refuge from my concerns about work and moving, etc. Thank you so much!", "Date": "February 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“The staff are wonderful and so helpful. Its home away from home.”", "Author": "Jack1234504", "ReviewID": "UR97878833", "Content": "This hotel is in an excellent location, nice and close to lots of good eating places. You can grab food to go and go an sit down at English bay beach and enjoy the always good weather. Or take a stroll along the seawall to Stanley Park", "Date": "February 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kinsale, Ireland", "Title": "“Ah, it's good to be home.”", "Author": "advertisingjb43", "ReviewID": "UR97528465", "Content": "I liked my stay so much I came back. Then I extended my stay. It is a great location and the hotel staff are always helpful and friendly.", "Date": "February 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Location and staff”", "Author": "travelerbob_11", "ReviewID": "UR96972857", "Content": "I stay at the Coast a lot and find that the location is superb as it is just slightly off the downtown core--walking distance--and the West End is like a world unto itself. I have to also say that the staff are great and are always ready to help/suggest with anything you need. And I can bring my dog!", "Date": "February 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nanoose Bay, Canada", "Title": "“A true West Coast Experience”", "Author": "1tractorguy", "ReviewID": "UR96807448", "Content": "Just spend the weekend in Vancouver and loved this Hotel. The weather didn’t cooperate, but the great views from our room overlooking English Bay and North shore Mountains more than made up for that. We did most of our sightseeing …right from our room, which was really comfortable and made for a relaxing stay. Right in the heart of the Bay this Hotel location met all of our needs we didn’t even bother with the car the whole time. The Brasserie Restaurant had wonderful menu choices and the service was most attentive and really friendly. Great Pub too. Want to get to know life on the West Coast, start here!", "Date": "February 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chilliwack, Canada", "Title": "“Incredible Hotel! Incredible People!”", "Author": "jbeltrano", "ReviewID": "UR96747317", "Content": "Our home away from home! This hotel consistently delivers exceptional service, product and experience. The people are amazing and send my accolades to each everyone of them! Thank you for making us feel like we are at home. Joey & Kelly", "Date": "February 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Black Creek, Canada", "Title": "“Great Hotel”", "Author": "reidking", "ReviewID": "UR96618207", "Content": "Have stayed at the Coast Plaza many times and it is the very best hotel I have ever stayed at. I travel a lot across Canada and the U.S. and stay in hotels in every city. The Coast is , very simply, the best place I stay. The service is above and beyond. It is a lot like Disneyland it is \"the happiest place on earth\"", "Date": "February 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“I travel to Vancouver several times a year and I always stay here!”", "Author": "brianb44", "ReviewID": "UR96065006", "Content": "I travel to Vancouver at least 6 times a year and I always stay at the Coast. The service is prompt and friendly and the staff are all pleasant. Food in the restaurants is decent and the rooms are well appointed. The best feature of this hotel is the views of English Bay from the rooms, spectacular! Close to the beach and plenty of good restaurants within walking distance. Convenient to almost all locations in downtown Vancouver. Definitely a must stay location while in Vancouver.", "Date": "February 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Qualicum Beach, Canada", "Title": "“Wonderful weekend!”", "Author": "mahastings", "ReviewID": "UR94491982", "Content": "Enjoyed a very comfortable 2 bedroom suite that was vey large. Was great to have a fully eguiped kitchen so we did not have to eat out all the time.Having a grocery store right at hotel was a bonus as we just had to go downstairs to get what we wanted. Living room was large so entertaining was comfortable and the veiws from all rooms was amazing. We were there for a family birthday and found everything to our satisfaction and can't wait to visit again.", "Date": "January 26, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Seattle, Washington", "Title": "“All Around Bad”", "Author": "YanksFan83", "ReviewID": "UR90641396", "Content": "My wife and I went to Vancouver with another couple. We decided to grab two rooms on Priceline and opted to focus on trying to get the Coast Plaza Suits since it was reasonable and \"downtown.\" Well, the price was OK at like $65 after tax, but the hotel was terrible. Location is poor. Far from everything but the overrated Stanley Park. The customer service was worse. Unhelpful and in their own worlds, numerous people behind the desk were clueless about a mistake Priceline made (they double charged), currency exchange, and parking. The concierge, however, was very nice and helpful. The rooms are huge, but there was hair on our shower wall, the coffee was terrible, and the beds were not comfortable. Oh, it was winter and very cold and the heat didn't work unless you could put up with a terrible buzzing sound coming from the temperate control. Overall, I wouldn't stay at this place for free with so many other options in the city. This is my second Coast Hotel, and both were equally bad. Never again!", "Date": "December 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Victoria, Canada", "Title": "“Great location but could use some sound proofing.”", "Author": "KLEwing", "ReviewID": "UR90415149", "Content": "My husband and I stayed here for our birthday weekend. We wanted something near Stanley Park but not too far from the downtown core. Also, we got a good rate (less that $150 per night) at this place. The hotel is located in a residential area about 5 blocks from the entrance to Stanley Park. Its also about 4 blocks to English Bay (?) which has a beach and boardwalk. It is part of a larger complex with a movie theater, grocery store, and drug store on the ground floor. There are tons of restaurants and cafes right there. We stayed two nights in a 2 bedroom corner suite on the 29th floor. The views were amazing and the room was great, although a little dated. It had 1 3/4 bathrooms, a living room, 2 bedrooms, 2 balconies, a full kitchen (stove/oven, microwave, dishes, dish washer, a full sized fridge), and a large living room. The couch in the living room pulled out into a bed. Drawbacks: We are pretty sure we heard the people above us using the bathroom. Icky! I thought $25 per night for parking was a little steep. We ordered breakfast from room service which wasn't too expensive, but wasn't very good. Even though everything else in the kitchen is full sized, the coffee pot was a little 4 cup'er. Also, the swimming pool is in the basement/parking garage. We didn't use it. It should be noted that the owners of the property have applied to turn the hotel rooms into rental apartments and the conference rooms into office space. So, who knows how long it will remain a hotel.", "Date": "December 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "5.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Staff is amazing”", "Author": "debcanada23", "ReviewID": "UR86993168", "Content": "My family and I stayed here for a few days and I must say I had a pleasant experience. There was constructions going on so that was the only downfall. Front desk staff for the most part were great, I dealt mostly with Dan and he was extremely helpful and went above and behind to ensure we had a pleasant stay. Also the bell staff were tremendous as they recommended some great restaurants! We will be coming back mostly because of the great location and first class service.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "British Columbia", "Title": "“Great location & views. Needs updating.”", "Author": "savarygal", "ReviewID": "UR86290862", "Content": "When we travel to the lower mainland, we stay at the Coast in Tsawwassen, however, my parents live near the Coast Plaza and we thought we'd give this hotel a try. With recommendation from Reservations, we booked in a 1 bedroom suite with my Coast Rewards and were looking forward to staying at the hotel due to it having a separate bedroom with a king sized bed. Our 4 year old daughter sleeps with us while we travel and it's nice if we can have a separate bedroom after she's gone to bed. To sum up: We will never stay at this hotel again and will book at the Coast Tsawwassen Inn in the future. Saving grace for this stay was the service staff who were exceptional and the front desk staff very courteous and accommodating. They quickly reversed the parking ticket we received (we weren't supposed to be ticketed for a paid spot!). Parking was okay and be mindful if you need assistance with stairs as there is a set of stairs down to the hotel level after you've parked your car. Not an issue for us, but I am cognizant of accessibility issues and tend to notice these things. Parking is expensive (again, another plus for the Coast Tsawwassen as it's free there) at $25.00 per day. Once we went into the room, I felt it was in desperate need of an upgrade, however, for the deal we got for the room ($119 per night), I was pleased with the space and layout. Kitchen was functional, if not a lot older in decor. The balcony was very nice to have, but when my 4 year old went outside, she found a large deposit of cigarette butts! ACK! When I went to go complain to the front desk (I do not normally fuss when I am in a hotel), I noticed the box spring on the mattress was HORRENDOUS. There was some kind of red stain on it and I was SO turned off. I realize it was likely a spilled glass of wine, but good grief... HIDE IT at least from view! We called the front desk and they moved us to another room immediately, which was very much the same as the previous one, however, clean balcony (and cleaner box spring). We were happy with how quiet it was from road noise and really enjoyed the city/water views from the balcony/windows. Then came night. My 4 year old and my husband will sleep through anything and I am usually pretty good, however, I could not sleep a wink in this room due to the noise from the elevator!!! Just as I'd drift off, that elevator would rumble and grind. It was not quiet in the slightest. I phoned the front desk around 2 AM after giving up trying to sleep and they apologized and explained that ALL the suites run beside the elevator shafts and that the elevator was particularly busy that night due to some teams checking in late. She did say that they'd get the elevator close to our room shut off for the rest of the night, but that it would resume at 6 AM. And it did. I managed about 3 hours sleep that night. Shame really, because the room was more than suitable. In the morning, the front desk moved us to a Jr. Suite that was removed from the elevator shaft and offered us to look at a 2 bedroom suite that was also removed from the elevators (thought all suites ran alongside the elevator???) and had a remarkable view from two balconies! Those two rooms were far more updated than the two we had been in. We settled on the Jr. Suite as the 2 bedroom would be much too much room for us. It was absolutely perfect and lovely. The beds were not that comfortable (two doubles, no king), but it was quiet. There wasn't a sep. bedroom, but the room was rather large with a sep. sitting area. The pool was nice and hot tub decent, however, we were totally grossed out by someone's leftover, rather awfully stained, underwear right by the stairs to the hot tub. One thing I didn't like was that we had to pay more money for the Jr. Suite; I felt the hotel should have absorbed that cost due to the fact that when I initially called to book the suite, I mentioned that it must be quiet and we didn't care if it was away from any views as long as we'd get a good night's rest. When I complained about the elevator noise, they said they'd had LOTS of complaints about that. Oh well, lessons learned. We won't be back there again - for us, the Tsawwassen Inn wins hands down in price, amenities, and quality of room. Worth it, even with the drive! Restaurant was exceptional. Food was more than delicious and proximity to the mall underground and popular Vancouver streets was excellent. I highly recommend eating breakfast at the restaurant or down the street at Milestones. Room service was good too and quick. I do not think I'd recommend this hotel and the only reason my rating will be higher than it should is because the service was great and the location superb. I would NEVER book this hotel at its full price and even with our half-off room rates deal, I still feel we paid more than we should have.", "Date": "November 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent, both in value and service”", "Author": "Yearlytraveller_10", "ReviewID": "UR85828241", "Content": "Stayed 5 nights at hotel. Found service extremely friendly and helpful. Comfort Room was spacious and clean and we appreciated the walk-out balcony. We used the concierge service several times and found this most informative and helpful. We had breakfast in The Brasserie every day and the food was exellent and good value. Waiting staff were very attentive. All in all, the hotel was great value for money, in a great location. We would definitely stay there again when visiting Vancouver.", "Date": "November 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Very disappointing! No 3.5 star”", "Author": "sspc", "ReviewID": "UR85456114", "Content": "The hotel needs a complete overall. The rooms have a smell, the tub and sink is left over from the 70s. The sheets are rough, the furniture needs replacing, etc. It's suppose to be a suite hotel, it is not. The room is slightly larger than normal, but still not a suite. The best thing about this hotel is the location, it's connected to a mall, and the neighborhood is good for walking. Avoid it.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "warrington", "Title": "“Very clean,fluffy towels and bath robes”", "Author": "Pauline077", "ReviewID": "UR83598462", "Content": "Just before leaving for our holiday I had another look at reviews and some of the more recent ones had me a little worried.On arrival very pleasent check in and we had been upgraded to a suite ,as it was our 30th Wedding Anniversary.as some other reviews stated , room needed redecorating,very 80's and rather dark.we were at the back and high up, so overlooked buildings but felt good as no other tall buildings near.Plenty of room,lounge/ small kitchen area/decent size bedroom/small bathroom.All nice and clean .They still hadn't quite finished replacing windows but didn't bother us as they were below us,just mean't balcony was very dusty and you couldn't go out during the day but as we were out, didn't bother us.Breakfast was good,continental but plenty of it,mostly nice staff.we stayed 3 nights and then returned for 1 more, a week later ,this time upgraded to Superior ,same sort of decor but this time we overlooked the harbour which was really nice.I would say don't worry ,it's clean , just rather old fashioned decor and a little dark .Just don't let that spoil your time there.", "Date": "October 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Excellent location, though needs upgrading”", "Author": "Olino", "ReviewID": "UR80712983", "Content": "We stayed in this hotel at the beginning and end of our round trip of Western Canada. The hotel is in an excellent location in the West End of Downtown Vancouver, a short walk from Stanley Park, the harbour or English Bay Beach. Staff were friendly and helpful. Currently, the hotel is in the process of replacing all windows which causes some noise, especially since work starts at 8am - though we were informed of this in advance. The furniture and bathroom fittingds are somewhat dated and require updating. Breakfast was included in our package, and was actually not bad, certainly a good start to the day. All in all a good compromise, because you can live with the downsides and have a great starting point for discovering this beautiful city. Ask for a room in one of the higher floors, as you'll enjoy a great view of either Downtown/harbour or the Bay...!", "Date": "September 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dudley, United Kingdom", "Title": "“Great Hotel, Staff and Location.”", "Author": "ST1951", "ReviewID": "UR79779762", "Content": "I stayed at this hotel for two nights in 2009 and booked to stay there again for eight nights in September 2010. I have just returned and, having read the review by tripped70 below I wonder if I stayed at the same hotel! There are two sides to every story and it would be interesting to have the hotel's version of the events he describes. I could not fault the hotel or the staff. From the moment I arrived everyone I encountered was most courteous and helpful. Firstly let's deal with the work taking place at the hotel. This was absolutely no problem at all. As it took place between 8.00 and 4.30 it did not disturb me. I usually got back to the hotel around 3.00 most days and never heard anything. The hotel is in a great location. It is only a stones throw from English Bay. Getting into the heart of downtown is not a problem in view of the frequent bus service. It was great to have a walk round the bay at night in view of the atmosphere. A lot of people seem to go there to chill out and watch the sunset. Wonderful! There is a good bar attached to the hotel and several others in the location. Most of the popular bars etc seem to be in Yaletown. Again, very easy to get to in view of the good bus service. I had a room on the 32nd floor. I am obsessed with getting a good nights sleep and I never heard a sound! The view over the City was magnificent. The receptionist apologised for not giving me a room overlooking English Bay. Frankly, I prefered the city view which, at night, was stunning. The room was large, clean and I cannot think of any issues worthy of comment. Other reviewers have mentioned the need for some renovation of the rooms. This was not a problem for me. There were two double beds and plenty of space for a sitting area. There was also a fridge and coffee making facilities. Large patio windows opened out onto a balcony. Unfortunately I never ventured on to it in view of my fear of heights! The complimentary Wi Fi was fine. The speed was always above 1Mb and I was able to Skype without any problem. There was no safe in the room but I was allocated a complimentary deposit box at reception. Getting access to it was not a problem. A continental breakfast was included in the price I paid for the room. Whilst there was also a full breakfast menu I found the continental breakfast to be perfectly adequeate. Cereal, cooked meats, cheeses, yoghurt, pastries etc plus the usual juices and coffee. Servers continually circulated with coffee refills. I had to queue for a table on a couple of days in view of a large party staying at the hotel who all seemed to want breakfast together. I only had to wait a few minutes for a table. Transferring from the airport was a doddle. I took the Canada Line to Yaletown Roundhouse and the C23 bus from outside the station to Bidwell St. It was only a short walk to the hotel. A lot cheaper than a taxi and probably as quick. The taxi may, however, be the better option if there are a couple of people with heavy cases. I had an excellent stay at the hotel and cannot think of anything adverse to comment on. I would certainly recommend it and, if I return to Vancouver, I will use it again.", "Date": "September 16, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "calgary", "Title": "“Absolute waste of my time and money.”", "Author": "tripped70", "ReviewID": "UR77573111", "Content": "I obtained this room through PriceLine. Arrived at hotel and was told that I could not park on the street without a residential permit; advised this by parking attendant. So, parked in underground parking ($27.00 a night). Took bags upstairs to register. Asked front desk clerk if they would comp me the parking fee (normal request; rarely denied - in my experience). Clerk immediately went on the attack and assumed a haughty tone, \"What's the problem?\" she demanded. I told her there wasn't a problem, I was simply making a request. She then told me that \"everyone\" pays for parking and I should have parked on the street if I didn't want to pay for the parking. I advised her that I had been informed that I could not park on the street without a permit. She said that it was my \"choice\" to park downstairs so I would have to pay for the parking and it wasn't the hotel's garage so it wasn't their problem. I responded by telling her that if guests who \"choose\" to park there are doing so on the basis of being misinformed about the parking permit situation, the hotel should be very concerned. She then reluctantly, and rudely, agreed to comp my parking and made a big deal out of telling me very loudly what a great favour she was doing me. She then gave me a room key and told me there was \"some\" construction going on at the hotel. After some discussion she gave me keys to 02 rooms; one on the 9th floor, one on the 11th floor. I went to the 9th floor and found a room that smelled stale and that was located DIRECTLY ABOVE the construction site. So, I went to check out the room on the 11th floor. That room had a run down kitchen area attached and was above and adjacent to yet another construction area. So I went down to the front desk and asked for another room. She initally told me she had no other room, then when I challenged her and said, you have 33 floors of rooms and you don't have a SINGLE ROOM available that isn't above or beside the construction area? She finally gave in and called the concierge. Still, she refused to give me another key, instead, calling over the concierge to ESCORT me to a 3rd room and then, before I had even left the front desk area, she was on the phone with someone - speaking loudly and making sure all guests heard her comments - telling this person at the other end of the phone to CHECK THE ROOMS I had been in to make sure that they were \"still okay\". Really? Really? Like what would I have done in the less than 5 minutes I was gone? Destroyed the rooms? It seemed clear to me that her intent was to humilate me and embarrass me and punish me for asking for a decent room. I went to the room on the 10th floor which was marginally better than the one the 9th floor. Still, hair in the tub and sticky spill stains on the table and a TV a great distance from the bed. Toilet that ran almost all night (stopping spontaneously at about 4 a.m.). Horrible. Absolutely horrible. Unbelievable. Shameful. Shame on Coast Hotels and this site in particular. Have stayed in other Coast facilities and always with good customer service and quality rooms. This was a nightmare. If you pay more than $25.00 for a room at this dump, you have been ripped off. Enjoy the construction and the noise and the dust and the vibrations and the attitude.", "Date": "August 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Red Deer, Canada", "Title": "“Loved it”", "Author": "RedDeerian", "ReviewID": "UR77377431", "Content": "The room was a small apartment - approx. 900 square feet with two bedrooms, one and a half baths, and two large patios with glass doors. We loved the spaciousness and having a reasonably stocked kitchen (utensils & such, not food) came in handy often. The rooms are fabulous - if you appreciate early 90's decor - so if you're looking for something modern and posh this may not be the hotel for you. However, it was perfect for us travelling with a five year old. The room was kept clean and my husband was in love with the turn down service, who brought ice nightly. Also, the pool was good as was free wifi. The other notable about the rooms were the views. We were on the 29th floor and the views we had were amazing. In fact, we were able to watch the PNE Parade from our patio. Currently, they are working on the patios and windows so during the week we often had company on our patios but usually we were gone during the day, so no biggie. (One morning my husband was amazed to see a guy hanging by just a rope and tiny seat working on the patio beside us.) Also, The location was great, three blocks from the beach, a short walk to Stanley Park and Robson Street. We had a great vacation here and will definitely stay in this hotel again when in Vancouver. NOTE - The parkade located underneath the hotel has REALLY LOW clearances (6'1\"). If you drive a higher vehicle (we have a Ford Expedition) you may want to park in another lot they have on the other side (accessed off Nelson St). We got into the parkade really slowly and precariously but had issues getting out. It wasn't until we almost took out a pipe that the parking guy told us about the other lot.", "Date": "August 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Essex", "Title": "“A great stay in Vancouver”", "Author": "EssexTripster", "ReviewID": "UR72726261", "Content": "This hotel is located in the English Bay area, which is a very lively part of Vancouver. The Seawall walk begins just a few minutes from this hotel, so is ideally located close to Stanley Park. The reception was very modern and the staff were very welcoming and helpful. Our room was in need of an update as there was a lack of lighting, however the room was very large, spacious and clean. The swimming pool was a reasonable size and there was plenty of space and lounge areas in the hotel. There is also a garden outside with plenty of seating. Overall, we were pleased with our stay at this hotel.", "Date": "July 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Vlaardingen, netherlands", "Title": "“Coast Plaza Hotel Vancouver  We booked...”", "Author": "mafootje", "ReviewID": "UR72200392", "Content": "Coast Plaza Hotel Vancouver  We booked this hotel through priceline. Don't know if the low rate compared to the rate on THE hotel website had anything to do with it but the room location wasn't very good.  It was located on THE 8th floor right next to the roof filled with large airco units. They made noise during THE day and night. Rooms themself where large but outdated. THE beds where good but blankets need some replacement. Kitchen had a refrigerator with freezer and à microwave. Enough closet space available in THE room. There's no safe in THE room. Parking can be done underneath THE hotel but the fee is $25 per night. Location is great near THE waterfront and city center. Nice place for running along THE water and THE park. Roomrate is not good compared to quality of rooms", "Date": "July 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Yorkshire", "Title": "“Great location - dont let current renovations put you off”", "Author": "CathYorkshire", "ReviewID": "UR71392931", "Content": "We stayed for 9 nights in total - at beginning and end of a trip in 2 different rooms and found everything to be very good - views are fabulous. Breakfast service was swift.. Service was good - when maintenance needed to access our room to fix a fuse problem in a neighbouring room they compensated us with a bottle of wine - hardly necessary but a nice touch. Yes there is building work going on from 8-5 but as we were out all day this didnt matter.", "Date": "July 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Atlanta", "Title": "“Great Hotel and they fix problems”", "Author": "hardendorf", "ReviewID": "UR70355196", "Content": "I was set to stay here my last night in Vancouver. Aside from the construction work everything was fine. The neighborhood is wonderful couldn't have picked a better place for my last night. Then our air conditioning failed ( and this was during a heat wave and the hotel was a full capacity) they spent a good bit of time on it and did their best. Not being able to remedy the situation they paid for a cab to their airport location and covered the full cost. This worked out great since I was flying out the next morning. So I ended up having the best of both worlds a fun day in West End then being able to wake up near the airport with a free shuttle.", "Date": "July 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Great Hotel....Great Location!!!”", "Author": "choirgirlcalifornia", "ReviewID": "UR64324669", "Content": "This was our first time to Vancouver. I choose this hotel because the reviews were good from other \"trip advisor\" travelers. First, the location was not downtown. If you want that, don't stay there. Having said that, being located on the west end was great! The hotel is in a neighborhood surrounded by homes, stores and restaurants. We walked to get dinner and it was only a few blocks from the ocean and the \"hop-on-hop-off\" bus, which we like to take. The hotel was clean and the staff friendly and helpful. They have an \"office\" to use for a fee, but I asked if I could check my emails and they let me do it several times with no charge. Our room was very, very large. The beds were very comfortable, it was quiet and we had a great view. Every room has a great view. Before we left, we went up to the 39th floor to see the view. The conference room doors were locked, but some maintenance staff who walked in were kind enough to show us the view. What a treat it was!!! I say we would stay there again on our next visit!", "Date": "May 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "British Columbia", "Title": "“Large suites, easy access to everything...”", "Author": "Caro281", "ReviewID": "UR64240150", "Content": "I stayed here for work purposes. I didn't have a choice in regards to which hotel I would be staying at or what kind of room I would be booked into. I was pleasantly surprised at the roominess of the suite. My husband and daughter tagged along and my daughter loved the space to run around in. The hotel seems to be mid-renovations where the windows are being replaced (thank goodness b/c the sirens sound like they could be directly outside our window even 18 stories up), the carpet is newer, and some of the furniture also looked relatively new. The bathrooms are older but very clean so I can't really complain. The kitchen was large but was missing utensils. We had free internet, and the pool according to my family was good too. There are separate saunas in each locker room which was different and I got a chuckle out of the sign that said, \"Clothes must be worn at all times\" outside the sauna door. What I really liked about this hotel is that there is a tiny mall underneath the hotel that has a small no frills grocery store and a drugstore. I think this would be handy for anyone staying here wanting to cut costs. There are also lots of restaurants up and down the road in front of the hotel. One thing that I didn't care for was the sound of the elevators going up and down while in the bedroom. At first I thought it was a plane overhead but then realized it had to be the elevators since we were not near the airport and virtually stopped in the middle of the night. Lastly, the squirrels stealing nuts left out by I imagine the workers at the hotel was very entertaining while waiting for a taxi in the morning. Oh, I didn't use the gym myself but I checked it out. The gym is privately owned/run by someone other than the hotel but guests get free use of the gym. If I had time I would have loved to use it or take a class. If you like to work out while staying at a hotel I think this place would be perfect as it isn't your typical teeny weeny 'gym' with an old treadmill and a bike.", "Date": "May 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“GREAT Location, excellent value, walking distance to everything”", "Author": "mcqker", "ReviewID": "UR63559852", "Content": "Free wi-fi; great views, three blocks to the beach and the seawall walk, dozens of restaurants right on Denman Street, grocery store and drug store in the first floor of the building, adjacent gym open to hotel guests, full kitchen in our room, two tvs - one in the living room and one in the bedroom. Within walking distance of Stanley Park, Robson Street shopping, and downtown malls. Parking was $10-12 per night in the underground garage. Our only complaint was the noise in our room - the headboard of our bed was against the wall by the elevator shaft, so we heard the elevator every time it went past our floor. We tried to move rooms - the staff was very nice about it - but every one-bedroom suite is next to the elevator shaft. If you get a one-bedroom suite, try to request a high floor. Also, the windows are single-paned, so ambient street noise can be heard - not bad, but noticable - but while we were there, they were working on replacing windows on some floors, so it's possible that issue has been fixed.", "Date": "May 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Fantastic Location & Amazing Service”", "Author": "CupcakeFanatic999", "ReviewID": "UR62811892", "Content": "If you're visiting Vancouver for leisure, this hotel is the perfect base for your stay! It's located in the West End neighborhood, near Stanley Park. There are tons of restaurants and shops all around the hotel. The hotel itself features spacious rooms with lots of natural light and a view of the city. The hotel is attached to a small mall with a grocery store, gym, pharmacy, wine store, salon, and other services. We took advantage of the gym and hot tub. The staff was wonderful in accomodating our requests promptly and answering our questions about the city. The decor definitely has an outdated 1980's vibe, but it's purely cosmetic. The hotel seems to be making changes, as they were starting the replacement of all the windows in the tower. We explored the city for 3 days and decided the West End was the best neighborhood to be based out of for the duration of our stay.", "Date": "April 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calgary", "Title": "“Very Impressed!”", "Author": "brodyn97", "ReviewID": "UR60880333", "Content": "We are actually still here and because of the free internet, I am able to write this from the hotel. Not too many hotel's have complimentary wireless internet anymore. I've stayed at hotel's that charge up to $10 per day! So our trip is going beyond our expectations. We only ran into one bump so far and that had to do with the hotel needed to fix a power issue. They offered to put us up at a sister hotel for the weekend but instead we decided to rent a car for the weekend so we can make sure we are not here during the repairs. (They have to shut the power off while they are fixing the problem only during the day) They upgraded our room at their expense to make up for the issue and offered to pay the $23 parking for the rental. Which made me quite happy because we would have not needed the rental if it hadn't been for the power issue. Never the less, they have more then made up for it. The people at the front desk are beyond helpful and very friendly! I think this is far beyond a 3 1/2 star hotel. Other then the appliances are very outdated....but really...who goes on vacation with intenstions of cooking anything anyways? I'm more then happy to have a fridge and having a microwave for heating up leftovers is a bonus! Beds are very comfy and clean. Bathroom is good enough. Overall, very great! Oh, the location is perfect. Close enough to walk downtown if you are up for a nice 20 minute walk but very very close to the beach, Stanley Park or over to the water taxi's to go to Granville Island! Hope you enjoy! You must try Knight and Day Restaurant for breakfast and also accross the street is a little Greek restaurant called Maria's Taverna....best greek food I ever had!!!", "Date": "April 10, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Yuma, Arizona", "Title": "“Location and Quality”", "Author": "DZanovitch", "ReviewID": "UR59449846", "Content": "We were able to walk to the beach and to Stanley park no problem. WONDERFUL views, night and day. Will definately try to stay here again. This hotel is in the International district so you can find some good not too far away. Indoor pool simple yet ample room for swimming laps.", "Date": "March 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vancouver", "Title": "“What a gem”", "Author": "Washingtonwanderers", "ReviewID": "UR57879495", "Content": "Did not have the higest of expectations for our stay at this hotel as it is not a beautiful buidling, but the staff treated us exceptionally and the view was UNBELIEVABLE. I really did not know that there was a place in Vancouver that you could see False Creek, English Bay, and Coal Harbour. We had our dog and there is a great dog walking area a block from the property.", "Date": "March 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Albany, California", "Title": "“Great location; tired furnishings”", "Author": "embarkcdn", "ReviewID": "UR53734182", "Content": "I booked this hotel on a name your price website for what I consider a value hotel. The location is excellent with many restaurants and shops nearby; there are two Safeways, a Tim Horton's, and English Bay within walking distance. The most critical part of the hotel is the shabby furnishings. The hotel had several decades to refresh the rooms. I suspect most of the furnishing was from the early 80's. Here are other features: Parking is available for $23 CAD per day with in/out privileges. Wifi is free throughout the hotel but requires a passcode for each session.", "Date": "January 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Edmonton", "Title": "“Great hotel ina great neighborhood”", "Author": "Imbatman", "ReviewID": "UR50999001", "Content": "I had the opportunity to stay at the Vancouver Plaza back in October. I was in Vancouver on business and for the U2 concert. I have to say that the Plaza is great place to stay. The rooms are a little dated, but the service was excellent. I found the bellmen to be professional and hard working. My expectations were met. The hotel also has the added benefit of being in a great neighborhood with interested stores and restaurants. The view from the floor that I stayed on was stunning. I'd love to return.", "Date": "December 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "houston", "Title": "“Very outdated & smelly comforter”", "Author": "travel_addict_bb", "ReviewID": "UR50663987", "Content": "comforter smells really bad (like clothes left over night in washer). 15 to 20 minutes walk away from robson shopping district. very inconvience location for someone w/o car. I coughed the entire time while I'm in the room (very bad odor came from the bed sheets & comforter). Luckily only stayed two nights so I didn't bother to switch room. Very rude bell man. Limited light in the room. Dirty, smelly, & outdated room. Overall, find other places to stay if I return to Vancouver for vacation. Other than roomy. Nothing good about this hotel. Hotel parking for $19/night (CAD). Ridiculous, bad reception wireless. I could not log on the wireless network at all. If I did successfully logged on the wireless, it would logged off immediately.", "Date": "December 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Ottawa", "Title": "“Excellent Location. HUGE Room”", "Author": "HabsFan21", "ReviewID": "UR49178614", "Content": "I agree with everyone else, the decor is dated, but the rooms are HUGE! Great views, close to Stanley Park and English bay. Very Clean.", "Date": "November 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Alberta", "Title": "“excellent location”", "Author": "RockymtnsAlberta", "ReviewID": "UR48408431", "Content": "Booked this hotel thro' Priceline for $ 75 per night. Althought the furniture is somewhat dated, the location is excellent. Round the corner from shops and numerous restaurants and a 2 mins. walk to the Seawall. Staff were friendly.", "Date": "November 3, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "canada", "Title": "“Not impressed”", "Author": "CanadianTraveller911", "ReviewID": "UR45861064", "Content": "I found the hotel very dated, the room had a portable A/C, had a view of an alley. Tried to watch a movie and the movie box didnt work and the front desk couldnt help. Really not impressed at all. For the amount it costs there are much better places to stay in downtown van.", "Date": "October 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York", "Title": "“I'd Book Coast Plaza Hotel & Suites Any Place They Are”", "Author": "Dembies", "ReviewID": "UR45585550", "Content": "We received a warm welcome at the desk even though our ship came in early in the morning. We were given a high floor as I had requested. The suite was lovely--spaciaous, well-appointed (even to the Q-tips), had a great balcony and view, and was very comfortable. It was serviced well. The concierge helped us with our tours, maps, etc. On the last day we were both sick. When the housekeeper came to the door, I said we would pass, and she insisted that she at least stock us with additional coffee, tea, and accompaniments. The staff took a personal interest in guests. It was a great stay. This hotel is in a perfect location--3 blocks from Sunset Beach, and amid a plethora of great international restaurants and seafood houses. Terrific!", "Date": "October 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Prince George, BC, Canada", "Title": "“Excellent Location and great service”", "Author": "PG_Coach", "ReviewID": "UR41218884", "Content": "This is the second time that I have stayed at this hotel in the last 8 months and it is quickly becoming a favorite of mine. The rooms are not the best, but the beds are comfy and the rooms are very clean. If you are lucky enough you can get a room that has an awesome view of the ocean. The best part of this hotel is that you are incredibly close to the seawall and English Bay. If you run, this is awesome news. There are countless choices for food and shopping all within a 5 minute walk. The hotel does have a business centre which is nice for checking email and printing documents. The pool is nice. Very clean and well maintained. I will definitely stay here again for business.", "Date": "September 13, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "washington", "Title": "“Anniversary Blunder!”", "Author": "hollywashington", "ReviewID": "UR40052134", "Content": "I had reserved a suite with a jacuzzi tub for our anniversary evening. Not staying here before I had looked on their website and viewed the picture for the room we were to stay in. Unfortunately they had only one picture which was that of the tub. It was nicely remodeled with beautfiul tile and you could see the view from the picture. Wow were we suprised when we arrived. Everything was horribly outdated and looked unclean. The bathroom was so small you could barely move. The curtains and comforter were horribly ugly and looked like they haven't been changed since the 70s. The state of the furniture was used and old. I was very dissapointed as we had paid 300 dollars for this room. It was not lovely I would never recommend this for anyone else, regardless of the convenience of location. And with some of the amenities, they did have wi-fi which barely worked and was sporadic, the pool was on the very bottom floor and not pleasant, the parking was easily accessable but cost us 18 dollars a night which was way too expensive, and when we called for a bottle opener it took all night for them to get it right to send someone up for it. We almost had to go to the front desk to find one.", "Date": "September 7, 2009"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Rooms": "3", "Service": "3", "Location": "2"}, "AuthorLocation": "Horsham", "Title": "“Average hotel 2.5km from centre of Vancouver”", "Author": "red1stoney", "ReviewID": "UR37187059", "Content": "Once inside this hotel, it has most things that you need from a holiday hotel - bar, restaurant, free wi-fi, pool etc - the hotel rooms are somewhat old and dated. Whilst the hotel is situated within reasonable walking distance distance of the main centre of Vancouver (30 mins walk) and the False Creek area (15 mins walk), Denman Street is not somewhere that I would recommend single travellers being alone in at night.", "Date": "August 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Montreal", "Title": "“Nice place for 5 + 1”", "Author": "GMforever", "ReviewID": "UR35619691", "Content": "After leaving Victoria. we added one more kid to our group and headed by ferry to Vancouver. The Coast Plaza is very well located for family travel. Turn right on Denman and you are in Stanley Park. Turn left and you are on the English Bay beach. We even went swimming and slide in the Pacific, the weather was gorgeous. We had a large suite on the 33 rd floor: what a view!. Too bad we had to leave before the fireworks on Wednesdays. 2 rooms, a kitchen, a large living room, a small dining room. Plenty of space for the 6 of us. We had no problem with the portable AC. As mentionned in other posts, the decor, especially the kitchen, is dated but the place is very clean. The beds were not as confortable than in Victoria and there was a bit more noise ( from the street instead of the seagulls ) but we slept well . We had a few nice attentions: chocolates and a turn down service at night, gifts for the kids.I think you can also borrow rackets and stuff for the beach. The staff was very nice and helpful. Through the concierge, you can obtain rebate coupons for certain attractions. If you have kids, the Vancouver Aquarium is a must see and you can walk there from the hotel. Other fun places are Playland , the Science center and the Burnaby village ( you will need a car ) We used the kitchen every day. WiFi Internet is free and works well There is a parking and a pool. Also the hotel connects to a mall and there is another supermarket on Denman and Robson. The neighborhood is trendy with a tons of restaurants on Denman ( Malaysian, Mongolian BBQ, Sushi, Fish and Chips, Korean, French and so on ...) It is also a residential area which makes up for a nice vibe If you go, I recommend you to look at the hotel Web site, which offers different packages. Ours included 25$ a day food credit, free parking and gifts . We did not try the 2 restaurants at the hotel On a more personnal note, we appreciated that the Coast Plaza Hotel sponsors a young springboard diver from Vancouver, as two of my kids and myself are divers also", "Date": "July 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Excellent Hotel in the heart of west end Vancouver.”", "Author": "Globe_Trotter1991", "ReviewID": "UR34765332", "Content": "I stayed at the hotel for 2 weeks at the beginning of August 2008, as mentioned on a few of the other reviews it can be argued that the rooms could be considered slightly dated, however the rooms are extremely clean and well kept and the decor of the rooms can easily be looked over because of this. The hotel is in a magnificent location on Denman street near English Bay. This is one of the most trendy and happening places in vancouver and the restaurant scene just outside the hotels front door is very diverse, with cuisine from Greece, Malaysia and Canada available (I personally recommend the Raincity Grill.) The staff in the hotel are amazingly friendly and efficient, I arrived from the airport around 1pm, fully aware that check-in was not available until 3pm, the staff apologized for this and offered me free drinks in the hotel bar!! Throughout my trip I had assistance planning excursions to Victoria and Whistler and a bus to seattle which was organised swiflty and professionaly by the hotel concierge. I had the pleasure of staying in a superior suite which was the largest hotel room I have ever stayed in. Although I didn't use the kitchen it was well equipped and large, for hotel standards, and would be a huge advantage if anyone was considering self catering on their holiday. Adjacent to the Denman Place Mall, it is easy enough to have a quick trip to the supermarket or pharmacy to get anything you may need All in all this was a fantastic hotel in a fantastic location in vancouver, I would recommend this hotel to anyone.", "Date": "July 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“The Best Hotel in Vancouver”", "Author": "harlan8", "ReviewID": "UR34497407", "Content": "I have been staying here since 2002. I love the location. Certain rooms have the best view in the town. There is a grocery store in the shopping center on the 1st floor (good when I was sick and went down for some soup), gym attached. I love Denman St. and English Bay. There are so many terrific ethnic restaurants and it is 2 blocks to the beach, English Bay and Stanley Park. So anytime of year, you walk out and are in a great , beautiful place, not like the downtown hotels. I love this place.", "Date": "July 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Excellent location and spacious rooms”", "Author": "travellersyarn", "ReviewID": "UR33970291", "Content": "We stayed at the Coast Plaza and Suites after flying from Hong Kong, and were pleasantly suprised by the size of the rooms in our 2 bedroom suite with kitchen. The kitchen was huge, and the living room had plenty of space for the kids to play. The staff at the Coast Plaza and Suited were helpful, and the location of the hotel is amazing, walking distance to the beach and Stanley Pqark, and with a supermarket and drug store downstairs. While the furnishings are not fancy, they were entireley suitable for a family travelling with small children. The room service was fast and the food was excellent.", "Date": "July 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "vancouver island", "Title": "“great location and great service”", "Author": "sherrywheeler", "ReviewID": "UR30460133", "Content": "I was in Vancouver for the Federal Liberal Convention and stayed at this well located coast hotel.It is in a charming neigbourhood and the service was friendly and efficient.We had a view of English Bay and the room was well appointed and maintained.We had a small refrigerator and the beds were very comfortable. I will stay here again on future trips to Vancouver.", "Date": "May 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Westside Village, CA", "Title": "“Excellant location, large rooms, views on most floors”", "Author": "HJG", "ReviewID": "UR30123534", "Content": "This hotel will do if your not looking for modern and find on discount web site. Just find 3.5 star on hot wire in Stanley Park area and you'll get this hotel. nice \"locals\" area. Walk to many 20 resturants in all price ranges within a couple of blocks. Live music @ hotel sports bar on Saturdays was better than expected. Easy inexpensive taxi ride most anywhere in downtown vancouver.", "Date": "May 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good position for Stanley Park, rather dated, but comfortable”", "Author": "Europamonkey", "ReviewID": "UR30116718", "Content": "The location is good for Stanley Park, a few blocks away, and for Robson St (the main shopping street). Granville Island and areas such as Yaletown, Gastown and Chinatown are perhaps up to 30 minutes walking distance. Check-in was quick, friendly and efficient, as was check-out. We had a Priceline deal (so a fully prepaid reservation) of $59 per night. The room was on the 14th floor, not very high up, but still with a good view from the balcony. It was spacious with double twin beds, but the decor was somewhat dated. The bathroom had a brown bath (white sink and toilet), and some chipped floor tiles. That said, the shower was fine, and the room was very clean. Room facilities included a fridge (no mini-bar), coffee maker, iron/ironing board, and TV. The pool was 46 ft long and appeared well kept although heavily chlorinated. The adjacent hot tub was rather small, but suitably hot. There was also a sauna in the changing room (not used, so can't comment). Free wi-fi was available in the room with a password from reception, and we had no problems with it. The lift descended below lobby level to the underground shopping mall with access from outside, and therefore security is a concern; the room key card was only required to access the lift after midnight. We had a comfortable stay for three nights, and have no complaints for the price we paid.", "Date": "May 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Vancouver BC", "Title": "“Great location & service but rooms need a make over”", "Author": "nikki_raven", "ReviewID": "UR29375948", "Content": "I once again rolled the dice with Hot wire and this came up. I was impressed with the location -so many restaurants and attractions (Stanley Park & Eng Bay) The lobby and staff were very professional. The room was very large with a separate area with a couch and . chair an table and it even had a kitchen. But it looked like it was from the 60's/70's and needed an upgrade. There was a business center open 24 hours which was just what i needed to print some very important paperwork . The elevators were quick and check out was fast . OOOOOh and free wireless internet !! YEAH!!! I was going to stay another night but the rates had almost tripled from what i paid with Hot wire . So off i went to an even NICER hotel (see other recent review )", "Date": "May 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Calgary", "Title": "“Great location in downtown Vancouver”", "Author": "Amy256", "ReviewID": "UR28174288", "Content": "My husband and I stayed at the Coast Plaza on Comox Street for one night; Friday. It was our first stay at this hotel and I found the location one block from Stanley Park and on English Bay excellent. Our room was 3004 very spacious with a seperate seat area with couch and chair. A proper table and chairs were available for dining had we brought something in along with a fridge and coffee station. The hotel is older but I found it very clean and everything in good working order. Went for a swim and enjoyed the pool. We had supper at the Bistro which was disappointing but with all the interesting restaurants in the imediate area there are lots of great options for all tastes.", "Date": "April 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bondi", "Title": "“Excellent value and location”", "Author": "Johnnysch", "ReviewID": "UR27607433", "Content": "Located in the English Bay area of central Vancouver, this hotel offers spacious, quiet rooms, some with kitchen, great views, Internet (check for cabled connection, the wireless does not work well everywhere) and parking (add.cost). I found the room service breakfast better than the hotel restaurant. And if you like a stroll in the morning, the walk along English Bay is a great way to start the day! Pool and spa are OK but heavily chlorinated.", "Date": "April 7, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Seattle, Washington", "Title": "“Good Value, Good Location, Clean and Solid.”", "Author": "mjgriffy", "ReviewID": "UR27406690", "Content": "I booked my room last minute through an engine where you don't know the hotel until you pay for it (you know which one I mean). A frequent visitor to Vancouver, I had never stayed here before and was completely pleased have paid less than seventy five USD. It is in the far west end of the West End, nearest to Stanley Park. Walking distance to Robson, Davie, the Park and waterfront, but a stretch to Granville, Yaletown, etc. Situated in a residential (condo/apt) area of the West End, it was particularly quiet and tranquil. Being a concrete and steel highrise, it was even more so quiet. The check in was fast, friendly and efficient. The room was large (500sft), and provided two queen beds, a kitchen, full bath, seating area, and walk-out balcony. All furnishing were solid and clean, but certainly dated. I don't mind the age, as long as it is clean and works. The free WiFi did not perform well. I perused the pictures of other guests on here, and my room was similar to everyone else's. All in all, a great value and good place especially if under seventy five bucks in winter, and one twenty five in summer.", "Date": "April 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Birmingham", "Title": "“Dated, but otherwise great”", "Author": "Ambidextrous91", "ReviewID": "UR25770816", "Content": "I stayed for 7 nights here with my fiancee and found this hotel added to our trip. The room we got was spacious and in fairly good condition if you accept the distrinctly dated decor. Hopefully they will start to do the rooms up soon. Other aspects of the hotel were excellent - service was always prompt, rooms were clean. Breakfast was a particular treat and is a real attraction of the hotel. The biggest let down was the pool, which is in the basement, and is really not at all special. The location is good for Stanley Park, however is a fair way from most businesses and shops. Overall though, a good base in Vancouver.", "Date": "March 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Nelson", "Title": "“Staff gave excellent customer service, the Rooms and Hotel are old feeling”", "Author": "Kootenaygirlz", "ReviewID": "UR25330161", "Content": "We ended up transferring from the seedy Airport Coast hotel to the Coast Plaza. The customer service was out standing; in light of our encounter at the seedy Airport Coast they gave us a discounted rate and paid for the taxi transport. The room service was fast and courteous; our food was prompt, fresh and always hot! The hotel is very dated, as are the rooms. There may have been renovation, but you could tell the hotel was still old. We did hear the elevators running all night… we will choose another room location next time. This is not by any means a five star hotel. But the location is great; close to down town.", "Date": "February 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "London, UK", "Title": "“Dated decor, quiet location”", "Author": "Maxing-n-Relaxing", "ReviewID": "UR24875174", "Content": "The Coast Plaza was originally built in 1969 as an apartment block (I looked this up after sitting in the room trying to date the furnishings). It shows in the size of the rooms, which are quite large - mine had 3 closets and a kitchen with a fridge and microwave. The decor was very dated, although it was in surprisingly good condition for its apparent age. The bathroom had dated beige ceramics and a basket of small hotel size toiletries but also four jumbo size dispensers of the same liquids, which gave a somewhat downmarket impression. The hotel was deserted when I arrived yet the doorman stood idly by, watching me unload three bags from my car. However, the hotel let me check in early at midday (normal check in time is 3pm) which was useful. The hotel is in a quieter part of downtown, in a residential area above a fairly low end shopping mall. Location wise it is close to English Bay and Stanley Park but further from the main shopping area and entertainment district. If I had paid full rate I would have been disappointed, but for the rate I paid I was satisfied - but nevertheless pleased to move out to the Holiday Inn.", "Date": "February 20, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Montreal, Canada", "Title": "“Rooms could some updating, but great location”", "Author": "TricotRo", "ReviewID": "UR21796270", "Content": "Clean and very central if you want easy access to one of the best areas in downtown that combines restaurant variety, beach and park access. The decor needs an update, especially bathrooms but if they were updated the hotel would probably charge a lot more considering its location. It is great value for the money. Has a gym access agreement with neighbouring private gym, so effectively has one of the best equipped gyms ever seen by my uncle, who is a regular business traveller.", "Date": "November 12, 2008"}, {"Ratings": {"Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "England", "Title": "“Great location”", "Author": "UpthecreekEngland", "ReviewID": "UR21069059", "Content": "Loved this place. It was perfect for our family wishing to sight see, go to the beach, shopping, cycling in Stanley Park, the harbour etc. Super staff especially at breakfast. Yes, the room was a little dated but very comfortable and excellent value. Would stay there again.", "Date": "October 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Nelson, New Zealand", "Title": "“Worth a stay with Kids”", "Author": "Macgirls", "ReviewID": "UR20542605", "Content": "Stayed for 4 nights. After reading other reviews had an idea of OK,a bit tired but in a good spot for Vancouver. This has not changed. Essentially it was comfortable, with large rooms. Its position is great for Stanley Park and downtown. We were able to hire bikes nearby and explore Vancouver under our own steam - this was great. We have 4 kids and it suited us especialy the swimming pool. As hotel pools go in inner cities this was a good one. My advice use it but be realistic about what you are going to get.", "Date": "October 1, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "3", "Rooms": "1", "Location": "2"}, "AuthorLocation": "San Francisco, CA", "Title": "“What A Dump!”", "Author": "jvptravels", "ReviewID": "UR20435366", "Content": "We stayed at the Coast Plaza Hotel on our recent vacation to British Columbia. The first leg of our trip was in Victoria and we were pleasantly surprised with another Coast hotel that we stayed at. But the Coast Plaza Hotel in Vancouver was much more than a disappointment. The front desk staff was unfriendly and rude. The 1-bedroom suite that we were given had 2 double beds instead of the king bed that we specifically requested. The room was extremly outdated, with blue carpeting throughout, a tiny bathroom with zero space for even a shaving kit. The \"full-sized\" kitchen was also a let down. The large living room area had a corner dining area with a wooden table that was 4' x 4', and barely a step-up from a card table. The floor air conditioning did not work in either the living room or bedroom. In the living room, a portable air conditioning unit had been placed in a corner. The large unit was way too loud to run even on a warm day like the one we had there. And the bedroom had a small oscillating fan place on the dresser, with no other air conditioning. Worst of all, there were flies all over the room. The staff refused to move us to a king suite - without flies when I called and voiced my concern. When I went to the desk to complain to the manager, they finally agreed to move us. The new room had a king bed and no flies, but it smelled like raid, and the rest of the outdated and sub-par furnishings listed above were the same in the new room. This hotel sucked, and the staff was equivallent to the rest of the place. This was the first time on any trip that we made extra efforts to stay away from the hotel, except to sleep and shower. We tried (through our travel agency) to transfer to another hotel, but all of the hotels in the city were booked. We were stuck in this dump for two nights. When I asked about the hotel shuttle that was advertised, they said that advance reservations were required and that all 4 shuttle departures were booked. When I complained about the flies to one of the managers, he told me, \"That's Vancouver. Flies are normal here.\" On the day of our check-out, we had six hours between our check-out time and the departure of our train to Seattle. I asked if we could have a 2pm or 3pm check-out and was told that the latest they could give me is 12:30 - a half hour past the posted check-out. So we ended up checking out of the dump at 8am and leaving our luggage with the concierge while we took a trolley tour of the town and saw the sights. I wouldn't recomment this miserable place for my worst enemy. If you are looking for a hotel in Vancouver, DO NOT consider the Coast Plaza Hotel and Suites, or you will be extremely disappointed.", "Date": "September 28, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "", "Title": "“Looking a bit dated, variable staff, quite pricey”", "Author": "Topoftheworldma", "ReviewID": "UR20338248", "Content": "I have stayed in this hotel a couple of times and always found it fine. The location is a bit quieter than the umpteen hotels on Robson and similar, as it's on the corner of a residential street. However, it's also above an underground (small) shopping mall with a food store, which can prove useful if like us you're traveling with a baby. Or there's a cinema next door, if you're not! The hotel's schtick seems to be that they have loads of grey squirrels (tree rats!) nearby, which are fed by the doorman and are actually quite cute. Last time I stayed it was twice in one 2 week trip, on the way out of and back into Vancouver. We got a lovely welcome back, the same 2 bed suite for the 3 of us, a plate of fruit and cookies - nice little touches. When we'd arrived on the outward journey the room wasn't ready so we were offered complimentary drinks while we waited in the bar or breakfast the following day (we took the breakfast, which was nice). The sports bar had great and cheap cocktails and we got absolutely ratted on our last night. All in all a very nice stay! This time was 6 years later, and the hotel is starting to show its age (as am I, I suspect, having acquired a husband and baby in the interim!). The rooms are a good size and the in-room amenities are fine, but nothing special. We had asked for a travel cot and were disappointed that they couldn't guarantee one - I actually found it quite stressful traveling for 20 hours not being sure there would be a cot for our 13 month-old baby at the end of the journey. And when we got there, the cot wasn't great - it was painted metal and looked like it wouldn't have been out of place in a Romanian mental health institution. Not terribly welcoming... The staff were variable - one (Canadian) concierge was fairly helpful, 1 very helpful, and the (English) doorman was a bit grumpy when we needed (politely asked-for) access to our car when a car-load of people were waiting to get into their limo. It's close to Stanley Park and therefore the ocean and the downtown pick-up places for Alamo and National car rentals (easy 15 min walk), which is also useful. The area feels quiet, laid-back and safe and there are various places to eat and drink within an easy 5 min walk. We had room service in the evening, which was actually pretty good and arrived quickly. Breakfast was fine, but not worth the high price - thank goodness we were still in UK price mode so weren't too fussed! We asked for a banana and a yoghurt for the baby, which ended up being more than 6 dollars - a bit steep. The waiter was nice, friendly and efficient and appropriately attentive to our needs. The hotel is OK, but needs updating, I suspect!", "Date": "September 24, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Glasgow Scotland", "Title": "“Very friendly staff”", "Author": "scou", "ReviewID": "UR19330214", "Content": "Just returned after a fantastic cruise to Alaska and finished off with 3 nights in this very friendly and well located hotel. Having arrived from our cruise ship at 8am we were very suprised to be given a room immediately by very attentive and courteous staff at reception. The view from our balcony overlooking Denman street was great from English beach to Grouse mountain.Definately recommended.", "Date": "August 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "wyoming", "Title": "“Great location, helpful, friendly staff”", "Author": "wannabw0rldtraveler", "ReviewID": "UR18967221", "Content": "Just got home this afternoon from a too short vacation in Vancouver. The first time we've been there and loved it! Coast Plaza was everything GOOD you'll read here. Staff friendly and helpful - we arrived at 10:30 am and were promptly checked in and upgraded to a suite even though we were only booked for a double room. Suite was large and clean - not fancy but very nice. Had a balcony and view of English Bay and Denman street. Housekeeping was prompt and thorough. Concierge helped us with several dinners and tours. Altogether a very pleasant hotel and wonderful location!", "Date": "August 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "charlottesville", "Title": "“Incredible view and location for a fine hotel”", "Author": "cvillediner", "ReviewID": "UR18827893", "Content": "I booked a suite for my family of five and found the rooms to be clean, spacious, tastefully decorated, and each with a balcony with a fabulous view. The price for a great suite on the 33rd floor was much less than I would pay for a crummy cramped room in NYC or Chicago. Every staff member was friendly and cheerful. The location was far better than I expected, just a block from numerous ethnic restaurants leading to the beautiful English bay beach, which was full of young couples, families, and senior citizens. The streets were clean and the cheerfulness of the people was contagious. Parking under the hotel was easy. Below the hotel was a mall with stores and a grocery. The only thing I found a little disappointing was that the indoor pool was devoid of sunlight and the whirlpool pretty lame. I left Vancouver wishing everyone in New York City, Chicago, and other large US cities could spend a week here and see what a really fine large city could be like. Friendly, clean, safe, beautiful.", "Date": "August 10, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Good location”", "Author": "JohannVienna", "ReviewID": "UR18277609", "Content": "The Coast Plaza is very well situated, very close to English Bay Beaches and just a walk of 10 min away of fashionable Robson Street and Downtown Vancouver. And of cause, Stanley Park is just one block away. The Hotel itself is allright: Service is good, our room was very spacious but desperately needs a makeover, although it was clean. We had a very good price owing to the fact that we booked with hotwire.com. Taking this into consideration it was a very good value. If you don't have a view from your room go to the guest laundry in the 26th floor...the view is terrific!", "Date": "July 26, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Great Family Hotel because of Location and Convenience.”", "Author": "HiHellowithKids", "ReviewID": "UR17038585", "Content": "We just returned from a family holiday in Vancouver with a 5 year old and twin babies. The major plus for this hotel is the location. There are no other hotels in this English Bay/Stanley park area that are in walking distance. There is the Sylvia, but we stayed there a few years ago, and the interior was brutal... The Coast is tidy, clean and albeit dated, it was a perfect base for our daily outings. At night, we were able to just go out with the babies in the stroller versus packing up the car and driving some where. This is the MAIN reason we selected this hotel. Having returned, we would book this hotel on our next stay because of it's inherent conveniences. Restaurants are everywhere on Denman street. The hotel elevator takes you directly to the mall level which has a Shoppers drug mart that opens 8am - 12pm, and a grocery store (Extra foods, like Loblaws, that opens 8am - 10pm). The rooms are reasonable large. We had a 1 bedroom premium room. There were some postings about the rooms having a musty odour, but no, there wasn't anything smelly. The reusable toiletries, are just in a pump and you can use them or use the single-use ones they have provided (probably because of the complaints). The kitchen is OK. Yes, the appliances are dated, vintage, 1980s or something, but we didn't really cook, just warmed things in the microwave and stored food/fruit in the fridge. The carpet was a bit dirty looking but OK again. The bathrooms were tidy, but dated. The linens were a beige colour and were clean but they were not the typical hotel crisp white. If you cannot handle a little dingy and maybe a little short-comings in the updated department, this hotel is not for you. If you want to have a hotel that is decent, tidy and a good location to actually do things in walking distance, then this is the hotel for you. I spent hours and hours researching hotels and really debated over the hotel, but fortunately for us, this hotel worked out. The other hotels I looked into would have been so inconvenient. In order for us to take our walks and strolls around town, we would have had to load the rental minivan up with everyone to do the same exact thing if we stayed at any of the other \"supposedly\" close hotels to this area. For babies in strollers - it was also nice to be able to go back to the hotel room if we forgot something. Hope that helps any families out there. We would definitely stay here again.", "Date": "June 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Loved Vancouver & enjoyed my stay at Coast Plaza”", "Author": "keithb789", "ReviewID": "UR16293306", "Content": "I enjoyed my stay at Coast Plaza, and would definitely stay there again. Yes, the hotel interior and rooms are a bit dated. And it wasn't \"luxurious\" by any means. The bed and linens were not of the highest quality. The shower worked well but the bathtub and tiles looked a little bit grimey. But I had a good time there. The good: - my room had a fridge, which was great for keeping beer/wine/snacks. - the view from my balcony on the 31st floor was awesome! A full panorama from English Bay to Coal Harbour, with the most excellent view of downtown. Only problem here was that there wasn't any furniture out there on the balcony, so I moved the desk chair out there! - I liked the bath and shower products. I forget what brand they were but the glycerin soap and regular soap were great. - I loved the location. Denman Street is nice with lots of eating options and shopping. Robson Street and Davie Street are a few blocks away, as are English Bay Beach and Stanley Park. - All the staff were friendly and helpful. - I liked having the Sav-On and Denman Wines downstairs in the mall off the lobby. - My room/floor was quiet, allowing for a good night's sleep. So all in all, the good outweighs the \"bad\". I had such a great time exploring Vancouver that I'll be back, and would consider staying at the Coast Plaza again, mostly because of the location and balcony view.", "Date": "May 21, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Edmonton, AB", "Title": "“OK, if the price is right.”", "Author": "Nevileon", "ReviewID": "UR15872282", "Content": "We stayed at this hotel courtesy of Hotwire at the discounted rate of $120 / night x 3 nights. Hotwire had rated this hotel at 3.5 stars. Upon check-in, we found the hotel to be quite busy. Apparently they get a large portion of their business from the nearby cruiselines. Check-in took approximately 10 minutes with a minimum of fuss. Parking is available at ~$18 / day. The hotel itself has a fairly decent lobby is situated just steps away from Robson Street (just a word of warning though - it's at the BOTTOM of the hill leading to most of Robson :P). The room we stayed in was on the 12th floor -- it had a decent view of the skyline and harbour. It also had a microwave, dishes, and a refridgerator. We found the decor and the linens to be quite dated and in need of replacement. We attempted to extend our stay to a fourth day, and were told fairly bluntly that the lowest rate possible at the hotel was $209 / night, almost double what we were paying. When we asked if we would have more luck on hotwire, we were told by the night manager that we probably wouldn't, since his hotel was very busy. That said, we tried anyway and rebooked on hotwire for $99 (actually LESS than what we paid originally). At times, we found the condition of the room to be somewhat unsettling. The maid had long black hair that we constantly found in the bathtub, on the bathroom floor and in the sink. That was exacerbated by the bathtub backing up during the first night of our stay. We should point out that this maintenance issue was dealt with promptly. We also found a used rag on our counter during the second night of our stay, and dirty pillow cases under the bed during the third night. Wireless internet is offered by the hotel, but is unfortunately unsecured (all one needs is a room number -- pick any number between 700 - 1900....). Because of that, the wireless network was congested and unusable. Luckily, the hotel does offer hardwired ethernet cables for use at no charge (but doesn't advertise that fact). In summary: If I were paying full price (200 / night) I would feel pretty choked. However, It has a great location (Stanley Park, Robson Street and city transit access). It certainly isn't the steal the $80 Hyatt was last winter =) but we felt that we got our money's worth (~130 - 150 / night including parking). Hope this helps somebody else make their Hotwire decision.", "Date": "May 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Golden Colorado", "Title": "“We stay at the Coast Plaza in Vancouver”", "Author": "GHHUGH", "ReviewID": "UR15718110", "Content": "We started vacationing in Canada in the 80's. Since that time we have gone to Canada at least once a year. In the beginning, we would stay a week at the Oak Bay Beach Hotel in Victoria and a week at the Westin Bayshore in Vancouver. In the early 90's we started looking around for an accommodation on the West Side of Vancouver that would offer a Suite with a full kitchen and a view of Stanley Park and English Bay. The Coast Plaza was our answer! We stay up as high as we can for a view of English Bay and Stanley Park. We love the idea that the Plaza has within it's complex a grocery store on the ground level which you can elevator down to without ever going through the Lobby and find those items that will keep you happy in your room with the view. There's Super Safeway a block over from Comox on Davies that has everything you would need for food needs. (Adjacent to Safeway is a Providence Liquor store.) The hotel can direct you to a Whole Grain Grocery store on Robson if your into more exotic fare. Our Suites have always had a super size King bed and television in the bedroom. A television, dining table and free computer hookup in the livingroom. The livingroom is large with a walk out balcony. Look on the Vancouver websites for dining and tours. But, please keep in mind that Vancouver is a very walkable city and public transportation is great. Tired of cooking don't want to eat out? Great room service menu. I've never seen on a room service menu Lamb Shank with all the trimmings for $19.00 and Bumble Berry pie Alamode. Wonderful! It's nice to be greeted by a hotel staff whom with with their smile and greeting say to you. \"welcome home.\" I've only written one other review for a property and that is the Molesworth Suites in Dublin, Ireland. Again, location, location, location and friendly ,'we remember you staff.' Gary & Judy Holbrook", "Date": "May 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Edmonton, Alberta", "Title": "“Quiet location, convenient to Stanley Park”", "Author": "oilerfan1980", "ReviewID": "UR15197683", "Content": "This was an average hotel... nice, quiet location but would have preferred a bit more bustling atmosphere, this was my fault in selecting the location however. Very nice staff, they were always helpful. Outdated decor, but clean. I wasn't in Vancouver to fuss about purpley pink bathtubs, however if this is your purpose in visiting the Lower Mainland...choose another hotel. The most recent time I stayed in Vancouver, I found a hotel more to my liking in a different area...but for next to Stanley Park, this is pretty decent.", "Date": "April 21, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Location": "5"}, "AuthorLocation": "Wauwatosa, WI", "Title": "“Not Bad - Best Location in Vancouver”", "Author": "gh5426", "ReviewID": "UR14898958", "Content": "Never having been to Vancouver before, I was nervous going to this hotel because of some of the reviews I had seen on this web site. This hotel is in arguably the best location in Vancouver. It's basically right on the beach, is walking distance to Stanley Park and the Aquarium, and, my personal favorite, the ferry to get to Granville Island which is a short walk to Kitsilano. After touring other areas in Vancouver, it confirmed for me that this hotel was in a prime location. I can't say it enough. The location cannot be beat. As far as the accommodations themselves go, I can't complain. The front desk, doorman, and concierge were all knowledgeable, polite, and helpful. The room was okay. Not bad, but not excellent. There was no bathroom fan. Other than that, the suite was sufficient. We didn't spend too much time in our room, but it was nice to have the two rooms, and the kitchen was nice because we could go to the grocery store in the lower level of the building to buy breakfast items and water and things and keep them in the fridge. All in all, I couldn't be happier about our stay at the Coast Plaza.", "Date": "April 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“couldn't have been happier”", "Author": "AddieSeattle", "ReviewID": "UR14817968", "Content": "We spent 3 nights at the Coast Plaza last weekend as a family reunion of sorts, celebrating birthdays, and other special occasions. There were 7 families represented. Everyone was pleased with their rooms, and the friendly, helpful service that we recieved during our stay. With that many people we had some special needs! Its an older place, but has been well taken care of, certainly clean enough for our picky group. The neighborhood is full of great eateries,and lots of fun to walk about. Stanley Park (the aquarium) is more than a few steps away...we drove, but access to our car in the basement parking garage was easy. I highly recomend the Coast Plaza Hotel, its a good value with a great view!", "Date": "April 5, 2008"}, {"Ratings": {"Cleanliness": "3", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Great location!”", "Author": "TOgirl85", "ReviewID": "UR14519098", "Content": "I stayed here with my family in March '08. The location at Comox & Denman is hard to beat. It is walking distance to Stanley Park, and there are tons of cafes and restaurants along Denman. And it's right on top of a mall, which has a grocery store, so it's easy to pick up snacks & drinks or even food to cook if you're in a suite with a kitchen. The rooms are fairly spacious and comfortable. There is a great view (we were on the 25th floor). I think some of the reviews here are overly critical of the rooms. They are clean and didn't look that old to me. The bathroom tiling choice makes the ground *appear* a little dirty, but it's really not. The bath tubs are on the older side and should be replaced, but they're not gross. There is lots of parking available, and the hotel offers shuttles to certain tourist spots.", "Date": "March 25, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Ontario", "Title": "“Worst Hotel I have stayed in!”", "Author": "travelorOntario", "ReviewID": "UR13692085", "Content": "My husband I and I stayed at this hotel last week. I travel a lot with work and I have never had such I terrible hotel. It was an apartment building built in the 70's and you can tell. I do not think that anything has been done to the building since then. I felt like my room was grama's apartment. The beds were gross. The decor was terrible. There was PURPLE tub and toilet! To make matters even worse there were bulk soap and shampoo dispensers that stay from guest to guest. It really did not seem very clean, nor appealing to me. There was also a very old, dirty fridge that ran very loudly. To sum up the room it was dark and depressing and did not feel clean at all! The hallway looks like something from a dorm room and the pool was in the basement and very creepy. We talked to the girl at the desk, and were told that it was an older hotel and they needed to do renovations. The view was nice, but what good is a nice view if the bed and bathroom gross you out?", "Date": "February 19, 2008"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "", "Title": "“The best reason to stay here is a great view from the top floors”", "Author": "PacificDelphinium", "ReviewID": "UR12803839", "Content": "We had a great weekend stay here when we booked on the spur of the moment in June 2007 for the jazz festival in Vancouver. The best part of the stay was the outstanding views from the room, which had a windy little balcony off the large sliding full length glass windows. I would definitely request a room high up, facing west. It was convenient to walking to Stanley Park, as well. I have attached photos to show that the view is, indeed, a highlight. Good for a couple; not so great for families with kids. On the downside, the hotel had a rather cold feel architecturally.. it just felt cavernous and designed to manage large numbers of people, rather than to provide a comfortable stay. The staff at the desk seemed extremely busy, but remained courteous. We did not try the hotel food. I probably would not stay there again, unless it was for another overnight in a similar room...quite expensive for the quality of hotel, I believe. One is essentially paying for location; and, hopefully, a view.", "Date": "January 20, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Nice Hotel in Excellent Location”", "Author": "rjc260", "ReviewID": "UR11192764", "Content": "We have stayed here several times. The hotel is in a great location, very close to the beach and right on Denman Street with many dining and drink choices in the area. You can walk up the side street to view the West End neighborhood as well. The hotel rooms are average and somewhat in need of a re-decoration but they are large and most have spectacular views of the skyline and/or mountains. There is a full scale gym next door with a free pass included and a couple of restaruants on site. Definitely not a five star hotel but one I would highly recommend for the location and views.", "Date": "December 1, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London", "Title": "“Not what was expected”", "Author": "jamo007", "ReviewID": "UR11192013", "Content": "The Coast Plaza Hotel is a good hotel for a short break in Vancouver, i would not reccomend to stay here for long periods of time.The exterior of the hotel looks a bit shabby but the hotel is at least making an effort in improving this.The hotel is located well in the downtown district. There are many small but pleasant resturants blending in with the cosmopoliton downtown area. Down the road close to Stanley Park, the harbour area is filled with expensive but quality resturants and some larger chain hotels. The hotel unfortuantly was not up to what i thought i had booked. The rooms were dated and i was on the 4th floor of the block. This ment i overlooked a poorly maintained roof which looked as if it had not been cleaned since the hotel was opened. Also the hotel did not have the room avalible which i had booked, so two uncomfortable 1930's hospital looking beds replaced what i had booked! The staff still seemed to manage a difficult situation well.The hotel resturant was clean and the food was nice. Unfortuantly i would not be returning to the Coast but this is only due to my dark and dingy 4th floor room. Im sure that on higher floors things may be different.", "Date": "December 1, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Cincinnati, OH", "Title": "“Nice hotel”", "Author": "carrotop", "ReviewID": "UR10740498", "Content": "Nice surprise for a 3 1/2 * hotel booked through Hotwire for $74/night. Large room with queen bed and kitchen facilities with microwave and refrig. Excellent location near Stanley Park with indoor parking at the hotel for $17/night. The hotel looked modern, but could stand some minor updating. Long walk to the waterfront, we drove to all attractions.", "Date": "November 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Doncaster England", "Title": "“Loved this hotel”", "Author": "chap0502", "ReviewID": "UR8697898", "Content": "Arriving here on September 3rd for 6 nights with my wife to celebrate 35 years of marriage was a godsend after a horrific 3 nights in Kamloops. From the moment we pulled up in the hire car to transferring our luggage to our room the staff could not have been more helpful. ( nice of the front of house guy to advise that the valet parking would be $7.00 which we did not take up). This was new to us from the UK. I had booked a suite and both my wife and I were very impressed with the spacious suite on the 21st floor. What a view of English Bay and towards West and North Vancouver. What a city and what a hotel. The front desk and reception were fantastic with the only negative being a $17.00 parking charge per night. Glad to hand the car back after one night. All the staff were very knowledgable in relation to locations that we enquired after and even arranged for a couple of our trips. The complimentary breafast was more than adequate with excellent service considering the number of guests due to quick turn round guests going on cruises etc. We thought the location was fantastic being between Stanley Park and the Bay and the range of eateries on Denman Street was just amazing. Having scoured reviews of other hotels in the area and reading of clients seeing beggars in hallways etc in some establishments I was impressed with the security of the hotel. Unfortunately holidays come to an end and discussing transport to the airport a member of concierge advised to get a taxi rather than the airport bus. Well we were very surprised that the taxi fare was cheaper than the bus with a door to door service. Dave (58) and Sue ( a bit younger) Chapman Doncaster England", "Date": "September 12, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "sussex england", "Title": "“A change of room led to a better stay”", "Author": "sparkySussexEngland", "ReviewID": "UR8686930", "Content": "We booked a five night summer package from the 4th - 9th August in a one bedroom suite. The summer package entitled us to free parking and $25 vouchers for each night of our stay toward food in the hotel. The lobby area was comfortable if not inspiring but check-in was quick and we soon had the keys to our room on the 22nd floor. We entered the room and were instantly disappointed. The furniture was very tired, the dining room table and chairs only had two chairs and we were a family of four, their was only enough cutlery for three people to eat at once. There were hangers in the wardrobes with cards on inviting you to use the robes, but the robes were missing, controller missing for one of the TVs etc.. We were paying $279 a night plus taxes and this room wasn't worth half that amount. So back down to reception to explain our concerns. We spoke to the front of house manager who was very understanding and arranged for us to be moved to another room. This couldn't happen until the following day due to a massive firwork festival in Vancouver and no available rooms. After a day out the following day we returned to the hotel to find we had been moved to the 32nd floor. Same style room however this one was much better. Furniture was of similar style but newer and overall the room had a better appeal, we still had to ask for an extra two chairs to enable us to seat four at the dining table. The location of the hotel is fabulous, Two minutes walk to English Bay or ten minutes in the opposite direction to Stanley Park. Plenty of places to eat offering massive variety. Make sure you visit the cup cake shop on the way to English Bay - Fabulous. We used the $25 vouchers for some evening meals and the service was excellent. The food was also of a very high standard, very well presented, hot and very enjoyable. The pool was fine for the children to play in however remember it is in the basement so lit by flourescent lighting, no natural light. Check out was very efficient and speedy. Overall I expected a better quality hotel for the money we were paying. The service we received was good but the hotel is in need of a major refurbishment.", "Date": "September 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Reno, Nevada", "Title": "“good value in good location”", "Author": "coldsprings1", "ReviewID": "UR8656299", "Content": "Stayed here for three nights after getting a good rate on Priceline. We had a room on the 14th floor which had a great view, would have been better with a higher floor but was still good. Very quiet, large room with a small walk out balcony. It was very clean, as others have said the decor is tired. Didn't use the pool or restaurants as this hotel is located within walking distance of many small, non-chain restaurants. The extra parking fee was $20 and every time the valet has to bring your car, other than departure the fee is $8.00. The staff is helpful and the front desk changed $20 american into canadian for us and told us how to use the city bus. Would stay here again if we got the same price.", "Date": "September 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "nyc", "Title": "“Great service. Great location. Tired decor.”", "Author": "napfan", "ReviewID": "UR8591968", "Content": "West End location. Steps from English Bay. Sound enticing? It did to me until the minute I opened the door to my room. Personally, I loved the 80s, but even my parents have redecorated since then. Although the room was clean and spacious, it could've done with a total gutting. Dusty rose bathtub. Peeling wallpaper. Bulky, dinged-up desk. With that said, though, the hotel staff were friendly and helpful. Always at the ready with directions and restaurant suggestions. Would I stay again? Probably not. Surroundings matter. Call me after the remodel.", "Date": "August 31, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Santa Cruz, CA", "Title": "“Okay property”", "Author": "Lattenut", "ReviewID": "UR8489726", "Content": "We stayed in this hotel one night before our cruise. Room worked out okay, but was old and a bit ratty. Bathroom was tiny tiny tiny. Kitchen had a sink, small fridge and coffee maker. Reception was rude - told us we were 15 minutes early for check in - come back later. We went to lunch (the boathouse - great food!) and returned 1 1/2 later to a much nicer person. Can't say I'd recommend this property.", "Date": "August 23, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Texas", "Title": "“Needs updating!”", "Author": "TXFamilyTX", "ReviewID": "UR8395367", "Content": "This hotel has obviously not been updated in 30 years! The carpets were dirty and stained, the curtains were dirty, stained, and musty. The kitchen was old, old, old. The wallpaper was pealing off the walls. The bathtub had rust stains. The bathroom was tiny. My total bill came to $300CAD a night with parking and taxes! This was no luxury hotel and not worth $300! The suite was large but the bedroom smelled and the window didn't open enough to let in some fresh air (no a/c in the bedroom either!).", "Date": "August 11, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“here today, gone tomorrow (well....after 2010)”", "Author": "grumpy-tourist", "ReviewID": "UR8280209", "Content": "Stayed here for three nights in June as part of a large tour group. At the end of a busy Canadian tour we just wanted to chill and have a relaxing time in Vancouver. First impressions of the hotel were not good....yes, it's certainly looking a little tired. The rooms are a good size and comfortable, but have seen better days. This became more apparent as we were told that the hotel will be closing after the Winter Olympics in 2010 and may be converted in condo's. Now this is a shame, as it's certainly in a great location, a little out of town for some maybe, but Stanley Park and English Bay are just a short stroll away. Add the interesting locality of Denman and Davie streets and some colourful locals, and this is a great place to stay. We really enjoyed the hotel's Bar and Grill....very good food and top service with much lower prices than downtown. We did not try the breakfast as there are plenty of places in Denman St. Trolleybus 5 from Denman or 6 from Davie will take you into downtown (cheap and frequent) A pleasant walk round Beach Avenue will get you to the ferry for Granville Island....the markets there are excellent. Plus points; Location, Bar and service. Minus points; A bit tired, but it won't be around much longer!", "Date": "August 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver", "Title": "“Wonderful stay at a comfortable Hotel”", "Author": "koko269", "ReviewID": "UR8065230", "Content": "I stayed at the Coast Plaza Hotel on July 3 and checked out today July 5. Check in was easy and so was checking out. Maybe because it wasn't on the weekend. It was an incrediably low key relaxing stay. The room isn't the most up to date with the furniture and fixtures, but that didn't bother me. My boyfriend and I decided to stay for 2 days just to relax and spend some time alone. My maid service was excellent and she even wiped under my makeup that I had put out on the bathroom counter. The best thing I have to say about the hotel is the location. It's literally a walk away from everything. English Bay, Stanley Park, shopping. If you are coming to Vancouver, I recommend this hotel for its pricing and location. Lots of restaurants to eat around here. I do have a favorite restaurant on Robson street. It's farther than a little walk. I'm fine with it because I love walking. It took about 10-15mins to get to \"Guu.\" The best restaurant on Robson in my opinion. It's a place that serves cooked Japanese tapas. You have to get there early because there's always a line up.", "Date": "July 5, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Santa Barbara", "Title": "“Awesome Hotel”", "Author": "Malpal87", "ReviewID": "UR7664956", "Content": "The Coast Plaza in Vancouver is located on the West Side of the city. The hotel is overlooking the English Bay. We booked through the internet, and they gave us a suite. Our room had a full kitchenette, a living room with a pull out couch, and a great view. The hotel is not quite in downtown, but it is about a 15-20 minute walk to all the great shops. Taking public transportation or a cab, it takes half the time. The food on Denman street where the hotel is at is amazing, all kinds of food for cheap. It was great, we ate mostly around the hotel the whole time because there were so many choices and the prices were incredible. The staff was really helpful throughout the entire trip, they always helped with taxies, gave us maps and told us exact directions and how to use the public transportation. The room was always clean when we returned for the day, and it is great for staying longer than 3 days because since there is a kitchen you can buy a few groceries to get through the trip. Great experience and would definetely stay there again.", "Date": "May 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "england", "Title": "“a great time”", "Author": "nm838", "ReviewID": "UR7483674", "Content": "This was the last stay on our trip, and what a great way to end it. There have been reviews about the 'tired' decor, but whilst there are older parts to the hotel, old light switches, old cupboards and decorating, this was a great hotel with a really comfortable feeling to it. The important areas, the reception, the staff, the incredibly comfortable beds, the incredble view of Stanley Park, the brand new kitchen in the suite, the level of cleanliness and the great location more than made up for some old fixtures. This hotel should not be dismissed because of some aged features. The mall with market under the hotel was fab, the location for Stanley Park (which is amazing) and of course the cupcake shop just round the corner ( which was worth every penny, try the carrot cake one!) made this a great stay. I would come back if I return to Vancouver.", "Date": "April 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Vienna, Ohio", "Title": "“Amazing Hotel!!”", "Author": "jkaaz101406", "ReviewID": "UR7345208", "Content": "My mother, brother and I were on a \"budget\" trip to Seattle and Vancouver, but since we saved so much on our hotel in Seattle, we decided to splurge a little and booked a superior suite for a little under $200 a night. We had two double beds in their own bedroom, a pull out couch, dining area, full kitchen, two TVs and a balcony with an amazing view of the mountains and English Bay. The hotel has an awesome location, where everything is within walking distance. The restaurants are amazing, have a variety of pricing, and are everywhere. The staff at the Coast Plaza was fast and friendly. The only drawback is parking costs about $20 a day (I'm still not used to this practice of charging for my car to spend the night too). Oh, and we were there during Gay Pride Weekend (end of July), which kind of freaked my brother out, but I didn't mind. So for those you who are, unfortunately, homophobic a bit, avoid this time of the year, as there is a Gay Pride Parade that marches directly in front of the hotel, there are gay weddings on the premises and all the bars close by fly rainbow flags. It was alot of fun, though being in an elevator with my mom and a pleather-clad dominatrix was quite a comical experience. If you can hang, just look at it as part of the local flair and go with it! I will definitely be back (August 2007, I think) and absolutely can't wait.", "Date": "April 13, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Francisco", "Title": "“Great deal”", "Author": "BLynnS", "ReviewID": "UR7186656", "Content": "I stayed here one night in 8/06. The reservation was made for my by West Coast Air because I had them package a deal that included a water plane flight (also recommended). For a \"standard\" hotel I thought it was a great deal. The room I got was large and comfortable with a great view of downtown. The front desk staff were very good and helpful. Even though they had a huge tours checking in and out, everything ran smoothly. I loved the location; it was easy to walk around the west end. Will definitely stay again my next trip to Vancouver.", "Date": "March 18, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Miami, Florida", "Title": "“Was very good”", "Author": "joshbash", "ReviewID": "UR6799050", "Content": "Got a great deal thru Priceline. I like the West End alo; easy walking to anywhere, good restaurants. We had a great view, were able to cook in the room... The bathroom was fine. The lobby facilities were somewhat limited, but couldn't beat it for about $65.00 per night.", "Date": "February 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lynden, Washington", "Title": "“SURPRISE SURPRISE!!! Yes I was surprised!”", "Author": "kengaroo", "ReviewID": "UR6599597", "Content": "I go to Vancouver quite a bit because it is close to me and I love the city. I booked the room through Hotwire for $68, but it was not the hotel I thought I was going to get. Yes I always spend at least 30 minutes trying to figure out which hotel it is going to be, is simply part of the fun for me with Hotwire. Was shocked and then concerned when it turned out to be the Coast Plaza I just booked. Reviews were not all that great for what I now know to be stupid reasonings...in my opinion. I had never been to this little spot in Vancouver before, and thus some concern about what I might have just done. My hopes were down. When we arrived, it didn't look all that impressive...kinda old. Once you step through the doors, it was a totally different feel. It was clean, bright, huge, and looked very classy. Outside yukky, inside awesome! You do have to pay to park, under their hotel, about $20 per day. The checkin was fast and easy, staff very nice and courteous. Lots of glass and marble, didn't look pink to me as others have whined about...and so what if it was pink?? Room was large and clean, with patio that had sliding doors open up to it. Our view was nothing special, but could tell if you had a higher floor, all views, whether it be the ocean or the city, would be spectacular. Ours was still very nice just on the 4th floor....believe it has 40 floors. Everything worked in the hotel...nothing to complain about. The pool is huge...and very WARM. Hot tub was hot enough, but it could have had a better jet system...big deal though! Both were inside so they are usuable all year. There is a mini mall on the lower level of the hotel...includes a store that has everything you could possibly need.....food of every kind included. Even had a movie theatre which was pretty cool I thought. The area around the hotel is what is best. Little shops and the coolest of cool places to eat. What made it so nice, was all these shops and eateries were not your typical places...they were unique and not your ordinary boring everyday places...they were very nice and different. Food could be had for a bargain in many places...and just about anything you could think of. It only runs about 5 blocks, but it is one of the most unique and affordable stretches in the city...I know think of it as my favorite little \"unknown\" section I have yet to experience. I give it it a 5 star rating here, because of it's uniqueness and how peaceful and quiet the area was....yet was only just blocks from Robson Street shopping and such. I didn't have a SINGLE bad experience during my stay there...well other than paying $11 for a movie in my room that was simply a really bad choice on my part...not the hotels. Anyone seen Jackass 2 yet??? For those that have, you know why it sucked to pay $11 to see it!! I loved this place, and will be back regardless of what I will have to pay next time. Not many places I am willing to say that about...so far only the Westin Bayshore and the Rosellen have that distinction in my opinion. I highly recommend giving this place a shot.", "Date": "January 15, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Toronto", "Title": "“Suite was renovated but still outdated”", "Author": "Mary-Natalie", "ReviewID": "UR6588226", "Content": "I stayed with my husband and our 5 month old son for 1 night only (back in Nov. 06) and then switched to the Mariott Vancouver. The suite smelled like mould and the walls and carpet looked dirty. The crib provided was useless. Suite was renovated but still outdated. However, the suite was spacious and the view was nice. There was a full kitchen, large living room and bedroom. Hotel is a 2 min walk to English Bay and paths to Stanley Park. Good value if you're looking for space and need a full kitchen. Otherwise I would not recommend it.", "Date": "January 13, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "SAT", "Title": "“Outdated 2 1/2-Star Max Hotel”", "Author": "katskills", "ReviewID": "UR5905245", "Content": "I booked this hotel through Hotwire which categorized this hotel as a 4-star hotel. I have stayed in enough hotels to know this was by no means a 4-star hotel. At max, this is a 2 1/2 star hotel. The wait staff was average, but the room was horrendous! The bathtub was stained yellow and the hotel was outdated in every way imaginable. The decor is outfitted in furniture from what look liked the 70s; think wood formica doors, wood formica tables, white formica bathroom counters, fake crystal lamps. The room was dark, the lights didn't work in the kitchen and on one side of the bed. I paid $109 including tax which is certainly overpriced for a hotel of this caliber. I would not stay here again, nor would I recommend this place to anyone I know. Buyers beware!", "Date": "October 3, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Barnsley", "Title": "“Clean Big room”", "Author": "ManofSteel", "ReviewID": "UR5834546", "Content": "My partner, 1yo son and I traveled to Vancouver via a week in Toronto. On arrival the hotel the Door man helped us with our bags from the airport bus. The desk staff were very friendly and efficient. The room was huge and very clean (if a little dated) nice well equipped kitchen and a fab view of Engilsh Bay. We had a complimentery breakfast vouchers courtesy of Thomas Cook Signiture wich was great as the resteraunt and staff were 2nd to none. I would highly recomend this hotel and the city of Vancouver. We will be returning next year!", "Date": "September 25, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cardiff, South Wales", "Title": "“Great location and facilities for families”", "Author": "Debbie-Wales", "ReviewID": "UR5606082", "Content": "The suites in this hotel are great value for a family holiday. A real luxury to have a separate kitchen, lounge and two TVs. The hotel is perfectly located with an easy walk to either Stanley Park or English Bay beach with a slightly longer walk to the \"good\" shops. Load of restarurants close by (useful as hotel meals, though good, were pricy for a family. If, like us, you don't want to carry your entire wardrobe, the laundry facilities are very useful. Only downside was that the views were iffy unless you were very lucky (or paid loads for your room).", "Date": "August 13, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Victoria BC", "Title": "“Large Rooms but quite outdated”", "Author": "Hardings", "ReviewID": "UR5592527", "Content": "We stayed at this property from Aug 2-4, 2006. It was wonderful to get a downtown hotel with a kitchen and a separate living room so the kids could sleep on the pull-out. This hotel is quite out-dated - no air-conditioning, older carpets, flooring, & doors, etc. And the kitchen had that musty hotel smell to it and was not outfitted well enough to cook in. We didn't end up using it, but it would have been difficult to considering there wasn't enough cookware, dishes, etc. Also, I must mention that breakfast in this hotel is completely outrageous price-wise. $3.75 for one cup of coffee - please. Maybe I'm out of touch with hotel restaurants, but all the prices seemed very expensive, and this is a 3-star hotel.", "Date": "August 9, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Minnesota City, Minnesota", "Title": "“Second stay.... loved it even a little bit more!”", "Author": "tribble300", "ReviewID": "UR5347267", "Content": "This was my second trip to Vancouver in 9 months... I love the Coast. The room I was in faced English Bay. I had a great view. I think the room was recently renovated. I really had everything I needed there, including coffeepot. The front desk service was impeccable, The Bellmen were gracious and helpful. There is a large lobby downstairs, with comfy couches. The lobby is beautiful.... Recommendations: In my opinion, anything that you might want, or need during your stay is within walking distance. The Doorman has an incredible knowledge of the area, and will recommend places to eat, etc. There is a mini-mall attached to the hotel, that includes a grocery store.... and a coffee and sandwich store. Must stop at Cupcake. It is a few blocks from the coast. All they sell is cupcakes, but they are to die for. I tried their weekly special... which was strawberry kiwi with key lime icing... yum! Down Denman from there is Delaney's Coffee shop. Great coffee.... fun people watching... and great ambience. Down from there is Milestone. Chain restaurant, but I have had their chicken portabello... and it is worth it!!!! Also, at the hotel, watch out for Stanley. The bellmen feed the squirrels bags of hazelnuts every year. The squirrels... (all of them named Stanley, of course) come up and \"squirrel away\" their treasures... Stop groaning, you could see that one coming!!!! I spent a good half hour watching the squirrels! Very nice stay, I highly recommend it.", "Date": "June 14, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Scotland", "Title": "“I want to go back!!”", "Author": "Scots_lass67", "ReviewID": "UR5008558", "Content": "Loved it, not only the hotel but Vancouver itself. The location of the hotel was real handy for Stanley Park which is gorgeous and well worth several visits (we went 4 times during the week we were there) and also for alot of eating places and of course the shopping!!! If you are looking for somewhere to eat then I recommend Milestone's which is just around the corner from the hotel and the staff there are excellent. We only had breakfast in the hotel but it is served from 8am to 11am which allowed a morning swim and spa in the very quiet hotel pool. Breakfast really will last you until dinner, they don't believe in scrimping. Our room had a rear view and to be honest I didn't think of asking to be moved, and it allowed us to watch all the behind the scene activities that go on around the back streets of the city. I would love to go back, and if I do then I would definately be staying at the Coast Plaza again and a higher level would be requested on arrival. All I can say is GO!! experience it for yourself.", "Date": "April 25, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Vancouver, British Columbia", "Title": "“Wonderful! Went out of their way to make our weekend!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4998579", "Content": "After a terrible experience at the Century Plaza Hotel in Vancouver, we were set to cancel our romantic weekend and go back home. (If you are considering the Century Plaza, please read my review as it was by far the worse hotel experience I have ever had). A friend took me to the Coast, saying she had a good experience there in the past, and we went to the front counter. What a difference from the last hotel! The people at the desk were kind and friendly, and my friend explained to them what had happened to us and the service we had received. They were appalled, and went out of their way in every way to make us feel better. They booked us in for the two nights, and gave us a discount because I was so worried about money (having lost my other night's payment at the other hotel because they would not refund me) which I know they absolutely didn't have to do. The second night we were there, they booked us into a Jacuzzi suite, which was AMAZING! The gave us vouchers for a free breakfast, which was served to us in our rooms and was a real breakfast that was *delicious* and also some free drinks in their bar/restaurant. I cannot say enough for the desk staff, who made me feel so much better when I was near tears thinking that my anniversary weekend with my spouse had been ruined. She even gave me a little felt flower to \"make me feel better\". :-) The rooms were lovely. They were very clean, and the beds were so comfortable! Even the first night was so enjoyable! Between 6-9 they deliver free cookies and milk to your room, for the \"comforts of home\". The second night, in the Jacuzzi suite, WOW! Really, wow! The bed was huge, and extremely comfortable, the view over Vancouver city and the water was GORGEOUS and then there was the jacuzzi... Fit two people perfectly to sit and cuddle and watch the city at night time. It was so romantic and lovely, I wish I was still in there! We were also leaving the hotel on the day of the \"Sun Run\" in Vancouver, where several streets are closed due to the runners. The front desk staff was very helpful in giving us alternate routes to get home, and it ended up being a breeze! We were also impressed that they have dog friendly rooms, as we often travel with our dog and the hotel was still very quiet, and clean. I am so very glad that I was recommended the hotel, it made our weekend just perfect. All the bad feelings I had when I walked in quickly melted away because of the warm reception and lovely facilities. The location is very nice as well, we spent all day Saturday walking along Denman and Robson Street where you can find anything you want, really.", "Date": "April 23, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Edmonton, Alberta, Canada.", "Title": "“Great hotel for families”", "Author": "amc48c", "ReviewID": "UR4826827", "Content": "Normally travelling alone on business, in this instance, I travelled with my Wife and two children to Vancouver. This hotel was, overall, excellent in terms of staff service, room and location- equating overall with excellent value for money. First of all the service - our room was upgraded two levels on check-in when I asked for a rooom on a higher floor with a good view and wireless net access. So instead of a one bedroom suite, we were given a two bedroom corner suite with fabulous ocean and mountain views. Though the decor in the room is rather dated, it was huge (over 600 square feet) - and, with a family, space is better than a new desk in my view. There were many nice touches - staff remembered our children's names (Jenny in particular) and gave them toys on arrival. Nothing was too much trouble. Maids brought chocolates and water every evening - which was a nice touch. The location was good, close to a main shopping and restuarant distict. A grocery store in the mall below will cater for your everyday food needs. The kitchen in the rooms have the necessitites. And the price was very good - I paid around $C135 for our suite per night. Overall, the quality of the staff here was better than I have had in many more expensive and supposedly higher status hotels. The staff really are an asset to the company - and I am sure that with a family, you would be delighted with this great hotel. The hotel is located about 10 minutes walk from Stanley Park and about 15 minutes walk from Downtown.", "Date": "April 1, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "hartlepool uk", "Title": "“Quite impressed with the place until”", "Author": "maureenHartlepoolUk", "ReviewID": "UR4324445", "Content": "On entering room was very impressed with the size and facilities- not sure about the summer months, as there was a free standing A/C unit. Rather dated , but clean. The lobby and seating areas seemed to have been refurbished recently- new looking carpets etc. Outside there were plenty of eating places and small cafes, from different cultures. All in all quite pleasant.A few down and outs, but that happens in all cities. The biggest shock came when we were in the long bar and grill having a drink, when a mouse ran across the floor. When asked by a waiter what all the fuss was about he replied \"a mouse. we can't get rid of them\" Needless to say the meal we had booked for New years Eve was cancelled and we went to the Boathouse.Whilst this did a very good steak, I cannot offer rave reviews about the cooking. A steak is a steak after all. Nice views over the harbour however.", "Date": "January 4, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Waterloo, Canada", "Title": "“Fabulous Views”", "Author": "Littleloobster", "ReviewID": "UR4005977", "Content": "We stayed for 3 nights at the beginning of September. The receptionist was very friendly, unlike the three hotels we had previously visited on our travels through the US! Due to the original room we requested being unavailable, we were upgraded to an executive suite which was enormous. Admittedly the rooms are a little dated, but very clean. There were balconies from both the lounge area and the bedroom and the views were absolutely stunning. Due to this, we chose to eat in the room for a couple of nights and although the food wasn't fantastic, it was reasonably priced. I can't say the same about breakfast unfortunately. The concierge were also very friendly and helpful. I didn't find the area to be at all intimidating, quite the opposite. However, I think if we hadn't had the upgrade to the executive suite, it may not have been such a great stay.", "Date": "October 11, 2005"}], "HotelInfo": {"Name": "Coast Plaza Hotel & Suites", "HotelURL": "/ShowUserReviews-g154943-d156562-Reviews-Coast_Plaza_Hotel_Suites-Vancouver_British_Columbia.html", "Price": "$153 - $290*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1763 Comox St</span>, <span class=\"locality\"><span property=\"v:locality\">Vancouver</span>, <span property=\"v:region\">British Columbia</span> <span property=\"v:postal-code\">V6G 1P6</span></span>, <span class=\"country-name\" property=\"v:country-name\">Canada</span> </span></span></address>", "HotelID": "156562", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/6f/cc/6fcc04a929c5af0c98bdc6bceb6d2fec3large.jpg"}}