{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbus, OH", "Title": "“Destination Europe Approves!”", "Author": "DestinationEurope", "ReviewID": "UR125446610", "Content": "Our agents and agency stayed here in November 2009. The location is fantastic - can not be beat. Located directly across the street from the Colosseum with great access for transportation to the rest of the city. Although the walk to the Historic Center is only 15 minutes and is a great walk up the Via dei Fori Imperiali right through Ancient Rome. Bruno is a magnificent host and the staff are all attentive and helpful. The rooms are elegant and amenities are fantastic. The best part is the rooftop bar and terrace where breakfast is served daily and the views are the best in the city of the Colosseum. Thank you Bruno for your wonderful service and attention to all of our clients.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "vashon", "Title": "“Everything you could dream of on a Roman holiday.”", "Author": "vashonsialnd", "ReviewID": "UR125348919", "Content": "When one walks through Rome, (or considers all the options on Trip Advisor, etc.) you realize there are dozens of choices of hotels. Considering the location, the description and view of the Colosseum, we opted for the Palazzo Manfredi. It was the perfect choice for us in every way. This stunning little hotel is like a jewel. The people who work here make you feel like family with their kindness, care and warmth. No request is too much! The view from the top terrace toward the Colosseum is an unrivaled experience. The hotel itself is right next to the ruins of the Gladiator training school...in fact, there are ruins under this former grand residence! Our room did not look directly onto the Colosseum, but we didn't care---we experienced perfection.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“An exceptional hotel.”", "Author": "dglambeth", "ReviewID": "UR124677995", "Content": "What a terrific hotel! It is hard to fault it. Our room was splendid and my partner would happily have spent the whole stay in their fabulous bathroom. We also had a wonderful view of the Park of Trajan opposite and that was particularly gorgeous when it snowed deeply over two days, to Rome’s evident astonishment. One of the things that had enticed me to book six nights at Palazzo Manfredi was the promise of the view of the Colosseum from the roof terrace. We ate up there on three mornings and on three evenings and the view was spectacular. The food was also very good, if pricey. It was of the highest standard, as was the service, and we very much enjoyed the (seven course!) Degustazione Menu with wine pairing and the Valentine’s Day special five course meal. Breakfast was simpler, a cold buffet, and a good start to the day, especially with the Colosseum sitting right there in front of you in the sun. I could make a few small complaints but they are so minor that I shall not. They were also things that, had I not been busy with other things and mentioned them at the time, I am confident the staff would have dealt with them immediately. The building is a handsome place to stay and very conveniently situation for the Centro Storico but the staff are even more to be recommended. The warmth of their welcomes and their politeness and attention to detail in every interaction were remarkable. We had a great week in Rome but our happy choice of accommodation made it an even greater week. And we had free, unproblematic wifi too. We were happy geeks!", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London,UK", "Title": "“Perfect hotel, lovely staff”", "Author": "Northfields", "ReviewID": "UR124001900", "Content": "I stayed here with my husband for a long weekend. It was a birthday surprise so seemed perfect - boutique style, and a room with a view (Colosseum - go on pay the extra!) I wasn't disappointed - and nor was he! Location is great - obviously overlooking the Colosseum but also walking distance to all major sights. The hotel recommended a cab to the Vatican but we walked there too - in such a beautiful city it's a pleasure to walk and there is something to look at on every corner. The hotel itself has plenty of character - an historic building - but is decorated in a contemporary style, with taste. The rooms are smallish - hey it's Rome - but not too small. The bathroom is also compact, but beautiful, and with another view of the ancient monument! Everything was spotlessly clean. The staff were a delight. Everyone we encountered was friendly and helpful. A nice touch was a complimentary welcome drink in the bar on arrival. Also, if you ask the day before they will fetch tickets for the Colosseum for you so you don't have to queue. This was brilliant - we saved about an hour and had that Business Class feeling as we sailed past the masses! We didn't eat in the restaurant - it looked nice but quite expensive altho with a great view. We ate in the city centre one night and round the corner in a little Osteria the other. There is only one downside to the hotel, which is noise. Inside the hotel is quiet, but the road outside is cobbled, and cars or buses whizzing down it at night do create a lot of noise. Good double glazing reduces this (and I always travel with earplugs so wasn't bothered) but light sleepers should be aware. Overall though a definite recommendation and I would go back!", "Date": "February 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“one to impress your other half with!”", "Author": "mrsluxuryexplorer", "ReviewID": "UR123972219", "Content": "We stayed here for a week May 2011 and loved it. Not cheap in any way. I loved the room, amazing view of coliseum. I liked the decor and the marble bathroom, even though it did not have a bath, the shower was very good. Service was lovely, very helpful, which I must say was far from the norm in Rome! Breakfast in the conservatory overlooking the coliseum was special. I though the selection of food was great and very high quality indeed. We also ate dinner in Aroma which was great. The only downside was the price of the drinks in the bar, which is on the terrace - it may have been nice to have more informal access to the terrace. They really were very expensive and I am used to high end bars - but I don't think the euro exchange rate was in our favour. They did bring quite a range of snacks with each drink, which was nice, though one night they brought a platter of sushi bites - we had just got back from a big dinner! I would prefer slightly cheaper prices and less snacks I think. They were able to organise a limo to the airport for us at short notice due to a national strike which was a very reasonable price compared even to the train.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Wonderful Place, Great Staff”", "Author": "Sarahybarey", "ReviewID": "UR122932334", "Content": "My husband and I stayed at this at the Palazzo Manfredi in late September and it was really great. We stayed two nights in an apartment and one night in a junior suite. We originally booked 3 nights in the lowest category or room at the hotel but when we arrived they informed us that the person staying in the room right before us had injured themselves and needed to extend their stay thus they needed to move us to one of their apartments. We were a little bummed but they let us have the pick of all of the open apartments and upgraded us to a junior suite for our final night. The apartment was lovely. Not as posh as the hotel but had tons of space and was very quite. The junior suite was spectacular. The best part was the view of the Colosseum. From the windows and even the shower the view was amazing. The view from the restaurant where we ate breakfast each morning was also amazing. The food was Delicious and the lattes were to die for. Breakfast was included in our rate, otherwise it would have been pricey. But probably worth it if you want a breakfast you wont soon forget. We walked everywhere although it can be a bit of a hike to get to other areas. All together it was a fabulous stay!", "Date": "January 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Safe Choice”", "Author": "AjmMelbourne", "ReviewID": "UR122853763", "Content": "Good basic hotel Neat , clean rooms and bathroom We didnt eat at hotel resturant due to price and found eating outside of the hotel great Fantastic location Would recommend", "Date": "January 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tipperary", "Title": "“Fantastic location, really friendly”", "Author": "Missy1981", "ReviewID": "UR121425756", "Content": "We stayed for two nights. We were greeted by Milly who gave us complimentary tickets for the Colleseum and Raphael on the front desk had excellent recommendation for Taverna Trillusa in Tresteverne. All staff were very friendly. Our room was overlooking the Colleseum (one minute walk!). The hotel is in a great location and walking distance to Trevi Fountain and Pantheon (20-25 mins). Metro station for Colleseum is one minute walk. The views from the restaurant are stunning, we had a lovely breakfast each morning. Highly recommend it.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York, New York, United States", "Title": "“The most welcoming hotel I've ever stayed in!”", "Author": "Jennifer P", "ReviewID": "UR121260990", "Content": "I was just at the Palazzo Manfredi this past weekend for a two night stay. I have never had a better stay at a hotel than this one. The staff and service was top notch. Forgive me for not remembering any names but the woman during the day and gentleman at night at the concierge were so nice and helped us out with everything from making reservations, finding converters and tours, and giving us advice from a locals perspective. They made us feel so at home and were very gracious. The doorman from the US was also great - he gave us some great tips and was so friendly, which is nice to see after a long day of sightseeing. This hotel is in a perfect location in Rome, right next to the Coliseum. There's isn't a hotel closer to it than this one. Nothing beats having breakfast every morning while looking at one of the 7 Wonders of the World - its pretty neat. We walked everywhere from this hotel and it is very convenient to all areas of the city. A walk from the hotel to the Trevi Fountain is about 20 minutes, which is a very easy walk. I read a few reviews that this hotel is on the outskirts but not true at all. It's not far - take that from a New Yorker who isn't a big walker. The room were gorgeous with state of the art TV, phone, free wifi and gorgeous bedding. The tub was pretty nice too so definitely bring some bubble bath. The rooms and grounds were very, very clean which is a huge plus for me. The only negative thing i have to say about this hotel was the restaurant at the top. With a view like this, I can understand charging a high price for dinner but this was just out of control. 20 euros for a club sandwich and 8 Euros for a coffee is a little pricey - and i didnt even check the prices for a steak or other entree. It would have been nice to have dinner up there and enjoy the view but it was a little too much. There is an area on the rooftop where you can sit and get drinks at night, but without the view of the Coliseum. The restaurant and hotel are not owned by the same company but i must say, the staff at Aroma couldnt have been nicer. All in all, a GREAT stay here and I can not wait to come back here. Will recommend this hotel to anyone I know traveling to Rome. Thanks Palazzo Manfredi Jennifer Peros New York, NY", "Date": "November 30, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“5 Star prices, 2 Star service”", "Author": "A P", "ReviewID": "UR120906615", "Content": "Had the misfortune of staying here for my wife’s 40th birthday. Booking a room facing the Coliseum, this was tiny and badly planned. Staff were uninterested, unhelpful and unpleasant, prices were at the extreme and I would not wish to repeat the experience. Save your money and go to a place that can do it so much better and cheaper, the Westin Excelsior", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“5-Star Customer Service”", "Author": "CARADONNA", "ReviewID": "UR120643452", "Content": "I am writing this review from my room after my first day in Roma because I was so impressed with the customer service at Palazzo Manfredi. Arrival in Roma Airport ( FCO) 7:45 AM Friday September 16th promptly picked up by driver arranged by Giacomo, front desk manager. Upon arrival: much too early to check in so the girl at the front desk arranged for storing of our baggage, a place to change and freshen up from the long trip and a rooftop welcome drink and espresso. Meanwhile she arranged a runner to pick up tickets to avoid lines at the COLOSSEUM and the ROMAN FORUM. After our busy sightseeing day we were checked in to our room with great view and waiting was a bottle of champagne and fruit. (Celebrating 25th wedding anniversary the entire staff has been outstanding.. from the desk staff.........to the turn down service .", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Morristown,NJ", "Title": "“Wonderful stay!”", "Author": "bropaul", "ReviewID": "UR120261500", "Content": "I stayed here as part of a food and wine tour and i must say that it was an amazing experience. The rooms are spacious for a historic building - very well appointed and comfortable. I really appreciated the bath tub after a long day of walking around the city! The shower had some of the best water pressure of any hotel I have ever stayed in. Others have already commented, but the view is to die for. Having breakfast on the terrace or a drink in the evening is almost a magical experience. We had a group dinner in the restaurant \"Aroma\" and it was superb. Everyone on the staff was gracious and knowledgeable. The only negative is the street noise. Even with the best windows, there's always some, but you are at one of the busiest crossroads of the city.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portlaoise", "Title": "“What a view!”", "Author": "ivoroloughlin", "ReviewID": "UR119947422", "Content": "Myself and my partner stayed here in February 2009. The view from the balcony in the top floor restaurant was simply sensational. On the night we arrived I proposed to my now wife looking out at the Colosseum. We could not have found a nicer more scenic place. The staff were very helpful and enthusiastic throughout our stay. I had told them of my plans before we arrived and they had chilled champagne and strawberries waiting for us in our room. The breakfast was delicious every morning. The rooms were magnificent, huge marble bath tub and really comfy beds. I adore this hotel and really look forward to staying here again at some stage. The real selling point here is the view. It really is a stunning location!", "Date": "October 31, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Staff is inefficient and unprofessional. Noisy rooms. Weak air conditioning. Hotel towels are dirty. Not functional,”", "Author": "Freida K", "ReviewID": "UR119777523", "Content": "We waited 15 minutes when checking in at 3pm because the sole check in person was not around. Turns out he was away smoking. On other occasions we noted other guests waiting for long periods to check in because there was no one at the front desk to do so. When the front desk person made an appointment with us to meet us at noon the next day to show us the other units the hotel had to offer for a future trip we were planning, we waited till 12.15 pm before he turned up. We asked for an electric kettle to make tea as room service ends in the evening. We were told they don’t have kettles for guests but will organize one for us as we are staying for almost 2 weeks. Meanwhile they will provide a thermos of hot water. The next day there was no kettle. We asked again and the front desk person claimed he knew nothing about it but will organize it tomorrow. Meanwhile he will send a thermos of hot water. No hot water appeared. When we called again, he again acted like he was totally surprised. A room service person came to the room without any hot water claiming he had come to collect something so obviously the wrong message was sent to him. After more calling, finally a thermos of hot water was produced. The next day we reminded them about the kettle again. We were told that they have 2 kettles for guest rooms (contrary to their previous claim) but they are in use so they will have to buy us a kettle. Finally a kettle appeared at the end of the day. When we checked in the temperature in the room was 24 degrees C. Gentleman showing us the room said he could lower the temperature at the front desk if we want it to be cooler. We asked him to lower the temperature. That evening it was still at 24 and we asked again. We were told that it takes time to work. The next morning it was still at 24 and we asked again. This time we were told that the temperature showing in the room was not really the temperature and that they show our room temperature at 15 degrees! After a few moments we spoke to another gentleman who told us that our room temperature was at 19 degrees. Later that day it was still warm in the room (gauge still showing over 24 degrees and definitely feeling like 24 and not 15) so we asked again and the gentleman at the front desk said that it is a hot day out (max temperature that day was 28) and their system is not designed to handle such high temperature outside. We gave up. The windows are not noise proof and since it is on a very busy large road, traffic noise is continuous through the night. Did not matter to us as we can sleep through anything but for people who care about noise this would be terrible. In addition to the exterior noise there is also the noise from within the corridors that comes through the door. I put the bath towel over my head and face after a shower and felt hairs in my mouth. Upon examination, the bath towel had about a dozen long hairs (not mine) stuck on it. Closet has mini bar on one side and a set of drawers with safe on the other side so there is nowhere you can hang anything that is longer than a shortish shirt. When we checked in the TV was not working and we could not work out how the sink stopper worked. After the hotel person came he said he will have to call an engineer to check it out. Eventually the TV worked but the sink apparently was designed so you cannot stop the drain even if you want to have a basin of water to shave. There is no tub for travellers who prefer baths. The lights in the bathroom are bare light bulbs (by design). The shower is treacherously designed so it is sheer glass on one side of a tunnel and wall on the other side. At the far end is the rain shower head and you walk through this tunnel shaped space to take your shower at the far end. There are no doors but there is a step down as you go through this tunnel. Near the beginning of the tunnel are 4 small blue lights built into the shower floor. There is nothing to hold on to, to put soap or shampoo on, or a mat to provide a bit of traction anywhere in this arrangement. Bath towels are as far away from the shower as possible in the bathroom. Lots of decorative items in bathroom including empty crystal lotion dispenser bottle but no mugs to rinse mouth of toothpaste. Very small lift. We only see the hotel personnel using it. It is not worth the wait so we take the stairs but those who need the lift need to take that into consideration.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southampton, Bermuda", "Title": "“Magnificent views!”", "Author": "MaleiaW", "ReviewID": "UR119353946", "Content": "We celebrated my husband's 50th birthday here as part of an 18 day European journey. It was lovely - the staff are very helpful and we enjoyed every minute. Libero welcomed us at breakfast each morning as we savored our espresso overlooking the magnificent Colosseum. An amazing start to the day as no one does coffee like the Italians! Dinner at Aroma was also fantastic and highly recommended!", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Comfortable and Great Boutique Hotel”", "Author": "Ottawan2011", "ReviewID": "UR119237244", "Content": "We stayed at this hotel for three nights in August 2011. We made the reservation through Jetsetter and we were so pleased with our choice. It is literally steps from the Coliseum, the Roman Forum, and the Coliseum Metro stop. Our room had a small foyer and a very large bedroom to the side. The room and bathroom were fully equipped. The bathroom was spotless and very spacious. It had a full size tub with shower and towels were plush. The bed and linens were absolutely immaculate and very comfortable. Nothing better than retreating to a super comfortable bed after a day of walking, site-seeing, shopping and dining in Rome. Make your way to the rooftop terrace for a cocktail. Not to be missed, check out the view from the restaurant. If there are no patrons in the restaurant, the staff will be pleased to take a photo with the Coliseum as your backdrop. It is literally metres away. Unfortunately, our schedule did not allow us to have dinner at the hotel restaurant but from what others have written, it will be on the list for the next visit. All staff that we encountered were extremely courteous and friendly. Everytime we returned or left the hotel we were pleasantly greeted and wished a good day. They readily held doors, offered advice and recommendations, and always with a genuine smile. I would definitely return to this hotel and would confidently recommend it to family and friends without any hesitation.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Magnificent Boutique Hotel in Rome”", "Author": "globbiztravel", "ReviewID": "UR118775628", "Content": "I originally found this hotel on Jetsetter through Gilt. Was my first time choosing a hotel deal through Gilt.com. The prices were 50% less and even at their normal $500 Euro a night - the hotel is a 5 star gem, and one of the best places I have ever stayed. The staff is very attentive and willingness to serve their guests as best possible. Some of the staff remember me by name and others just by facial recognition. The rooms are wonderful. I was upgraded from the classic room to a deluxe room with a direct view of the Collosseum. It is a spectacular view right outside the window. The hotel is very central to some great cafe's and restaurants, which is nice. The area is residential and not very touristy, which is what I prefer. The hotel was built in the 18th century and originally called The Gladiator Hotel and rightfully so, because outside the hotel in front of me, are the ruins of the gladiator housing area. If you stay in Rome you must visit this hotel. Oh before I forget the FOOD is fantastic. The chef is really a true Michelin Star chef. The portions are just right and every meal has been excellent. Ciao", "Date": "September 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Cornelius, North Carolina", "Title": "“Comfy boutique Hotel”", "Author": "Pamela G", "ReviewID": "UR118427454", "Content": "My husband and I stayed for three nights in September. This is a small boutique hotel. Historic property, elegant and very comfortable. We were greeted with a complimentary cocktail on the top floor outside terrace then shown our room where they provided a chilled bottle of proseco. The bar and restaurant upstairs are wonderful and very much enjoyed our breakfast with a fabulous view of the Coliseum. The location is OK for a first visit but need to take a cab to other sites other than ancient Rome. May prefer a different location for future visits. Staff was very accommodating and helpful. Did not dine in the restaurant for other meals as we were dressed casually and could not meet the dress code for dinner.", "Date": "September 21, 2011"}, {"Ratings": {"Location": "3", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "NEW YORK CITY", "Title": "“Great Boutique hotel”", "Author": "RDINNYGO", "ReviewID": "UR118291493", "Content": "Stayed with my husband in June for our 2nd half of our honeymoon. I booked the room through Kiwi collection. Upon arrival Federicka (If I recall correctly) showed us to our room which they upgraded to an amazing colosseum view, and decorated with rose petals, a fruit basket and a bottle of prosecco. The hotel and room was beautifully decorated and comfortable. The staff was very helpful in arranging tourist activities including a guide. Overall great hotel.", "Date": "September 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "United States", "Title": "“Spectacular views. Warm service.”", "Author": "bird1010", "ReviewID": "UR117274809", "Content": "This hotel was perfect for a three day sightseeing tour. The hotel is the former training facility of Gladiators. Breakfast is lovely and the early views are breathtaking. I recommend trying to secure a rate that includes breakfast. The restaurant is good but pricey. We had lunch there one day and best \"club\" I have ever had. But the views are unmatched. We had cocktails after dinner two evenings and the atmosphere was lively and the service was great. Our room had a view of the park across the street and it was lovely and less expensive than the rooms facing the Coliseum. There is a convenience store around the block great for stocking up on waters, snacks, etc. Mini bar is not electronic so you can put your own in which is always nice. We did a Segway tour of the 7 Hills because my husband broke his toe and couldn't walk distances. We loved it! We got to cover much more territory and had a great private guide for 180 Euros. This place is two blocks away from hotel; Rome Segway. If I were going to spend time in Rome again I maybe would stay in Piazza Navona because there is more nightlife, restaurants, etc.. This is perfect for a first time visit to Rome.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toms River", "Title": "“Exceptional”", "Author": "divegurl1971", "ReviewID": "UR116781928", "Content": "Top Notch! I plan to go back with my husband and stay at the same hotel. The bed was comfortable. The bathroom was roomy with a marble tub. The location was superb. I did a lot of research online before I booked my stay and I am truly pleased with this facilityl The service was beyond exceptional. They went out of their way to make you feel welcome and made you a priority. It is a bit pricey but you get what you pay for. The room is not big but plenty for two. Definitely 5 star to our standards.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Greenwich, Connecticut", "Title": "“Small boutique hotel with killer views”", "Author": "travelgirl521", "ReviewID": "UR115877175", "Content": "My husband and I recently stayed at this hotel for a short time - two days. Although we have been to Rome several times, we never visited the Colosseo or the Forum. We selected this hotel because it is a stone's throw from the Colosseo. I mean it - a stone's throw! If you are lucky enough to secure a room with a view, simply open your window and gaze upon the wonder that is the Colosseo. So close you can almost touch it! We arrived at the hotel after taking a red eye from NY. Upon viewing the building from the outside, we issued a collective \"yikes,\" as the building isn't very impressive from the outside. However, once you step inside, things are much, much better. The lobby is quite small (remember, this is a charming little boutique hotel, not the St. Regis) but nicely furnished. The front desk staff is very friendly and accommodating. They sent us up to the bar for a complimentary drink while we waited for our room. The rooftop lounge and restaurant boasts another fantastic view of the Colosseo and Palatine Hill. We decided to have lunch at the rooftop restaurant. It was very pricey (4 star hotels in major cities tend to do this, so it's nothing new), but the food was very good and the overall experience was worth a million bucks. It was the perfect way to welcome us to Rome. After the initial lunch, we steered clear of the pricey rooftop restaurant and dined elsewhere. The hotel's location is wonderful for spending two days visiting the Colosseo, Forum, Palatine Hill, Ludus Magnus, etc. However, it is a little further from the other sights - St. Peter's, etc. This is not a problem if you don't mind taking a cab. However, if you prefer to see Rome on foot, you may want to map out the route to be certain the walking distance is acceptable to you. Also, the hotel is located on a busy street. Several of the rooms, including ours, face the street. We weren't bothered too much by noise as the room appeared to be sufficiently soundproofed. Still, I thought this fact was worth mentioning. If you have the option of selecting a particular room, please, please, please, do yourself a favor and request a room with a view of the Colosseo. You will not be disappointed.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "New York City", "Title": "“Greate Views of Colosseum but out of the way of other sites”", "Author": "marieny524", "ReviewID": "UR115752535", "Content": "We stayed at the Manfredi recently as part of our honeymoon and overall thought it was a great boutique hotel. Our room, although small, had amazing views of the Colosseum. We loved that the staff sprinkled rose petals across our bed in the shape of a heart and throughout the room since it was our honeymoon (they also gave us a bottle of prosecco and fresh fruit - great). We enjoyed the breakfast on the roof terrace again overlooking the beautiful Colosseum. Staff at the front desk seemed a bit overwhelmed but were extremely helpful to us. Part of our package included tickets to the Colosseum and it was truly great not having to wait online to buy the tickets or enter the Colosseum itself. The only con about this hotel is that because it is near the Colosseum, it is quite far from other sights. Although we are New Yorkers and used to living in a big city, Rome was overwhelming to us and we weren't sure what areas were safe. We would've had to cab to pretty much any other restaurants had we not dined in the hotel. If I were going to Rome for a longer period of time (we were only there a day and a half), I would probably have liked to stay at a hotel closer to the beautiful Villa Borghese and the park. Also, I wouldn't eat again at the hotel restaurant for dinner. While the view is unbeatable and the ambiance lovely, the food was extremely overpriced. Overall, if your goal is a short trip to Rome that includes seeing the Colosseum, this would be your best bet.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Manchester UK", "Title": "“Poor Attitude of Front of House Staff, took the shine off a great trip”", "Author": "Jonathan H", "ReviewID": "UR115546938", "Content": "The hotel promised so much.... fantastic location beautiful view over the Colosseum. The main problem with the hotel is the staff, particularly the front of house staff, they just are not that great, instead of nothing being too much trouble, most things are too much trouble! It seems that if it is not in their job description they are happy to just send you to another department in the hotel. The rooms were serviced at odd hours, they phoned our room on two occasions after 10:30pm to let us know what the weather was going to be the next day, just weird!! The rooms were clean, but small, well appointed, with comfy beds. We got the mini bar emptied on day one by the hotel so we could store food we had bought at a supermarket. They still managed to try charge us for three Campari sodas and three orange juices, we neither had nor had the means of having :-) The head chef was a pretty decent guy and helped us with a specific dietary requirement., only after a difficult conversation with a front of house clerk and the manager Giuseppe. All in all thought the hotel was expensive for what it was, and that was without the crummy service. With Crummy service, not a place I would recommend, I'll be staying at the Bosscolo Hotel next time!!! The view from the terrace restaurant was amazing, but that would not be enough to get me back their again.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "2", "Service": "4"}, "AuthorLocation": "Texas", "Title": "“Beautiful hotel as long as the AC is working”", "Author": "DDtravelTexas", "ReviewID": "UR115354847", "Content": "My husband and two adult children stayed one night at the Manfredi. The three rooms were lovely and the staff was very attentive. Unfortunately, our room had been smoked in by a previous guest. The staff sprayed Glade, apologized but had no 'like' room for us to move to. We opened the windows to air out the room which, unbeknownst to us, automatically turned off the AC. Rome can be very hot and humid and with no ventilation or AC this five star hotel room became miserable. The staff brought in a portable AC (of sorts) . The exhaust had to be extended out the window. About the 3 a.m. we finally got comfortable right when street cleaners began to do their job. Needless to say, it was very noisy! It was truly a comedy of errors at a very high price!!! The staff took off a nominal amount of our room rate. Not enough for this experience! European standards are not what we are used to so why not book a quaint 3 star hotel and enjoy it for what it is and save the money and frustration! This was not worth the money. The Manfredi restaurant is fantastic! The view of the Colosseum lit at night, the staff and the food was exceptional. i would revisit the restaurant but skip the hotel!", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "2", "Service": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Nice Hotel - Yet very overpriced!!!”", "Author": "katie6971", "ReviewID": "UR114803614", "Content": "My Husband and I decided to go away for a short trip to celebrate our Birthdays; as it was special we opted for a 5 star Hotel expecting the very best. Although the Hotel was nice and the service was very good it does not justify the price that's charged, its almost robbery!! As an example we had an evening meal for two from the al a carte menu and were charged almost £280!!! The worst thing was the food wasn't really that good! Even the buffet breakfast was 30 euros each. With regards to the actual Hotel its self although it was nice, very clean and located in a wonderful postion there were no facilites at all. Usually with a 5 star Hotel you would expect maybe a Gym, Pool, Spa etc. Here apart from the Restaurant & Bar there was nothing else. The saving grace for this Hotel was the service was impeccable and the location amazing. If you are happy to pay over the odds for this then its a nice place to stay. Rome was wonderful, however we wouldn't choose to stay at this Hotel again.", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great Hotel and Friendly Staff!”", "Author": "Jugernuts", "ReviewID": "UR114734681", "Content": "We just stayed at the Palazzo Manfredi for four nights. They were kind enough to upgrade us to a premium view room for our last two nights since it was our anniversary. We had an amazing time in Rome! The Palazzo Manfredi made our stay very comfortable. They were so helpful with everything from pillows to scooter parking (for our rental) - always with a smile! The location was great too! Right across the street from the Colosseum and walking distance to just about everything. The hotel staff was very warm and inviting, and we can't wait to stay there again. We will definitely be recommending the Palazzo Manfredi to any friends and family that go to Rome.", "Date": "June 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fabulous hotel and staff”", "Author": "VConroy", "ReviewID": "UR113381742", "Content": "My partner and I stayed at the Palazzo Manfredi for 3 nights in mid-June. I chose the hotel because of its location - a stone's throw from the Colosseum and the Roman Forum, which meant we did not have far to go to see the sights. And the rest of Rome is only a 5-minute cab ride away or short walk away. As far as location is concerned, this hotel was perfect for us. From the moment we arrived, the hotel staff did everything they could to make us feel welcome. Our bags were taken to our room and we were escorted to the rooftop bar for a complementary glass of champagne. And although it was part of the package we booked, we were given a bottle of champagne in our room and a basket of fruit which was very welcome after our journey. The free WiFi internet was also very appreciated, as in other hotels of a similar price range, I find I often have to pay for this. The room was very comfortable and quiet despite its proximity to the road, and housekeeping service was excellent. Breakfast at the sunny rooftop restaurant overlooking the Colosseum was priceless! The waiters and waitresses were very attentive and courteous, as were the reception staff, who organised Colosseum tickets for us. Overall, we had a fantastic time in Rome and choosing to stay at this hotel was a large part of it. Would definitely stay there again.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sacramento, California", "Title": "“This hotel is in a great location, provided outstanding service, but was still extremely overpriced.”", "Author": "beckere", "ReviewID": "UR109741613", "Content": "The two outstanding features of this hotel was it's location (literally next to the Colosseum) and the wonderful service. The staff spoke very good English and were friendly and accommodating to every request. From these two perspectives, it was the perfect hotel. The downside was the massive cost to both staying at the hotel and using it's amenities. For a room big enough for 3, the cost turned out to be over $700 per night (in American dollars). The room while nice was not of exceptional quality and certainly not commensurate to the cost. One of our best meals in Italy was lunch at their roof top restaurant gazing at the sites; but when the menus have no prices, it's not surprising that this meal for two turned out to be over $100 (American Dollars) for one course and two sodas. Granted the meal included delicious fresh baked bread and several complimentary tastings from the chef, but still priced so high as to not be viable for another meal during our stay. I don't mind paying for quality, but the costs of everything associated with this hotel just superseded the value to such a point it became detrimental to the overall experience.", "Date": "May 25, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Pomona, California", "Title": "“What a view”", "Author": "Toot18", "ReviewID": "UR108678164", "Content": "Stayed at the Palazzo Manfredi over Palm Sunday weekend. Arrived late and opened window to see the Coliseum lite up. \"Wow\"! Room was a bit larger than the typical European room. Clean and well appointed. Service was superior to most hotel. Location is close to everything by cab (check view and map on web site).", "Date": "May 17, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Hermosa Beach, California", "Title": "“Service is a five star plus!!”", "Author": "hermosabeachlady", "ReviewID": "UR108556397", "Content": "Service with a smile! What a wonderful staff that caters to your every need. I was visiting Rome with my parents and they abided by my request to have two rooms next to each other. We stayed for two nights and my parents had a room with an AMAZING view of the Colosseum. The rooms are elegant, but the glass enclosed atrium where you eat breakfast is truly the gem at this hotel with its own spectacular views of the Colosseum. The staff knows the history of Rome and delights in telling you its history. The hotel is beautiful, but its staff makes it doubly so! No matter what request we made, they we always there to help with a smile. I would go back to this hotel in a heartbeat as it was both elegant and comforting.", "Date": "May 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Absolutely stunning views and fantastic service.”", "Author": "juiced", "ReviewID": "UR107046399", "Content": "I just returned from my stay at hotel Gladiatori Palazzo Manfredi. I'm so enthousiast. These guys just get it. Our stay in Rome was exactly what I was hoping it would be. The weekend was a birthda surprise for my girlfriend, so I wanted it to be perfect. Our room was nice, clean and cozy. I upgraded to a deluxe room with Colosseum view. Just do it! It's worth the money. The breakfast is great, fresh and healthy. The staff did everything to make us feel happy and special. Especially when they made a special birthday cake in the morning for my girlfriend.", "Date": "May 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“fantastic hotel!”", "Author": "stealsw3", "ReviewID": "UR106065844", "Content": "The hotel was exceptional. It deserve the five star rating that it has. Their staff was amazing. the staffdeserves 5 stars. during our stay, my husband and I went on a tour and couldn't find the tour guide. We called the hotel and they sent a staff member over to the touring site to assist us. Now that is first class sevice. The staff made our stay so confortable. They really took care of your every need. Houskeeping went above and beyond at making us feel comfortable in our room. Houskeeping services get 5 stars from me. I absolutely loved all the staff. My only recommendation would be to keep more face towels on hand for the guest. we were only supplied with face towels for 2 out of the 8 days were there. still, I wouldn't take anything away from this hotel. It was exceptional. I would recommend it to anyone for a stay in rome. I love the fact that it was in close proximity to all the main attractions of rome. also, the recommended touring company that they provided was fantastic. We had a ball.", "Date": "April 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Beautiful Hotel with stunning views!”", "Author": "HolRich", "ReviewID": "UR96063157", "Content": "The hotel location is fantastic - my partner and I have had a room with a Colloseum view, incredible to look out at day and night. The room was clean, tidy, stylish and the bed was extremely comfortable. On arrival we were welcomed by helpful and friendly staff + complimentary champagne! The hotels roof top 'Aroma' restaurant was fantastic - breakfast with a sunny stunning view... and of course a night lit colloseum view in the evening. The food by the way was one of the best meals we've ever had, truly exceptional. Hotel Palazzo Manfredi is certainly the best place to stay in Roma!", "Date": "February 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“They simply \"Get it\", Great Hotel and awesome customer service”", "Author": "GavinP12", "ReviewID": "UR95588760", "Content": "First time to rome and i wanted somewhere close to the sights and walking distance from the touristy areas with out all the hustle and bustle and this place was perfect. The first impression is that it is small, but then again everything in europe is smaller than what we are used to in asia and Australia. From the start, we had a very attentive and friendly receptionist and porter who quickly explained everything to us, from breakfast times, closest sights and shopping areas etc.. The room was simply perfect, with views to the colosseum, built directly adjacent the gladiators training site, queen bed, side tables, mock fireplace, coffee table and most importantly a mini bar and nespresso machine! As for the bath room, again the size was a little smaller than what i am used to but it was compensated by the well laid out design and fully furnished with toilet, bidet, bath tub and shower. The shampoo, moisturiser and soap was all Bvulgari which was a pleasant surprise. Breakfast on the rooftop offers a great panoramic view of the colosseum and surrounding streets and gardens. If you have breakfast included, they offer a basket of mixed pastries and bread. Of course if this isn't enough, you can opt for the hot breakfast menu too. Overall, the customer service experienced here was the best we have ever had in europe. These guys get what it means to make you feel welcome and valued as a customer. Highly recommend.", "Date": "February 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Brilliant service, convenient location, excellent rooms”", "Author": "Konstantin_13", "ReviewID": "UR92740275", "Content": "Had indeed very enjoyable stay at Palazzo Manfredi. -Very convenient location (close to Colosseum and Historical Centre - nearly all the places of interest are within walking distance - including Vatican), - Helpful and effective staff, special thanks to Giacomo for his kind assistance and flexible approach). Everyone speaks fluently English, not only the receptionists, but also the porters and waiters. -Cozy rooms with elegant furniture, perfectly decorated. -roof-top restaurant with a view of Colosseum - indeed a perfect place to have breakfast in the morning.", "Date": "January 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Amazing Roman Gem”", "Author": "Drexel3", "ReviewID": "UR91105962", "Content": "When you step into this hotel, you know you have found a well-hidden secret. It has that small boutique and trendy hotel feel, and you get complimentary champagne welcome drinks when you arrive. The location is so close to the Colosseum & the Forum, its amazing for history buffs. A little farther from other tourist sites but its nice to be removed from the ultra touristy areas and Rome really is a very walkable city. Hint: there is another Hotel named Hotel Manfredi so if you are taking a taxi make sure to say Hotel Gladitori Palazzo Manfredi on Via Labicana, or just \"near the Colosseum\" seems to work just as effectively. The hotel is beautiful with marble everywhere, an old-fashioned (yet modern?) elevator with sliding metal doors, and extremely helpful staff. The staff went above and beyond for us. The included breakfast has the most amazing view you have ever seen. Although breakfast includes just breads (rolls, croissants, etc.), it is a nice variety and you can have seconds or even thirds... Also includes great coffee/tea, fresh squeezed OJ, etc, and you can purchase a la carte items as well if you wish (omelette's, etc.). We didn't eat at the restaurant in the hotel as we found some great reasonable ones elsewhere, but we had breakfast inside the restaurant one morning and it looked very nice. Also some lesser known sights nearby include the ruins literally right below the hotel, the park across the street (Parco di Traiano) with the Domus Aurea and the best views of the Colosseum, and the Basilica of San Clemente a block behind the hotel. We loved coming back to this hotel after long days of walking around Rome, and can't wait to stay here again soon.", "Date": "December 30, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Great Hotel”", "Author": "kcourten", "ReviewID": "UR89416574", "Content": "You cannot beat this hotel for location. It is near everything! Also there are lots of great restaurants on the street behind the hotel. The rooms are beautiful and the breakfast is excellent. All the emoloyees go to great lengths to see that your stay is all you want it to be.", "Date": "December 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Finland", "Title": "“Nice hotel but overpriced”", "Author": "mrsFinland", "ReviewID": "UR87246699", "Content": "We stayed for leisure in this hotel. It was nice, but in my opinion overpriced. Rooms are very cosy and deluxe rooms has a fantasitic view to Colosseum. However, a room is small and a bit too noisy due to heavy traffic. A room was also a bit too cool in this time of the year. Service of the hotel is good, but could have been even better. For example a concierge visits to our room were done amazingly late in the evening (at about 9.30 pm) and a breakfast was not completely ready at 7 am, when it should have been. Generally the continental breakfast (bread, butter, jam, juice, coffee), which was included into a room price, was very limited and does not meet the expectations of a 5 star hotel. All other extras were very higly priced. A welcoming drink served to our room was a nice experience.", "Date": "November 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cairo, Georgia", "Title": "“Superb staff and service!”", "Author": "Demoleo", "ReviewID": "UR85572568", "Content": "Very attentive and helpful staff. Amazing rooftop venue for breakfast and sunset drinks overlooking The Colosseum.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Staff was amazing and the view of the Colosseum is priceless.”", "Author": "Dumplinz", "ReviewID": "UR84589312", "Content": "Five star personal experience. We stayed 4 days and by the second day we felt totally at home. Bed was super comfy, service was top notch. We are already looking into their sister location in Capri.", "Date": "October 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ann Arbor, Michigan", "Title": "“Perfect 3 night ending of a journey”", "Author": "MarkHaps", "ReviewID": "UR83767655", "Content": "After our Azamara Holyland cruise.. Mid May '10 (and 10 days on the Nile before that).. My wife and I spent 3 nights in Rome at the Gladiatori Manfredi! What a great place!! You are treated like a movie star... every request is cared for.. breakfast is served overlooking the Colosseum as 1 waiter brings you fresh squezzed OJ and another hands you USA today,, We do allot of traveling in our mid 50's. and this little hotel.. Is a GEM!! Incredible Location.. Check in wasn't till 2.. that was my only beef as we arrived at noon and AE plat didnt help...", "Date": "October 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dallas", "Title": "“Great Small Hotel”", "Author": "dmac44", "ReviewID": "UR83492693", "Content": "The rooms were well appointed and service was friendly and efficient. The front desk personnel were always willing to help with anything. The locatioon is a great alternative to being in the middle of the main tourist area.", "Date": "October 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scottsdale, Arizona", "Title": "“Fantastic boutique hotel, location, staff, and service!!”", "Author": "ScipioAfricanus", "ReviewID": "UR72199221", "Content": "A block from the Colosseum, surrounded by lots of restaurants this is a fantastic hotel. We stayed with our children 8 &11 in a 3rd floor 2 bedroom suite for 4 nights with unparalled views of the Colosseum from every room including the bathroom! Rooms were beautifully appointed, service spectacular and location second to none. I think there are only something like 15 rooms in the whole place so the staff know you whenever they see you and can't do enough to make your stay perfect. It ain't cheap, but it is first class. Lots of restaurants in the neighborhood give you choice of great and different places to eat every meal. We only ate breakfast on the terrace ovelooking the colosseum one morning but did room service several times. Food was great. Stay here.", "Date": "July 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "North East", "Title": "“Superb”", "Author": "Gums", "ReviewID": "UR67795595", "Content": "We had booked a room at a nearby 'luxury' 5 star boutique hotel at the forum but were told (after checking in and our credit card had been swiped) that our room was no longer available and we were to go to a nearby 4 star sister hotel situated in the streets around the statzione. We were not best pleased as this it seemed to us that this was not a reasonable alternative. A 5 star luxury hotel in the pretty safe streets of the forum area were not, it seemed to us, not entirely similar to a 4 star 'contemporary' hotel in the rather more - how would one put it - 'lively' avenues around the station. Eventually, after much gnashing of teeth I found (that is I found it - not the hotel you note) the Gladiatori Hotel on the internet and after a struggle with the manager of the forum hotel over 'issues with the pricing' and the stars and the groups it belonged to we were eventually packed off there. We arrived highly annoyed. Immediately however the excellent staff at the Gladiatori moved to sooth our nerves. We were told we had been upgraded because of what had happened to us and then, after a complimentary glass of bubbles, taken by wonderful old lift to a beautiful room with views directly onto the Colosseum. It had a fabulous bathroom of marble and original plumbing, bvlgari toilettries, and an expresso machine amoungst the more usual 5 star luxuries. The roof top restaurant, where breakfast was served was fantastic with impressive service. We were only sorry we did not have time to sample to gourmet lunches and dinners. The drinks on the roof were expensive but impeccably served with little nibbles made in what was clearly an excellent restaurant. My superb Bloody Mary was exactly as spicy as I like it and helped further in claming me and forgetting the treatment we had at the previous place. This is a class act. It is boutique. It is small. But it is perfectly located and has staff and clearly an ethos of which they should be proud. This now means that the hotel near the forum, and it's sister hotels, will never need trouble itself again with finding us a room. The Gladiatori hotel is the hotel of choice for us when we are next in Rome.", "Date": "June 17, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sweden", "Title": "“High ambitions - low performance”", "Author": "Scaniahelsingb0rg", "ReviewID": "UR67430915", "Content": "This little boutique hotel has a very nice location next to the Colloseum and the Gladiator School. The rooms and lobby as well as other spaces are tastefully decorated and well equipped. The hotel has recently added a restaurant on the roof-top with a Michelin quality chef and an international menu degustation. Consequently there are ambitions to this hotel and the costs equal to these ambitions. Even though the rooms and breakfast are really good and the staff try their best, the comfortable feeling is never really there. On arrival they put us on the roof terrrace for a drink and gave us menus since the room is not ready, with the obvious intention to direct you to the hotel restaurant (which probably is not so well frequented). Such manners are not appropriate at five star hotels and certainly not at this price level. Neither the food nor the prices are what you are looking for when going to Italy and absolutely not the genuine Italian food we were looking for. After a walk on the town when we returned to finally get our room the male receptionist asked if we wanted a room for one night or \"for a cople of hours\". That kind of impolite questions does not get you returning guests, especially att a room rate of more than 400 Euros a night. All in all a decent hotel with quality location which could be a good choice if they happen to have one of their better days.", "Date": "June 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Wonderful experience. Lovely staff. would go back in an instance!”", "Author": "ScotlandCrm", "ReviewID": "UR62171478", "Content": "My husband, son and I booked into the Serpenti Penthouse associated with this hotel. I Would recommend this hotel for its super staff and helpfulness over the difficulties as followed.( Iceland and it's Volcano!!!!) On arriving we were greeted by a glass of champagne and told that our penthouse was not available. We were quickly re directed into a junior suite ( very small ) but probably big for Rome. ( at no extra cost ) Exhausted we quickly accepted and asked for a bed to be made up for our 11 year old. We had a wait a couple of hours for this to happen, but were apologised to profusely for the inconvenience caused and a bottle of champagne and beautiful fruit was left in our room. The bed was very comfortable but you are next to a very, very noisy street with no real way of opening windows due to noise and moped petrol smells. We had a warm night as the A/con didn't seem to work. Beautiful bath with view over Colliseum. Pity the bath plug didn't work either! Next morning we asked to speak to the manager and they instantly offered us the Marco Aurelia suite nearby in a side street. We quickly agreed as it was more room for us with our son. Everything taken care of and we were taken to a lovely apartment with two rooms/ hideaway kitchen and shower/toilet. Perfect. Very clean, crisp and modern. This apartment has a tiny lift too! It is worth remembering that you are in the middle of a residential property and you should expect some noise from people above and next to you. But to be honest the side street was so much quieter than the main road from the previous night we didn't notice much and I am a very light sleeper. We were just delighted and able to cope with the odd bit of foot noise form upstairs and next door. ( Maybe take ear plugs if you are an especially light sleeper!) Enjoyed 6 super nights in the suite. Park, supermarkets and taxis nearby. Plenty of local places to eat. Good location away from the hectic buzz . Night 7, volcano disruption causes us to have to stay another 5 nights. Hotel maintained rate for apartment and allowed us to keep re-booking on a daily basis. They couldn't have been more helpful if they tried! We hadn't used the wifi until the volcano erupted. Be sure to ask the reception for the alice network pass word. It occasionally goes down but the apartment care taker goes into the cupboard and re boots the router. Just ask! Used Shuttle service to and from hotel..... a bit more expensive than taxi but makes it feel a bit more special too. Holiday didn't quite go to plan but thoroughly enjoyed staying at the Marco Aurelia apartments and would most definitely consider going back again!!! But maybe not this week!!!", "Date": "April 22, 2010"}], "HotelInfo": {"Name": "Palazzo Manfredi - Relais & Chateaux", "HotelURL": "/ShowUserReviews-g187791-d1582498-Reviews-Palazzo_Manfredi_Relais_Chateaux-Rome_Lazio.html", "Price": "$369 - $2,349*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Labicana 125</span>, <span class=\"locality\"><span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "1582498", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/dd/a4/ed/aroma-gourmet-restaurant.jpg"}}