{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, UK", "Title": "“Quiet and comfortable for an overnight at the airport”", "Author": "Anon_Brit99", "ReviewID": "UR126051795", "Content": "We stayed overnight at this hotel between international flights, and it was just what we needed. The complimentary shuttle was a little hard to find from the international arrivals (you need to go up one floor), but once we were in the right place it arrived quickly. Then only a 5 minute ride and we were at checkin, a quick and pleasant experience! The room we got was a 2 bedroom ground floor room, very spacious, each room had it's own ensuite bathroom, and the kitchenette was well equipped. It was also pretty quiet considering it's proximity to the airport. Breakfast was also complimentary, and had a good amount of choice from oatmeal and waffles, to hot items and pastries. The quality of the meats was not the highest, but for a free breakfast you get a lot of good food. On checkout we again had next to no wait for the shuttle, all in all a good stay and I would not hesitate to return", "Date": "March 13, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "NP", "Title": "“Just average”", "Author": "Xacuti", "ReviewID": "UR125321407", "Content": "The Residence Inns are among our favourites. That is possibly the reason why I was so disappointed with this property. The property generally is iffy and the rooms are just about average; I don't know what one can say about the service or services without being unkind. By way of comparison, even the sole computer in the 'business center' looked brilliant even though it was non-functional while we were there. Sure, the breakfast was complimentary but could it not have been a wee bit healthier and tastier? There is nothing at this property that will make me return there voluntarily.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Portland, Oregon", "Title": "“Very good option for Miami airport”", "Author": "murphykds", "ReviewID": "UR125102590", "Content": "This is a very nice option within minutes of the Miami airport. We stayed here both before and after a Caribbean trip. It is part of a \"complex\" of Marriott hotels including Courtyard and Marriott. The hotel is well maintained with one of the better RI breakfast buffets--but still way to much use of Styrofoam. The evening social was okay with a couple of healthy options but no wine or soft drinks, only lemonade and beer. The other Marriott hotels have dining options including a Starbucks. Unfortunately, there really isn't a grocery store within a reasonable walking distance. The staff was very nice and the room itself was fairly spacious and clean. You have access to a nice size pool at the Marriott and a very decent workout room at the Courtyard. There is free wifi and a computer in the lobby to print board passes. The airport shuttle is free and very convenient. It runs every 15 minutes from very early in the morning until very late. The location of the hotel is great for the airport but not anything else. You can take the bus into Miami but its a long ride and a taxi is around $40 one way. There are a few restaurants within walking distance but nothing very good. There really isn't anyplace to walk or run. My only complaint is that I left a shoe in the room. When we returned after our trip I expected it to be very easy to retrieve but somehow it was nowhere to be found. Would definitely stay here again.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "aberdeen", "Title": "“Excellent”", "Author": "fourstaronly", "ReviewID": "UR124965061", "Content": "One of three Marriott hotels grouped together. We stayed in a one bedroom suite which was excellent and included a free hot breakfast which was very good. The room was very clean the reception staff excellent. Would recommend this hotel", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Best Hotel Ever!”", "Author": "anshu a", "ReviewID": "UR124601670", "Content": "this is an excellent hotel. The service and the staff are excellent, and the breakfast buffet is awesome!!! we had our baby with us and the staff was great", "Date": "February 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cornelius, North Carolina", "Title": "“Excellent place for pre-cruise passengers”", "Author": "spengle1", "ReviewID": "UR123651872", "Content": "This hotel was typical of Residence Inns in which we have stayed. Rooms were clean and comfortable with small kitchen areas (loved the included microwave popcorn) equipped with coffeemaker, microwave, dishes and utensils. The complimentary breakfast was welcome on the morning of the cruise especially since the location is not near many restaurants. However, close-by are other Marriott affiliated hotels and we had a nice dinner the night we stayed there at the Marriott Hotel just a short walk away. Desk staff was friendly and welcoming. Lobby area was small and not conducive to hanging out there. Shuttle service (paid) to the cruise port was available and on time and we were able to arrive at our cruise ship for early boarding. All in all a nice experience that set the stage for a great cruise vacation", "Date": "January 26, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Clean hotel, weird staff”", "Author": "ali28970", "ReviewID": "UR123516818", "Content": "This hotel is within minutes from the airport and right off the main highways. A bit away from SoBe if that is your main POI. There are a few Marriott properties within the compound and you can take advantage of their facilities like the pool etc. The building is very clean and new, quiet, safe, and very spacious, with a full kitchen and separated living area and bedroom. The staff could use some help, front desk lady can't seem to be be bothered with your requests, and the cleaning lady kept filling up the dishwasher with cups facing upward (?). Some common sense training please!", "Date": "January 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jacksonville, Fl", "Title": "“clean, modern, excellent value for families”", "Author": "nicko591", "ReviewID": "UR122224149", "Content": "We stayed Christmas night on points, and our rooms were very clean and well stocked with supplies. Decor was modern, lobby welcoming, rooms very comfortable. Breakfast buffet was plentiful, and atmosphere was unhurried and uncrowded. Will definitely return here when staying in Miami. Could not hear airplanes at all.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Charlotte, NC", "Title": "“Great stay!!!”", "Author": "more_trips2come", "ReviewID": "UR118366076", "Content": "Leaving out for a cruise so we stayed at this hotel overnight. Everything was PERFECT!!! It was very clean, the mattress was comfy and the decor devine. Reminded us so much of home that we ALMOST didn't want to leave. We love Marriott's Residence Inns. The brand always lives up to our expectations.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Excellent hotel, great airport location”", "Author": "JenniferJK", "ReviewID": "UR118178702", "Content": "I stayed at this hotel with my spouse in August, 2011 after coming back from a trip from South America. There are three Marriott properties at this airport location and the airport pickup went quickly as they come every 15 minutes. We did have to wait about 10 minutes to check in as the one person ahead of us took alot of time and there was apparently not another check in person available. The lobby of the hotel was beautiful and the room and separate bedroom were very large and spacious. This hotel had a large spa and the Marriott next door had a swimming pool which was very warn and clean and also another spa. We had dinner at the next door Marriott sports bar and it was very good. The free breakfast at the Residence Inn was excellent and included hot freshly made breakfast items. Probably one of the most traveler friendly place we have stayed in. There was wired and wireless internet in the rooms, Two flat panel tv's, one in the bedroom and another in the living room and two internet terminals in the lobby, Just nice in every way. Of course, it was more expensive than the other airport hotels we have stayed in (many which are 'dumps'), but we felt it was well worth it.", "Date": "September 15, 2011"}, {"Ratings": {"Location": "3", "Overall": "4.0", "Value": "3", "Service": "2", "Rooms": "5"}, "AuthorLocation": "", "Title": "“really nice, new hotel”", "Author": "mstru", "ReviewID": "UR118080110", "Content": "this hotel is close to the airport, which means, at times you hear the planes passing above. if you like brand new hotels, with spacious rooms, flat screen tvs, and new appliances, this is the place for you!", "Date": "September 13, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Perfect For A Stop-Over”", "Author": "loisnewyork", "ReviewID": "UR118059338", "Content": "We chose the Residence Inn based on other trip advisor reviews and our own research and were happy with our choice. We were staying here as a stop-over between flights and wanted a convenient and relaxing stay, which we got! The airport pick-up was convenient and comfortable, the hotel's staff was friendly and the hotel itself relaxing. The only downside is the neighborhood which isn't the best but we didn't feel uncomfortable when we took a walk to the supermarket during daylight. I'm not sure we would have strolled that far at night. For business or a stop-over I would highly recommend the Residence Inn.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "NYC", "Title": "“Great Weekend Stay !”", "Author": "NYCMommyof2", "ReviewID": "UR117290828", "Content": "Hotel is close to airport, shopping, restaurants and South Beach. This place is clean and has all the amenities you expect from a Marriott . The staff is super nice and extremely helpful. This hotel is also very close to Cooperstown Air-boats for seeing and experiencing the alligators with the family. ( This is always fun for the kids and not expensive ) The free breakfast is quite nice also, serves hot and cold which include pastries, eggs, sausages, bacon and hot and cold cereals to name a few. You won't be disappointed for a free meal. They have a complementary wine hour which is nice too. My family and I stayed for a long weekend and will definitely stay here again.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Quito, Ecuador", "Title": "“Eh... Honestly i have done better at this price”", "Author": "flacalinda", "ReviewID": "UR116323513", "Content": "Pro's: nice property and amenities as it is in a marriot complex with the marriot and the courtyard, so good gym, nice pool, great grassy area for kids, laundry facilities, free wifi, good breakfast, ok dinner available on week days, and free parking if u stay more than 6 nights Con's: AWFULL HOUSEKEEPING, all they do is change out towels and make beds, no vacuum no mopping, no TUB WASHING and i was there 8 days!!!! They don't wash dishes, we even asked manager to clean our room as we brike a glass and i have small children and told her about housekeeping issues and nothing was remedied... Came back to glass on carpet!!!!! Hallways and other common areas poorly hosekept as well. I only stayed here bc my regular hotel was sold out, good bc it included parking and breakfast and let me put 2 rollaways at no charge in room, bad bc for the same price i have stayed at much nicer hotels but they don't include the parking or breakfast or internet for free... Depends on what u prefer... I want cleanliness!!!!", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "England", "Title": "“Convenient for the airport”", "Author": "Joysey", "ReviewID": "UR114612972", "Content": "We stayed here on our first night in Miami. We were jetlagged and decided to avoid paying more than double for a hotel in South Beach where we would just crash out. Shuttle bus leaves at regular intervals from the airport. Check-in took a long time, but we were very pleased with our room. It was a suite - kitchen (with very good appliances), dining area and living area. The bedroom was separate and it had a good size bathroom. Furnishings were modern, contemporary and everything was very clean. The bed was sooo comfortable, temperature in the room was just right, and we all slept extremely well. Breakfast was included in the roon rate - basic, help yourself with plastic cutlery and paper plates but perfectly adequate and set us up for the day ahead. You can use the facilities of the other Marriott hotels in the complex a short walk away - pool, nice restaurant, Starbucks etc.. All in all we had a good stay here. We moved to South Beach for the remainder of our holiday in Miami, but as a better value option for our first jetlagged night and for convenience to the airport, this hotel can't be beaten.", "Date": "June 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stuttgart, Germany", "Title": "“Great way to start a cruise.”", "Author": "Bmanwest", "ReviewID": "UR113615039", "Content": "We booked a cruise out of Miami and chose to start our vacation at the Residence Inn Miami Airport South after reading the comments and suggestions from other Trip Advisor reviews. We were originally looking at hotels on the beach. The Residence Inn rate was half of what the beach front hotels were charging and we got more for our money. The free airport shuttle picked us up and took us to the hotel in less than ten minutes. Our room was very nicely furnished with a kitchen, dining room table, living room section with a 42 inch flat screen television that swiveled around to face the bed or the loveseat, and a desk for the laptop. The queen sized bed had a new mattress and was very comfortable. Everything was clean, the room was quiet, and there was Wi-Fi access with pretty good bandwidth for watching videos. We had no complaints and had a pleasant stay. We rented a car for a day at the neighboring hotel on the property which we were able to leave in the hotel parking lot before we left for our cruise. South Beach, Coconut Grove, and the Dolphin Mall are all within easy driving distance. There is a central swimming pool for the three hotels located between the Courtyard and the Marriott. As other reviewers have noted, you can catch a shuttle from the hotel to the cruise terminal for about ten dollars per person. At the conclusion of our cruise we were unable to get a shuttle back to the hotel from the terminal and wound up flagging down a taxi. As far as the free breakfast goes, it was very basic but did the job. The buffet items included scrambled eggs, bacon, sausage, waffles, toast, bagels, muffins, cereal, coffee, milk, juice, and yogurt. We went early before they ran out of anything. The neighboring Marriott has an upscale restaurant with great seafood dishes, the Courtyard had a Champions Sports Bar, and there is a great Cuban coffee shop with very reasonable prices about one block away. In summary, this hotel is a great staging area for cruises, is very close to the airport, and offers quality lodging at reasonable prices.", "Date": "June 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sterling Heights, Michigan", "Title": "“last night of the trip, came in from key west”", "Author": "rcm862", "ReviewID": "UR98215818", "Content": "My family and I stayed here for one night, party of five, including two teenage boys, my mom, my husband and I. We had a two bedroom suite, it was very nice, I am very picky when it comes to cleanliness, and the room was clean and well planned out, I would definitely stay here again, we were also surprised by a complimentary barbeque dinner, which was good, the complimentary breakfast the next morning had a large assortment of food choices including making your own waffle. I highly recommend this hotel, staff were very friendly and helpful.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "auburn ny", "Title": "“Comfortable, Well-Eqipped Hotel with Excellent Staff”", "Author": "kickerAuburnNy", "ReviewID": "UR94525447", "Content": "Stayed two nights (Jan 13-14) pre-cruise. Free shuttle picked us up at the airport within minutes. We were very kindly upgraded to a two bedroom which was helpful as we were four adults plus a 20 month old. Excellent facilities - they share pools, gyms with neighboring Marriott properties; choice of restaurants. Buffet breakfast was pretty much standard fare, but quite sufficient with numerous hot choices (we stayed in a Sheraton on the way back, paid $12 each for a buffet breakfast that was no better than Residence!). We had pizza (Family Special #1) from Special Pizza, delivered. Also walked about 3/4 miles to a Winn-Dixie, K-Mart, Walgreen's Plaza. Didn't make it this time, but last time in the area ate at La Rosa Cuban Restaurant half mile away. There are several other restaurants within walking distance. I would definitely use this property again. Thanks above all for your hospitality.", "Date": "January 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Berlin, Germany", "Title": "“Great hotel, breakfast catastrophe”", "Author": "JanBerlin", "ReviewID": "UR93852383", "Content": "I stayed here for four nights pre-cruise over New Year's Eve and was delighted with the one bedroom suite. Couldn't have been more spacious, comfortable and quiet (apart from the occasional aircraft flying over, but you must be a ***very*** light sleeper to be bothered by that). Free airport shuttle ran frequently, gated parking was 15 $ a day. Had dinner at \"Cane Fire Grill\" which is located in the Marriott right opposite the hotel and it was fine. Now the ***major*** downpoint: breakfast! This hotel caters to large pre- and post-cruise groups, so one should think, they should be able to handle high breakfast traffic - they are not! When we came down on New Year's morning at 09:30 a. m. (as everybody else did, because - not surprisingly - everybody wants to sleep as long as possible that morning), the buffet was empty: no decaf, no mugs, no china, no silverware, no youghurt, no pastries - nothing! And that stayed this way until the only breakfast attendant around (a young girl who ran front desk otherwise), mercilessly shut the doors to the buffet area at precisely 10:00 a. m. OK, we thought, special day, I will work out better the following days: it did not. Decent restocking never took place or they brainlessly restocked items which were still available, while other \"sold out\" items were not restocked for ages. The whole breakfast area was dirty, tables were not cleared or cleaned - this breakfast ruins the whole impression of the otherwise great hotel. At present, I am staying at Hyatt Summerfield Suites Miami Airport and they know how to run a breakfast buffet: 2-3 breakfast attendents around, instant restocking and cleaning. I gave five points for value because we stayed at a very good special rate, but bottom line: stay here if you like a spacious suite at a decent rate, but, if you stay longer, buy your breakfast stuff at the nearby Publix and have breakfast in your suite.", "Date": "January 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "arkansas", "Title": "“Good for overnight close to airport”", "Author": "cindy412", "ReviewID": "UR93098212", "Content": "We stayed between international flights and were quite pleased. The staff were very friendly and professional. The suite was comfortable, clean and just what we needed. We could have comfortably stayed much longer with the kitchen set up . We did not hear any airport noise and the shuttles worked well. Only comment is that it would be nice if breakfast was slightly earlier than 6:30(6:00maybe). We had to leave earlier to catch 8:30 flight (and barely made it leaving around 6:15 ). Will stay again if in area.", "Date": "January 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Fine for a night or two”", "Author": "washdcvacay", "ReviewID": "UR84777697", "Content": "I stayed here two nights while I was in Miami for work. It is new -- or at least must have been renovated recently. The bed has nice updated bedding, and the kitchen and bathroom had updated appliances. The breakfast buffet was really good and the kitchen staff was friendly and kept things replenished. The front desk staff was a little rude, but that's par for the course in Miami. The area leaves a little something to be desired. It's right by the airport, so its great if you are having a quick stop over, but if you are going to spend any amount of time in Miami, I would pick somewhere closer to the action. Overall I felt the hotel was clean and safe, so it worked for a quick business trip, but if you are looking for a vacation where you can spend a lot of time at your hotel, I would pick somewhere else.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“A nice comfortable place”", "Author": "vegasbaby1957", "ReviewID": "UR84674027", "Content": "Stayed one night at this hotel after returning from a cruise. The hotel was great, nice big clean rooms and friendly staff. They also offer a free lite breakfast. The pool was very small but served the purpose of cooling you off. The other nice thing is it is part of a complete Marriott compound. There is also a Marriott Hotel, Courtyard and Fairfield Inn by Marriott in the area. The Marriott hotel has a nice bar and restaurant and the Courtyard has a great sports bar with a less expensive menu and a nice variety. I had their ribs (full rack) only $18.95. They fell off the bone and were outstanding.", "Date": "October 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Nicest Residence Inn that I've ever stayed in”", "Author": "worldtraveler81", "ReviewID": "UR82619476", "Content": "We travel a lot. Several times a month actually and stay in a lot of hotels. We've stayed in many Residence Inns across the country and this one by far was the nicest. It has a bright, modern lobby with a tropical fish tank, casual furniture, a breakfast dining room and a little place to buy snacks. The rooms are very nice, adorned with wood, a dining room table, microwave, refrigerator, sofa, tv and bed. The rooms were very comfortable and we slept well. The two areas of improvement for the hotel would be the courtesy of the front desk staff and the breakfast. They were running low on most of the food and it was slow to be restocked. The waffle makers were also broken which limited the food selection even more. Should also mention we dined at Champions Sports Bar at the adjacent Courtyard by Marriott property the evening before and really enjoyed it. Service again left a lot to be desired and was painfully slow. Nonetheless, the food was excellent and the location was good.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "BRIGHTON ENGLAND", "Title": "“Excellent Stop Over”", "Author": "TRAVELCHICK48", "ReviewID": "UR78426783", "Content": "This hotel is excellently situated for a stop over near Miami Airport. They include so much more than you might expect from a large chain. Courtesy bus to and from the airport, breakfast (virtually unheard of in US hotels), evening drinks and snack. I could go on, but you should try this establishment for yourselves. Staff are very helpful and courteous, they allowed early check in and late check out, food at the Cane Fire Grille was excellent, everything under one roof you really don't need to go any farther or have a hire car. Rooms are very spacious and comfortable, with small well equipped kitchen, with a nice sitting area. I read in the hotel literature that staff would even do your shopping for no extra fee if you dropped your list at the front desk, I did not avail myself of this service as perhaps it was aimed at longer staying guests, but just an indication of the lengths the hotel go to make your stay extra special. International and Dolphin Malls are about a $25 ride away and worth a visit for last minute shopping.", "Date": "September 6, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "5", "Service": "4"}, "AuthorLocation": "cleveland,ohio", "Title": "“Hotel staff was great except for the...”", "Author": "tayshan1", "ReviewID": "UR72090206", "Content": "Hotel staff was great except for the young lady who checked us in. Rooms were nice and cleaned daily. I was a little upset with paying $15 a day for parking (I miss that small detail when I book the hotel). I would stay here again because the breakfast and social hour were great.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "MÃ¼nchen", "Title": "“Great value - wonderful breakfast buffet”", "Author": "cats_vac", "ReviewID": "UR67153067", "Content": "We used this hotel to just spend one night before going on. It is a really nicely funished appartment type room with a seating area and kitchenette. The breakfast is great. You can bake your own fresh waffles! I mean bake, not toast or reheat old soggy stuff. The pool area belonging to the hotel is almost non existant. There is only a hot tub there but you can walk over to the other hotel and use a big pool there. That could have been cleaned just a bit better, but it was absolutely fine. The stuff floating on the surface was blown in due to the gusty winds and you know, how fast that can happen. Of course, being close to the airport it is kind of noisy because of the air traffic. There is a free computer use in the lobby which we used to tell our family we got there alright.", "Date": "June 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lafayette, Louisiana", "Title": "“great place to stay if traveling with family”", "Author": "Melc33", "ReviewID": "UR66880936", "Content": "it's located on this huge lot that has two other Marriot hotels. You have access to their amenities as well . The breakfast was free however on Monday, Tues, Wed, and every other Thursday you have complimentary dinner. Breakfast was decent We arrived Wed. one hour after dinner ended. Anyway, we had a two bedroom, two bath suite, with a full kitchen. We did not cook although that was our intentions but we were out and about so much didn't have the time. Parking is $15 a day you pay for it after you leave the hotel. It's a nice looking hotel. The lobby was comfortable place to hang out. The rooms were comfortable and the space was large enough where as we stayed out of each others way especially when traveling with two 17 year olds. The automated voice in the elevator it was kinda annoying i'm guessing need for whatever reasons. Hotel staff was friendly and helpful when you had questions about directions and what not.", "Date": "June 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Riverside, California", "Title": "“Best Residence Inn I've been to !”", "Author": "Cinnamoncyndi", "ReviewID": "UR66565274", "Content": "I loved this hotel and everything about it ! Great clean rooms with a supurb layout. Close to airport with free shuttle. Shuttle has good frequency ! I would recommend this hotel to Everyone !! Breakfast is included...", "Date": "June 5, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Naples, Florida", "Title": "“Two bedroom suite is worth it”", "Author": "fly23", "ReviewID": "UR64622054", "Content": "We have two young children and spent the extra money for the two bedroom suite. It was nice having the extra room. The two bedroom suites are good if you have a child that needs to nap and also gives you an extra bathroom. The breakfast was average. Location was convenient for Coral Gables, downtown Miami, and South Beach. Getting in and out was a little strange with the u-turn and not being able to get there right off of the exit. Seemed to be a fairly new hotel in great condition. Would recommend it for the space available in the suites.", "Date": "May 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“This was a deal even for Miami”", "Author": "KatsTMill", "ReviewID": "UR62261488", "Content": "Since my wife has family and friends in Miami we regularly travel to South Florida. Over our past few trips we have learned one important thing: If you are willing to stay near the airport, you will get an infinitely better hotel than on the beach. This was re-enforced when we stayed a week at the Residence Inn by Marriott Miami Airport South. For a $57/night Priceline bid and $15 per day parking we were able to get a large, comfortable room with free internet, a kitchenette, free hot breakfast, and free manager's reception on Monday, Tuesday, and Wednesday evening. By comparison, most of your bottom rate hotels on North Miami Beach (far from the action of South Beach) will charge you at least $80/night before parking with no free food. The room is of worse quality as well. This hotel was a very pleasant surprise. Since we split our time between the beach and family & friends near the University of Miami campus it is the perfect location to avoid traffic on I-95/US-1 as well. We were very pleased with our stay and would definitely return. I even normally think it should be illegal to charge for parking anywhere on the planet, but when you factor in the free breakfast and managers reception (with booze!) it more than makes up for it. The breakfast is even of excellent quality with scrambled eggs, waffles, sausage, oatmeal, fresh fruit, cereal, and many more options. The only caveat is airline noise if you are a light sleeper, but with earplugs I didn't have a problem.", "Date": "April 23, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Italy", "Title": "“Won't return!”", "Author": "None_6565", "ReviewID": "UR60811093", "Content": "My husband and I travel travel frequently and we prefer Marriot's Residence Inn hotels because the offer free hi-speed internet, suites with kitchenette AND because they're supposed to be NO SMOKING HOTELS. This stay on the Residence Inn by Marriott Miami Airport South was a complete delusion. The front desk staff was far from corteous, the room was not particularly clean - we found a toe nail beside de bed (yuck!). One morning we were awaken for a strong cigarette smell that came through the door of the room. We called the front desk to complain and they seemed to be more bothered than interested. This happened two or three times during our stay. We will surely return to Miami, but certainly not to the Residence Inn by Marriott Miami Airport South.", "Date": "April 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Waldorf, Maryland", "Title": "“Clean, Comfortable, Convenient to Jackson Memorial Hospital in Miami, FL.”", "Author": "SUMB44", "ReviewID": "UR60456536", "Content": "I stayed at the Residence Inn by Marriott Miami Airport South from 30 March to 04 April 2010. The purpose of this stay was to be near Jackson Memorial Hospital (University of Miami) when a family member was undergoing medical treatment. I stayed at the Residence Inn with a non-spouse family member. First impressions of the hotel were pretty good with the large, modern lobby, apparent cleanliness and ease of check-in. My relative and I shared a King room which has a separate bedroom and pull out sofa bed. I took the sofa bed, which was surprisingly comfortable. The kitchen was supplied with a modern, clean microwave, full refrigerator, stove top, sink w/ disposal, dishwasher, and some dish ware and utensils. The room was well-maintained and very comfortable. This property appears to be quite near the airport, shuttles are always running. This property is very convenient if you are visiting someone at Jackson Memorial Hospital in Miami. The hospital is a short 10-15 min drive depending on route and traffic. Traffic in this part of Miami was never bad - unless you get caught by an opening draw bridge! My single complaint occurred upon check out. My relative and I wanted to split the bill between us so we asked the front desk and they indicated it wouldn't be a problem and rung it up right there. Later that day my wife called asking why Marriott charged $1100 to our cc? Turns out Marriott didn't do as they said they wood. The charge issue is still open, no resolution yet. Overall, despite the billing SNAFU, I'd still recommend this property for people seeking convenient, clean, comfortable lodging near Jackson Memorial Hospital in Miami, FL.", "Date": "April 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "2"}, "AuthorLocation": "dover nh", "Title": "“One of the Best Hotels I've stayed in”", "Author": "patty6894", "ReviewID": "UR59438894", "Content": "This hotel was brand new, we got a really good deal. It was very clean with not problems at all, excellent ac, kitchen. We felt safe. They had a nice breakfast,, with hot tub good sitting area outside. not much to do in surrounding area without a rental car, then it was convenient to anything. Like a nice island surrounded by a run down neighborhood. As long as you have a rental car this place is a great deal and we highly recommend it.", "Date": "March 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“The perfect airport hotel for resting and recharging”", "Author": "ajinternational", "ReviewID": "UR58561790", "Content": "I was travelling with family and wanted a hotel close to the airport. I booked this hotel so we could all stay together in the same accommodation on our first night in Florida. We took the complimentary shuttle bus from directly outside arrivals at Miami Airport. It was initially a bit confusing as there didnâ€™t seem to be any specific bus stop, and lots of other airport buses were whizzing past. (The shuttle also serves the Marriott and Fairfield Inn hotels on the same site as the Courtyard) Flagging the bus down the second time it came around did the trick! The reception/lounge area was bright and spacious with a modern Mediterranean feel â€“ warm earthy tones and contemporary design. The reception staff were young and professional - check in/out were both dealt with efficiently. I booked a 2 bedroom, 2 bathroom suite. As youâ€™d expect from a quality American hotel, the bedrooms were spacious with large comfortable beds, and well equipped â€“ free wireless internet and a widescreen TV in each of the bed rooms, plus the lounge area too! The suite was clean, the lounge area open plan with a well equipped with a kitchen corner and dining table. We didnâ€™t cook there but there didnâ€™t seem to be enough equipment. The lounge area was fine, but felt a little cramped in comparison to the size of the bedrooms. The bathrooms were also spacious, with good shower pressure and plenty of hot water. We were on the ground floor, with a view of the car park. This wasnâ€™t an issue given the length of time we were staying, and the room was well sound proofed and had effective black out curtains. Thereâ€™s not a restaurant in the hotel but thereâ€™s a Starbucks and a couple of restaurants in the Marriott hotel on the same campus. The hotel does sell a choice selection of drinks and snacks at a reasonable price. A breakfast was included in the rate and was served in the lounge area. Although there wasnâ€™t a huge variety, there was a decent selection with something for everyone, and it was a good kick-start to the day. This was a very good quality airport hotel, and although it was geared up for longer stays, it was ideal for our one night stop over.", "Date": "March 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saskatchewan,", "Title": "“Great place, close to airport!”", "Author": "SeasonedTraveller73", "ReviewID": "UR57271832", "Content": "We stayed for one night so our daughter and friend could get their early flight back home. We found the staff to be very accommodating - we had to drop off some of our luggage a couple of days early so we could fit our daughter's luggage into our rental car and we were treated very well. The front desk staff were very helpful when we checked in. The room was spacious and very clean. The continental breakfast offered a good variety. Our daughter and her friend used the pool at the Marriott and visited the bar there and found the facilities very nice. All iall we had a positive experience.", "Date": "February 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“very good value, free shuttle bus, good choice for breakfast, friendly staff”", "Author": "InTheWorldCec", "ReviewID": "UR54707287", "Content": "I stayed on a Saturday evening in January 2010 during a transit. On check in the check in lady was very friendly and efficent and I was in my very clean room within 5 mins of arrival. You have a choice of places to eat in the other two hotels in the complex. Breakfast was very good with a choice of cereals, hot meals and drinks. There was free internet in the room and a free shuttle bus to the airport. I will definately stay there again when in transit through Miami.", "Date": "January 29, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Blacksburg, VA", "Title": "“Close to airport, easy and cheap transport to Miami Beach”", "Author": "David B", "ReviewID": "UR52399692", "Content": "There are four Marriott properties in close proximity, three of which (Residence Inn, Courtyard, Marriott) are on a \"campus\" with a shared shuttle service to the Miami Airport. There is a Fairfield Inn just outside the campus; whether one can use the shuttle, though, is unknown tome (I think not). Of the three hotels, the Residence Inn is farthest from the highway, which I liked. Despite being close to the airport (5 minutes by shuttle) I was not bothered by noise from flights, which was a relief and a little bit of a surprise considering the proximity. RI properties have a free get together some weeknights. The food was pretty dismal when I was there (badly made chili, likely from a can and an anemic salad), but it was gratis. My room was standard issue Residence Inn. It was clean and the bed was comfortable. It was nice having the other Marriotts so close-by as I drank in the sports bar in the CY and ate dinner in the M. The staff at the CY bar an din the RI hotel were fairly indifferent to customers. It was a little surprising and is an area for definite improvement. That being said, I would stay here again,primarily because it was so easy to get to the airport and also get to Miami Beach cheaply. From the hotel you can ride to the airport every 30 minutes and then catch the 150 bus on the hour and half-hour. Given that the hotel has the same schedule, this gives you 10 or 15 minutes to get from the airport arrivals to the bus station in the airport (take escalator down from the E concourse, cross over traffic, and locate bus station on other side). The fare is $2.30 (day passes are $5.00). It takes 25-30 minutes to get to Miami Beach.", "Date": "January 2, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Bangor, Maine", "Title": "“Great Hotel....Although Could Use Some Good Employees”", "Author": "RegRgr", "ReviewID": "UR51173420", "Content": "Don't get me wrong, this is a great place to stay! The room was very clean and had lots of amenities such as a full size fridge with freezer, microwave, glasses, etc. Very roomy and comfortable with couch and tables. The downside is some of their staff. Latoya, the first desk clerk, was like a robot. No personality and never cracked a smile-we were just a bother to her. My wife went to the pool (which is downer if you like to swim, it's only an oversize jacuzzi) and found a dead frog and dirt so mentioned it to the desk. John, the maintenance guy showed up a little later with a broom, scoop, and a paint roller??? He walked around and then left. We went and sat down outside amongst a pile of sunflower seed shells, cigarette butts and ashes. We brought that to the attention of the desk clerk (not Latoya) and John showed up a short while later. He managed to do a little sweeping on the patio, but never did get the frog! So, if you like to be out on a nice clean patio, this may not be to your liking, BUT THE ROOM WAS OUTSTANDING!", "Date": "December 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "California", "Title": "“Absolutely a Great Experience . . .”", "Author": "CaliforniaMisterEasy", "ReviewID": "UR50014283", "Content": "We stayed 3 nights pre-cruise at the Residence Inn, Miami Airport South. This is a very new (2009) property located in a \"campus-like\" environment, along with a Marriott Hotel and a Marriott Courtyard. The property is about 1.5 miles south of the MIA entrance. A nearby Fairfield Inn & Suites is visible nearby, but is not within this campus. The grounds are well maintained. There is a large swimming pool serving all three properties, as well as a fully equipped central workout facility. The workout facility rivals most membership health/gym clubs I've encountered. There is also a mini workout facility located on the ground floor of the Residence Inn. The recent construction activity is nearing completion, with little sign of any major activity remaining to be performed. The main workout center is now built-out and should satisfy most everyone. The staff here is friendly, competent and welcoming. There are three (3) staff members who have the first name of LaToya. One works in housekeeping and the other two work at the Front Desk. The two LaToyas working at the Front Desk are an absolute delight in their attitude and customer service skills. Other Front Desk staff were also helpful and friendly. Our accommodations were spacious and clean. Housekeeping loaded the dishwasher each morning and when we returned to the room we were ready to again use the plates and utensils. The room had a large flat screen TV on a turntable, making the TV viewable from either the sitting area or the bed. There is a work desk in the room with a phone and internet connection. There is also a two-chair dining table. The bed was up to the usual high standards we've come to expect at Marriott properties, and included a selection of bed pillows that should prove adequate for nearly everyone. During our stay, we visited Champions, the sports bar and watched football games and enjoyed our adult beverages and snacks. The service here was very good. There is also a Starbucks located within the campus, as well as a restaurant, in the other hotel buildings. At the conclusion of our cruise, we again used the Residence Inn for a one-night stay before flying out of Miami the next morning. There is a frequent, free shuttle to and from the airport. The first shuttle to the airport is at 5 a.m. If your have a very early flight a taxi to the airport terminals runs about $8.00 in fares. Keep in mind, as the location of this property states, it is the Residence Inn, AIRPORT South. As such, you WILL hear airplanes taking off from MIA into the night and starting early in the morning. While the property seems well soundproofed, and the windows are dual-glazed, there is little that can be done to silence the noise of aircraft completely. Take that into consideration if you decide to stay here. We did not find the aircraft noise to be a major problem during our time here. The Marriott campus is located on the Miami Transit bus line which you can take into the airport if you wish. At the airport, there is a bus waiting and transfer facility. You can transfer to another bus and ride either into downtown Miami or to South Beach. One point to keep in mind with the Miami bus system is, after Oct. 2009, they no longer issue on-board transfers. Each time you board a bus, the fare is $2.00 for adults, so if your travels take you onto more than one bus, keep this in mind. If you plan to use the Miami bus system you can purchase an \"Easy Pass\" (one for each traveler) through the Miami transit on-line web site and load it with any amount you choose. Then, you can transfer from one bus to another without paying the $2.00 each time. You should try to purchase your Easy Pass on-line before arriving in Miami if possible. We did not purchase an Easy Pass before arriving in Miami and, at this point in time (Nov. 2009), the locations to purchase them are not convenient. While you would think there would be an Easy Pass vending machine at the Airport bus terminal, you would be sorely disappointed. The Easy Pass program seems to have been implemented before sufficient vending machines and sales locations are in place. There is a Hertz Rental Car desk (in the Marriott Hotel) where you can rent a car during your stay. You should also be able to drop off the car at other LOCAL Hertz locations without drop off charges, but ask about this before renting. The entire Marriott campus charges $12.00 per day for parking, so if you have a vehicle, or rent a car, be prepared to pay for each 24-hour parking period.", "Date": "November 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Ljubljana", "Title": "“VAU”", "Author": "Zdenka37", "ReviewID": "UR49428805", "Content": "The best hotel on our trip. Great room, great breakfast, great staff!", "Date": "November 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Very nice....you won't be disappointed”", "Author": "MZBROOKS", "ReviewID": "UR45356286", "Content": "This hotel was just renovated....the decor was very contemporary and the front desk was very accomodating. We had a studio with kitchenette which was more than enough. Breakfast was included which was very nice with a wide variety such as waffles, oatmeal, potatoes,bagels...ec. You won't be let down", "Date": "September 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Nice hotel, but not more than I'd expect from a Marriott”", "Author": "chbruce", "ReviewID": "UR41949262", "Content": "This hotel was nice, but nothing out of the ordinary. I was \"upgraded\" to a suite with an air freshener and hypoallergenic stuff. All the expected amenities were there, but I arrived late and left early, so I didn't really get to experience the hotel. All in all, it was o.k.", "Date": "September 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Suffolk, Virginia", "Title": "“Excellent Room, Centrally Located”", "Author": "Gtravelgirl", "ReviewID": "UR38411284", "Content": "This hotel is brand new and very nice. The decorations are stylish. The hotel is very clean and well kept. Parking is convenient. Get a suite if you can; it was huge with a door on the bedroom. The room has two flat screen TV, a walk-in bathroom, and stainless steel appliances. I had a nice view of the Miami skyline. The hotel is near the airport, and you can hear airplane noise, but it's not that bad. I did not notice airplane noise during the night while sleeping. It's a little tricky to drive into the parking area, and the main Marriott is under construction still, but the hotel is well worth it. Check out the under-used but very nice and new fitness facility in the Courtyard next door. You're also 5 minutes from upscale Coral Gables.", "Date": "August 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "ladygolfer9", "Title": "“Great hotel!!!”", "Author": "ladygolfer9", "ReviewID": "UR35826917", "Content": "This hotel opened up the last week of June. We (party of 6) stayed here from July 17th - 19th (2009). We (4 of us) had a two bedroom/ two bath suite and it was soooo nice & roomy The other two shared a studio w/kitchen. Everything new & well decorated. The kitchen full size with stainless steel appliances that were up to date. Each bedroom had a HD flat screen TV...and also the living room. One bedroom had a king size bed...the other a queen and a sofa bed in the living room. They offered a free breakfast that was fabulous...more than what we had expected. The free shuttle to the airport was great (about 5-min away). The staff was very friendly & helpful, esp Latoya (front desk). This Hotel is shared on the same lot as Airport Marriott & Courtyard Airport South...so you have access to each property. All six us really enjoyed our stay here. It was also quiet & peaceful. Loved the RESIDENCE INN MIAMI AIRPORT SOUTH!!!!! I must mention: they have a nice sice size laundry room. It also has a fitness room and a jaccuzzi outdoors (no pool). You are able to use the pool at the Airport Marriott or Courtyard by Marriott.", "Date": "July 26, 2009"}], "HotelInfo": {"Name": "Residence Inn Miami Airport South", "HotelURL": "/ShowUserReviews-g34438-d1583594-Reviews-Residence_Inn_Miami_Airport_South-Miami_Florida.html", "Price": "$126 - $283*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1201 NW 42nd Avenue</span>, <span class=\"locality\"><span property=\"v:locality\">Miami</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">33126</span></span> </span> </span> </address>", "HotelID": "1583594", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/f9/e1/f9e1c3de62a973f2b80e25686d7e44a56large.jpg"}}