{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manila", "Title": "“Great hotel with excellent customer service”", "Author": "LADYMMC", "ReviewID": "UR128103858", "Content": "With the many hotels in Singapore that I was considering, I chose this place because of the consistent positive feedback from hotel reviewers and its affordable price. True enough, our expectations were even exceeded because of the excellent customer service ;  its accessibility to almost all tourists spots ; very good and clean facilities  and room fixtures ; very good food served by the restaurant.  We are a family of four with 2 children and  we are glad that our requests during booking were all granted. We arrived early at the hotel and were allowed to check-in much earlier. The front desk staff at the third floor were friendly and accommodating and very quick in acting on requests.  We were even assisted in packaging our additional luggage. I can say that excellent service is present in all areas -  entrance/lobby ,  front desk, restaurant. Even the manager and supervisor were assisting personally all the guests.  We are also happy on the tasteful buffet breakfast with many selections and very nice ambience. Most of all, the place is actually at the center of the city with just a few steps from City Hall MRT and several other malls, fast food chains, supermarkets, and tourist spots.  We are all satisfied with this hotel/recreation club. We will surely be back here in our next travel to Singapore.", "Date": "April 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "KL", "Title": "“Very good location!”", "Author": "wct38", "ReviewID": "UR128102885", "Content": "It is right across the road from Raffles City and the MRT is also under Raffles City. So I'd say location is its best point. I walked to the Casino at Marina Bay. It took 15 mins. On the way I passed Marina Square, more shopping places. The breakfast was so-so on first morning and I skipped by the second morning after seeing that it was the same as the first. But, no smell from the swimming pool. Room was of decent size and shower was powerful in a reasonably large bathroom. I liked the in room free wifi and the free use of a desktop and printer at the lobby. I'd definitely stay there again!", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "travelling", "Title": "“Friendly boutique feel”", "Author": "CeeBeePee", "ReviewID": "UR128092277", "Content": "We were so pleased to have found this hotel, bang in the middle of Singapore. The hotel's atmosphere is subdued and friendly, which is welcome after the hub bub that is Singapore. Booking in was very relaxed and professional and the rooms have an inclusive club feel (my husband is already on his way to use the gym and pool). Our room looks over the Padang - a view which is very special - but also means that its really quiet - no traffic noise! The room is very comfortable and set up either for holiday/travellers or business folk. Fast , free wifi and large LCD TV are standard. The western breakfast was very plentiful , varied and tasty ( espresso coffee on demand) We made a mistake with our booking (all our fault) and all the staff went out of their way to help sort it out. Especial thanks to Duncan the manager. We would definitely come again and recommend it to or friends", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newcastle, Australia", "Title": "“A wonderful retreat in Singapore”", "Author": "Pixie_Newcastle_NSW", "ReviewID": "UR128081434", "Content": "For anyone going to Singapore, please consider the Residence at Singapore Recreation Club. It ticks all the boxes in terms of location, value, service, quality, etc. The bedding is divine, the bathroom beautifully appointed, and the room is spacious. Manager Duncan Roberts and his team took special care of us when we visited for a few days in early March, even giving us a free umbrella each (to keep) when we were about to go out in the rain. The personal feel of this place makes it a real \"home away from home\". I will definitely stay again.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, England", "Title": "“Best location in Singapore”", "Author": "Tajine", "ReviewID": "UR127724637", "Content": "The hotel is probably one of the best locations in Singapore, opposite Raffles and several other 5* properties. It’s right on The Padang so request one of the Padang view rooms. This isn’t the normal sort of chain hotel, it’s first and foremost a club with rooms that I assume help fund the club. So you need to be aware you are subject to club rules. Initially this really put me off and made me feel a bit weary. I am after all on holiday. At check in they explain the rules, no shorts in certain area etc. Check in was a breeze and the staff are lovely. The room is in keeping with the club, sort of older style with dark woods and carpet. However I liked the place and I soon forgot about the few rules they impose. For what I paid the room was amazing value and of a very high standard. The view of the Padang rally is incredible. Bathroom was so modern and clean and I liked the nice touches like the orchids in the bathroom. I went to explore and had a drink in one of the bars. The clubs bars weren’t at all for me. They are tired and in real need of renovation. I did use the pool which is great and the breakfast was excellent. I didn’t mind that they serve it in the pool bar. In summary I would have no hesitation in recommending this place and I would most definitely stay again. Top marks for an excellent stay guys!", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Melbourne, VIC", "Title": "“Convenient location & good sized room”", "Author": "Caztanzaa", "ReviewID": "UR127649667", "Content": "The SRC is located just across City Hall MRT station, so going to Orchard Road and to/from the airport is convenient. There's lots of shops & eateries within a couple of minutes walk too. The lobby and the reception look dated, but the room was spacious, clean and modern. We landed at 7am in the morning, so we couldn't check into the room yet, but we were offered to use the shower facilities in their gym. The shower was clean and definitely needed after a long haul flight. Our flight out of Singapore was also late at night and a long one, so I used the shower after checking out in the morning.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manila, Philippines", "Title": "“2Thumbs up!”", "Author": "BijouxLen", "ReviewID": "UR127496794", "Content": "When I knew I was going to Singapore, I checked all the value for money accommodations with great location. I booked at 10 hotels from Agoda booking.com but somehow I was not happy with my selection. It took me two weeks to find this hotel. Thank God there is a Trip Advisor review. With little bit more money to add to my hotel budget, this is \"D\" hotel for me. This hotel is not a typical a high rise hotel. It doesn't have a big lobby with bus load of tourist. It has only 26 rooms.. though it is perfect for me coz I do not like crowded lobby and high rise building. We do have a view of the Pandang field. Residence at SRC is centrally located on the corner of 3 main roads, Stamford Road, Beach road (where Singapore Landmark Raffle Hotel is located) and Connaught Drive a triangle distance to Raffle City (a mall and where you can ride the MRT), Esplanade Mall (Durian Bldg) and Marina Square, You can actually have a pleasant stroll to Marina Bay Sands from this area. Oh by the way, a church is also walking distance to the hotel along Brash Basah Road. Breakfast is very good (buffet) and will rate it 3 1/2. They make perfect egg omelette. One minor flaw is that before you get to the restaurant, (Basement 1) the chlorine smelling hall welcomes you as you open the door to the breakfast dining room. Hotel bathroom is clean modern and it smells good. It has black granite tiles flooring, mosaic and frosted glass walls. It has the amenities of a 4 star hotel! shampoo, toothbrush lotions, etc. I did not check the other areas of the hotel because these areas are mainly for the use of club members but, as a guest, you can access the place provided you follow the dress code requirement of the Club. One tip I would suggest, this location is haven for runners and joggers. Do not forget to bring your running shoes!", "Date": "April 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Victoria, BC", "Title": "“Great location!”", "Author": "rockcrazy", "ReviewID": "UR127256277", "Content": "Four of us stayed here in two twin-rooms for just one night post cruise and picked this hotel based on Tripadvisor reviews. Great location and the taxi driver actually know the place and just a $40 from port. We booked with the same driver for aiport the next day for $50. The Residence At Singapore Recreation Club is just across the street from Raffle City and the City Hall MTR. You can see Marina Bay Sands from the hotel. The rooms were large with very comfortable beds and free WiFi. Bath-rooms are all glass, so need to use the pull-down blinds for privacy. The reception area is on the same floor (3rd Floor), so could be noisy during check in/out. Breakfast is right next to the swimming pool and we did find the food good. By chance, I came across a room on the ground floor with slot machines but didn't go in. Lot of good shopping at Raffle City and we loved the food court. We walked to the Marina and went up to the Singapore Flyer and visited the Marlions. We walked a very short distance and found the Raffle Hotel and the Long Bar. I would definitely return to this hotel when in Singapore. Good value and comfort at a great location!", "Date": "April 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Perfect if you want central Singapore location and don't need a full service hotel”", "Author": "Tweaker108", "ReviewID": "UR126671277", "Content": "Rooms are smart and comfortable. Free wifi was welcome. Staff trying very hard to be helpful. Definitely not a hotel but do you always need one anyway? Great great location; walk to the river, the marina bay, close to raffles city and MRT over the road.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Very good place to stay in central Singapore”", "Author": "Rojomillar", "ReviewID": "UR126479704", "Content": "We had been recommended to stay here as a reasonable alternative to many more expensive hotels near by. It was an excellent room. Comfortable beds and very centrally located in historic Singapore. breakfast was included and we could extend check out until early afternoon.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Wouldnt stay anywhere else in Singapore”", "Author": "betsymarge", "ReviewID": "UR126353518", "Content": "We loved this place. Location is excellent - opposite City Hall Mall and MRT station.(for anyone who is on a gluten free diet like me there is a Waitrose supermarket in the City Hall mall which sells their usual g/f food, albeit at twice the price) We arrived very early as we had just disembarked from a cruise. Reception staff were very helpful and allowed us to check in as soon as a room was available. Our room was one of the larger ones overlooking the Padang. It was well designed and the bathroom had a good shower and lots of space to actually put things. Bed was really comfy. There is a good bar on the 2nd floor which is very reasonably priced. We had our Singapore Sling cocktails there instead of at Raffles (at a third of the price). Breakfast was in the sports club cafe in the basement. Guests can use the club facilities including the indoor swimming pool. If you have a late flight like us you can use the clubs showers (towels provided) All staff from the doormen to the resident manager were friendly and helpful and nothing was too much trouble for any of them. This is a wonderful alternative to the usual large hotel experience.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great place - great location!”", "Author": "ms12341", "ReviewID": "UR126075945", "Content": "Recently stayed at \"The Residence\" for 4 nights on a looong-weekend trip. Great location; if you're travelling by train from the airport, exit at \"City Hall\" cross the road, and you're there!! We love walking so we did a LOT of it over the 4 days in Singapore... Marina Bay, Chinatown, Arab Quarter, Little India... all within comfortable walking distance from \"The Residence\"!! The hotel itself is quite small, 35 rooms or so on the top floor of the Recreation Club. Comfortable room, great bed, quiet, cool bathroom/shower, complicated TV/Cable system but free WiFi. Free newspaper every morning, great friendly and helpful staff. Buffet breakfast was included which suited me just fine - fruit prices went up over thre weekend I emptied the bowls so many times!! The pool is something else... like a cavern with real rock walls, large lane pool, big spa and cool sky/cloud ceiling. Great place to stay!", "Date": "March 14, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Shanghai", "Title": "“Small but ok room, bad breakfast and reception desk”", "Author": "AustinYe", "ReviewID": "UR125832202", "Content": "Check in experience is bad. Arrive around 12:00pm, have to wait till 2:00pm. Lady at reception desk is very rude and cold, almost thought this is some kind of charity to show me the room. Room is small, but designed very well. Only issue is the wall is so think that all night next door's cough could be heard, I bet he was coughing at the bed. Good part, back side of the hotel is a foot ball yard. So it would be very quiet at night. There is a door to outside balcony, very nice sit there at night.", "Date": "March 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great boutique hotel close to large shopping centre”", "Author": "SydneySwan05", "ReviewID": "UR125542498", "Content": "Great location right in the centre of the city next to City Hall. Has a lot of historical value in the area. The shopping centre across the road is large and is above the MRT station. Breakfast was good every morning overlooking a superb pool for the kids - all underground in the basement - looked like batmans cave! Highly recommended.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rotterdam, The Netherlands", "Title": "“Good hotel with nice location for a citytrip visit to singapore!”", "Author": "PatrickBuijs", "ReviewID": "UR125366637", "Content": "After my trip to Vietnam-Cambodia I stayed a few days extra in Singapore (since i flew with Singapore Airlines). I choose this hotel because of the combination of reviews here on this site, price and location. I arrived late on the day but that was no problem, staff friendly and helpfull with checkin. Room was of a decent size modern but with a home feel to it. Great bathroom. Bed was very comfortable! Breakfast was ok. Locationwise no faults! For me everything i wanted to see and visit in Singapore was good to reach walking. Checkout: it was no problem (since i had a late flight back to amsterdam) to leave the luggage there.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great small hotel right in the centre of the city that will not cost the earth”", "Author": "Acwtall", "ReviewID": "UR125118817", "Content": "Great place to stay, small hotel that is part of the sports club. Only has about 20 rooms so you won't get lost. Food was good though the resturant felt a bit drab - not a problem though as I spent all my time sight seeing Main benefit is the location and price are excellent. Would recommend.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "stamford uk", "Title": "“Well placed for Raffles and access to the city”", "Author": "chetz", "ReviewID": "UR124806519", "Content": "This is the third hotel we have stayed in in Singapore,cheaper than TheQuincy and almost the same price as Grand Copthorne Waterfront..it's position on the Padang makes it an easy stroll to Raffles,Raffles City,MRT and into the city,especially Boat Quay.We had to direct the taxi driver from he airport and he did deduct the cost of his missing the turn in and going round the roads twice.As an extension of an historic building our room had great city skyline views...rooms 313 to 326 have this view...the room was compact,the shower area situated three steps higher than the room floor...careful during nihtime visits!....breakfast was a massive disappointment,held in the swimming pool area,not much more than a cafe bar with redundant gaming machines sitting sadly in the corner,poor selection,rarely refilled,coffee machine temperamental,plastic plates...just depressing....hardly set me alight to go out in the city.....the club retains a large local membership so losing a hotel feel in lieu of a sports club/gym atmosphere....we really wished,after going on the cruise later,that e had gone to Copthorne from the start....comparable price,massive rooms,proper breakfasts....oh well,we learn by our mistakes", "Date": "February 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Galway", "Title": "“a cosy retreat in a busy city”", "Author": "deedsGalway", "ReviewID": "UR124429539", "Content": "We spent two nights at this hotel and really liked if for numerous reasons. Firstly, it was small (27 rooms or so) very personal and more importantly, very quiet , an oasis in a busy city. Very well situated overlooking a lovely big park so you did not feel like you were smothered in a concrete jungle and what was so nice was your room opens out onto a communal terrace which I had read in a review a customer did not like because anyone could walk past your roo. This was no problem at all, in our time there we only saw 2 other people sitting quietly outside their own room and we enjoyed the views and outdoor space both nights after touring the city. The buffet breakfast was great and suits both the european and local tastebuds! We will definitely pick this hotel to stay in should we return to Singapore! Bar prices were so much more affordable than other establishments in the area!", "Date": "February 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Epsom, United Kingdom", "Title": "“great room, great location, good value for money!”", "Author": "Rupa R", "ReviewID": "UR124224882", "Content": "The hotel is in a perfect location, very close to restaurants, shopping, sights and most importantly the MRT. The hotel can be easily missed but has to be one of the best hotels we have ever stayed and is value for money. We arrived very early with a young baby and the staff were extremely helpful and friendly. They arranged an early check in and a baby cot in our room within minutes - this was fantastic as our little man was definitely ready for a nap. The room and bathroom were spacious, plenty of room to leave our buggy and cases. The room, service, facilties and breakfast exceeded all our expectations. This is a little hidden gem that could be missed, we would definitely recommend to our friends and family and would stay there again.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“As good as the reviews suggest”", "Author": "CantonaForever", "ReviewID": "UR123988628", "Content": "Previous reviews on this site convinced me to book and stay at this hotel. It was really very good! I've stayed in Singapore many times but this was the best experience I have had and I think one of the key factors is the warmth of the staff. They were all very personable, helpful, and warm. The hotel itself is small, just one level of the recreation club's building. Also the reception is on level 3, not the entry level. But none of these things are really important when you think of the great central location, the reasonable (for Singapore) cost, and the ability to use all the club's facilities (swimming pool, 10-pin bowling, cafes and bars). My kids loved the pool and the breakfast buffet, and after a day out sightseeing we often ate at the excellent poolside cafe rather than have to go out again for dinner. The meals were decent and cheap. It's worth bearing in mind that if you wish to use the club facilities on levels 1 and 2 there is a dress code in place. No such dress code for the other floors though. Nice clean rooms, and very close to the City Hall MRT station. Recommended.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Malaga, Spain", "Title": "“Great for a stopover”", "Author": "Kathy Y", "ReviewID": "UR123605442", "Content": "The residence is a little hidden gem in a perfect location, there are so many hotels to choose from in Singapore it is difficult to pick one unless you have been before. My partner and I stopped over for 2 nights on our way back from Lombok, we arrived late and caught the MRT from the Airport which was really easy and very safe, the hotel is right opposite the MRT station at City Hall, they only have a few rooms but they were clean , spacious and ours had a great view of the Singapore skyline, I would defiantly stay there again, great value for money.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“perfect location”", "Author": "satori99", "ReviewID": "UR123001337", "Content": "I have to say, i almost feel reluctant to write a review, as I would love this hotel to be my secret place in Singapore... Ok, bad things first. I hate CLUBS, British Clubs, and their snobby feeling. And certainly when you get to the reception, you are very tempted to walk out. It's super outdated, super in need of some tidying up and it really feels like you landed in a true nightmare place. But how come then everybody loves this place? Simple: the rooms are amazing. they are very clean, very spacious, and quite modern. The water from the shower actually works!!! And secondly, the location. It's not far from the airport, it's not far from the city. It's right where you want to be if you like shopping. At least, it's where I shop when in Singapore and it's very easy to get to. Basically, close your eyes, till you are inside the bedroom. Would stay always there!", "Date": "January 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Norwich UK", "Title": "“Good hotel with great location, slightly quirky”", "Author": "teddytnorwich", "ReviewID": "UR122990514", "Content": "Central, in nice old colonial building, good breakfast, excellent value. We were very pleased with this hotel. For the very reasonable price paid it is in an excellent position and the old colonial recreation club building is delightful. With a limited number of rooms the hotel may lack some of the additional facilities found in top class hotels but this did not affect our stay at all. We found it to be perfect for the short stay stopover we had in Singapore. Our room, 307 did not overlook the Padand but was perfectly respectable and quiet enough and of a good size for a city centre position.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wales", "Title": "“An easy walk or subway to everywhere.”", "Author": "FiftyishWales", "ReviewID": "UR122763630", "Content": "This was a great find, we were upgraded to the Presidents suite so found the room quite spacious. The views over the park land and to Marina Sands was a plus. Breakfast, included in the room rate, was just OK. To eat go across the road to The Raffles City Shopping complex; plenty of choice. The Residence is an easy walk to most places. If you can get a good price you will not be disappointed.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“Convenient and definitely return”", "Author": "MeiMeiMee", "ReviewID": "UR122455975", "Content": "This place, local Singaporeans don't know that SRC has providing accommodation. Location is superb for any event like firework on new year eve as you can see from The 3rd floor of the club (same floor as the accommodation). The room is clean and nice. Staffs are friendly. So overall, I love this place.", "Date": "January 3, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "UK", "Title": "“Great location, great price!”", "Author": "John_in_UK", "ReviewID": "UR122443513", "Content": "With a location near to the City Hall MRT station, the Residence is a great base for exploring the city on foot or by public transport. We arrived in a raging tropical storm, but the taxi driver had no trouble finding the place and - on pulling up - staff efficiently handled our bags and ushered us up to the 3rd floor where the rooms are located. We enjoyed the Residence - it has a lovely club feel, recreational facilities including a gym and a large pool in the basement (if you want them), very reasonable bar prices in the club's lounge, and very reasonable room rates compared to traditional hotels in the surrounding area. Our room had a fairly compact floor area but the glass-walled bathroom and high ceiling gave the room a nice spacious feel. Breakfast in the basement pool cafe was very good - eggs cooked to order and a good range of Western & Asian items. As this is a private members club, I was unsure if we would be hit for a club membership fee on arrival but this isn't the case - the room rates are what you pay. I agree this place probably isn't suitable for families. We would definitely stay here again. The taxi fare direct from the airport was only S$20 - it really wasn't worth the hassle of taking the MRT and then finding the right City Hall exit while struggling with luggage.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“Amazing view!”", "Author": "alibongo28", "ReviewID": "UR122368494", "Content": "We arrived during the evening and were allocated a room overlooking the sports fields at the back of the Club. The view was amazing! Our room was better than expected, given the reviews and the bathroom was a very modern design. The room decor could be described as dated, but was in keeping with the charachter of the Recreation Club and was quite new. The breakfast was good and was included in the price of the accommodation and when we left early we were offered a packed alternative, which was more than enough to take to the airport. The only downside was that we didn't see much of the Recreation Club itself due to the dress code, but everything seemed very expensive anyway. The location, close to the Raffles Hotel and overlooking the Cricket Club was was within walking distance of most of the attractions and we would definitely return.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Guadalajara, Mexico", "Title": "“Great location”", "Author": "David L", "ReviewID": "UR122319849", "Content": "Located within a pleasant walking distance of the new marina, the colonial era architecture and the ultra modern financial district, location is the selling point. Beyond the location we found the rooms to be comfortable, breakfast was OK though not much variety. The hotel seems to have been an afterthought, the building is primarily a sports centre, and the need to pass by the training gym, complete with people training, to get to the breakfast area is a little strange. Overall a decent place though other options in the area at similar pricing levels we feel are more attractive given they would be dedicated hotels rather than odd mix.", "Date": "December 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Comfortable and central, bit noisy”", "Author": "Dreamer101Sydney", "ReviewID": "UR121260873", "Content": "My partner and I used this as a stopover hotel to explore Singapore. It is worth getting a map of where this hotel is located as it is not well known. It is in a fantastic central location, everything is within walking distance. There is a highly chlorinated pool so goggles are essential. The pool is awesome especially after a long plane journey, and if your room is not ready they let you use the pool and amenities so you can refresh yourself and go exploring. (They also give you a fresh towel). The rooms are very comfortable and nicely decorated. I would stay here again. Eat in China town, avoid marina bay and the wharf as it is so expensive compared to China Town. Our first meal cost us $150 for a main and a cocktail each and we had the same in China town for $20. So beware and do your maths. Also some restaurants have \"siesta\" and we found that when we trudged for ages to find crab and it was closed. Also take a rain mac and umbrella. Try and work out the underground walkways to stay dry. Singapore is safe. This is air conditioned. Essential in Singapore.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bangkok", "Title": "“A Surprisingly Pleasant Alternative to the big Chain Hotels”", "Author": "Fountainhall", "ReviewID": "UR121119881", "Content": "As rates for the established hotels in Singapore just get higher and higher, even booking months in advance brings little in the way of savings. Visiting last week to see Kevin Spacey in Richard III, I had decided to cut the stay to just one night - until I read about this hotel very close to the Esplanade Theatres and its much more reasonable rates. So my one night became two! As others have noted, this is not a hotel; it is the top floor of the very low rise Recreation Club. Try to get a room on the Padang side. Not only do you avoid traffic noise, you will have a wonderful view of the early morning sun hitting the business district behind the Padang. I had no problem with the size of the room. The shower room may be smallish (no bath), but the bed was extremely comfortable, there was a more than reasonable amount of space, and lots of storage areas. I did find the breakfast selection slightly disappointing (limited egg selection, no low-fat milk etc.). Also, it is taken in the coffee shop next to the basement indoor pool and fitness centre. Consequently, there is a fairly pronounced smell of chlorine. I noticed that there are Club activities on several nights of the week and was concerned that these might prove disturbing. But all events seem to finish by 23:00 and I never noticed a sound! In fact, I loved the peace and quiet of The Residence. But my own preference would be for the internet to be included in the price instead of breakfast. I’d then make the 2-minute walk over to Raffles City where there are several breakfast choices! All in all, though, I enjoyed my stay and will definitely stay again.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "canada", "Title": "“info to help you choose”", "Author": "valueaddedCanada", "ReviewID": "UR120938388", "Content": "Stayed in the Residence 2 nights and Royal Plaza on Scotts for 2 nights. Price about $35 SGD less per night at Residence. Royal Plaza had free WIFI and well-stocked free mini-bar; Residence had free buffet breakfast- no free WIFI anywhere (not even in lobby). Agree with most recent reviewers- well located, clean hotel. And yes, the taxi driver did not know where to drop us off, even with the address. The driver tried to drop us off at the Singapore Cricket Club - which also faces the Padang. The residence's front door actually faces Stamford Road, not Connaught Drive. Thanks to other reviewers, we knew that we should not get out at the Singapore Cricket Club. The residence is on the third floor of the Singapore Recreation Club. Therefore, the reception (check in) is on the third floor. You do not need to follow the dress code for the third floor or for the ground floor (street level) or for the breakfast room, which is in the lower basement level. 1. Room: Rooms vary in size. Most rooms facing the Padang have one double bed. Twin rooms are usually facing the street (Stamford Road). Since I was given one double bed room facing the Padang, but had asked for a twin room, the hotel gave us a roll-away bed for my son at no cost. It was very tight but quieter than the twin rooms facing Stamford Road. The room design is unusual. The entry way has the bathroom and closet. The sleeping area is \"sunken,\" accessible by walking down a couple of steps. The bathroom in #319 is frosted glass with pull down shades to give you privacy. Ironing board, kettle, coffee maker and mini fridge are nice touches. The beds, including the rollaway, while not pillow-topped were the most comfortable in our trip through Asia (more comfy than Royal Plaza on Scotts, Peninsula Hong Kong and Kowloon Shangri-la). Asians seem to prefer very firm beds, often rock hard. 2. Location and getting around: Singapore's underground/subway system is efficient, clean, easy to use and very safe. Purchased a two day unlimited pass at City Hall MRT station. The station is across Stamford Road (controlled intersection), about a 5 minute walk from the Residence. Conveniently close MRT stations are important because the heat and humidity can make walking very uncomfortable. The station is attached to Raffles City Mall. You can access Esplanade MRT by walking through Raffles City Mall. You can get to the Singapore Flyer by taking the Circle Line at Esplanade MRT (one stop). At City Hall MTR, you can get to the fabulous Singapore Zoo (with a bus transfer). Staff were very helpful in getting us a taxi to the airport. 3. Noise: No problems. Our room was right across from the reception desk. I kept the air-conditioning fan on to drown out any noise. Our stay was on Wed/Thurs. No matches on the Padang and no parties in the Club- otherwise it may have been noisy. 3. Food: Had breakfast once in hotel. Food just OK but lots of choice. Service was excellent. There are at least two food floors/food courts in Raffles City Mall (lower level and level 3-4) - all kinds of food available. Buy your juices/drinks at 7-Eleven - much cheaper. I would stay at the Residence again.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Excellent place to stay”", "Author": "223Katharine", "ReviewID": "UR120848201", "Content": "Stayed here for our last night in Singapore. Very nice but not as well located as the Carlton where we moved from. However it had a much friendlier atmosphere and staff were exceptional. Loved Singapore so clean and safe. Lots to see and do.", "Date": "November 21, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Good value”", "Author": "Noren17", "ReviewID": "UR120807373", "Content": "I am originally from Singapore so whenever I make a trip back I pick a place closest to my needs. As I was catching a play at The Esplanade I picked this hotel. It used to be a colonial recreation club known for its sporting activities. It has lost its old world charm as the beautiful veranda overlooking the Padang (field) has now become an enclosed Chinese restaurant. the only place to view the games on the field is a narrow patio reserved more for smokers. Or unless you book a room facing the field. Nevertheless, the hotel itself is small, cosy and the rooms were luxurious enough considering at is it mainly a sports club for members. The best part is its location. It's near good shopping, food, the train station which takes you everywhere, all within walking distance. It's excellent if you're there on business as it's close to the central business district. And if you're a health buff, the gym is prob better equipped than most hotels as it is a sports club. The swimming pool is indoors and there are saunas, even separate ones for females. The price is good value considering it's smack dab in the heart of town. The food is not fantastic but it is so near many good eateries at you probably wouldn't be eating in except for breakfast which was reasonable. If you live the theatre you can't beat The Esplanade which is just across the road. Although it's on the third floor and my room was facing the road and not the field, it was not at all noisy. Definitely enjoyed my stay there. Book early though as there are only 26 rooms. I tried to book for new year's eve but it was already fully booked.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stavanger, Norway", "Title": "“Fantastic location”", "Author": "Sverob", "ReviewID": "UR120774134", "Content": "A small and friendly hotel with good standard. Reasonable priced. The hotel is part of the Singapore Recreation Club and is located in a historic elegant building. Fantastic location at the Padang. Walking distance to all tourist destinations in the city. The subway can easily be used to and from the airport, the price is only 2 SGD for a one way ticket. 3 minutes' walk time between the hotel and the nearest subway station (City hall). At the City hall, it is a good hawker centre that can be used when you want good, affordable food. The reception is located on the third floor. The staff is friendly and helpful. The rooms are of good standard with nice views. A small fridge in the room can be used to store beverages. Unfortunately, no wireless internet is included in the price. The swimming pool area could be used for free. Can also use the shower and pool facilities after check-out if one has late departure from Singapore. Good breakfast included in room rate. The hotel offers great value for money.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Adelaide", "Title": "“Great location, great service.”", "Author": "JSmith7", "ReviewID": "UR120720840", "Content": "We stayed here for 5 nights during our first holiday to Singapore. We chose this hotel based on other reviews on Trip Advisor, and were not disappointed. The location was great, within walking distance of many tourist attractions like Fort Canning Park, Boat and Clarke Quays, Orchard Road and more. We were also diagonally opposite the Town Hall MRT station, which made travel to more distant locations very simple. Our room overlooking the Padang was quiet, spacious, clean and modern. Our only complaint - and very minor - is that the mirror in the bathroom is poorly lit. The staff were very friendly and nothing was too much trouble. We liked the fact that the hotel is small enough for the staff to get to know us, yet just as luxurious as some of the bigger, more impersonal hotels. Apart from breakfast (buffet style with lots of choice), we did not eat at the Hotel, but we did visit the Barker lounge for drinks and that was great.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Centrally located, excellent!”", "Author": "adektuty", "ReviewID": "UR120493599", "Content": "I stayed here for four nights and have no complaints at all about the room size. Even the breakfast spread is adequate (I'm a Muslim and there were a lot of things I couldn't eat but I still think the spread is reasonable). My only complaints are the steps in the room (not a major issue actually) and the apparently thin wall for I could hear the snores of my neighbour almost every night!", "Date": "November 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Excellent location, standard hotel”", "Author": "femme_manille", "ReviewID": "UR120325191", "Content": "The hotel's location is its best selling point, and considering prices of other hotel rooms within the area, this is very good value for money. It is very close to the subway station (City Hall), shopping malls, and is just a 15-minute walk to the Marina Bay Sands, and other monuments and museums located along the river.The room was clean, the bed and pillows were comfortable though there was nothing really luxurious about the room itself, ours was smallish though compensated by the fact that it overlooked the Padang. The walls were also a bit thin, we could hear voices from the occupants of the next room.The bathroom was small, too, and it is a bit of a squeeze for two persons needing to use the mirror.There is one public computer in the reception area though internet access and WiFi is not free. Breakfast is very so-so, not much choices and the quality of the food was disappointing. The reception staff were efficient, but obviously need a bit of training in being more welcoming and friendly. They had a stern and unsmiling look, so that every time we needed something, we felt like we were intruding. As the hotel services are just part of the recreation club, which is very much an active one, staying there provides a small glimpse of how the country's local elite spend their leisure hours. It is a vestige of colonial-times Singapore, so there is something romantic and old-gentlemanly about the place. Delivery of the morning paper on the door every day was a nice touch. Overall, though the place is nothing so remarkable, still a good choice.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“A real gem”", "Author": "suerabbitt", "ReviewID": "UR120151308", "Content": "We recently stayed in the Residence on a short stop over in Singapore after reading reviews on Trip Advisor. We were delighted with the location, so central and an easy walk to most places or to the MRT for more distant trips, ideal for sightseeing and shopping. The room was clean, comfortable and well appointed and looked out over the padang, a welcome piece of green in the centre of the city. The staff were helpful and very polite and public areas were nice. Breakfast at the pool bar was included in the price, not a luxury hotel dining room but there was a good choice of quality food as good as you would get in most good hotels and the staff were very attentive. We looked at many hotels before choosing this one and I did not find any other accommodation of this quality at this price anywhere in the city. Location was prime for us as we were only staying two days but quality at a reasonable price it certainly is!! We will be back and would not hesitate to recommend this place to anyone.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Queensland Australia", "Title": "“Perfect location”", "Author": "deniseo_7", "ReviewID": "UR119787641", "Content": "The residence is the perfect location close to all attractions, Raffles, MRT, Hop on Hop off bus stop and easy walking to river cruise. Raffles City which is across a busy intersection has a great eatery, especially the Japanese, be prepared to wait for a table it is popular but worth the wait, easy selection with photo menu and tick box order form. If you hang out for coffee, there is Starbucks also across the road (not perfect coffee but acceptable) Our room was well thought out, with a fresh Singapore Orchid in bathroom and torch near safe for emergency, docking station alarm and full room width window with approp. curtains. A home away from home feel.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“excellent location”", "Author": "jmv72", "ReviewID": "UR119617350", "Content": "Excellent location for walking to all sights (if you don't mind exploring on foot), including Little India and Chinatown. Great location for shopping and eating. The room was great, I had a room at the back and had a beautiful view of the city and the casino. The breakfast was OK and the all the staff were friendly. I didn't realise there was a dress code, and wasn't sure if I could get away with wearing my flip flops to go outside. Reasonably priced and I would consider staying there again. Keep in mind there is a switch for the hot water heater or you will be having a cold shower like I did the first day.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Perth", "Title": "“Excellent location”", "Author": "Janulik", "ReviewID": "UR118689199", "Content": "We have stayed here during the Formula 1 preparation 19th - 23rd September 2011. Our room overlooked the Padang with view over the city skyline, which was obstructed by the podium for Linkin Park. The usual 2 minutes walk from MRT City Hall took much longer due to roads closures but we didn't mind any of this. The location was excellent, short walk from MRT(both red and green lines), Raffles City shopping centre with a good selection of shops and restaurants. If you don't mind walking you can walk all the way to the Theatres on the Bay, the Merlion or Clarke Quay, we walked all the way to the Flyer...but that was a long walk! Our room was very clean with ipod dock and LCD TV with the usual cable TV channels, coffee/tea making facilities and a mini fridge, 2 bottles of complimentary water were included. Bathroom was small but very clean, hairdryer included, 2 bottles of each shampoo, body lotion and shower gel, toothbrushes, cotton buds, shower caps and soap. There were fresh orchids in the bathroom which was a lovely touch. The shower wall facing the room was made from frosted glass but was not see throug. If you were concerned there were blinds you could use. The bed was very comfortable and despite there weren't sheets to use as covers the quilts covers were extremely clean and I am sure they were fresh for each guest (you don't get sheets to cover yourself anywhere in Europe, everyone uses quilts as covers only). The noise was not a problem, there was some music practice on the last night but this didn't bother us as it stopped before we went to bed. Some rooms facing the Padang had shared balcony but ours No 319 didn't have a balcony so privacy was not a problem. The actual Club was a bit dark especially the third floor where the little reception area was. The staff were very friendly and extremely helpful. The included breakfast was OK, pastries, toast, the usual ham, bacon, sausages, beans...fresh fruit, vegetables with noodles, yoghurts, cakes, choice of two juices which changed daily, coffee, tea, fresh milk with different cereals. The setting was a bit dated but clean. You get what you paid for, this is a very cheap hotel in an excellent location. We visit Singapore three times a year or so and have stayed in other hotels including the Marina Bay Sands Hotel. You can't compare this little hotel to 5 star hotels, yet again you pay so much less. I would definitely stay here again and already thinking about staying here this time next year for the Formula 1 as this year we didn't manage to see the actual training or/and the race but the preparations were rather exciting :)", "Date": "September 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“my club, my best recommendation!”", "Author": "GoAllPlaces", "ReviewID": "UR118653970", "Content": "I had been a lady member here. I had placed all my foreign visitors in this hotel. Small, neat and in a fantastic location as Fairmont and Swissotel, minus that hefty bill :) Free access to the gym . Restaurants like Padang Palace and the pool side cafet offers great local/western/chinese cuisine at affordable prices", "Date": "September 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Great hospitality”", "Author": "gsk2007", "ReviewID": "UR118600783", "Content": "Booked this hotel for the F1 Singapore Grand Prix and it certainly did not disappoint me. The hospitality is 5-star! Likes: 1. Dedicated service. There was consistent good service by all staff members, ranging from the front desk to the cafe waiting staff. In particular, Duncan Roberts, the Residence Manager, stood out for his friendliness and helpfulness. He didn't put on airs and came across as a down-to-earth chap who worked hand-in-hand with his staff to bring the best for all hotel guests. 2. Cosy room atmosphere. The room gave me a 'home away from home' experience and the decor is modern, warm and elegant. Request for a room with an adjoining balcony/terrace where available. It offers a spectacular view of the Padang and the Marina Bay skyline, including the Esplanade and Marina Bay Sands. 3. Fantastic location. Located right in the heart of the city, The Residence is within walking distance of all major attractions in town. For F1 fans, you will be pleased to know that the rooftop terrace is opened for all hotel guests during the race and you can get a perfect bird's eye view of Turn Number 9 of the circuit. 4. Gastronomic Paradise. The food variety at the Poolside Cafe is excellent. There's bound to be something for everyone - from local delights like Laksa to international favourites like Carbonara. Buffet beakfast had a good spread and will certainly suit every tastebud. 5. Full hotel facilities. If you want to sweat it out after a hearty meal at the cafe, there's a fully equipped gym. For those who want a relaxing swim, there's also a subterranean pool (according to the management, it's the only one in Singapore!) waiting for you. Room for improvement: 1. The flow of water from the shower head is not powerful enough, at least in the room which I stayed in. 2. Staff members, who were eager to clear up the mess created by SRC members and hotel guests at the rooftop terrace after the F1 race, were a little rowdy whilst doing their job. As the cleaning took place past 12 midnight, it was a little annoying especially when you want to get a good sleep after having glued yourself to the race earlier on in the evening. All in all, the stay at The Residence had been a pleasant one and I look forward to staying there again at next year's grand prix. :)", "Date": "September 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Surfers Paradise, Australia", "Title": "“Unbeatable location and good value for money”", "Author": "sayermd", "ReviewID": "UR118519167", "Content": "Just spent 3 days (20-Sep thru 23-Sep, 2011) at the Residence @SRC, and can honestly say that the location is ideal. This time we were there, they were setting up the F1 Formula One Grand Prix, so streets were closed off, access was very difficult, but the staff at SRC were willing to do anything to make the stay comfortable. It's NOT like a 5-star place that other reviews have alluded to. If you believe that, you'll be sorely dissapointed. It's clean, bathrooms have been recently renovated (marble, etc) albeit small (only 1 person at a time), and my only gripes with the room are these: (1) only a flat sheet (so you have to use the bed cover to cover yourself -- and I'm sure this cover can't be cleaned every visitor switch); (2) wood panelling in room is very dated; (3) terrace off room is public and frequently occupied. This means you *cannot* open your curtains every without everyone peering in, also noisy; (4) walls paper-thin - we could here every verbose word spoken on the telephone from the adjoining room. And we were in a DELUXE double overlooking Padang. Potentially, if it wasn't F1-Grand Prix weekend, it may have been less noisy. However, our room was also the \"President Room 326\", so expectation was a tad higher than normal when we saw this -- but we only paid for a \"deluxe double\" and had a request in for a room overlooking Padang. Room did, however have an iPod dock, a Samsung LCD wall-hung tv with cable-tv (star-hub). Check-in and check-out very easy and staff lovely. Breakfast buffet average, but Pool Cafe very run-down (as is the pool area). That being said, the bathroom amenities are very 5-star, and, for the price, you CANNOT get anything like that for this location!", "Date": "September 24, 2011"}, {"Ratings": {"Location": "5", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Location great, hotel just average”", "Author": "H-J-Bham", "ReviewID": "UR118249419", "Content": "We stayed here for 3 nights in September. Hotel is on a busy road on one side and over looking Padang park on the other side. MRT station is just across the road, 2 mins walk. We walked to Marina Bay in 10/15 mins along the riverfront and also to the Battle Box in about 15/20 mins (it wasn't the distance but the heat that was a killer, but this walk was still fine). We also walked to Orchard Street after the Battle Box, so you don't have to use public transport if you'd rather burn some calories instead! Initial impression was that it didn't look as grand as it does in the photo's but the main entrance area was still nice. We were given a free upgrade to a deluxe room overlooking Padang park. The room itself again wasn't as grand as it looked in the hotel photo's but it was still a good room. Room 310 Cannaught Room was slightly larger than the other rooms. It wasn't a large room and the shower room was relatively small (though the actual shower area was quite big in comparison), but in all it's big enough for 2 people to share. There was a large tv, tea/coffee, fridge, double & single bed and enough room for all your luggage. We also had access to a large shared balcony. Overall, we were happy with this room. I did see other rooms and they were smaller, with only enough room for one double bed so we were really glad we got upgraded. There was no free internet. Breakfast was pretty poor and the pool side restaurant was really old fashioned (very 80's), it looked more like a caffeteria. I tried the cooked breakfast on the first morning and left most of it; it was pretty aweful so we just stuck to toast and cereal. I found it pretty weird and totally unprofessional when I saw staff members helping themselves to the breakfast too (the manager and the chef). The staff were ok, one girl wasn't very friendly at all and hardly spoke a word on English (English is spoken widely there so for hotel staff I thought it wasn't very professional), but there was one girl that was very friendly. The hotel itself is quite basic, there is nothing wrong with it but I wouldn't rate this hotel so highly as others. The full use of the health club facilities was definitely a bonus and we used the gym, pool & sauna every day. I chose this hotel because of other TA reviews, because of it's location to Clark Quay and it was within my budget (Singapore hotels are generally a budget blower for me). It's a shame you can't pay less and opt out of the breakfast. The location is a huge plus side for this hotel. I didn't dislike the hotel (apart from the food!) but I won't rave about it either. All in all, we were still pleased with our choice but just wouldn't rush back.", "Date": "September 17, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "New Zealand", "Title": "“Great location and good value!”", "Author": "sjblond", "ReviewID": "UR118173293", "Content": "Great little place right in the centre of everything. Across the road from City Hall MRT and Raffles shopping centre. Walking distance to most attractions (Raffles, river, marina, museums.etc) We stayed here for 3 days and it was ideal for what we wanted plus it was one of the more reasonable accomodation options in town. The Residence is a half hour MRT ride from the airport and under 5 min walk from the MRT station so super handy if you dont want to pay for airport taxis. The information desk at the airport told us it would be a 15 min walk from the MRT - do not believe them!! We had a room overlooking the Padang which was plenty big enough for us. The staff were exceptionally helpful and made the effort to \"find out\" if they didnt know the answer to our questions. The club bar was incredibly cheap compared to many other bars around and gave us a chance to chat to the locals. The hotel gave us a late checkout, held our bags for the afternoon and even let us use the shower/change facilities before we left. Generally excellent. The only drawback is the dark and dated decor - the place needs a bit of a re-fresh. We also found the breakfasts were a bit average and the poolside cafe they are servied in felt a bit tired and grubby. That said, the breakfast is included in the rate and you can get fresh fruit, yogurt and freshly cooked eggs every day. All things considered we would deffinately stay here again.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Germany", "Title": "“An excellent choice - again.”", "Author": "sebhoff", "ReviewID": "UR117800301", "Content": "This was my second stay at the SRC - and I was again not disappointed. While the building itself and the design of the rooms may not be everybody's top favourite, it's no doubt an excellent choice if you are looking for a (very!) centrally located and affordable (by S'pore standards) place to stay for a few nights. Almost all of what I wrote in my previous review (posted 16th March 2011) still holds true - so I won't repeat myself here. I'm happy to report that the less-than-optimal quality of the coffee at breakfast has been fixed. Guests can now get decent coffee from a self-service espresso machine. My only dislike - charging for Internet access - still applies; I just don't think this is the thing to do for a modern hotel nowadays, and as before, it almost deserves a reduction of my rating to 4 stars. I knew that the free wireless@SG service was available in parts of the hotel and requested a room in this area. I was told that this could not be guaranteed, but on arrival I was happy to find that it worked out just nicely. Thanks! I was surprised that some reviewers complain about the site of the rooms. Mine was a decently-sized room with plenty of space for myself and my laptop (room 318). Certainly not what I would call small! Oh - and their bedlinen is really comfy and quite luxurious. Next time I'm in Singapore, I'll definitely be back.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Torquay, Australia", "Title": "“Good Small Hotel in Central Location”", "Author": "HTworldtour", "ReviewID": "UR117684070", "Content": "The Residence is perfectly located close to the main attractions and next door to the City Hall MRT & Raffles City shopping centre (good food). The Hotel was nice and quiet, rooms were very nice although small, which meant that it was only a double bed - which was a little too short for my tall husband. As we had a late flight, we were able to use the gym and pool (towel & goggles provided also) in the afternoon, which was great - although be aware that this is not a resort style pool, but a heated, underground sports pool. Great breakfast also.", "Date": "September 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Ok hotel, amazing location but rather overrated on tripadvisor”", "Author": "Schdero", "ReviewID": "UR117208229", "Content": "The Hotel was very nice, the staff helpful and the rooms ok (except an utterly obtrusive smell of artifical water melon, which drives you crazy in the beginning, but you get used to it). The location is simply amazing, the hotel is in the very centre (mrt station city hall), next to the raffles, stamford etc. Atm there are unfortunately some construction done, which however is only a transitory nuisance. The breakfast buffet though was rich in choice, but a bit poor in quality , the eggs are good.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "2", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“This is a £100 a night hotel in a £200 a night location offering £50 a night quality.”", "Author": "sheepster1964", "ReviewID": "UR117164845", "Content": "The room was small and not set up to accommodate our child when we arrived late. This necessitated us waiting late at night for the fold-up bed to be set up which was not fair on a young child who was exhausted after a flight from Australia. As the room was so tiny, this required furniture to be removed and crammed in every corner. Also, they didn't even bother giving him a sheet to sleep under, just a blanket. Quite frankly, there was no room for an extra bed which The Residence charge a lot of money for. Other issues: The fridge did not work which is appalling given the climate; The safe did not work and had to be fixed; Air conditioning took ages to work its way through even a small room; There are steps from the top part of the room to the bed part which is very dangerous, especially after having a drink when you are out! To attempt to solve this problem,there is a light on the steps which doesn't appear to be able to be turned off which is most annoying if you like darkness when you are trying to sleep. Breakfast buffet was just okay with the Asian food in particular being very disappointing. The service, throughout, was friendly and efficient, with the location of the hotel being superb. One tip - taxi drivers do not know this hotel as they don't associate the Singapore Recreation Club as having accommodation. Just tell the drivers to go to Singapore Recreation Club or the SRC as it is known in Singapore.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "hanoi - vietnam", "Title": "“Great location, old fashioned”", "Author": "sosohanoi", "ReviewID": "UR116919950", "Content": "Location is perfect and room very correct but a little bit small. But breakfast is just terrible. The Club Members did not seem to be very happy to see you even if you spend money in their Club...", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Manila, Philippines", "Title": "“Lots of things to like about this place!”", "Author": "lulugirl74", "ReviewID": "UR116893535", "Content": "Not your regular hotel, but great location near Raffles City, bus and MRT stations, walking distance to several tourist spots ie. Esplanade, Merlion etc. Very clean and well appointed rooms, excellent staff service, friendly and accommodating, too! great value for money, considering that lodging places in Singapore are quite expensive. We stayed here for 6 days upon the recommendation of a friend, and have never regretted our decision to do so. We would consider staying here again next time we're back in SG.", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Not for everybody and certainly not for families”", "Author": "Miran_Ali", "ReviewID": "UR116622194", "Content": "We had booked the hotel for 4 nights but left after the first. At least they were kind enough to let us leave without a penalty. This is a club. Not a hotel. And has all the problems associated with such a set up. Including trying to keep the kids quiet at night, because the whole place is deathly quiet. Good for singles or couples without kids. Otherwise I'd give it a pass.", "Date": "August 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Chiang Mai, Thailand", "Title": "“Unbeatable location and value”", "Author": "foliumnondefluet", "ReviewID": "UR116617423", "Content": "If you want a well located base for visiting Singapore with a view over the playing fields of the Padang, the Resdence is the spot for you. Price wise it's a bargain by Singapore standards. Service is friendly and proactive. Downside is that the rooms are small and the setting on the top floor of the Club is cramped and uninspiring. Meals are served in the Poolside cafe in the basement and the restaurant is functional but very unglamorous . Need an affordable central location? The Residence does the job very well. Want something fancy? Look elsewhere.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Helsingborg, Sweden", "Title": "“Not for everybody...”", "Author": "pawel_hbg", "ReviewID": "UR116433471", "Content": "Unfortunately I have to start from disadvantages and especially one. Our room was not ready at 14:00 and manager of the hotel looked after me and my girlfriend and showed us all facilities. Everything was OK besides mentioning many times what is allowed and what is not allowed in this Recreaction Club. There are some places inside where you cannot be for example in shorts. I completely understand dress etiquette. However there is no need to repeat so many times to just arrived, tired hotel guests that in lobby we have to be properly dressed. Please note that hotel is on third floor and you have to get over there through lobby. We felt strange every time we crossed this lobby later after all those remarks. My advise to managers of this hotel- please do not scare so much guests at the beginning. It is enough to mention 1 time about dress code. Not over 5... Price is adequate to Singapore. And advantages- actually there are more than disadvantages. You can use all the facilities. For some of them you have to pay and for some not. However it is very cheap if you compare to other places in Lion's City. 1 play of bowling only 2 dollars out off pick time. Food in restaurant also cheap. Beer in cafe too. Location is great! You see metro station when you will leave hotel's lobby. 2 minutes and you can reach City Hall Metro Station. Please note you can get this red line directly to the airport with one change( you just cross the other side of platform so very easy). Do not take the taxi- you can save some money. From hotel about 15-20 minutes to Marina Bay Sands by foot. Actually everything is close. Rooms are nice. We got the possibility to check out at 13:00 and take a shower near swimming pool in the evening of course for free. Very good gym! No room service. My rating is only average because of this 1 disadvantage... Not everyone will feel well in this hotel.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Mauritius", "Title": "“We loved it”", "Author": "Ashboy1608", "ReviewID": "UR116292282", "Content": "Very good location, near shopping mall, MRT etc. The staff were very helpful and it was value for money. Breakfast is OK. Small but very nice. We'll be back surely.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Wellington", "Title": "“Top Stay”", "Author": "WellingtonGavin", "ReviewID": "UR116147781", "Content": "We loved the place - great value for money. Centrally located and very close to the City Hall MRT (Metro) - yes the rooms are a bit small and basic but they have access to large terraces. We stayed in the corner room with acess to a shared (which we had to ourselves as no one else used it) terrace that looked out over a large grassed area to the city lights - inlcluding a great view of the new Marina Bay Sands Hotel. Will definitely come back.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Ulverstone Tasmania", "Title": "“A well-located and lovely property.”", "Author": "JandJteam", "ReviewID": "UR115947116", "Content": "The third floor accommodation is relatively new and is tastefully renovated. There are 2 bonuses: the location which is close to Raffles, MRT and shopping precincts and the surrounding balcony/outdoor areas.If you require quiet, be sure to request a room facing the Padang, large square playing fields backdropped by skyscrapers. Don't be off-put by the small reception area and narrow corridors as the other factors well and truly make up for these. It is also well-priced for its location. We would return should we return to Singapore for a third visit.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Thiruvananthapuram (Trivandrum), India", "Title": "“Very good hotel and value for money with good amneties”", "Author": "sourabhc", "ReviewID": "UR115791814", "Content": "We stayed in this hotel for 5 days from April 22-27.It is about 40 minutes drive from the airport and is very well located close to Suntec City which is the hub for all the major tour buses (Hop On,Hop Off, Duck Tour,etc).The hotel breakfast was very good with a lot of varieties and the hotel staff were very courteous and helpful. The rooms were very clean and although not very big,but, modern..I would love to come back here again as it is a jewel in the centre of Singapore.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Katherine, Australia", "Title": "“Best value for money in Singaore”", "Author": "Tennrah", "ReviewID": "UR115706363", "Content": "This is by far the best value for money hotel I've ever stayed in, in Singapore! It has a great location, close walking distance to many shopping centres and across the road from City Hall and Esplanade MRTs. The rooms are modern, clean and quite spacious compared with others I've stayed in. The breakfast was good and the staff were very helpful. Will definitely be back to stay again.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brisbane, Queensland", "Title": "“Excellent value and location”", "Author": "Charliedoggy", "ReviewID": "UR115264958", "Content": "First time visitors we stayed here for one night last week for a very good rate. We walked straight out of the City Hall tube station and across the road, so it was very convenient. We walked around the corner and through the park to Gluttons Bay and the harbour area to view the sound and light show at The Marina Sands hotel the night we arrived. The rooms were small but very clean and comfortable. We had requested 2 single beds and the Manager came to check that we were happy with our room which happened to be the disabled access room. Breakfast which was included was all the usual buffet items and more than adequate and tasty. They happily stored our bags for us until early evening when we left to catch our plane. All in all a great little find.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "fife scotland", "Title": "“great hotel well worth the stay”", "Author": "afrobain", "ReviewID": "UR115255317", "Content": "Like a lot of people i decided to stay here due to the good reviews on tripadvisor and im glad i did. The hotel is centrally situated with raffles a few minutes walk and mrt station even less of a walk, our room was a good size and had all the bathroom essentials which came in handy as our luggage didnt arrive for 24 hours, we had booked a private return transfer which was a bit expensive but due to our missing baggage we missed that due to spending over an hour at the airport trying to sort it out, so had to get a taxi which was a lot cheaper $19 so dont waste time with transfers just get a taxi outside the airport", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Perth, WA", "Title": "“Fantastic Place and Location”", "Author": "NeilPerthWA", "ReviewID": "UR115032549", "Content": "We arrived in Singapore by ship. We proceed to catch a taxi to the Hotel and the Driver laughed at us saying things like no-one stays there, it is not a Hotel, you need to move. My wife looked at me with dismay and we were quite depressed. I wish I could find that taxi driver because he doesn't know what he is talking about. This is a wnderful place to stay. Room was big, modern and the staff were more helpful than you could hope for. Room was clean and the Hotel is situated in the middle of Singapore overlooking a green park. Two minute walk to City Hall MRT. Breakfast was very good overlooking a large swimming pool. We also had a game of 10 pin bowling and a very good gym. We will certainly stay there on our next visit.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Surfers Paradise, Australia", "Title": "“This was a great find”", "Author": "NVLC", "ReviewID": "UR114887874", "Content": "This place had everything and more. An oasis in the centre of a large, modern city. So central and just a block from Raffles and the hop-on hop-off bus. The room while not large had a huge balcony and magic views of the city and it was clean, modern and comfortable. The amenities were abundant and the best pool area I have ever seen. Great breaky and small night club with entertainment if wanted and quiet nights. This was the first stay on our trip and we were absolutely delighted with every aspect including the price.", "Date": "June 29, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Whakatane, New Zealand", "Title": "“we will be back”", "Author": "Dorothy1951", "ReviewID": "UR114699568", "Content": "what a gem in the middle of this city, great rooms of good size very caring and thoughtful staff, easy to walk to shops and resturants, bus stop hop and hop off around the corner", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Karachi, Pakistan", "Title": "“cozy room with one of the best views over padang”", "Author": "amadeus52", "ReviewID": "UR114630820", "Content": "Room is small but cozy and with all amenities, carpeting is also nice and bathrom is again small but functional with a great shower. Outside hotel there is no convenience store so you need to cross the road and go to raffles or over to peninsula square. Complete third floor of the club is dedicated for hotel, our room was facing padang with a nice common gallery with great views. There were few ants in the room when we checked in but that might be because of the plantation right outside of the window. There was no free wireless in hotel but we were getting wiressless@SG signals in our room so it was not a problem.", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fareham, United Kingdom", "Title": "“What a perfect gem of a hotel”", "Author": "james503828", "ReviewID": "UR114327697", "Content": "Cant believe our luck in stumbling upon this small hotel in a perfect setting in Singapore. Our room wasnt enormous but very elegant and had everything you could possibly need and the breakfasts were of a high quality also. The hotel was so reasonably priced for being at the heart of everything. Raffles was just around the corner.", "Date": "June 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“Great Choice”", "Author": "EnglandSteveB", "ReviewID": "UR114032118", "Content": "Singapore Vacation club is a private members club with 26 rooms on the top floor for guests and tourists. The rooms are well appointed and well maintained with modern facilities. Great views over the Padang and the Singapore skyline. Guests have use of all the clubs facilities including an indoor pool and 10 pin bowling alley. Breakfast was included at the poolside cafe, catered for all tastes and was excellent quality. During the rest of the day and evening it was possible to buy lunch and dinner at the poolside cafe. The menu was extensive, freshly prepared and very reasonably priced as were the bars within the club. We did not use the Chinese restaurant but it did look very good. The staff are very helpful and suggest many of the best places to visit. The club is very central to all of the main attractions and sights many of which are within easy walking distance. Within 100yards is the City Hall MRT station which makes travel to Changi airport and sightseeing easy and cheap. Raffles, Clarkes Key, Marina Bay and numerous shopping malls are very close by.We stayed for 2 weeks and has plenty to keep us occupied. A really good place to stay.", "Date": "June 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Philippines", "Title": "“A Relaxing Weekend at the Residence”", "Author": "saint28daisy", "ReviewID": "UR112570363", "Content": "We arrived early that weekend in May and the Resident Manager welcomed us to the Residence with warmth. He and the Staff lead us to the washrooms for us to refresh ourselves. We left our luggage in the hotel and immediately walked to the Esplanade. The Residence is in the Center of all the tourist attractions in Singapore. We came back to the hotel mid-day in order to check in our luggage and we truly were amazed by the splendid furnishings and set-up of the rooms. They were modern and refreshing...with fresh orchids in the bathroom. The breakfast was delicious and my children loved the congee. The rooms that we got were facing the Padang and we had a beautiful view of the City from our Terrace. The staff were very accommodating and the Club members friendly. We checked out on town, but left our luggage to do some last minute shopping at the nearby Funan Digital Mall...when we came back we used the Club's shower room by the Pool to freshen up. Truly a relaxing weekend in Singapore at the Residence. We will surely endorse this refreshing Hotel to our friends and family.", "Date": "June 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Singapore", "Title": "“Hidden gem in the heart of the city !”", "Author": "PrincessSarah18", "ReviewID": "UR111063739", "Content": "Being locals, we haven heard of a residence here and bumped into this hotel on a website and it was relatively unkown as pple in SG dun really know that there is a residence for stay here. Fell in love with the pics online and i booked it immediately ! Our patio had a brilliant view of the Singapore skyline and the iconic Padang.. City Hall MRT is just 2 mins away... great for photography and we loved the indoor heated pool and jacuzzi... central location to travel all around the city and Sentosa... tip top service and free parking! Book now! what are u waiting for!!!!", "Date": "June 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "perth western australia", "Title": "“Fantastic place to stay in excellent location”", "Author": "gillkatecaz", "ReviewID": "UR109286150", "Content": "Stayed at the Residence earlier this month as I was attending a conference at Suntec. Couldn't fault it ! It is excellent value for money compared to the rates charged by nearby hotels.The rooms were very nice and the view overlooking the Pedang was lovely. Can't comment on the rooms facing the other way as my 2 other colleagues also had rooms facing the Pedang. The shared balcony was spacious with a lovely view of the Singapore skyline,as did the seating area at the side. We arranged for some of our work collegues to join us at the Residence and the cafe provided food that was brought up to the outdoor seating area.Thank you so much to all the staff in the cafe for such excellent service. The breakfast in the cafe was very good.A recent review said it was a cold buffet.In fact there are hot and cold selections and in addition you can order eggs to your liking. Duncan Roberts the manager came and introduced himself to us and let us know that he was on hand should we need anything. The staff at reception were great.They were very prompt when i needed help with the safe and a loan of a international travel plug,and thank you also for the several buckets of ice ! The club facilities are nice.just had time for a quick dip and brief visit to the steam room. I am returning to Singapore in July with my sister and our daughters for a holiday and have rebooked rooms at the Residence.Thank you Lita for your very efficient response to emails. Can't wait to return.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“Affordable Choice in an Excellent Location”", "Author": "TheTravelCamel", "ReviewID": "UR109275440", "Content": "In a city where accommodation is usually expensive and the rooms usually small, The Residence is a major discovery. Yes, the rooms are the usual size to be found in Singapore, but the price of The Residence is excellent for a hotel of this quality in the centre of Singapore. Located diagonally opposite Raffles Plaza (where a MRT station is located), it is an easy walk to the Asian Civilisations Museum and the Merlion in one direction, and many shopping options in other directions. I am not a fan of Orchard Road so much prefer the attractions and shopping options in this part of Singapore instead so this location suited me perfectly. The staff were friendly, but the reception area on the third floor must have the coldest air conditioning unit in the country. The room was a split level separated by several steps, with the upper level containing the well appointed bathroom and downstairs the main bedroom with a comfortable bed adorned in lovely colours. There was some noise from the street (my room faced the road) but that subsided well before midnight. Food is taken in an area overlooking the indoor swimming pool, and the breakfast provided a good but not great selection of food. Dinner here was also more than acceptable. There are many facilities that guests can use such as the pool and gym, but I did not avail myself of this opportunity. After checking out, I discovered that I had left my power adapter in the room, and so emailed them to see if they could retrieve it. Within five minutes, I received an email reply to say that they had found the adapter and would hold it for me until my return to Singapore more than a week later. Now, that is what I call service. If I want a comfortable option for a reasonable price in an excellent location on future trips to Singapore, this will be my first choice.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "new zealand", "Title": "“great location but ...”", "Author": "nzbased", "ReviewID": "UR108266205", "Content": "right outside Raffles Place and the MRT, good price for Singapore but rooms small and shower even smaller. The hotel is within a local club and hence hotel and club facilities are shared. Breakfast was cold (buffet) but they did cook us a new one so thats a plus. No-one collects your baggage when you arrive so we ended up dragging it from the taxi up stairs etc. Its clean - reasonably good for the price ($125pn per room) through TA", "Date": "May 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Harlow, United Kingdom", "Title": "“Brilliant! A hidden gem”", "Author": "TezSpooner", "ReviewID": "UR106531723", "Content": "We stayed for 3 nights here. Our room opened out on to a wide shared verandah with great views of the Padang.Great location! The room, the service, the staff- all first rate. The room size was absolutely fine. We used some of the facilities-sauna , steam room and the bar and found the members of the club to be friendly and informative.Breakfast was included, rather ordinary but ok. Would recommend the Residence without hesitation, and would stay there again", "Date": "May 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Honolulu, Hawaii", "Title": "“Great location, small rooms”", "Author": "EHawaii", "ReviewID": "UR106423195", "Content": "We stayed one night at the SRC on our way from Singapore to Seoul. This hotel's main advantage for us was its great location right near City Hall, Raffles City, the Esplanade. Nice place from which to walk around to the waterfront to spend a balmy evening. Even the yummy \"Lau Pa Sat\" satay stalls are short a cab ride or nice leisurely walk away. Our room itself was small and basic, showers are really tiny. We didn't use any of the club's facilities, although the wonderful staff were extremely nice and friendly and offered the pool's shower facilities if we needed since we checked out early but had a night flight out of Changi. Apart from the hotel's excellent location, I'm not sure if we'd stay there again or find a more luxurious place with bigger rooms somewhere else in the city.", "Date": "May 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gillingham, United Kingdom", "Title": "“What a location”", "Author": "AngloAussie", "ReviewID": "UR105893382", "Content": "If you want the most affordable, central place to stay in Singapore, the Residence at the SRC is a great option. While the rooms are on the small size (it didn't help that we had an extra single bed in our room) but the service is great, buffet breakfast is included, and you are in walking distance of many of the major attractions. On our second night we had a slight problem with noise - the balcony for the rooms is one continuous balcony outside all rooms, and some people obviously didn't realise this when they set up just outside our room at midnight and started a conversation - we heard every single word. I stuck my head outside and politely pointed this out and they apologised and left. Other than that, there was very little noise. I would highly recommend this place!", "Date": "April 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“an unusual place to stay”", "Author": "tony273", "ReviewID": "UR105200429", "Content": "I did not form quite such a good an impression as other reviewers. It is certainly an unusual place to stay. The staff were helpful. My room was beautifully equipped and clean but very cramped. There was hardly any room to move around the bed and within the bathroom. I noted from the fire evacuation diagram that there were two room sizes and I was in the smaller. The dress code, effectively no shorts for men, applies on the hotel floor and ground floor entrance, as well other parts of the Club, but, fortunately, did not seem to be enforced for arriving and departing guests. The buffet breakfast was adequate, but nothing special, and was included, which was welcome, but I did not find the subterranean ambience appealing. The subterranean swimming pool was, however, much better than it looked. The city-centre location was excellent being just across road from a good shopping centre and MRT entrance.", "Date": "April 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Peregian Beach, Australia", "Title": "“Location, Price, Service & Much Much More!!!”", "Author": "karinalouise", "ReviewID": "UR104758414", "Content": "Thanks to Trip Advisor and all the wonderful comments, booked for 3 nights at the end of March/early April for a first time stay in Singapore. Arrived at 9am, staff were lovely. Was unable to check in as our room wasn't ready, but they kept our luggage for us and gave us maps and explained where everything was and a run down on what to do and how to get there to fill in a bit of time. May I say it again the location is perfect, it's a short beautiful walk to boat quay, across the road is Raffles shopping centre and the MRT. Our room was lovely, yes slightly on the small side but new, clean and well maintained everyday. Very adequate for sleeping at night and showering as we were out taking in the sights everyday. Breakfast was lovely, it isn't a huge buffet but there are sufficient options and a lovely setting by the underground pool. Had a flutter on the pokie machines on the first floor and they even offered us free dinner, unfortunately we had already eaten in China Town. Then to top it off there was turn down service and a lovely orchid every night. Staff were attentive, answered and helped with any questions, supplied an adapter so we could charge the camera and let us keep it till we left. No it doesn't have the high rise views but then it doesn't have the rooms and all the people you have to deal with. For the price, it can't be beaten. It's small, stylish, classy and a hidden gem!! Would highly recommend and would stay here again. Thank you for a wonderful time in Singapore.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manila, Philippines", "Title": "“Great location and value for money”", "Author": "Ria-chan", "ReviewID": "UR104466716", "Content": "Stayed here when it was still new and there was even no website yet. Kinda felt hesitant as I didn't see any reviews on this hotel back then. I booked anyway as I love its location -- it is walking distance to Citylink, a lot of other shops and if you really love walking, you can even reach Esplanade. It is close to a lot of museums too. If you are a guest, the staff would know you easily since they only serve a few \"outsiders\" as they are catering mostly to the members. Room is small but cozy. Loving the bathroom most especially. They serve breakfast but don't expect a lot of choices on the buffet table. I think they don't serve food in the rooms as they wanted to maintain cleanliness of the place, but they do have drinks and coffee on the house. This is the best place to stay during the F1 night race.", "Date": "April 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Mumbai, India", "Title": "“Clean, Courteous,Centrally located Bed n Breakfast”", "Author": "30King", "ReviewID": "UR103858053", "Content": "Residence at the SRC scores over other budget hotels in Singapore. Its a 5tp 15 min walk from various important destinations such as Suntech International Convention, City Hall MRT stop and Swissotel on Samford, which has a lot of eateries in the subway catering to all subsets of The East. Also would you find in that subway a pizza place, Starbucks, McDonald, economical Money changer, all of these just 5-7 mins walk. The Residence at SRC is indeed very neat and clean, compact with only 23 rooms. Rooms and bathrooms are nice with all basic amenities required. Staff very warm and courteous, will to help in all possible ways. The breakfast included in the stay was average. Other in-house recreation facilities such as gym, swimming pool, bowling lanes are all well kept. Budget travelers hitting the hotel just to sleep is a great option. Vey peaceful", "Date": "April 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Aberdeen", "Title": "“Great Location, but not a luxury hotel”", "Author": "didiwritethis", "ReviewID": "UR103399146", "Content": "On arrival at the Residence it feels like what it says, a recreation club that has some rooms for rent. All the 26 rooms are on the top (3rd) floor with half facing the quiet Padang and the others the noisy Connaught Road. When we booked we asked for a quiet room but did not get one despite having booked 4 months previously. The feeling we got was that they were reserved for the \"members\" as they were nicer rooms. We asked to be moved during our stay but were told it was not possible. Breakfast was included in our rate which was very good. The rooms were small but nicely furnished and strangely they all have a common balcony that anyone can walk around which means you have to keep the curtains closed as people walk past and look into the room. Another issue we had was the charge of $100 to our credit card upon arrival which they could not explain why they were making it but insisted that it had to be done and later credited off the bill. Compared to the other larger hotels in the area (Swisshotel just across the road) this was a very good room rate but obviously did not have the luxury or surroundings of those types of hotels.", "Date": "April 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Interesting place- great for boat quay and surrounding area”", "Author": "ranchale", "ReviewID": "UR103391847", "Content": "Had a nice stay here with a room that opened out onto terrace over looking sports field and the sky scrapers over singapore. V clean, decent breakfast and friendly staff- would definitely go back! Good value for money for expensive Singapore. Also has free gym and pool plus other activities.", "Date": "April 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Luzon, Philippines", "Title": "“My Residence in Singapore”", "Author": "May12", "ReviewID": "UR101885688", "Content": "Finding a good, centrally located hotel (that keeps you within budget)) in expensive Singapore is very taxing! Thanks to Tripadvisor, I found a hidden gem and I have been telling friends to consider it when visiting Singapore. A first impression that lasts is the genuine hospitality – from the confirmation of the booking to our check-out. I think everyone on night duty was informed about our midnight arrival, I was very happy with the efficient check-in as me and my mom were very exhausted from our KL side trip. The room looks and smells very nice! It combines the old charm and the conveniences of modern living. The bathroom and its fixtures are new -- beautiful and spacious! The toiletries are arranged very neatly. Unlike big hotels, we got immediate assistance for petty requests (such as adaptor, can’t find the light switch, etc) because they have a small reception area on the 3rd floor, just a few steps from the rooms. For the price and location, nothing beats the hotel -- a lot of must-see sights are accessible by walking. For further destinations, the City Hall MRT is just across the street from the main entrance. The hotel’s 3rd floor garden terrace provides a good view of the Esplanade and the Marina Bay Sands. The buffet breakfast is simple but tasty and adequate. We stayed only 1 night at the Residence coz I did not make my bookings early (they only have 28 rooms, I guess). We were not able to use the other facilities, especially the gym and the swimming pool, both of which look very well maintained. Learning my lesson well, I have already booked way advance for a 5-day return trip to MY Residence this April.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“Fantastic location and reasonable price”", "Author": "Aussie_Bel_17", "ReviewID": "UR101719677", "Content": "The rooms are small but clean and regularly serviced. Breakfast is a standard 'American/Asian' buffet, also some cereal and pastries. There is a bowling alley in the hotel which was fun and cheap. Free newspaper in the mornings. We emailed ahead to let them know we'd be arriving at 3am and they were ready for us. Basically, everything was above average for a less than average price. The downsides were very minor - the TV didn't work very well and the bathroom walls are frosted glass (though there are blinds you can put down). It is a two minute walk to the City Hall MRT stop, we also walked to Clarke Quay, Boat Quay, various malls, Singapore Arts Museum etc. We would definitely stay here again.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Germany", "Title": "“Very good value for money - central location”", "Author": "sebhoff", "ReviewID": "UR100387651", "Content": "The combination of location and price is hard to beat. It's very close to \"City Hall\" MRT and many attractions are within walking distance. This place has been open for less than 2 years and many taxi-drivers still don't seem to know it. Just say you want to go to the Padang, opposite the Cricket Club, and everybody will know where to go... Rooms and breakfast are fine, though the normal coffee on offer is pretty awful. I asked and was given a coffee from the espresso machine, but I don't know whether that's normal procedure. I almost gave the hotel only 4 instead of 5 stars because they charge a lot for their own Internet access, which I just don't consider to be acceptable anymore today. But to be fair: the free service wireless@SG is available in much of the club and most of their rooms (not, for example, in their superior rooms, however) and they are happy to help you set up an account (you need a local mobile phone number to do this). They keep your luggage for you after you've checked out and you can take a free shower at the club before you leave for the airport in the evening - nice! They have a dress code in the club and hotel guests are expected to follow these rules, although quite a few don't seem to care (and get away with it).", "Date": "March 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "seoul", "Title": "“For the price you can't lose”", "Author": "jiber", "ReviewID": "UR98772969", "Content": "We stayed here for 3 nights and overall we were happy with the stay. The location was great. Right in the middle of town. It was close to numerous good shopping centers and right next to the train station too. The room was nice. The interior was nice but a little small around the bed in the room we stayed in. The other things about the hotel were also good. The pool was huge and heated. The gym although old but well equipped and you can get a solid and you can do everything you need there. The breakfast was free but don't expect anything special. But really for the price you can't do any better!", "Date": "March 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Port Elizabeth", "Title": "“Perfect”", "Author": "CathyPortElizabeth", "ReviewID": "UR97916650", "Content": "We stayed for 5 nights at the SRC and loved every minute. The hotel was so central with easy access to the MRT and buses. The room was beautiful, comfortable and clean. Staff were friendly and helpful. Will definitley recommend it and would love to stay again if we return.", "Date": "February 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portsmouth, United Kingdom", "Title": "“excellent - very enjoyable stay”", "Author": "RichSue41", "ReviewID": "UR97494263", "Content": "This hotel is a little gem - the location is excellent and the staff very friendly and helpful. The room we had overlooked the Padang and whilst slightly small was very clean and with a great view of the Singapore skyline. Stayed for 2 nights and whilst had breakfast the first morning - which was more than adequate had to leave early in the 2nd morning and the breakfast was not available. We just had a 2 day stop over on our way to Sydney and thoroughly enjoyed Singapore and the hotel. Would definately recommend this hotel against some of the bigger hotels available.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Excellent Residence”", "Author": "LaxmanBage", "ReviewID": "UR96330073", "Content": "The reservation desk was very helpful (esp - Lita). The room 330 where we stayed for 3 nights was spacious with amenities of 5 star hotel standard. Other 3/4 star budget hotel at SRC price just provide pigeon hole . The hotel is located right at the center of city (hall).", "Date": "February 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Superb value!”", "Author": "platinumworld", "ReviewID": "UR95871201", "Content": "The location is very central. The rooms are 5 star standard except a bit smaller. The value of rooms, F&B etc is the best money can buy in Singapore. The facilities are excellent. I will keep coming back to this place as it is ideal for business travellets like me....", "Date": "February 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“A hidden gem of Singapore hotels”", "Author": "yosaut", "ReviewID": "UR95847785", "Content": "We, a family with 4 years old daughter, were on a short weekend trip to Singapore on mid January 2011. We stayed 2 nights at the residence of SRC. We arrived at the hotel around 9 pm due to delay on our flight. But even at that quite late time, the check in was easy and fast. Around 5 minutes we were already able to enjoy our room, a double bed deluxe room with balcony overlooking the Padang field. Our room is not too big, but it is a modern room and very clean. They have LCD TV with StarHub cables and even an alarm clock that includes iPod dock. The bathroom is also clean and equipped with hair dryer and all the amenities you need (soap, shampoo, tooth paste etc.) Breakfast is also good and tasty. You should try their chicken porridge. Really warm you stomach on a cloudy morning. The location of the hotel is very central. Very near to 2 MRT stations (i.e. City Hall station and Esplanade stations). Esplanade, Merlion Park and many Singapore's historical places are also in walking distance. If you want to try local food you can just go to the food court on Raffles City Mall or go to Makansutra Gluttonsbay foodcourt near Esplanade. To get taxi is also easy since many was passing by in front of the hotel. Just talk to the security at front door and they will help you to get your taxi. Or you can walk cross the street, go to in front of Swissotel Stamford loby and take a cab there since they have a taxi stand there. Not every taxi drivers are familiar with the residence, but you can mention Padang field or War Memorial Park to get you near the hotel, since most of the taxi driver is familiar with them. Just remember, since the residence is located within CBD area, you'll have to pay CBD surcharge in certain times. Tips: 1. Spend your morning with walking / jogging to the Esplanade, Merlion Park and the other historical places near the hotel. 2. Go to food court on Raffles City or Makansutra for abundant food selection around $4-$5 / plate. 3. Nice souvenirs can be bought on a 3 for $10 gift store in Suntec City Mall (1st floor, near winter clothing shop). Suntec City Mall is around 10-15 minutes walk from the residence.", "Date": "February 8, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Ubud, Indonesia", "Title": "“Ok for business - not for a family”", "Author": "McSporran8", "ReviewID": "UR95367091", "Content": "From the reviews we certainly expected more. If I'd been by myself on business I'd have said it was very good, but it didn't work for our family (two kids, 7 & 9). Our room was small and wasn't ready for us although we pre - booked. With the extra bed which we paid for it was more like three singles. I'm 5'10\" and my feet stuck out the bottom of the spare! The premium for the room didn't extend to extra breakfast vouchers for the kids. No matter! While you get your wallet out for that you can settle your internet bill too, and it isn't cheap. For almost $300 a night (Singapore) is it too much to ask for free e-mail and a croissant? If you are there on business it would be great. It is clean and across the street from the tube and has the gym and pool which is well appointed though busy - again, with what looked to be the business crowd. Not for young kids, even if they meet the dress code.", "Date": "February 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Nice & Comfort Stay.. sure will be back”", "Author": "goshocky", "ReviewID": "UR90262998", "Content": "Stayed here during the peak season of CommunicAsia 2010. The place is very strategic - within Marina Bay & Raffles. just 1-minute from nearest MRT station which is good. The room is lovely - like a 4.5 star hotel room - as I book the cheapest room but it's lovely. Nice decorated bathroom. Big LCD TV & iPhone/iPod dock. My room is facing the Padang which also facing the CBD which is lovely. However, the room is perfect for a single person. The service is good from the reception, small reception desk at 3rd floor (if I'm not mistaken). They're very friendly & humble. Plus the internet charge is very affordable at about <S$5 per 24 hours. The breakfast is quite normal but somehow it's nice as not much people around. I hope more improvement for the breakfast section. The facilities is great as you could use the recreation club facilities etc gym & pool which is beneath the hotel. Overall is good & worth it as I pay a slice of 4.5 star hotel rate during super peak season.", "Date": "December 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“I'll definitely stay here again”", "Author": "ricochet2046", "ReviewID": "UR89124791", "Content": "The cost for hotel stay in Singapore is not cheap. This one is definitely a hidden gem. It is located just across the road from Riffles City (exit A, City Hall MRT). It is located on the 3rd floor (top floor) of the Singapore recreation club, so there is a nice view of the football field. There are 23 rooms, and they share a big balcony where you can enjoy the sunshine. The cost of one night stay is S$200(including tax). The club has it own attire rules (but since we dont wander around in the club/hotel, this doesnt bother us). Room are spacious. The breakfast is simple but adequate. It is served next to an indoor swimming pool. Its location make it easy to walk to marina bay, suntec city. It is also only a few min ride by MRT to little india, chinatown, orchard road. Do not miss it if you are going to singapore.", "Date": "December 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "seattle", "Title": "“Singapore's perfect place to stay with a perfect location”", "Author": "singaporeSeattle", "ReviewID": "UR86772507", "Content": "Have visited Singapore many times, and this was my first stay at The Residence. It was wonderful from check-in to check-out. The staff is so friendly and helpful in all ways. You are made to feel at home. The location, so close to shopping and transportation, is just great. The poolside breakfast buffet is included in the room price, and very nicely presented. I will stay here on my next trip and recommend it to my friends.", "Date": "November 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "belfast n.ireland", "Title": "“Excellent location & Service”", "Author": "bluebell_black", "ReviewID": "UR83465052", "Content": "Arrived at Singapore RC just after the very busy Grand Prix weekend and were informed that our room wouldn't be available as the Aircon was broken and all other rooms were occupied. Duncan the manager had arranged another room for us in a nearby hotel for the evening and by way of an apology treated us to an excellent meal at the R.C's poolside restaurant. Duncan then took us in a taxi to the other hotel and made sure we were given a good room. After nearly 18 hours of travelling we were exhausted but we were well looked after. The RC rooms are well furnished, clean and the breakfast is good. The location is excellent. Just hop over two main roads from the City Hall MRT and you're there. We took the MRT from the airport and it was no problem at all. The only concern i would have for leisure travellers is that on certain floors men are not permitted to wear shorts / t-shirts / sandals and this rule is stressed! So we just avoided these areas. We wouldn't book this hotel for a romantic getaway but if you want good value in a great location look no further.", "Date": "October 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cheshire", "Title": "“Wow, how good is this?”", "Author": "CheshireSunshine", "ReviewID": "UR77773007", "Content": "I have just returned from a weeks stay at The Residence with 2 friends. I will get rid of my criticism first as the room for 3 adults is not big enough and would be cosy for 2, but having said that the view from the room across the Padang was great despite the deconstruction of the National Day celebration stuff. The staff are so friendly and helpful, always taking the time to have a chat. Breakfast at the Poolside cafe is an added bonus and the food at other times is also worth a try as it is very reasonably priced. On check out keeping our bags for our night flight was not a problem and we were also told we could shower and change using the facilties in the gym area. This was again a pleasant surprise. Having visited Singapore several times before and stayed at The Fullerton and The Stamford I would not stay anywhere else in the future, thank you very much for a memorable stay.", "Date": "September 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Very clean and comfy”", "Author": "jcicious", "ReviewID": "UR76598288", "Content": "This is the first time I've written a review for Tripadvisor, and I must say that I just love this place and felt the need to tell the staff and everyone thank you for such a wonderful stay. The room was very nice and clean. The breakfast was very good as well. I also had a very relaxing time at the pool. The most important thing for me when I stay at a hotel is the bed and bathroom - which at this place was very nice indeed.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bridgend, Wales", "Title": "“Feel like a local in Singapore”", "Author": "M4RK_H", "ReviewID": "UR75487868", "Content": "This is a strange type of accommodation as it's actually a room within the building that forms the Singapore Recreation Club, but it's a great location and a good use of the building. Room we had was fairly small, but well equipped with everything we needed - nice bathroom, good bed, lcd tv, mini bar etc. The room backed out onto the tennis & cricket grounds, as well as the setup for the upcoming Youth Olympics taking place in Singapore. As a guest you can use the facilities of the recreation club which had a gym and an excellent underground swimming pool, which was a nice surprise to find in the city, as well as a sauna/steam room. Nice buffer breakfast included, looking over the swimming pool. Have stayed in the Scarlet and Rendezvous while in Singapore previously and this was a different type of accom, but just as good. Staff were all nice & friendly, would stay here again. Cost about £100/SIN$200 per night including buffet breakfast. Not the cheapest place by far, but a nice bit of history attached to the place to make it feel \"not like a hotel\"", "Date": "August 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“WOW”", "Author": "happywanderer1954", "ReviewID": "UR72974124", "Content": "I am reluctant to write a review for fear that others may discover this absolute gem. The Residence has only a small number of rooms and like most good hotels in Singapore, space is a premium, but you don't spend your holiday in a hotel room. It's only there to dump your luggage, shopping and rest before you go again. I enjoyed my stay at the Residence more than any of the other hotels that we have stayed at when visiting Singapore. It has everything you need to fill up any empty moments you may have. Several restaurants and lounges, a 10 lane bowling alley, a well equiped gym and pool complex, billiards room and casino [all mostly underground] and across the road The Swissotel Stamford and Raffles City complete with MRT. The staff were very friendly and helpful and the poolside cafe [B1] was excellent value for money for meals. Food is not normally expensive in Singapore except when dining in the restaurants of the hotels, however the poolside cafe is the exception to the rule. The food was good, inexpensive and the staff great. Our son in law decided to start eating curries while in Singapore and the chef at the Poolside Cafe made sure he had a different one on the menu each night just to tempt him. My husband & I love visiting Singapore and we would appreciate it if you would all stay someplace else as we intent to stay here again and do not want to share this gem in case we can't get a booking in the future.", "Date": "July 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“A hidden gem for families with good facilities for children”", "Author": "Nicole_and_Ben", "ReviewID": "UR71473303", "Content": "Stayed two nights in July 2010 and we were really surprised by this fantastic place. With two kids (aged 6 and 8), the Residence did all it could to give us a great stay. We got in late after a late flight - so only needed a place to sleep. We had a queen bed and two singles in our room- so it was a bit small, but we could go out on to the terrace once the kids were asleep and this was a great space. The facilities include an underground pool, complete with a small water slide for the kids, a spa and steam rooms. There was also a basic play room for younger children and a full bowling alley - each game was less that $3 for guests. We didn't use the fitness room but did use the poolside cafe, which provided a great buffet breakfast included in the price. Staff were very friendly. One tip - as part of the Singapore Recreation Club the Residence does have a dress standard for men and women - no shorts, wear shirts with collars on weekdays (for men), etc. Best to check with the club before you go. The location is fantastic - it is right in the middle of the F1 track, which literally runs past the front door, and we had the privilege of witnessing some of the rehearsals for the Singapore National Day, which is a massive event held on the Padang - and the Singapore Recreation Club is at one end of the Padang. We would happily stay there again. We couldn't have been in a better spot with a MRT on the doorstep, the Raffles shopping Centre across the road and many sights in the Colonial district within easy walking distance.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Macau", "Title": "“Excellent experience”", "Author": "FernandoCg", "ReviewID": "UR68611653", "Content": "what can i say? excellent location (2 mins walk to the green line and red line metro station, 4mins walk to the yellow line metro station. easy to get to any main attractions in Singapore) , perfect serivce, very clean, new furnished modern room with high celling, boardband internet ( $22 SGD, 24 hrs acccumlated, very worth money). the only one disadvantge is safety box cant put in my laptop in inside, except it. i would say perfect !", "Date": "June 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Preston", "Title": "“Excellent stay a stones throw from all the major attractions”", "Author": "nilapatel78", "ReviewID": "UR66721982", "Content": "I stayed for 6 nights and could have easlily stayed more. The residency is located opposite the Raffles City mall and City Hall MRT. This is not actually a hotel, it is a private sports and recreational club which has open up the residency part to the wider public. The reception and other staff memebers are really friendly and eager to help which makes your stay all the more better. The rooms are nicely decorated with ample space for your belongings. The bed was comfy and after sleeping in budget hotels, i had the best 6 nights sleep in a long time. The bathroom is compact, there is not much room to manovre if there were 2 of you in there. The rooms features a LCD tv and mini fridge. The use of the clubs facitilites are also available to you should you wish to use them. Breakfast was included and there is a selection of fruit, cereal, pastries, breads, local cusine and traditional english fry up. More than enough choise and variety. As mentioned in the previous comments, the Residency is in walking distance to the mall, Raffles hotel, Sun Tec city, the Esplanade, the Flyer and the Merlion. You could even walk to Little India and Orchard Road. There are plently of restaurants near by including coffee shops for a quick bite. Definatley would stay again.", "Date": "June 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“Highly recommended!”", "Author": "Trip_Datum", "ReviewID": "UR62633628", "Content": "We spend 4 days with my wife at the Residence and the experience is very positive. The location is fantastic, just opposite of the metro station and an enjoyable walk to most attractions and museums. Very close also to many restaurants and a 7 minutes walk to the CHIJMES complex. Rooms are a bit small but very nice decorated, cosy and (the room that I had) with a very nice view over the Padang and the Singapore business district. We really enjoyed the afternoons in the terrace in front of our room. Service is very good and all the staff very professional and willing to help. Only negative point is the average quality of the breakfast. Another very positive point: the 24-hours internet voucher is accumulative, so when you log out it stops charging you, and it expires after 30 days. I’ve used a 24-hours voucher over my entire stay there. Overall: a very good place to spend a long weekend or even more in Singapore. In terms of value it is a much better deal than the 5 star hotels of the city.", "Date": "April 27, 2010"}], "HotelInfo": {"Name": "The Residence At Singapore Recreation Club", "HotelURL": "/ShowUserReviews-g294265-d1588227-Reviews-The_Residence_At_Singapore_Recreation_Club-Singapore.html", "Price": "$190 - $204*", "Address": "<div class=\"wrap_bl wrap\">", "HotelID": "1588227", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/91/07/ad/the-residence-at-singapore.jpg"}}