{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tokyo", "Title": "“Of of the better spots inside the Chungking Mansions...”", "Author": "melonpan", "ReviewID": "UR139449231", "Content": "Since 2006 I've stayed in about 8 or 9 different Guest Houses inside the Chungking Mansions. The New Peking Guest House however, is one of the better places. The Staff is friendly and very helpful, and the Rooms are pretty clean as well. Yet, the air gets kinda sticky inside there.. I can really recommend this room to people that travel alone, and want to stay in a clean space right in the heart of Hong Kong!", "Date": "September 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Great service”", "Author": "Kah Siong C", "ReviewID": "UR132000547", "Content": "The room was small and cosy, surprisingly there is room cleaning every morning as well. Provide great service. Give good advised for first time hong kong traveller We purchased our disney and ocean theme park tickets from the owner with a discount. He even went an extra mile and delivered the tickets to us at a restaurant where we were having our breakfast dim sum", "Date": "June 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“good bananas”", "Author": "ullebec", "ReviewID": "UR128811985", "Content": "nice staff. perfectly located. quite tiny and expensive rooms, but that is what to expect from HK. beware of dodgy indian people and hawkers in the entrance. somewhat annoying elevator system. to sum it up: stay here - it is nice under the circumstances of hong kong.", "Date": "April 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Nice hostel, plus the adventure at Chungking Mansions”", "Author": "freddyfu", "ReviewID": "UR120517312", "Content": "I have stayed in this hostel twice, April and September 2011. Both stays are very pleasant. Accommodation is always expensive in HK. So the rate of this hostel was reasonable, in my opinion. The room was mostly clean but it had a bit of bad smell from the toilet. It was small, but that’s common in HK. The owner was very friendly. I lost my key and he didn’t charge me for that. Chungking Mansions is very interesting. It looks shabby but it’s indeed quite ok. There are a lot of people on the ground floor asking you to go to their hostels. Just don’t ignore them and they don’t give you any problems. There are surveillance camera in the common area and security guards, so it’s definitely safe. And more importantly it’s at the heart of Tsim Sha Tsui so it’s pretty much close to all the touristy places in Hong Kong Island and Kowloon. I would recommend this hostel if you are on a budget trip to HK.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ubud, Indonesia", "Title": "“Recommend the hotel”", "Author": "lunamaya72", "ReviewID": "UR90774172", "Content": "Staying at the hotel for five days. We got a small room but it's quite clean and comfortable. The hotel staff was accomodating and helpful. Would recommned the hotel.", "Date": "December 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Phrae, Thailand", "Title": "“Worth for HKD 250 / night”", "Author": "LeeHyoHee", "ReviewID": "UR87951529", "Content": "I booked New Peking Guest House on 18-20/11/2010 via HostelWorld.com, single room ensuite, price HKD 250 / night. It is located in Chungking Mansion 12th floor, Nathan Road, Tsim Sha Tsui, which is very good location for travel Hong Kong. Around the building, there are many guesthouse, hostel, and luxury hotel, including with shopping arcade, department stores, brand name shops, good restaurants and fast food chain stores. MTR Tsim Sha Tsui is nearby for connecting to everywhere in Kowloon, Hong Kong, Lantau, and New Territories. Tsim Sha Tsui Ferry Pier is not only 15 minutes walk. Also China Ferry Terminal to Macau is near on Canton Road. The location is closed to the ultimate highlight of Hong Kong, such the Symphony of Lights and Avenue of Stars. I checked in about 8 am after checking out from USA Hostel, Mirador Mansion (It is good, but no room is available). There is a security guard in front of the elevator at Chungking Mansion to be of service for all residents. The housekeeper at New Peking Guest House was friendly, and in good cooperation. After paid the room, it was no room vacant, so I left my baggage with them, and go travel. I came again on 8 pm., and found my baggage was already in my room in good condition. Room is very small and incommodious. From the room’s door, I can only walk one step to my bed, and bathroom. However, it is no problem as my main purpose in Hong Kong is for travel, not for sleep. I went out in early morning, and back in late midnight during the time I stayed here. Bed, bed sheet, pillow, blanket is clean with a small shelf, which TV and telephone on it, at the end of my bed. The hanger for cloth is on the wall. My room has a small window, but no good view. A small shelf is attached at the edge of window with a small refrigerator under. The tiny bathroom is old, but clean. There is a tiny wash bowl with the mirror and little shelf over. Bath cream disposal is affixed on wall nearby. Shower is over the toilet bowl. There is also a window in bathroom. Computer and internet are available for free of charge, but I did not use them. The old man (I think he is an owner) advised me about this. He was very polite, and looked very kind. For overall, I feel this is fair for HKD 250 / night.", "Date": "November 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Earth", "Title": "“Worth going!”", "Author": "Edea", "ReviewID": "UR69542020", "Content": "Relatively cheap. I had read a lot of bad stories about hostels in Chung King Mansion and surroundings and a girl travelling alone was a little worried what it might become. And everything was really good. After booking, the owner Peter emailed me a map of the building and some additional information. When I arrived there, I got a small but _really_ clean room with a view to the street. Yet it was quiet as it was in 12th floor. Staff was very friendly and were ready to help with anything. I felt perfectly safe and slept like a baby. I tried to go back once without booking but it was fully booked that night.", "Date": "July 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "davao, philippines", "Title": "“RIGHT PLACE TO STAY IN THE HEART OF HK”", "Author": "joqs", "ReviewID": "UR66563679", "Content": "The hotel was clean and very frIendly staff. YOur at the heart of the city already even though it was located on the 12th floor. I mean hongkong is a densely populated area so you dont expect to stay on a flat bed hotel. Just DONT BOTHER indians at the entrance, just ask THE INFORMATION on the ground level as to where the elevator is. The manager Peter was very nICE AND HE EVEN CARRY ONE OF OUR LUGGAGE AND DELIVER US TO THE BUS STOP GOING TO THE AIRPORT.", "Date": "June 5, 2010"}], "HotelInfo": {"Name": "New Peking Guest House", "HotelURL": "/ShowUserReviews-g294217-d1599816-Reviews-New_Peking_Guest_House-Hong_Kong.html", "Price": "0", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">A1 12/F Block A Chung King Mansion, Yau Tsim Mong District (Tsim Sha Tsui)</span>, <span class=\"locality\"><span property=\"v:locality\">Hong Kong</span></span>, <span class=\"country-name\" property=\"v:country-name\">China</span> </span></span></address>", "HotelID": "1599816", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/b7/f6/88/new-peking-guest-house.jpg"}}