{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chelmsford, United Kingdom", "Title": "“Excellent Location”", "Author": "Bren069", "ReviewID": "UR119158863", "Content": "Spent 4 nights at Rhona's Rooms with my husband. This is my 4th trip to Rome, the first couple of trips had stayed in an expensive hotel but this meets the standards. There is noone there if you need to ask any details or advise but if you are happy with your maps and and to explore then the location could not be beaten. I will be returning early next year when the weather is good again.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Peterborough, United Kingdom", "Title": "“I would definately recommend Rhona's Rooms”", "Author": "Tosca20", "ReviewID": "UR86554811", "Content": "We went here for a surprise for my husband and it was perfect. It is a bit quirky in that there is no reception and you are met at the building when you arrive, but if you know that will happen it is fine. There is a number to ring and they are prompt. I would only stay in Room 1 as it has a window over looking the beautiful street, Via del Condotti, which is an exellent view and lovely to gaze out onto the street in the late evening. Breakfast is fine, you just ring from the adjoining lobby phone, we didnt wait longer than 5 minutes. It is lovely to have it in your room. The shower was fabulous! We cannot wait to go back and definately will as it was so convienient, lovely and just perfect. If you want a hotel and all the trimmings, then this isnt for you, but we loved the independance of it all.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gold Coast Australia", "Title": "“Must be best value for money near Steps”", "Author": "Butti18", "ReviewID": "UR85848199", "Content": "If you want somebody to talk to 24hrs a day at reception this is not the place for you. But if you want a clean place to sleep well in this is the place . Location perfect staff friendly breakfast included, wifi inrentet what more do yoy want. You get your own set of keys and you come and go as you like. Go for it !", "Date": "November 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Birmingham, Alabama", "Title": "“Great Location but no service”", "Author": "lauraopt", "ReviewID": "UR80103990", "Content": "This ended up being a really great place for us to stay during our trip to Rome. The location is incredible...you are right on Via dei Condottii which is the heart of the shopping district of Rome. You are walking distance to the Pantheon, Trevi Fountain, Spanish Steps, the metro station, and a taxi cab hub. You can basically get anywhere from this place fast by walking, taking a cab, or taking the metro. It is quiet and the rooms are clean and well decorated. However, the quarters are a little cramped and there are no windows on the internal rooms. I am pretty sure there are windows on the rooms facing the street. They are located on the 4th floor and there IS an elevator BUT it's dimensions are like 3x3 feet and it took forever to come. So we ended up hiking up the stairs most of the time. As far as location it gets and A++. Cleanliness A+. Now about the service. It is pretty much non-exsistent. Not that they were rude but that it is literally non-exsistent. There was never anybody around. The only time we ever saw anyone was the morning we arrived to check in and get our rooms and in the morning for breakfast. Other than that you are pretty much on your own. The lady that was there when we arrived and delivered our breakfast spoke very little english and had a hard time communicating with us. So if you like a concierge to give you advice and make reservations for you don't stay here. So, in summation: DO stay here if you want to be in a great location and don't mind not having a 24 hour service desk. Also be warned this is not a lux B&B so you dont have any \"special\" amenities. DONT stay here is you are used to 5 star fancy hotels with butlers", "Date": "September 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“LOCATION LOCATION LOCATION”", "Author": "MezMoo74", "ReviewID": "UR72782599", "Content": "I read the other review and well I think they forgot this was B&B .....not a 5 star hotel. We travelled with a group of family and friends and advised we would arrive at 8am in the morning and could we get an early check in.....we booked all the 4 rooms at the B&B. Thankfully they were awaiting our arrival and had all the rooms prepared for our early check in for no additional cost. We were advised to call the kitchen each day on the phone in the lobby when we were ready for Breakfast. We were also shown the machine to print out the cheap internet access voucher each time we needed to use the internet. We were also offered a computer to use if we did not have one. We were also shown on the phone in the lobby the quick dial for assistance when the B&B was unattended. Ludamilla who greeted us on arrival could not have been more helpful.....she made sure we were all settled ensured our second stay was correctly booked and she spoke various languages which amazed me! The beds were comfortable, the shower operated with no issues if you selected just the standard shower head. Breakfast was simple but delicious for a good start to getting in and around Rome. We stayed in Room 1 which I think is by far the best.....it has a window/balcony (not walk out balcony) that looks onto the street and if you look right you do get a nice view of the Spanish steps. We left Rhona's rooms to travel to the Amalfi Coast to get married. On our return to Rome we stayed again at the Rhona's Rooms .....Ludamilla had arranged champagne for our arrival and left a congratulations note on our pillow. WE LOVED staying at this property it was boutique and perfect for what we needed. We could wander through all the shops easy distance to Trevi fountain and some of our favourite osteria's and restaurants. Also Cafe Greco is just across the road from Rhona's rooms which is the oldest Cafe in Rome ....now they know how to make a good coffee and the locals know it! There are four flights of stairs to access Rhona's rooms but this is not so bad since you have to work off all the good Italian food, there is a small lift as well. I would have no hesitation is staying here again and again. Just remember its a B and B and not a hotel with reception staff and porters its a good base to get into the heart of Rome! Enjoy! The price of this B&B is amazing considering the cost of accommodation in Rome and its prime location.", "Date": "July 28, 2010"}], "HotelInfo": {"Name": "Rhona's Rooms B&B", "HotelURL": "/ShowUserReviews-g187791-d1626885-Reviews-Rhona_s_Rooms_B_B-Rome_Lazio.html", "Price": "$106 - $200*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via dei Condotti, 23</span>, <span class=\"locality\"><span property=\"v:postal-code\">00187</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "1626885", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/73/9c/739cb203362feaac1d8d940419e954cd1large.jpg"}}