{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Cakovec, Croatia", "Title": "“Hotel is o.k”", "Author": "IRena1005", "ReviewID": "UR128132274", "Content": "Hotel id good. Rooms are a little bit small, but there is everything you need. We were in the room only t night because we were all day in the city, which is the most beautiful place in the world! Breakfast is tipical for turks. Staf is excelent. they were very helpful.", "Date": "April 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Tehran, Iran", "Title": "“not so bad”", "Author": "samira5980", "ReviewID": "UR127272702", "Content": "staff and room service are not bad , but not very great ;) very small rooms , good breakfast ... walls are so thin and you can hear everything from the room next door ... one of the staff , his name is \"sugar\" , he can speak English and french and he was very helpful ;) neighborhood is not good ,full of car shops and the street is full of car , but the hotel is near metro station and bus station and it's a good point.. it was a good experience , I've had read lots of bad things about this hotel , but it was so much better ;)", "Date": "April 5, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "cape town", "Title": "“situated in a carparts and trucking area”", "Author": "aqsCapeTown", "ReviewID": "UR119039556", "Content": "i stayed at this place because my booking was messed up.if u lookin for budget hotel this will be fine.firstly this is not a 4* hotel.the pictures have been taken very professionally to deceive the customer.a lady by the name of ahu was the only helpful person.in fact she belongs in a more tasteful hotel but thats her story. the hotel is situated in a busy commercial area where carparts are sold. the wall of the rooms are drywalls so u can hear everything in the next room. i was able to remove the safe from the cupboard and place it in the middle of the room.so the safe was of no use.there are 2 lifts that can take a max of 5 people.so if a group comes in its practically one person at a time to go up.the place is extremely small.rooms lobby bathroom etc are all small. .there is free wifi on all floors including lobby .the code applies to all wifi names in the hotel.my rate included breakfast but i was asked to pay for scrambled eggs fried eggs etc only boiled eggs were free.fresh orange juice costs tr 5 at the breakfast hall.there was no fruit at all .very basic unimpressive breakfast.for the 3 of us we had 1 bed a fold away bed and a sleeper couch.this was my 2nd trip to istanbul and this hotel is a disgrace to istanbul,for the price u pay.i have pics that will show you most of everything at the hotel.also note i have a picture of the turkish star rating emblem which was not present at this hotel.the hotel does transfers to ataturk airport at tr 40 and goken airport at tr 120.i had to make the best of a bad situation so just tolerated everthing and left.", "Date": "October 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Muscat, Oman", "Title": "“the best staff ever”", "Author": "Basheersalem", "ReviewID": "UR117652627", "Content": "i stayed there with my family from 3rd till 8th July , it was really nice stay the hotel was very clean the staff were very Friendly especially , Mss Ahu the Receptionist and Mr Sugar . the hotel is five minutes walk from the Metro and 10 minutes from the market we really enjoyed our stay there and will be back there next year inshaa allah", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Beirut, Lebanon", "Title": "“Never stay at this Hotel”", "Author": "SaraDallal", "ReviewID": "UR117616983", "Content": "The Hotel website has nothing to do with the actual hotel!!! the rooms are very very small. Its is not clean at all. The minute we stepped into the room we found dust on the table and the bed. Very noisy and you can here everything that happens in the room next to you from flushing the toilet to what they are watching on TV or just if people are talking. Breakfast was not tasty at alllll. The address of the Hotel is very hard to explain to taxi drivers. The neighborhood of the hotel is bad and full of shops that sell car parts. Not a friendly area for women. The hotel lobby is very small as well. You don't feel safe in the hotel at all.", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "2.0", "Value": "3", "Service": "1"}, "AuthorLocation": "London", "Title": "“nice hotel terrible service”", "Author": "lukebridges", "ReviewID": "UR116043115", "Content": "On the bright side, this hotel is clean, comfortable and well priced. The swimming pool really is excellent. There was rarely more than 2 people swimming and there was enought space to sit, sun bath and chill out. More than welcome after a hot day touring the grand bazaar etc. Rooms are spacious with comfortable beds, good air con, internet access, great bathroom and quiet. Couldn't ask for more and I wouldn't wanted to have stayed any closer to the old district. However, service was very poor. Hotel staff's english was either mediocre or non at all. I'm not being an arrogant English man here expecting that they know my language. Our party spoke spanish, german and French as well as English. For an international hotel you would expect better language skills. Asking for anything became farcical. Food orders required long discusions amongst staff even when we pointed to the dish on the menu...it still arrived wrong. Drinks never arrive and were over priced with 18% service charge! An iron took 4 hours to appear...despite several requests. They tried to charge for minibar items we didnt take...not once but in each of our three rooms. Tried asking them....Was my room already paid for? Are you just taking a deposit? ....they just ignored me. We only stayed 4 nights you'd think we were there longer! Shame as hotel itself was great. Won't go back.", "Date": "July 31, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Agadir", "Title": "“credit card fraud !”", "Author": "touftitrit", "ReviewID": "UR76986072", "Content": "I stayed at the City hotel for a week everything was ok not brilliant but not bad. 2 months later the hotel reused my credit card and charged 709 Euros ! my nightmare started then because the manager of the hotel refuses to refund the money back although he agrees that it was an invalid charge. First he said that it was a mistake and that he would refund the money in 48 hours this is the third month and i am still waiting the refund. the Hotel is closed down on booking.com and other websites too. So i came to realise that it was not a mistake but a fraud!! You are warned !!!", "Date": "August 26, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "UK", "Title": "“Book here sat your peril!”", "Author": "ladybird17", "ReviewID": "UR65234219", "Content": "We arrived at this hotel after a delayed flight from the UK, it was pouring with rain, we were tired, wet & hungry. The hotel insisted they had no reservations for us, despite us having the confirmation. After a lot of shouting & gesticulating, they put us in a car and we landed up in the sleaziest part of town in a hotel I wouldn't have dreamt of staying in. To add insult to injury, it was my birthday, and we were due to have a really special meal, but we landed up having McDonalds! And even worse, the hotel manager harrassed my female business colleague both face-to-face and by telephone to her room - until at 1am she unplugged the phone and jammed her suitcase and a chair behind the door. The City Hotel then changed their story when the booking company contacted them, and said my card details were not valid which was utter rubbish as it is a company debit card and was used throughout our whole trip with no problem. I visit Istanbul & Eastern Turkey regularly and I would NEVER recommend anyone books at The City Hotel.", "Date": "May 25, 2010"}], "HotelInfo": {"Name": "The City Hotel", "HotelURL": "/ShowUserReviews-g293974-d1631021-Reviews-The_City_Hotel-Istanbul.html", "Price": "$88 - $133*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Askaray Mah Namikkemal Caddesi Manastirli Rifat sokak, No:33</span> | <span class=\"extended-address\">Askaray/Fatih</span>, <span class=\"locality\"><span property=\"v:locality\">Istanbul</span></span>, <span class=\"country-name\" property=\"v:country-name\">Turkey</span> </span></span></address>", "HotelID": "1631021", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/64/93/5c/restaurant.jpg"}}