{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Farmington Hills, Michigan", "Title": "“excellent value, location. just one issue”", "Author": "Rob a", "ReviewID": "UR123231917", "Content": "excellent value in playa considering the location, which as it turns out is better than you might think, if you're not familiar with p.d.c. or haven't been in a few years it's easy to think that on the beach or main street(5th ave) is best and anything else is just degrees of worse. well some of that is true, 5th ave is still the center of dining/shopping etc. but P.d.c. is growing and main street is definitely not the only choice for those things. The other thing that has grown is the noise from bars(all night) and traffic so the easy 5 block(maybe 7 min) walk from the plaza to the beach is just about the right distance away from most of it. hotel is less than 3 years old so it's all in new condition, no bugs or pests of any kind. excellent family oriented service, very friendly and helpful. the included breakfast was definitely better than average. maybe Plaza's biggest problem is it's bargain price, Because of it I think there was quite a younger clientele which made for a noisy 1-3 am and with the big open hallway and there being no carpet to knock the noise down it was more than annoying.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ohio", "Title": "“Excellent!”", "Author": "lovetheyucatan", "ReviewID": "UR58503925", "Content": "We enjoyed our 5 night stay at Hotel Plaza. Rooms were spacious, clean and beds comfortable. We stayed in the 2 room/suite with small kitchen and decent sized bathroom with large shower. Plenty of hot water w/good pressure! Nice staff and room cleaned very well daily. Great Location! Thank you for your hospitality everyone and hello to Gina at the front desk! We will be back!", "Date": "March 13, 2010"}], "HotelInfo": {"Name": "Hotel Plaza", "HotelURL": "/ShowUserReviews-g150812-d1633108-Reviews-Hotel_Plaza-Playa_del_Carmen_Yucatan_Peninsula.html", "Price": "$55*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">5ta AV bis Esq. Calle 10 Nte Lt. s/n</span>, <span class=\"locality\"><span property=\"v:locality\">Playa del Carmen</span> <span property=\"v:postal-code\">77710</span></span>, <span class=\"country-name\" property=\"v:country-name\">Mexico</span> </span> </span> </address>", "HotelID": "1633108", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/62/37/1c/hotel-plaza.jpg"}}