{"Reviews": [{"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“No room”", "Author": "femto2", "ReviewID": "UR127573948", "Content": "When we arrived in this hotel, they had the reservation printed out and asked us to pay in advance. Once we had payed, they started to explain that there is no free room any more and that they will bring us to another hotel outside the center. Of course we didn't agree and ended up looking for another hotel ourselves. DO NOT BOOK HERE, YOU COULD END UP WITH NO ROOM AT ALL!", "Date": "April 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "pwllheli", "Title": "“Great location.”", "Author": "jjlljjll", "ReviewID": "UR125742183", "Content": "Hotel was in a great location,2 minutes from main attractions,but in a quiet street. Have stayed in many hotels in istanbul,but for value ,cleanliness and best of all,central heating to come back to,as it was freezing and snowy.,Will be back again. Large bathroom with jaccuzi bath with great shower attachment. Only thing missing was kettle in bedroom,,but that was solved by buying a travel kettle for 8 lira,approx Â£3 from market. Will be back later in the year.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Disappointed!”", "Author": "Highlander188113", "ReviewID": "UR120419319", "Content": "We were very disappointed as we got a room with balcony which was completely closed (no view at all, can you imagine?) instead of a big room with Bosporus view. We asked for another room, but the hotel was almost booked out. So we finally got another room, but which was very small, had no view, a bath tub that did not work, a completely dark bathroom (no windows) etc. - all in all, not the comfort we had booked - as we had been looking forward to staying in a nice an comfortable hotel close to all the sightseeing highlights. It's to say that the hotel location is marvellous and some of the staff is very nice (not all)! But that's it - otherwise we were very disappointed.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "fredericton nb", "Title": "“Location, Location, Location!”", "Author": "jd82", "ReviewID": "UR120310827", "Content": "When first entering the basilica hotel i noticed how cold it was inside, I thought to myself please dont let the rooms be this freezing. I was greeted by the main guy that seems to work there 24/7 (wish i had remembered his name) he got me my keys and off I went. The room was large, warm and clean. Had a view of the street which was fine by me since its located in the old town. The beds were comfortable, and the rooms well equiped with amenities. The bathroom was large with what seemed to be a new jet tub. Heres the only thing that kind of bothered me, the tub has a shower head outlet that you pull out and hold onto it while showering yourself, no big deal Ive used these before, the thing is there was no shower curtain surrounding the tub! I had to lean over the tub to wash my hair. That being said, everything else was great especially the service. The location of this hotel is magnificent, literally a 2 minute walk to the blue mosque and hagia sofia and the under ground basilica (i recommend you see all three). The main street is filled with shops of all kinds. A 15 minute walk in the other direction and you're at the ferry to cross over to the Asian continent. All in all i would highly recommend this hotel, as I stated before the service was exceptional, I had missed my flight leaving Turkey and the next flight was the following day, I returned to the Hotel and the Turkish fellow was able to get me into a room immediately. Great service, great country to visit! A couple of things Id recommend to do in Turkey is eat at as many different restaurants or corner stands as possible, the food is amazing. Get a turkish bath at the oldest turkish bath house in the world, I forgot the name but google it and you'll find it. Also visit the largest indoor market and take advanage of the cheap prices. And last but not least, buy some Turkish Delight!", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Reston, Virginia", "Title": "“Excellent hotel! Best we stayed at in Turkey!”", "Author": "RedskinsRule", "ReviewID": "UR119846126", "Content": "Beautiful rooms, perfect location, amazing views, delicious breakfast buffet, friendly staff, and great prices. What more could you want? We stayed at 3 other hotels in Turkey, including the Sultan House also in Istanbul, and the Basilica is far better. We already planned our next trip to Istanbul and we will certainly be staying at Hotel Basilica!", "Date": "October 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great hotel, perfect location”", "Author": "Dghand", "ReviewID": "UR119335989", "Content": "Stayed for a night before cruise. The location could not be better, 5 mins walk to Hagia Sophia. Room was good size with whirlpool bath. Staff very helpful. The breakfast was extensive with lots of great Turkish food and also western European hot dishes. Coffee was a bit strange but tea was fine. Great hotel. If you want to eat and have a beer go left out of the hotel past Crown Plaza on right and there is a great restaurant called Altin Kupa.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Top Location”", "Author": "aptmelb", "ReviewID": "UR118590934", "Content": "This Hotel is in a great location, close to many attractions and walking distance to Agia Sophia, Grand Bazzar and easy to use public transport. Staff very friendly and eager to please and language not a problem. We had constant difficulty using old room card keys and the staff were very apologetic. The entire hotel recieved new cards on our last day so this should not be a problem. Rooms were clean but foyer carpet and interior of lift doors grubby . Included breakfast was delicious and varied. I would definitely stay at this most convenient hotel again and highly recommend it for the middle of the road traveller.", "Date": "September 26, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Thessaloniki, Greece", "Title": "“the most convinient location”", "Author": "neraidomama", "ReviewID": "UR117331554", "Content": "polite stuff,nice rooms,clean but the greatest thing of all was its location.Next to Agia Sopria, the kinsterna,the tram that takew you all over the European side,near to Vosporos...The next time it wil be there again and not Taxim whitch is noisier and without great view!", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "uk", "Title": "“great value”", "Author": "Michael F", "ReviewID": "UR116532954", "Content": "good position for site seeing, very comfortable hotel, really friendly staff who could not do enough to help", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Seville, Spain", "Title": "“Magnifico. Sin duda volveria.”", "Author": "Nataliasvq", "ReviewID": "UR116029003", "Content": "We steyed in this hotel for almost two weeks. The vacacions started horribly as the hotel ARDENBOUTIQUE we reserved at home with laterooms.es and which is next to this one was horrible. You couldnÂ´t even move there so small it was! So after one day of quarelling we succeded to change the hotel and MY GOD! we founf this one, Basilica, which fortunatly had the rooms we needed for a very good prices and the VIEWS!!! They were marvelous! our room was a double one but it was so spacious that it could be a triple easily. The interior style it was like luxury turkish (as later we told the stuff that that hotel could easily be 5 star hotel). And there were 2 windows: from one window you could see the Santa Sofia very closely and from the other one the Bosforo. It was really wonderful!!! The stuff very nice, helpful, attentive. The turkish bath (with massage) they have downstairs unforgettable!!! In the centre of the city, a lot of restaurants near there, museums etc. Perfect place, perfect quality! I DO reccomend it!!! Have nice time", "Date": "July 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Wonderful location”", "Author": "DaveEssel", "ReviewID": "UR115512925", "Content": "Perfect place within easy walking distance of AyaSofiya, Topkapi, and the Grand Bazaar. Comfortable but eat elsewhere if you want beer or wine with your meals (dozens of places to choose from within literally three steps of the entrance) as the hotel is an alcohol-free zone.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great Location...but little rough round the edges.”", "Author": "Pekingduck123", "ReviewID": "UR114825113", "Content": "+Ve: Fantastic location, only 2 minutes walk to Aya Sohiya and Blue Mosque. Lovely Terrace with amazing views. Room and toilet of reasonal size Clean. -Ve Looks and feels a little dated. Everything we touched seemed to fall apart Breaky was a disaster - same everyday even the veg/milk werent fresh. Only good thing was coffee. Very slow services - asked for iron, n it arrived after 3 hours. Guy at reception was annoying making silly comments. Few other hotels around the area which looked and seemed a lot better.", "Date": "June 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Adana, Turkey", "Title": "“perfect”", "Author": "bergensaracoglu", "ReviewID": "UR112549010", "Content": "Ä± was stay in this hotel around 2 weeks ago with my husband in honeymoon and there is wery beautiful.we cant forget this holiday.room 503 wery good panoromic view.there is excellent", "Date": "June 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berlin, Germany", "Title": "“best place”", "Author": "sarahsera1987", "ReviewID": "UR97848523", "Content": "in my opinion the basilica wonderful hotei in the Ä±stanbul anda in the turkey.....Ä±f you want nice hotel in the turkey...absulutely you shold stay here....", "Date": "February 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Great location..friendly staff”", "Author": "nam40", "ReviewID": "UR94866416", "Content": "Location superb, hotel staff excellent the manager mr Abdulah Atalay very helpful.. Spacious and very clean rooms.. Absolutely value for money.. No doubt I will stay there again !!!!!!!!", "Date": "January 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mangalia, Romania", "Title": "“Excellent location”", "Author": "Sorin64", "ReviewID": "UR94445442", "Content": "Service was excellent , personnel very friendly and allways happy to help with any informations and directions to the most beautiful sites of the city. The room was very clean and all equipment functional.Location of the hotel is the best part , in walking distance from the main attractions like Agia Sophia , Blue Mosque ,Grand Bazaar .Also you can take the tram if you want to see and the more far sides of the city. I am not a qualified tourist but i surely recommend this hotel to people wanting to visit Istanbul.", "Date": "January 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Not bad but little attention to detail”", "Author": "CWG1979", "ReviewID": "UR91135146", "Content": "We stayed in room 304 for three nights. Discovering a draught we found that the fire escape door hadn't been fitted and there were gaps of up to 1cm around the frame - the door itself had sellotape around it to attempt to keep the draught out! We asked three times before someone came to fix the safe (\"five minutes, five minutes\"); we asked for bath towels which never arrived; and on two days out of three there was no milk at breakfast. On our first night a large piece of sheet metal was blown off the roof onto the iron fire escape directly outside our window and fell down one flight; the next night several slate tiles joined it. However, smart and comfortable enough, friendly staff (when they understand you) and a perfect location.", "Date": "December 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“good hotel”", "Author": "venynajuned", "ReviewID": "UR90818742", "Content": "mr atalay, the manager of this hotel is very helpful and always try to help. as soon as we have received the confirmation from the hotel, he sent us the email if we need any help for the pick up airport and any other things he can help. we are arriving istanbul at 4.30 am in the morning, arriving at the hotel, he just give us the rooms to stay without being asked if we can do the early check in. the room is clean, the bed is good, the service is good. no complain at all. definetely we are going to stay at this hotel again", "Date": "December 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ankara, Turkey", "Title": "“Wonderful Screen”", "Author": "msunlu", "ReviewID": "UR90604845", "Content": "i prefered this otel because in the town center and bluemosque, hagiasophia, Sunken Palace, Grand bazaar etc. is 2 min. walking... Turkish Bath and Screen is wonderful.. i recommended all my friends..", "Date": "December 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“OK, Some staff great, others not so good”", "Author": "hemsleys", "ReviewID": "UR90265599", "Content": "We got a really good deal on this hotel, so I will say that. However, I found a lot of things were harder than they should have been. We kept getting locked out of our room, and were talked down to, as in 'can't you figure out your key?\" when, lo and behold, the key card was scratched. Things like this. One of the staff in particular though was great. He works the night shift, and he was awesome. Overall, the location was pretty unbeatable, although if we had paid normal price I would have been a little choked at the general level of service we received.", "Date": "December 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“WONDERFUL, PERFECT...”", "Author": "298484John", "ReviewID": "UR89587460", "Content": "We stayed at the hotel for seven days. Hotel is very nice and great. We liked the otel.", "Date": "December 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Keyport, New Jersey", "Title": "“amazing experience”", "Author": "johnGrossini", "ReviewID": "UR88966560", "Content": "it has a beatiful bluemosque view. i love that. and stuff were very kind and polite. thanks for everything guys. i ll choose you again next time.", "Date": "December 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lebanon", "Title": "“Basilica hotel is simply great.”", "Author": "GraceLebanon", "ReviewID": "UR82332328", "Content": "Basilica Hotel is a great hotel to enjoy a holiday, it's located in the center of the city. The service is wonderful and the workers are very friendly. BASILICA hotel is 30 mins from Ataturk Airport . Visit Istanbul attractions like the Ataturk Cultural Center 10 minutes* walk from the hotel or the majestic Blue Mosque. The hotel also have \" Turkish Bath \" and \" Sauna \"", "Date": "October 6, 2010"}], "HotelInfo": {"Name": "Basilica Hotel", "HotelURL": "/ShowUserReviews-g293974-d1636173-Reviews-Basilica_Hotel-Istanbul.html", "Price": "0", "Address": "<div class=\"amenFloat\">", "HotelID": "1636173", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/b5/ff/6e/terrace.jpg"}}