{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hagendorn, Schweiz", "Title": "“Quiet, clean, friendly”", "Author": "Holywood07", "ReviewID": "UR124231818", "Content": "We came here with our 7 months old son. We were looking for a 2 room place with kitchen that allows us to prepare baby food. The following we found: - very friendly and competent staff - very clean hotel in general (incl. rooms, shower room/toilet and other facilities) - two nice spas on the roof-top as well as many sunloungers - high quality soaps/shampoos for showering/washing hands (compared to other low-cost stuff that can be found in some places) - nice beds - nice mondern furnishing that makes it easy to feel like home - well filled (mini) bar, incl. a variety of drinks, sweets and nosh (chips, noodle soup cups, pop corn, ...) - well situated; at the upper end of 5th ave, close to where the \"shopping mile\" starts; only about fifteen to twenty minutes to walk to huge super markets (i.e. \"Mega\" or \"Wal Mart\") - about 5 minutes walk to the beach - about twenty to twenty-five minutes to the ADO bus terminal (all along the 5th ave) What we missed/found not so good: - we wanted to rent a baby bed and a baby's high chair for two weeks; the pricing was unreasonably high (15 USD per day each), means more expensive than if you'd buy it. The best offer was both items for the price of one - but still enough to buy your own (we actually found both items even cheaper in the super markets). Normal cost we found elsewhere is USD 30.- per item per week (which is what we expected). - for some a plus, for us not (nowadays): there was no option to tell the cleaning staff to leave the towels - they were changed every single day! Not very \"green\". - when opening the kitchen cabinets, a smell of mildew came out; we could not find the source of it though - there were no cooking plates as we expected - the microwave was all to cook things - when we arrived, water came out only from half of the holes in the shower head, and from each hole only half of the amount - but it was easy to disassemble and clean; not a big deal - two small windows can be opened and closed by crank handle; both of the windows were unhinged and therefore could not be opened/closed by the crank - again quite easy to fix - no dishwashing detergent - a very personal thing: I got dorsal pain because of the bed; my wife not though In general we can easily recommend the hotel to others. It's a quiet, clean and friendly place with only few unpleasant things that don't weigh much. We might come back here again.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Baltimore, MD", "Title": "“Affordable Modern Hotel Just Off of 5th”", "Author": "bzambito", "ReviewID": "UR122104172", "Content": "This is a very clean, modern, quiet hotel just around the corner from all the main attractions on 5th. The rooms are simple but hip and we liked having a full sized refrigerator and comfy bed. The rooftop deck @ hot tubs are nice also. Service has been great on 1 occasion the toilet clogged and on another we couldn't get the safe open. Someone came right away both times. A lot of restaurants on this side of 5th are recommended so we tried several - El Diez & Piola were especially good. This was our first time staying in a regular hotel in Playa. We've been here 3 times before and always stayed in high-end all inclusives. We would stay here again..", "Date": "December 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Won't stay again”", "Author": "Jannagu", "ReviewID": "UR117118698", "Content": "Pros: - Price was very good comparing with other accommodations in Playa del Carmen. - Kitchenette. They had a fridge, microwave and a blender. (the blender was wired and useless , it would have been better to have a kettle of a coffeemaker). - Close to the beach - clean Cons: - Service. The reception staff was not very nice. They gave us wrong information and misled us, so don’t count on them. - Quiet remote from the center (but still there are some great restaurants around). - Tiny pool, so don’t count of on it. - On the day of checkout our room started to smell really bad with sewage smell from the toilet. Good thing that we were leaving…", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Houston, TX", "Title": "“Nice hotel if you want to stay on the quite side.”", "Author": "Nar3ly", "ReviewID": "UR116725196", "Content": "We stayed at Bambu Suites in June and yes hotel is nice and very clean. This hotel feels more like if you are staying in a nice apartment. Rooms are very nice and spacious. I agree with the previous review it would be nice if they could have a sofa in the living room and another flat screen. Can't complain about the staff they are very helpful. Beach is about 5 minutes away which is good. Good food is just around the corner, Piola is an awesome pizza restaurant. We loved it! La Vagabunda is one of the best restaurants for breakfast at Playa very close to Piola on 38th street. If you want cheap yummy tacos there is an awesome little restaurant rite in front of Coco Bongo. Highly recommended! If you like to stay at a quite relaxing hotel, this is the place for you! :)", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“Small and quiet peaceful place”", "Author": "faliahut", "ReviewID": "UR111145321", "Content": "Beautiful designed hotel, located in a calm corner. Excellent location, you have one of the most popular places in Playa del Carmen nearby (Playa Mamitas) , the 5th ave. is also close by car but if you enjoy walking at night it's like 20 mins away. Far from all kind of noise , the rooms are made for resting. Great space, comfy beds, nice bathroom ( they have organic products for shower) , lcd tv's, a small kitchen w/ microwave and fridge. In the roof you can find two jaccuzies and a kitchen in which you can have a grill ... The pool although is small is nice and it has an area for small children. The personal is really kind and willing to help you and the best of all the prices, you get an excellent service for a really good price.", "Date": "June 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Location was great, CLEAN and friendly service.”", "Author": "Tawanda1206", "ReviewID": "UR99951813", "Content": "My husband and I stayed here for 5 days in February for our ten year anniversary. It is off of 5th avenue (main drag in Playa del carmen) by only a block or so, which makes the price more reasonable than other places. It's close enough to walk to everything you would want or need. Walked to Walmart, but took a taxi back b/c of all of our stuff. :) Very helpful staff. Took their advice every night for our dinner plans. All of them great. One they didn't mention but was FABULOUS was Mestizo. A little Italian place, owned by a couple from Rome. We were too busy to use the hot tubs on the roof, but had meant to. They were very clean. One was normal temp. the other a little cooler for day use I'm sure. Bed was a little stiff for me, but my husband loved it. Pool is really for decoration purposes only. Very small. We chose this place for the kitchenette that it included. It was nice to have a full size fridge. Wifi access is very fast and free. We were able to Skype with our kids with no issues. We would stay here again.", "Date": "March 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Great location and super comfortable”", "Author": "joferto", "ReviewID": "UR91057968", "Content": "This hotels has opened a year ago and it really shows. The location is superb, by 5th Avenue and you can walk everywhere and enjoy the restaurant, shop, close to the beach. The rooms are very spacious with a nice decoration, the linens are really nice and the bed are very comfortable. It even has a blender!! We stay only for one night but we could see us staying here for longer with family or friends. It has a minibar well stocked and also a microwave and some china, glasses. The pool is very small you do not come to spend the time at the hotel when you have the beach and great ocean so close. The roof has 3 jacuzzis and is very attractive, they are planning to have a bar in a near future which is not bad. Just be aware that location is on 5th ave and 40th, just opposite side from the ferry. For us it work perfect and I definetely come back.", "Date": "December 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Modern hotel, great location”", "Author": "SaraAlice", "ReviewID": "UR73322114", "Content": "Bambu suites is in a great location, close to beach and main street on the new end of 5th Avenue. The hotel is lovely with very comfotable beds, huge rooms and kitchen/dining. Amazing value for what you get. The pool is very nice and so are the spa's on the roof. Definately reccommend it!", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Norway", "Title": "“Awsome designer hotel with great value”", "Author": "arnfinnu", "ReviewID": "UR58102315", "Content": "Me and my girlfriend had a junior suite and I was surprised when I got in the room. There is a nice kitchen with a big refrigiator w/freezer , big shower, flat screen, wi-fi and a design which appeals to both young and families. The staff was really friendly and even though we arrived late and wanted to use the jacuzzi at the roof front they took care of it. The location is close to the beach and at the end of main street. This I can recommend to anyone", "Date": "March 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Mexico City", "Title": "“Beautiful stay, great suites, close to the action!”", "Author": "HaruMexico", "ReviewID": "UR53770592", "Content": "This suites are brand new, just started operating in Dec '09, it was a nice surprise to stay there, everything is in place, everything new, the staff is good qualified, I am definitely going back there.", "Date": "January 18, 2010"}], "HotelInfo": {"Name": "Hotel Bambu Suites", "HotelURL": "/ShowUserReviews-g150812-d1641107-Reviews-Hotel_Bambu_Suites-Playa_del_Carmen_Yucatan_Peninsula.html", "Price": "$63 - $130*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">40 esquina entre 5ta y 5ta bis</span>, <span class=\"locality\"><span property=\"v:locality\">Playa del Carmen</span> <span property=\"v:postal-code\">77710</span></span>, <span class=\"country-name\" property=\"v:country-name\">Mexico</span> </span> </span> </address>", "HotelID": "1641107", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/b2/0c/e9/alberca.jpg"}}