{"Reviews": [{"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“Right place, right price...for a short stay”", "Author": "JTL61", "ReviewID": "UR127597211", "Content": "We needed a room for just one night for our visit to Universal Studios and scored an excellent nightly rate on Priceline. Nearly every other reviewer has covered the bases. The location is good if you are thinking about being close to Universal. There is nothing around it except for the market and 7-11 across the street, both featuring homeless in the area. Not a real problem if you are looking for a decent night stay. The rooms are actually pretty nice. Everything worked well. Good flat panel TV, comfortable bed, separate sink from shower and ample space. No pool, hot tub or restaurant on site. Workout room is 3 machines. Short summary; in any other neighborhood, this hotel would be 3.5 stars. It worked well for us at the price.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "San Francisco, California", "Title": "“Clean and Affordable”", "Author": "PTO-Guy", "ReviewID": "UR126949849", "Content": "I was looking for a place to stay near Universal Studios for 3 nights. Like Lostn Transit I didn't want to spend $180 a night plus $18 for parking at the hotel near Universal Studios so I decided to stay at this Best Western. My wife, my two kids, and I had a car so I didn't mind staying at this location, and we weren't going to stay out too late anyway. The hotel is in an industrial part of town as the reviewers say. I personally didn't think the location was as bad that some people made it out to be. Anyway, to get into the rooms of the hotel you would have to walk by the lobby/front desk. It's not a motel where you just park outside and walk to your door. Parking is inside and underneath the hotel and from there you walk to the lobby to get to all rooms. The rooms are clean and the beds are decent. This place is probably at most 2 years old so everything looks fairly new (except for the worn towels). Instead of curtains, they have shutters. There is a minifridge, microwave, AC/fan, and 27\" flat screen TV. The complimentary breakfast was decent. It had the basic danishes, bread, muffins, hard boiled eggs or scrambled eggs, cereal, oatmeal, and OJ. Also you can make your own waffles but there might be a line for that. One of the complaints I had was that the shower head was one of those low flow ones, so you can't take a super quick shower. However, probably because of the low flows, there is always super hot water even during the morning rush (which even at nicer hotels is problematic). I also thought that the small hair dryer was a little weaker than the normal small hairdryers found at these hotels. Parking can be a problem but I was lucky to park on the side where you are not blocked for 2 nights. The other night I parked on the doubles side where you can get blocked. I did get blocked but in the morning the front desk person was able to move the truck out for me to get out. (You have to leave your key at the front desk if you are parking on the doubles side and are on the outside blocking some other vehicle). Universal Studios is about a 20-25 minute drive. Hollywood is probably another 10 minutes away. There is a Ralph's and CVS which is about a 2 minute drive. I wouldn't stay here without a car. I didn't see the buses at all so the wait is probably quite long.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Clean, comfortable, it is LA though.”", "Author": "V_LFAV", "ReviewID": "UR126121981", "Content": "If this hotel were anywhere else it'd be double the price. It is in North Hollywood and smack in the middle of a hard working class hispanic neighborhood. I moved my daughter to her apartment that is 1/4 mile away from the property. The neighborhood isnt bad, just different than what one might expect a hotel to be in. Walking around out front at midnight on a weekend night isnt recommended. Yes the hotel could use security but the rooms are clean, the bed was comfortable and I got a good nights sleep. When the kids were little I would not have stayed there. Alone, I was fine and very comfortable. The breakfast is the traditional american free hotel breakfast. Coffee, cereal and breads and juice. Nothing close by to eat really, burgers, donuts, sushi etc..etc.. Nothing worth mentioning. Just an average, clean inexpensive hotel. Only real negative was the cold uncaring attitude of the front desk staff.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Portland, Oregon", "Title": "“No complaints - 3 nights spent Feb. 2012”", "Author": "LostinTransit10", "ReviewID": "UR125010452", "Content": "Just finished three nights at the Best Western Burbank Airport hotel. I was traveling in LA with a larger group. They were staying at a Universal City hotel that was $180+. a night plus $18. for parking. That was more than what I wanted to spend, so I elected to save the $ and say a \"short\" distance away. The front desk staff was great all three times I encountered them. The room was very clean. In fact, I am not sure how old this building is, but based on the condition of my room, I would guess less than a year. All the furnishing/bath/bed were in excellent shape. The room was much larger than most I stay in. If the was one minus, it was that I could here TV and kids voices through the walls between about 8 and 11 pm. I always travel with ear plugs to I used them. That managed to block out about 90% of the noise - enough to fall asleep. I had a car, so I did not walk anywhere in the area surrounding the hotel. I had looked at it using google maps before I made the reservation and could tell based on experience that It would not be healthy for me to venture out. I drove into the under building parking lot each evening and drove out again the following morning. If I were you, I would plan on doing the same. I felt very safe driving to and from the hotel. The parking is free. The continental breakfast was OK. Also free. I paid under $90. per night (including tax). It was worth every penny. Finally, the trip up from Universal City in the evening was a short 10-15 minutes drive. From the hotel to Universal City in morning rush hour was a tense 40 minutes in bumper to bumper, stop and go traffic. The pic of the room does not do it justice. The photo captures maybe 1/5 of the room.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manila, Philippines", "Title": "“Affordable, Clean, & Practical”", "Author": "shangot", "ReviewID": "UR121617728", "Content": "We needed a hotel to stay the night to catch an early flight in the morning. This hotel is near the airport but you still need to use the freeway. It's also walking distance from Ralph's, CVS & Ross. Unfortunately the breakfast area is so small it can only fit 4 chairs... imagine? Food options range from bread, eggs, cereal & fruit... so not bad. But nonetheless, bathrooms are clean, carpets look clean, beds are comfy and sheets are clean. The room (king bed) is bigger than most hotels and it also includes a mini-ref, bath tub as well as iron and blow dryer.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Sacramento, California", "Title": "“Clean Newer Hotel... However you might wanna read my comments”", "Author": "calguysactown", "ReviewID": "UR121440791", "Content": "This hotel is relatively new and the room I was in was clean and updated. However, the morning breakfast (which was supposed to start at 0600-9000 hrs - rarely began at 0600) was never open at 6:00 a.m. when I needed to leave the hotel. It would open at 6:12-6:15 daily-I stuck around one morning to see how long it would take the maid to open it up; I complained about this nothing was done to correct the issue. If you need high speed Internet, this isn't the place for you; my speed-test on several occasions was less than 1 mbps, often came in for downloads at .78 mbps (slightly faster than dial-up). Also, the hotel is not really close to anything; it is in a mostly commercial/industrial area away from major shopping/dining areas. Oh, and if you happen to get this place on Priceline.com get ready for a room facing a very noisy and busy major thoroughfare (these are the ONLY rooms available for Priceline guests). I attempted to change rooms the first night but was told that I would have to contact Priceline.com and pay an additional fee to get a quieter room. Just as few objective observations about my stay.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Berkeley, California", "Title": "“Very Clean, Close to Universal Studios!”", "Author": "BrittaneyB", "ReviewID": "UR121204200", "Content": "A Friend and I stayed her April 2011. We were meeting up with my grandparents to go to Universal Studios. My Grandparents stayed at the Hilton that is on the Universal Studios property, they payed way more then us and it seems that we had a better experience then they did. This hotel is about a 10-15 min drive to universal studios depending on the time of day and traffic. The continental breakfast is great! They have a waffle maker to make your own waffles, and then the typical cereal, pastries, coffee and orange juice. But the Waffle's just seemed much better than what you typically get at a hotel's free breakfast! The hotel is very clean and looks very new. The Only complaint and its not really a complaint is the location and our room was facing a preschool and the kinds were noisy in the morning, but im sure you can ask for a different room! Its located in the middle of nothing. A few gas stations and grocery stores, but thats about it. I'v seen some reviews of people not feeling \"safe\" here. Let me tell you, im the kind of person that always worries about stuff like that, but i felt completely safe here. You park inside the parking lot which is a 30 second walk to the doors to the lobby and then you go directly to the elevator to get the which ever floor your room was located. I would defiantly recommend staying here if your looking for something a little bit cheaper then staying right in hollywood or visiting the studios! It's really close to the Warner Bros. studio as well! And very close to hollywood where the paramount studio is also located!", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Granada Hills, CA", "Title": "“Very Clean, Very Quiet, Great Breakfast”", "Author": "nelsons4christ", "ReviewID": "UR121174579", "Content": "We love having breakfast and this one was very nice! Good variety! The room was very clean! Almost too clean - they would remove our partially used soap and shampoo, so we started putting them away in order not to waste. This was a good location to Warner Bros., Huntington Library, Dodger's Stadium and The Getty, all places we visited during our stay. We chose this location because of cost and proximity to what we wanted to do. The parking is a little funky, but for us it worked out great. The neighborhood is a little worn, but we didn't go their to walk in the neighborhood. We felt safe and comfortable during our stay. The pillow top mattresses were a treat!", "Date": "November 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "colorado", "Title": "“Good price for the area. Clean & Modern Decor.”", "Author": "greecelightning", "ReviewID": "UR120336162", "Content": "This hotel was a decent price, decently decorated and nice staff. The front desk guys were accomodating. The breakfast & housekeeping staff were also nice. The decor was clean and modern. The breakfast was in a cute small room, with a decent selection of foods. The exercise room was small, but clean. The main machine wasn't working. The location was nice-close to Burbank airport. Add a pool, and voila, you have a decent place at a decent price.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Winnipeg, Manitoba", "Title": "“Great Hotel-Cheap rates”", "Author": "shebri50", "ReviewID": "UR119523019", "Content": "My husband and adult children recently visited LA to check out the tourist attractions. We were very impressed with this hotel but were initially skeptical as the prices were low. However, we were pleasantly surprised. The rooms were modernly decorated and very clean. Each of our rooms had a microwave and mini fridge which is always nice for leftovers and water. Our continental breakfast was perfect and much appreciated-my husband enjoyed fresh waffles every morning while I enjoyed cerial and toast. My boys all enjoyed the selection of pastries as well as some scrambled eggs and juice. We were extremely happy with the helpful desk staff. Every time we asked for directions or suggestions of places to eat and shop, they were quick to help and even printed off directions for us. The location of this hotel was also great as was pretty central to where we needed to go. Definately recommend this hotel to anyone who is visiting LA.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Omaha, Nebraska", "Title": "“Bad security! We were chased by a stranger through the halls!”", "Author": "Tamara_from_Nebraska", "ReviewID": "UR119454366", "Content": "Prior to the last night of my stay I would have said 4-5 stars based on \"value\" in the LA area, but I have to rate lower as we felt we almost lost our lives. This place once in the doors is wonderful in appearance. New everything because a new building. Loved the clean and huge room including huge bathroom. Gotta love the huge long counter for all my beauty products. House keeping was wonderful and nice. HUGE SECURITY ISSUE! The front door is open to anyone and not locked ever. This hotel is in a BAD area of town even the desk clerk said this. Probably why no female clerks worked there the 8 yes 8 nights we stayed. The 3rd floor smelt like POT and we just dismissed it. My sister left after visiting and was harrased and chased by a guy saying his girlfriend was staying in this hotel somewhere sleeping around on him.. he begged her to have sex with him and chased her down the steps to the desk clerk and a guest waiting to check in. She was screaming this guy is chasing and harrasing me. The crazy guy says no I am security I am security. The front desk guy says no you are not get out of here. If you come back I'm calling the cops! My sister had to be walked out to her car! This door is unlocked and open most of the time and it opens close to the bad street!! GET A LOCK!!! I felt bad as our car got hit parked in the lot too by one of the clerks eager to leave work too.. he felt bad and nicely fixed the rental car and discounted our room one night 50% off. This place is fine I feel for business travelers, but not for children to leave during the night, women alone etc. My family overall was fine as we stayed in at night or were in a group. Another tip.. the refrigerator motor is warm and refrigerator is in a cupboard. We had to take it out otherwise it smells like burning motor and wood. There are no blankets on the bed, but just a sheet and a heavy comforter. It was hard sleeping because either too cold or too hot... sounds silly, but I prefer a lighter blanket.. lol HOPE THIS HELPS!", "Date": "October 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Victorville, California", "Title": "“Good price!”", "Author": "SueAnn A", "ReviewID": "UR119055374", "Content": "My husband and I stayed here when we went to a business party at the Magic Castle back in September. We were on a budget and all hotels (even dirty motels) in the West Hollywood area were way too expensive. We booked the Best Western for about 70 dollars through Name Your Price on Priceline. We arrived at 4pm and checked in without any line or hassles. The room was fantastic! It was big (the bathroom was HUGE) and had plantation shutters with a window we could actually open (I love fresh air in hotel rooms). The television was a big flat screen and we brought our dvd player to hook up to it. We also brought our laptop since they had FREE wifi! It only took us 10 minutes to get to the Magic Castle in West Hollywood. We noticed Universal City is super close to the hotel (we passed exits for Universal Studios within 3 minutes of driving). Upon arriving back at the hotel (around 2am) the parking garage was near capacity. There was one spot available on the double car side, so we had to drop our keys at the front desk so that they could move our car if the person parked in front of us needed to get out. This was basically the only con of our trip. I do not feel comfortable leaving our ONE keypad to our brand new car with a complete stranger in Los Angeles. Oh well, though! Breakfast in the morning was pretty good. They had a waffle maker, muffins, eggs, cereal, and english muffins. I've had better breakfasts, but for the price we paid for the room, this one was good! All in all, this hotel is new, clean, and pretty conveniently located. Other than the neighborhood it's in (kind of shady...dirty neighborhood) and the parking situation, we enjoyed our stay and would recommend it to anyone who's on a budget looking for a nice place to stay in the Hollywood area.", "Date": "October 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "New York", "Title": "“This hotel was better than expected”", "Author": "teebees", "ReviewID": "UR118011480", "Content": "We stayed here for two nights at the end of a two weeks long vacation in Florida, San Francisco and Los Angeles. Of all the hotels we stayed, we liked this better. We had one or the other to complain about in almost all the hotels but this was refreshing and surprising for a change. The room was clean, had all the amenities, everything was in working condition, continental breakfast was nice, and there was free parking. Parking is limited, may be cramped at night when spaces fill up and left turn to hotel from the opposite side of the road is not legal. Breakfast items can be replenished a little more often but that is based on two days of observation only. This place is a little than five miles from the main LA attractions but with a rented car, we could enjoy all of them.", "Date": "September 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“great place, excellent value!”", "Author": "nycchic86", "ReviewID": "UR117717715", "Content": "although not in a particularly fancy area of town, this hotel greatly exceeded my expectations! the rooms were large, clean, and fully equipped. i don't know where else i could have stayed in north hollywood for such great value. i never felt unsafe, staff was courteous and accomodating, breakfast was more than adequate, and amenities were plentious. bathrooms had an enormous amount of counter space, and the shower worked perfectly. plenty of restuarants and shopping are less than 15 minutes away, as are universal studios and hollywood boulevard. i have zero complaints about this hotel as i was expecting something not quite up to par, but best western burbank airport inn thoroughly impressed me. i would highly recommend staying here!", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Dallas", "Title": "“Not close to the Burbank Airport!”", "Author": "planotechmom", "ReviewID": "UR116396434", "Content": "This property was quite nice as other reviewers stated but the name, \"Burbank Airport Inn\" is a misnomer! If you don't have a car don't stay here. You will not want to be walking around in this neighborhood at all and there is no where to go to eat. I spend $30.00 each way to get to Universal Studios for dinner and another $20.00 to get to the airport the next morning. There is a really nice Marriott with free shuttle service right at the airport with restaurants all around. It would have ended up being cheaper for me to stay there. I was lured in by the price and supposed close to airport location which I needed. Most of the cab drivers had never even been to this place. Just know what you are getting into with the location and lack of restaurants.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Lititz, Pennsylvania", "Title": "“Hotwire Customer??? Get Ready For A Noisy Roadside Room!!!!”", "Author": "xflyboy", "ReviewID": "UR116232640", "Content": "The Pluses - Very Nice Practically New Property with Impecable Rooms and Free Parking & Breakfast. The Minuses are the rather dismal, depressing area its in but mostly if you got this through Hotwire then be prepared for a very noisy roadside room with Managements indifferent, unsympathetic attitude towards you. Even with other empty available rooms - management will NOT move you! They have branded Hotwire customers as second class citizens to get the noisy rooms. Unless you purchase directly through the hotel be prepared for these rooms. I've been travelling for my entire life and career and I've never encountered this attitude ever. I'll never stay here again.", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Staines", "Title": "“Great comfort and value”", "Author": "Mishkamitten", "ReviewID": "UR115997460", "Content": "We booked 3 nights here to start our stay in LA. Staff were friendly and helpful. Room was large and spotlessly clean with an enormous bed, pillow topped mattress, widescreen TV and air-conditioning. Bonuses were free parking, free wifi, free use of business centre and complimentary breakfast (Continental). The room also had a fridge and microwave and a short way up the road are a couple of big foodstores, so if you want to buy food and chill out in your room, it's easy. The only downside is the location, which is a bit rundown, but if like us you are touring and will be out all day, so only need a comfortable place to sleep, this could be just what you are looking for. We would definitely go back.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "KY", "Title": "“Excellent place to stay in LA at a great rate!”", "Author": "BSpeaker", "ReviewID": "UR115588386", "Content": "Pros: - Free parking (you must double park at night if the lot is full. The front desk will move your car as needed). - New property. - Complimentary breakfast (on 3rd floor). - Flat screen TV. - Large beds. - Keyless entry. - 3-star Hotwire rate around $55. - Close to shopping and food (1-2 mile drive). - Neighborhood may seem like a lower-grade, but it was very quiet through the stay. - Big microwave & refrigerator in all rooms. - Very, very clean. - Large bathrooms. Cons: - Smallish rooms (because of large beds so a fair trade).", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Provo, Utah", "Title": "“Great value, great hotel (and not a bad location either)”", "Author": "BlueHelm", "ReviewID": "UR114614621", "Content": "I, too, was skeptical to stay at this hotel, seeing as the neighborhood isn't known to be all that great and its a bit detached from other, more popular parts of the city. But I'm so glad I booked here! Firstly, free parking in LA is a HUGE plus, as is free breakfast and free internet. The rooms are very nice. The staff was surprisingly friendly. The room (and, most importantly, the bathroom) was impeccably clean. But I think I loved my bed the most. It was SO comfortable that I wanted to sleep in every day. The hotel is also very close to major freeways, Griffith Park, Universal Studios, Burbank, Glendale and the Hollywood Hills. There's also a great Japanese restaurant and donut shop right next to the hotel. If you're on a budget and looking for a great place to stay, this hotel cannot be beat.", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "san francisco", "Title": "“nice hotel but dicey area”", "Author": "gracieg", "ReviewID": "UR113929992", "Content": "I'd have to agree with the other reviewers. The hotel is nice and I never ventured around the immediate area. We only stayed one night and mostly got in and out of the car to attend the UCLA graduation which is about 1/2 hour away.", "Date": "June 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Excellent value, cleanliness & quality”", "Author": "London_E14", "ReviewID": "UR106654827", "Content": "Great rooms, all brand new. Location is in an industrial area but there are restaurants and shops within a few minutes' drive, for example at the large strip mall on West Empire (next to the 5 freeway).", "Date": "May 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Burbank, California", "Title": "“Could not resist writing a review”", "Author": "jonesbkr", "ReviewID": "UR98023931", "Content": "I do not normally take the time to write a great review but had to on this hotel. I booked it for the price. As we got close to the hotel, I was skeptical because of the area. The parking area appeared very secure. The lobby was a great surprise but the rooms were the best surprise. Very nice decorations, bedding and amenities. This place is a jewel near the airport.", "Date": "February 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "West Midlands", "Title": "“new hotel,bit out of LA”", "Author": "WestMidlandsSunlover", "ReviewID": "UR97469097", "Content": "We were on a tight budget on our holiday & booked this.New hotel,free parking which was good as hotels closer to LA charged.Big bathroom,brill massive comfy bed. Fridge,microwave,coffee maker only.glad we took travel kettle & t-bags! Small but ok gym all you needed to work out. Good choice of breakfast included in price of room cereal,toast,eggs,waffles,fruit. You didnt need to eat again till night time! Would go again.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Great staff and clean room!”", "Author": "Arn-Elle", "ReviewID": "UR84953938", "Content": "At first I was uncertain about the hotel because of the area we were in. It wasn't the best area but not scary by any means. I guess I was just expecting more shops instead of small grocery marts. The plus side is that it is very close to Universal Studios and there are several fast food restaurants if you want a quick bite to eat. The guy at the front desk was very helpful. We got in a little later but didn't want to stay couped up in the hotel room. He suggested we go to a mall nearby which was actually a great mall! The room had everything we needed, it was very clean and you can tell it was just newly renovated. The hotel also had a great continental breakfast and we found that the staff were really nice and polite. When we checked out I accidently left my leather jacket in the closet (actually my FAVORITE leather jacket!!). I called a few hours later when I realized I left it and inquired about it. The front desk already knew about it and suggested they can send the jacket to me by mail and just charge my credit card for the shipping cost. I received my jacket about 3.5 weeks later in the same condition and it only cost me $7 for the shipping as opposed to buying a new leather jacket for $300! Overall, we thought this hotel was great! It was a great value, close to attractions, staff were accomodating and polite, and rooms were new and clean. We would definitely stay here again!", "Date": "October 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Portland, Oregon", "Title": "“Very Nice Stay”", "Author": "DavidPortland", "ReviewID": "UR80465928", "Content": "Stayed here for two nights in mid September. As others have said, the location is a little \"rough\" but certainly not scary. The hotel is 3 miles from Burbank Airport but there is no shuttle so a car is necessary for access. The BW Burbank Airport Inn is a very well maintain facility built above a parking garage. Outside the back of the parking garage is an attractive space with waterfall, lawn and two outdoor tables with umbrellas. The inside space is attractive with a small business center, breakfast room and fitness center. Rooms are pleasant with flat screen TV and very comfortable beds.", "Date": "September 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Houston, TX", "Title": "“Nice decor, lacking finer details.”", "Author": "JaiTea", "ReviewID": "UR76256758", "Content": "There were six of us (three couples) staying here for over a week (7, turned into 8 nights) for a family reunion. First, it should be said that there is little to look at in this area. It's located on Lankershim which features great accessibility to attractions that (thankfully) saves you from entering the highway system. Unfortunately, the area it is located in is a decidedly less nice location. Late at night, you don't have to go very far to see prostitutes on corners and some shady dealings. This doesn't mean you're risking your life to stay here, but if you're bringing a family with small children (we're all well old enough), then the area is probably not the best. The front desk was incredibly accommodating and got to know us after frequently seeing us in and out everyday. The breakfast is pretty typical hotel fare; nothing special. The room itself, however, had good and bad about it. On the one hand, it was clear the hotel was new. Walls, carpets, beds, and all felt fresh and unruined. The windows inside the room (large slat-like blinds) were very nice to see upon entering, but having spent several days, you begin to see little things that cheapen the room; this mainly deals with the actual construction. Our room, for example, featured a bathroom door that would not properly close (the doorjam wasn't built at the correct depth), floor molding that gradually separated from the carpet along the wall (it went from having no gap near the door, to nearly a half-inch gap in the other corner), broken remote controls (you would have to hold it upside down and at an angle to get it to work), and a broken door sensor. The sensor was annoying, very much so. If your door happens to not close all the way, a loud beeping noise emits to make you aware to close the door. Unfortunately, any time we left or entered the room, this sensor would go off regardless of whether the door was closed. We told the front desk and they gave us a flimsy \"it's supposed to do that\" excuse (this only occurred with one of the other couples). It was annoying coming home late to listen to the noise for those several seconds and, seeing as one of us fell ill in the room, it would constantly awaken anyone trying to sleep in the bedroom. All in all, these were small inconveniences that I feel could be improved to make an average stay even better. As is, it's not a terrible place to stay and the only legitimate complaint I found was the area it was built in. If that's not an issue for people, then there's no reason to not stay, really.", "Date": "August 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix, AZ", "Title": "“Excellent NEW Hotel, just north of the Hollywood area”", "Author": "MGMTraveler", "ReviewID": "UR73959764", "Content": "Frankly, you've been there - \"Hollywood\" Glamor Capital? Not even. But this hotel is brand new, and only a couple of miles north of Hollywood Boulevard. Given the real LA experience, this neighborhood isn't all that bad. It isn't \"walking distance\" to the Burbank Airport, but an easy cab ride. Free parking - covered & monitored. The rooms are large, clean, and access is through a registration lobby. All in all - knowing the \"Hollywood\" area - I won't be staying anyplace else. This hotel is awesome!", "Date": "August 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Denver, Colorado", "Title": "“Pleasant Surprise”", "Author": "COnative31", "ReviewID": "UR73333714", "Content": "We were a late arrival and were very apprehensive about the location of the hotel once we got to the area. It was a very pleasant surprise to find out that parking was \"covered\" and monitored. The rooms and upkeep of the hotel was great. Prior to our arrival at the BW we were staying at a Doubletree that did not compare concerning the room appearance, comfort, and quietness. It was a good value. Don't let the neighborhood persuade you from staying overnight at this hotel.", "Date": "August 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Northville, Michigan", "Title": "“Beautiful rooms, questionable location.”", "Author": "justice5", "ReviewID": "UR69549854", "Content": "Pros: In July 2010 this hotel looked brand new. Our room was a very spacious two bedroom suite with two king beds and two bathrooms. It was very clean and quiet except for the city traffic noise outside. My 11 year old son loved having his own bed and tv. We paid only $109 with our AAA discount. We had a short 15 minute drive to universal studios. Parking is free and is located under the hotel. Looks fairly secure for this area. Cons: Honestly, it is like someone took a beautiful hotel, picked it up and plopped it smack in the middle of a very questionable area. The security cameras in the lobby kind of give it away. Now, we had absolutely no problems here any d we found everyone to be friendly and helpful. But, my \"mom radar\" was in high alert upon check in. I certainly would not feel safe walking around at night in this neighborhood. I think I see why the room was so cheap now. Also, although they give you a free breakfast, there is a very small breakfast room and many food items were left completely uncovered and unrefrigerated for several hours....especially an uncovered plate of hard boiled eggs...no refrigeration and no cover. Think of little kids fingering everything in reach....yuck! We went to the donut shop next door and had donuts instead.", "Date": "July 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Plainfield, Illinois", "Title": "“Pleasantly surprised”", "Author": "harleychic28", "ReviewID": "UR69467957", "Content": "This hotel is a hidden gem. Honestly, my first impression was \" oh boy, what have I gotten ouselves into\" because of the neighborhood. But first impressions are not always right! The hotel staff was very friendly and courteous. The room was spacious and bed quite comfy. I would definately stay here again. My only complaint was the complimentary breakfast. (I know.. it was free) but on a scale from 1 to 10, I would rate it a solid 4. The food was pretty stale. But don't let that stop you from stopping through. The manager, Juan Adriano, was very responsive and plans to make some changes. We'll see Juan...the next time we visit LA.", "Date": "July 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "North Branch MN", "Title": "“Excellent value”", "Author": "zasucon", "ReviewID": "UR66913784", "Content": "Stayed for 3 nights with my adult daughter. Room was lovely-hotel was very new looking-bed was extremely comfortable, large bathroom-everything very clean. Microwave, fridge, coffee maker, even a small safe. Continental bkfst was good-hardboiled eggs, waffles, toast, cereals, pastires, fruit, juice, coffee. Hotel was in a semi-industrial area-not picturesque, but safe. Was concerned about parking after reading other reviews. We were always able to get a parking spot w/o having to leave our keys. Lots of street parking as well. Staff was very courteous and helpful. I have been visiting LA for 7 years now-this hotel was the best value for my money yet.", "Date": "June 8, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“The best ever...”", "Author": "ronnybaby", "ReviewID": "UR62332410", "Content": "The price, hospitality, location...everything was excellent! It was very comfortable. We stayed in a two room suite. The rooms were totally separated by a wall and had separate bathrooms, microwaves, refridgerators, tvs, couches...The only thing is you have to go through the first room to get into the second one. Breakfast was free, so was parking. Hotel is very close to Burbank Airport and only a few miles from LA.", "Date": "April 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Full Time Rv", "Title": "“Beautiful hotel in an old part of North Hollywood”", "Author": "CiteCR", "ReviewID": "UR60218555", "Content": "I booked a handicapped room with 2 beds. We were given a suite with two separate bedrooms. Each had it's own set of amenities. The rooms are spacious, well lit, airy and clean. Each room had its own temperature control. Beds are very comfortable. Free Wi-Fi, a great continental breakfast and friendly service. Our housekeeper's name was Claudia; she did a great job. I strongly recommend tipping the housekeepers; they work hard! This is an older part of North Hollywood. There is covered parking in a drive-in garage connected to the hotel", "Date": "April 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "1.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Antioch, California", "Title": "“Dishonest staff”", "Author": "JamieA6", "ReviewID": "UR57685673", "Content": "I will try to be brief but during my recent stay the weekend of 2/21/10 I had my ring stolen from my room by the cleaning staff. Nothing was ever turned in and this hotel has done nothing but said oh we're sorry and that the staff never turns in lost items. Needless to say I will never stay here again. I never have been so violated. So if you have to stay at least leave valuables in the car. The front desk attendant even went on to say he suspects who stole the ring but they are just lying. I even offered a reward for it's return but nothing. don't stay here they didn't even do anything to resolve the situation not even a simple incident report just a phone convo and a sorry email. I was completely disgusted. On another note the rooms are very clean, i'm shocked the previous person found hairs in their bed. But the person who cleaned their roomed is probably the person who stole my ring. I actually stayed at this hotel on two separate occasions valentine's day weekend and the following weekend. But as I previously stated I will not return. Also the neighborhood is not that bad. But i'm from San Francisco and can deal with the hustle and bustle of the city.", "Date": "March 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Northern California", "Title": "“I would never stay here again--this was a mistake.”", "Author": "Maggilicious", "ReviewID": "UR55997592", "Content": "Going with friends to watch The Ellen Degeneres Show being taped. Completely unfamiliar with the Los Angeles area. Chose a Best Western based upon experiences at a BW in Monterey, CA, that are always positive. I traveled with 3 friends, including one who is acutely aware of the cleanliness of her surroundings. Being unfamiliar with the area, I booked this hotel thinking the great rate (approx. $100) was because it is brand new, and was a special rate. (I now believe the rate was due to the area--not horrific, but definitely a working class neighborhood with a bit of an economic downturn.) Before our visit, I called twice for information, and the staff was as helpful as each could be, with the limitation being their product knowledge. I sold the hotel to my girlfriends using the fact that it was brand-spanking-new and would be sparkly clean--the very definition of \"irony.\" We were able to check in very early, around 11 am, which was wonderfully convenient, and the employee at the desk was very helpful, though a bit slow at procedure. Still, we were in no great hurry, so I didn't mind this. Upon entering the room, however, one of the first things we found was a fake fingernail on the counter of the bathroom, which, frankly, freaked my girlfriend out. We talked her down by laughing and taking pictures of it. I also couldn't get the window to lock when we closed it. We left a short time later without mentioning anything to the desk--I assumed the maid had unknowingly lost her nail while wiping down the counter, though one would think a final look around would be S.O.P. Frankly, we just wanted to get our 2-day trip started. When we returned late in the evening, the others got ready for bed, taking turns in the bathroom. Due to the \"fingernail incident,\" my girlfriend gingerly pulled the covers back, and found...several short hairs in the bed. The other bed was inspected, and found to have hair on the sheets, too, and a couple of stains on the pillow case. I promptly walked downstairs to speak to the employee on duty, who was assisting other guests. He did acknowledge me, and 10 minutes later, I was able to tell him what was happening--poor guy's eyes got really, really big. He gave me a key card to the room adjacent to us, and I went upstairs, grabbed my girlfriends, and went next door to look at the room. That room, too, had hairs in the beds, and also in the shower. I went downstairs again, and this time, the employee locked up the hotel, grabbed a couple of key cards, and came upstairs with me to look at the rooms. We looked at 2 (3?) more rooms, settling on one that seemed acceptable, with a request for clean sheets for one of the beds, because that one, too, had small hairs in it. While we went to our original room so that we could move our belongings, one of my girlfriends informed me that she had wiped urine off the toilet seat and hair off the bathtub with a sanitizing wipe while I was speaking with our other, still slightly freaked out, friend. We decided that as it was after midnight, we would keep that information from her so we could get some rest. I did inform the employee when he brought the sheets, however, and told him we would address the issues upon checkout. He replied he would make notes for the morning employee. Upon checkout, I gave the employee at the desk our room number, and was mildly surprised that he didn't mention our experiences at all---if I had not brought it up, he would have gladly checked us out without comment. When informed that our stay was unsatisfactory,and that we did not feel we should pay for the hotel room given the experiences, he replied he was unable to make that decision. I asked for someone who could make that decision, and was told that person wasn't on premise. I asked what time s/he would be in, but it wasn't for a couple of hours, which didn't work with our schedule. I asked if he could get a hold of someone, and he offered to call someone. When he got off the phone, he told me he could reduce our rate to approximately 30-odd dollars, which was a substantial savings from the original AAA rate. While I didn't agree with the charge, I took it due to lack of sleep and time constraints--I had no energy or time to deal with the situation-- with the intention of calling later. I didn't call later. I'm just not going to waste my time for $38, when I feel it's better to educate other travelers. I've mulled over whether the hairs could have been fibers, but I've decided it doesn't matter what the heck was in the bedding. There were stains and threadbare (!) areas on the sheets, and it just wasn't satisfactory--especially given the hotel is so new it wasn't listed on TripAdvisor at the time. There are clearly cleaning protocols that need to be addressed. The whole experience leaves one with the impression that no matter how new the restoration of this hotel, close inspection reveals that attention to detail isn't a priority. A positive note: parking is free, covered, and the entrance to the hotel is close, so if one doesn't feel safe in the area--which I did--then one won't feel vulnerable moving from the car to the hotel.", "Date": "February 15, 2010"}], "HotelInfo": {"Name": "BEST WESTERN Burbank Airport Inn", "HotelURL": "/ShowUserReviews-g32655-d1657336-Reviews-BEST_WESTERN_Burbank_Airport_Inn-Los_Angeles_California.html", "Price": "$78 - $103*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">7615 Lankershim Boulevard</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">91605-2814</span></span> </span></span></address>", "HotelID": "1657336", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/3e/cb/3ecb3faa4801f765b1f191b9916ce09a4large.jpg"}}