{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Madrid,Spain", "Title": "“Great hotel”", "Author": "norriebhoy", "ReviewID": "UR128503041", "Content": "We stayed here mid April for a week & thought it was wonderful! Rooms were ideal size, clean & comfortable (our room was internal facing, so quieter). Breakfast was excellent - loads to choose from: hots were great from soft/hard boiled eggs to sausages, bacon, beans, scrambled eggs, to pastries, to colds including: fresh fruits to cereals to eco friendly brekkie (if you wished). The only issue for some people, seemed to be that although there would be tables free, they would hover over one that had the remnants of the previous diner until they caught the eye of a staff member (poor show). The bar was good, if a little laid back. We ate at the restaurant on our third night, then a further 2 times, as it was much to our liking! We did venture out to sample a bit of Germany, but found it had mostly gone \"West\" (Mexican, Indian, Chinese.. you get the drift). Front-of-house staff at the hotel were very helpful & as per, multi-lingual. We didn't get the chance, but the hotel also let out bikes for 4 hours FREE of charge (Berlin being so flat, it makes it fairly effortless to get around) so well done on that one folks!! All in all, a very peaceful time in this hotel & though it does get a LOT of tour buses & business meetings, I would consider staying at another Scandic elsewhere, if this one is anything to go by.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Leer, Germany", "Title": "“Shame about the breakfast service!”", "Author": "Reise-Profi", "ReviewID": "UR128271032", "Content": "The hotel has a very good located a few minutes from the Potsdam Place in the city center of Berlin. The hotel is pretty new and offers very good rooms with all amenities. The location is quit so overall it was a good experience until - yes until we got to the breakfast. Latest here you know that the hotel is booked strongly by groups (as the busses in front of the hotel remind you) and when you enter the restaurant the noise level is VERY strong. No matter when you arrive between 07:30 and 09:30h the place is so crowded that you have difficulty to find a place. The breakfast buffet themselves is OK and offers everything what you want and its filled up quickly. BUT the real problem is that the tables will be cleaned badly. In 45 minutes nearly no service cleaned the tables and when one of the unexperienced (I think outsourced) waiters comes, they took a few things and they're gone. The coffee pots didn't hanve handles so when filled with coffee you wasn't able to hold them? I think none of the management tried to have breakfast here? While I was able to give a 4* rating to the hotel the breakfast situation downgrade the hotel at least by one star. Hopefully they will be able to improve this shortly.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Very central!”", "Author": "Astrid95", "ReviewID": "UR128228867", "Content": "My family and I stayed at the Scandic hotel at Potsdamer Platz from the 10th of april to the 13th. The stay was in every way excellent! When we arrived at 10am we were able to get our rooms early, and the rooms were very homely. The breakfast the next day was terrific with a large range of different breakfast food. What was the best thing about the hotel was it's central location. It was barely a 5 minutes walk up to Potsdamer Platz and U-bahn was just around the corner! We noticed that the U-bahn acctually went in to the building, but lucky you could not hear it at all during the nights! My entire family were very pleased with our stay at this hotel, and I think that if we ever return to Berlin, this is the hotel that we'll stay at!", "Date": "April 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Doha", "Title": "“Excellent Hotel”", "Author": "choibabu2002", "ReviewID": "UR128215756", "Content": "excellent is the only word to describe the hotel. location - heart of the city, Postdamer Platz - besides railway station. room - spacious, clean, comfortable. toilet - really nice and beautiful break fast - awesome interior - too good, vibrant, luminous service - excellent smoking - yes value for money.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“A great stay in Berlin”", "Author": "orlandouk", "ReviewID": "UR128041468", "Content": "We visited Berlin for my Birthday weekend and we stayed at the Scandic Berlin for the first time and we loved it! We arrived at the Hotel at around 11am and we went to go to check in, they told us that the room was ready and was told beacuse it was my Birthday they had upgraded us to a superior room and they gave us a complimentary Mini Bar including alcohol and soft drinks, they also give you a map of Berlin showing where everything is. We then went to our Room on the 7th floor, there are 8 floors in this Hotel. The lifts are really cool and they have birds tweeting in them, The Corridors are really nice and bright with loads of mirrors everywhere. The Room was outstanding, It was very spacious with a large bathroom and the most comfortable bed ive ever slept in, It also has a large floor to ceiling window which opens with great views of Potsdamer Platz, The only negative i had about the king bed was that there was 2 duvet covers one for each person but this might be part of the scandinavian way,There is also a large desk and HD TV, The wardrobe is very large with loads of space, I have stayed in many Hotel rooms in the past and this has to be one of the best ive stayed in. The Breakfast which is on floor 3 which was included in our room rate was also one of the best that i had seen, The Breakfast Room was huge with loads of seating, So no problem whatever time you turn up for breakfast and it is also served at a great time from 6:30-11am so great for the late risers like ourselves,There is around 10 different stations, one for hot breakfast items, one for cold meats,one for pastries,one for fruit etc and loads of stations for coffee and orange juice it is handled really well with loads of staff on hand and all the food is kept fresh and replenished. On the same floor as the Breakfast room there is a huge bar and restaurant and a outdoor terrace which overlooks Potzdamer Platz which is great in the evening for a drink before going out or a late drink before bed. The Hotel is in a fantastic location with Mendelssohn-Bertholdy Park U-Bahn Station right next door to the Hotel which can get you to most places in the City of Berlin and surrounding areas but if you like to walk, Potsdamer Platz is a 5-10 minute walk from the Hotel with loads of Restaurants,Bars,Sony Centre etc So this Hotel has a very modern theme to it with great staff throughout, and has a fantastic breakfast so when we are in Berlin again we will stop here.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“Excellent stay”", "Author": "Cathy41_11", "ReviewID": "UR127884901", "Content": "Really enjoyed my stay at this hotel. Had an excellent deal which included the fantastic buffet breakfast of over 100 items! It set us up for the day and we often didn't need to eat again until the evening. The room and hotel facilities are v good with flatscreen satellite TV and adjustable power shower etc. It is next door to the tube and walkable distance to the main sights. Although not situated right in the heart of Berlin, Potsdamer Platz and the Sony Centre were a 5 minute walk with cinemas, restaurants and theatres. Highly recommended!", "Date": "April 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Esbjerg, Denmark", "Title": "“Clean, Modern and free delicious breakfast”", "Author": "Tulene", "ReviewID": "UR127585123", "Content": "My husband and I went here for the easter long weekend. We got a great 3 night deal on their website which included breakfast.. It turned out it was actually cheaper to book the 3 night deal even though we wanted to stay 5 nights. So we stayed the other 2 nights at a different hotel. The hotel itself is in a very central location being Potsdamer Platz and is right next to the S bahn. The room we had was very clean, modern and tidy. The hotel staff were helpful and overall we had a great stay here. The included breakfast was fantastic with a great variety of hot and cold foods.. highly recommended. We also used the gym during our stay which was new, clean and had a treadmill, cross trainer and free weights.. small but sufficent. What else is there to say? Highly reccommended hotel.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Porto, Portugal", "Title": "“Simple and efficient rooms, very good location, excellent breakfast.”", "Author": "Miguel14600", "ReviewID": "UR127432758", "Content": "We stayed at the Scandic Berlim during the Berlim Half Marathon weekend and it was a very good choice: simple and efficient rooms, excellent breakfast and very good location (all kind of restaurants nearby, the main attractions are just a small walk away).", "Date": "April 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Killorglin, Kerry", "Title": "“Very Scandic !”", "Author": "smcelroy", "ReviewID": "UR126749571", "Content": "Have to say I was pleasantly surprised with this hotel. It is very Scandinavian in its approach, hence the name I suppose. Minimalist to the last, but funky with it. Staff were very pleasant. The bar on the third floor is nice for a hotel bar. Breakfast is good. They have this strange thing of having bird noises in the lifts and as you walk down the corridors which is a little bit disconcerting. Close to Check Point Charlie and The Berlin Wall. Very good business hotel", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Excellent hotel with very good locatio”", "Author": "Dorit147", "ReviewID": "UR126099593", "Content": "The room was big , nice and very comftebel , the location is not on the center but thire is avery good transpotation neer by", "Date": "March 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vantaa, Finland", "Title": "“Excellent for a short business travel”", "Author": "TotallyFinnish", "ReviewID": "UR125935586", "Content": "I found here all that I need for a 3 night stay on business: spacious room, convenient beds, free high speed Wi-Fi, super breakfast (incl. one table with organic food), good service. Next to the hotel is a shopping center with some nice small restaurants, also a few good eating places around. Will definitely stay here again.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Markham, Canada", "Title": "“Clean European lines, good breakfast, near U-bahn”", "Author": "Olde_biL", "ReviewID": "UR125207572", "Content": "I've stayed a the Scandic Potsdamer Platz in Berlin three times in the last 6-monghts and I've found it quite comfortable and convenient. It's walking distance to the client that I need to visit. As well it's walking distance to quite a few restaurants, some key Tourist destinations such as Potsdamer Platz itself, the Brandenburg Gate, Tiergarten, Reichstag, Jewish Memorial and Check Point Charlie. As other reviewer have mentioned, the Mendelssohn-Bartholdy-Park‎ U-bahn station is right next door to help you get to any other destinations and the Taxi fare from Tegel Airport is usually about €22 including tip. Also near by are the Potsdamer Platz Arkaden mall that includes fast food outlets, a pharmacy, an electronics store and an Aldi (discount grocery store) among other stores. The rooms are very clean and European/IKEA-ish in design. This suits me quite well but I understand why many North Americans express concern over the Bathroom door - it's a sliding glass panel that is mostly mirrored to the outside. However, as mentioned, when there's more light in the bathroom than in the surrounding room outside, it's not quite as private as many would prefer. Also as many have mentioned, if you want shampoo (separate from the wall mounted dispenser of wash soap) bring your own - or visit the nearby mall. Also, by my 2nd visit I started traveling with a shower scrubbie (actually a Skin Towel from the Body Shop in the Arkaden mall). This a new hotel, about a year old and has flat screen LCD TVs with HD programming but other than the news in the morning I didn't use it much. Note that the room environmental controls are operated through the TV although I not convinced that they actually work. It takes the input of the room temperature I wanted but I never noticed that there was ever any corresponding change. I guess the good news is that the environmental system wasn't loud like I've experienced in some other places - especially those with the outside wall mounted systems with the loud blowers. During my stays I used the Hotel Gym, it's smallish - about three rooms with the adjoining walls removed and has free weights as well as a couple of tread mills, a stationary bike and an elliptical machine. Note that the programing for the machines is in German. For those that want a more extensive work out the Hotel now has arrangement for a fairly inexpensive day pass with the gym that just opened next door. The hotel has bicycles for guest use, I had one for 4-hours - the maximum 'free' borrowing interval. It gave me the freedom to explore the Tiergarten more extensively and cycle out to the Fernsehturm (Soviet era TV tower) and Alexanderplatz all during the same 4-hour period. It's a nice benefit and a great alternative way to tour the city. Much also has been said about the breakfast buffet. As many have said there is an extensive variety of cold meats, cheese, fruit, cereals, breads and juices. As well there are scrambled and boiled eggs as well as bacon and sausages. One thing to note is that the Hotel seems popular with bus tours on weekends and the buffet can get busy on Saturdays - it's entertaining to watch seniors surreptitiously making sandwiches for lunch and secluding them in their pockets. After a week, it is possible to get tired of the buffet however it was included in my room rate so not taking advantage seemed a waste. I'm happy with the beds, no sagging and the right firmness. I would, however, like the night stand to be a bit larger. It gets very crowded once I have my glasses, blackberry and and watch on it. Oh yes, the 'clock' in the room is built into the TV. As well, the wake up alarm is also set up via and uses the TV. One last minor oddity, there are two banks of elevators with a hallway separating them and each bank has its own call buttons. So, if you're in a hurry, you need to push the buttons on both. Also about the elevators, it's both nice security feature and sometimes a bother that you need your room keycard to enable the elevator to select guest rooms. Lastly, I find the tweeting bird sounds played in the elevators a bit precious however others like it - it is an improvement over 'elevator muzak' but I'd be find with no sound track at all. Overall, I'm very happy with my stays at the Scandic Potsdamer Platz and will continue to choose it when visiting Berlin. Bon Voyage.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dubai", "Title": "“Great Experience”", "Author": "takian", "ReviewID": "UR125070055", "Content": "Hotel was fresh, comfortable and clean! The king sized bed was extremelly comfy, good internet connection, friendly and helpful staff. The small gym was also a nice touch with a good selection of machines and enough weights to get a good work out . The hotel is well situated on a quiet street but near shops and restaurants. The breakfast buffet was excellent, the restaurant set up was a bit strange feeling cafateria like but the variety/quality of the food made up for it. Overally a very pleasant stay!", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Tweeting birds in the lift”", "Author": "Ellie J", "ReviewID": "UR124519341", "Content": "I stayed in this hotel for work. I don't know my way around Belrin at all but it was very convenient for the Potsdamer Platz where I was working. The food in the restaurant was outstanding - and the restaurant has a nice atmosphere. The breakfast bar also had loads of choice - something for everyone and was all of a high standard. The decor of the hotel is lovely throughout, the rooms clean and comfortable (If I could have got the bed in to my suitcase it would have come home with me!!). Staff were friendly and helpful The hotel has an eco theme running, little things that give the impression that they are doing all they can to be environmentally friendly while maintaining a high service hotel i.e separate compartments in the bin for recycling, not mini bar with bottled water but water dispensers around the hotel and a shop in the foyer for other bits and pieces. And I did love the details of birdsong in the lifts and vines growing up walls which give the hotel a fresh feelings. I stayed in minus 14 conditions and was warm in my rooms (with fully controllable heating system). In my 2 night stay I didn't find anything to fault. I hope this is helpful - as I said I was staying on business and I do not know and unfortunately didn't have time to explore Berlin so I don't know how well it is located to places of interest etc", "Date": "February 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mainz", "Title": "“'All you need' Hotel in central location of Berlin”", "Author": "850t5", "ReviewID": "UR124063401", "Content": "The Hotel is right on-top of the Subway-station 'Mendelssohn-Bartholdy-Park' which is an excellent base for encountering the city. The Hotel itself is band new build and fitted with modern interior and equipment. They also pay big attention on being environment friendly with the Hotel as well as provide all organic food etc. So quite a good experience. The only marginal disappointment was for me the noise level in the room. The hallways are with wooden floor and while this looks great one hears every step from people walking by of your room. Put carpet in the hallways!", "Date": "February 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victorville, California", "Title": "“LOVED LOCATION”", "Author": "Stars1105", "ReviewID": "UR124042774", "Content": "We stayed here the end of January, during the week for 4 nights. It was easy to get to from the navigation in our car. Parking and room service was a little expensive. This hotel is definitely more a business hotel. We liked the rooms, very cozy. We stayed on the 8th floor which was the winter floor. Breakfast was my FAVE! So much to choose from.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wassenaar, The Netherlands", "Title": "“If Ikea went into the hotel business, it would be the Scandic”", "Author": "NicolasandJacqueline", "ReviewID": "UR123224688", "Content": "I stayed for a week at the Scandic during a business trip to Berlin back in October, and had a rather pleasant stay. As the name implies, it is part of a Scandinavian chain, and as pointed out by other reviewers, it definitely seems to come straight out of an Ikea catalogue with its \"birch veneer\" room doors. While the ambience lacks character and the service was not particularly warm, I did enjoy the clean, functional and modern room and the brightly-lit corridors with \"sounds of nature\" muzak playing when you pass through motion detectors. The breakfast area feels a bit like a large corporate cafeteria with its white tables and plastic chairs, but this hotel offers a truly exceptional breakfast buffet, with an amazing selection of juices, coffees, cold meats, yogurts, cheese, pastries, salads etc., as well as the traditional eggs and sausages. The hotel bar is also quite nice and has a good selection of wines. Free wi-fi is available throughout the hotel and works fine. I also noticed that the hotel offers bicycles that guests can borrow free of charge. The hotel was extremely quiet most of the time, except on one evening when a Turkish wedding party took place in one of the conference rooms. I could hear the loud music quite clearly in my 5th-floor room, and it went on until 3 a.m. at least. A colleague of mine was in a room just above the conference room and had to talk to the hotel manager to get moved to another floor. Needless to say, a little more soundproofing and more understanding from hotel staff wouldn't be a bad idea in such circumstances. While not technically on the Postdamer Platz, it is very close to it, on a quiet side street. I found the location very convenient, as it is a short walk from various tourist attractions, the U-Bahn and various coffee shops and restaurants, and not very far from the airport either. In conclusion, I was very pleased with this hotel and would definitely return there on future visits to Berlin, especially given the reasonable rates and the fabulous breakfast.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "West Sussex, England", "Title": "“Leave your privacy at home...”", "Author": "namth90", "ReviewID": "UR122060044", "Content": "The hotel is really modern and quirky, styled like an upmarket IKEA showroom. Not located directly in Potsdamer Platz, it is a five minute walk down a street which forks off of the main area, which means the hotel is a lot quieter than the hotels located more centrally. There is however, a U-Bahn station attached to the hotel, which costs not much more than 6€ for a day ticket on the underground system. Breakfast is expensive at 20€ if you don't have it included in your rate already, but it was money well spent as the offerings are exceptional. There is a great tea and coffee selection, as well as juices, a full english breakfast as well as different varieties of breads, croissants, cold meats, yogurts, cheese etc... However, I cannot fathom the imagination of the architect who designed these rooms. As mentioned in other reviews, the see through bathroom door is a big issue. The door is supposed to be a one way mirror I think, but there is more light in the bathroom than in the hotel room, which results in door becoming see through from the outside. I can't imagine many people are comfortable with this, my son and his friend sharing a twin room were not, especially to the Anglo-American audience. Even for some couples I can imagine this would create an issue. Who wants a full view of their partner sitting on the toilet? Another issue we were confused with was Scandic's idea of a twin room, which is essentially a double bed with two duvets on it. My room on the 7th floor looked across one of the courtyards, but was nestled in the corner. Unfortunately, this meant I could see straight into the room next to mine. Indeed you can see into all the other rooms on the opposite side of the courtyard, if that is how you like to spend your time. There aren't even any blinds or translucent curtains to let light in, so you have a choice of living in darkness or being exposed!", "Date": "December 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hitchin, United Kingdom", "Title": "“Great for Kids”", "Author": "katz1973", "ReviewID": "UR122020537", "Content": "Ok.. a modern, comfortable hotel that knows how to cope with travellers will children. The bar area has a play centre for children so you can read/relax and eat whilst they play right under your watchful eye. Also kids movies on demand for 10 Euro, free wifi for Ipads etc. Really welcoming and friendly. No tea and coffee making facilities or water in room, great location for sights and right next door to the train station. Good breakfast and reasonable bar food, but little choice.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "North West England", "Title": "“Comfortable, clean , good bar food , quiet location, helpful staff”", "Author": "Ezzm", "ReviewID": "UR121911862", "Content": "Great hotel, but in the wrong location for the tourist who wants to walk the sites from the hotel. Its exceptionally quiet and peaceful Its super modern with a rather cold atmosphere . No pleasant seating areas and the bar has good food. but uncomfortable seats. Service is good and prices reasonable. The bar design is somewhere between IKEA, Berni's Inn ( for those of you old enough to remember that restaurant chain) and a Turkish brothel...not that I have been in such a place. There is and underground station next door which goes straight to the major tourist area. A taxi to the main area...around Unter den Linden is £6 Lidl is behind the hotel for all the things you forgot", "Date": "December 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Very confortable”", "Author": "sensor30", "ReviewID": "UR121764476", "Content": "The hotel is simple, with IKEA like design, but very comfortable. Location: practically above the metro station (the metro goes inside the hotel underground) with very good connections to all Berliner attractions. Even the hotel is built above the metro station, at the 7th floor no vibrations felt when the trains come / departed the station. Postdamer Platz - 5 minutes walk (once there, try the Maoa restaurant for an amazing cooking experience). Lidl supermarket nearby (cross the metro station and the street behind the hotel). If you want a taxi - 12-15 euros to Alexander Platz and some 20 euros to Tegel Airport. Extremely clean rooms, bedding and bathrooms. I don't know whether our room was fitted on purpose for the disable or all the rooms have such amenities: adjustable beds, help buttons everywhere, folding seat at the shower. We didn't need to use it but I suppose they are easing the stay for people with reduced mobility. The little refrigerator was design to work only if you put something inside (in order to save electricity). This eco / green trend is everywhere in this hotel. In Berlin the public water supply is terrible and nobody drinks from the tap. The hotel management had their building connected to a deep ground well, apart from city water supply. As a consequence you could drink safely water from the tap and is no need to carry water plastic bottles from the supermarket. Breakfast was excellent. Everything you could want, from sausages to fruits, from cereals to cheeses, eggs to beans, you name it. The staff was almost invisible for cleaning in the good sense: you couldn't notice them but you could appreciate a clean room when returning in the evening. The staff at the reception was very helpful in providing basic tourist info; otherwise we didn't need to ask for anything and we didn't have any complaints. The only minus for the management: the bathroom door is intended to be one way mirror. But if the light is switched off in the room and on in the bathroom, the mirror become a simple glass and the person in the bathroom can be perfectly seen while sitting on the toilet or showering. Even if you are in a couple, you still need some privacy and in this case is absolutely zero. You may consider replacing those doors.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Berkhamsted, United Kingdom", "Title": "“Good facilities .. but lacks warmth”", "Author": "Jonathan M", "ReviewID": "UR121562175", "Content": "Spent one night here. Comfortable room, good size, good furnishings, but far too cold. No matter how you reset the thermostat using the TV controls, the end result was the same. Also somewhat disappointing that you couldn't make yourself a warm drink in the room, and would have to descend to reception to find a machine. Staff friendliness varied dramatically from one individual to another. I would go back, however, due to the basic quality of the room, the centrality of the location and also the value of the breakfast buffet which, despite being expensive at 20 Euro, actually enables you to have a three course meal that will last you the rest of the day. So overall, a good value way of staying in some comfort at the heart of the city - just don't go in winter!", "Date": "December 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Barcelona", "Title": "“Excellent location, better place”", "Author": "JGSISO", "ReviewID": "UR121541928", "Content": "Excellent location for an affordable hotel. The breakfast buffet was incredible. The people at the reception very friendly and helpful. With a U-bahn stop behind the hotel, and Potsdamer Platz at 5-10 minutes walking, it is very-well communicated. With a shopping mall almost in front of the hotel. Only one thing that should be improved: Wi-fi is not free of charge.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cork, Ireland", "Title": "“Great hotel, pity about restaurant service”", "Author": "CorkCouple", "ReviewID": "UR121486126", "Content": "We have just returned from a 5-night stay at the Scandic. I have stayed at other Scandics and was very confident about going here. We had a horrific travel experience on the day we arrived - all our own fault! We arrived at hotel stressed and foot-sore. There was a queue at reception and for our whole time there that seemed to be case. It's a pity there isn't extra reception staff available when queues form. Check-in was painless! We got to our room without any problems. Had a few problems trying to use wi-fi -all my own, but would have to say found reception unhelpful when I rang for help, one even hung up on me after answering my question - without waiting to see if it had worked. I finally started again from scratch and realised my own mistake. Room was comfortable, beds very much so. We had been given choice of shower or bath and took shower. Not sure if that meant we got a twin room instead. We weren't asked our preference on beds. I know there are some doubles at hotel as well. Shower was really lovely, nice and powerful and always hot. The bathroom does have a see-through door, but it's not a huge issue - our bathroom door faced a wall. Breakfast was great. One of the mornings it was very busy, but we learned what times were better. Lovely bright breakfast room and lots of room to wander arond buffet areas and make choices - even at it's busiest. The lifts were always prompt - soemthing which I was surprised at in a hotel of its size! We loved having the train stop right next door - although it was closed for renovation on our last 2 days. We ate at the hotel 2 nights. I have to add that we very rarely eat at hotels when away, but we were so tired from our days' walking that we just couldn't summon the energy to go out again. First night was great, couldn't fault anything. 2nd night was just a disaster. There was a party of 12 in and the staff just couldn't seem to cope. We waited ages just to get a table with staff passing us back and forth and not even looking at us. We finally stepped in front of one as \"Excuse me\" wasn't working and he looked surprised that we were even asking and just didn't sit down! So we sat down and he brought us over menus. We ordered - not a huge delay here. We got our starters, but no cutlery. No way could we get anyone's attention, and when we finally got someone to turn our way, it was with a really sharp \"be with you in a minute\" - practically snarling at us for daring to ask for something! He did nothing and we got exactly the same reaction from the next person we managed to stop. Then finally, we got our cutlery. We ate our starter and after another delay our mains arrived. The food was really good, but trying to get another drink was a nightmare and seeing numerous waiters rushing past us to serve the party of 12 got increasingly aggravating! We nearly failed to get the bill and at one stage were considering getting up to walk out to attract their attention. As we asked for the bill, we also ordered 2 cognacs - the bill arrived after a good wait with the cognacs on it, but no cognac. We must have waited at least another 5 minutes and our waiter appeared over with a beer - on the house for my husband. Our cognacs were actually on the counter at this stage and still not with us - even after we pointing out to him we were waiting for them. Overall the experience was spoilt for us by atrocious service and obvious frustation from the staff when we tried to get service. Needless to say, we didn't leave a tip - I just hope the party of 12 left enough of one to make up for the other diners - I know we weren't the only ones having problems! Checkout as we left was equally painless. I would stay here again, although I doubt I'd eat in the restaurant again, even with the lovely food!", "Date": "December 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hong Kong", "Title": "“Great Hotel!”", "Author": "KA_HK", "ReviewID": "UR121244405", "Content": "We stayed 3 nights in Scandic Berlin Potsdamer Platz in Xmas 2010, location was excellent, about 10 mins walk to Potsdamer Platz, the subway station just right behind the hotel and shopping mall across the street, very convenient. The breakfast was really good, room size is big quiet. I joined the promotion rate 65 EUR for 3-night with breakfast, it was a great offer!", "Date": "November 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Gothenburg, Sweden", "Title": "“Very Nice hotel!”", "Author": "Asundberg", "ReviewID": "UR121148041", "Content": "Scandic Berlin is a very good hotel with a perfect Location 5 minutes from Potsdamer Platz, Nice staff and friendly atmosphere.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Queretaro, Mexico", "Title": "“Great location and better breakfast”", "Author": "micheliniestra", "ReviewID": "UR120848770", "Content": "Great Hotel you walk one block and you are on the Postdamer Platz metro station, you can reach walking the Checkpoint Charlie and the Brandenbourg Gate. I just love it", "Date": "November 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Average experience”", "Author": "DestinationUnknown45", "ReviewID": "UR120699758", "Content": "I stayed at the Scandic Berlin for 3 days at the beginning of November. I found the hotel quite impersonal and lacking the touches that would distinguish it from a 3-star hotel. Plusses are the breakfast, free wifi and friendly but staff. Negatives are that you cant make coffee, no room service, heating controlled through television. I had a wheelchair accessible room but the door is so heavy I dont know how a person with disabilities would pull it open. For some reason I cant change the rating above but I would not give it an excellent. The hotel is quite average.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "TA IL", "Title": "“Great Service”", "Author": "wannatravelalways", "ReviewID": "UR120516273", "Content": "Stayed at the hotel for 4 nights at the beg of Nov with our 1.5 yr old child. The staff were both helpful and friendly, helping with all our needs including changing the cot that was prepared in the room for a baby cot after our late check-in. Standard room was spacious enough for all 3 of us. Breakfast was plentiful and varied. Also enjoyed the Potsdamer Platz arcade across the street with its easy to reach supermarket. We walked back from Brandenburg gate every night so also a great location.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belgium", "Title": "“Top hotel in the city centre”", "Author": "xras3r", "ReviewID": "UR120452749", "Content": "Fantastic hotel located near Potzdamer Platz. Good location to explore the city. The breakfast is really excellent. Very friendly staff.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bunbury, Australia", "Title": "“top location”", "Author": "Veribuca", "ReviewID": "UR120368871", "Content": "This is an excellent hotel, fantastic breakfast and close to everything, very clean, staff also very friendly", "Date": "November 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“A bizarre place”", "Author": "Nagster123", "ReviewID": "UR119862135", "Content": "Just to set the record straight and avoid the \" those Americans do not know about European Hotels\", I have traveled to EU on average 5 times a year for the past 5 years - I have stayed in various class hotels ..from Ritz, swisshotels, Radissons ....to the smallest corner hotels in St. Gallen Switzerland .... So I know a thing or 2 about European hotels. Now as we got this out of the way ... Let us review that weird place called \"Scandic Hotel\"... They led you to believe that it is the \"green / environmentally friendly...and they saved that many trees and power ....\" nice and dandy and all but it is all for their convinience. Why you asked? No bar soap, shampoo, lotion .... Etc are provided in the rooms, they instead have 2 liquid soap dispensers in metal holders: the first one in the sink is labeled (soap) the other one in th shower is labeled (all over)... Flip the bottles over and both original plastic bottles inside simply says \" liquid soap\" .... Oh and just because they are SO environmentally friendly, they do sell the shampoo, soap bars ....etc at the front desk ( 2 euros for a tiny 50ml shampoo bottle). The lights in the rooms are so dim ... It was too dark I could not see my face shaving. The rooms are so cold, you are suppose to adjust the climate from the TV .. Big joke...that thing does not work. I can go on forever ..do yourself a favor, potsdahmer platz has Lots of hotels .... Shop around and stay away from the Scandic.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Albany, New York", "Title": "“Nice experience in Scandic hotel”", "Author": "Undine_in_NY", "ReviewID": "UR119136417", "Content": "We just stayed for a week in the Scandic hotel in Berlin. Location was excellent, about a five minute walk to Potsdamer Platz and about 15 minutes towards the Brandenburg gate.Since it was in a kind of side street it was pretty quiet and we always had a good nights sleep. Very convinient was the U-Bahn station (subway) right behind the hotel and a big kind of mall with supermarkets across the street. The staff was always very friendly, helpful and cheery and the hotel itself was also really nice. Clean lines, the scandinavian simplicity combined with modern atmosphere. Loved the elevators with birds singing in the background. We did not try the breakfast because we thought 20 Euros per person was rather expensive. The rooms were of a good size, but not overly huge. The only thing that needed some getting used to was the bathroom door made out of some kind of see through mirrow. We ended up turning the lights off every single time you wanted your privacy in the bathroom otherwise the person on the outside could look inside as well.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Nairobi", "Title": "“Great staff make up for big problem”", "Author": "bemee1", "ReviewID": "UR118946488", "Content": "I had a great time in Berlin and would really recommend a visit. There is, however, one major thing wrong with this hotel, namely the toilet doors. Mine was utterly transparent (from the non-user side) and very visible from the bed. As a romantic destination I would avoid this hotel unless you like your potential conquest to watch you having a dump. The staff however were polite and delicate, even offering a spare room for us to use as a bathroom (in the week of the Berlin marathon). They literally just need to turn the bathroom doors around on to make this an outstanding hotel.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Very modern minimalist white hotel”", "Author": "Rob T", "ReviewID": "UR118734793", "Content": "We found the hotel very functional, rooms were reasonable size with flat screen tv and free wifi. The sliding door to the bathroom is virtually a mirror but when you lie in bed you can see whatever the person in the bathroom is doing via the mirror opposite the bed reflecting through the mirror. Some may find this off putting Breakfast area gets very busy but is very well stocked and kept very clean. Location is near the U Hahn and Pottsdammer stations. The whole area is a liitle sterile but that's not surprising given the history of the area. We would ask for a street view rather than the small courtyard that looked directly into rooms a few meters away.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Modern design, new, clean and fab service.”", "Author": "Tara S", "ReviewID": "UR118478663", "Content": "I stayed for 3 nights with my husband to celebrate our wedding anniversary. Great hotel, recently opened. The check-in staff were welcoming and friendly, even though we were rather late arriving. Large room with a real modern feel, focus on nature and meant to represent the seasons - I think ours was Spring?! and I love the fact the windows open! Breakfast was great selection, but expensive at €20 each as it's usually included in the Scandic range. Easy walking distance from restaurants and the centre, but a day ticket on the train system is only €6 or 7 and there is a station actually attached to the hotel.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Oslo", "Title": "“Perfect rooms for business travel”", "Author": "Nigel73Oslo", "ReviewID": "UR118001986", "Content": "This was a really great hotel in many ways. Great location, good breakfast, ok price, etc ... But the rooms are perfect! Plenty space in the room to spread out. Lots of power sockets. Good LCD and great TV picture. Hot & powerful shower, good desk, free wifi, etc etc - if I had my own hotel, I'd want to use rooms like the Scandic Berlin!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Lausanne, Switzerland", "Title": "“A-MA-ZING!”", "Author": "jml_celia", "ReviewID": "UR117611429", "Content": "It was an amazing stay! The hotel is beautiful. It is very well located, it has it own metro station. The breakfast buffet was delicious. The staff was very helpful too.", "Date": "September 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, UK", "Title": "“Brilliant hotel”", "Author": "catmambo", "ReviewID": "UR117525968", "Content": "Stayed here with work for IFA 2011. Having stayed in a scandic before which wasn't much cop, but this one has been recently refurbed and is brilliant. Rooms are very well thought out saving tons of space but don't feel cramped, great food, superb location. Even the lifts and corridors have ambient nature sounds playing in them which is a nice touch. Highly recommended..", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Haifa", "Title": "“Surely our place for the next visit!”", "Author": "SharkOnRush", "ReviewID": "UR117520078", "Content": "Just finishing a magnificent week in the Scandic hotel Berlin, hoping to help you out sorting this place for your great stay. 1 - Location Location Location – Scandic hotel is situated just 5 Min. walk from the Potzdamr Platz, which is only 1Km South to the Brandenburger Tor & the Bundestag. If you’re already familiar with this great city layout, you know these are probably the prime “must-see” places. If you are tending to cover the city by walk like we did – about 12-15Km per day - the Potsdamer Platz is exactly at the center of Berlin between West & East. If you choose to venture to the West side of the city for the entire day or the East side in the other day, then the back and forth walks are just perfect as far as the distances, given that the Eastern center is the Alexander Platz and the Western center is the Zoo area. Same idea goes with North and South. Need the S / U Bahns or bus? Mendelssohn-Bartholdy-Park station is just next door and the busses (Inc. 100 & 200) are at the Potsdamer Platz. A near by Mall is a must? No problem! The great Arkaden shopping center with all the goodies inside out is a 3 Min. away… 2 – The Room - can’t be better! The mattress is firm in the right level, great pillow and blanket, the right place to spend the night after a long day. The Scandinavian “minimal/functional style” makes the room feel even larger and it’s not a small room. Very clean and tidy and when you open the Led TV you know this hotel has a smashing Eurovision song contest hit, specially made about the hotel (even if it claims that it’s not a hotel… :-) 3 – The Breakfast – WoW, this is a breakfast that might hold you up until late afternoon! It simply can’t be better. Hey Mr. Jamie Oliver, are you really the one to thank for other than the great dining room crew??? 4 – The Staff – are friendly and cooperative. The right people for the right place! 5 – Cost Effective/Performance – After all the above, check out the price and be amazed!!! I’m sure there’s many more options in this city, I doubt if there is one single with all my “Five stars factors” in a 4 star rated hotel! Enjoy your stay...!!!", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brecon", "Title": "“Fantastic hotel in Berlin”", "Author": "BreconGlesni", "ReviewID": "UR117319380", "Content": "A fantastic hotel close to a subway and across the road from a shopping centre and in close proximity to Potsdamer Platz. Minimalistic hotel with beautiful bathroom and wall to ceiling windows which fully open. Breakfast was excellent with fantastic choice. Only downside is that if you eat at the end of breakfast they do run out of popular items such as croissants- so have breakfast before 9am. Nice decor throughout with lovely ambience with bird song piped music in the lift and corridors.Finally lovely comfortable beds and soft pillows All in all, an excellent stay in this beautiful city- certainly the best hotel I've stayed in, in Berlin. Finally lovely comfortable beds and soft pillows", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Manchester", "Title": "“Brilliantly stylish 'minimalist' hotel. Slick to every degree, just need to find their feet.”", "Author": "Nosheel", "ReviewID": "UR117215974", "Content": "We booked a junior suite here as it was pretty reasonably priced, being a relatively new hotel. The room was stunning. Huge bed, great linen, masses of space (not traditonal pull out drawers etc), lovely big shower, big bath 3 sinks (really) and lots of mirrors which I like (I'm not a narcisist by the way)! All the usual tech bits and a complimentary mini bar; which FYI is replenished the actual bar team, not housekeeping. Also great view from mulitiple opening windows. The breakfast is down in the restaurant and is well organised and fantastic. It's all self serve but is beautifully presented and delicious. We actually never got to the full English as the continental selection and the fruits etc were too tempting. The bar area is lovely too but we only spent about half an hour here to be fair. The team were great. Lovely, personable and helpful; it's just some organisation needed. We got the wrong room initially and it took about half an hour to rectify. Also on the first night, there was a big corporate party on the balcony bar below which went on until about 4.30am (and we're two twenty somethings)! We had to complain a couple of times, and though they were lovely and polite, the result took a while to come. We should've stayed out longer!! However all was forgiven the next day when post breakfast we found a stunning three tier cake tray full of mini desserts and an array of fruits with a nice apology. So the service is clearly there. All in all a great, slick and stylish hotel in a fantastic location to anywhere and everywhere whethere by walking or bu metro, bus or train. A shopping centre, a supermarket and bars and restaurants just seconds or minutes away. We would definitely stay here again.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Malmo, Sweden", "Title": "“perfect”", "Author": "skansktos", "ReviewID": "UR117173900", "Content": "great location, a stones throw from the metro station. We had a spacious room with a french balcony and view over Potsdamer Platz. Big breakfast buffet with an assortment of breads and rolls, yoghurt, fruitsalad, scrambled eggs and, of course, nutella. The only complaint would be the breakfast room, a bit big and noisy but we found cosy nooks. A lot of attractions within reach from the hotel as well as a shopping mall with two grocery stores (also lidl behind hotel). The restaurant has a terrace and great food, we even got complimentary coffee with our creme brulee:)", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Orebro, Sweden", "Title": "“Very good value for money”", "Author": "Gellin_Uppsala", "ReviewID": "UR117092725", "Content": "Nice and fresh hotel - Scandinavian designed rooms. The hotel has a nice bar and restaurant on the third floor with a great balcony. Overall friendly staff. The breakfast room was a bit crowded - but you can be sure to find everything you´d want there. The only minus is the strange bathroom door made out of glas- it´s a type of slide door and for most people it has been \"turned\" the wrong way - when you´re inside the bathroom you can´t see outside but if you stand outside the bathroom you can see in to the bathroom. According to the reception - this was the way the designer had ment - but they had started to change the doors and it will probably take a while since the hotel has over 500 rooms.", "Date": "August 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A cool hotel in every sense!”", "Author": "DQnDK", "ReviewID": "UR116715542", "Content": "It was cool to found our hotel was right next to Metro station, their room was specious and clean with a hint of coolness! The reception was cold(as expected being German) but they were helpful.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Very nice hotel”", "Author": "dezdemona", "ReviewID": "UR116689278", "Content": "We are currently staying at the Scandic Hotel and wanted to share my good feelings about this hotel right away. Our room on the 8th floor is quite large by Berlin standards; the bed is very comfortable, the lighting is good. There's a desk + chair, a lounge chair, a flat screen TV on which you can arrange a wake up call or set the room temperature a.o., a small safe and a small fridge. The bathroom is a good size as well with shower (no bathtub). There's free WiFi, a gym and breakfast buffet is inclusive : very large choice if bread, preserves, cheeses and cold cuts, coffee, tea, different kinds of yogurt, fresh fruit, hot breakfast, herring (it's a swedish chain of hotels!). The only drawback at breakfast is the crowd; the hotel seems to cater mainly to tour groups. And thus, breakfast is not a quiet affair. But apart from these moments, you don't hear anybody in the corridors or in the neighbouring rooms.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Hampton, Virginia", "Title": "“Very modern - very Scandinavian”", "Author": "Hampton23669", "ReviewID": "UR116640108", "Content": "I really enjoyed the hotel. The interior is very modern and functional. It has a young and scandinavian feel. Lights in the halls are dimmed and only brighten when triggered by a motion sensor. The breakfast buffet has a cold a hot section. Excellent selection of breads, rolls, cheeses, yoghurt, cereals, cold cuts and even marinated fish for the scandinavian palate. The \"U-Bahn Station\" is right around the corner. Potsdamer Platz itself is about five minutes walking distance.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“So-so”", "Author": "minoushka", "ReviewID": "UR116561272", "Content": "I stayed there for 3 nights with my friend: was not at all convinced. First of all they forgot the amenities in the room. No soap to wash your hands and the shampoo and the body is the same. The room was not very clean either: there was lots of dust under the bed. Other than that a positive aspect was that there was free wi-fi. The location is good. The beds are comfortable. The service : nothing exceptional.", "Date": "August 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Prefect.”", "Author": "Alexs94", "ReviewID": "UR116327706", "Content": "Really really good hotel. the location is great: 3 min walk from Podsdamer platz and the u-bahn is 20 meter from the hotel. The room are modern, fairly big and very clean. The bed was comfortable and the breakfast was absolutely amazing.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Exellent hotel”", "Author": "traveller293984", "ReviewID": "UR116280225", "Content": "we stayed for a week. very good location , very nice staff, exellent breakfast - the best we had in Europe . The Arkaden mall right on the other side of the road . Potsdam platz 3 minutes walking. A lot of options to eat all over . rooms- big , very clean , small empty minibar which we found very conviniant . No shampoo - didn't matter scince we had our own. Free internet . great view from our room. Will come again for sure and recomend it .", "Date": "August 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“New, fresh, echo profile”", "Author": "CBxGBG", "ReviewID": "UR116128098", "Content": "We recommend this hotel, great value for money. Located next to U-bahn and a short walk from Potzdammer platz. Friendly staff, great breakfast. During our 4 days stay everyting has been perfect.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“we loved this hotel”", "Author": "nkg1949", "ReviewID": "UR115946710", "Content": "this hotel is an ideal holiday stay for any new berlin tourist. this was our first trip to Berlin, this hotel is ideally located in tourist and business district, very well connected to public transport and tourist attraction, very neat and well appointed rooms, good breakfast.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Karlstad, Sweden", "Title": "“Perfect”", "Author": "MagnusA_", "ReviewID": "UR115767324", "Content": "Great location, parking garage, easy to reach in a very quiet location. A very nice hotel close to the subway and centrally located with walking distance to many attractions. Very modern rooms. Interesting see-through glass/mirror door in the toilet.", "Date": "July 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Good value”", "Author": "Max2502", "ReviewID": "UR115614315", "Content": "This hotel offers a reasonable price point. You do lose a bit such as the lack of shampoo, bath gel, body lotion etc but overall a good option.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Athens, Greece", "Title": "“a wonderful surprise !”", "Author": "renatapag", "ReviewID": "UR115348091", "Content": "I would describe it an \"Eco - Green Hotel \" with modern minimal design.Not at all expensive. nice decorated rooms, wonderful relaxing details everywhere , very good, healthy breakfast buffet, free internet, convenient position just over the subway !(main line) I ll be back.. Ten minutes walk from Brandemburger Tor.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "5", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Not suitable for female business travellers”", "Author": "Jolistockholm", "ReviewID": "UR115321971", "Content": "The rooms in this hotel are reasonably nice and functional with a comfortable chair and nice armchair to relax in. The location is also good, a very short walk to Potzdamer Platz. However, the service level is not what you expect from a four-star hotel. They provide soap in the shower and next to the sink but no \"proper\" shampoo, no conditioner and no body lotion - things most female business travellers expect. Also, there is no full-length mirror in the room - the only mirror is placed over the sink. As the sink is rather wide and large (an otherwise nice feature), it was difficult to get close enough to the mirror to put on make-up. They had air conditioning, but it did not work very well. When the air conditioning was set to the minimum temperature of 21 degrees C, the room temperature remained at 26 degrees, which made the room rather hot and uncomfortable. It says on the website that the hotel has a minibar in the room, but this is not true. The hotel has a small empty fridge in the room. If you want any drinks or snacks, you need to go down to reception to buy them. And they will not let you charge drinks and snacks to your room - you have to pay right away at the front desk. I found this incredibly annoying, as I now have to give my accountant lots of small receipts instead of one large for the whole stay. It also meant that I spent a lot in cash rather than charging it to my card, and as most frequent travellers know, it is more expensive to make cash withdrawals than to pay with your card. I ordered breakfast in my room one morning. In addition to having to pay twice for my breakfast (they charged it in full instead of adding a service fee to my pre-paid breakfast) the cleaner did not remove the breakfast tray when cleaning the room. It was still there when I got back to the hotel late at night. I found this very odd, particularly since it was so hot in the room - the food looked particularly shriveled and disgusting after a whole day in 26 degrees heat.", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "French in the UK", "Title": "“Very good value for money !”", "Author": "KitKatLP", "ReviewID": "UR114595685", "Content": "The Scandic Hotel offers a very good value for money considering its very convenient location regarding Potsdamer Platz and considering the nearby competition. Cleanliness: impeccable, room size: quite big...I definitely recommend this hotel... One criticism though: the modern uncluttered style decor is much too white ! Feels like a hospital and it does not create a friendly atmosphere at all...", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tel Aviv", "Title": "“Excelence Hotel”", "Author": "Yoav_1", "ReviewID": "UR114299964", "Content": "Excelence Hotel, kind staff, the rooms ar comfortable and clean. The Hotel is located 600 meters from Potsdamer Pltz, above U-Bhan train station (litetally - Mendelson - Bartholy Parc, you cant hear it). Highly recommended !!!", "Date": "June 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great Hotel - Great location, Excellent Staff”", "Author": "DarDub", "ReviewID": "UR113236055", "Content": "I stayed in this Hotel for a weekend with friends at the beginning of June and was very impressed, as was everyone in the group. First time in Berlin and was unsure where to stay and delighted we stayed here. Staff are friendly, polite, helpful, professional and extremely courteous, they had no problem checking us in early or holding onto bags after check out as we had a late flight back on Sunday night. Hotel itself is is very impressive and worthy of its four star status. Nice bar with huge balcony on the third floor. Rooms are well decorated, clean and modern. Location is a little off the beaten track for bars etc but thats a slight complaint . I learnt that as Berlin is so vast you do need to get trains to places - but as it's Germany the trains are efficient and on time! so you are never waiting more than a few minutes and to be honest thats part of the fun of getting to know this great city and its people. Great hotel, great city, I will most definitely return.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Scandia made for a pleasant business stopover”", "Author": "Drioliman", "ReviewID": "UR112929448", "Content": "Ikea styled, clean and tidy. Helpful staff. Good position with many tourist sites within walking distance. Business facilities good. Nice bar with 3rd floor balcony. Would I go back - yes", "Date": "June 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Scandinavia", "Title": "“Ikea style hotel”", "Author": "NikkiNovak", "ReviewID": "UR110329886", "Content": "Wanted to share a room with a colleague but then read Tripadivsor reviews about the see-through bathrooms and thus opted for a room of our own. The bathrooms were not THAT see-through, after all, the glass door was facing the hallway so it is not that obvious. The rooms were modern but simple. Furniture throughout the hotel looked like it was from Ikea. When you walk along the corridor, there is some music in the corners, but if you are a fast walker, the music comes too late for you to hear:) I hope the people staying in the rooms close to the corners of the corridors do not get sick of the music. The rooms are not that sound-proof as I was to find out. I was staying on the 6th floor, but the music from the ballroom could be heard when there was a party going on. The breakfast was big and the breakfast room looked like it was directly from an Ikea catalogue. The location was good with the closest U-Bahn station only 100 metres away and Potsdamer Platz with its shopping and restaurants only a stroll away. The internet connection was free and very fast. All this said, I would like to stay in a more personable room the next time I visit Berlin. This place left me cold.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good Location”", "Author": "ahillyer", "ReviewID": "UR110275388", "Content": "Located in a quiet commercial area but easy walking distance of the Brandenburg Gate. Clean and well appointed", "Date": "May 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Algiers, Algeria", "Title": "“Quiet, Basic, Comfortable”", "Author": "MehdiK", "ReviewID": "UR110139971", "Content": "I read the hotel have great location and easy to reach. That's right. From the airport you can go to the hotel for 2.30 € since the airport is in AB public transportation area. However, if you arrive late, I advice to take a taxi because Potsdammer Platz is such a big and empty place, you'll hardly find someone to help you finding the hotel which is in a secondary side street. Once you check-in ask for the closest Ubahn station, which is just beside. I've read that check in is straightforward and fast and I can confirm that. Which is very good after a long trip. Receptionist are just as nice as you can expect. We asked for a signed document (for our company) on check out, and they delivered without any hesitation. Hope you know what I mean, they are not bureaucratic and doing best effort, and we appreciate that. The rooms are not really big, they are just OK, the bed is fine, comfortable pillows, flat screens from which you set the aircon (which was off one of 4 days). I had a small problem with the lights which you can't turn on and off from wherever you want if you're in bed and you forgot to turn the hall's light off you have to go back up to the door to do. The hotel is playing \"ecology\" card. So tips for the soap: pull up the plastic cover to get more soap. In the shower press the button to have more pressure. There are no teeth past, brush, shaving stuff, so bring your own. Bring your iron as well because theirs doesn't heat at all. I had no problem with bathroom door as it is not transparent. Breakfast: just basic and classical, not really rich: some cheese and salade, eggs, fruits etc. but fine enough. I appreciated the expresso machine. Lunch was not much different from breakfast and in my opinion was not rich at all. I liked : a soup every day, the fruits and the cakes. Salads were not really various. The hotel was paid by the company so I can't say for the value, but I would recommend it for the comfort and the location.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cork", "Title": "“excellent hotel at a great price”", "Author": "mojokiss", "ReviewID": "UR108284463", "Content": "We were lucky enough to get a fantastic deal online for this hotel and we were really impressed when we got there. All the rooms are decorated really well and the beds are absolutely amazing, one of the most comfortable I've ever slept in. All the staff were really friendly. The only downside is that other services in the hotel (shop, bar, restaurant etc) were very expensive but you obviously don't have to avail of them. Highly recommended", "Date": "May 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Fantastic location and great value for money!”", "Author": "kezzapeek", "ReviewID": "UR105918807", "Content": "Just returned after spending 3 nights in the Scandic hotel, Berlin. Travelled together with my husband & two children aged 1 and 4.Managed to get a great deal on hotels.com for a family / superior room which included a sofa bed for my son and a cot for the little one. The room was a standard size, but roomy enough for all 4 of us, luggage and pushchair. It was very clean and was 'made' each day. The bathroom came complete with bath tub and shower extra towels for us all which doesn't always happen when travelling with children. The staff were fantastic, very attentive, friendly and willing to go the extra mile. We tried the childrens menu designed by Jamie Oliver in the Bar / eay dine restaurant and was very impressed. The kids also loved the little play room they have next to the bar area so you can enjoy a beer / coffee after a long day of sight seeing. After booking our stay then reading some of the reviews on tripadvisor i was a littl eworried, but rest assured the standard of service, rooms and design are more than a standard hotel and lives up to it's 4 star status. Location - the u-bahn station postdamer platz is a 5 minute walk or the station ' ......' is actually in the same building as the hotel so is literally 1 minute walk (don't worry you can't hear any noise from either the u-bahn or roads outside). It's very centrally located and you can take breakfast in any one of the nice cafe's in the sony centre or on the surrounding roads. We arrived by car and found it with no problem. Parking was expensive, but hey it's the city centre. We didn't try the breakfast as we agree with some of the other reviewers 20 euros is a little steep, instead taking a coffee and a pastry from any one of the coffee shops in Postdamer Platz. You can also join the hop on hop off site seeing buses from postdamer platz so a great location if your only in town for a couple of days. All in all a great hotel, wonderful location and fantastic staff! Right outside the hotel is a huge green area where you can sit, relax or play. There's also a shopping mall and supermarket right opposite the hotel where we bought cheap sandwiches and bottled water for lunch each day.", "Date": "April 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Oslo", "Title": "“No air condition...no service”", "Author": "Radler09", "ReviewID": "UR105908975", "Content": "The room was very hot, and it was difficult to sleep. So we asked in the reception if the aircondition maybe didn't work. We had to be patient, they told us, even if we tried to turn it on 24 hours earlier...any way, they should check out the problem. Then we didn't hear anything, so we had to ask again. Now they said the air condition system in the whole hotel wasn't working much... The only \"help\" we got was the advice to open the window...great. Especially when the window was very small and impossible to open more than 3 centimeters... We didn't sleep much for the three days. Wouldn't go there again. Even if the get the air condition system up and working, the service is very poor.", "Date": "April 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chula Vista", "Title": "“Great location next to the trains and Berlin Wall sites”", "Author": "LuisaTeacher", "ReviewID": "UR104665387", "Content": "We booked two rooms that turned out to be on the 8th floor, above the trains. The room was small but had all of the amenities including a duvet for each person. We could see the trains arrive from the window but could not hear any sound. Great sound-proofing. The one drawback was the bathroom door. It was mirrored on the inside but from the outside it was see-through. That meant that there was no privacy in the bathroom. Hmmmm....call us uptight Americans, but we don't like to watch family members performing normal bathroom functions! The parking was initially a problem, because we arrived at 1:30 am the desk clerk said there was no room but that we could park on the street (pay the meter at 8 am) or park in the nearby parking garage at 20 euros for 24 hours. We opted for the parking garage and only paid 9 euro, perhaps due to the fact that we left at 9pm and did not spend 24 hours in it? The location of the hotel was perfect for walking to Brandenburg Gate, Checkpoint Charlie, and the Topography of Terror. We then took the train to the zoo and returned directly to our car. We did not eat the 20 euro breakfast but opted to find food on the walk to Brandenburg Gate. We would definitely stay here again!", "Date": "April 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“Clean Bright - Location Location Location”", "Author": "BathTim", "ReviewID": "UR104490800", "Content": "Really nice stay, travelled with 2 other couples whose room had the infamous glass bathroom door - our however was wooden!! (Room 711 i think) Views from panoramic windows fantastic. Take breakfast up the road at Cafe Balzac - filled croissant and great coffee for 2 euro 50! Finally the bar on the 3rd floor is great, buy your drinks before sitting down as waiter service dramatically increases the drink prices!", "Date": "April 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Excellent hotel with good location and modern Scandinavian style!!”", "Author": "Fanni_10", "ReviewID": "UR102610299", "Content": "We stayed at Scandic Berlin Potsdamer Platz for 3 nights and from our experience I can highly recommend the hotel to everyone. Everything is spot on and we personally enjoyed the Scandinavian fresh, modern and chill style and atmosphere of the hotel. Location is also very good, next to metrostation (easy to explore the city) and all the services that Potsdamer Platz has to offer (restaurants, shopping mall, cafes etc.). Breakfast is not included to price (it´s quite expensive, 18 euros as i recall it) but there are plenty of good cafes nearby to choose from. I would definately go back again!!", "Date": "April 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Helsinki", "Title": "“Great Scandic Quality in good, quiet location”", "Author": "V0YAGER13", "ReviewID": "UR100035587", "Content": "We stayed in this Scandic hotel for two nights on weekend and paid only 130€. It was a bargain even though breakfast was not included. We were very pleased and we can truly recommend it. It´s a great hotel, there was some remodeling going on on the same floor where we stayed but it did not bother us at all. Rooms were very quiet. We got a room which must have been just done; everything was spot on including furniture (the bed was really comfortable). Only silly thing was the make up mirror which was installed kind of behind the sink in a way that it was impossible to use it. We did not buy the 20€ breakfast since there´s cafes everywhere. Staff was very nice. We arrived at the hotel around 10 AM and got the room right away. We made our flight check in online (free wireless internet) and sent boarding passes to the reception where we picked them up next morning (it was waiting us there). Perfect service. Checking out was quick. Everything worked smoothly.", "Date": "March 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leicester", "Title": "“Great hotel great Location”", "Author": "Danny82", "ReviewID": "UR99223050", "Content": "Stayed in Scandic for 3 nights early march, hotel right next to Potsdamer Plazt, one of nicest areas of Berlin neary Sony centre, Imax cinema, Blue man group, casino bars shops restaurants etc, Hotel very nice staff polite friendly, rooms spacious enough comfortable, Breakfast really nice english m german pastries fruit etc, Fantastic value paid £47 a night for 2 with breakfast included, would defiantely stay here again, Roof top gym as well for teh fitness fanatics.", "Date": "March 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oulu, Finland", "Title": "“All was great”", "Author": "Ninni021", "ReviewID": "UR98634663", "Content": "We just came home from the Scandic Berlin. All was good, hotel was spotless clean, staff were friendly, location is good near Potsdamer platz area. There are food places, cafes etc. Almost opposite the hotel is a shopping centre with good shops. Breakfast is not included for price, but there are good breakfast buffee places nearby.", "Date": "March 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Excellent hotel in excellent location - if you don't mind people seeing you on the toilet”", "Author": "garyBS", "ReviewID": "UR97328077", "Content": "Stayed at the Scandic whilst filming the McLaren F1 Car Launch in Berlin at the beginning of February. The hotel is superb - it's clean, modern and close to the Sony Centre/Filmhaus. The Nordic theme is pulled off well, with novel sounds as you walk around the corridors (I liked it to being is a Disney film everytime I left my room) The room was well soundproofed, very clean and comfortable. I had a great couple of nights sleep. The view from the back of the hotel isn't great, but sod the view - get out and look around Berlin! The only 'downside' to the room is the bathroom door (as others have mentioned). I was staying in my own room, but if I was sharing the room I'd have been embarrassed that other people in the room can see me on the toilet - something I think needs to be addressed. I know other people in my party found this amusing at first, but soon became a bit of a pain. The internet connection (free) was VERY high speed. The food/beer was great, sometimes there was a language-barrier problem with ordering room service from the restaurant (though this is my fault not being fluent in German really) but all the food arrived quickly when ordered. Good menu selection. Breakfast was diverse, with many different options to cover all tastes. It was my first time in Berlin (thought hopefully not my last) and I would definitely stay here again given the chance.", "Date": "February 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "East Mids", "Title": "“Strange but good”", "Author": "HippyTraveller", "ReviewID": "UR95147955", "Content": "A most peculiar hotel in terms of décor, banks of canes in large bases everywhere, odd design of seating and tables, bird song in the corridors and temple gongs in the toilets. I think it will show its age fairly quickly but in terms of a hotel stay it was fine. Reception very friendly and helpful, bedrooms comfortable, shame about the glass door in the bathroom, personally I think they were installed the wrong way round and the mirror should be on the outside and the see-through on the inside but for one traveller it is not a problem. Restaurant food was well cooked and well served, little shop in Reception has set a new record €4.80 for a diet coke, Lidl round the corner sold six Diet Pepsi for €2.40. Bed comfortable but the only English TV channels were 4 loads of News, can be a bit tedious. Good breakfast and generally good value for the hotel although food a bit expensive.", "Date": "February 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great hotel in a perfect location”", "Author": "foxy_lady2011", "ReviewID": "UR94184248", "Content": "I stayed in the beginning of the month in the Scandic Berlin Potsdamer Platz. It was a great experience: the hotel has a theme \"Scandinavian Oasis\". The rooms and public areas are designed in the different seasons like Spring, Summer, Autum and Winter. While the lobby looks very winterly, is the restaurant mirroring the spring with many real green plants and birds chirping during the breakfast. The small but very well equipped gym has even a small sauna which helps to chill out after work out. The staff in the hotel is friendly and smily. They seems to have fun working there. The most interesting was for me to find out that an underground is going thru the hotel as there is an station just next to it. But don't worry, there is no noise at all. One evening we decided to go out for dinner: there are so many options close to the hotel as it is located very central at the Potsdamer Platz. My colleagues and I can definately recommend this hotel also if you are traveling with family as they even have some kind of kids room close to the bar/restaurant....", "Date": "January 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tyumen, Russia", "Title": "“excellent location, nice hotel”", "Author": "vorobzej", "ReviewID": "UR92621969", "Content": "stayed 03 - 09.01.11 one really great thing about this htl is the location, as central as possible with one u-bahn stop round the corner and potsdamer platz station with several u/s-bahn lines 3 min walk, and on a very quiet street at that. just across the promenade the \"arcaden\" with shops, fastfood, cafes, supermarkets, open till 9 pm. potsdamer platz within 3 min walk with many bars, cafes, restaurants. 10-15 min walk to branderburg gate, reichstag & unter den linden. all main attractions in east berlin can be walked to if you like to walk, places in west berlin easily accessible on train. the hotel itself is really nice although rather business-oriented, all new and sparkling clean, great beds with crispy clean linnen, my room very spacious compared to other european htls i stayed in, faced a quiet back street an had two huge ceiling to floor windows with a view of alexander platz needle in the distance. the overall decor is somewhat simplistic with some ridiculous cheap details like photo wallpaper with birch trees or some strips reminding of adhesive paper applied to mirrors in elevator lobbys, and a haunting \"ambient\" sound jingles with birds chirping when you turn round a corner in the corridor. this sound is inaudible in the room, so it's not bothering, just ridiculous, kind of a thing from the past. beakfast 6.30 to 10 is a really good selection of everything you would typically have at a beach rather than a city htl. decent coffee from a machine. many kinds of tea (teabags). restaurant decor also given a \"scandi\" feel with again some ridiculous details like some toothbrush-like borders separating tables and the beforementioned artificial plants & bird sounds. the clientelle during my stay was mixed: some elderly italian citizens, some germans, families, most leisurly looking, and a couple of men wearing suits. overall impression which i think share our whole group of 11 is great hotel, would recommend to anyone although next time i might try something with a more period look or maybe hip ambience but would be glad if had to stay here again.", "Date": "January 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Luton, United Kingdom", "Title": "“Great staff, great locations, BAD bathroom design.”", "Author": "mattgibbs", "ReviewID": "UR90744781", "Content": "Hotel was fantastic - brilliant location, staff were helpful and always available, rooms were clean and bright. Bathrooms however were badly designed. The doors were see through glass which slid open and closed. I was travelling with friends - to ensure we weren't seen by each other using the toilet or shower - we had to have the bathroom lights off and the bedroom lights on. Perhaps we are prudish Brits but there are just some things friends dont even want to do in front of each other. Other than that - great!", "Date": "December 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Israel", "Title": "“Too modern for our taste”", "Author": "Pustilnik", "ReviewID": "UR90291384", "Content": "Overall we were happy with the hotel. The check in and check out were very rapid. Service of the hotel personnel was good. Breakfast was great with lots of selection. The room was spacious and designed in a very modern style. However, there were several drawbacks to the design: 1. The bathroom/toilet was closed with a sliding door. This door was semi-transparent which made it unpleasant to use to toilet with other people present in the room. In addition, when going into the toilet at night, the light penetrated the glass and could wake up other people in the room. 2. The bathroom sink had no shelves or surfaces next to it. So it was impossible to place toothbrushes or towels or anything else close to it. 3. Only soap was provided (no shampoo or body lotion or anything else). In addition, it was almost impossible to extract the soap from it's container. 4. The design of the bathroom was very pretty but there was no separation on the floor between the shower and the rest of the bath. That caused all the water from the shower to spill into the room and wet the whole floor.", "Date": "December 20, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Various", "Title": "“Not for an asthmatic or those who do want not to become one”", "Author": "Jatador", "ReviewID": "UR89858886", "Content": "I guess there was something forgotten when the hotel became built - in trems of aircon or ventilation. The hotel is full of dust. Checked in couple nights ago for a biz conference attendance. Following morning started to have sniffles, and supprisingly I found out that many colleques at conf reported the same. Flu wawe finally entering Berlin, many concluded. But, then my eyes started reacting and got some respiratory symptoms... I started looking around. The night table in my room (see picts) that I cleaned an hour ago was all over covered with white dust. The room was full of dust, also the corridors! I talked with a mgr on duty in the reception, and the answer was very polite: we'll have the tech coming to work tomorrow morning, and check what's going on! BS. If there is an issue with dust distributed to room thru ventilation - and that has been going on for several nights, that can not be a suppries for the mgmt. A hotel I'll never visit again.", "Date": "December 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“It was a lot of little things but little things mean a lot.”", "Author": "solomon5", "ReviewID": "UR89227547", "Content": "We have become great fans of the Scandic Hotel chain. We first found them when they were a part of the Hilton family and we had some really good reward stays. We were so happy with the chain that we went out of our way to stay there on several trips to Sweden. We were really looking forward to our stay at the brand new Scandic in Berlin. It is really easy to get there by public transportation. The U-bahn literally goes through the hotel building and the station is steps away. We never noticed any noise or vibration from the trains. Our room was ready when we arrived at 11 from the airport. Check-in was quick and easy and the desk clerk explained breakfast and how to use the key cards. It was a good thing that she did because there was absolutely no written information in the room. At first glance the room was fine. We had a small sofa that might have pulled out to accommodate a third person and our room overlooked a small park. The bathroom was a different story. The sliding glass door to it was one way glass. Depending upon the lighting in and out of the bathroom, the occupant either had a mirror and was fully visible to those outside the room or could see out and no one could see in. It was not an issue for us but could have been for others. There was also a green glass window that allowed light from the bathroom to shine into the sleeping area. This was fine in the day time but lit up the bedroom when it was dark. It could be a real problem if you are light sensitive. Using the bathroom was not much better. The soap dispensers, great for the environment, were very difficult to use. I do not know if this was a design flaw or that they were nearly empty. The water pressure in the shower was pitiful and, in fact, there seemed to be a better flow in the sink. Things did not improve when we went to leave the room. The safe was locked and there were no instructions on how to use it. There was no Do Not Disturb sign to put on our door. And when we actually went out the room door, it did not shut automatically or completely. We always had to stop and pull the door shut. We had a nice buffet dinner in the restaurant for 18 Euros. There was a wide variety of food with something for every taste. The desserts were especially fun since there were tiny portions of lots of different things. The Scandic breakfast is one of the high points of the hotel. \"Breakfast is always included\" is boldly printed on their website. Between the time we reserved the room and our stay, there is now an asterisk by it that says hotels in Germany are not included. It was included for us based on the date of our reservation but others were paying 20 Euro for it. That was a lot of money for the breakfast. It was extensive but not well labeled. The breakfast room was quite busy but tables were quickly cleaned. There was one other memorable thing about our stay. Every time we walked out of room, we were surrounded by the annoying sound of chirping birds. I wish they had spent that money for more practical things that would have made our stay more comfortable.", "Date": "December 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Copenhagen", "Title": "“Sorry Scandic – det er ikke godt nok (not good enough)!!”", "Author": "Rednavillo", "ReviewID": "UR85339898", "Content": "We stayed at the Scandic Berlin Potsdamer Platz during a weekend. The hotel is located 10-15 minutes walk from the Bahnhof Potsdamer Platz. It was quite obvious that the front desk staff was recently hired, a bit unsurtain of procedures upon check in, though we were greeted with a very warm and friendly smile by a dark haired guy - speaking good English (not very common in Germany)! Our superior room, filled with dust bunnies, faced the Potzdamer Platz, i.o.w. facing the BVG and Pfizer building. We were told that the only thing differentiating a superior room from a normal room is the \"beautiful view\" and also that there were beverages inside the mini bar in the superior room. We would recommend a normal room. Use the money you save on a visit to a Blockhouse restaurant or a visit to KaDeWe. Surprisingly, the Scandic hotel restaurant was too expensive, which is not the case in Sweden or Denmark. The Thai waiter in the restaurant was extremely service minded though! His colleagues not so much. While the Thai waiter was really busy other guests had to find a table themselves and it then took ages before another German waiter found the guests and there was no shortage of waiters. The superior room had extremely poor sound isolation! We heard intoxicated guests in the corridor at 3 AM and other disturbing sounds. This is really annoying when you just want to get a good nights sleep yourself! When calling the front desk a lady promised to look into the possibility of giving us another room and she promised to get back to us. After quite some time we went down to the front desk as no call had been received. The short blond German lady said: \"Oh, it was me....I forgot you...sorry, I shall see...\" and she looked very bothered. I asked if we still could have the \"beautiful view\" and if not, if we perhaps could pay for an upgrade to a larger room at the very end of the corridor? An upgrade was probably not possible to make according to the lady. The lady informed us that she would go and speak to her “boss\" and away she went. Very surprised we remained in the lobby by the front desk to see which solution the hotel could offer us. When the lady came back she looked even more bothered and informed us that the hotel could offer us another room. I asked again regarding the upgrade, if this could not be made in any way? The lady got really ill-tempered and shouted: \"AS I TOLD YOU - NO\" and snorted at me!! It ended up with us getting a room key card and going up to the room. In the hallway we could see that the room was just next to an elevator (very noisy). We went down to the front desk again and I asked another lady at the front desk to see the front desk manager. \"Why??\" she replied. Because now I have a complaint I said. At the end of a long discussion, the front desk manager managed to get us another superior room, also filled with dust bunnies, and she blamed the language barrier when I told her about the blond little lady that snorted at me!! This was no language barrier, this was a bad example of a lady that should not work within the service industry!! Fortunate enough the hotel had other very service minded young people at the front desk. Another thing we noticed the following morning was the terrible noise in the breakfast lounge!! This was killing us in the morning. Not very pleasant! This is really something the hotel needs to do something about! All in all, I think we will chose another hotel next time we visit the beautiful city of Berlin, a hotel with a better sound proofing in the rooms, a less noisy breakfast lounge and perhaps not so many \"language barriers\". Sorry Scandic – det er ikke godt nok!!", "Date": "October 30, 2010"}], "HotelInfo": {"Name": "Scandic Berlin Potsdamer Platz", "HotelURL": "/ShowUserReviews-g187323-d1674685-Reviews-Scandic_Berlin_Potsdamer_Platz-Berlin.html", "Price": "$116 - $183*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Gabriele-Tergit-Promenade 19</span>, <span class=\"locality\"><span property=\"v:postal-code\">10963</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "1674685", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/f7/20/f720846328e6a77b77623a02510c19705large.jpg"}}