{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, England", "Title": "“Great City Break Hotel for our Honeymoon”", "Author": "PaulCav", "ReviewID": "UR128521828", "Content": "We completely agree with all the previous positive reviews about hotel, location and helpful staff. We took a standard suite and everything was great about the room including bed, shower and facilities. There's a DVD player in the room and reception has a selection of the latest films if you want a quite night in after exploring Istanbul. The wifi in the room can be hit and miss but there's also an ethernet cable provided for a more stable internet connection and very useful for access to the internet and free access to computer in business lounge in reception. Breakfast was great with a wide selection of cereals, fruit, eggs made to order and other cooked items. Also great as they served up to 11am if you fancied a lie in! We ate in the hotel bistro and the rooftop restaurant and both decent enough and also ate at the Faros Hotel around the corner which was very good. If you want a very special meal go to the Mikla rooftop restaurant in the Marmara Hotel on the north side of the river. It's about 10 lira (Â£3) each way in a cab for about 10 minutes or probably 45 mins by public transport. It has a rooftop veranda which gives an amazing view of the river, the sea and the old city. Lots of people just go for a quick drink and the view but the food was fantastic (about 200 lira for two people, two courses and a bottle of wine - about Â£70 including service). The historic sites including Palace, Cistern, Hagia Sofya were amazing. The front of the Sultania hotel is next to a noisy bar (open until 1am) but nothing that earplugs didn't solve - let's face it if you stay in a hotel in a busy part of the old city you have to expect this. Otherwise stay on the 18th floor of a hotel outside the city for absolute peace. All the rooms have double glazing which helps and also look for the tiny air vents which when closed reduce noise even further. Do not miss out on using the Spa and swimming which are located in basement of Sultania. Free access to decent pool (we went in April and sometimes didn't see anyone else). We did consider going for an historic turkish bath but ultimately you end up travelling back to hotel through stressful city and ruining the effect. The Sultania steam room and turkish bath room were brilliant and the staff were great and we had a seperate massage too (all for 65 euros each for turkish bath and massage - 2.5 hours of bliss!) On a final note the staff were amazing and proved their help on our final day at the hotel when we discovered our flight home had been cancelled. It was a Friday morning and most hotels were fully booked but the Sultania is part of the Yasmak Hotel chain and owns 4 hotels on the same street. The Sultania was fully booked but within an hour we were booked into Yasmak Comfort (a literal 2 minute walk away) and our luggage transfered. This made an extra day in Istanbul a stress free one and we flew the next day. Always check your flight status before leaving your hotel! All in all a brilliant stay and recommend to anyone!", "Date": "April 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Surrey", "Title": "“Perfect location to see the sights”", "Author": "SurreyLadyP", "ReviewID": "UR128431660", "Content": "In a perfect location and with really first class staff, the Sultania was a pleasure to visit. Excellent welcome and the concierge could not have been more helpful and went out of his way to keep us informed of events happening in the city each day. Great breakfast buffet, likewise the coffee! When showers were forecast, a tub of umbrellas immediately appeared - every detail was thoughtful. Only criticism - no body lotion in the bathrooms.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "washington dc", "Title": "“Restful Oasis in Instanbul”", "Author": "DCLregular", "ReviewID": "UR128302704", "Content": "We stayed here for three nights during our tour of Turkey. The service at this hotel is outstanding. From the moment you walk in you are made to feel welcome and acknowledged as a treasured guest. The breakfast offers a large variety of options with excellent service. When we arrived for check in our reserved room was not ready so the hotel upgraded us to a large suite - a nice touch rather than making us wait. We had dinner one night in the roof top restaurant. The food was good and it was a peaceful reprieve from the touristy food at the nearby restaurants. The location was within walking distance of many tourist sights. If I go back to Istanbul I will stay here again.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Couldn't fault it”", "Author": "JaneBoleyn", "ReviewID": "UR128223991", "Content": "Central location, sleek decor, clean and modern individually styled rooms, friendly, helpful staff. Delicious breakfast buffet with endless choice including fresh honeycomb and a vast array of breads - ask for freshly squeezed orange juice, it isn't on show. Free tea and coffee with pastries available all afternoon as well as Turkish sweetmeats in your room daily. Fresh and dried fruits in the hotel lobby. Really comfortable beds, excellent shower room with efficient plentiful hot water, beautifully decorated. Being only a few minutes walk from the Aya Sophia and the Blue Mosque, the hotel is down one of the many tiny narrow streets and being driven there by the hotel taxi is an experience in itself! There is no view from the rooms, but that didn't matter at all. You are so near to the main sites and the waterside, you can walk everywhere or get the tram from the stop only 2 minutes away.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Canberra", "Title": "“Ideal location”", "Author": "Peter H", "ReviewID": "UR128093738", "Content": "Spent a few days at the Sultania and found it an ideal location for exploring the historic Sultanahamet district of Istanbul. The service at the Sultania was exceptional, the staff couldn't be friendlier or more helpful. Breakfast was a delight, and set us up for busy days exploring the historic sights of Istanbul, most of which are within an easy walk of the hotel. The beautifully kept pool and spa in the basement were a bonus. The street outside is lined with excellent resturants, though they can be a bit pushy trying to get you to eat at their particular place. Watch the restaurants under the Galata bridge, we were conned into ordering way too much food, and ended up with a hefty bill and a lot of leftovers. However I would recommend an Istanbul holiday to anyone, and the Sultania is definitely the place to stay.", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "cornwall", "Title": "“5* location and staff - iffy bathrooms!”", "Author": "FlorenceNewt", "ReviewID": "UR128060115", "Content": "Booked the Sultania based on Tripadvisor recommendations - and agree with (almost) everything that other visitors have said. Food, personnel and location are fabulous. My only complaint was with the room - and in particular the bathrooms which appear as a triumph of conceptual design over practicality. There is very little privacy in what is, ostensibly, an illuminated glass box in a corner of the room. Thin glass, transfer printed with a 19th century Italian Orientialist painting, affords very little in the way of soundproofing (the door didn't close properly, either!) While lying in my bed, the toilet was three feet (1 meter) from me - not a great view for a 4-star hotel! The glass walls of the enclosure meant that the entire room was flooded with light (not convenient in the middle of the night!) There was nowhere to put anything within the bathroom. Our room had no natural lighting save for a tiny vertical window overlooking the air-conditioning units. The rest of the lighting was either orange in hue, or useless. No task lighting for reading, writing, applying makeup etc. Blue standby lights illuminated the many light switches - far too many of these; tinny overhead speakers for the flat screen tv. Wish I'd have known about the pillow menu - I'd have traded in my rock hard lumpy one for something more comfortable. So - the staff and restaurant (the Olive is particularly good) made up for these negatives. I'd come back to the Sultania, but I'd also try its sister hotels that (according to the receptionist) have 'proper' bathrooms for those of us that appreciate personal space with walls and a door that is separate from the sleeping accommodations.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sofia", "Title": "“Excellent hotel”", "Author": "StanimirSofia", "ReviewID": "UR127982528", "Content": "I was in Sultania hotel for the second time with my family. Great experience. An excellent butique hotel in the very heart of Old town. On a walking distance from many interesting places - Agia Sofia, Sultanahmed mosque, Grand Bazaaar. On a quiet street, just a block away from tramway line, Station, and pier. As I come from Bulgaria I was with my car, and it was parked by the corner - safe and secure. The breakfast was rich and full. And most important - staff is perfect - friendly, competent and supportive. Thank you. I would stay at your hotel each time when I visit my favourite Istanbul. I would recommend it to all of my friends.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Incredible Istanbul”", "Author": "Aurelio52", "ReviewID": "UR127952255", "Content": "Having finished a cruise on the Mediterranean the hotel needed to fill very big shoes. They did with flying colours. The room, the location, the staff, it was all excellent. Not sure when we will be back in Intanbul but whenever that is we will certainly stay at Sultania.", "Date": "April 15, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Lush!!!”", "Author": "Kaytie66", "ReviewID": "UR127934960", "Content": "A fabulous hotel - the staff are very friendly and helpful. The rooms are exquisite. The breakfast is amazing - the best I have experienced. Excellent location with magnificent views from the roof top terrace. The food in the restaurant is the best we ate while in Istanbul; Turkish cuisine with a western twist, amazing serve with a very helpful sommelier. It would be hard to beat this small, quiet but friendly hotel. I would unreservably reccommend this to any one visiting Istanbul.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cambridge, UK", "Title": "“very good tourist hotel with wonderful breakfast buffet”", "Author": "trevor t", "ReviewID": "UR127796914", "Content": "We have just come back from 4 nights at the Sultania. It's location is perfect if you are a tourist, being in the heart of the old city. It is located on a pedestrian only road, so it is very much quieter than might be expected - we could sleep with the windows open with very little disturbance. The rooms were clean, not very large, but comfortable for two people, and we had a small balcony. The breakfast was wonderful and was the best buffet I have seen for ages. The staff are all very helpful, with most of them speaking very good English. I would not hesitate to recommend it to others, or to go back there again.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stevenage", "Title": "“Sleep with the Sultana”", "Author": "SusanLW55", "ReviewID": "UR127791968", "Content": "The welcome and check in was excellent- offered a seat and a drink whilst our bags were taken to our room. We were right in the centre of things, easy walking distance to the main sights or to the tram. Excellent location surrounded by good restaurants. Rooms are themed around various Sultans or Sultanas and furnished in a beautiful contemporary style with an Eastern twist. All the staff are friendly and helpful. Good breakfast buffet and excellent service. We shall definitely seek this hotel out again when visiting Istanbul.", "Date": "April 13, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Charming”", "Author": "Fay G", "ReviewID": "UR127713710", "Content": "Our first visit to Istambul and the staff provided very helpful information which enhanced our stay in this magic city", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Broadway, Worcestershire", "Title": "“Feel like a Sultan!”", "Author": "DavidNeil_11", "ReviewID": "UR127476076", "Content": "They said we'd feel like a Sultan (or Sultans), and we did. This is a gem of a hotel right in the centre of things in the Sultanahmet district. Walking district of all the main sights, and with a great position on the tram route. Rooms are beautifully furnished, well equipped and have especially comfortable beds. The breakfast buffet was excellent, with a superb array of home-baked breads and pastries. Joining it all together were the wonderful staff; amongst the most friendly, helpful and efficient of any I've ever encountered. Altogether a most enjoyable experience. Thank you Sultania!", "Date": "April 8, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Hasselt", "Title": "“Charming hotel in Sultanhamet”", "Author": "Marc D", "ReviewID": "UR127409173", "Content": "Very good, charming hotel on an ideal location. Very nice rooms, very friendly staff. Close to Aya Sophia, Topkapi, Blue Mosk, Spice Bazaar, .... Numerous small restaurants in the close neighbourhood. I can recommend Sultania to everyone planning a city trip to Istanbul.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tokyo, Japan", "Title": "“The other recommendations were accurate: It's a great place to stay.”", "Author": "Whats4dessert", "ReviewID": "UR127349652", "Content": "From the welcome to the send off, we were consistently met with professional and warm service. The rooms are small but are very clean and well-maintained. Small touches such as small trays of Turkish delight treats each night, the breakfast buffet was superb, and the guest services were gracious and helpful. We found their free wi fi internet to be spotty, but since we were on vacation, it was not critical for us, but it might be a problem if one really relied on the net. Servers at breakfast were top-notch and on our last day a man who we had seen cleaning our room saw us waiting for our car, came over to us and with the warmest and most sincere smile, thanked us. Sultania is located 5-10 minutes from the most popular sites and is about two minutes from the nearest tram stop so it's very convenient. If I return to Istanbul, I would stay again.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent small friendly hotel in old part of city”", "Author": "James D", "ReviewID": "UR127184574", "Content": "Very friendly welcome to a luxurious room with good shower, kettle, minibar, lots of lights all in good order and working. Fantastic range of food for breakfast. Very friendly and helpful staff. Fast free internet. Good sauna, turkish bath, pool and gym. Excellent location for the main sites within 10min walk, good restaurants close by and a wide range of shops and tram stop 3 mins away. Sweets, dried and fresh fruit in lobby and often pastries from breakfast. A hotel that is interested in first its guests and their needs and comfort before making every last penny from one.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Superb service in great location”", "Author": "AOA68", "ReviewID": "UR127012384", "Content": "I stayed at the Sultania Hotel for 4 nights in the last week in March and I couldn't have hoped for a better experience. The first and most brilliant aspect of the stay was that as soon as the reception realised that I had arrived alone and without my wife, I was told that I would only be charged for single occupancy, despite booking a double room with terrace (5th floor) and not even raising the issue. I must say that I remained suspicious until I was given the check-out bill. I was really stunned that a hotel would take such an initiative. The hotel is unique in terms of the service, which was unfailingly top class across all aspects (over years of frequent visits to Istanbul, I doubt I have come across a better Breakfast buffet), the location which was close to transport hubs (Gulhane Metro is a few steps away) as well as main historical sites (Blue Mosque, Haige Sofia, Museum of Science and Tech in Islam, Topkapi Palace, Bosphorus, etc). If there was a drawback, then it was the poor and intermittent Wi Fi connection in my room. Otherwise, top marks and huge thank you to everyone at the Sultania for making this visit one of the best ever to Istanbul.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Fantastic!”", "Author": "Cintia Z", "ReviewID": "UR126996689", "Content": "I highly recommend this hotel....it was one of the highlights of my stay in Istanbul. The staff was very friendly and very helpful, the location is prime, the room is beautiful and the breakfast is memorable. Additionally, it is small and with a lot of character.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Agree with all the good things said elsewhere and we are fussy.”", "Author": "Essexboy10", "ReviewID": "UR126977581", "Content": "Excellent location in old town but have the address, with phone number and google map of hotel with you as taxis cannot get right outside and do not always know the side road. The taxi from the airport ( very easy and only circa TL50) had to phone. Hotel bus did not wait long enough as it took an hour to get through immigration etc. Staff are superb. Ask about using the tram at bottom of road and other trains as so much better then getting stuck in the traffic. Hotel was excellent in all respects. Breakfasts were very good and restaurant also good but do check out restaurant opposite to hotel entrance as best we found in Istanbul including the fish restaurants in Kumkapi and also down Nevizade Street (must see in the evenings). ATM Nothing to do with the hotel but be careful when using the ATMs in Istanbul especially near rail station. A stranger will help with the language, play a trick with your card and the stupid machines shown your pin numbers in large print on the screen for all to see - we got stung and are very cautious.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Voula, Greece", "Title": "“Exellent Service, Very nice rooms”", "Author": "Dimitris M", "ReviewID": "UR126849933", "Content": "We spent a long weekend in Sultania and the experience was fantastic. It certainly made our trip! The location is great. Although it is very close ( 2 minutes walk) to the main sightseeing area of the old town (AgyaSofia, Top Kapi), the hotel is located in a small and quiet street, so it doesn't get busy and loud. Also it is very convenient as it is next to a tram stop. So moving to other areas of the City is very easy. Having spent sometime in Taksim square (the other area of Istanbul full of hotels) I definitely prefer the old town location-wise. The rooms are very cozy and very clean. The decoration successfully sets a Turkish / Ottoman scene and it is not too much. The hotel amenities include everything you would expect from a luxury boutique hotel (bathrobes, toiletries, wi-fi, etc) and there is not one thing I can think of that was not available. Last but not least, the hotel staff was extremely friendly and helpful. I contacted Hilmi at guest relations in advance, in order to book some restaurants. He was very helpful, his replies were fast and his suggestions were spot on. Having been to many hotels, I would easily rate top 5 the service of hotel Sultania.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Medina, Saudi Arabia", "Title": "“Amazing location, Luxurious rooms, and Super friendly staff”", "Author": "Ahmad A", "ReviewID": "UR126784050", "Content": "This hotel is nicely located in old city of Istanbul. Further it is elegantly furnished with a touch of exotic Ottoman style. The staff are doing more than what you expect to keep your trip uneventful and to make you comfortable. The price is reasonable for the comfort and atmosphere. I stayed twice at this hotel and definitely I will keep top on my choice list on my next visit to Istanbul. In addition I will strongly recommend it for friends who are going there.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Milan, Italy", "Title": "“Very nice, friendly-staffed and conveniently-located hotel”", "Author": "FBG_72", "ReviewID": "UR126643461", "Content": "I spent a long weekend in Istanbul, staying in a single room at Hotel Sultania - a sort of boutique hotel in the old part of the town, at a short walking distance from all the unmissable sights such as Topkaki Palace, Blue Mosque etc. To reach the new Istanbul with its restaurants and nightlife, the tramway stop is just around the corner or you can catch a taxi, quite cheap in comparison to other major cities in Europe. The staff at the hotel was extremely kind and helpful e.g. in making suggestions and reservations for dinner. Colours and forniture of the room were in Oriental style, very nice! Despite the room was on the first floor overlooking a small alley full of bars and restaurants, it was very quite.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Amazing Service Excellent Location”", "Author": "FuserS", "ReviewID": "UR126638304", "Content": "This hotel is perfect with everything they offer! The staff is very friendly and attentive, from the moment you enter the hotel, with their warm smile and greetings, until check out when they wave goodbye and give you a small gift. I have been to many hotels with bed & breakfast and none of them had such variety for breakfast, it's an open buffet with EVERYTHING you can think of. The rooms are well equipped with everything you need-even an iPod charger! I loved this place and did not want to leave. Thank you Hotel Sultania for this wonderful Istanbul experience, I really did \"Feel Like A Sultan\"!", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Amazing experience!”", "Author": "manal88", "ReviewID": "UR126609606", "Content": "Sultania hotel was an amazing experience ! We chose this particular hotel for our honeymoon, and we are extremely pleased with the excellent service, helpful staff, beautiful hotel decoration , and amazing location ! The Blue Mosque,Hagia Sofia and all of the heritage sites are within walking distance from the hotel , and this is what even facilitated our tourism in Istanbul even more ! We shall be returning there soon inshallah !! Best wishes and regards from Manal Chamseddine and Amer Okeh - Dubai â™¥", "Date": "March 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kuwait", "Title": "“Nothing is too much! Thank you for a wonderful time”", "Author": "Declanz", "ReviewID": "UR126502502", "Content": "We spent four nights at the Hotel Sultania and all we can do is sing the praises of this wonderfully located hotel staffed by the most hospitable people. The hotel is ideally situated right in the heart of downtown Istanbul and so is accessible to all the sights and sounds of Istanbul. The rooms are all unique and the shower area is an intriguing use of the room. We arrived late at night and were met at Sabhia Airport (a long way out of town) the reception staff could not do enough to welcome us. We were very happy to get into our very comfortable and well appointed room. I am not sure there is anything that they may have overlooked and we had the first of several good nights sleep in their canopied beds The next morning and every morning subsequently there was a smorgasbord of breakfast delights available. There can be no fault and the staff here were equal to reception with nothing being too much. Our memorable trip to Istanbul was only marred by the loss of a Kindle reader, however the lady manning the Guest Relations was more than able to assist in this and was able to locate it. Sadly it was back at the airport which meant another haul out there and back. There was a bit of a scam with the driver who wanted \"parking\" while we went inside to get the unit back when all he did was drive around the block. Obviously in three days we were unable to see all that Istanbul had to offer however, again the Guest Relations were extremely helpful and informative about things going on in Istanbul and what is a must see and do. In the end we were sad to be leaving Hotel Sultania and Istanbul, however knowing what we do now we will certainly be back and look forward to staying here again. This time we will eat at the Olive restaurant next door along with the New Hatenay, literally across the road. When we told our family about our trip I found that my brother is planning another trip to Istanbul and will be staying at the Sultania, again!", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois, United States", "Title": "“Great Stay!”", "Author": "Lee853", "ReviewID": "UR126459287", "Content": "everyone was very helpful. yummy brunch. location was amazing.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "lanarkshire", "Title": "“Perfection”", "Author": "tellyaddict", "ReviewID": "UR126448307", "Content": "Came in March 2012 to attend the World Indoor Championships. The hotel didn't disappoint in any way. We booked a transfer to the hotel - no problem, guy was there for us. Check in - no problem, we took a seat at reception while we were checked in. Luggage taken to room for us - nothing was a problem. The Turkish Delight on arrival in our rooms was a lovely touch. The rooms are gorgeous, spotless, and the beds are exceedingly comfortable. don't like the pillow? No problem - they have a pillow menu! For the next few days, anything we wanted booked, wanted advice about, wanted information on - everyone was there to help. All members of staff were invariably pleasant and helpful - something you don't get in chain hotels or indeed in most other countries i've been to. Staff at Sultania made you feel like you were the only guest in the hotel. Breakfast is lovely, great options. The spa is also highly recommended. I'm a massage addict and the massages I had were amazing. I'd go back to Istanbul for them alone! A lot of the major sights are within walking distance. The location is spot on. There are loads of restaurants in the vicinty, you'll be spoiled for choice. I don't think it is possible to get a duff meal in Istanbul, so anywhere you go will be fabulous. The Olive restaurant above the hotel is fantastic. There really are not enough adjectives in the dictionary to describe how fantastic Hotel Sultania is. I'm getting married later in the year and want to return to istanbul on my honeymoon - and I have no doubts about where I will stay.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Luxury in the heart of Old Istanbul”", "Author": "annapolisgal526", "ReviewID": "UR126322862", "Content": "My daughter and I stayed at Hotel Sultania for 7 nights in March, 2012. We found the hotel' location, staff, breakfast, and accommodations to be outstanding. From the front door of the hotel, the Spice Market is a 10 minute walk; the Hagia Sophia , Blue Mosque, and Topkapi Palace are a 5 minute walk; and the Grand Bazaar, Booksellers Market and Univeristy area are a 10 minute walk. The area felt extremely safe, even at night. The tram stops about 1 block from the hotel; my daughter and I used the tram to go to other areas of the city when we did not feel like walking any more. Hotel staff were courteous and most helpful with any request. Our room was on the small side, but adequate for two people with large suitcases. The decor added to the charm and ambiance of this hotel. Breakfast was sumptuous - the best hotel breakfast I've ever had, with a seemingly endless assortment of fresh fruit, vegetables, home-baked breads and pastries, eggs, meats, etc etc. All in all, it was a delightful place to stay, and we would definitely stay here again.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Great weeks break in Istanbul”", "Author": "Barbara N", "ReviewID": "UR126241481", "Content": "We stayed for 7nights after seeing the hotel on the web and loved the rooms and the location! On arrival we were not disappointed with either, the rooms were quirky, with them all being named after a different local character.My friend had her birthday while we were there and the hotel staff excelled in making her day special, with balloons and rose petals in the room and cake and candles in the restaurant. The staff made our stay very special, nothing was too much trouble. Loved the rooms. clean, tidy and very comfortable, great area to stay as access to all the popular tourist sites, Hagia Sophia, Topkapi Palace etc. We travelled around using taxis and the tramway, both were ease to access from the hotel. I would love to go back to Istanbul but only if we can stay in the Sultania.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Northern England", "Title": "“The Best.”", "Author": "Macandcath", "ReviewID": "UR126184198", "Content": "We made our first-ever visit to Istanbul for an off-season break, and booked the Sultania for 5 nights based on web reviews and a look at a map of the location. The hotel is really great. It is close to Hagia Sophia and Topkapi Palace; only 10 mins walk from Galata bridge and the ferries; and only about 10 minutes walk from the Grand Bazaar (if you don't get lost!). The nearest tram station is also only a couple of hundred metres. The hotel is supremely clean throughout. There are plenty of staff - all of whom were very friendly without being intrusive. They were also always willing to help with directions, tickets or information. Our room was very, very comfortable in every way, and with interesting and slightly quirky, decor. The extra little touches made a significant difference Check-in was a relaxed affair where one of the first questions was if we would like a drink (very welcome beer after a long day travelling). The day we checked in was my wife's birthday. We didn't mention this, but we'd been in the room about 10 minutes when a cake complete with candles was delivered to the room! Check-out included a conversation, a handshake, and a gift for my wife. The hotel has a pool, and a well-equipped gym. There are bathrobes and slippers in the room and towels with the pool attendant. Breakfast was good. Very, very good. Take your time! We've stayed in many hotels in many places. We decided we liked this one best of them all. Highly recommended.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Beautiful hotel * great location * friendly staff”", "Author": "Leokhan", "ReviewID": "UR126140802", "Content": "We stayed 3 nights at hotel Sultania & stayed in a double room with balcony, on the 5th floor. The room was gorgeous, very clean and each room had a theme and a story to tell. Breakfast was very complete, there was just about everything you can imagine. The hotel staff are happy to help you, polite, discreet & thoughtful, for example the morning of our departure we left very early, so they packed a breakfast picnic for us at 5am !, another evening we needed some information about the area & the receptionnist was more than happy to look on the internet with us and help us with our map, we also celebrated a birthday and they surprised us with a birthday cake. As for the area, perfect it's a 5 min walk from all of the big monuments Aya Sophya, Sultan Ahmet, Topkapi & 1 min away from the nearest tramway stop. We had a great time at hotel Sultania & thanks to them our stay in Istanbul was fanastic, HIGHLY RECOMMEND", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kiev, Ukraine", "Title": "“Excellent rest!”", "Author": "DmitriiKulikov", "ReviewID": "UR125977133", "Content": "When I flied to Istanbul our flight was late on an hour and a half. Whether have already started to worry the driver will wait us to bring to hotel. All doubts were vain. We were expected by the young man in a suit, has politely greeted and has conducted to the machine. As we with the girl flied to Istanbul in honor of March, 8th, I have asked in advance, that in number there was a bouquet of tulips and a champagne bottle! To happiness of my girl there was no limit - tasty champagne and an excellent bouquet. The hotel personnel has worked perfectly well! Numbers were cleaned every day, breakfasts were very tasty. There were only the most pleasant impressions of stay in this hotel! I recommend!", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Spring, Texas", "Title": "“Charming boutique hotel”", "Author": "Marie715298", "ReviewID": "UR125702018", "Content": "My husband and I stayed at the Hotel Sultania just overnight after a long cruise. We were very pleased . The staff was wonderful and efficient. Bed & linens were extremely comfortable and clean. It had a very unique shower door. We loved it! There are two restarants on the premises. We had lunch in the downstairs one and dinner on the rooftop. Lovely views from the top of hotel. I frankly enjoyed the downstairs restaurant more. It was very friendly. After waiting quite awhile for our steak sandwiches, we found out they had to go buy the meat. The sandwich was delicious. We laughed at this as it reminded us of an old movie. We got some DVDs from the lobby and settled in for the night. The electric went off and we started the movie again, after a little while the electric went off again. We just cracked up laughing and went to sleep. Breakfast was just downstairs and had a great variety of foods. I had rose jelly for the first time and I loved it. Walking outside was a little hard on the uneven cobblestones. There were no cars on our street. That was a pleasure. No stinky exhaust! The decor of the room is just what you see on the website. Very unique indeed. We loved it!", "Date": "March 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A++JUST PERFECT”", "Author": "Prodromos-Maria", "ReviewID": "UR125580195", "Content": "Second time in this hotel and sure i will be back third fourth etc Is a must stay hotel that you must visit All the people are wonderful and with a big smile!!!!!! Eylul and Boris are the new friends we make!!!!!! See you again", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wokingham, England, United Kingdom", "Title": "“One of the friendliest Hotels I have ever stayed in”", "Author": "Lori_83_12", "ReviewID": "UR125538847", "Content": "The Hotel Sultania is a terrific hotel. Upmarket but not ridicuously priced and the staff without exception cannot do enough for you. Their courtesy was apparent as we walked through the door ready to spend the last two nights of our big Turkey trip. It was also my 50th birthday during our stay and Eylui and all the restaurant staff were very helptul to my husband in organising some treats for me. The room was exquisite with lots of little Turkish detail and courtesy Turkish Delight! My husbabd took advantage of the Health & Wellbeing Centre and was delighted with his massage from Mustafah - perfect after 100s of miles driving around Turkey! The breakfast buffet includes everything you could want from traditional Turkish to European continental - you can even order your own bespoke omelette! In practical terms the location is perfect too. In the middle of some good restaurants but more importantly 5 minutes from the Topkapi Palace and 10 minutes from the Aya Sofia & Blue Mosque. We also walked over the bridge to the Galata Tower and Taksim Sq which only took us 30 minutes. I would have no hesitation in recommending this hotel for its facilities, decoration and hospitality. Thank you Sultania - a birthday never to forget!", "Date": "March 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "hampshire", "Title": "“Superb Hotel”", "Author": "HampshireKitty", "ReviewID": "UR125491541", "Content": "Can't praise this hotel highly enough, we were made to feel so welcome from the moment we stepped through the doors. Our room was stunning and very clean. All of the staff without exception were friendly and helpful. The location is perfect for all the tourist attractions.We ate a couple of times in the Cafe Bistro the service was excellent and good value for money, on our last night we went to the Olive Restaurant on the roof top which was throughly enjoyable with lovely views. Would recommend this hotel to anyone thinking of going to Istanbul. Hopefully we will return one day.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic staff, great location - cannot fault this hotel!”", "Author": "AnitaAmitaB", "ReviewID": "UR125408200", "Content": "My friend and I stayed at this hotel from 22nd-29th February and we had a marvellous time. The friendliness, attentiveness and professionalism of ALL of the staff really made our stay special but I would have to single out Eylul of Guest Relations (so friendly, fun and helpful) and Arafa (always polite, friendly and nothing was too much trouble) for special mentions. Why is the Sultania so special? The rooms are really pleasant and comfortable (note, I loved the bed so much I could barely get up in the mornings!!), the shower - excellent. The decor is opulent and the rooms spotless. Our request for an extra reading lamp and extra towels was attended to promptly. The breakfast buffet from 7am - 11am was varied, delicious and of high quality. The spa facilities were spotless and I thought the hamam was very good. The location of the hotel could not be better - it is in Sultanahmet next to the Haggia Sophia, Blue Mosque and Grand Bazaar - all within easy walking distance. The hotel is also vey close to the Gulhane tram station so it's also very convenient if you want to go further afield. On a personal note, my birthday was on 25th February and I was thrilled when the staff sang me happy birthday and presented me with a gorgeous cake in the morning. It made the day extra special and I can't thank the staff enough for the trouble they went to (Special thanks for the expert photographer on the staff who took and emailed me photos). Thank you to all at the Hotel Sultania!", "Date": "February 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St. Petersburg, Russia", "Title": "“Excellent choice for the first time”", "Author": "Natalia1150", "ReviewID": "UR125283888", "Content": "It was my first time in Istanbul and in Turkey in general and I didn't get dissapoint about this hotel. Staff is very friendly, professional, smiling all the time, polite and were always ready to make my accommodation even better. I was impressed with the breakfast, it was very variable: a lot of fresh fruits, pastries, big choice of hot drinks as well. I liked my room as well, especially when I could change the light to make my room more cozy. Room is fully equiped: tea/coffe facilities, mini-bar, iron and iron-desk in the room, bathrobes, cosmetics, a lot of towels. I will definitely recommend this hotel and stay there again during my next trip to Istanbul.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Loved it. This hotel is simply fantastic”", "Author": "CLHScott", "ReviewID": "UR125281161", "Content": "There is nothing negative I can say about this hotel. The staff are helpful, polite and professional; the rooms are gorgeous and plush; it's always spotlessly clean; and the breakfast, which is served for a full four hours each morning, is absolutely delicious. Lastly the location is ideal for daytime viewing of the main tourist attractions, most of which are in the same neighbourhood, and is also very handy for getting across the Galata Bridge and into Beyoglu, where you will probably want to spend your evenings. I was expecting a lot less but actually this place beat my expectations. My partner and I agreed that it my be our favourite ever hotel, and we have stayed in really quite a few. Loved this place and, when we go back to Istanbul, will definitely be rebooking the Sultania.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oostkamp", "Title": "“Could not be better!”", "Author": "Oostkamp-travellers", "ReviewID": "UR125218520", "Content": "Words are too short to describe this hotel! Located in a quiet area but very central. Just 2 minutes walk to the tram stop or 5 minutes to the Sirkeci train station. Sultanahmet is about 15 minutes walking. The Egyptian bazaar only 10 minutes, so everything is very close. The reception in the hotel is very cordial and friendly. Before you realize your luggage is already in your room. We had a family room and that was simply beautiful! The two adjacent rooms are very nicely decorated, very comfortable. The bathroom was very original (glass wall) Very pleasant was also the possibility to make tea or coffee in the room. Every day a little surprise: fresh Turkish sweets. About the breakfast there are nothing but good things to mention: extensive and very tasty! The pool is not big, but the water is hot! Also spotless clean. Decision: a super hotel where I'll be back and that is highly recommended!", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Greenville, South Carolina", "Title": "“Highly recommend!”", "Author": "Pat0808", "ReviewID": "UR125084852", "Content": "We stayed at the Sultania for 5 nights in February. Truly excellent hotel. The location was very convenient for seeing the sights of Istanbul. The room was clean, comfortable and delightfully decorated in the Turkish style. The breakfasts were more than ample and delicious. But best of all was the staff--incredibly hospitable, knowledgeable, and efficient. Staying at the Hotel Sultania was one of the highlights of our trip to Istanbul!", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Auckland", "Title": "“Fantastic!”", "Author": "AucklandBlue", "ReviewID": "UR124952334", "Content": "Stayed at this hotel for 4 nights in early December. The staff were friendly and very helpful. Room was good, decorated nicely and plenty of space. Very clean and had a modern feel. We wanted to take a cooking lesson so the staff arranged for us to use the kitchen upstairs at Olive restaurant. SPent a few horus creating soem authentic dishes which we then ate in the restaurant with the head chef. Nothing was a problem.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“A real gem in the heart of the old city”", "Author": "David C", "ReviewID": "UR124795286", "Content": "I cannot fault this hotel in any way given the location and value for money. All of the staff were so friendly and helpful from the moment we arrived through to our final departure. It is so refreshing to appreciate staff who have all been well trained to such a high standard and who obviously take such a pride in the service they provide for their guests. The free courtesy car laid on by the hotel that took us to the airport was a fitting end to this positive experience. I would highly recommend this hotel for people looking for a comfortable base in which to explore the old city particulary out of season. Our room was extremely comfortable, well designed with plenty of space to chill out after a day's exploring. Thank you for providing us with such a memorable introduction to Istanbul!", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Queensland, Australia", "Title": "“Fantastic Stay!”", "Author": "Pepi2010", "ReviewID": "UR124789705", "Content": "Stayed at the Hotel Sultania for 9 nights in January. The hotel is wonderful, exceptionally clean and the staff are extremely friendly and helpful. The hotel is well placed to see all the sights of Istanbul. You have a tram stop only a few hundred metres away or you could easily walk to some of the major sights such as Hagia Sophia, Blue Mosque or the Cistern (even when snowing!). The room was spotless, and extremely well maintained and very quiet. The buffet breakfast is excellent with a fantastic selection of both turkish and western cuisine. As it got dark early we also ate at the Hotel Bistro (which is also the breakfast room) and the quality of food and service was excellent (must try the turkish coffee or the turkish apple tea at breakfast). Hotel room service is food from the Bistro (just a smaller menu), however the food quality and serving size is just like the Bistro. Whilst I didn't try the Hamam, the massages on offer were excellent. The Hamam/Fitness area is also extremely well maintained and a lovely place to relax after a long day of sight seeing. Special mention must go to a few staff who made our stay very special - Baris (Bistro), Murat (Breakfast & Bistro), Irina (best massage ever) and Vedat (Lobby Cleaner). We would definitely stay at the Hotel Sultania again without hesitation and would highly recommend this hotel.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic, Fantastic, Fantastic”", "Author": "riky221", "ReviewID": "UR124679490", "Content": "What a gem! The hotel is so well situated. Any member of staff couldn't do enough to make our visit so perfect. Very easy to walk to many of the sites. I wouldn't hesitate to go back. Thank you..", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Perfect!”", "Author": "KarlosBoston", "ReviewID": "UR124536204", "Content": "The hotel is beautiful and the staff are incredibly helpful. Note: the Family Room only has one bathroom.", "Date": "February 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“A Little Oasis in Istanbul”", "Author": "ninawyo", "ReviewID": "UR124524950", "Content": "I stayed at the Hotel Sultania for 4 nights February 2012. Firstly, the location is excellent. You are so close to the Blue Mosque, the Tokapi Palace, Aya Sophia, etc. You can easily walk to many of these locations, or take a cheap taxi if you don't feel like walking. But besides the location, the hotel is lovely. Modern and funky, yet Turkish as well. My room was comfortable, and the small things like fresh Turkish delight left out every day, as well as lovely Turkish bathrobes was great. And I second what everyone else has said about the breakfasts! I always expect a little fruit, rolls, maybe some cheese. But they put out a spread! All sorts of cooked food, turkish tea or coffee, fresh orange juice, almost a dozen bread choices, yogurts, fresh fruits, honey off the comb, cheeses, olives...it goes on. The main thing about the hotel was it's staff. I arrived in Turkey with a cold, which unfortunately, turned into a chest infection. Everyone at the hotel knew I was sick, and they all tried to help. One made me warm milk and honey, another made me tea with fresh lemon, honey, mint, and lastly, a staff member made sure I got to the doctor. They were all concerned and lovely. I was traveling alone, so it felt good to know they were looking out for me. It is a lovely hotel, and I would stay again in a heartbeat. My one and only negative is that they don't have bathtubs. Fantastic showers with fancy showerheads, but no baths. I do love a bathtub! But I know there is a pool and sauna, so maybe that would make up for it Thanks Sultania for a caring, comfortable and lovely trip.", "Date": "February 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kyoto", "Title": "“Comfortable wonderland”", "Author": "Akiyoshi N", "ReviewID": "UR124389971", "Content": "I arrived at Istanbul by air early in the morning, but I could check into the hotel soon after arrival, 10:00. The room is exotically sophisticated and very clean with furnitures of Turkish taste and a comfortable bed. Breakfast including Turkish traditional coffee and tea is splendid like a jewelry box. And more importantly all the staff is so kind and friendly. They all made my feel at ease. I recommend this hotel to everyone who visit to Istanbul.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vienna, Austria", "Title": "“simply amazing!!!”", "Author": "M L", "ReviewID": "UR124316502", "Content": "we stayed at sultania 4 days in feb 2012! location is perfect, walking distance to bosporus, topkapi palace, hagia sophia and blue mosque, even grand bazaar is not far! the staff is very nice, really helpful! we would recommend sultania to anyone who is planning to go to istanbul! see you again :-)", "Date": "February 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Loved it”", "Author": "ShamimKarmali", "ReviewID": "UR124289659", "Content": "Excellent location. Would come back and stay here again. Excellent places to eat and very central location", "Date": "February 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "dublin", "Title": "“Wonderful quirky hotel”", "Author": "eidub", "ReviewID": "UR124272022", "Content": "We stayed in this hotel for two nights in January. The location is excellent and within walking distance to the Aya Sofia, Blue Mosque, Topkapi Palace etc. There are also lots of great restaurants in the vicinity, not to mention a good pub called the North Sheilds! We were given a warm friendly welcome by reception staff and offered some Turkish tea or coffee before being shown to our room. The rooms are lovely, each named for a different sultaniya, complete with painting of said lady on the wall and a scroll telling her story. Our room was nicely decorated with a very comfortable bed and large bathroom. The breakfast was excellent with a wide variety of foods to keep everyone happy. We had dinner one night in the Olive restaurant which is the rooftop restaurant from the sister hotel just next door. This restaurant has wonderful views of the Topkapi palace and blue mosque and the food was gorgeous. The decor in the restaurant was very bland and boring though and would benefit from a makeover. Two weeks later we found ourselves in Istanbul again for the night following a holiday in thailand. Due to bad weather in turkey we missed our connecting flight from Istanbul and rather than stay in accommodation provided by turkish airlines, we were delighted to take the opportunity to stay in the sultaniya again. We were warmly greeted as returning guests and were given an even nicer room this time. Room 1401! Has to be seen to be believed. It's lie something from 1001 nights complete with mirror on the ceiling. We loved it! We couldnt recommend this hotel highly enough.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Nice Hotel - Excellent Service”", "Author": "Joshuamony", "ReviewID": "UR124141101", "Content": "Stayed in this hotel in end Jan 2012 over the weekend for 3 days Was impressed with the warmth of the staff when checking in and their responsiveness and sincerity. Rooms were very nice, comfortable, clean and charming. The staff was very helpful in explaining to us where and how to get around including the cheaper ways of moving around. Breakfast was a nice spread and the service during breakfast was second to none. We purchased a tall lamp & the the shop we bought it from did not pack in a box. The conceirge and manager went out of their way to get it wrapped and packed so that we can check it in. And they did not even charge us for the packaging material that was purchased. A good test of a hotel and a stay if whether you will come back again and recommend to friends. Well definitely will stay here again and I have already recommended this hotel to friends planning a stay in Istanbul. My wife and I really liked our stay there despite the freezing snowy weather", "Date": "February 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great location, pleasant stay”", "Author": "Saglongfi", "ReviewID": "UR123870723", "Content": "Stayed here for birthday/anniversary. Nice welcome and gift in room. Free transfer from airport appreciated. Balcony room not fully appreciated due to snowy weather ( good to check forecast in future) but pleasant if a little small. The hotel is very clean and quiet, breakfast is good and staff good and in a great location for sites etc.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Awesome”", "Author": "Antje W", "ReviewID": "UR123818750", "Content": "Absolutely awesome. Perfect location only a couple of minutes walk from main historic attractions, great service, beautiful room, extensive breakfast buffet and free afternoon tea and cake. Beat my expectations even after having read previous reviews on Tripadvisor", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Just perfect”", "Author": "saskia34", "ReviewID": "UR123738650", "Content": "We really liked this hotel. Nice rooms, delicious breakfast, good spa and friendly staff. They even surprised my boyfriend for his birthday with a cake! Thank you hotel Sultania.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location”", "Author": "scott_harvey30", "ReviewID": "UR123729689", "Content": "Good value for money to stay here. The rooms are big and clean, bed is comfortable.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Excellent Hotel!”", "Author": "Nikcheh", "ReviewID": "UR123361341", "Content": "I found this hotel the very best among all the ones I stayed in Turkey. Excellent service, such clean well decorated rooms, great location, amazing breakfast buffet and great value for your money. You can't go wrong with this choice. I had the best time ever. And don't forget to go to their rooftop restaurant \"Olive\". It is very good.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Leuven, Belgium", "Title": "“Great stay”", "Author": "Jahoeman", "ReviewID": "UR123310049", "Content": "Really original, this hotel, strange but fascinating styling. Good choice.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Girona, Spain", "Title": "“Great Hotel for a special days in Istambul”", "Author": "David B", "ReviewID": "UR123193785", "Content": "We spend some days in Istambul in January. The weather was cold, but it was compensate for the warm hospitality of the Hotel Sultania staff. All of them are very kind and friendly. It's very well located (five minutes walking to the Ayasofya and Sultanahmed Camii). The installations and facilities are excellent and modern. Breakfast buffet assorted, abundant and delicious. All the information and pictures of it's web are absolute real. We do recommend the Sultania Hotel for couples who want spend some very special days in Istambul (as our case). We really appreciate the special details they do to us.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Best hotel”", "Author": "Khalilaleker", "ReviewID": "UR123158016", "Content": "My experience at this hotel was totally awesome. Firstly, my wife and I arrived way too early to check it. In fact 5am, and we were so tired they gave us a room to rest in at no cost! The staff were friendly, helpful and so kind. The food was divine, the location was perfect. 1-3 minutes away from Topkapi, Grand Bazaar, Spice Bazaar, Blue Mosque, Hagia Sofia, Mcdonalds, shops and the Metro. 1-3 minutes walk! Depending on how fast you walk. Breakfast was good. My wife enjoyed the Spa Treatment. Everything totally good value for money. Will definitely come back! Oh yes, they speak good English which I feel is very important.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "The Hague, The Netherlands", "Title": "“Great hotel”", "Author": "Nico B", "ReviewID": "UR123104526", "Content": "Beginning of January 2012 we stayed at Hotel Sultania. The hotel can be recognized by a very friendly staff and nice rooms (at least the one we had). We were well received on arrival. As well every other day the staff was friendly and helpfull. Breakfast was good in amount of choices and had a great view! In summer this hotel must be even better (although our stay in winter was very good as well) The room was clean, nicely decorated and had good features (DVD, Ipod music docing station, good TV, etc). The hotel is very good located. Close to the major attractions and close to the metro when you would like to explore other parts of Istanbul. We loved staying in this hotel.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Friendly ambitious charming Hotel”", "Author": "Swedish_Mark", "ReviewID": "UR123098407", "Content": "We had a great time and were amazed by the standard for the prize we paid! Real friendly and enthustiastic staff!", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Marseille, France", "Title": "“Don't go anywhere else!”", "Author": "KEITH TRAVEL AGENT", "ReviewID": "UR123097066", "Content": "We spent 4 nights here from the 10th of january. The location is amazing, very close to all the attractions. Topkapi is just 5 minutes walk and there is a tram stop 1 minute away!. The welcome was incredibly warm with no hassling or pushing for anything. The hotel is immaculate, and the room we had on the 5th floor was amazing. Very large room with everthing you need (beautiful flatscreen tv, I pod, CD recorder, beautifully diffused lighting, minibar and marble bathroom with Italien shower. The bed was comfortable and the linen very white! The satff were all helpful and friendly. The breakfast buffet was very complete too, with good coffee and real orange juice. Even the pool was warm, if a bit small, but the hotel is not very big so normal. All in all a great stay. Will definately recommend, and go directly there if I return to Istanbul.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Outstanding on all levels”", "Author": "Dubsy1212", "ReviewID": "UR122883057", "Content": "My wife and I just returned from a 13 day stay in Turkey -- about half of which was in Istanbul. For 5 nights prior to, and over New Years, we stayed at the Hotel Sultania. We were so impressed with the facilities and service, that after we had toured Cappadocia & Ephesus, we returned for two nights prior to our flight back to Toronto. The location is excellent. About a 10 minute walk to the Hagia Sofia, Blue Mosque, Basillica Cistern & Hippodrome. And a 15 minute walk in the other direction to the Galata bridge and Egyptian spice bizarre. It is located on a beautiful little cobblestone path away from the busy streets and is surrounded by outstanding little restaurants and patios. The service was also outstanding. From the moment we walked in --the assistance the staff gave with luggage, helping out with making reservations and suggesting things to do, to just generally being welcoming and concerned that you were enjoying your stay -- I cant say enough about the people working there. Relative to the facilities. The rooms are a good size (we stayed in a double deluxe), was very modern and clean and generally quite comfortable. There is free wireless internet (just get the username and password from the front desk), a nice pool/gym/sauna/spa area, a very nice breakfast buffet (complete with hot & cold options -- very nice perk), and a great restaurant on the 6th floor rooftop with a wonderful panoramic view of downtown istanbul. We had a fantastic stay, and would not hesitate to recommend this hotel to anyone.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Haarlem, The Netherlands", "Title": "“Wonderful stay @ Hotel Sultania”", "Author": "LauraLiza", "ReviewID": "UR122805798", "Content": "Our city trip to Istanbul was just amazing, also because of our stay at Hotel Sultania. On the 4th of January we arrived at the hotel, to stay there until the 9th of January. During our check-in we already got spoiled with Turkish tea and dried fruits, a good start! After dropping our luggage in the room (which looks just like the pictures on the hotel website), it was just a 5 minute walk to the Hagia Sophia, the 'Blue Mosque' and the Topkapi palace. At the end of a busy day in the city of Istanbul it's really relaxing to dive into the hotel pool (small, but sufficient)! And after having had a good night sleep, the next morning's breakfast helps to regain your energy. The breakfast buffet is diverse and offers all kinds of fresh fruits (try the pomegranate). Need some inspiration for sightseeing in Istanbul? Just ask the kind guest relations manager at the hotel lobby. Every day of our stay, she came up with really good ideas! Our stay at Hotel Sultania was just wonderful!", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stamford, UK", "Title": "“Lovely hotel with great service in an excellent location”", "Author": "CJStamfordUK", "ReviewID": "UR122751828", "Content": "I spent a week here with my partner over the New Year. The hotel was lovely with staff to match. The rooms were of ample size and were lovely and warm with great decoration. Everyday we were left a small present of Turkish Delight which was a nice touch. The breakfast buffet was top quality with a whole range of fresh bread, fruit and cheese to choose from. Staff were friendly and attentive. The Guest Relations member of staff was excellent and always on hand to answer any queries. The Health Spa with traditional Haman, sauna and swimming pool were a great addition to what is a fine hotel in the centre of the historic city. Well worth a visit.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Staffordshire", "Title": "“A Brilliant Place to Stay”", "Author": "paulo747", "ReviewID": "UR122659147", "Content": "If your criteria is location, location, location then the Hotel Sultania is the place to stay. Its excellent situation means you can easily walk to all the atractions of the ancient city by turning left outside the hotel or the waterfront by turning right. The city is intriguing and absorbing, so much to see, a fascinating experience. As for the Sultania itself it has a fabulously themed concept, the rooms are luxurious, possibly a little over the top but the atmosphere they conjur up works brilliantly, fantastic fun! We were a bit dissappointed by the shared top floor Olive restaurant, there are much better places to eat within a very short walk, in fact one of the best was a little place right opposite the hotel entrance. The hotel breakfast was very good though. The hotel staff were immensly friendly and efficient and provided outstanding levels of service. The hotel is located on a cobbled street with no vehicle access so is very quite. You need to just walk around the corner for taxis. We had a great stay and would not hesitate to recomend it.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "StipHout", "Title": "“Excellent, very charming hotel”", "Author": "MyHazel", "ReviewID": "UR122402307", "Content": "Excellent hotel nearby all the ancient attractions. Tram only three minutes walking. Very nice \"turkish\" room with all facilities. No sounds from neighbours or from the street or traffic. Perfect breakfast, perfect staff. Everything is clean and good kept. We stayed at new years eve and they made a wonderful party which we will not forget! Thank you, mister Sultania. Also the restaurant downstairs as well as the Olive restaurant has a very good kitchen. Fresh cooked food prepared with passion. Top hotel with personal attention!", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Best service on earth in an unbeatable location”", "Author": "Ianfi", "ReviewID": "UR122265722", "Content": "I don't like to be a high maintenance guest at a hotel, but my girlfriend and I placed a lot of demands on the Sultania staff during a recent 4 night stay there. Questions about tours, requests for directions, cabs, medicine when we got sick... I would have gotten annoyed with us. But the staff at Sultania could not have been more kind or welcoming. Whether it was the warm greeting upon check-in, the rose petals on the bed, the great advice, or the enthusiasm for us pillaging the scrumptious breakfast to feed the neighborhood cats, we have never had better service. The hotel's location is perfect: close to the tourist areas but a little quieter, near good restaurants, and peaceful at night. Although we initially found our room on the cozy side, we quickly appreciated the smart design and the incredible comfort it offered. Of particular note was the amazing shower and linens. As mentioned, the breakfast was phenomenal, and our room service dinners from the hotel restaurant downstairs were fantastic and very reasonably priced. The downstairs spa area and gym were also very nice, though there was a slight problem with the hot tub temperature when we visited. On the whole, though, Sultania eclipsed any hotel we've visited around the world, including five star stalwarts like the Four Seasons. We spent our final nights in Istanbul at a different hotel that also placed at the top of TA, and while it was serviceable, there was just no comparison. The Turkish standards of service are quite high, but the Sultania blows its competition away. It's the best of the best.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "North Myrtle Beach, South Carolina", "Title": "“They made my stay unforgettable!”", "Author": "mariaorohctga", "ReviewID": "UR122225925", "Content": "What else can I say about this hotel? A lot has been said already. But I'm glad I selected this hotel over Neorion, Amira, and Erboy. Here's why. 1) Exceptional Service: I was over there on the 25th. The hotel staffers went extra miles to make us feel a little Christmasy in a predominantly Muslim nation. Hotel guests were given complementary Christmas cookies (I found them on my bed in additional to a daily supply of Turkish delight) and tasteful music (flute?) was played at the lobby. When I needed a ride back to the Ataturk, a staffer ended up having to call a shuttle company many many times b/c the line was always busy. He did it for me without showing any irritation or frustration. 2) Location: As in real estate, location, location, location. I walked to most major spots by myself. (The only exception was a tram ride to Dolmabahche...I could have walked had it not rained.). Topkapi, Spice Bazaar, New Mosque, Blue Mosque, Sulaymaniye, Brand Bazaar, Archaeology museum, ferry docks, Galata... I was even shocked b/c they were actually closer than they looked on the map! 3) Safety: If you are a female solo traveler, your personal safety should be your priority. I never once felt unsafe or uneasy in the neighborhood. In fact, I walked alone around 10 p.m. well after the Turkish Dance Show was over at Hodjapasha Cultural Center (which was also in the neighborhood.). There aren't many annoying people asking you to buy something or asking you to come to their restaurants. It's totally different from the Sultanahmet area (esp. in front of the Blue Mosque/Aya Sofya area). In fact, I came to enjoy a mini-chat with a restaurant owner (across from the hotel and Pashazade) every day who jokingly deplored that I didn't want to eat in his restaurant. 4) Exotic decor: Where else but in Sultania could you enjoy being like a real Sultana? It will be a once in a lifetime experience. Then, why not take advantage of it and enjoy? Some may dread the neon light in bedrooms as shown in some pictures. But don't you worry. Unless you do, they won't turn on automatically. I came to like it, though. 5) Breakfast: I have never eaten better than I was at Sultania. Every morning I woke up and I was like \"What will I get to eat today?\" Plenty of fruits, Turkish bagels (my new found love!), pastries, eggs in different styles, fresh juice, tea, coffee, cold/hot meats, veges. Oh my Gosh...I really miss their breakfast. They serve breakfast until 11 a.m. so don't worry about having to get up so early on your vacation. 6) Windows: Huh? Why might a hotel guest complement windows? Well, I love to hear a call to prayer but not necessarily so early in the morning. Once I shut the windows, I never heard any street noise....even though a restaurant in front of my room was open till late. In any case, seeing is believing. I'd go back to Sultania in a heartbeat. Oh well, I need to save money first!", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vienna, Austria", "Title": "“Best service”", "Author": "mlddrss", "ReviewID": "UR122186447", "Content": "A lot has been said about Hotel Sultania in reviews already. I just want to add that the best feature of this hotel is the exceptional service attitude of everybody there. Staff goes of their way to be helpful. Just one example - we forgot our bathing suits in the hotel room when leaving. Not only are they maling them to us, they refused to get paid for it. The Hotel is in walking distance to a lot of historic sites in Old Town, which make it an excellent base if you are interested in that. The ferries are also just a few minutes wall away as are Metro and tram stations. Taxis are quite cheap, but we made the experience that taxi drivers tend to cheat. One trick that worked on my wife two times, until she realized the third time what is going on, is - you give a 50 Lira note to the taxi driver who quickly changes it to a 5 Lira note and then claims that you have given him only 5.", "Date": "December 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington, Pennsylvania", "Title": "“Excellent choice and value for a stay in Ä°stanbul”", "Author": "dcruze", "ReviewID": "UR122170256", "Content": "I stayed in this hotel for two night.Amazing rooms. Great value for money. Very nice and helpful staff. Excellent location.", "Date": "December 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stockholm", "Title": "“Warm welcome”", "Author": "Tranis", "ReviewID": "UR121650445", "Content": "We stayed three nights at this hotel. Nice, stylish rooms and great breakfast with many local specialities.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Adelaide", "Title": "“Extremely comfortable”", "Author": "john_tillett", "ReviewID": "UR121617717", "Content": "Hotel Sultania is an excellent choice in Istanbul. The rooms are small but comfortable. Our twin room had two single beds, and a day bed. The room was large enough to accommodate our two large bags, just. The bathroom is essentially a walled off â€œpodâ€� in the room, and perfectly adequate. The breakfast was the best of our time in turkey. It was extremely fresh, and of a high quality. The swimming pool was larger than we expected, and warm. It did get busy in the early evening, given that it is shared with the adjoining hotel. Of special mention, the hotelâ€™s concierge is fantastic. She is there everday, and gave us excellent recommendations for our itinerary, and was helpful with booking restaurants. At check-in, the receptionist was unaware of a special offer on the website, and was fairly abrupt in his manner. However, other receptionists were excellent, and the included transfer, and free fourth night were provided.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“i am impressed”", "Author": "BenjaminCosta", "ReviewID": "UR121607296", "Content": "Being a frequent traveller,and being seen quite few places, it was hard not to be mesmerized by Sultania. At the centre of the magnificient Istanbul, where you exactly want to be, just a walk away from the top historic/cultural attractions of the city.location couldn` be better. Plus, as a niche boutique hotel, Sultania makes you feel the city in a different way which is very unique and elegant.Room is exactly what it looks like from the pictures.The welcome compliment as you go up to your room was very nice also. Sometimes the problem with the design boutique hotels is that they have the design but service is average but Sultania proved this wrong again, i experienced an outstanding service. The quality of sleep was great, breakfast was very satisfying and consisted of very well selected products and offered anything or more than you would want. And staff, they are very motivated to help you in whatever issue and keep you safe.You can feel they are trying to keep you satisfied every single minute which is comforting you. Also,on my last day i spared my time and tried out the spa in the hotel, you won`t be dissappointed. For night, having the dinner accompanied with a spectacular view of the city is a good choice. I will never think of staying somewhere else, this hotel is sure to give you the classy vibe during your stay in Istanbul.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Nice place for a short stay in Istanbul as tourists also for families”", "Author": "Tripvictim", "ReviewID": "UR121585649", "Content": "The hotel is comfortable, clean. The service people are kind especially the guest relations manager. The position in very central in Sultanhamet and close to main attractions as blue moskee, Hagia Sofia, cistern, spice market and so on. Rooms are clean and not quite personalized in turkish style. Good breakfast. There is also Restaurant and spa but we didn't try.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“No point in looking any further: chose to be a Sultan at Sultania!”", "Author": "Alexutz_m", "ReviewID": "UR121424926", "Content": "We just came back from our Istanbul break and everything was great. Do you want to feel as a sultan? Hotel Sultania goes above and beyond, redefying the concept of hospitality and confort. The experience starts with a nice ride from the airport to the hotel where you get a warm welcome from the Guest Manager together with Turkish coffee and Turkish delight (yes, all the hotels should have one though even if they do, it's pretty difficult to find somebody who does her job as good as this lady!). You are taken to your room and everything is explained, from the specific of your room to how to get to the SPA or how to use the DVD player. The room itself its beautiful, cosy and functional; the matress is really good and there's also a pillow menu. In the lobby there's always somebody to help you and always with a smile including the late shift receptionist ready to tell you some Istanbul stories or hot spots! The breakfast offers a wide variety and if you ask for something different, they'll prepare it immediately and you won't be disappointed. We've been to the SPA a couple of times. The gym and the pool are small but good enough. You HAVE to try the foam massage! The lady masseur does a wonderful job and she will really take care of you according to your body needs/ stress level. We also received a fruit and wine hamper for our last evening and before leaving I received another small personalized gift. The Olive Restaurant was nice but the food...normal. The view is great and probably during the summer it gets much better! The hotel is close to all the important spots and it's not a dangerous area. We've been on the other side of the Golden Horn and also to the Asian side. If you go, try their local places, you'll eat things not comparable to those from the \"new\" and cosmopolitan districts: we had a wonderful lamachun and also some kind of fish sandwich sitting in small Turkish places. What else? They've arranged a great staying for us at a reasonable price without hassle and problems. If you go to Istanbul, this is definitely the place to stay! Highly recommended!", "Date": "December 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hamilton, Canada", "Title": "“Perfect stay in Ä°stanbul”", "Author": "joluii", "ReviewID": "UR121344844", "Content": "Great hotel, convenient location, excellent restaurants, friendly and professional staff. Highly recommended!", "Date": "December 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chattanooga, TN", "Title": "“Great Staff, Great Location, Great Stay”", "Author": "jwave45", "ReviewID": "UR121239431", "Content": "Our stay at the Hotel Sultania was wonderful. The staff make this lovely hotel extra special. Always friendly and helpful, they made our time in Istanbul special. Esp. arranging transportation (complimentary) for our 6am flight. A live person gave us a 3 am wake up call brought coffee up to my husband (again 3 am) and when we made it downstairs, there were 3 staff members ready to help, all smiling and friendly. Our room was beautiful (top floor with balcony) and HUGE. The bathroom is very large with a jetted tub and a rainfall shower (not separate). The balcony wrapped around a corner of the building and while the view is somewhat obstructed by other buildings it is nice. I relaxed with a book there a couple of times. Breakfast was plentiful and delicious with many American favorites but lots of Turkish items too. The coffee is VERY strong. I had tea. My husband LOVED the coffee. The food items were delicious. The location is VERY close to the Blue Mosque, Hagia Sofia, Grand Bazaar and Topaki Palace. We even walked to the Spice Market, which is not as close. There are many small restaurants in the little side street the hotel is on (if you arrive by cab tell him it is on a side street..a no car side street). We particularly enjoyed eating dinners there.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“A really nice hotel!”", "Author": "Leona326", "ReviewID": "UR121159274", "Content": "It's a really nice hotel with a perfect location. Grand bazaar, Blue mosque, Hagia Sofia are just a walking distance away and the tram stop is literally around the corner. Our room was large and with a nice \"oriental\" touch, however there was no view. The breakfast from 7 till 11, so a plenty of time to enjoy the selection of western and Turkish delights. The restaurant Olive on the sixth floor had good food and amazing view over the city. The spa was small, but good. Massage from the lady masseur was strong, extremely strong, but my backpain is gone :-) She, as the rest of the staff, were very friendly.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Lovely welcoming hotel. First class service”", "Author": "Laheg", "ReviewID": "UR121043185", "Content": "Location was perfect for sightseeing and frequent trips to the Grand Bazaar. Staff were excellent - friendly and helpful at all times. There was a mix up over our hammam and massage but this was handled brilliantly. Really good breakfasts too.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "St Catharines", "Title": "“Beautiful”", "Author": "lian28", "ReviewID": "UR120923348", "Content": "Great location for everything, about 10 minute walk to the Blue Mosque, the Bazaar and spice market, loved the atmosphere the people and Istanbul we stayed only three nights wish it could have been longer. The hotel was lovely smallish room extremely clean we enjoyed our stay there", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Great location, exceptional service”", "Author": "xinco", "ReviewID": "UR120788054", "Content": "Perfect for someone looking for a great Istanbul old town location. Rooms are comfortable and very clean. The service was exceptional, breakfast buffet was great with lots of options. Highly recommended!", "Date": "November 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Aspen, Colorado", "Title": "“A perfect choice”", "Author": "TravelGirl2006", "ReviewID": "UR120763053", "Content": "Loved this hotel! It was perfect for someone looking for a great neighborhood and really comfortable rooms. The small touches such as naming the rooms and the amenities on the beds add to the experience. The neighborhood is a bit touristy (right near Topkapi palace) but that was fine with me because there were numerous dining options all around the hotel. The beds are comfortable and rooms are very clean. The service was exceptional, especially my driver from the airport who waited even though my flight was late and immigration took forever. The breakfast buffet was lovely with lots of options as well. Highly recommend this hotel!", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "venice", "Title": "“thanks sultania's staff!!”", "Author": "lelon", "ReviewID": "UR120663180", "Content": "Wonderful hotel,clean,comfortable and great location. Helpfull and professional staff,good quality of breakfast and great dinner at Olive Restaurant. We had room # 1205,nice shower,ipod dock station,lcd tv and complimentary basket of fruit and cake on arrival. I think that there's nothing to change,congratulations!! and see you very soon!", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Ten Days in Istanbul”", "Author": "etse w", "ReviewID": "UR120627026", "Content": "My friend and I were very impressed with the service we received in Hotel Sultania. The facilities were quite good and most of all the staff members were just superb - polite, helpful, jovial, friendly, examples of Turkish hospitality! The rooms were lovely decorated in a more traditional style giving you the feeling that you are in the middle of the long Turkish historical traditions; the rooms were cleaned properly and if as a customer you asked for further dusting or vaccuum cleaning, the staff obliged - the cleaners did not disturb you if you did not wish to leave the room for a few hours but were accessible to respond to your needs. The breakfast is generous and delicious - it gave you choices. Hotel Sultania is located close to the sea, museums, places to visit, shopping bazaars all walking distance from it!", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Location, Service, Beauty and comfort.”", "Author": "MorganClub", "ReviewID": "UR120507036", "Content": "The hotel is beautiful, the front desk services is excelent and the rooms are profesionaly decorated. The restaurants with a walking distance are amazing, the free breakfast buffet on the terrace has a diferent main course every morning, the wait staff is frindly and warm. The location is one of the best locations in town, within a walking distance from the blue mosque and the Sofia, the metro system is a block away, if you feel like walking by the water is just a couple blocks away. The location is safe and the price is just right.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“5 star hotel at 3 star price”", "Author": "Heidi S", "ReviewID": "UR120338234", "Content": "Perfect locatoin in quiet street with plenty charming restaurants - walk to all the sights. Rooms are tastefully decorated, comfortable and clean. Friendly staff, great breakfast and charming spa area.Very reasonable rates and complimentary airport transfer in very luxurious and spacious minivan. Calculate the cost of transfer and realize this is a BARGAIN! You cannot go wrong with this one - but book early, word is out....!", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denmark", "Title": "“Live like a Sultan (almost)”", "Author": "ulpa_10", "ReviewID": "UR120076095", "Content": "This was our first visit to Istanbul and we could not find a better place to stay than Sultania. When we are abroad we like to have space around us, so we settled for a Sultania de luxe room which showed out to be huge and actually as big as a suite. Well, the price was not low but we were staying in Istanbul a whole week so our hotel room was momentarily our home. After a long sight seeing day it is wonderful to relaxe in a spacious room. The position of Hotel Sultania is as good as the room: you are not only extremely close to all the famous attractions of Istanbul (Topkapi, Aya Sofia, The blue Mosque, The gran Bazar etc.), you are also very close to the bridge over The golden Horn and thereby the access to the many boats going up the Bosporus. And furthermore close to the real life of the Istanbulies who are swarming around the area in the afternoon and that's what we really like: to mingle with the locals and get a glimpse of the life behind the glamorous facade of a city or a country (within limits of course). The hotel staff were attentive, skilled and extremely serviceminded. The nice lady in charge of guest relations was specially helpful, she was there with the purpose of giving the guests good advices about Istanbul, which is a rare function in a hotel. The breakfast was abundant and also the restaurant Olive on the roof top was good. All together and following many of the other reviews: a great hotel in a wonderful city.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Luton", "Title": "“Best hotel in turkey”", "Author": "HassanTeetoo", "ReviewID": "UR119985742", "Content": "I'm not kidding. Fantastic if your up for romance. Good breakfast. Happy well fed staff", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Great Hotel, Great Location....a winner!”", "Author": "VonKrieger", "ReviewID": "UR119913057", "Content": "My wife and I stayed at the Sultana in the fall of 2011. To cut to the chase, we loved it. The room was well sized, clean, interesting and had an ethnic flair, which we enjoyed. The staff was great (don't miss the Turkish bath offered by the hotel), and without exception they were very helpful. The complimentary breakfast provided enough food to keep one going all day, the quality was great and the selection varied. Moreover, the location is perfect, as it is within walking distance to many of the must-see sights in Istanbul. Noto Bene: the neighborhood is a little confusing, so be sure to drop bread crumbs when you leave the hotel. However on the plus side, I felt it was a very safe area. I would stay there again without a second thought.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chatham, United Kingdom", "Title": "“Turkish delight”", "Author": "arm673", "ReviewID": "UR119906793", "Content": "The hotel was difficult to find for the taxi as it is new and on a pedestrian only walkway. Beautiful boutique hotel on a great pedestrian walkway full of restaurants and shops. helpful and knowledgeable staff and a restaurant overlooking the city. Funky decor in the room ours having mirrors on the ceiling a free form sink and a jacuzzi in the bathroom. However we felt it was overpriced and managed a little clinical and efficient rather than warmth.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South Australia", "Title": "“Perfect hotel for your Istanbul stay”", "Author": "vjw011", "ReviewID": "UR119804656", "Content": "From the moment we arrived at the Sultania, we were impressed with it. The staff were very welcoming and the rooms easily ranked four star. Our beds were very comfortable and each day the lovely Bergul (our room/floor attendant) aranged different and gorgeous origami-type folding of our bed cover. We even arrived back one day to find she'd arranged our Turkish scarves in this way at the foot of our bed. The litle touches like this made us love the Sultania even more. The location of the Sultania is perfect. It's about a 10 minute walk to the all-important bazaar, and close to many of Istanbul's other attractions. We easily walked everywhere. Our room: There was plenty of room to move around. Each room has everything you'd expect from a four star hotel. A few people here have commented that the bathroom set up is not ideal for friends who are sharing but we didn't find it a problem. You can only see shapes through the decorated glass and that's only if you try hard to see. We were on the fourth floor next to the lifts and there was no night noise to disturb our sleep. Bedding was warm and snuggly, pillows were comfortable, and everything worked as it should. The free wi-fi was excellent. We ate breakfast in the hotel's dining room each morning - it was included in our price. The food was good and the variety was lareg enough to keep most people satisfied. The little pancakes with raspberry sauce were my favourite. I highly recommend the Sultania to those planning a stay in Istanbul.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "", "Title": "“Sultania”", "Author": "Ed_Mississauga", "ReviewID": "UR119786884", "Content": "Stayed in the hotel for 4 days from Oct.21-25. Nice location. All attractions in the old city are within walking distance. Tons of restaurants around the hotel. The guest relation lady is the best we ever met; she is experienced, very helpful, sensitive and knowledgeable. If you need any info on what to do, just ask her, she will take the time to explain to you what you should do. She is definitely the big plus for the hotel. Other services and breakfast are average, compared to the other hotel (Conrad Instanbul) we stayed before Oct. 21. Bathroom area is small and the room we stayed have water coming out during showering. We asked the hotel to fix it but with no luck. There is no AC (is off for the season I believe) and we need to open the window to cool the room. Taxis cannot reach the hotel directly, one has to carry the lungaage down a small road, may not be a good choice if you cannot carry the lunguage on you own. Also the taxi driver has a hard time finding the hotel.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“A real jem”", "Author": "leftygolfer0", "ReviewID": "UR119772940", "Content": "We booked this on a recommendation from our travel agent and did not disappoint. Location, rooms, and staff are very good. Would stay again.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Ideal hotel for a week's holiday in Istanbul”", "Author": "mikethevet", "ReviewID": "UR119636085", "Content": "Situation excellent, very close to the Big 3 - Topkapi Palace, Blue Mosque and Hagia Sofia. Front desk staff all helpful, resolving a problem we had with our transfer company, recommending local travel arrangements, and booking restaurants for us.. Room very good, in very romantic Sultan style, with good facilities, a very comfortable bed with choice of pillows, and daily maid service. Restaurant, we only used it for breakfast but fou d a good selection of foods, including many local delicacies and lashings of Turkish tea. We would recommend the hotel and would happily return", "Date": "October 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“Amazing stay!”", "Author": "Stillwater20", "ReviewID": "UR119505395", "Content": "We stayed at Hotel Sultania in the first week of October, 2011. The hotel had come recommended from our local travel agent who knows us well and as usual, she was spot on! Its a stylish hotel with lovely rooms in a quiet side road in the old town. The hotel is brilliantly situated bieng within walking distance of Topkapi Palace, Hagia Sophia, the Blue Mosque, a Bosphorous trip and both the Grand Bazaar and teh Spice Bazaar. What places this hotel ina league of its own is the staff - they are all extremely helpful, efficient, friendly and nothing is too much trouble! The Hotel is a great base to explore the city and I would highly recommend a stay here. You must try the Spa and the hammam experience - superb! Thanks for a fabulous time in your beautiful city.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oernes", "Title": "“BRAVISSIMO”", "Author": "Magnus V", "ReviewID": "UR119490628", "Content": "We stayed at the hotel 9th-16th of Oct. Just perfect everything. Very easy to recommend the hotel to friends and for sure the hotel will be the first priority next time we visit Istanbul. From a couple living above the Artic Circle in Norway", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southport, United Kingdom", "Title": "“perfect turkish gem *****”", "Author": "travelerman32", "ReviewID": "UR119299802", "Content": "this i a beautiful place to stay ,our room was just perfect,and cleaned everyday,the staff were fantastic ,very helpful and happy, anything no problem, the restaurant was top class with fabulous views at night ,when istanbul lights up. the hotel is a great base to explore istanbul, with only minutes walk to the grand bizzare, wow. it's so romantic ,a must for couples. also loved the spa ,at the hotel just great, we will be back, thanks to you all for a great break.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boulder, Colorado", "Title": "“Wow!”", "Author": "Justin R", "ReviewID": "UR119281132", "Content": "This is a stylish hotel with all modern amenities in a great location (lots of restaurants and walking distance to the main sights). The old town is definitely the best place to stay, lots of life and things to visit on foot, but not as crazy as around Taksim at night. We all loved the decor and the staff made us feel super special. We got an amazing deal (4 nights for the price of 3) which made this great value for such a cool boutique hotel and top-notch accommodation. The bathroom design doesn't give much privacy, but luckily that didn't bother us once we got used to it. Stylish and special, we will definitely be back!", "Date": "October 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“great value central location”", "Author": "romabene", "ReviewID": "UR119044198", "Content": "Just came back from a 5 night stay in this hotel. When we arrived ,4 women sharing 2 rooms , one room had a double bed instead of twins but they put an single bed in for us immediately and the room was still quite spacious . They also gave us a free bottle of Champagne and a free transfer back to the airport because of the inconvenience. Breakfast was good but would have liked to have a bigger selection of prepared fruit eg papaya and bananas and also croissants which I love but there was a good selection of other breads and pastries . The service was great and all the staff very friendly. Rooms were good but bathroom setup not really suitable of women sharing as sink was in the bedroom and there was no privacy in the bathroom due to design. had a Turkish bath and massage and it was well worth the money. All in all I would go back to this hotel and recommend it to my friends.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Great all around”", "Author": "HappySwan", "ReviewID": "UR119001899", "Content": "Love being in the old town, the staff was very nice, the room brand new and great value for money. The breakfast selection lovely with freshly squeezed OJ & real honeycomb. The rooftop restaurant at the sister hotel next door has fab view of one of the mosques.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“1 of the best hotels in the country”", "Author": "nicole295", "ReviewID": "UR118988397", "Content": "This is a great place to stay in Istanbul. very convenient location, excellent staff. clean and comfortable rooms, excellent breakfast. I am very happy for such small money it was great.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“A lovely stay in Istanbul”", "Author": "leslee60", "ReviewID": "UR118978812", "Content": "What stands out most about the Sultania is the service. The staff is excellent and eager to please. The concierge, Sibel, gave us excellent suggestions on restaurants and other attractions in the old sections and other areas as well. A special treat, not to be missed is the Hamman. I loved it.", "Date": "October 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Amazing location, nice rooms, friendly staff, right price.”", "Author": "TomD65", "ReviewID": "UR118906582", "Content": "We stayed for three nights in September. The location is fantastic and within minutes you can walk to major historical attractions. A bit further but still walkable to the spice and grand bazars. Rooms a very clean and comfy, and the service outstanding. The little street that the hotel faces is great wandering out for late dinner or drink. I highly recommend the hotel.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“An outstanding Hotel in which to enrich your visit to Instanbul”", "Author": "Linda W", "ReviewID": "UR118877260", "Content": "The beautiful Sultania hotel and the fantastic service by the whole team (to name a few: Huseyin, Mesut, Kahraman, Sibel and Erdem) made our visit to Instanbul one of the best memories one could have. The advice and willingness to help at any time of the day was exemplary. The buffet breakfast was one of the best we had experienced in our seven week European vacation, from freshly squeezed orange juice to how to make real turkish coffee whilst enjoying your breakfast. We stayed in a balcony room with a modern marble bathroom. The room was spacious and well decortated in a Turkish theme. We felt like Sultans and will book the Sultania without hestitation the next time we visit Turkey.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Burlington, Canada", "Title": "“Great Hotel,Great location”", "Author": "Marby1", "ReviewID": "UR118868700", "Content": "We had an oportunity to stay at Hotel Sultania for 1 night, prior to a Med. cruise. Even though it was just one night, the hotel did send a driver to pick us up at the airport. Our flight arrived at 10:15am, we got to the hotel by 11:30am. We were greated with a warm welcome. As we checked in, they brought us a beverage and cookies. They appoligized for not having the room ready, but said that it should be ready in 20 minutes. As promised, the room was ready within 20 minutes. Our room was lovely. We requested a room with a balcony, which was located on the top floor. The following morning we stepped out on the balcony and saw our cruiseship! The hotel is very well located, walking distance to all the important sights. The street is lined with great resturants and shops. We couldn't ask for more!", "Date": "October 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Location": "5"}, "AuthorLocation": "Wokingham, United Kingdom", "Title": "“Beautiful hotel and amazing location!”", "Author": "G0Lightly_2011", "ReviewID": "UR118855845", "Content": "This was my first trip to Istanbul and was impressed with the other reviews on Tripadvisor. The hotel is set in a perfect location - easy walking distance to the main tourist sites - Blue Mosque, Palace to name a few. The hotel is small and the staff really helpful. The rooms are decorated in Ottoman style and equipped with all mod cons. The breakfast is really good and the swimming pool is nice. Slightly annoyed at having to pay 10 Euros to use the sauna when staying at the hotel. Fully recommended!", "Date": "October 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Excellent First Experience”", "Author": "RobCarolyn", "ReviewID": "UR118714248", "Content": "This was our first trip to Turkey and this boutique hotel was recommended by our travel agent and turned out to be everything that we had hoped for. A lovely hotel right in the middle of everything - 10 minutes walk to Grand Bazar, Spice Markets, more mosques than you know what to do with and the main shipping tourist port for Instanbul plus so much more. Also very close to the tram line which provides very good transport options. The room was huge and very up to date and in excellent condition with well stocked mini bar, large wall mounted TV and serviced to the highest standard each day. Although being in the thick of things the room was very quiet at night, curtains provided absolute darkeness and air conditioning worked extremely well. Bathroom was good size and water pressure very good (one of my bug-bears in many other places!) The front desk staff always went out of their way to be helpful and accomodating with information of local tourist spots, tips on money access through ATMs and following up on booking details for us quickly, efficiently and in a helpful and friendly way. Utilised the in-house restaurent for breakfast and dinner and the food and service was excellent. Food very fresh and breakfast buffet provided a huge range of choices. All the staff were friendly and polite and appeared genuinely pleased to have us staying with them. We would highly recommend this hotel to anyone travelling to Instanbul, Turkey and also Turkey in general", "Date": "September 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Great little boutique hotel near Sultanahmet”", "Author": "CatalinaCorbeanu_11", "ReviewID": "UR118645809", "Content": "Hotel Sultania surprised us in a very pleasant way, although our expectations were quite high, considering the TA reviews. Location: Perfectly located, on a small street (which offers you quiet during the night & day), just 3-5 minutes from Topkapi Palace and a 7 - 10 minutes walk to Blue Mosque and Aya Sofia. Service: the staff was very friendly and helpful, especially the concierge, who gladly helped us with money exchange, directions and even dinner reservations. Cleanliness: rooms and common areas are perfectly clean and well maintained. Rooms: some are very small (like ours), some are quite large and spacious (we saw some of them while they were cleaned), but what makes the hotel unique is the turkish style of decorations - not in bad taste, but with a traditional twist to all the furniture and ambiance. Breakfast: quite a large selection of food (different cereals, milk, yoghurt, hams, cheese, jams, eggs, sausages, vegetables au gratin, turkish tchai (tea), coffee, fresh juice (you have to squeeze the oranges yourself!), olives, tomatoes, cucumbers etc) + a large selection of deserts. Distance to Ataturk airport: 20-30 min taxi ride from the airport. Truly recommend the hotel...it offers you the home away from home! PS: as far as visiting, do not miss a trip to Buyukada (Prince's Islands) - especially the carriage (fayton) rides! + climbing into the Galata tower - it offers a spectacular view! Enjoy Istanbul! Catalina", "Date": "September 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vinhedo, SP", "Title": "“Excellent Cost X Benefits”", "Author": "Kaschu_BR", "ReviewID": "UR118617630", "Content": "The Hotel Sultania is located in the heart of Sultanahmet neigborhood. Within a short walk distance you are able to reach any of the most important touristic attractions from the old town. It is very easy as well to reach Grand Bazaar and the Egyptian Bazaar - excellent for shopping. The hotel is very confortable, although the decoration is a bit overwhelming. The room has all amenities you may wish for, and it is extremely clean. The breakfast is rich and delicious. One positive point is the Olive restaurant at the rooftop - you will be able to get a delicious turkish meal with a marvelous view of the Bosphorus and Hagia Sophia.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, Ontario", "Title": "“Great location and service”", "Author": "BOLondon_Ontario", "ReviewID": "UR118550065", "Content": "We stayed for 3 nights and loved Istanbul. There was so much to see and do. The hotel was clean, and in good condition. The staff were friendly and the front desk helped us out with every question. We had a private walking tour which was worth it. We also did an eating tour of a section of Istanbul which was unique and excellent. The grand bazaar was worth seeing. We spent a few hours there and that was good enough. We walked the tarlabasi street at night and ate at a small street off tarlabasi which was a lot of fun.", "Date": "September 25, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Radlett, United Kingdom", "Title": "“An excellent boutique hotel”", "Author": "Malcolm B", "ReviewID": "UR118142534", "Content": "From beginning to end, our 5-night stay at this hotel was wonderful. We were picked up at the airport, greeted at the hotel with Turkish coffee and various nibbles, discovered complimentary fresh fruit and wine in our spacious and delightful room, and were treated to two meals in the hotel restaurant together with complimentary afternoon tea/coffee. Also included in our package were two tours. The central location of the hotel meant we could walk everywhere we wanted to visit. All of the staff were extremely friendly and helpful, and we were very sad when we were taken back to the airport. However, we shall certainly return.", "Date": "September 15, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Great hotel in great location”", "Author": "Jackson1374", "ReviewID": "UR118100489", "Content": "Just got back from a fantastic trip to Turkey (Sept 2011). While in Istanbul we stayed at the Hotel Sultania, a smart hotel near many of the tourist attractions. The rooms were sparkling clean, the staff were helpful and attentive, the location was excellent and the breakfast was delicious and filling. Most staff understood English (a little or a lot, depending) which was helpful for me since I did not have much of a command of the Turkish language. You can even try on reproductions of Sultan era clothing for some special pictures if you want to amuse yourself and your friends back home. I would highly recommend this hotel to others as a great place to stay in vibrant Istanbul!", "Date": "September 14, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Excellent hotel”", "Author": "Anne172", "ReviewID": "UR118033417", "Content": "I chose this hotel because of the brilliant reviews it had received and I was not disappointed! This is an excellent hotel in a great location in the old city and is only a minutes walk from Gulhane tram stop and 5 minutes walk to Topkapi Palace, Hagia Sofia and the Blue Mosque. The rooms are beautifully designed and decorated in Ottoman fashion. The beds were extremely comfortable. Every day complimentary Turkish delights and water are left in your room. The hotel is cleaned to a very high standard and the breakfast buffet has a wide range of cold and hot food. The best thing about the hotel, however, is the wonderful staff. They are so welcoming, friendly and attentive. Requests are dealt with speedily and nothing is too much trouble. Ozlem, guest Relations, was available every day to help with any query and with general advice or directions. She asks every day if everything is OK and if anything more can be done to make your stay better! My sons and I stayed for eight nights and one of the main reasons we had such a great holiday was because we loved the hotel so much. There was tea and coffee making facilities, a mini-bar, free wi-fi in the rooms, a dvd player, an Ipod docking station and the TV had several English channels. It was great to get back to the luxury of the rooms and the pool, turkish bath and sauna after a busy day of sightseeing.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Canada", "Title": "“Great service and accomodations”", "Author": "Sylvikins", "ReviewID": "UR117981175", "Content": "The family room was great for a family of 4. Hotel's location was excellent and allowed us to walk to everything. The restaurant was great (dinners and breakfast buffet - the children loved the mezze). Would definitely stay here again as the excellent service the staff provided was what made this hotel stand out. Kids very much enjoyed the pool at the end of the day (even if it was very small).", "Date": "September 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Lovely boutique hotel”", "Author": "Enrv", "ReviewID": "UR117810729", "Content": "This is a lovely boutique+ hotel in a first class location. Ideal for the main attractions. Has a great spa and the staff are helpful and friendly. Rooms have a lovely individual feel and we were staying in a cheaper room on a great deal.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Lovely well situated hotel”", "Author": "LA12345", "ReviewID": "UR117594763", "Content": "We had a lovely stay at this hotel. The location is fabulous, close to all the major sights, and within walking distance of the bazaars, and Galata bridge. Very nice breakfast. The hotel staff was friendly and helpful. Our room was a trifle small, with no view, however, it had a Hamam style shower, which was interesting. Next time, I'd probably prefer a terrace and a view, and repeat my visit to a real hamam, which was fun.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Lovely Hotel”", "Author": "jacek p", "ReviewID": "UR117576433", "Content": "Stayed at the Hotel Sultania last month (August 2011) for 4 nights.We have enjoyed our time in here,the room is very comfortable and had a lovely bathroom with powerful hot shower and also very friendly service.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Tokyo, Japan", "Title": "“Excellent hotel”", "Author": "johans057", "ReviewID": "UR117535398", "Content": "Great hotel in an excellent location with some of the most beautiful rooms I had the pleasure to stay in. Would be 5 stars except they forgot the promised pickup in the airport (we waited for 45 min before taking a taxi) and checkin/checkout was very slow. But everybody was super friendly all the time.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Luxembourg", "Title": "“Excellent location, excellent service, excellent breakfast”", "Author": "BlackXJ6", "ReviewID": "UR117466009", "Content": "I stayed at Hotel Sultania for five nights on a motorbike tour around South-East Europe. This was definitely the best hotel I stayed at during my tour, but, admittedly, it was also the most expensive one. The hotel has a very nice location in the Sultanahmet district, with easy access by foot or tram to many places of interest, and surrounded by lots of restaurants. The hotel's own roof-top restaurant, Olive, was rather good, and it provides excellent panoramic views over the city. The room rate included a rich breakfast buffet that offered a wide variety of dishes, and the selection was different each day. This must have been one of the best hotel breakfasts I have ever had. A fitness room and a swimming pool were at guests' disposal free of charge. Sauna, hammam, and massage were available for extra fee. The sauna was all right, but, in my opinion, the water in the swimming pool was much too warm for a refreshing effect. The hotel has a small garage, but I was told there was not any room for my motorbike. I was advised to leave my motorbike on the pavement where it was visible from the reception. It looked rather a safe location. The hotel staff was outstanding. Especially the people at the front desk were extremely professional and courteous, made me feel welcome and accommodated my every request. Whenever I entered the lobby, they greeted me politely and, unless busy with other guests, they entered into a friendly little chat about good food, motorbikes or my continuous adventures. I can recommend this hotel without reservations. I would stay here if I travelled again to Istanbul.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Arizona City, Arizona", "Title": "“Best hotel in istanbul”", "Author": "giselle s", "ReviewID": "UR117128534", "Content": "We stayed at hotel sultania for 2 nights and it was a very comfortable stay. The rooms were nice and clean. The bathroom was a good size. There were a lot of varieties of food at breakfast, but we didn't really find anything we liked too much on the first day. However, on the second day, we decided to try more things and eventually found things we liked.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Yonkers, New York", "Title": "“Perfect start to our honeymoon!”", "Author": "brianjkoscuiszka", "ReviewID": "UR117015642", "Content": "My wife and I just returned from our honeymoon, which we started at the Hotel Sultania in Istanbul. From our pick-up at the airport to our departure 5 days later, the staff of the hotel went above and beyond to make our time special. Check-in to our room was quick and easy, the concierge gave excellent recommendations for food and excursions, and the rooftop restaurant offers fantastic views. The hotel is ideally situated, a short walk from the Sultanhamet district (where the Hagia Sophia and blue Mosque are located), the new district (shopping), the waterfront, and other local sites. Outside of our transport to and from the airport, we were able to walk to each and every site we visited, saving money on transportation and getting to see some diverse neighborhoods of Istanbul. The only complaint we'd offer is that the beds weren't the most comfortable, but as we traveled to more areas in the region, this seemed to be the norm and might just represent a shift from what we were accustomed to in America. The hotel did offer a \"pillow menu\" with various options that could have made a difference, but we were so tired from all that we did that we still slept well. Other than that, the hotel met and exceeded ALL expectations and we cannot recommend it highly enough.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“Deserves all its rave reviews”", "Author": "Hdeborah", "ReviewID": "UR117002138", "Content": "Room decor fantastic. Tea, coffee and water provided. Good quality soaps, gels etc. Proper coat hangers! Excellent variety at breakfast buffet including the ability to freshly squeeze orange juice. Staff dedicated and SO helpful. We are recommending this hotel wherever we can and will definitely stay again if we find ourselves in Istanbul. It is so convenient to walk to the main sightseeing attractions. One thing to note, complimentary transfers to/from airport only apply if you book through their own website.", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent way to enjoy Istanbul”", "Author": "lyoso896", "ReviewID": "UR116864351", "Content": "Excellent hotel. We booked a double room and they upgraded us to the family suite which was huge! Turkish delights on arrival and the rooms even have a pillow menu with 5 different types to choose from (as you do). All the usual amentities and lovely accomodating professional staff. The breakfast was amazing. Freshly squeezed orange juice, pancakes and honeycomb. Definitely a great way to start the day in the buzzing city of Istanbul. Only downside: WiFi went out while we were there as they were apparently servicing it (haven't heard that one before). They did offer the restaurant's WiFi details next door but the signal was so weak it wasn't worth it. Really easy to get to. We just took the metro and tram from the Ataturk airport and got off at the GÃ¼lhane tram stop. The hotel is only a few minutes walk away (3.5TL one way).", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Great hospitality and location!”", "Author": "FavoriteWalks", "ReviewID": "UR116546043", "Content": "Everybody at the Hotel Sultania made our first trip to Istanbul extremely comfortable - from arranging for a private guide the first day, to recommending fantastic restaurants, and just being available for a chat about the town. This is a small boutique hotel - the fourth family run hotel in this district. It has a restaurant - The Olive, with views of the Bosphorus and Hagia Sophia on the property which I'd recommend if you do not feel like venturing out one night. Breakfast is included with fruit salads, fresh honey and thick Turkish yogurt, eggs with mushrooms, tomatoes cooked as well as fresh with cheese, breakfast meats, cereals, fresh OJ etc. Many restaurants are within a short cab ride or walk. The metro runs nearby, so if you want to use this system, it is easy to reach the Dolmabache Palace or Museum of Modern Art. Locally the Sultanahmet district has nearly everything you'd want to see on a first trip - The Topaki Palace and Archeology Museum, the Hagia Sophia and the Sultanahment Mosque (The Blue Mosque), The Basilica Cistern, The Turkish and Islamic Art Museum, the Egyptian Spice Market and the Grand Bazaar. Istanbul is hilly and has lots of cobblestones, so if walking is an issue for you, take a cab. Cabs are reasonably priced and can be arranged by the hotel. Be sure to see Istikal Street, a pedestrian thoroughfare starting at Taksim Square. Also the Cultural Center is about three blocks walk from the hotel which hosts a highly rated dance performance as well as performances of the Whirling Dervishes. We had a beautiful room with a balcony on the fifth floor which had a large marble bathroom. It had a queen and single bed, and was great for a small family. Some of the rooms have very small bathrooms with little privacy, so if that is an issue for you, get a room with a hamas (larger bathroom). The restaurant recommendations from Ozlem and the staff that we had were really good -- Topaz and The Ottoman Palace were restaurants that we visited for lunch. Topaz is uphill from the Dolmabache Palace with a wide open terrace overlooking the palace and the Bosphorus. Ottoman Palace is near the Hagia Sophia and is also worth a visit. Asitane Restaurant is contiguous to the Chora Church and has a walled patio covered with vines and good Ottoman cuisine. Quiet live music at night. I think that the church closes at 6:30 pm, so you could arrange an early dinner afterwards or lunch before a visit. The Hotel Sultania felt like home for our week's stay.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Turkiye cok guzel! Berna Auckland New Zealand”", "Author": "Bernie B", "ReviewID": "UR116545513", "Content": "I love Istanbul, this is definitely the perfect place to reach all those amazing historical musuems and places of interest. I had a room next to the lift on the 3rd floor, it was so quiet, in general it was heaven to stay here. The young woman who cleaned my room was \"more than amazing\". Nothing was too much trouble for her, so polite and went out of her way to ensure that I was as comfortable as possible. A good tip for any traveller, if you need a shuttle service, ask the reception for the service that picks up travellers from various hotels, do not ask for an independent transfer as there is a huge difference in cost. Will definitely recommend this place, breakfasts were also really good and there was a variety.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“Absolutely perfect and Ozlem is my hero”", "Author": "Mishnin79", "ReviewID": "UR116424865", "Content": "This hotel was exactly what I needed. The decor is gorgeous, very clean, perfect location, the terrace bar is cosy and the whole hotel was welcome retreat for a solo female traveller. The staff were very friendly but I must say a huge thank you to Ozlem who looked after me when I lost my bank card at Ataturk airport. She went above and beyond and actually tracked it down for me. Thank you so much.", "Date": "August 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Manchester", "Title": "“Great Location and Great Hotel for exploring old Istanbul”", "Author": "Yorkshire_Exec", "ReviewID": "UR116375673", "Content": "We stayed here last week for five nights and it was as good as the pictures suggest. The staff were friendly and courteous, breakfast was akin to a feast with lots of choice and a juice squeezer to squeeze your own orange juice. We ate in the restaurant on our first night not wanting to venture out and whilst the service and food was good it lacked atmosphere and we left a little bit disappointed, but as you an see from restaurant reviews there are loads on the street outside. Next door is a gem! This hotel is great for exploring Istanbul with all the major sites less than 15 mins walk away and the tram stop is five mins away if you want to go further afield or just use transport. Our room was great and looked just like th hotel pics on the website and we had a great time here so would highly recommend you stay here if coming to Istanbul.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Kent", "Title": "“Great Location and Friendly Staff”", "Author": "AandAW", "ReviewID": "UR116301779", "Content": "We arrived pre Breakfast last Sat and the staff were amazing. Brought us coffee whilst we waited and then, whilst we were having breakfast they had one of the rooms cleaned after an early departure. By 7.30 we were checked in and free to shower, change and sightsee. Throughout our two day stay the staff were impeccably friendly and helpful. Rooms are reasonably spacious, quiet, clean and well appointed, although we spent most of our stay out and about. We only ate breakfast at the hotel which was very good. A great stay and a comfortable hotel perfectly situated for the best sightseeing in Istanbul. We would definitely return and recommend it to others.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Best hotel in the neighberhood!”", "Author": "stars1983", "ReviewID": "UR116268211", "Content": "My husband and I travelled to Istanbul for the 2nd time and we wanted to stay in the sultan Ahmed area this time. We chose this hotel and we couldnt be any happier. The staff are young professionals that give you great advice. The rooms are so cute and romatic and clean. Service is amazing. and its just around the corner to all public transportation and walking distance to all historic places and the Bazar. would def stay there again!", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney Australia", "Title": "“Amazing find - great staff, lovely room and terrific value!”", "Author": "rbinsydney", "ReviewID": "UR116191032", "Content": "Trip advisor has done it again - we just loved this place. They unexpectedly sent a car to pick us up from the ship (complimentary, and very welcome gesture!!); which began the Sultania experience - they just can't do enough to please. The very moderate price, (which decreases if paid in cash) includes breakfast, which was more than adequate; free wifi in room and public areas; delightful themed guest rooms with delicious treats under a small metal dome waiting on the bed. The rooftop restaurant and bar (Olive) has great views, particularly at night, but we didn't dine here. There is also a spa downstairs with a gym and small swimming pool, so we had a great massage for a very reasonable price. As our flight was late in the evening, they gave us late checkout til 2pm, which was much appreciated. This is just excellent value for money and we wouldn't think of staying anywhere else next time. Also the area is delightful with masses of great little restaurants (including no. 5 on trip advisor directly opposite!)", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“A super hotel - highly recommended”", "Author": "weltaltburger2", "ReviewID": "UR116102268", "Content": "The first sign of the professionalism at the Hotel Sultania was the email we received a week before arrival from Ozlem the guest services manager. It was a really nice touch and showed that they care about their guests. The hotel driver was waiting for us at Ataturk Airport and was friendly and helpful as were the staff at check in. . We were taken up to a large L shaped room (corner) with sitting area, big bed and balcony and shown where things were including the plasma tv cunningly disguised as a mirror! The bathroom was fine, though as in most Turkish hotels, there was no plug for the wash basin, a mystery we've yet to solve. Everything was spotlessly clean and well maintained. We appreciated the tea and coffee making facilities in the room as well as the daily replenishing of the Turkish delight bowl (it's nothing like the coloured jelly stuff you get in Australia, this is excellent!) Breakfast was good, with eggs cooked to order plus a wide choice of Turkish and European foods. Special mention to the lovely Ozlem, who is the first guest services manager we've ever met who really does her job. She couldn't have been more friendly or helpful and went out of her way to give advice and make forward hotel bookings for us. The rest of the staff were good too. The little bag and fridge magnet given to us on departure was a nice touch.....it would cost them peanuts but such a nice little souvenir. The Sultania is well located for major tourist attractions, handy to the trams and restaurants. We'd happily stay there again.", "Date": "August 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Santa Monica, California", "Title": "“In the heart of old town of Istanbul.”", "Author": "gianninijrn", "ReviewID": "UR116042008", "Content": "Thumbs up! Nice, clean, updated rooms. Walking distance to everything. Easy access to the train. Staff was helpful. Breakfast... Could have done without it. Otherwise, would definitely stay there again.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "", "Title": "“Great Hotel”", "Author": "JackJack-1976", "ReviewID": "UR116021244", "Content": "This hotel is great and we can't say enough about it. We stayed in a suite with a nice balcony. The room was spacious and clean, with a comfortable bed. Breakfast and wireless Internet were included. Breakfast was very nice, with a nice selection. We requested a late checkout and they were able to accommodate. Had an excellent massage in the spa. We should also mention that they picked us up at the airport free of charge. We would stay here again.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fort Lauderdale", "Title": "“Great hotel and wonderful service”", "Author": "coffeegirl54", "ReviewID": "UR115985454", "Content": "Loved the hotel Sultania! Near the Topkaki Palace. The bath room is a little odd, with the shower door and bathroon door the same door. It swings one way or the other. You have to like your roommate! Otherwise, great hotel. Give you an example. When we left, the bellman mistakenly onitted one suitcase from our taxi to the airport. We didn't notice enroute to the airport. The hotel called our taxi driver and made arrangements for another taxi to bring the missing suitcase to meet us at the terminal. How's that for responsibility? I was entirely impressed with that level of care. Very nice stay. Loved it and Istanbul.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Johns Creek, GA", "Title": "“Quiet refuge in the Old City Sultanahmet”", "Author": "theinvestmentcoach", "ReviewID": "UR115933215", "Content": "At the end of a Black Sea cruise my wife and I spent three enjoyable days in Istanbul, one of our favorite cities in the world. The Hotel Sultania is on a quiet pedestrian-only street in the middle of everything. It is a 10 minute walk to the Haghia Sophia, Blue Mosque, and Topkapi Palace. The hotel is well-appointed, the rooms comfortable, the staff most helpful and courteous. The breakfast room is comfortable with cafe seating along the quiet street; the food is good. There are good dining selections right along the same street. Room rates are reasonable. It is a delightful spot and we plan to return.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Montreal", "Title": "“Hotel Sultania would be #1 on Trip Advisor if it had been open longer”", "Author": "GingersMom66", "ReviewID": "UR115855953", "Content": "We had the good fortune to stay at Hotel Sultania in early July and liked it so much that we stayed there again at the end of our trip, having originally booked another hotel. Ozlem in guest services is very friendly and helpful as is the rest of the staff. The rooftop terrace is a gem with a fantastic view of Hagia Sophia. The breakfast buffet is outstanding. The hotel's central location makes it very convenient for getting to all the main sites. I would definitely stay there again.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“TOP CLASS SERVICE!”", "Author": "Merali", "ReviewID": "UR115770310", "Content": "My wife and I were first time visitors. We were a little paranoid about the hotels in Turkey, however we booked at Hotel Sultania. Turned out to be one of the best hotels i have ever stayed at, also its close to everything... we are a picky couple when it comes to hotels!..definitely recommend to all.. Oh and there is this lady who is in charge of providing all kinds of information for people who stay at the hotel... she is AWESOME!! a great team of staff to be fair...but she was the best!!", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Will definately go back.”", "Author": "Fiona1958", "ReviewID": "UR115500292", "Content": "What can we say that hasn't been said already !!!! Fantastic hotel, not for a moment did we think it would be half as good as we were led to believe. The room was just lovely & very comfy, we were a bit shattered after an overnight trip to our departure airport & on arrival the lovely Ozlem, made us feel increadibly welcome & continued to do so for our entire stay. The rest of our visit was great, very close to everything, saw as much as we could but didn't have enough time so will be back, will only stay at the Sultania now, we have been spoiled & don't think we would consider anywhere else in Istanbul. Will see you all hopefully sometime in the New Year, Many thanks for a wonderfull stay, big hug for Ozlem you are fantastic.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Qatar", "Title": "“Excellent boutique hotel”", "Author": "Khursheed", "ReviewID": "UR115425245", "Content": "hotel sultania is an excellent boutique hotel in Istanbul, its location is very good, very near / walking distance from all major historic locations. rooms are very well decorated, very clean and comfortable. room service and food quality is impressing. staff are extremely cooperative and friendly. hotel provides pick up from airport.", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Quebec City, Canada", "Title": "“We loved it and will definitively recommend to all our friends and family”", "Author": "France011", "ReviewID": "UR115394833", "Content": "What a great place to stay in Istanbul! Perfectly located near major attracttions. The staff is extremely nice and helpful, specially the concierge Ozlen who was friendly and even offer a little souvenir to my daughter and myself. Rooms are clean and very confortable. P.S. breakfast is nicely presented with great choice and excellent quality. Sultania is THE PLACE to stay in Istanbul.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Riyadh, Saudi Arabia", "Title": "“Wonderful hotel, fantastic staff”", "Author": "desertdoccsm", "ReviewID": "UR115282154", "Content": "I chose this hotel because of its excellent location and because of its many 5 star amenities (flat screen tv, ipod dock, down pillows and high thread count sheets, robes, marble bathrooms, free in-room wi-fi to name a few.) What I did not expect was the wonderful staff. They are incredibly friendly yet professional. They accommodated my every request including a 7 am check-in (such a relief after a long flight!) When I contracted food poisoning at a guide book recommended restaurant on French street, Hussein at the front desk brought me water and extra blankets and checked in on me every hour or so all night. They even offered to take me to the hospital or call a doctor. The next morning the adorable concierge, Ozlem, was very concerned for my well being and later called the offending restaurant and gave them a serious talking to. I will always return to this wonderful hotel when I visit Istanbul.", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“We absolutely loved it... one of the best hotels we have stayed in”", "Author": "riky221", "ReviewID": "UR115165115", "Content": "We were here for a wedding and from the moment we arrived, we experienced outsanding service. The rooms were absolutely as the web said they would be. We also had a meal in the roof-top restaurant. The views are amazing for the sunset. The location is perfect for walking to all the key sites and the tram. We regularly asked for information but would particularly mention the Guest Services lady who was outstanding and what an ambassador for Turkey. We loved it and we will be back!", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Blackburn", "Title": "“Just amazing!”", "Author": "grumpybones", "ReviewID": "UR114895646", "Content": "Staff and atmosphere provided in this boutique hotel are just amazing. Rooms are extremel comfortable, themed (Sultan's hareem!) and stylish, enhanced by the latest technology. Breakfasts are superb and the cafe/bistro high quality. All staff uphold high standards are friendly and courteous and a credit to the management. You are treated very special!y", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Amazing Hotel - Couldn't have imagined better!”", "Author": "jules0010", "ReviewID": "UR114881472", "Content": "I stayed at the Sultania for 6 nights after travelling around the rest of Turkey for 2 weeks and I am so glad I chose this hotel to cap of my tour. The staff are all incredibly friendly and helpful, especially in finding your way around the city and to the sights. The complimentary breakfast was one of the best I've experienced anywhere. The photos shown on the hotel website are identical to what you get. The single room I had was very large and clean and comfortable (king size bed!) - which made it difficult to leave the room. The different kinds of pillows offered really go the extra mile in making you feel at home. The shower, oh the shower with two shower heads! If I could take that shower home with me... couples you'll enjoy it too. The spa/pool was nice and clean. Next time, I'll stick with just the scrub/sudsing service though. I wasn't overly thrilled with the massage (but this really depends on the person). The location was central to everything, on a small street that isn't driven on. A lot of restaurants around. The Olive Restaurant was yummy and the service was incredible. I would definitely recommend staying in this hotel!", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Burbank.", "Title": "“Man, I love this hotel!”", "Author": "Travel184", "ReviewID": "UR114772193", "Content": "Can't say enough good about the Sultania. Very luxurious and at a great price. Perfect location for visiting the Sultanahmet area of Istanbul. Very close to the tram which takes you pretty much anywhere you want to go in Istanbul. The staff and concierge were wonderfully helpful, making reservations and suggestions. The rooms are very lovely, clean and elegant. There is a pool and spa area with hamam. Terrific. The breakfast was wonderful with lots and lots of choices. Sultania is a very lovely oasis in which to relax after a busy day of touring around Istanbul", "Date": "June 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent base for exploring the city”", "Author": "FluffyViv78", "ReviewID": "UR114764770", "Content": "More by luck than judgement, the Sultania ended up being much more centrally located than we expected - so much so that we spent much of the first day walking round in circles, but I think that's a feature of Istanbul! Lovely hotel - clean and friendly with everything you could want right on your doorstep. The restaurant was fantastic although don't necessarily be fooled into going to the roof terrace. The views are spectacular but it's enclosed and the menu is the same whether you're six floors up or sitting at the much more atmospheric street level. Rooms are a decent size, with an interesting shower/toilet screen contraption which actually gave a lot more privacy than you might expect. It was spotless, well stocked mini bar, four different types of pillow to choose from and some nifty accent lighting which gave us a good fifteen minutes of fun! Breakfast was varied and served at sensible times, although stick with the Turkish treats - this is not the place to indulge your love of corn flakes. Staff were extremely attentive and well equipped to guide you round the city. I would also highly recommend a cocktail or two when you stumble back late one evening - the Istanbul Seven Hills in particular packed a significant punch after sidling up to you disguised as apple juice! Lovely - highly recommended especially for those visiting the city for the first time and wanting to be close to all the major places of interest.", "Date": "June 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Moulton, Alabama", "Title": "“Loved it!”", "Author": "lhlitt", "ReviewID": "UR114693524", "Content": "Everything about this hotel is great....great rooms, great location, great staff, great breakfast! We stayed here for 4 days in June and could not have been more pleased!", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London", "Title": "“Great location for getting under the skin of the old town”", "Author": "RichWandsworth", "ReviewID": "UR114316643", "Content": "I sort of knew this would be good just from the booking experience, I was messing around due to changing numbers on the weekend but nothing was a problem and everything was very efficient. Very friendly staff, front of house was excellent with the concierge full of energy and so friendly. Hotel is new, very clean and very well kitted out. The Bathrooms are on the small side but very well equiped with modern fixtures and fitting. The rooms all come with ipod docking stations and flat screen TV's built into the mirror, pretty smart!!! and a reasonably priced mini bar. Hotel is spotlessly clean and make sure you go down to use the hidden gem that is the spa - really great facility and again the treatments well priced. The other feature that is worth checking out is the roof bar, there is a restaurant but Istanbul has so much to offer you may want to go and explore - but worth a beer or a glass of the local vino before you venture out. The hotel is located on a lovely tree lined street with plenty of decent places to eat and drink and a 10 minute stroll to all the sites. Great hotel, would certainly go back again next time I visit this brilliant city.", "Date": "June 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“We loved every minute of our stay and we will be back!”", "Author": "Ani085", "ReviewID": "UR114185102", "Content": "We loved every minute of our stay at the Hotel Sultania! The rooms were awesome and very clean. The service was out of this world! Everyone was warm and friendly. I can't say enough about the Hotel's hospitality. We have two little kids and they treated all of us like family. The breakfast which was included was delicious. It was buffet style with lots of lovely choices. The hotel was a short walk to all the major historical sights. We didn't have a chance to use the spa but it looked great! We miss our time at the Hotel Sultania and look forward to going back next year.", "Date": "June 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Thessaloniki, Greece", "Title": "“Extraordinary,we will definately come back”", "Author": "StellaThessaloniki", "ReviewID": "UR113921613", "Content": "We had a wonderful time at hotel Sultania! First of all,all the people working there were very kind and always did more things than the common to help. Ozlem,the woman in guest relations was very friendly,always smiling and always suggesting great places for dinner etc.Se also helped as with check in and other things.Men in the reception were also vey kind.The hotel is in a very good point,5 minutes walk from Ayia Sofia and Blue Mosque and 1 minute walk from the tram station ( the tram stop is Gulhane). Galata bridje is also very near,you can walk on foot.Rooms are exactly what they look at the fotos,the whole hotel is new,very clean and with great decoration.Hotel spa is also very good ( I had the 'sultan package') ,tukish bath in hamam and massage.Breakfast was also very good,fresh omelete of your choise,fresh squized orange juice,rose marmelade and many,many things!Also many useful facilities in the room such as slippers,coplimentary water,coffie and tea as well as some welcome sweets made our stay even better. WELL DONE,KEEP ON THE SAME!", "Date": "June 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arizona", "Title": "“Amazing boutique hotel”", "Author": "ArizonaDoglover_50", "ReviewID": "UR113566903", "Content": "I just loved this place. I'd rate it a 4.5 if not 5 star hotel. Rooms are exactly as you see in their pictures. Staff makes you wish staff at ALL hotels were this friendly and helpful. Neighborhood is right where you want to be as a tourist. There are a zillion restaurants and shops within a stone's throw. I don't normally give this sort of praise, but this hotel deserves it. Especially if you look at the prices of other 4 star and above hotels in Istanbul. AND great pool on the lower level! GREAT job, Sultania!", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“One of the best hotels we ever visited!!!”", "Author": "argyris23", "ReviewID": "UR113376716", "Content": "As I say above Sultania Hotel is one of the best hotels we 've gone. We spent there our Easter vacations on April 2011. Starting from the personel everybody from the front desk guys to the cleaning guy all of them were so kind and helpful, with a smile on their face all day. We chose a sofa bed room, that had a huge bed and a very nice sofe by the window. The room, as the whole hotel, was very classy, clean and spacious. And very important quiet. The hotel is located in Sultanahmet in a nice pedestrian very close to tram and 5 min walk to Agia Sophia. I defenately recomend this hotel to everybody. Forgot to say it has a wonderful area for spa with a small swimming pool, hamam, sauna and rooms for massage.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Fantastic Hotel, Friendly staff”", "Author": "Peach2102", "ReviewID": "UR112990827", "Content": "The hotel is well located near the palace, tram line and a short work to the Spice market and Hamdi restaurant. It is also located in a strip of restaurants, so plenty of choices for dinner. The staff are outstanding at this hotel. We were welcomed by friendly reception staff with a cup of coffee or tea and check in was very fast. The lady at concierge is fantastic, full of great tips and advice with a vibrant attitude. The staff leave a memorable impression. Breakfast is very good and includes some local treats. The rooms were a good size for larger suitcases and very well maintained. the rooms also have tea and coffee making facilities which is often lacking in European hotels. We would definitely stay here again!", "Date": "June 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“One of the best hotels in Sultan Ahmet area”", "Author": "aaangha", "ReviewID": "UR112765601", "Content": "We stayed at Sultania for 2 nights on our way from Los Angeles to Tehran. It was a great experience. I highly recommend it if you want to stay in that part of town. Many things to visit during the day, but not the most happening place at nights. The room could be a little bit cleaner, but the design is nice. Staff members were very helpful and caring. I donâ€™t think there is any room for improvement there, couldnâ€™t get any better. They helped us to identify places to visit and places to hang out at nights with locals. I highly recommend this hotel.", "Date": "June 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Frederick, Maryland", "Title": "“last destination and perfect designed hotel”", "Author": "ramon29", "ReviewID": "UR110666051", "Content": "hotel sultania was our last destÅŸnation.when we arrival to hotel we were not sure which table is reception and young beautiful lady helped and showed us the reception which is designed with marble.Ä±t was unusal reception Ä± felt like on theater myself.Ä± walked on the red carped and catch to reception.receptionist stand up when see us and shook our hands and offered to drink turkish coffee.we sat to reception and chat a little bit.he explaind almost everything about hotel and city.after drinking coffee we took the elevator. all the rooms have numbers and sultans name it was good an idea.on the bed there was trukish delight and it was very delicious.room has been designed as like little palace.Ä± have never seen this kind of decoration during my trip.bed was very comfortable Ä± did not want to get up in the morning. breakfast was multiple choice and delicious.waiters were very hardworking and smily. Ä± had a problem with my shoulder and they recommend me massage and Ä± made reservation for wellness.after massage from professional masseur Ä± felt much better myself. their slogan was feel like a sultan.Ä± was not sure what does it mean but Ä± know very weÅŸll now because Ä± felt.thank you everybody for your great service.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“A Gem of an Hotel”", "Author": "happychappy75_11", "ReviewID": "UR110334487", "Content": "We chose Hotel Sultania as part of celebrating our 50th Wedding anniversary and were treated like royalty by all the wonderful staff throughout the Hotel. The food and service was very good, with a special mention to Huseyin , Murat and Ebru whose friendliness and attention was outstanding and made our stay most memorable. We would recommend Hotel Sultania to anyone wanting to experience true Turkish hospitality right in the centre of Istanbul's most amazing sights.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "beverly hills", "Title": "“beautiful hotel - great location”", "Author": "zman007", "ReviewID": "UR109491810", "Content": "Hotel Sultania is in a great location in walking distance of all the major tourist attractions such as the Blue Mosque and the Hagia Sophia. Also for longer trips the Tram is just 1 block away from the hotel. The hotel itself has beautiful large rooms and a full free breakfast every day . The most outstanding feature is the customer service. Everyday the Guest relations girl helped us out with sightseeing recommendations , directions and delicious restaurants. I would highly recommend this hotel", "Date": "May 23, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Newport, Rhode Island", "Title": "“A Delightful Hotel”", "Author": "Mayo Gal", "ReviewID": "UR109353458", "Content": "We spent four nights at the Sultania at the end of April. We had arranged with the hotel for pickup at the cruise terminal, and they were right on time. The hotel is charming, and we enjoyed our large room and the interesting bathroom arrangement. Breakfast was bountiful, and the squeeze your own orange juice was delicious. I was a bit apprehensive in regard to the location in Sirkeci, since it was described as down the hill from Sultanahmet and I was suffering from the effects of a leg injury. I was delighted to find that the hill was a pleasant walk and not very steep at all. Most of all, we were impressed with the entire staff, most especially with Mrs. Ozlem in guest relations. She provided us with excellent restaurant information, and went out of her way to locate us after we departed the hotel when our ATM card was brought to the hotel after it was found in a restaurant. Comfortable, pleasant and in a great location - we loved it.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stoke-on-Trent, United Kingdom", "Title": "“A magical hotel in a magical city”", "Author": "dorrie2", "ReviewID": "UR108519987", "Content": "We have stayed in lots of hotels but this is one of the best. The room was lovely-very atmospheric and romantic. All the staff-waiters, reception, concierge everyone could not do enough to help us. We liked it so much we are going back in February. The only thing I would have liked was a bath rather than a shower.", "Date": "May 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“wonderfull hotel”", "Author": "georgehookwell", "ReviewID": "UR108072545", "Content": "me and my wife trevelled Istanbul and stayed at Hotel Sultania it is a fantastic location and very clean hotel staffs are very friendly it was a great plassure to stay there thank you everybody making our holiday fantastic", "Date": "May 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "rome", "Title": "“feeling like queens”", "Author": "brpadali", "ReviewID": "UR107857491", "Content": "if you want to take a break from your 24/7 super-mom job, well a two nights' trip to Istanbul with your friends is the best choice and hotel Sultania is the best solution. The place is new, clean, well-positioned(walking distance to top sites and railway buses that drive you everywhere, we went on the other side of the bridge to see the galata tower ) . The rooms are beautifully decorated, but peculiar: the basin is in the room, and the toilet has glass-walls...so be sure you travel with your parther or very close friends! the service is great, the staff is very friendly.The Olive Restaurant at the top has a wonderful view and good food. The breakfast buffet is delicious...but the very best is the spa: the pool is ok, but if you really want to relax you must try the spa. You can choose from different kind of massages and have a foam bath (it's very intimate, not like the public bath).Then you can relax on huge sofas and drink your tea. It's awsesome! They really treat you like queens at Hotel Sultania!", "Date": "May 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“One word - perfect”", "Author": "TrustyDublin", "ReviewID": "UR107249738", "Content": "I stayed at the Sultania for a 4 day trip with my husband in April for a sightseeing tour of Instanbul. The hotel is ideally situated for this, being only 5 minutes walk from the Blue Mosque, Cistern, Old Palace etc, and the tram stop for further sight-seeing. The hotel is lovely but what really makes it special is the staff. The staff at this hotel must be one of the most helpful I have ever come across. Every one of the staff members, porters, receptionist, Guest Relations, waiting staff are efficient, knowledgeable, helpful, courteous and friendly in the nicest possibe way. I hope the owners realise what an asset the staff are and appreciate them. The hotel is SUPER SUPER clean. The rooms may be a little small but not in any way cramped and they are decorated in such a fun way that this is just a small point. I had written ahead to say that my husband is a coeliac and the hotel had especially got in gluten free bread, much appreciated. Also one night they had a fabulous flour free dessert and my husband had to have two helpings. Not only did they not charge him for his second helping but by the next morning our waiter had provided a handwritten English version of the receipe. You could not pay for service like that. We ate in the hotel bistro, very good and also the Olive Restaurant. Both very good and food excellent. So go to the Sultania, and have a fun time, amongst the most pleasant staff you could ever meet. Thank you all at the Sultania. Anne and Paul", "Date": "May 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Absolutely fabulous hotel”", "Author": "carobrooB-W", "ReviewID": "UR105633483", "Content": "We stayed for five nights occupying one twin and one double room. Both were amazing and extremely comfortable. We ate in the bistro one night and The Olive restaurant twice. The Olive has amazing views and dinner was delicious and not expensive compared to other restaurants in the neighborhood. The staff were all fantastic and Ozlem was so helpful in suggesting places to visit. The hotel is near to all the well-known sights - just follow the tram line. The hotel has wi-fi and we could use our I-pad all over the hotel. Every room has an I-pod docking station.", "Date": "April 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nevsehir, Turkey", "Title": "“a real historical ambiance”", "Author": "angramainyu", "ReviewID": "UR105562226", "Content": "luxry,silence,good location,delicious breakfast, iron and ironing board in rooms (most important thing for a businessman like me)", "Date": "April 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Nice location, but smallish rooms, and a bit pricey for what it is”", "Author": "FOL-1003", "ReviewID": "UR105527137", "Content": "This hotel manages to benefit from tripadvisor like only a few i have ever seen in the world. once you been there, you see that the staff is nice and the location in the old town, not good for business, but great for the excursions. Low points are a really small room, where the shower door closes into the bathroom, fnacy but leaves the bassin in the room, so if you get up and wash your hands you are pretty close to the bed. Not my style. lots of funny and colourful decor with little use. Its 3*, charges 4*. WArning, the Olive Restaurant is dreadful, do not go. Check out Club 360 or Hamadi, all within close range.", "Date": "April 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bakersfield, California", "Title": "“A great high end luxury hotel”", "Author": "Geroi900", "ReviewID": "UR104211949", "Content": "If you have the money, you can't beat the Hotel Sultania. It features immaculate and huge rooms, beautifully decorated. I have never stayed in a hotel room quite that fancy anywhere in the world. The staff really bends over backward for the guests. I saw a tourist couple shamefully berating a hotel employee because a taxi driver (unaffiliated with the hotel) did not actually carry their bag into the hotel. The patience and self control of the staff member was awe-inspiring. How he withstood that totally undeserved tantrum without saying a word is beyond me. The concierge was very helpful to every visitor.", "Date": "April 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Frankfurt am Main, Germany", "Title": "“Certainly not a business hotel”", "Author": "Aethelred", "ReviewID": "UR102470760", "Content": "- and how it can be the #13 business hotel on tripadvisor is a real enigma to me. This is a compteley touristy hotel for tourists only in the main tourist area of Istanbul - and that was a bit my problem, because I was there on a business trip and it did not really cater to people like me. The hotel is one of six in one block that belong together and share some facilities (so a bit pseudo-boutique) such as the tiny pool and the rooftop restaurant. The good sides of the hotel included the very friendly guest relations lady; the general quality of the furniture and infrastructure, especially the good bed and servicable writing desk; the quite good breakfast, included in the price, with nice local selections; the free pickup from the airport; and the location for touristic purposes as well as close to a tram stop (GÃ¼lhane). Among the bad sides were that the room was often not made up in time and things frequently not replaced (cups, glasses); the thin walls through which one could hear even not so noisy neighbors; the generally not well-enough isolated windows; the erratic internet which always worked but often only after trying 10-15 minutes to log in; the partially overdone and slightly kitschy decor; the sink and washing facilities in the room rather than in the shower, which had too little space to put things; and for me, the location right on one of the main tourist streets of the quarter. The hotel provides an airport car service which costs slightly more than double a reliable taxi, which the reception will order for you. I would advise getting a high-up room facing the side street, but this means to either take the stairs or wait a lot for the very small and slow elevator - I still would think this the better alternative.", "Date": "April 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "korea tegu", "Title": "“wondyrful”", "Author": "kamoliddin", "ReviewID": "UR102425442", "Content": "I am a businessperson who does commerce. That is why I visit Istanbul quite often. The hotel in Istanbul is located near the centre and hospitality, cleanliness of them is very important for me. This time of my visit, I have surprised of their big, tidy and historically beautiful of room, which is like a real. In the restaurant of the hotel, meals made with naturally fresh vegetables and they are very nice and yummy. Also, you can visit historical places that are not far from the hotel. Servants in the hotel are very kindly and nice to the visitors.", "Date": "April 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“excellent staff and service”", "Author": "glynna", "ReviewID": "UR102186735", "Content": "i really couldn't recommend this hotel enough - location, staff, service - everything was excellent", "Date": "March 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic Hotel set in a great location”", "Author": "weekend34", "ReviewID": "UR100832563", "Content": "Stayed here with friends at the begining of March. This hotel cannot be faulted great location within walking distance of all main sites. Rooms were decorated and kept clean to a very high standard . Turkish delight delivered to your room daily ! Break fast second to none ,but most of all the staff who were so friendly helpful and went out of there way to make your stay in Istanbul such a pleasure. We were a little disappointed with the roof top restaurant but so many good places to eat by the hotel that you have lots of choice.", "Date": "March 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rome", "Title": "“Kingdom of kindness”", "Author": "alexpp12", "ReviewID": "UR99219610", "Content": "First: I wanto to thank you all the staff, special to Ozlem for courtesy and availability. They are able to merge familiar and professional ways. In add hotel's location is perfect, in the hearth of Sulthanamet. Breakfast is adorable. Hotel is absolutely clean, large and confortable room in style. Really rare. I never forgotten them. Alessandro", "Date": "March 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great hotel”", "Author": "PMMLondon", "ReviewID": "UR99155250", "Content": "My partner and I stayed four nights at the hotel. We were impressed at the room; it looked great and was comfortable and clean. All the staff were very friendly and helpful. It was also in a great location near to the tram and Blue Mosque. The breakfast was good and there was a very varied spread of fresh cold and hot food. The only very slight downside was the wash basin which was in the bedroom rather than being in the bathroom. I'm not sure if this was just a feature of our particular room. I would have preferred this to be in the bathroom to keep the bathroom and bedroom areas separate. I would recommend this hotel.", "Date": "March 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "columbia", "Title": "“well hidden treasure in Istanbul”", "Author": "ajturk", "ReviewID": "UR98012400", "Content": "I travel often and have been almost everywhere in the world. I was on my way to Oman, Muscat after hopping in a few cities in Turkey. I live in the USA but am Turkish. Our standards are higher in the US in terms of service than most Europeans. My experience from booking my stay until the checkout was superb. Very rarely you will find a perfect hotel. This is one of them, best boutique hotel, very close to most attractions you will want to see in Istanbul. The rooms are wonderful, named after Ottoman Sultans. The front office personal can not be matched, with their enthusiasm, pride in what they do and professionalism. I teach tourism and hospitality management. These people do not need to attend any of my classes. They would have passed our classes with flying colors. I hope that they consider getting a masters degree or PhD so they can teach their skills to our future students. One thing that bothered me though was the unexplained humming noise from outside. There might have been repairs made. As a hotel manager I would make sure that these repairs are made, I would urge my neighborhood to finish them asap or do them late during the day. My Kudos to the people who run the hotel. Keep it up:-) One more thing. They did not charge my guest for breakfast. Free on the house. Nothing beats that. ANd they give you a little present on your way out. Pay cash, get a little discount.", "Date": "February 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cumbria", "Title": "“Stunning decor, excellent location, so-friendly staff!”", "Author": "Fraser61", "ReviewID": "UR97754836", "Content": "I endorse all the superlative reviews of this hotel - it really is as good as it sounds! The rooms are beautiful and cleverly designed; the location is excellent, near the top attractions and the tramline, and Galata Bridge. The Wellness Spa is luxurious, great for winding down if you're \"mosqued out\". Best of all are the helpful and friendly staff, who make an effort to talk to you as an individual - possible in a smallish hotel like this. A great hotel in every way!!", "Date": "February 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hilversum, The Netherlands", "Title": "“perfect hotel with atmosphere”", "Author": "annelien1001sjaals", "ReviewID": "UR97461991", "Content": "We stayed for 5 nights and had very comfortable rooms. Spacious and full of luxury things (coffee/tea/shower). The rooms are well decorated with paintings of the sultan's women. Very original and beautiful. Exactly as in the pictures on their website! The breakfast was very good including free fresh orange juice! They also have a lady in the house who can tell you all nice spots in Istanbul. From this hotel you can walk the old city and go to taksim by taxi. Next time I will stay here again. This is the best hotel I ever stayed in in Istanbul.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Wonderful Hotel”", "Author": "ralphine1", "ReviewID": "UR97334252", "Content": "My daughter and I stayed four days at this hotel. It was without fault. It is in a perfect position, walking distance to all main attractions in Sultanahmet and beyond. Rooms are spacious and full of atmosphere. They have all the amenities you could want. What makes it special though is the staff. From the minute you arrive you feel that they are genuinely concerned about making your stay at the hotel and in Istanbul unforgettable. Our porter, Arafa, had such great passion and pride for the hotel. Everyday he was there to great us with a smile, keen to hear what we had seen and done and did whatever he could to help. The same with Huseyin in the cafe/bar. Within a day he seemed to know exactly what we would want after a day in the city. It was like staying with friends. Cannot recommend it highly enough", "Date": "February 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Queensland", "Title": "“Fabulous hotel in great location with very helpful staff.”", "Author": "Hbmeri", "ReviewID": "UR96976660", "Content": "My partner and I stayed at this hotel for 7 days. It was very comfortable, clean and quiet. The rooms have everything you would need for your stay and the decor and lighting is fantastic. The staff are very helpful and attentive. The breakfast buffet is the best part of the stay with many choices to cater for everyone. A couple of tips: If you are like us and like to have a pre-dinner drink in your room, make sure you take some duty free with you because a bottle of very average white wine at the supermarket was nearly 17 lire. Nearest Supermarket: Leave the hotel lobby and turn right, turn right again at the end of the small street outside and then turn left. Walk about 50 metres to the end of that street and you will see a main street with the tram line and tram stop in front of you. Turn right and walk up the hill beside the tram lines until you get to a fork in the road. The road with the tram lines veers left and the other one goes up the hill. Take the one on the right and go up hill for about 500 metres until you get the first main road. There is a hotel on the corner called the Arden City Hotel. Turn right at the hotel and cross to the other side of the road so you are walking on the left side of the road. Keep going for about 100 metres to the next street left. There is a blue sign that points to the Grand Bazarre. Opposite that sign and just about where you are standing you will see Greens Supermarket down stairs. It's only about a ten minute walk from the hotel. Scammers: We got caught by an old trick and chances are it will be tried on you. The scam involves the shoe shine guys that work in the area and goes like this. You are walking along minding your own business and if you are alert you will notice a man with a shoe shine kit walk in front of you. If you are not alert the first thing you will see will be a brush drop in front of you. Because you're nice people and it's your first reaction to help you will call out to him that he has dropped one of his brushes and probably pick it up for him. He thanks you profusely and insists on giving you a shoe polish. He takes quite a long time and at the same time starts spinning you a yarn about his sick daughter/son in hospital etc etc. At the end he will be there with his hand out. We gave him a few coins and he then insisted we give him \"paper money\". I was going to give him a 5 lire note to get rid of him but only had a 20. He said he had change and then tried to say that he charged 25 lire for a clean. We were very angry by this time and said no way, so he passed over a note which turned out to be a 5. So we got fleeced 15 lire for a clean which should have only cost 1 or 2. To add insult to injury the same guy tried it on us again a few days later. We took great pleasure in just standing there and staring at him. I said \"nice try!!\". He just smiled, picked up the brush and ambled off. So Watch Out!", "Date": "February 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Probably the best hotel in Istanbul”", "Author": "denverxt", "ReviewID": "UR96362237", "Content": "Had a 3 night stay at Sultania Hotel in Istanbul. Its location is excellent, very rich & tasty breakfast, excellent service, nice decor, very good facilities. I highly recommend this hotel for your stay in Istanbul.", "Date": "February 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“The Best Vacation Ever!”", "Author": "MrsHasmat", "ReviewID": "UR95495311", "Content": "The hotel was superb! It's close to the main attractions in Sultanahmet and Sikerci area. Very, very clean and beautiful room, awsome bathroom, and marvelous and helpful staff! Ramazan and Ozlem are the gems of the hotel. They were ever so willing to help us and they recommended the best tours during our 3-night stay there! We took the honeymoon package, and it was worth every single cents. Their breakfast was also up to the standard. The personal touch really made the difference.. We would certainly stay in this hotel again if we visit Istanbul.", "Date": "February 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bangor, United Kingdom", "Title": "“Excellent hotel and facilities”", "Author": "Turkishvisitor", "ReviewID": "UR95415588", "Content": "I'm not generally enthusiastic about hotels but the Sultania is a great Hotel. My wife and I stayed for 3 nights last week in January and it was excellent. Everything was good, the welcome, the room, good sized, bright and airy with everything you need, breakfast, what a choice. However, it was the staff that really made a difference, they were all wonderful, friendly, interested and always willing to talk and help us with the little Turkish we know. We ate in the Bistro and in the Olive restaurant and the meals were excellent, the fajitas and the Sultan Kebap I can recommend. We have been to Istanbul twice now and have seen a lot of the city but we'd go back there just to stay at the Sultania,", "Date": "February 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Gorgeous hotel - wonderful experience!”", "Author": "PrinceWalter", "ReviewID": "UR95125207", "Content": "You can't go past this exquisite hotel located in a very central part of Istanbul, close to many of the city's main attractions and just a brisk 10 minute walk from the Grand Bazaar. Service was fantastic and for once, the room you stay in actually looks EXACTLY like the one on the hotel's website. Affordable luxury - wish i was still there! And the food in their lovely dining room is gorgeous. Superb accommodation.", "Date": "January 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "The Hague, The Netherlands", "Title": "“Excellent choice!”", "Author": "Family-Shahali", "ReviewID": "UR94979207", "Content": "We were in November of 2010 for few of days the guest of Hotel Sultania. It is a very clean, charming hotel with very friendly staff and within walking distance of many interesting and Historical locations of Istanbul. It is located in a quiet side street. We have enjoyed our stay in Istanbul. If we ever go back to Istanbul, for sure Sultania will be again our choice to stay.", "Date": "January 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lucerne, Switzerland", "Title": "“Comfortable hotel at a perfect location”", "Author": "lican7", "ReviewID": "UR94393219", "Content": "We stayed at Sultania in December for three days during a stopover with the intention to get to know the main sights of Istanbul. Sultania was an excellent choice, being at a walking distance from Hagia Sofia, Topkapi and the Blue Mosque. The room was clean and comfortable and the people very kind and attentive.", "Date": "January 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "seoul", "Title": "“You can't ask more !!”", "Author": "icrl", "ReviewID": "UR94351559", "Content": "Excellent location. Very friendly staff. Nice & new room. Great breakfast. I stayed 3 days at this hotel in Dec. 2010. It was a great memory. This hotel is not 5 star big hotel. However, it has its own charm that we can not find easily at huge chain hotels. Everything was perfect. All the people I met at or near this hotel area are good and friendly. If I go there next time, I definitely stay again at this hotel.", "Date": "January 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "las vegas", "Title": "“Perfect Stay in Instanbul”", "Author": "alcromer", "ReviewID": "UR94273563", "Content": "My wife and I just got returned from a wonderful trip to Istanbul. As always I used Trip Advisor to help me find the best hotel and I was not disappointed. Hotel Sultania is a beautiful boutique hotel (only 8 months old) in the old part of Istanbul, walking distance to all the top attractions and only a 2 minute walk to the tram. The rooms were simple, clean and modern (our room had small terrace on the 5th floor). The lobby was very modern and comfortable. The breakfast buffet was excellent (usually don't like them). The staff (especially Ozlem, Ramazan and Erdem) went above and beyond to make our stay almost perfect. Now only if they could do something about the rain. We are going back to Istanbul in May and look forward to staying at the Hotel Sultania again. Cheers", "Date": "January 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paphos, Cyprus", "Title": "“Fantastic Staff”", "Author": "Jess78Paphos_Cyprus", "ReviewID": "UR94255735", "Content": "I would like to say how fantastic our room was in this hotel, we stayed on the 5th floor with a balcony, and the room was beautfiully decorated, comfortable and well equipped. All the staff in the hotel were friendly and especially the lady on Guest Relations. The staff recommended places to visit and nice restaurants, all of which we were delighted with. The breakfast was plentiful and all very very nice. We ate in their Olive Restaurant and had a fantastic meal. I used their Spa and experienced the Bali Massage and Turkish Hammam which was a lovely treat. I could not fault this hotel in anyway, it was in a fanastic location, just a short walk from all the main sites, and a two minute walk away from the tram line, and only a 25 minute drive away from the airport.", "Date": "January 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens", "Title": "“Excellent hotel, excellent staff, great location!!!!”", "Author": "Sotiris_Ath_GR", "ReviewID": "UR93762362", "Content": "It is actually one of the best hotels I ve stayed! Apart from the cleaniness of the rooms the great breakfast , the most impessing thing was the staff! The reception staff -all of them were so kind and helpful. The lady at the customers service at the reception extremely helpful and very sweet, always smiling and always willing to help! The lady at the spa was also very helpful and sweet! And last but not least the young doorman was so helpful, always helped us find a taxi and explained to the driver all the details of our destination! Over all a great great experience staying with them! I d also recommend the roof restaurant with good food and nice views of the city! The staff there was also very helpfull and very effective!", "Date": "January 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "athens greece", "Title": "“unbelievable hotel, introducing you the spirit of Anatolia”", "Author": "tsismetz", "ReviewID": "UR92444859", "Content": "From the very first moment we entered the lobby all the stuff were very friendly, especially Ozlem Kaya in guests relations and Ramazan in reception. The room puts you right away in the atmosphere of the city with its exceptionnal decoration. Very nice spot in the middle of the old city, great restaurant in the roof garden with delicious traditional dishes and wonderful view of Ag. Sofia (especially at night). One of my best travel exeiriences.", "Date": "January 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Thessaloniki, Greece", "Title": "“just perfect”", "Author": "ThanosRubis", "ReviewID": "UR92260291", "Content": "From the moment we enter the lobby hotel the man at the reception named Ramazan was very kind and helpfull. The hotel was very beautiful and clean and its amenities were more than enough.The rooms were nice decorated and made us feel like we were Sultans.The fitness room was perfect,the Haman area must be a little bigger because it was too crowded, the water of the pool wasn't very hot, and you had to purcase for a swimming cup in order to swim.The breakfast was good but it could improved.The internet connection at the business center was sometimes slow, and the wi-fi wasn't compatible with the greek devices ( I tried two greek smartphones) we parked the car at the hotel parking and we felt that was secure enough although it wasn't an uderground parking. The location of the hotel was perfect. Finally, Ozlem Kaya the Guest Relation officer was very helpfull, kind and giving very important and correct information.", "Date": "January 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Doha, Qatar", "Title": "“Most beautiful and ditinguish room i've ever seen!!!!”", "Author": "Hudaz", "ReviewID": "UR91936619", "Content": "This hotel is located in a TOP location, you will be only few steps away from all the attractions that you must see in Istanbul. The Stuff are really nice and friendly specialy \"\"Ozlem\"\" she is a super nice lady and very helpful. I always pick big or 5 stars hotel, but this one was much better than any other hotel ever!!!", "Date": "January 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Fantastic service, clean modern room, fabulous food with a view!”", "Author": "MattandZara", "ReviewID": "UR91704914", "Content": "I should have written this some time ago so apologies to the Sultania for not doing so. The Hotel Sultania is tucked away in a beautiful (and quiet) part of the Sultanamet close to everything you would want to visit. The service was impeccable and what impressed me most was how clean, modern and spacious the rooms were. The hotel has the 'Olive' restaurant on top (with a roof terrace bar overlooking the Agia Sophia) which provides fantastic food and amazing views. It was full of Turkish groups and couples which is always a good sign. Amazing value for money and would say it's well above its star rating in comparison to other of the so called top end hotels we've stayed at in our time.", "Date": "January 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Beernem", "Title": "“Perfect !!!”", "Author": "VLSK", "ReviewID": "UR91657871", "Content": "Just a perfect hotel ! Nice rooms, helpfull and very friendly staf !!! Very good food, also upstairs in \"Olive\", spectacular view, very good service !!!", "Date": "January 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“a real treat!”", "Author": "Nel1234", "ReviewID": "UR91446728", "Content": "sultania is a great hotel for a romantic weekend away. funky rooms - everything has led 'back-lighting' / mood-lighting. facilities include free wifi, as well as pool (but buy / wear a swim-hat at reception). exceptionally friendly / helpful staff. good location (nearish grand bazaar, main mosques, etc). be warned: so comfortable / luxurious you may not venture outside much! oh, but somewhat 'thin' doors / windows mean noise can cause problems.", "Date": "January 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Sultania Has It All”", "Author": "itsthelatest", "ReviewID": "UR91412405", "Content": "What a fantastic hotel.... It was close to everything. Whether you are walking to all of the sites in the old city, or need to jump on a tram, it is in the ideal location. The breakfast is awesome, the staff is EXCEPTIONAL, and we will stay there again on our next trip. Now, what you may or may not like.... the matress is hard. Since there is no smoking in any restaurant, people smoke outside.... so if you open your window at night... all the smoke from outside finds its way up and in.... that is my only negative..... You must go to one of the old Hammams. This was in the top 10 experiences of my life! If you like to shop.... you will need a day in the old bazaar. Do not buy anything your first day. I waited till my 3rd day to find the best quality and the best prices. Do not worry that it is very high pressure.... I had my husband trail along and in Turkish say \" no money\"....by my 3rd visit, we got fabulous things at great prices.... much less than I would have paid if it was my first day. Do not miss the Harem section of Topaki Palace. This is a must. If the market is too overwhelming, start with the Spice Bazaar. If haggling is not for you.... the prices in the stores are the same as the best prices at the market. Just you will not find the selection. Alcohol is heavily taxed! Buy at the airport... drinks are more expensive then the most expensive restaurants in NYC...", "Date": "January 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cairo", "Title": "“In Sultania Hotel you will not find all what you need but MORE !.”", "Author": "decentman71", "ReviewID": "UR90922307", "Content": "Before I decide to make my booking via the hotel website I have seen too many reviews here saying that this hotel is really over rated , sometimes when you see something which seem to be TOO MUCH , you have some concerns , when I went there , I just discovered that all the positive reviews I have read were true and this hotel deserves to be over rated as in simple phrase ( Everything there is just perfect ) !.", "Date": "December 28, 2010"}, {"Ratings": {"Overall": "4.0", "Service": "4"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“I only this eat at the hotels resturant 3 times.”", "Author": "titravel", "ReviewID": "UR90557868", "Content": "Sultania Restaurant was excellent. Huyseyin and staff are top notch!!! If I come back a must stop and possibly stay at hotel.", "Date": "December 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Great Stay”", "Author": "Mohamed074", "ReviewID": "UR89752107", "Content": "The rooms are beautifully done. Very romantic. There a beautiful details which make the difference .. The staff are very friendly and helpful.", "Date": "December 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Excellent place to stay”", "Author": "sacrifice", "ReviewID": "UR89558825", "Content": "Without trying to contradict a review: excellent room, excellent location, excellent staff. However, in November where the weather is not yet cold the hotel shares central heating with three other adjoining hotels. The room thermometer was saying 30 degrees Celsius and you wake three or four times a night in a liquid sweat. Utterly uncomfortable. Any other time of the year you would think you found the small hotel of your life. great breakfast, brilliant staff, small but lovely rooms... but the heat. Why? Annoying that the staff known but are happy to let you baste. When you complain, they send up the porter who speaks limited English. Hey as a business man, I'd do the same...but it's a repeating problem obviously that should be solved.", "Date": "December 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Baku, Azerbaijan", "Title": "“Nice time and worm people”", "Author": "mehti", "ReviewID": "UR89277684", "Content": "It was very immpressive and me and my family got really leisure over there. We came from Baku and as we are actually themselves hospitality people of course this moment was very important for us. And our expectations got true. Staff were very friendly, positive, good-manner, easy-going. Any request had been tried to have done. Especially a lot of thanks to manager dealing to guests Mrs. Ozlem. If i have a chance again come to Istanbul I will stay there again. I will advise this hotel all of my friends, relatives and other persons who are going to this charming sity. Mehti", "Date": "December 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "albelinchon", "Title": "“Wonderful hotel and best place situated”", "Author": "albelinchon", "ReviewID": "UR88979008", "Content": "I enjoyed a wonderful stay at the Sultania. ItÂ´s 10 min walking from everywhere (Great Bazaar, Santa Sofia, Blue Mosque, Bosphoro) The hotel is quiet and the staff very kind. It depicts the hospitality of the Turkish people.", "Date": "December 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great Hotel to Start your voyage through Istanbul!”", "Author": "alexantoniou", "ReviewID": "UR86010928", "Content": "There isn't enough i could say about the service, location, the cleanliness, the hospitality food and overall chic of this Hotel. I would definitely go back. 5 stars and more!", "Date": "November 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Moscow", "Title": "“Very good hotel for romantic vacation!”", "Author": "Pashaslon", "ReviewID": "UR84775800", "Content": "Ok. I stayed in the Sultan Deluxe room. Very unusual room with big comfortable bed. There are many red lights, a mirror on the ceiling. Everything is perfect. Maybe it's not cheap for Turkey, but I liked it very much. If you want to have good time with your spouse, then do it in this hotel. Just one thing. It's better to have a map, because it's not easy to go amiss.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Feel like a sultan”", "Author": "Junglejane24", "ReviewID": "UR84031683", "Content": "Gorgeous hotel in the centre of the old city. Very friendly staff with the best breakfast ever!!! The rooms are beautiful and our little 3 year old loved the sofa bed. Excellent value especially if you deal directly with the hotel and pay in cash for a further discount. Extremely popular hotel, definitely will stay there if we go back to Istanbul.", "Date": "October 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Great location and quality rooms”", "Author": "Bobbim55", "ReviewID": "UR83887419", "Content": "Very friendly helpful staff and spacious, clean and well presented rooms. Unfortunately the room temperature cannot be individually controlled, so rooms are very warm at night. Restaurant has great menu and staff have good english and are very helpful and fun - particularly HÃ¹seyn!", "Date": "October 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Perfect location, great staff and service”", "Author": "BANDLSydney", "ReviewID": "UR83264114", "Content": "We stayed in the Sultania for three nights during a month-long trip round Europe, and were delighted with our choice. The hotel is very clean and quiet with great rooms - for a brand new hotel it has heaps of character and funky design features. It is in a perfect location to explore all the main attractions in Sultanahmet, with great restaurants on the doorstep if you don't want to go far after a long day exploring. The staff were all fabulous - friendly, helpful and genuinely welcoming. We would highly recommend it to anyone staying in Istanbul, and look forward to returning.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Fantastic stay at Sultania”", "Author": "RobgLondon", "ReviewID": "UR82705474", "Content": "The hotel Sultania was very comfortable and well equipped, perfect for our short break in Istanbul. The room was nicely decorated and lit and had modern touches such as an ipod dock and a tv hidden within the mirror. The bathroom was tastefully marble clad with a power shower. The breakfast was good with the highlight being the honey, fresh from a local village, still in the comb, sat pride of place on the bar. Fresh pancakes were also good with a rose petal jam. Those looking for home comforts might be disappointed with the tea and coffee though. Service was excellent, with all staff being extremely helpful. Guest relations were exceptionally friendly and genuinely cared about helping us make the most of our stay. Ozlem is a real asset to the team. I would highly recommend this hotel and will definitely be staying there next time I am in Istanbul.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Fantastic romantic place”", "Author": "groovy_j", "ReviewID": "UR81591012", "Content": "Sultania is a brilliant place for a romantic getaway. In the heart of Istanbul's old town, many of the top sights are within walking distance. At the same time, the hotel is very quiet because it is in a side street (in contrast to many high-street hotels in the area!) Hotel staff are very friendly, value for money is very good - we were actually upgraded to the honeymoon suite at no extra cost!", "Date": "September 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria, BC", "Title": "“Absolutely fantastic ... if they remember to pick you up”", "Author": "ajtraveller007", "ReviewID": "UR81403903", "Content": "This is a new hotel, only open a few months and I would highly recommend it. My only complaint is that they were suppose to pick us up at the airport and didn't. I overheard another couple at reception with the same complaint so this is something that needs to be ironed out. It was not appreciated after 22 hours of traveling. However, that is my only complaint and I would most definitely stay at the hotel again. The rooms are beautiful and have every convenience including ipod docks, flat screens tvs (hidden behind a mirror) with some english channels, irons, safe with plug inside so you can charge your laptop, facilities to make your own coffee and free wifi. The bathroom was huge with lots of shelf room. We were in a room with a balcony and it was great. Very large and very quiet. The breakfast buffet was excellent with even a large piece of honeycomb. The restaurant upstairs served delicious turkish food with the spectacular Hagia Sophia lit up as the view. The location was very central with all the major sites within walking distance. Even the ferry is not that far away. I have to mention Ozlem Kaya who is the guest relations officer. She is an absolute jewel, there to give you advice about your day and thrilled to be able to teach your turkish if you want. We had one problem with our key for the room and it was dealt with quickly and with every consideration for our comfort. The chambermaid dragged over an ottoman so that we wouldn't have to stand while we waited for the technician. Now that is service. So despite a rocky start I wouldn't think of staying anywhere else the next time I travel to Istanbul.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Highly recommend this hotel!”", "Author": "MsDaisy2010", "ReviewID": "UR79335178", "Content": "I stayed here for 8 nights end of august/beginning of september and I loved the following: 1. Service: Excellent service at all times. Especially by Guest Relations manager Ozlem Kaya, for whom nothing was too much trouble. She accompanied us to the local clinic to translate when my friend needed to be given an injection. Random acts of thoughtfulness throughout our stay by her and other members of reception staff such as Erdem. 2. Lovely clean rooms: just the right amount of space. Everything is brand new and works impeccably. complimentary tea, coffee, and small cups of still water refreshed daily. 3. 3. Quiet at night: Considering the buzzing location, the excellent soundproofing means you don't hear a thing in the rooms. Rooms were always impeccably clean when we got back after a long day out. 4. Location: pedestrian street off the main road. Minutes away from major sights. Lots of cafes and restaurants around. 5. The olive restaurant in the adjoining Yasmin Hotel (part of the hotel group) is excellent with a lovely roof terrace. The vine leaves I had there are the best i had in Istanbul and that's one of my favourite dishes so I tried it everywhere. The staff both in the restaurant as well as in the breakfast room are very courteous and professional. I would highly recommend the hotel.", "Date": "September 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Greenwich, Connecticut", "Title": "“Every detail of the Hotel was wonderful - I felt taken back in time to the era of the sultans.”", "Author": "lonetraveler80", "ReviewID": "UR78135157", "Content": "I can not give enough praise to the staff of the Hotel Sultania or to the luxury and comfort of the hotel. I was immediately greeted and made to feel very welcome. The very knowledgeable bellman who showed me to my room explained some of the details of the hotel and of my room. The ceilings in the hall were arched and ornate and reminded me of those that I had seen in the Topkapi Palace. As a novelty each room is named after a woman in the Harem instead of numbered. A paining of her hangs over the bed and a history of that particular woman is in a scroll that is given as a gift. The mood of Old Istanbul was completed with lovely paintings on the glass walls of the bath and a velvet cushion of Turkish Delight left on the bed. The entire hotel is beautifully appointed including delightful views from the roof where tea and coffee are served. I had lunch in the main restaurant and enjoyed a complimentary full breakfast - both were fresh and delicious. It is also a bonus that this hotel is located in the heart of Old Istanbul I had come from a stay at a highly rated hotel in the new city but I loved this hotel and when (not if) I return to Istanbul I would stay at no other place than Hotel Sultania.", "Date": "September 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Superb hotel in an excellent location and a First Class staff.”", "Author": "DaveHM8503", "ReviewID": "UR77912943", "Content": "We wanted to be in the heart of the city for our 3 day visit and Hotel Sultania fit the bill. Located on a street closed off to vehicle traffic. Within walking distance of the Topkapi Palace, the Blue Mosque, and the Grand Bazaar. A great buffet breakfast and wonderful food at the Olive restaraunt. However, the one thing that made this hotel \"stand out\" was the excellent front desk staff that guided us to excellent restaurants (made reservations) and valuable recommendations on places to go and things to do.", "Date": "September 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“First time, right choice”", "Author": "dave_reeder", "ReviewID": "UR77295193", "Content": "My first trip to Istanbul and I chose a great hotel to experience it. Very comfortable, very welcoming staff, nice touches everywhere, such a complimentary slices of Turkish Delight in a copper bowl to welcome you to the room. Rooftop restaurant Olive has stunning views of Aya Sophia - over the trees to the floodlight dome. One confusing element - Olive is shared by four hotels run by the same owners. Why not just make it a single hotel complex? Finally, it couldn't be closer to the key sites - five minutes or so up the hill to Aya Sophia and the Blue Mosque, the same down to the Bosphorus and the cruise boats.", "Date": "August 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "beirut", "Title": "“superbly pleasant”", "Author": "alostil", "ReviewID": "UR77052179", "Content": "superbly located in touristic Istanbul, friendly staff and (smiling Ozlem). Hotel clean, neat and very well serviced. very good restaurant on the top floor. room was spacious and superbly decorated with all needed amenities.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Treviso, Italy", "Title": "“Friendly and helpful personnel”", "Author": "daniela065", "ReviewID": "UR76665149", "Content": "Clean, modern hotel with ambiance. Very friendly personnel.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "STRASBOURG", "Title": "“A PERFECT LITTLE BOUTIQUE HOTEL IN ISTANBUL”", "Author": "JEAN S", "ReviewID": "UR75403441", "Content": "We hesitated to give our advice on the Sultania, for fear that too big a popularity would spoil this excellent hotel . We had selected the Sultania after having read the very positive comments on Trip Advisor and have in no way been disapointed . This boutique hotel, ideally situated in the old town, close to the major sightseeing places, is a little gem . You statrt with a most friendly and professional welcome . The rooms, tastefully decorated in Ottoman syle are large enough, many of them with a balcony overlooking the Bosphorus . The marble tiled bathrooms are worthy of a 5 star palace . Although there are more affordable hotels around, this one will give you excellent value for money and you will leave it with regrets, promising yourself you will come back ( Istanbul is a magic place you can visit a dozen times without getting bored ) . The service again is simply perfect with attentions that make you feel more like a friend than a guest ( do you know many hotels who send you a mail after you left to make sure you had a safe trip ? ) - with a special mention for Ms Ã–zlem Kaya, Guest Relation Mgr . Any \"negative\" comment ? Well, the Sultania seems to become very popular for Gulf visitors and somtimes the lobby looks a little bit \"veiled\" - but this adds some \"Topkapi's harem\" touch ... We just hope the Sultania will be as pleasant when we come back !", "Date": "August 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Perfect Lux Hotel for a family stay.”", "Author": "Marmari2010", "ReviewID": "UR75188162", "Content": "A great hotel in perfect location, Not noisy, near all tourist sites, metro station, restaurants, bars, shisha (nargile) chill out places and quaity suvanier shops. New & modern, but not pastic, nicely furnished with character, well fitted out with TV, audio equipment, LAN connection. However, most of all the staff are the nicest of any hotel I have stayed. If you are offered to stay in this hotel do not even hesitate. I will definately go there again.", "Date": "August 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "ireland", "Title": "“Lovely hotel, would recommend”", "Author": "me550", "ReviewID": "UR74587216", "Content": "Nice hotel, very clean and modern decor. The staff are very kind and have alot of pride in the place. Room was lovely, I especially liked the underlit bed! I would definitely use this hotel again when I am in Istanbul.", "Date": "August 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Munich, Germany", "Title": "“Not exactly perfect for the price”", "Author": "fastyak", "ReviewID": "UR74448194", "Content": "We planed our trip to Istanbul for one week of holidays and were looking for a nice and superior hotel in a good location. Since Sultania is a pretty new hotel we thought it would be worth trying it. Our arrival at the hotel was good, nothing to complain about. Although we didnt take the hotel shuttle with a price of 100â‚¬ one way from the airport, a total rip off!!! You get private shuttels for 50â‚¬ all over the place. Checkin was fast and without any problems. We had booked a room with a balcony which was on the fifth floor, a relativly large room, but since under the roof, a very low ceiling. The balcony had no view and was pretty dirty, old dishes on a table and waste on the floor, which, didnt change for the whole stay of 8 nights. The interior is some kind of neo-ottoman wanna be luxurious style, a bit kitsch but good in function. The flatscreen TV behind a mirror is a nice gimic although way too small for the relatively far distance to the bed. The bathroom all in marble was pretty ok, the hairdryer overheating all the time and quite annoying. The breakfast was for the price of the hotel not exactly perfect. Yes you have some fruits, fresh orangejuice and the honey is pretty good but all in all nothing special. I ve been staying an a whole bunch of four and fife star hotels in my life so I know what you can get for your money. So as a resumee, its a good hotel, no doubt, but not worth the money.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“A pleasant stay in Sultanahmet”", "Author": "Sunset71", "ReviewID": "UR73113531", "Content": "I originally stayed at Yasmak Sultan Hotel but one night was transferred to Sultania. This is a brand new hotel, my experience was short there; however, I can say that what impressed me the most was the stylish room beautifully decorated at the Ottoman style without missing the modernity to enjoy of a pleasant stay. Lights around beds, LCD TV, music, portraits with explanations of Ottoman Sultans' wives and a comfortable bathroom with delicate toiletries create a very special environment into the rooms. I think every detail included and ithe elegance and beauty make this hotel a very good option to stay in the Sultanhamet area for those who enjoy luxury very much. Like the other hotels of the group it offers restaurant at the ground floor but it is also possible to go to the restaurant at the roof terrace. There is a complimentary tea-coffee service in the room as well. All in all, a very modern an elegant place to stay.", "Date": "July 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Great location, but more style than substance”", "Author": "Junaid018", "ReviewID": "UR71702576", "Content": "We stayed in this hotel during our honeymoon. Firstly, the location is perfect, within walking distance of the major attractions in Sultanahmet (main tourist area). No need for a taxi, or even the tram. There is ample oppurtunity for sight-seeing, restaurants and shopping. The hotel is very new, and thus clean and tidy. The staff were very friendly. The room we stayed in was spacious. The room looked great, and very fashionable. However, it is more style than quality. The breakfast at the hotel was excellent, with an array of food to choose from, and fresh tea served by the attentive waiters. The hotel also has a roof-top restaurant, but we did not have time to try it. Overall, this was a very nice hotel, in the ideal location (albeit a bit pricey).", "Date": "July 20, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Chicago", "Title": "“Great Stay in amazing location!”", "Author": "rk-winelover17", "ReviewID": "UR71702555", "Content": "We randomly found this hotel during our trip planning and so glad we did. This hotel is in a perfect location for sightseeing in the Old Town. It is also a new hotel, and so the decor, appliances, etc are all new and feels modern. We were a little dissapointed that our room didn't really look like what was on their website, but overall pleased with everything. The hotel is very clean, serves a nice breakfast, has friendly staff, and we felt very welcome here. I would def. recommend this hotel to anyone!", "Date": "July 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Nice hotel, great deal”", "Author": "wagnerers", "ReviewID": "UR70661943", "Content": "We reserved a room at the Yasmak Sultan Hotel for two nights, but were upgraded to their sister Hotel the Sultania. The room was wonderful, and very large for Europe. The bed was very comfortable and the bathroom was amazing. The breakfast buffet was great. We arrived late at night and were shown to our room by a very attentive staff member who showed us everything from how to use the safe and hair dryer to the pictures on the walls. The pool, fitness centre and spa were not yet open. This was the nicest hotel all round that we stayed in on our 3 1/2 week long trip. We found a great deal through a canadian website (expedia.ca) and paid just under $100 canadian (which is just over $90 US). I would say that even double that price is worth it for the hotel. We stayed in Istanbul prior to this very close to the Hippodrome and that hotel was a little closer to the major sites like the Aya Sophia, Blue Mosque, the Palace and a lot of restaurants, however I got a lot of dirty looks in that neighbourhood alone and we found the Sultania to be in a better neighbourhood for tourists who aren't willing to wear long sleeves and skirts in the July heat.", "Date": "July 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“The ultimate place to take a baby!”", "Author": "MARYBRACKEN", "ReviewID": "UR69930379", "Content": "We stayed at the hotel Sultania for six nights. We are a couple with a six month old baby. The hotel itself is beautiful. Our room was spacious and relaxing with lovely lighting, decorated very nicely. Daily room service excellent, replacing things as we needed. Lovely TV, DVD and mini bar. The lobby and breakfast room are great, cool designs. The breakfast on offer each day is fresh, varied and tasty. Wonderful coffee and fresh fruits. There was also omlet made to order if you like and other cooked options. Fantastic fresh breads and pastries too. Traditional Turkish breakfast also. But the best part of our break was the wonderful service delivered by sublime staff. I can mention Ozlem and Arafa in particular but each staff member at every level was genuine, caring and lovely. Also the bar man in the evening and during the day was great. Our baby daughter absolutely loved this hotel and was given so much attention and love by the staff, who remembered her name and played with her with real affection every day. I highly recommend this hotel to anybody but especially to a family. The swimming pool and Turkish bath were not open during our stay but these facilities can only add to a fantastic place. The roof top bar is gorgeous and I recommend the Turkish coffee, presented beautifully. If you are reading this and trying to make a decision about a hotel, book this one, you wont regret it! These people have put a huge amount of effort and thought into this hotel and it deserves to be number 1 hotel in Istanbul!", "Date": "July 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sartell, Minnesota", "Title": "“Excellent Service and Staff”", "Author": "AbouNaji", "ReviewID": "UR69832325", "Content": "This hotel has a great location and is very comfortable but what is most amazing about it is the hospitality and quality of service you receive from the staff. I have stayed in hotels all over the world but have never been in a hotel where my family and I received such attention and outstanding service from hotel staff as in Hotel Sultania. We stayed at this hotel for ten nights and we really felt we were treated like family. My wife had an upset stomach and needed to be seen by a doctor so one of the staff members at Hotel Sultania went with us to the hospital and translated from English to Turkish and took us around the hospital to where we needed to go. She was a real blessing, without her I don't know how we would have managed to get around the hospital and communicate with the medical staff there. I was very impressed as well by the fact that the hotel management was willing to allow one of their staff members to spend her whole day with us in the hospital. This alone tells you how much this hotel values their customers. When my wife returned from the hospital to the hotel she was treated like royalty by the hotel staff and management. The hotel kitchen prepared special meals for her (rice and boiled potatoes) at no charge for three days until she got better. The hotel even had the food delivered to her room and again at no charge. Constantly the hotel staff would ask me how she was doing and if she needed anything in particular that they could cook for her. My wife recovered and we were able to enjoy the rest of our family vacation in Istanbul. The hotel staff were also very nice and showed a lot of caring towards our 15 month old son who was with us. If you are traveling with children you can be very confident this hotel is family friendly. When we left the hotel it really felt like we were leaving family behind. When we go to Istanbul again the only hotel I would stay at is Hotel Sultania.", "Date": "July 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Galway", "Title": "“Excellent”", "Author": "momo1984", "ReviewID": "UR69659625", "Content": "Loved the hotel. It's located in Sultanahmet old city area, next to a tram station , two steps away from Hagia Sofia, Blue Mosque and the Grand Bazaar. The room we got was a delux sweet, very stylish, spacious and clean. The staff is really friendly and helpful. Although it was in a busy area it is a quiet hotel.", "Date": "July 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "USA", "Title": "“Great Little Place”", "Author": "bulldogtwo", "ReviewID": "UR69003734", "Content": "I was so lucky, happy, to have found this place on the web. It is a small boutique hotel that is located within walking distance to the Grand Bazaar, Blue Mosque and Spice Bazaars. This is not the best hotel that I have stayed in, and initially I was a little disappointed as it looks nothing like the pictures on the web, not that they ever are! But the staff here a five star. Were it not for the outstanding service, their sincere warmth and great attitude, it would be just another hotel. The staff are what makes this place worth every penny, from the reception to the bellman. The rooms are comfortable, good size, not big but comfortable and cozy. The beds are extremely comfortable and the showers were great with just the right amount of water pressure with two different heads to choose from. Restuarants everywhere but stay at the hotel, they're roof top restuarant is great! I had the smoked salmon starter and it was so big that it was plenty for me for dinner that I had to cancel my salad. Really nice breakfast buffet in the morning and you can have it either in the restuarant or on the sidewalk while enjoying the people walking by and the weather. Good coffee which was really important. The only thing I wanted which was not ready was the sauna and gym which was still under construction. Overall this is a great place to stay, and when you compare the other hotels at the same rate, this is a real deal!", "Date": "June 28, 2010"}], "HotelInfo": {"Name": "Hotel Sultania", "HotelURL": "/ShowUserReviews-g293974-d1732739-Reviews-Hotel_Sultania-Istanbul.html", "Price": "$175 - $655*", "Address": "<div class=\"blBox\">", "HotelID": "1732739", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/9b/04/9b0429e38ac9a1808bf0d9da66e35b576large.jpg"}}