{"Reviews": [{"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Easy Sleep Gaudi-feel like a local in this comfortable apt, great for families, good location”", "Author": "Muge E", "ReviewID": "UR128293907", "Content": "We came here with our 2 school-aged children, and stayed for 9 days, in a 2 bedroom at 347 Valencia. The apartment looked just like the photos, though a little lived in (minor things like chipped dishes). There is a well-stocked kitchen with a microwave, toaster, gas range and full-size fridge. We had breakfast in the apt every day, and even had dinner twice when we were out of energy to walk around. There are several supermarkets close by, a bakery, and a large food market with fresh fruit, vegetable, and meat stalls. There is a washer and a drying rack, an iron with ironing board, and a hair dryer. You'll need your own shampoo and soap. The bedrooms and bathroom were small, but functional, and the common areas were spacious and comfortable, with a modern decor. We looked out onto a courtyard with 2 enclosed balconies with 2 chairs on each. The only noise was occasional from adjoining apartments. Internet access was very good- no problems. The staff who are on the ground floor of the apartment building all day, were great, very helpful, enthusiastic and friendly. Javier welcomed us and oriented us in detail, with lots of suggested itineraries. Geraldine gave us great restaurant suggestions, and answered all our questions. The location in Eixample is not in the thick of things (which I preferred with the kids), but you are very close to the Sagrada Familia and other attractions. We walked to many of the Modernist buildings, (which are near the upscale shopping district), and to the neighborhood of Gracia, which has many small plazas, and kind of a Brooklynesque vibe. Eixample itself is pretty, mostly residential, but with many restaurants, convenience stores and pharmacies on every other block, and scattered stores. Walking in the other direction, downtown, it is about a 1/2 hour walk with kids to the eastern edge of the old city neighborhoods, starting with the Picasso museum. You could choose from 2 metro stops within a couple blocks, but since we were 4 people, it was often only a few euros more to take a taxi. To the Picasso museum was under 5€ and to Montjuic was about 10€. All in all, we were very pleased with our choice, especially when the alternative was booking 2 overpriced hotel rooms with a mini fridge at best!", "Date": "April 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Great apartment and very helpful staff”", "Author": "Frampton T", "ReviewID": "UR126247354", "Content": "We loved our top floor apartment with balcony. We were centrally located near Sagrada Familia. Very helpful and efficient staff. Javier gave us great ideas for which sites and neighborhoods to visit.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta, GA", "Title": "“Easy Sleep (Valencia) Barcelona”", "Author": "IamCoconutty", "ReviewID": "UR121740112", "Content": "We stayed at the Easy Sleep (Valencia 347) for 7 days. Not bad! First of all- I should tell you that we'd never been to Spain before, and were traveling with two children. Also- I'd have given a better rating if 1. we hadn't just come back from Palma and stayed an INCREDIBLE(!) place, and 2. the Laundry facilities had a dryer. We aren't so picky- but it rained almost daily, and we had tons of wet clothes. We were blowdrying our shoes nightly, lol...and while they do provide a washer, without a dryer & 100% humidity, we could have really used a dryer. I would have traded the television.. You do have someone in the lobby daily if you have questions, and it's fairly easy to catch a cab, or walk anywhere safely. (We NEVER felt unsafe, walking sometimes very late with the kids. As much as you read about pickpockets and Spain, I was even leery- but we were completely fine at all times, with our iPods as cameras, even. We did pack some money in a waist belt for 'in case'- but that never happened). Quiet location. Clean. A couple tips about this location- A couple doors down- Crayon Cafe- Great coffee, excellent service. Ask for Willie. Super nice. You can get Cafe con leche for around 1.5 E. Also, the'r sandwiches and grilled veg is good too. They close then reopen 8 or 9. If you are staying here, this is really practical. Also, we had hot chocolate here with the girls often. My 9 yr old loved the crusty sandwiches with mozzerrella, tomato & pesto. ALSO- FOOD. I can't say enough good things about Restaurant Pep. They have the English menu right on the window- and around 11E you get appetiser, main, dessert, and a bottle of wine. (I suggest the veg. canneloni- super cheesy! And the rabbit & onions was great. They have different daily specials too) You find this place by walking a couple (2?) blocks down Valencia til you see the Mercat de la Conceptio, then turn in the side street between. It's behind another more modern place. The waiter is a fast & amazing marvel. We loved him. In a pinch, you have Poll Bo, a cheap rotisserie chicken place that doesn't close. They speak no English, but you can point if your Spanish is too bad. I recommend walking a few blocks and getting to know whats around you. Find the little grocery, etc. You can walk to Casa Milla and Sagrada Familia from here. Taxi to the Picasso Museum for us all was 5E total. CosmoCaixa is a great rainy day activity. (We spent 4 hours there- didn't see it all). Also, on Valencia, they have one of those Fish Spas, where you put your feet in the tank and the fish eat the dead skin. My husband thought we didn't have time, but for kids, this might be a cool thing to break up activities. Sometimes kids get bored of historical things; a gelato and an hour at the fish spa would probably get them going. Don't miss Montserrat or Ballooning- priceless. Enjoy your trip :)", "Date": "December 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great location and price”", "Author": "WolffieCO", "ReviewID": "UR121248049", "Content": "We stayed in the valencia location for 8 nights and you can't beat the location. We were a few blocks from the metro, the market and a couple of bakeries. The street was pretty quiet and the staff was helpful. The room was clean and looked just like the picture. Very happy with the whole experience.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Simple, practical, clean and so well located”", "Author": "annemahler", "ReviewID": "UR103961938", "Content": "I took a spring break with my son in Bercelona. The studio located on Carrer di Sicilia was neat, of the perfect size comfortable and clean. At only two blocks away from the Sagrada Familia, the apartment was at the centre of a great area of Barcelona. Most of Barcelona's touristic site where a walking distance. As well, two steps away we could find a grocery store, a pastry shop and cozy restaurant. I will rent this studio again for sure.", "Date": "April 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Good comfortable facilities, convenient location, reasonable prices”", "Author": "aliceapplepie", "ReviewID": "UR84717504", "Content": "We stayed in Valencia 4.3 for 28 days. Good things about the apartment include the convenient location, it is one block away from the Verdaguer station that carried lines L4 and L5 which meant we had good connections to most of the city. We were 10 minutes walk from Sagrada Familia and had half a dozen supermarkets and one fresh food market within a two block radius. The apartment was as it appeared in the photos and at 45m2 it was more than adequate for the two of us. The bad thing was that this is a road front apartment so you do get a lot of noise from the traffic. If you are a light sleeper it could be worth inquiring about an apartment facing the inner courtyard. However, as we were not able to find an apartment with an inner courtyard that was suitable for two people we chose Easy Sleep because they offered reasonable prices. I would stay with Easy Sleep next time I am in Barcelona, however, I think I would opt for the 40m2 apartment on Sicilia with the 10m2 terrace next time. This is only because we did have days where we wanted to enjoy the sun, while having the comforts of home within arms reach and surfing the web using the free wi-fi all at once. I am listing this part down the bottom of my review because the outstanding service that we received from Virginia deserves special mention. As our stay was reasonably long at 28 days she made suitable recommendations for beauty therapists when I asked. The service was attentive and professional and she should be commended for that.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Clean, comfortable, great location and a bargain !”", "Author": "fromaroundhere", "ReviewID": "UR72666397", "Content": "We stayed in the Valencia apartment #3.3 six nights and were very satisfied. It is a compact space, with only the basic equipment in the kitchen, but with some ingenuity I was able to make many dinners for the four of us. Despite the small square footage, we were surprised that the bathroom was so large! The location was great, close to a central metro stop, and the balcony and views gave us the feeling of locals staying in busy Barcelona. There are many small markets and bakeries just steps from the apartment, and a much larger super market a few blocks away under the \"farmers' market\". The in-suite clothes washer was a big plus as we had packed very light, I'm glad I brought laundry soap for those first few loads! The few down sides of the apt. was a small AC unit that really didn't reach into the bedroom and the busy street below that was active until 2 am most nights. If you are a light sleeper you might need an inner courtyard room. Oh, there is also a step from kitchen to living room, and another from toilet space to bathroom sink that can be treacherous if you forget about them.", "Date": "July 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montreal", "Title": "“Comfortable, clean, great location; beats a hotel anytime”", "Author": "JorgeB", "ReviewID": "UR69576155", "Content": "My wife and I stayed at the Valencia street location while we both attended a conference for two weeks in June. Our experience was very good. We were met as planned upon arrival and we were given all the information we needed. After that we never saw the staff again, but we did not really need anything. The apartment was very nice; clean and comfortable. It looked exactly like what was shown on the web site. Although the street was a bit noisy (all streets in Barcelona seem to be noisy) we slept fine as the AC unit could be turned on while we closed the windows. The jihj-speed internet (wireless) worked fine most of the time (occasionally it would cut out but only briefly). The location was really perfect. Just a couple of blocks from the Verdaguer metro station (corner of Bailén), and within walking distance of Passeig de Gracia. Best of all was the market which was barely two blocks away (Mercat de la Concepció). We are big foodies and the delicious seafood, veggies, and fruit to be had at this place were out of this world. Since the apartment contained a perfectly serviceable kitchen, we were able to make ourselves some great fresh fish and salads which is very nice when you're traveling, to eat some home-cooked meals. But there are also some terrific restaurants in the neighborhood so that is of course a big draw in this city. Another nice thing is that the place had a neighborhood feel, even though it is in a busy part of the Eixample. The bakery next door not only had delicious bread, but the owner was friendly and greeted us every morning as we got our freshly-baked croissants. Even the grumpy lady who runs the \"llegunes cuits i secs\" store on the corner came around once we bought a liter of her home-made gazpacho....mmmmmm.... All of this beats a hotel anytime, and for about the same price (we paid 95 Euros a night). Of course you get no services of any kind; no cleaning, no changing of linen, etc. But then again, the small clothes washer in the apt. worked fine. So if you want to be pampered this may not be for you, but if you like the feeling of home-away-from-home and especially if like to cook, then you cannot go wrong. O sea que, cualquiera que quiera pasar unos días en Barcelona puede disfrutar muy bien con este lugar.", "Date": "July 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Duesseldorf", "Title": "“ok-for a short time and for the price”", "Author": "Gulliver00", "ReviewID": "UR60424035", "Content": "We chose to rent and apartment in Barcelona because we were travelling with 2 small children and needed the extra space and flexibility of an apartment. The location is ok, about 7 minutes walk to Sagrada Familia, a good 20 minute walk from Plaza Catalunya, and the beginning of Las Ramblas, but taxis were relatively affordable. There are plenty of supermarkets and convenience stores around (within 10 meters). The apartment itself is not as nice as it appears in pictures. It is dark, the living room has two dim lights that are not enough to illuminate it properly for a sit-down dinner and there is no real view (kitchen and 1 bedroom windows face the inside of the building with view of the walls and drying laundry...). The place is clean but damp, and with a persistent smell of mold/toilet despite my best efforts to ventilate the place. The walls are paper thin so you can hear people talk in the neighbouring rooms. If they turn on the TV or music, it might be difficult to fall asleep. Easy Sleep Barcelona has a policy of no noise after 21h but I imagine it is difficult to implement it when the walls are that thin. The kitchen is clean, no oven but a stove and a very clean fridge and pots/pans/utensils were quite convenient. The \"italian coffee machine\" is not usable, probably has been used as an ashtray (?) because it smelled quite bad. Hot water for the kitchen and bathroom comes from a small boiler that can sometimes be overwhelmed by demand so you can easily end up with no hot water during your shower or you will have to play with the tap constantly to adjust its temperature. Service was good and friendly. All staff spoke English and were very helpful, storing our luggage after check out, ordering taxis and providing directions. Despite the negative aspects described above, for the price, I think it was still a good deal for Barcelona, considering the size of the apartment, the friendliness of the staff and the proximity to attractions.", "Date": "April 5, 2010"}], "HotelInfo": {"Name": "Easy Sleep Barcelona", "HotelURL": "/ShowUserReviews-g187497-d1733349-Reviews-Easy_Sleep_Barcelona-Barcelona_Catalonia.html", "Price": "0", "Address": "<div class=\"amenFloat\">", "HotelID": "1733349", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/be/f8/fe/easy-sleep-barcelona.jpg"}}