{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great hotel, great service”", "Author": "renimontreal", "ReviewID": "UR125627869", "Content": "My boyfriend and I just came back to Montreal after visiting Toronto for the weekend. We choose Homewood suites Hotel and it was great. Room very clean and staff friendly. Breakfast was great. Brenda and Marie made the best breakfast ever. Everything was fresh and we enjoyed our time in a very good environment. We highly reccomend this hotel for people visiting Toronto.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kitchener, Canada", "Title": "“A great place to overnight near the airport”", "Author": "TomTom_Tom", "ReviewID": "UR125595476", "Content": "As with any hotel, location is critical, and you should always check before you book. In this case, Homewood Suites is close to the Toronto airport, less than 10 minutes' drive on the free shuttle. It's not walking distance -- few airport hotels are -- and as the name (\"Corporate Centre\") says it's not a place if you want to be in a nightlife hotspot, either. But if you're looking for a place to overnight on the way to the airport, on the way back, or on an overnight connection, the Homewood Suites is a great choice. The hotel is on Eglinton West, next door to a Hampton Inn, convenient to Hwy 401. Parking is free, unlike many airport hotels, and stay-and-fly packages (allowing you to leave your car while on your trip and pick it up on your return) are well-priced. The hotel is relatively new and quite well-maintained, with spotless lobby areas and rooms. The Homewood Suites-standard rooms provide for a sitting area as well as a bedroom (studio suites combine the two in one room), with a flat-screen TV in each room. The bathrooms are modern and clean, and there is a kitchenette with a refrigerator and basic cooking facilities. The hotel is far enough from both the airport and the highway for the rooms to be quiet. The hotel provides a breakfast as well, but our flight left too early for us to be able to check that out -- typically Homewood Suites breakfasts are at the upper end of the free hotel breakfast scale, though.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Thomas, Canada", "Title": "“Absolutely stay here!”", "Author": "Owen87", "ReviewID": "UR124911535", "Content": "My wife and I were given tickets to the Jerry D comedy show (which was amazing) and we stayed overnight at this hotel. The room is a suite with a FULL kitchen, living area and excellent King bed. Everything was very modern and clean. We booked the \"girlfriend getaway\" which gave us a bottle of wine and $40 gift certificate to La Scala restaurant which was a great value. The rooms are very quiet and comfortable. Breakfast a complete hot menu including sausage, hashbrown and eggs. You won't regret staying here.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Montreal, Canada", "Title": "“A little to far from the Airport”", "Author": "Grandpa_Walton", "ReviewID": "UR124816498", "Content": "First time at a Homewood Suites by Hilton in the Toronto airport area and it was a very good stay! I found the hotel poorly located due to it's quite far from the Airport center and in the middle of a industrial/commercial center. There wasn't many restaurants or nightlife possibilities in the area without driving a good 15 minutes. However if you are looking for a a well appointed hotel(pool, workout center, etc) with reasonable rooms/suites, this is the hotel for you. I booked a two bedroom suite for $211 and you really can't find a better deal than that! The suite was clean and was really well done with two separate bedrooms with 2 complete bathrooms, Living room, and a kitchenette that was very well appointed. This suite would be perfect for a family or business partners traveling together. They have light supper and Breakfast buffet that seem to be of fairly good quality and is included in the price of you room. This is a great hotel but a bit too far from civilization(airport) for my liking.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "West Vancouver, BC", "Title": "“I've stayed at many a Toronto airport hotel - this one is the best”", "Author": "kayteeYVR", "ReviewID": "UR123763842", "Content": "Over the past two years I have had numerous meetings in Toronto, many of them at airport hotels. This was my first stay at this hotel. Here is my impression: Hotel facility: New, a 7 storey building with everything one might need for a comfortable stay (free wifi, well equipped business center, gym, pool, laundry facility, breakfast, shuttle service, even a simple dinner is provided Mon-Thurs evenings). Overall impression: Excellent. Staff: Everyone I encountered was friendly and accommodating. Overall impression: Excellent. Rooms: We had a one bedroom suite. It had a full kitchen, living room, large bedroom and huge bathroom. Two TVs. Pleasant decor and comfortable beds. Overall impression: Excellent. Food: The included breakfast was ample with both hot and cold choices and a self serve waffle station. One minor beef was that the plastic jugs used for milk and juice really didn't keep them cold. I can live with juice that isn't ice cold, but tepid milk isn't the greatest. I didn't take advantage of the free dinner, but took a look and thought it was more than adequate (soup, small salad bar, and a daily hot choice - beef stew and rice when I visited). The weekly menu roation is posted on the fridge in the room. Juices and soft drinks were provided (apparently wine and beer is available at an extra charge). Large trays are provided in the rooms for guests who want to retrieve food to take back to their suites - nice touch. There is a coffee/tea station in the lobby that is accessible 24 hours a day, which was also handy (no it isn't coffee house quality, but it is included). There isn't a full service restaurant or bar in the hotel. Overall impression of the food: Pretty darned good considering it is provided as part of the hotel rate. The dining area (which is just off the lobby) is open and inviting. Location: While close to the airport, this hotel is not directly on the usual airport strip. As a result, relatively few planes fly over the hotel, making it fairly quiet. The airport is accessible via service roads, making it unnecessary to go onto the major roads which can, in my experience, get clogged with traffic depending on the time of day. Driving time to the airport is about 10 minutes. The hotel is on the same property as a Hampton Inn, other than that I didn't notice many hotels immediately nearby. The area is a bit stark. It is mostly populated with warehouse type buildings, although there are some restaurants within walking distance, including a lovely Irish pub with decent food and a nice atmosphere a 5 minute walk from the hotel (and near that is a bowling center, of all things). The shuttle driver informed me that guests may request a shuttle to any location within a few miles, which makes shopping centers, a movie theater, and many other restaurants a possibility. Overall impression: A warehouse strip (not exactly pretty), but the things most travelers need aren't far away. Value: I thought the rates were very reasonable, particularly considering all of the inclusions. The hotel also offers a stay and park option which includes one hotel night, up to 8 nights of parking, and airport shuttle transportation. A great pre-vacation option. Overall impression: Excellent. Summary: In my opinion, anyone looking for a Toronto Airport Hotel should seriously consider this hotel. I recommend it highly.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Windsor, Canada", "Title": "“Great Property and Outstanding Service”", "Author": "Rick O", "ReviewID": "UR122628295", "Content": "The Homewood Suites on Eglington Ave is truly a wonderful experience. We just finished our holiday stay visiting family and I have to say that the service is amazing. Everyone in the hotel is friendly and courteous, and they always make sure that everything is running smoothly. The rooms are simply like coming home. The beds are comfortable, the kitchen is stocked with dishes and there is even a wide variety of channels to choose from on the tv. Having a living room provides that extra space that families really need. The hotel is very clean and bright from the rooms to the lobby to the dining area. The food is also really good. Breakfast offers a variety of choices and they even switch up the hot food choices on a daily basis. Dinner was fresh and provided a good selection. What a bonus! There is always coffee and tea available too. The pool area was clean and inviting. We really liked the fitness centre too, as it had the latest cardio eqiupment, a full selection of weights and even provided complimentary headphones. It was probably the nicest gym we have been to at a hotel. Overall, you will have a wonderful stay at the Homewood Suites. Once you come, I am sure you will be back again. I know we will.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "mx3man123", "Title": "“Excellent Hotel and great value”", "Author": "mx3man123", "ReviewID": "UR122487882", "Content": "My wife and I stayed at this hotel on December 17th 2011 prior to going to Punta Cana. We only payed $150 with tax for a night here and this is a very nice hotel. You can tell this hotel is newer as it still had that new smell. Check in was a breeze and our room was very clean and large. We went swimming that night and the pool area is very nice and so is the gym. We asked for shuttle service at 7am the next day and at 7am there was a shuttle waiting to take us to the airport. For the price we paid we were able to leave our vehicle at the hotel as well. The only negative thing I could say about this hotel was when we came back from the trip on Christmas night we called after we got out luggage to have the shuttle come pick us back up and we were told someone would be there in 15 minutes to get is. I called back 30 minutes later as the shuttle still had not arrived and was told he would be there shortly. For the time we waited for the shuttle I noticed a Comfort Inn shuttle van come by 3 times while we waited. When we did get picked up at Terminal one he said he had to check Terminal 3 for someone. There was no one there. On our way to the hotel the driver got a speakerphone call from someone at the hotel who sounded pissed off and told the driver he needed to go back to Terminal one to get someone else, by this time we were more then halfway to the hotel so he told the women on the phone it wasn't a good time to talk and that he would be at the hotel in a couple of minutes. I just found that whole interaction very peculiar and unprofessional. I would stay her again though as this is a very nice and clean hotel.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“\"Best Value\" of all Pearson Airport Hotels”", "Author": "Rvan58", "ReviewID": "UR120862645", "Content": "There is no doubt that this is the best value near Pearson Airport. At just under 2 miles away, it is near enough to be convenient yet far enough to be quiet. The hotel is new and is beautifully appointed and very well kept. The furnishings and fixtures are quality and the food and service is better than you might expect at a Homewood. The free hot breakfast buffet was fresh with a good selection and is served on china and silverware. The breakfast area is also a substantial size so unlike make other hotels there was no table scramble in the morning. The room is a good size and very well appointed. The full sized refrigerator is great to store everything and having a separate climate control for the bedroom is a really nice feature. Free parking is definitely a bonus for drivers as most other hotels in the area charge up to $25 per night. It has relatively easy access to all the major highways so it is a very good base if you need to get to different places around the city. I have tried most of the other airport hotels; this is definitely my new favorite.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, Ontario, Canada", "Title": "“Perfect for Family Weekend Getaway”", "Author": "Wesellsuits", "ReviewID": "UR119269899", "Content": "Planned a brief family getaway on Canadian Thanksgiving weekend for our family of 5. Homewood is a great choice because of their 2 queen bed plus sofabed suites. We were greeted right at the doors by staff, check-in was efficient and friendly, room was clean and quiet (at the end of the hallway). We arrived rather late after working all day (9pm), a little surprised we seemed to be in the \"boonies\" - not much closeby in terms of restaurants and such. Very close to LBP Airport (right off the 401), yet we didn't once hear any planes flying overhead when we were in our room nor any highway traffic, even at nighttime. Everything in our room was sufficient, two minor criticisms would be: fan in bathroom runs 24/7, can be quite noisy at nighttime; the a/c units are also quite loud - generally the sound would not bother us during the night, but these seemed particularly loud and everyone commented on disturbed sleep. Not a deal breaker, just seemed odd. Everyone was happy with breakfast: Morning 1 had veg. and western omelets, sausage, potato patties as the hot fare, along with the usual waffle iron, bagels, bread, muffins, pastries, fresh fruit/salad, yogurt, cereal, etc. etc. Morning 2 offered western omelets (guess they weren't a hit the first day), turkey bacon, Tater Tots, and hard boiled eggs plus all the usuals. Area was kept very clean and well stocked. Lots of tables for eating, we were pretty surprised because the parking lot was packed, yet hardly anyone at breakfast when we were there. Pool is sufficient for a casual swim/kids. Again, we were the only ones in the pool. No hot tub. Check-out was also very efficient. A comment about the staff: our teenaged daughters both commented that every time we walked past a staff member, they always smiled and acknowledged us (Good Morning, how are you, hello there, etc.) Very professional and courteous without being sugary and overbearing. The location of the hotel is a little far from downtown Toronto, but we knew that going in. We factored the travel time in (about 25 mins.) and just parked downtown as parking is inexpensive on Sundays/holidays (anywhere from $8-$13 for the entire day). All in all, it was a terrific weekend, and we would recommend this hotel based on our experience.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“weekend away”", "Author": "richdol", "ReviewID": "UR119225826", "Content": "Great place nice and clean . Very big rooms and super kitchen. great to base ourselves from then move around the city. Downfall: our room was close to the main road so noisy, also next to the housekeeping room which was really noisy in the morning. Then about 9am they changed a light in front of our door waking us up. was a bad start to our sunday. Dont think they had on demand which was too bad. .", "Date": "October 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Canada", "Title": "“Lots of space, great for groups!”", "Author": "claudemabish", "ReviewID": "UR118983614", "Content": "Overall, this hotel is a great value and the Homewood brand is definitely a good one. I would definitely stay at this hotel again if I am in the airport area or have a group of friends looking for another weekend getaway. Thanks a lot! CONS: -Hotel very far from attractions, extremely inconvenient to get downtown- waste of time and gas to get to preferred destinations -Hot breakfast choices not adequate (only 2 hot options per day) -Breakfast hours should run until 11am, as the checkout is 12pm -Doors in the middle of the 2 adjoining rooms did not stay open and no door stop available so constant banging of doors on deadbolts -Shuttle did not go very far other than airport, hotel should provide or give discounted options for transportation downtown -Disappointed didn't get to use \"Welcome Home Reception\" even though paid higher weekend rates PROS: -Very spacious accommodations for a group of friends on a weekend trip -Rooms very clean, housekeeping staff efficient -Furniture nice and up to date, comfortable great sized beds, rooms even had a fan! -Kitchen very adequate- full-sized fridge (with ice trays), dishes and silverware were great -Very impressed with housekeeping staff putting our dishes in the dishwasher for us -Plenty of breakfast seating even during end of breakfast hours -24hr free coffee and tea off lobby was convenient -Free local calling very convenient, especially for a corporate airport hotel -\"Suite Shop\" convenient lobby option for quick needs -Complimentary razor, toothbrush, etc from front desk very handy -Free parking at the hotel was a plus -Hotel shuttle very convenient to airport, \"Manny\" was great!", "Date": "October 5, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Colchester, Essex", "Title": "“Great place to start after long flight”", "Author": "GaryCopford", "ReviewID": "UR118259982", "Content": "We booked here as they are part of the Hilton chain, we were not disapointed. The check in was easy and quick, the staff very proffesional and the location excellent after a long flight. The rooms were big and spacious and had everything you need to get you off to a good start. They had breakfast and evening light meal included in the price. For a chain this was perfect, I would recommend this hotel to anyone.", "Date": "September 18, 2011"}, {"Ratings": {"Location": "3", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Toronto", "Title": "“Excellent stay at a good price.”", "Author": "Moutarde22", "ReviewID": "UR118038951", "Content": "Booked a room there for a little get away from the house. Got a room for $110, which is good for the area. Room was very large, had a king-size bed, a little kitchenette and a sofa bed. High ceilings make it look even bigger. They had a crib (with a thick mattress) ready for us since we were travelling with a baby. Breakfast was good and staff friendly. They share the pool with the Hampton Inn next door. Only drawback is the location. Not any restaurants or shops in a walking distance. Need a car. There's also a shuttle to Pearson airport nearby (but not close enough to hear the planes fly over your head). Would stay there again, for sure.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Toronto, Canada", "Title": "“Worst place I have ever stayed”", "Author": "jenn s", "ReviewID": "UR117803277", "Content": "I have never stayed at a hotel where the GM was the only person to check guests in. They need way more staff at the desk, especially with a tuck shop to run. Ramiraz Diaz was quite rude, not to me but with his fellow staff. There was a problem with my bill and he found out who did it and told me. Then he proceeded to discuss this employee with me in a negative manner. This is so unprofessional, I would expect way more out of the man running the hotel. I would like something done about this service and proof of disciplinary actions in this matter. Also, only one lady in the morning serving breakfast and one in the evening serving dinner. Was never asked if I wanted anything to drink because she was so busy being by herself. Greg, who seemed to be her boss was rude and very unwelcoming to guests. He was rushing the poor girl in the morning to clean up.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great Hotel - Very Pleasant Staff”", "Author": "DigitalRuth", "ReviewID": "UR117726931", "Content": "We used points to stay here and had an excellent experience. The room was exactly as described but it was the little extras that made the stay - and the staff let us have an extra-late check-out without an additional charge; the shuttle to the airport was free and easy to organize through the front desk; they had a DVD library of recent movies that we could borrow to watch in our room; and the breakfast was great. We'll definitely be back.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "ontario", "Title": "“Awesome place and great service”", "Author": "travelhunterOntario", "ReviewID": "UR117726337", "Content": "We had a 1 bedroom suite and it was excellent. Clean with lots of room. Big TV etc.. The service was great as well. Would definitely go back there again when in Toronto. Just call from the airport for the free shuttle.", "Date": "September 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent hotel!”", "Author": "Nama101", "ReviewID": "UR117337783", "Content": "This hotel was awesome! It's only 10 minutes away from the hotel. The staff is very friendly and rooms are very clean. The price was good for such a great hotel. Complimentary breakfast was very good they also have a free shuttle within certain amount of distance. Restaurants are on Dixie road which is only 12 minutes away. It is half hour away from cn tower, casa loma etc. I would stay here again forsure.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Like having your own apartment”", "Author": "brizzyguy", "ReviewID": "UR117335314", "Content": "This is a relatively newly built hotel in an industrial area, with lots of high voltage electricity transmission poles decorating the landscape. The hotel itself is very nice, with great friendly staff. It is very good value for families who need space, a kitchenette with full size refrigerator and cooking facilities/utensils. A large LCD TV is provided in the sitting room as well as the bedroom. Free Internet. Parking is free, but can be a bit hard to find if you are getting in late at night. Similar issue with the free breakfast. It's very good, but when busy, it is hard to get a table and also a longgg wait for the waffle machine (would it kill them to get a 2nd machine?) I found it very easy to drive to and around Toronto - avoid the 407 ETR if you are renting a car. There are no cash toll booths, so make sure you set your GPS to avoid toll roads. But if you do unintentionally get onto the 407, no big deal, as Hertz only charges $8.50 admin fee on top of whatever toll charges, and you will get the bill in the mail a month or so later. Pretty reasonable when compared to other car rental companies. It was a short 15-20 min drive to downtown Toronto, and I found cheap & easy parking at the Eaton center, $8 for several hours. The beds and pillows were very comfortable, and generally the hotel is quiet, except for the noisy plumbing from bathrooms above/below/next door. Overall, very good value, I would stay here again.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Great for large family”", "Author": "swiss2006", "ReviewID": "UR117234683", "Content": "This hotel was perfect for our needs. It is difficult for us to find accommodations suited for a family of 5 that will not put a huge dent in our budget. Our room was very spacious with 2 queen beds, a double pull-out sofa and a kitchen. Breakfast was included in our rate and had everything. The kids loved the make your own Belgian waffle area. The staff was great. We did not make it back in time for the complimentary dinner, so can not comment on it. Will be staying here again.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Very impressed”", "Author": "jayne S", "ReviewID": "UR117023957", "Content": "Stayed in a 2 bed suite. Lots of space and very comfortable. Staff were excellent. Very good service. Great laundry facility. Agree that the weekday breakfast should be extended to 10am to ease congestion and enable teenagers to make it.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lima, Peru", "Title": "“Very good hotel for the business traveler. I will stay here again.”", "Author": "SDBLima", "ReviewID": "UR116842320", "Content": "This is a great business hotel. Very close to the airport. The staff is exceptional! Very service oriented. The breakfast and dinner buffets are very good. The hotel has a free shuttle service that can provide transport to the airport or to place of work. In the summer, besides the regular business crowd, the hotel can fill up with families and wedding parties, especially on the weekends. The only thing to consider when choosing this hotel is the location. If not doing business in this area, or if there is not a need to be close to the airport, it can be somewhat isolated.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“Spacious suites and excellent complimentary dinner/breakfast!”", "Author": "Pomacentrus", "ReviewID": "UR116813429", "Content": "We booked a 1 BR suite but were upgraded to a 2BR on arrival. The 2BR suites are enormous and include separate en suite baths, a large living room, TVs in each room, and a good sized kitchenette. We arrived directly from a flight and were greeted with the complimentary 'welcome home' meal, which was fabulous (soup, rice, veggies, fish, juices, etc), especially appreciated as it was getting late and the kids were tired and hungry. Wine available for purchase during the meal. The breakfast was good, although it was packed and somewhat chaotic. The staff were very busy helping guests and refilling dishes, but there was just too many guests for the two of them to stay on top of. They were excellent and friendly though. I'd suggest the management consider extending the breakfast to 10 am to allow opportunity for business people and leisure travelers to eat at non-overlapping times. The pool was a great diversion for the kids, and the rec facilities are right across the glass from there for adults to work out while the kids are in sight for their swim.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "North Vancouver", "Title": "“Great Hotel Close to Airport”", "Author": "NorthVanDMo", "ReviewID": "UR116534656", "Content": "This attractive, clean and modern hotel is located close to the airport and freeway (but no noise from either). We could see Etobicoke's Centennial Park just behind the hotel so the location is great for walks and exercize. We had a one bedroom suite with two very comfortable queen beds in the bedroom and a pull out sofa in the living room. There were two flat screen tvs and a dishwasher along with the usual amenities. My only complaint about the room was a minor design flaw: you had to walk into the bedroom to access the bathroom, vanity and closet area. There was no restaurant or bar in the building but there was a restaurant nearby along with a conveniance store, a donut shop and a gas station (for filling up the rental car before return). The staff were very friendly and helpful on check in (providing us with a list of nearby restaurants) and later when we borrowed umbrellas. The complementary breakfast was first rate and was served in a very attractive room. Along with the usual toast, yogurt, and fruit, there were omelettes and sausages and a waffle maker. The hotel is attached to a Hampton (by Hilton). Both properties share a smallish indoor pool and fitness room. I got the impression that the Homewood was nicer - except it did not have a breezeway to shelter from the rain when loading our car (the Hampton did). We paid less for this suite than we did for a similar sized (and very dated) motel suite in Niagara Falls. Considering that the breakfast was far superior (as were the room furnishings and cleanliness) - this hotel is an outstanding value!", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sugar Land, TX", "Title": "“Great place”", "Author": "sfontenot1", "ReviewID": "UR116448631", "Content": "Conveniently located, 10 minutes to airport, 15 minutes to downtown. The property is very well maintained and has an excellent staff. They are friendly and helpful and obviously take pride in their work. The breakfast is great with plenty of clean and comfortable seating area and even provide a light dinner during the week. We had a two bedroom suite and slept 6 people very comfortably, the room had ample space, very well appointed, very clean, and an excellent value. This was our first visit to Homewood Suites but it won't be our last, we were thoroughly impressed. I highly reccommend for family accomodations.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Belmont, Massachusetts", "Title": "“Nice facility, good base for exploring Toronto if you have a car”", "Author": "tennesseine", "ReviewID": "UR116139127", "Content": "Decent hotel, nice (if not always the most knowledgeable) staff. Breakfast was not very good even by the low standards of a Homewood Suites buffet. Great value if you want to explore the area and you have a car.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Central NY", "Title": "“Toronto Airport Homewood Suites - Sweet!”", "Author": "TeqToo", "ReviewID": "UR115614068", "Content": "We have stayed at this hotel twice now - once in January 2011 and again in July, and we will NEVER stay anywhere else when visiting Toronto again! We had a lovely experience in January, which was why we made reservations for a one-bedroom suite at this hotel when planning a trip to see our favorite artist, Josh Groban, in concert at the Air Canada Centre, and the Labatt Center in London, ON. We planned two nights here in Toronto, and made reservations for a 3rd night in London so we wouldn't have so far to drive after the concert. Upon check-in we were informed that since we were a large family (four adults - my husband, myself, and my adult son and daughter) we'd been given a comp. upgrade to a TWO-bedroom, TWO bathroom suite. One look at the suite we'd been given and we asked if we could extend our stay by one night! Upon verifying that we'd be able to do so, we canceled our reservations for London (sorry, London!), and settled in for a three-night stay in what I have to say is THE nicest hotel suite we have EVER had the pleasure of staying in! The suite was spacious, impeccably clean, and quiet. The kitchen was well-equipped for our purposes - a couple of light meals taken in the room instead of eating out. At some hotels, we've had all we can do to get one set of towels apiece, but here there were plenty of towels made available, more than enough extra blankets in the closet (which may seem rather odd, considering Toronto was in the midst of an historic heat wave!), and all the customarily supplied items were there in sufficient quantity. The front desk staff was gracious and friendly, very helpful and unfailingly polite, as were the housekeepers. We encountered no problems during our stay, but if we had I have no doubt they would have been dealt with quickly and satisfactorily. The SuiteStart complimentary breakfast was among the best we've encountered at any of the Homewood Suites. Everything was fresh and well prepared. The first morning we were there, my husband and I went down during the last hour of breakfast (8:00 - 9:00) to have our own breakfast, and get something to bring up to our son and daughter, who were still too tired to go down with us. Things were a bit chaotic, as there seemed to be a large group of guests - all related - that had descended upon the dining area en masse. The breakfast staff had, perhaps, a little difficulty keeping up with their demands, especially in the area of the bread, bagel and pastry display. Almost as soon as the supply was replenished, there was a rush on the display. (One young man in particular, dressed in his jammie bottoms, seemed to be in a perpetual holding pattern, hovering over the pastry display.) This went on until long after the official closing time for breakfast. The staff had to finally turn off the light in the serving area to signal that breakfast was over. We were more amused than annoyed at the chaos, the only drawback being that the rest of our party didn't have much of a selection of pastries brought up to them. But that was a small thing, and wasn't really the fault of the kitchen staff. And despite the added pressure of the rush, the staff was very polite and attentive. The second and third mornings were much smoother, and there was an adequate supply of everything. The fresh fruit bowl was a favorite! All in all, we had a wonderful stay at the Toronto Airport Homewood Suites, and we will definitely be coming back any time we are in Ontario province!", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Greenfield, IN", "Title": "“Nice Hotel!”", "Author": "GreenfieldMom6", "ReviewID": "UR115482012", "Content": "We stayed here with our teen-age children for 3 nights. We had requested 2 queen beds, but received one king bed and a sleeper sofa. When we went back to the desk to ask for the 2 queens, we were told that they were full, and didn't have the room, and suggested that we had reserved the room on a 3rd party site, and that was why we didn't get the room we requested. This was not true, as I am a Hilton Honors member, and always us the Hilton website. In any case, we elected to keep the room we had because it was on the top floor, and much less noisy than the rest of the floors. The next morning, we had a good breakfast, which was complimentary (not much is free in Canada!), although very crowded. We then got directions from the front desk to the nearest subway stop, and made our way to downtown Toronto to visit the Hockey Hall of Fame. We loved it! The subway was easy to navigate, and we saw a lot of Toronto without having to drive and pay to park. We would recommend the hotel for families with children since they do have a nice pool, fitness center, and free breakfast.", "Date": "July 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Maidenhead, UK", "Title": "“Very Good”", "Author": "expectant customer", "ReviewID": "UR110062049", "Content": "Good size room, well furnished, clean and new. Comfortable bed - a good nights sleep. Only issue - a fan seems to blow in the bathroom, if you have the light on or off (and is noisy, even with the door closed) Can it be switched off? Breakfast OK on ground floor. Good service - could not find much to fault.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Woodstock, Canada", "Title": "“Great place, but stay on top of things...”", "Author": "jewel_hamilton", "ReviewID": "UR107660187", "Content": "Made our reservation a month in advance. My husband had a conference to attend at the International Centre, and my 2 year old son and I were tagging along for leisure purposes. My first question was if they have a shuttle to the International Centre. They said yes, absolutely. The second question was if we could reserve a room that had a door separating the bedroom from the living room (so our son could sleep and we didn't have to go to bed at 8 pm along with him). Again, they said yes. They quoted a rate that gave me $189/night for 2 nights, and $129/night for the third night. When we arrived at the hotel, we were told our rate was $189 for all THREE nights. I told them it was supposed to be $129 for the third night and I was asked to provide proof of this. Thankfully I had my iPhone with me and could call up the email on it that had the confirmation (just having the confirmation NUMBER was not enough). Once I showed them the email, the change was made - but I feel that I should not have had to do that - what if I didn't have access to my email on my phone? The girl who chcked us in was very nice about it, but I felt frustrated by the situation. When we checked into our room, we did not get a room that had a separate door. I called the front desk and apparently they did not have that request on the reservation, and they were not able to accommodate our request that evening. They said we would be able to switch rooms the next day, but I would have to be at the hotel 'sometime in the afternoon' to make the switch. I also inquired about scheduling the shuttle for my husband to the International Centre, and was told \"No, we don't go there - it's too far\" (despite being told previously that they could take us there, and despite it being literally right beside the airport). I protested, telling them that we were told it would be fine, and they agreed to take him. The room switch went well, but was frustrating that I had to do it in the first place. No discount/rebate was offered, but the hotel did send up a small gift bag with some snacks in it for the inconvenience. The first night, my husband called me 30 minutes after he was scheduled to be picked up by the shuttle, saying that they had not shown up. I left my dinner and went back to the hotel to see what happened. I asked the girl at the front desk if someone was on their way, and she said no. She didn't really offer an explanation or much of an apology - but she did offer to send someone right away. By this time, they were an hour late, and it takes about 15-20 minutes to get there. I declined and went to pick him up myself. For the remainder of the trip, I called the hotel half an hour before he was scheduled to be picked up to remind them to get him. We requested a late check-out, which we were told was just fine. They said we could check out at 3 pm. At 12, a member of the cleaning staff knocked on our door and said we should have checked out already. We told her about the late checkout and she said she had no mention of it, but did not protest it. Upon leaving, I called the front desk to ask for a bellman to come up and help with our luggage, and the girl seriously did not understand what I was asking for (to be clear, someone to bring up a cart and help us bring everything down). A maintenance person showed up with a cart but left right away. That is the end of the \"cons\" of our stay. I felt very frustrated at the lack of communication between the person who took our reservation and what ended up happening (to be clear, I called the actual hotel to make the reservation - not just the 1-800 number). I also felt that really, we should have been compensated for the mistakes that were made (past the small bag of snacks - which was nice, but kind of insulting). To be fair, I didn't ask for compensation, but it should have been offered. The staff were all very nice throughout the issues, and in some cases, apologetic (but not at all apologetic in others). The \"pros\": The rooms were very nicely appointed, clean and comfortable. It was wonderful to have the kitchenettes - especially when you're travelling with a little one. The cleaning staff were excellent - even loading and running the dishwasher for me (which I didn't expect them to do). The hotel breakfast was excellent each day - Gee is one of the friendliest people I've ever met! We did not get to experience the hotel dinner, but the menu sounded good. The pool and laundry facilities were great, although the pool change room (just a big washroom) left a lot to be desired!", "Date": "May 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tavistock, Canada", "Title": "“Great rooms, service, food, everything”", "Author": "Punkydoodles", "ReviewID": "UR106154101", "Content": "I stayed here with my 10 year old daughter and it was amazing! I never want to stay anywhere else. The suites are perfect as you have your own kitchen including full size fridge, microwave, cooktop, plates, pots, utensils, cooking ware, microwave and the best - a dishwasher! So, clean and tidy. We loved that the bedroom was separate from the living area. I find hotels really stuffy but the windows opened! We also could keep our bedroom cooler and the living area a little warmer. The bathroom is big and clean with a big mirror. Great lighting for my makeup. Everything was so clean - everywhere! The pool was great too. The breakfast buffet was really good, lots of choices and even fresh fruit. Our friends had the buffet dinner and they too loved that meal and enjoyed the salad (so many buffets feature fried foods) and they thought it was great value. The staff say hello to you and are really friendly. We were at this hotel for a hockey tournament and all the parents could not believe how fantastic this hotel was. I have never written a hotel review before but this hotel is well worth the stay! And, no, I don't work for them!", "Date": "April 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dubai", "Title": "“Home away from home...”", "Author": "nathindubai", "ReviewID": "UR105197744", "Content": "Excellent is all I can say in relation to our short stay at the Homewood Suites. The only problem was the wait at the airport for almost 90mins for the shuttle bus, which after a 14hr flight from the Middle East, was something we could of done without. But hey, these things happen, and once at the hotel we were in our rooms within 5mins. All staff we interacted with were polite and courteous, and our room was just what we needed after such a long day. The bed was heaven!!!! Complimetary phone calls, complimentary evening meal and breakfast were unexpected surprises, and very much appreciated. We will certainly use the Homewood Suites next time we travel to Canada.", "Date": "April 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great friendly service, excellent value”", "Author": "Beachgrover", "ReviewID": "UR102421352", "Content": "The rooms are spacious and clean with all amenities including flat screen tv and full kitchen. They offer a full breakfast with fresh fruit, juices, yogurt, cereals, and a revolving selection of hot items that included bacon, sausage, potatoes, eggs and waffles. Evenings feature a light meal until 7 PM. What sets this hotel apart from others is the service. The hostesses in the meal area are unfailingly pleasant and welcoming. They truly work at providing a \"homelike\" reception. Good value including the meals, morning newspaper etc.", "Date": "April 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, Canada", "Title": "“great service lovely hotel”", "Author": "herbster8395", "ReviewID": "UR96198976", "Content": "awesome service, clean, good food, great rooms. was impressed with the quality of food and the level of service. close to major highways and airport.", "Date": "February 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bridgetown, Barbados", "Title": "“Excellent Hotel on a Noisy Street--Ask for Room Away from Eglinton”", "Author": "FrancisUrquhart", "ReviewID": "UR91249933", "Content": "We loved this hotel. Traveling with two small children, we valued the space and the wonderful evening meal and breakfast the next day. Everyone was friendly and efficient. The knock on the door by the dour chambermaid at 08:00 was most unwelcome but our fault since we didn't put out the \"do not disturb\" sign. Since the hotel seems to be almost brand new, everything was in tip top shape. I did have some qualms about the quiet factor in the hotel. A vent in our bathroom blew air constantly at a noticeable level and was quite annoying. We could find no way to shut off the vent. We did close the bathroom door, which made the noise bearable but still persistently annoying. I would recommend asking for a room that does not face Eglinton Avenue. Our room (607) did face the road and we heard road noise until about midnight and then it started up again at about 06:00. I believe an even numbered room would put you on the quiet side of the hotel. Nice rooms and great food. We will likely be switching our allegiances from Residence Inn to Homewood. With our AAA discount it was about 20% cheaper than a competing Residence Inn in a nearby Toronto neighborhood.", "Date": "December 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Ottawa", "Title": "“Fantastic staff, very accommodating!”", "Author": "aimmi081", "ReviewID": "UR90906019", "Content": "Staff absolutely wonderful and eager to please. Arranged for shuttle to nearby mall to get a replacement suitcase when airline managed to totally destroy one, in time for next flight the following day. Complementary dinner a great surprise, and pretty good overall. Breakfast also good, with a range of options.", "Date": "December 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hampden, Massachusetts", "Title": "“Professional Staff that makes every effort to make you feel at home!”", "Author": "Java29_26", "ReviewID": "UR90057385", "Content": "From the front desk to sales and beyond, the staff is very professional, yet friendly and very hospitable. The breakfast and dinner offerings are great for those of us who are constantly on the road. Each person that I have had the opportunity to interact with has gone out of their way to make my stay as confortable as possible. The location is easily accessable from Pearson, and a short drive from the 401 or 427.", "Date": "December 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bowmanville, Canada", "Title": "“Welcoming, clean, modern and reasonable - great value!”", "Author": "mickeychickcanada", "ReviewID": "UR88666080", "Content": "We stayed here November 5th, 2010 before flying on a family vacation to Mexico. When we arrived, the check-in was quick and easy. The hotel is brand new and very modern and comfortable. The room was clean, and spacious. The beds are SOOOO comfy - we were afraid we wouldn't wake up in time! Our flight left at 6 a.m. so we had to be at the airport by 3 a.m. The clerk at the desk was sooooo accomodating and went out of his way to find a few yogurts and bananas for our teenagers to eat on the way to the aiport. THIS is the kind of old-fashioned service you expect but often don't receive anymore. Will be back next time we fly out of Pearson. Thanks for a great stay!", "Date": "November 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Ottawa", "Title": "“Great value”", "Author": "traveler536", "ReviewID": "UR82891749", "Content": "We were attending a conference close to the airport and I picked this hotel because of what appeared to be a reasonable rate and free wifi internet. We were not disappointed. Although to get to our Conference Center cost us about $22 each way daily by cab, the free breakfast and evening meal more than made up for this cost. If you have your own car, this is a great hotel to stay in. There are at least four restaurants within walking distance of the hotel. The rooms are large with a kitchen with a fridge, stove, dishwasher and dishes, cooking utensils etc. The bedroom is spacious with two queen size beds and a tv. The sitting room also has a tv along with sofas, a working desk and a small table that can work as a dining table. They even picked us up from the airport in their shuttle. The hotel is located very close to highways 427 and the 401 making it very accesssible. Overall a great hotel.", "Date": "October 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nanaimo, Canada", "Title": "“Wonderful Stay”", "Author": "bcjoanne", "ReviewID": "UR81968068", "Content": "We had never stayed at Homewood Suites before but read the feedback from other travellers and booked a week's stay. We were constantly pleased with the staff, facilities, and location. Our suite was kept very clean by the conscientious housekeepers. The breakfast buffet had something for everyone and the dinner (Monday to Thursday) was tasty and nutritious. Would definitely stay at Homewood Suites again!", "Date": "October 3, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Location": "3"}, "AuthorLocation": "Nazareth, Pennsylvania", "Title": "“Very impressed!”", "Author": "ScottfromLV", "ReviewID": "UR73599744", "Content": "Stayed here with my family in late July on a mixed business/pleasure trip. This is a relatively new property adjoining a Hampton Inn near the airport, so everything was looking shiny n' clean. We arrived in the midst of a pouring rainstorm. The entrance to the hotel is uncovered (unlike the Hampton Inn's entrance) so immediately after I checked in and was about to unload the car the woman at the front desk offered an umbrella which I appreciated. What separates great hotels from good ones is the small things and attention to detail, she could have taken my credit card, given me my room key and quickly moved on to something else, but took notice of where I was heading, what the conditions were and handed me the umbrella. We arrived a little late, and at the tail end of their dinner service. Traveling with two 6 yr olds, we asked about dining options. Mahreesh (sp?) a manager there offered to keep their dinner service open a little longer for us, but we didnt want to trouble them and figured stuffed green peppers and scallopped potatoes may not be a hit with the kids (even though it smelled pretty good to me!). Mahreesh then suggested to us a number of restaurants he thought would be worth visiting (we went with a very nice Italian place a few lights up Eglinton). The rest of our stay was wonderful, with the staff reccomending various places to visit and see in Toronto since this was our first visit. We took advantage of their breakfast every morning and enjoyed the wide assortment of items. As mentioned, the hotel itself is located near the airport which is to the west of the downtown Toronto area. I had a morning meeting there and was told traffic would be pretty brutal. The staff suggested I give myself an hour to get to a 8:30 meeting, and while the Thursday AM traffic was heavy I was in a parking garage on King St within 30 minutes. I'm not sure what the public transportation options are to and from this hotel. One thing I could see being a problem is that both this hotel and the Hampton Inn share the same parking lot and if both are relatively full spots could be limited, though it didnt seem to be an issue for us. Overall it was a great experience and would happily stay here again on a future visit.", "Date": "August 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barrie, Canada", "Title": "“Very nice hotel!”", "Author": "heatherp8307", "ReviewID": "UR69804283", "Content": "My husband and i only stayed one night before leaving for our honeymoon but let me say this was a very nice and clean hotel. the room was very nice bed so comfy. Great location from the airport, the shuttle service to and from the airport was nice. We would stay again!", "Date": "July 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Troy, Michigan", "Title": "“Incredible hotel & everything was nearby!”", "Author": "AlicePeng50", "ReviewID": "UR67540424", "Content": "Found out about this hotel because the Airport was sold out, and needed a suite for my family. This was PERFECT!! They had a full breakfast, and a nice light dinner which was great because I was tired and didn't want to go to through traffic to get breakfast / snack for the kids. They are a lot of restaurants nearby for Dinner, which is what we did, even though they have a kitchen in the room. The hotel suite was pretty big, very comfortable, clean, internet worked perfect, and my kids loved the TV / pool. Will stay again!", "Date": "June 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hamilton", "Title": "“Fantastic!”", "Author": "Rachel M", "ReviewID": "UR66559589", "Content": "I stayed at this new property just before the May long weekend. Upon arrival, I noticed the hotel was extremely clean, and the front desk staff were very friendly and welcoming. When I entered my room, a personalized letter and a bag of FREE goodies were waiting for me! Anything free has my heart, that's for sure. We stayed in a king studio suite, the smallest suite they have, and it really wasn't all that small! Full sized fridge, dishwasher, sink, cupboards stocked up with dishes, utensils, and pots and pans. There was a very comfy couch in the room, a desk and a flat screen TV which could turn both towards the bed and the couch. The bed was beyond comfortable, I could have spent the rest of my life in it. The only thing I didn't love too much about the room was that the toilet and shower were in the bathroom part behind a closed door. But you had to basically walk out of the bathroom to the sink and mirror which were in an open area. There were a few things to do within walking distance. About a 5-10 minute walk away was a plaza with a Mr. Sub, Tim Hortons, bowling alley, and some ethnic cuisine. I would definitely recommend the sushi place! I had to pick someone up at the airport that night, and it was only about 10 minutes away.. a VERY easy drive! When I asked the gentleman at front desk for directions to get there, he offered the hotel's airport shuttle to me. Very kind, but I declined. Breakfast in the morning wasn't too bad! A little more than a typical continental breakfast. Bagels, muffins, cereal.. but they also had hot eggs, bacon and hashbrowns. Overall, it was a fantastic place to stay.", "Date": "June 5, 2010"}], "HotelInfo": {"Name": "Homewood Suites by Hilton Toronto Airport Corporate Centre", "HotelURL": "/ShowUserReviews-g155019-d1747697-Reviews-Homewood_Suites_by_Hilton_Toronto_Airport_Corporate_Centre-Toronto_Ontario.html", "Price": "$135 - $204*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">5515 Eglinton Avenue West</span>, <span class=\"locality\"><span property=\"v:locality\">Toronto</span>, <span property=\"v:region\">Ontario</span> <span property=\"v:postal-code\">M9C 5K5</span></span>, <span class=\"country-name\" property=\"v:country-name\">Canada</span> </span> </span> </address>", "HotelID": "1747697", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/40/45/0d/homewood-suites-by-hilton.jpg"}}