{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Location": "4"}, "AuthorLocation": "São Paulo", "Title": "“Good value if you don't mind to walk”", "Author": "AussieInBrazil", "ReviewID": "UR124480606", "Content": "We chose Villa Urbani based on location and price and were not disappointed. We found the Gold Room good value for money at EUR100 per night. The Villa is about 10 mins walk uphill from the popular Trastevere neighbourhood - close enough to not worry about transport provided you're fit, far enough to get away from the crowds when you're done sightseeing. I can understand that some travellers would find the hostess, Laura, a bit aloof. But I found her service professional and her prices honest in a city that isn't really known for either quality. I would stay here again.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kent, Connecticut", "Title": "“an enchanting stay in rome”", "Author": "igoldspiel", "ReviewID": "UR121299570", "Content": "located in trasavere is the fabulous villa urbani. chic neighborhood, chic owner and wonderful acoomodations. the value is tremendous. 150usd. The rooms are large, tasteful and comfortable.the palazzo has been completelty updated. a large common area to have breakfast in. Laura the owner is most helpful. Marcello and his wife often help with breakfast and maintain the property and gardens. The pictures on line do not do it justice. if you truly want to experience rome as a city this is the place to stay.", "Date": "December 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melle, Gent", "Title": "“Pleased again !”", "Author": "pascalvr", "ReviewID": "UR120854285", "Content": "Since several years, my wife and I go on an annually trip to Rome, last year we chose for the first time Villa Urbani as B&B. It has pleased us so much that we went back this year, and we have no intention to change that for our future trips. It’s a very beautiful palazzo along a nice boulevard with large trees from which it’s a 5 to 10 minutes walk to Trastevere. If you’re not too keen on walking you can decide to take the bus that takes you to the centre, the bus stop being only at 1 minute away. The B&B has large comfortable rooms, nicely and tasteful arranged and disposes of a very nice common place were breakfast is served or where you can relax, listening to music or reading in one of the interesting books of the library. Laura is a charming person, interested in art and culture in general and is eager to help you if you need any information. Pascal, Belgium", "Date": "November 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Seattle, Washington, United States", "Title": "“Hit the right note”", "Author": "Jennifer P", "ReviewID": "UR119692634", "Content": "My visit to Rome this time was a quick one (just one night) which was a shame as I would have loved exploring more of the neighborhood in which this bed and breakfast is located. The room I stayed at was small, but beautifully decorated, comfortable, and quiet. I loved the walk home from dinner with friends over the river, through Trastevere and up the hill to the Villa Urbani a jewel box of a mansion in a neighborhood with huge graceful trees and winding roads. I slept like a baby! Laura provided a delicious breakfast and suggested that I head up the hill for the \"view\". Wow. A panorama of the city all to myself on a crisp day in October. As a note to other visitors - yes, there are stairs, but the staircase is large and elegant and easy to climb/carry cases. Walking is the best way of transport in this neighborhood (which I love - how else can you stop and drink it all in?), but the bus stop to get you to the center of things in mere minutes is only a few steps away. When I return to Rome I hope to stay here again and will recommend to friends.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Toronto, Canada", "Title": "“Agree with last review - hands down!”", "Author": "456_11", "ReviewID": "UR119193060", "Content": "Totally agree with last review posted by dhs13! It is a beautiful home - but Laura lacks the warmth and friendliness you would expect at a minimum for running a B&B. We had little to no access to her and on the odd occasion (if we saw her) her responses to the questions we had were short and it seemed like we were interrupting her. When asked about a place for dinner she handed us a business card - turns out it was a dear friend of hers who owned the restaurant. Tastevere is a magical place - but she had given us skimpy directions to get there and we only found what we were looking for on our last night - so unfortunate as she wasn't able to direct us properly. No maps were available and no time spent helping out write out the directions. Breakfast was minimal at best - and 3 times it was served up by her Gardener! Hellooo! She was nowhere to be found and we would have appreciated seeing her in the morning before heading out to see the sights. Only accepting cash caused us great dismay not to mention the need to go into town to withdraw from bank. She should be more up front about this and it also leaves one to wonder why is it cash only (if you get my drift). There are so many other B&Bs in this area that we could have stayed in and regret spending our time and money at this one.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "South Florida", "Title": "“Americans and ANYONE physically challenged-STAY ELSEWHERE!”", "Author": "dhs13", "ReviewID": "UR118811848", "Content": "My husband and I are frequent travelers and this was our fourth trip to Rome. I chose this B&B because I saw a small writie-up in Travel and Liesure touting the nice decor and the owner's background. What a mistake! First, the good: The rooms are clean and the property is a beautiful mansion in a quiet neightborhood. Now, the reality.We arrived and were met by the owner, Laura Urbani. She was pleasant and showed us to the \"guest\" entrance and up TWO fights of marble stairs to our room. We are in good shape, but there is no other access if you have a disability. There are only 3 guest rooms and a good-sized sitting/breakfast room. The AC was off in the sitting room and the hall areas- our room AC, luckily, was turned on. After showing us to our room, we asked about a place for dinner. ( It was about 6 p.m.) She handed us a a card for a local restaurant and I asked for a map. She had none. I asked about transportation- she vaguely suggested we walk, yet she gave no directions?! She then excused herself and we started to unpack. We had some questions and went looking for her or anyone else. All of the downstairs doors were marked \"privato\" and no one answered. We finally rang the front door bell and she came out, looking surprised. We asked directions again and she directed us toward the closest area of local restaurants. It involved walking about half a mile including down 66 steps and large landings down the side of a large hill. We had to take this route every time we wanted to get to anything and obviously, we had to return UP these same steps to get back. The hotel sits in a very hilly residential area of Trestavere. We liked the Trestavere area and ate there most nights, but the hotel is HIGH ABOVE the main area of Trestavere and not easily accessible. Breakfast was continental: some orange juice, (no fruit), croissants, (one type of preserve), and coffee or capuccino. The capuccino was very good. At breakfast, we saw Laura again. We asked about local information and instead of having anything on hand, she directed us again to the information booth in Trestavere which was about 3/4 mile away walking DOWN the steps and toward the river and the main part of Rome. Then, she said \"If you don't have any ,more questions, I'm going to walk my dogs\"- and she disappeared! She did this every morning. It became a joke between my husband and myself. If we hadn't been to Rome before, we would have been lost! IMPORTANT: You can book your room using Paypal, but paying the balance of your bill will require cash. She doesn't take credit cards. AND, although there is a TV in the room, there are no channels in English- only a few and only in Italian. BOTTOM LINE: If you stay here, don't expect any service or much help and plan on spending a fortune on cabs or wasting a lot of time just getting into the main part of Trestavere. For sightseeing, the location is poor and the owner, although she's nice, has no idea how to run a bed and breakfast.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great place in a quiet, pretty neighborhood”", "Author": "rgam", "ReviewID": "UR118394464", "Content": "Villa Urbani is an oasis in what can be an overwhelming, crowded city. Tucked into the Trastevere neighbourhood, this hotel offer large rooms in a calming, beautiful environment. Rooms have high ceilings and simple, stylish decor that make you feel at home. Music almost always is played in the common room, perfect for relaxing or a dance after dinner. An outdoor seating area provides an escape from the city in a peaceful, neighbourhood environment. Many restaurants and bars within walking distance -- and great walks all around this hotel provide views of the city. Owner Laura is responsive, helpful, and has created a great \"home\" for visitors to her neighbourhood. The only caution is for light sleepers as windows allow in much light in the morning and sound of the road (motorbikes, cars). We highly recommend this Hotel and look forward to visiting again should we find ourselves back in Rome.", "Date": "September 20, 2011"}], "HotelInfo": {"Name": "Villa Urbani", "HotelURL": "/ShowUserReviews-g187791-d1758754-Reviews-Villa_Urbani-Rome_Lazio.html", "Price": "0", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Viale 30 Aprile, 2</span>, <span class=\"locality\"><span property=\"v:postal-code\">00153</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "1758754", "ImgURL": ""}}