{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Not just great Granola!”", "Author": "travelkaze", "ReviewID": "UR126650717", "Content": "Overall, great vibe, fab location, near great restaurants and shopping! Imperial No 9 very good, some wait staff inexperienced and not always attentive however, others went above and beyond. We loved their house granola and on our last day, much to our delight and surprise, were presented with some to take home with us by the hostess who was amazing. Last minute Broadway tix were procured easily, thank you, it made our stay extra special, and with 2 teenagers, even they were impressed!", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Boston", "Title": "“Great views, great location, great vibe”", "Author": "stomachdoc", "ReviewID": "UR126610028", "Content": "Played hooky with my wife for a couple of days in NYC. Great location in Soho. Very friendly staff at check-in and throughout our stay. Were upgraded to a suite, wall of glass overlooking the city--fantastic! The bed was comfortable and the room came with an iPad for accessing hotel services, information. The room had some scratched paint from furniture/chairs being moved and the light colored couch was showing some dirt/stains, but this was all really minor. All in all, would highly recommend the Mondrian.", "Date": "March 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "DC", "Title": "“If Hotel W is a Terrier, Mondrian is a Poodle”", "Author": "Keithcu", "ReviewID": "UR126508068", "Content": "...but a nice poodle. The most striking thing about this hotel is its color (white and blue predominantly) and flamboyance (think big, fluffy feathers). I couldn't believe the pictures on the website were for real, but they were. I found it a little silly but secretly kinda liked it (not so secret any more). -- The hotel is well located in SoHo just off of Broadway -- we had a pleasant walk from battery park in less than 30 minutes. -- The rooms are small but well appointed and functional. I liked the large shower, comfortable bed, and window that actually opens. The desk and sink were really squeezed in making it hard to use either effectively. -- The room boasts lots of technology. You get an iPad, but it didn't appear to have an Internet browser loaded (huh?) and an iPod dock, but I couldn't get mine to work. Internet will cost you, which is one of my big pet peeves. The flat screen TV had as many channels as I have at home -- bravo! Overall, the Mondrian is to be recommended for anyone looking to stay in SoHo or points south.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Fort Worth, Texas, United States", "Title": "“Artsy with little function”", "Author": "Jim S", "ReviewID": "UR126278728", "Content": "Let me say that the location is OK if traveling up the east side or central Manhattan as the appropriate trains are right there off canal but if venturing up the West side, those canal street trains(1-2-3-4 or A-C-E) are a decent walk away and not really convenient. Arrived prior to family with 4 LARGE bags for the week, the hotel has a funky gardeny entrance that sets the actual front door 25 yards off the curb, no bell man in sight to help and as I approached the door he finally appears after chatting it up with others at entrance>> this is likely a management issue rather than bell issue, with that distance from curb to door you simply need to make sure there is always someone on curb,,,at ~$400/nt that expectation is minimum I suspect, even if its just to flag a cab. Rather than running to flag a cab my wife was urged to do so,,,see the $400/nt comment above. Crosby is a side street so catching a cab there is likely not happening unless you are catching a cab after a drop off. Desk staff, especially Catie were awesome and super accommodating, Kelly in restaurant same thing,,just really friendly and nice. Joey, our exiting bell man was great, lugged a ton of stuff for us and packed the car. Room was clean, fresh, cool as you'd expect from Mondrian, the only watch out is staying there with 3 in room gets tight and also the major issue is the translucent bathroom door, morning comes quickly as the shower is really a clear window to the world as well which turns the lights on well earlier than we'd like. Not sure that every room has the same door, I'd ask if you enjoy sleeping in on vacation. Food in restaurant was very good, just couldn't get up to eat it more than once. If returning to area I may stay again if alone or with wife only, tough call, we were lucky with good weather for walking etc otherwise getting to trains and cabs would be a major issue. With other Luxury near by and Sheraton Tribeca around the corner for value not sure I'd do Mondrian again. Also this was a business and pleasure trip,,,poor for business in room, just not equipped as many of the hipster places are not for business. Weird, got free wi-fi for a day or so and then charge screen appears to get charged??", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Greensboro, North Carolina, United States", "Title": "“So hip in Soho”", "Author": "Justin C", "ReviewID": "UR126229469", "Content": "Not far from the Holland Tunnel, we wove our way into Soho in search of the Mondrian Hotel, where we had reservations. On our first pass down Crosby, we missed the place. From ground level, it's easy to do. The signage is small and hard to spot from a car. That's the beginning and end of my complaining. Signage on this ultra-modern, upscale property should be more prominent on both Crosby and Lafayette. This would certainly help with walk-in restaurant business. But once we found our way and got up to our 21st-floor room, we knew we were in a special place. The Mondrian has a cool, hip vibe from the low lighting to the stark colors to the ceiling-to-floor windows in the guest rooms. We had a 180-view of Lower Manhattan. Gorgeous, especially at sunset. The amenities are what you'd expect in an upscale brand though our room wasn't spacious. Still, it was comfortable and pleasant to be in. The real draw here is the location -- in Soho within a few blocks of Little Italy and Chinatown. Two-minute walk to a subway stop that will take you wherever you need to go. Fabulous shops and restaurants within an easy stroll. This is a great, convenient hotel location for business or leisure travel. Just one thing -- make the signs bigger at street level so people know it's there!", "Date": "March 17, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great Location!!”", "Author": "K C", "ReviewID": "UR126154398", "Content": "We just stayed at this hotel from March 11th to March 14th 2012. The hotel is in a fantastic location and we were greeted with smiles from the cute bell boys. The decor is very cool and still feels warm, especially the restaurant at the entrance. The lobby is on the second floor which is inconvenient. The staff at the front desk were nice but didn't explain anything about the services offered or the Ipad that comes with the room (which was great) but we had to call and ask a million questions that should have been answered before they were asked. The room was small, king bed on the 23rd floor but the bright light and amazing views made up for it. The bed was really comfortable and I would stay there again.... but not eat there... the room service for 2 burgers and water was $77.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great - if a little noisy!”", "Author": "Johnnythirkell", "ReviewID": "UR126122635", "Content": "Nice hotel which is let down by the paper-thin walls. Decor is quite funky (maybe even trying a little too hard?) but the staff are first class. Very attentive and professional. My room was a deluxe and, although it was nicely appointed and bright and airy, it was a little on the small side. However, the whole place is let down by the fact that you can pretty much hear every word being said in the next room - especially if you have two excitable girls next door intent on discussing their respective boyfriends. If it weren't for that I would have given it a 5. This is the third time I have stayed there though, so it can't be that bad!", "Date": "March 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "new hampshire", "Title": "“best room service menu”", "Author": "sasnhe", "ReviewID": "UR125883401", "Content": "The room is small but sensually designed with a great shower, comfortable bed and many interesting adult items available on the room service menu. Because the hotel is on the upper floors of the building, there are great views of New York City.", "Date": "March 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Warsaw, Poland", "Title": "“Perfect place to stay”", "Author": "MayaJohnny", "ReviewID": "UR125880582", "Content": "Great hotel and really great spot if you want to explore the city. Really close to the subway - in a great neighborhood, close to lots of nightlife. The hotel is extremely modern, with really helpful and friendly staff. The rooms are extremely comfortable with cool extras like an iPad in the room that you can use to find stuff to do while in NY. Only drawback was that the rooms were kind of small, but that really wasn't too big of a deal. Overall, awesome hotel, highly recommended", "Date": "March 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Comfortable and friendly, but a case of style over function?”", "Author": "thatblokeDon", "ReviewID": "UR124860648", "Content": "Stayed for a week while my wife was on a business trip and I was on a break, so we experienced the hotel as a business traveller and holiday guest at the same time. On both counts the hotel met our needs, though on both counts it also fell a little short. Highlights: - Great location, right in the middle of SoHo. Easy to get uptown, downtown and everywhere else. - Very friendly staff. Good service as you would expect. - Great bed, great pillows (very important), and very clean. The amount of blue in the room and hotel can be a bit overpowering at times though. - Good view if you get a room on a higher floor. - Quality TV and sound system with ipod/iphone dock. - iPads in the rooms for guests to use. - Decor was nice but might not be to everyone's taste. Questionable: - The design of the rooms. Don't know what the other rooms are like but ours was a strange design with very thin walls. The bathroom is basically screened off rather than walled off so privacy could be an issue for couples who are just getting to know each other, if you know what I mean, plus you can hear other guests sometimes. - The entrance way to our room was a wasted space where they decided to place the bathroom sink. Hmmm. - All rooms have a shower instead of a bath. Apparently you can ask for a room with a bath so remember to do so if you want one. - Our room had a tiny table so if you want to do some work in the room it can be a little difficult to spread out. - Room service prices. I don't know what the prices are like at other hotels but $50 for a simple breakfast of fruit, eggs and coffee seems a little steep to me. Tips: - Ask for a higher room. - Ask for a room with a bath if you want one. - If on a business trip, don't expect to be able to work in your room too much as the tables are tiny. - Eat out. There are plenty of amazing restaurants within walking distance of the hotel that are much cheaper than room service. Conclusion: A very cool hotel in a great location. Not the best room but definitely does the job, and the beds are fantastic. The hotel bars downstairs attract a hip crowd that can be a little too cool for school, but hey, that's New York.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pennsylvania", "Title": "“Thoroughly enjoyed the Mondrian Soho”", "Author": "dramamama56", "ReviewID": "UR124740019", "Content": "Stayed for one night while in the city -- and are so glad we did. The room had a wonderful view (thank you for the complementary upgrade to the 21st floor). The white with blue accents theme is so restful, comfortable bed, spotless contemporary room. Thoroughly enjoyed and recommend!", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Perfect Comfort”", "Author": "Jeninyc967", "ReviewID": "UR124690333", "Content": "I just checked out from the Mondrian Soho after an extended stay so I had a chance to really get a feel for this hotel. Realy great location tucked into a quiet street in Soho. Super, super staff - genuinely friendly, very professional, really helpful and nice. There was zero attitude at the Mondrian. They were there for you if you needed something - but not too over the top. Perfect balance. I had a great room over looking the city with a backdrop of the Hudson - very clean. The gym is compact and offers everything for a full workout. The restaurant has a beautiful atrium - and on Saturday afternoons offers live music. Great Saturday lunch spot. Love the breakfast and lunch menu. I completely would recommend the Mondrian Soho to friends and business associates coming to NYC. I travel extensively around the States and OUS - I now would look for a Mondrian property first. Thanks for a super stay.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Great great Great trip”", "Author": "jbwheat4", "ReviewID": "UR124640663", "Content": "We planned a quick trip to NYNY to celebrate my birthday. We decided to stay in a different area for us, and chose this hotel, being familiar with the Clift, Mondrian Miami, etc. We requested any available 'special extras,' as it was an event. They went above and beyond, they gave us an upgrade, amenity, etc, etc, They were very nice in all areas, bellstaff, reception, concierge, restaurant, and lounge. We like it so much we are going back the first weekend of March for 3 nites!", "Date": "February 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "TEL AVIV", "Title": "“Great location , friendly staff”", "Author": "YHZTelAviv", "ReviewID": "UR124406721", "Content": "Hi - Its a new hotel in Soho ,AAA location, just off Broadway ,The rooms are good size for NYC (book the king size room) , great and helpful reception team ,nice & small GYM ,Hip bar .reasonable rates for Soho.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Santa Monica, California", "Title": "“Excellent stay!”", "Author": "MellieBe", "ReviewID": "UR123988091", "Content": "I stayed at the Mondrian for 3 nights in January. I was offered a complimentary upgrade to a suite - the room was just fabulous (spacious, clean, everything I needed). The service was impeccable and you can't beat the location. A wonderful stay and look forward to coming back.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“small & chic”", "Author": "onejkm", "ReviewID": "UR123663944", "Content": "We stayed in the Mondrian for two nights and it was perfect for a quick party weekend. The decor is girly and adorable, all silver and blue. The staff was most helpful from the time we arrived until the time we left. Would definitely return.", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“World Class Service!”", "Author": "Andre W", "ReviewID": "UR123580101", "Content": "I honestly can't say anything bad about the service I received from this Hotel. as a hospitality student at Roosevelt University I am exceptionally critical of properties, but they delivered great results on a constant basis. The staff was EXTREMELY friendly and competent. I changed rooms to upgrade and they were more than willing to assist me. In addition, the place is REALLY well decorated. The restaurant is one of the most beautifully decorated places I have ever seen. It was like a palace. Finally, the location is the most ideal. It's truly the best location because of proximity to the subway, great food and great shopping. I woud stay here EVERY time I come to visit NYC", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fabulous hotel in a great location”", "Author": "agnes188", "ReviewID": "UR123222995", "Content": "We just came back from an excellent stay at the Mondrian. Our expectations were fairly high due to fab reviews, and every single expectation was met. The staff were incredibly polite & friendly dressed in relaxed outfits (jeans, trainers). We had a room with the most amazing views from the room and bathroom (how often can you see the Empire State whilst having a shower?)....and we loved the in room ipad! The overall decor is beautiful and quirky and the restaurant/bar is like an amazing indoor garden. There is a laid back non imposing atmosphere, I wish all luxury hotels were like this one and location is perfect, bang in the middle of Soho super close to Excellent shopping, restaurants and walking distance to many great places - we will def come back and have already started to recommend!", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Winston Salem, North Carolina", "Title": "“Upscale Hipster at Its Best”", "Author": "cupecoy", "ReviewID": "UR123172952", "Content": "My husband and I (who are both in our 40s) stayed here overnight mid-week after Christmas. The entrance to the hotel is lovely--a long ivy-covered tunnel, with limited signage, so it pays to know the exact location ahead of time. It is a very brief walk from several subway lines. The \"lobby\" is small and looks like a somewhat disorganized parlor from \"Alice in Wonderland,\" complete with furry lamps, velvet upholstery, and ornate dining chairs haphazardly strewn about. I kept having to look out for the heavy metallic dining chair that always seemed to be sitting awkwardly in the most direct route from the elevator to the front door. There is a small concierge desk in the lobby but no indication of the elevators or a registration desk. The elevators are located in an alcove hidden from view in back of the lobby. All the reviews that talk about the dark elevators are absolutely correct. It is so dark in the elevators that you have to be sure to push your floor's button before the doors close and you have no light, because the buttons only light up when pushed. While many of the other details of the hotel seem like borderline hipster silliness, this detail is way over the line into complete silliness. However, this detail can be overlooked by the wonderful rooms. Yes, the rooms are indeed small, but the decor is fabulous. The minimalist blue and white paint and white bed linens gives the room a light, airy feel despite its small size. The floor to ceiling windows also afford terrific views and expand the vistas of the room. The room is designed for maximum efficiency without sacrificing luxury. We had a deluxe king room. The marble shower was high end and large enough for two (even three possibly :-). The toiletries were Malin and Goetz and were a nice touch. The wet bar also had a small pharmacy tray stocked with essentials such as a \"mile high kit\" and ibuprofen. No standard plain water glasses, cut crystal stems were de rigeuer. What else can I say? There were no noise issues whatsoever. The heating/HVAC worked wonderfully. The location was very convenient to South Broadway shopping and Chinatown. Many terrific restaurants were in easy walking distance. If you want to catch a cab, exit the back entrance onto Lafayette--tons of cabs available. All of the staff, every single person we met who worked there, was unfailing pleasant and wished us a good stay. I don't think I've ever stayed in a hotel with such a gracious staff.. In the end, while my husband and I felt a little old for the hipster vibe of the hotel, it was fun and a little campy. Definitely high-end hipster.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Seoul, South Korea", "Title": "“very small room but beautiful view and perfect location”", "Author": "ECO_minnie", "ReviewID": "UR123054875", "Content": "Good - perfect location, - great view of downtown Manhattan if you are on the higher floor(i was on 24th) - kind door man - very neat and modern interior Bad -really really really small room and the bathroom (but organized neatly) - wifi was not working on my computer/ mine worked totally fine in other hotels i stayed the day before and after - I am not sure of the service of the front desk people, they said they will find out about the two beds room but never got back to us/ the phone didn't work in the beginning so I had to go down to the front desk whenever I had problem and they didn't say sorry/ internet didn't work so I went down to tell them and they asked me to bring it down again (really?)", "Date": "January 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Illinois", "Title": "“Form over function”", "Author": "tktchr", "ReviewID": "UR122969778", "Content": "Pretty but completely nonfunctional. The conference room on the lobby level runs hot and cold. Literally. One minute I'm freezing and the next minute I'm sweating. There are weird stretchy cloths on the conference tables that look cool but are incredibly annoying because you can't stretch out your legs. The water's supposed to come on automatically in the bathroom but sometimes I stand there trying to figure out how to get it to come on. I felt like I needed a flashlight to find the right floor in the elevator panel. It feels like someone designed the hotel, looked to make sure it looked cool, but didn't try anything out.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Breda,", "Title": "“Amazing Views”", "Author": "AMHunton", "ReviewID": "UR122726359", "Content": "Just stayed 2 nights at this great hotel. Amazing views, cool furnishings and great Soho location, just near the canal st metro stop. We booked a standard king, but had a room on 24th floor, so the view from the ceiling to floor windows was to die for. The room size is more than enough for 2 nights, tiny bathroom, but clean and really, do you need to spend too much time in your room in NYC? I don't think so. what they had was modern, trendy and chic! I'd stay again, a real treat would be in the summer where they have a great outdoor bar/restaurant. Well done.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Maryland", "Title": "“Nice Retreat in Soho”", "Author": "seeingtheworld22", "ReviewID": "UR122711343", "Content": "Booked this hotel for a one night getaway to NYC thru Priceline after Christmas so I got a good deal. This hotel is very comfortable and off the street. They're going with a blue and white design so it's very appropriate during the holidays. Our room was small but adequate. The king sized bed was great, they provide you with an iPad, which is great when scoping out places nearby to eat, the shower was great and we had a nice floor to ceiling window, which makes the room seem bigger than it really is and we had great views of the city! The location is great - right in Soho and next to Little Italy and Canal Street. The metros are only a couple of blocks away. Overall, this is a great hidden gem in Soho.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tokyo", "Title": "“blue blue blue.”", "Author": "ap0k", "ReviewID": "UR122674340", "Content": "had a great stay at the mondrian soho. surprisingly not noisy considering the clientele( corner room ) pros: - location is phenomenal. if you like to shop, drink and be near chinatown, this place is perfect. - very hip, cool rooms and decor with ipads inside( for hotel amenities ). - actually way cheaper than the standard, which i consider a peer. - bell service people are super helpful - is it me or is everyone who works here super hot? cons: - small rooms( but everywhere in NYC is ) - water main broke in the room next to us, so the hall was a bit wet. hopefully a temporal thing.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Trinidad y Tobago", "Title": "“A treasure in SoHo”", "Author": "caribartTT", "ReviewID": "UR122674152", "Content": "Planned on spending Christmas and New Years in New York City rather than the Cairbbean where I live... No IM not crazy, just a change of pace. I usually stay in the midtown/Times Square area whenever I visit the city, but not this time. Wanted to try something different. I got a great \"advance purchase\" deal as a member of Tablet Hotels and booked 2 rooms for our 11 nights stay. Upon arrival, we were greeted with a wonderful smile and courteous reception of the doorman who took our luggage and showed us the way to the lobby on the 1st floor. Easy check in and we even took advantage of a room upgrade to a suite for another USD80.00 per night. I figured our deal was so good, that I could add on the room upgrade and be comfortable in a larger room. All NYC hotel rooms are small. Loved the room, the cal or harmony in the room with the crisp white contrasting with the royal blue. Bed was probably one of the most comfortable hotel beds I've slept in. There were ample drawers in the dresser and bed to unpack and put away our clothes. The only thing the is no space for the empty bags which I wished I could store for the 11 nights. But we made it work. Our room was a King Suite with separate sitting area, floor to ceiling glass windows looking west over Crosby Street with a glimpse of the Hudson River. The shower was a bit voyeuristic with a big glass window to the city. I don't know what kind of peep show I was providing for 11 nights. But I was not arrested. House cleaning staff were thorough and non-invasive and courteous. The dining room at Imperial No. 9 is beautiful. Rustic and elegant at the same time. A Garden Green House with crystal chandeliers, best suited for an organic/farm to table restaurant. But it is not. The menu is seafood and we did dine there for one dinner and 2 breakfasts during our stay. Very peculiar food, unappealing plating and outright unappetizing. What a pity. Thankfully we are in SoHo and there was ample dining choices all around with amazing food. We did a Thai Angel delivery to our room one rainy night. Excellent thai food from next door. Some restaurants I'd recommend which we ate at are: Certainly BALTHAZAR at Crosby/Spring for Breakfast, but try and make it before the crowds come from 9. Lunch are L'ECOLE Broadway/Grand, and then dinner at DAVID BURKE KITCHEN Thompson/Grand St, ABC KITCHEN 18th/Broadway, TAMARIND (Indian) Hudson/Franklin in Tribeca and as always a must do for us is always lunch in the dining room at THE MODERN at MOMA. Some misses for us was Kittichai, Gramercy Tavern, Chin Chin and Dim Sum at Oriental Garden. None of these lived up to the hype. Will review each later. The staff at all levels of the Mondrian Soho were wonderful. All the guys at the door, the concierge, the hostesses at Imperial No. 9, the Front Desk team and house-keeping. TO the manager of the hotel. Your team works in good harmony. The bonuses of a stay here were the in room IPAD with free Wifi (if you use your own computer and tablet you will have to pay for internet) Its great location on the fringe of Chinatown, Little Italy and in Southern SoHo. The location to walk to shops is perfect. Look forward to a future stay at this property", "Date": "January 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Roswell, Georgia", "Title": "“where is the vent in the bathroom?”", "Author": "linda_bp", "ReviewID": "UR122229582", "Content": "Perfect service and very gentle employees. My room was really little. I do not like the idea of the sink in the bathroom; it reminds me the design of the early XX century rooms. I think it is a choice depending on the few available square feet. Furthermore in my bathroom there was no working vent; fact that doesn't make any sense. The shadowy entrance will be very cute in the hot New York summers. Although I like the boutique hotels, this one seems more suitable for Miami. This is my taste though.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4"}, "AuthorLocation": "Australia", "Title": "“A delightful place to stay in SoH0”", "Author": "sarahxxxAustralia", "ReviewID": "UR122223989", "Content": "I was delighted by the SoHo Mondrian. The rooms are lovely but small (this is NYC so what do you expect). We were upgraded without asking which was fantastic. We had a corner room on level 16 and the view was amazing! The hotel is modern and funky - the bar is fantastic, the room service menu is interesting and delicious. We loved the service", "Date": "December 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Syracuse, NY", "Title": "“Not our cup of tea”", "Author": "PickyTraveler32", "ReviewID": "UR122196629", "Content": "We stayed at the Mondrian Soho for one night, booked through Priceline for $175 for 3 people. Unfortunately, they gave us a room with only one bed, so we got charged another $60 to get a room with two double beds! Yes, they had an iPad in the room, but any info you may want (like where is the workout room?) has to be found on their website...which is not intuitive at all. We had a great view (16th floor) and the location in Soho is really nice, but we had a rotten taste in our mouth for getting charged extra. The bathroom door doesn't lock, and the shower had a door that didn't go wall-to-wall...I guess that's their \"upscale\" look. Couldn't use the workout room once I found out it was on the lower level, because the room was freezing cold. I can tell you that this is definitely not a 4-star hotel in our book...but some may like it more than we did. Our $175 room was really a $235 room, and definitely not worth it for us.", "Date": "December 28, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“In-line with the cost. Overly trendy at times”", "Author": "mikeyp626", "ReviewID": "UR122180307", "Content": "My overall rating isn't nearly as telling as my qualitative review below. Just a little background about myself, I lived in Manhattan for 5+ years and now live in the Back Bay area in Boston. I am an urbanite through and through and tend to like nice things although I wouldn't call myself extravagant by any means. If you are looking for a hotel for leisure in order to get the true NYC experience, this is it. Unfortunately, I was traveling to NYC for business and not for pleasure. This hotel has everything that you would look for in a true NY hotel - dim lighting, very trendy room, and very lively \"scene\" in the lobby of the hotel to get you in the mood. These are all things that I try to avoid on business as I just want to be comfortable and get a good nights rest. I found the dim lighting a little annoying and the close quarters/trendy set-up of the room was a little uncomfortable. Location was right in SoHo so no complaints there for the business or pleasure. This review may not be fair, but I hope it was helpful in making your decision on whether to stay here or not. It was a cool spot, but it wasn't the right spot for my particular purpose.", "Date": "December 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Darien, Connecticut", "Title": "“A perfect style-lover's retreat”", "Author": "suehax", "ReviewID": "UR121992562", "Content": "From the thrill-inducing canopy over the entryway to the i-Pad equipped rooms to help you manage your room and stay, the Mondrain Hotel is a design-lovers treat. With lamps thats remind one of a Dr. Suess creation and a restaurant that is pure beauty, this style-conscious traveler was so happy being there, she almost didn't want to leave. But you must, as the hotel is located in very now South Soho. Surrounded by great retail and restaurants, it is also convenient to multiple subway lines a few blocks away on Canal Street. Staff was lovely, rooms small but luxe. We loved it.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cluj-Napoca, Romania", "Title": "“Helpful & great staff, adorable hotel overall”", "Author": "Merllinn", "ReviewID": "UR121849396", "Content": "Although we had a short stay (2 nights) we felt great at Mondrian Soho. Located about 300 m from Canal tube station, that takes you directly up to Central Park South (7th with 57th st), the hotel is located between Soho and Little Italy areas. Plenty restaurants if you wish to have dinner out, friendly area to walk even during the night and quietly located on a side street. Staff were extremely helpful and nice, among the friendliest I have ever met ;). The interior of the entire location (lobby, rooms, restaurant, even the elevators) is very chic and, although on blue, I found it very warm. There is no need to say that this is a very clean place. Again, big plus for the staff...", "Date": "December 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Whimsical trendy atmosphere, great stay”", "Author": "LANinaK", "ReviewID": "UR121720385", "Content": "We stayed here for two nights and had a great stay. The staff, every single one of them, was extremely friendly and helpful. The decor is whimsical and fun - lots of blue and white, feathered lamp shades, giant Alice In Wonderland-style mirrors everywhere. The restaurant with it's atrium glass roof and bird theme was beautiful. I only ate a small snack there but the menu selection was first rate. The scene on Saturday night was young and trendy, with a packed bar and club. The room we had (801) was small but comfortable and well organized. The wall of windows made it bright and friendly. The bed was very comfortable - I'm a sucker for big white comforters. The bathroom, with it's floor to ceiling frosted glass wall was also bright as well as clean and roomy for the size of the room partly because the sink was on the outside - sounds low rent but instead was a clever design. It's in a great location between Soho and Little Italy - on a quiet street yet in the middle of everything. My only complaint would be that the elevators were so dark. It was actually hard to see the buttons! I would definitely recommend it for someone looking for a boutique hotel feel and I will definitely come back.", "Date": "December 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Albany, Ohio", "Title": "“Supremely Accommodating Staff, Comfortable, Convenient, Trendy”", "Author": "OSU_Sux", "ReviewID": "UR121609662", "Content": "Had to spend the night on last minute's notice and the bell and front desk staff were terrifically accommodating and gracious. The lobby is beautiful, a bit confusing at first but creates its own intimacy and sense of \"know\" for the returning guest. Dined at the bar, bartender gave amazing dinner recommendations that are off the guidebooks, wish I had taken her name, she recommended Meatball Shack and Fish, went to the former, great great choice, highly recommend. The bar/restaurant is among the most pleasant for an evening honestly would have liked to have more time to hang out there. The rooms are comfortable but this is NYC and they are small. Too much junk is placed on the vanity and side tables, but all-in-all the closet takes care of storage needs. Bed is very comfortable, cool shower amenities, had never seen that brand before. Love the location because in SoHo of course, but also VERY convenient to the Canal Street subway line. Getting a taxi a little more challenging however. Would definitely stay again.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Smelly corridor/room”", "Author": "Lenski123", "ReviewID": "UR121591329", "Content": "The 8th floor where I was put smelled like the smell you get when you walk on the pavement and you pass the air vents from a restaurant - that smell of fat/gas/cooking/vinegar/ammonia. Gross. The doors were not insulated so the smell form the corridor came into the room, as well as the noise of the lifts stopping at the floor with \"ding\" each time. The rooms were the tiniest I had ever seen, but that's par for the course with one of these achingly hip hotels. Otherwise the hotel is in a great location in Soho.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent hotel in excellent location attentive and friendly staff”", "Author": "Grahamlittlejohn", "ReviewID": "UR121532634", "Content": "Stayed here for 4 nights in december , loved the hotel with great views. Lost my wallet first night I was here and staff found it on the sidewalk and made sure I got it back completely intact . Hugely greatfull of the honest and helpful staff . Visited New york for last 8 years around christmas and stayed in soho in several boutique hotels .The Mondrian rates amongst the best. A definite return visit for me next time I am in town", "Date": "December 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Bit of Miami in a New York setting”", "Author": "ElevenBus", "ReviewID": "UR121431328", "Content": "The Mondrian Soho is a very pretty small hotel in a great location. The rooms are tiny, but this is not exactly atypical for NYC hotel rooms. The design does make use of the small space, with a scaled down slipper chair, built-in drawers underneath the bed, a sliver of a desk, shower with no tub etc. If you are a light packer and a somewhat agile person this shouldn't be a problem. This design aesthetic is very \"Miami\" -- pure white and ocean blue everywhere, a bit of glitter here and there. We stayed when it first opened so everything looked pristine, but over time I would imagine it would be difficult to maintain this look. The restaurant looks like a solarium and is just gorgeous. We didn't eat here but the drinks were good. Service was good.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“great penthouse views come with disappointing service”", "Author": "Jenny F", "ReviewID": "UR121398413", "Content": "I held a group dinner event at the penthouse and although the views are stunning, the service and food was a disappointment. Planning was difficult due to an inexperienced and overly casual special events coordinator who didn't seem to write anything down. The menu was changed on me the day before the event and even after making a fuss; they still continued to make their own subsitutions without any discussion or explanation! The service was unprofessional and sloppy; most likely due to the young, untrained kids on the wait staff. If you're looking to throw a casual party with stunning views and don't have much concern for details; this is the place. Otherwise, look elsewhere.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Berlin, Germany", "Title": "“cool new hotel”", "Author": "10179k79", "ReviewID": "UR121359168", "Content": "The Mondrian Soho has just opened and still feels very new. Cool design throughout the hotel, bright and airy white/blue/marbe color scheme in the rooms with floor-to-ceiling windows. Despite its young age, the hotel has already managed to attract a good crowd to its restaurant/bar/lounge on the ground floor nightly, creating a vibe that is pretty cool and not as drab as most hotel bars. On the flip side, while the decor of the rooms looks good, it is not very practical in many respects. Tiny sinks on top of the mini bar right next to the door with bad lighting serve as the bathroom. Closet is so close to the bed that it is basically inaccessible. Rooms are small even by New York standards. No serious sound proofing, street noise could be heard loudly even on the 22th floor, wide gap under door letting all conversations and service elevator clanking from the hallway into the room, and thin walls. However, overall this is a good place to be, and with the current pricing one of the best choices in New York.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent service and great location!!”", "Author": "Happy_Go_Lucky744", "ReviewID": "UR121336799", "Content": "We stayed for 5 nights at the Mondrian Soho and had an amazing time!! The rooms were clean with a huge bed and equipped with iPad and free wireless which really helped!! The staff were amazingly polite and helpful - best service I have experienced in NYC! Location is great for shopping in Soho and easy access to the subway. We received a great deal via booking.com. Thank you for making our stay so enjoyable!! T&P", "Date": "December 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "stamford lincs", "Title": "“lovely hotel perfect locarion”", "Author": "phoebewillett", "ReviewID": "UR121330071", "Content": "after a disasterous couple of nights at the hudson we moved into the mondrian in soho we had a suite with fantastic views a sitting area with tv the bedroom was so comfortable we didnt want to leave the bed just perfect, the restaurant and bar was so beautiful we didnt need to venture far, the locarion was perfect for us as you are right nr tribeca little italy china town the shops everything without the tourists, this will be the only hotel i use in NY from now on end, mini bar had everything from headache tablets to sleeping tablets not that you want to be popping pills but everything was available, we even had our own driver to take us to the airport, just perfect I loved it", "Date": "December 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bloomfield Hills MI", "Title": "“A hidden Oasis in SOHO”", "Author": "drdanhaddad", "ReviewID": "UR121190700", "Content": "Beautiful rustic garden entrance greets guests to this wonderful property hidden from the crowded streets of SOHO on Crosby street. The rooms are wonderfully decorated. We had a marvelous view fro our suite over looking the city's westside with Hudson river in the background. The Resturant Imperial 9 is very cool with great vibe and menue.The service was great not overbearing. Great property.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Hamilton, United Kingdom", "Title": "“Fantastic stay”", "Author": "DJKane2006", "ReviewID": "UR121034049", "Content": "I've been meaning to write this review for months. We stayed at the Mondrian end May/early June and loved every minute. The rooms are amazing. We stayed on the 20th floor and had great views. Loved the cool blue/White decor. The whole hotel was spotless and oh so cool. Some people have commented about the 'trendy' clientele but we didn't feel uncomfortable for a second. It was our first time in NYC and we pounded the streets making sure we saw all the sites. We were returning to the hotel rather tired looking but the staff welcomed us & treated us the same way as guests at a champagne reception hosted by Susan Sarandon (yip, that was just one of the snazzy events while we stayed). The bar area is lovely, we enjoyed a good few cocktails there but didn't get around to sampling any of the food. If you're lucky enough to be planning a trip to NY you should definitely consider staying at the Mondrian.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“romantic and beautiful”", "Author": "alexnz01", "ReviewID": "UR120977722", "Content": "love this hotel.from the entrance to the postcard on my pillow, perfection.", "Date": "November 24, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Marshfield", "Title": "“Over designed under serviced!”", "Author": "Balaramjohn", "ReviewID": "UR120958455", "Content": "Our stay at the Mondrian was through Tablet private sale for a friday and saturday night, our travel plans then changed and I tried to change the reservation for the next tuesday, wednesday, and after 12 days of emails to tablet I was told that I could not change despite room availability. so changed plans again and arrived at 3:45 pm to find no room available yet, placed in holding pattern in restaurant/bar with many service providers around though none seemed to want to wait on us. told by desk staff person(no name tag, wrinkled look that was expensive I am sure) he would call. I finally called at 4:45 and was informed that the room was ready, Our bags arrived only after another call. Very nice small room with decor by Modern Frigid. Bill under door the day we left charged us 3.81. I called to dispute and she said she would take it off, only to be replaced by a mystery charge of 29.37 on my master card. so the saga continues, I really think that we were not cool enough for the place and I would recommend to anybody considering this hotel to arrive at the 2nd floor check in with their coolest look to start your stay out as the in group.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Great unexpected chosen hotel”", "Author": "xoxotravelmissy", "ReviewID": "UR120908945", "Content": "Me and my friend unexpectedly end up at this hotel after our original booking of a hotel was overbooked. We are glad we haven't paid the real price f the hotel since it is pricey. The hotel is a the very beginning not very obvious to find unless you take a good look at the map and look at the hotel picture to find how the hotel entrance looks like. The advantage of this hotel, is that it's still new and you'll end up seeing the good side of the hotel for being new. I've read a lot of previous reviews saying how they would hear how loud the neighbors rooms can be. It can be sort of true, but we've barely heard anything from them. Maybe its by luck. There will be at the beginning some issues in the room, like the function of the shower that can be tricky that the technician will help resolve. But you will have the neediness to almost harass the reception, by calling several times with a little of anger, to finally have the person come to the room. I don't quite understand the logic of needing to wait and call several times for the person to come and show up at our room. Especially when you need him not once but twice. I will not blame the technician but the reception that maybe they feel to good to make an effort to dispatch the technician asap. The room can seem small but the way it was designed, makes it see there's no need for more space. I can say I've previously been in a crappier hotel in the past in NYC that was a lot more smaller than this one. So there should be no complaints about the size, since we're in NYC Manhattan, what do you expect? a penthouse size room? The bathroom is a thing to admire since its marbled from top too bottom. One thing that was enjoyable to have in the room was the offered Ipad 2 to be used during the stay. We we're very tempted to bring the ipad 2 out in town but we had the scarcity of loosing it. The only thing that cant be criticize in about the hotel, is the restaurant. From the entrance view, the restaurants looks lovely, but do to the high price of the food we never eat there. So we've always dined out. The trip was great but there's one thing really one thing you will have to know about the place that's essential. The Bell Boys will try to get the run of your money and I'm glad I haven't felt for it. They breath lies when it comes to help you finding a taxi. When you try to take a taxi for the airport or for whatsoever reason... the bell boy in reality will not run around the block to find one. No even after waiting 30 mins for him to find one, he actually stands in front of the second not obvious entrance trying \"with so much energy\" in finding a cab with a wave of the hand... Yeah he doesn't budge he just stand there hope to get a taxi that already taken. He just never goes out of the hotel piremessis to find one for you. The best part of the whole story is there's a taxi limo at the hotel entrance, that the bell boy will try to convince you to take. The charge of taking that taxi to go at Laguardia airport: 60$. So we finally too initiative too go up the street and get ourselves a taxis after much frustration of the noncooperation from the bell boy. I think he was shocked that we haven't felt for is trap. And we gladly found a taxi after 10 minutes of going up in the streets. Is it luck ?maybe but all i know i saved a lot of money. The better part of all this is when talking to the taxi driver, a real taxi limo will not charge such a high amount of money...So that taxi limo waiting at the hotel is a buddy of the bell boy that will get profit out of you so that bell boy gets a sort of commission out of the scam. That is what really destroyed the end of our trip is the temptation of getting scammed by a guy that as the same age as us. Besides we're two university students that as not a lot of money that went to spend a 3 day shopping trip. Getting ripped off by an idiot like him isn't our thing. Such a heartless, and lazy bell boy. Hope you get fired soon. I regret I haven't filed a complaint about that guy for doing what he did. But i would have never known about the scam without being informed by that nice taxi driver we had. So in the end great hotel for unexpected moment but crappy bell boy when it comes to find a taxi.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Great boutique hotel”", "Author": "GraniteSheep", "ReviewID": "UR120697166", "Content": "We stayed here for our honeymoon and were very impressed with the hotel. The room was a decent size and the iPad in the room was a nice touch, which made planning our visit to NYC so much easier. We didn't eat in the hotel so cannot comment on the food, but we did use the bar. The bar in the conservatory looked lovely but we never got the chance to use it as it was always full, mostly with non-residents. There were tables free, but we were told these were for diners only, which was disappointing. Instead we were ushered into an \"overspill\" bar off the reception, which although adequate, didn't have the same buzz about it. That was a bit of a let down. Our only other criticism was the concierage service. Although the staff were very helpful and courteous, they didn't have the level of knowledge that we expected. There was a reliance on the internet, which we could have used ourselves on the iPad in the room. However, all the staff from the guys on the door, to reception to housekeeping were very friendly and polite and dealt with any request we had swiftly and to our satisfaction and made our stay very relaxing. Overall we would definitely recommend the Mondrian Soho, depsite the issues above. Although annoying, they didn't detract from our overall stay. The location is excellent, the rooms are great and the ambience of the place is very cool and modern. We really enjoyed it and would love to go back!", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Nice boutique hotel in SoHo”", "Author": "Louis C", "ReviewID": "UR120483666", "Content": "My wife and I recently stayed for our first time at the Mondrian SoHo. The hotel welcomes guests with a pretty grass canopy-covered entrance that ushers you away from the street and inside a chic lobby. Vivian at the front desk was very friendly and gave us a complimentary upgrade! Our room was small by most hotel standards, but to be expected as it is Manhattan. Still, we had a large and comfy king size bed, 40-in flat screen tv, and our own iPad with free internet access. Only stayed for 1 night but were very comfortable and would absolutely stay there again. Highlights: VERY friendly and personable staff; great location in heart of SoHo (located on a side street so it's quiet, but just 1/2 block from the busy activity of Broadway); and new, modern decor.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Great boutique hotel in SOHO”", "Author": "demendieta", "ReviewID": "UR120358942", "Content": "The Mondrian hotel was an oasis of calm, quality, and service in the middle of soho. The food was seriously the best prepared and presented and of course the best tasting ! The rooms are spotles and ver funkyly decorated and yea the are reall small, I mean closet size small but they are very nice, comfortable and unheard of in New York they were not noisy at all.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Excellent Stay”", "Author": "KD_lank", "ReviewID": "UR120352681", "Content": "We stayed at the Mondrian for four nights and really enjoyed this hotel. First off the concierge Lumba was a real gem and was absolutely outstanding. The room (although small) was clean, bright and cheery and most of all we loved Soho and the location of the hotel was absolutely ideal for us. The only thing I didn't enjoy was the sink/vanity being a part of the room rather than the bathroom. There were also a few glitches - for example - after one night of room service, it took about 12 hours and multiple calls to have the tray picked up. But these are pretty minor quibbles and did not impacted our trip or the lovely feel and service of the hotel. I would recommend.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Thessaloniki, Greece", "Title": "“nice hotel”", "Author": "Barkon", "ReviewID": "UR120245116", "Content": "The location is perfect, in a very nice part of the city. Very clean and very cozy bat mostly very beautifull interior disign. beautifull people to see and polite yÎ¿ung stuff", "Date": "November 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Nice place, great location.”", "Author": "The_Firestones", "ReviewID": "UR119991041", "Content": "We stayed here in August of 2011 and have only nice things to say about it. We booked the room last minute on lastminute.com and received a great rate (hid the actual name of the hotel). The room was compact, European's will find the size just perfect, but very well appointed. The view out towards City Hall and the West Side was nice. The place is clean and well maintained. Location is key here and being blocks from Chinatown, Little Italy and shopping on Broadway made this a sweet deal.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "paris", "Title": "“Not very bad, but not comming back.....”", "Author": "Cgrasu", "ReviewID": "UR119949062", "Content": "Positive: Great location, great view, ok service, nice restaurant, well equiped room. Negative: super small room (even though I stayed in a more expensive one), continental breakfast: 21 $ for the worst breakfast choise I have ever seen!!! even for 1 star hotels...; air conditioning wasn't working properly, toilet malfunctioned, and even if it is a design hotel, if you look closer, you see that the materials used are cheep.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Great hotel!”", "Author": "Cheers526", "ReviewID": "UR119901160", "Content": "Stayed one nite. Very nice room with a fantastic view. Very clean. Great service. Doorman was very helpful in getting us cabs. Great location.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“First time to NYC”", "Author": "jo c", "ReviewID": "UR119276476", "Content": "We recently stayed at this hotel. As it was our first time to NYC we found that the hotel is very central and convenient. It is located in close proximity to all train lines and the broadway street mall, spring street, little Italy and China town. Rooms are small but they have been designed well and the room are very comfortable. Heaps of natural light and great views really top this hotel off. I must say the beds are so comfortable and large. The decor of the hotel is much nicer in life than in photos. I would recommend this hotel as its such a fun vibrant hotel. The staff were friendly and willing to assist.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Great location!”", "Author": "JitneyW", "ReviewID": "UR119204957", "Content": "Of all the places I have stayed in NYC this is by far my favorite because of the service, location and amenities. There is a very good restaurant located on the property and it also doubles as a great bar at night. The staff is very attentive and nice... which means a lot, especially for the neighborhood! The beds are extremely comfortable and if you stay with a Morgans Hotel group often they give you a great deal on inexpensive room upgrades (we paid an extra $25 a night). Should also mention that the decor is very neat! Only complaint would be that there were not any full-length mirrors in the rooms. I can't stress enough that the location is GREAT!", "Date": "October 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Shanghai, China", "Title": "“Good if you like blue and low lighting”", "Author": "ShanghaiPandas", "ReviewID": "UR119063975", "Content": "Overall a pleasant and functional stay but rooms are quite small and a bit too light... There is a focus on blue throughout the hotel and dim lighting in public areas. I had a corner room on the 18th floor, so rooms had a great view of the NYC Skyline. Was a little hard to get a cab due to the side road location, although staff would always offer to get one for us. Breakfast was good, fast and the service very friendly.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Great location and city view”", "Author": "LuxuryLoverLondon", "ReviewID": "UR119042957", "Content": "Stayed for 5 nights for a friends wedding. Booked a suite, which was average size for NYC. Great view of the city from the 16th floor (must be even better from higher up). Stayed previously at the Mercer, Soho House, The Crosby, The Bowery, Soho Grand and this compares well - always good to stay in a new/refurbished hotel. Loved the restaurant space and staff generally v friendly. Had some IT issues as a cable was damaged in the street but James, the front desk manager cleared up any issues. Good modern gym in the basement. Very comfortable beds. Denied entry to on-site club as it was \"guest list only\" which is always a bug bear but maybe could have pre-booked. Location is fine for walking in and around Soho and not too far from Wall Street if you want to see the new memorial. Will go back.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great staff and design”", "Author": "EonCarr", "ReviewID": "UR118845931", "Content": "A great staff and nice interior design in a beautiful part of NYC made for a great 5 night stay. The room we had felt quite large for New York although small anywhere else. My wife loved the look of the place and I think it's great place for couples. The restaurant in the greenhouse had a good breakfast and looked quite busy in the evenings. We arrived at 9:00 am from a red-eye flight and were allowed to check-in right away which was great. The hotel also sent a bottle of sparkling wine to our room when they heard about a special event that had occurred which was very kind and thoughtful. Overall, the design and the great staff made this a great stay and we would certainly recommend this hotel. Some small issues: -A noisy air conditioning unit that failed to work on two nights (the staff was very responsive however and a repairman was sent quickly to our room to fix the issue although it returned the second night). -The rooms have hotel ipads that are intended to provide complimentary internet access (wireless is $10/day). The ipad worked only once for a few minutes which was a bit annoying. -The hotel does not have a sign on either entrance and the lobby is on the second floor. Can be a bit confusing if you're not expecting.", "Date": "October 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bs. As. Argentina", "Title": "“Good location, trendy hotel, still needs adjustments.”", "Author": "Sol058", "ReviewID": "UR118787487", "Content": "The Mondrian Soho is located at the heart of Soho. For a couple, it is a very nice location, in a trendy neighborhood and very close to the subway. Dean & Delucca, Wholefoods and all main fashion brands are right around the corner. We stayed for 4 nights, and booked a room thru booking.com. The hotel had just opened, so we got a very good fare. The rooms are kind of small and the walls are thin, so you can hear other guests walking by your door. Same thing with the bathroom, very little privacy if you are not traveling alone. The decor is nice and modern. Beautiful view from the upper floors. We didn't eat at the restaurant, but had a taste when we ordered room service. It was good, not great. When we first got to our room we noticed that the window didn't close right, so the winter cold kept coming inside. The fridge wasn't working, and neither was the TV. We asked for a new room, which they gave us. However the new room had a tiny bed. We had to complain again, and after a bit of a struggle the following night they gave us a bigger room with a great view. They also invited us to the opening party at the hotel, with a cool band and drinks. We also got to visit the penthouse, which is great. All in all, it has the potential of being a good hotel, it needs to improve the service and some details in the rooms. However, if the rates get higher, I don't know if it's worth it. I think it might be trying too hard to be trendy and forgetting some of the important things like making you feel at home.", "Date": "September 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“A fantastic boutique hotel”", "Author": "ppaolo73", "ReviewID": "UR118728472", "Content": "I stayed at the hotel for a couple of days and although I was there for business it seemed to be a holiday. Everything is perfect, white roses and candles create a cosy and romantic atmosphere. There is a magic restuarant in a sort of glass greenhouse with excellent food and service. I'll definetely go back again and recommend it to all my friend as the best place to stay in NYC!", "Date": "September 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Dawn Minto”", "Author": "dawn m", "ReviewID": "UR118617956", "Content": "If you are like us, and are very busy during our work time, when we are away for pleasure we like something stress free without being invisiable as a person. This hotel is unique in that it is incredibly discreet, elegant, tasteful and offering a sincere service with an attention to detail. This place is perfect for a romantic get away. It's not that easy to find, even though its perfectly located in a great quarter where people live. You won't find a big sign, and when you are looking for the reception you will find it on the second floor, fun thing about that is it feels much more discreet when you are coming in or leaving the hotel. The service offered, and personnel were excellent. These are people who take their profession seriously, whilst still being very friendly and approachable. We strongly recommend this hotel and will look forward to returning. Well done the Morgan Hotel group. Another plus... every room has its own Ipad and the bed was the best ever.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Miami Beach, Florida", "Title": "“Great Hotel in a Classic Neighborhood!”", "Author": "w0rldtraveller2011", "ReviewID": "UR118562343", "Content": "The hotel is in the heart of SoHo, with a beautiful entrance, and gardens. One thing I noticed upon confirming the reservation, is that if you do not book directly with Morgans, the front desk is much-less likely to prioritize your room requests, such as High floor etc., so try and book direct, unless you get much cheaper elsewhere. I had stayed in a Deluxe Suite, the size of a regular room in most other cities, if not smaller @ 350sqft, but this is New York, but the rooms layout was excellent, and very efficient on space. The hotel opened in 2011 so all the rooms are outfitted with Concierge iPads, want room service, wake up call, flight info, grab the ipad, ordered extra toiletries from it, never showed, but aside from that, a glimpse of the future of hotels to come. The rooms decor is a very comforting, modern yet classy white and Blue color scheme, with floor to ceiling windows that let all the light flow in. The location of Soho is great if going to stay in the lower part of manhattan, but a bit far from Fifth ave, Times square etc. I would reccomend this hotel over most of the other hotels in lower Manhattan.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“Very Bad service and management”", "Author": "Fransoavi", "ReviewID": "UR118483554", "Content": "I've been at Mondrian Soho NYC 3 times in \" months. I was the first client at the opening. I loved the design - magical like a poetic movie from Cocteau - and the amazing location. BUT... but, at my Third stayn, I've found bed bugs... they changed me for a suite (great). I eventually needed to stay one more week (two weeks for the third stayn), and no one was calling me back to confirm the extension, despite my relaunches. The day before my last 'official' night, they just ask me to go away 'cause they were full !!! Tribeca film festival, no room in NYC.. and they just telling me top go out ??? After hard negociations, they moved me to another very small - and dirty - room. Sure, better than being on the sidewalk, but are you acting this way for a regular long stayn client ??? Crazy.. Other problems are about service : no ice with soda and always missing stuff in room-service, breakfast serving lasting more than 30 mn, housekeeping failing for 2 days, restaurant full even when you are a guest. Positive : the concierge - Lubna - is the greatest person in this place. She is very concerned by customers and helped me seriously. I'm traveling monthly to NYC, i will NEVER go back to this place.", "Date": "September 23, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Great Hotel, Great Service and Amenities”", "Author": "M&M's1", "ReviewID": "UR118201239", "Content": "Rooms-Good View, European Design, Comfortable Bed. Loved the IPAD in my room. Didn't need to hook up my laptop. Had a King Size bed. 2 Observations- I Could hear the elevator ding every time somebody got off. I was about 3 rooms from the elevator and I could hear people talking in the hallway also. I would give the room a 5 if it wasn't for the sounds I could hear. I thought the junk food selections for the mini bar could be better. Only had a snickers bar for my late night cravings as far as sweets go. Location- I loved the location in Soho. I even saw the US Open Tennis winner staying at our hotel..won't mention names. Overall, I would probably stay here again. The bar and restaurant was nice. Great service at the bar downstairs. I had a drink & a dessert. I was here on business and I would recommend this for business and couples.", "Date": "September 16, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "LONDON", "Title": "“Geat all round”", "Author": "BILLYSE21", "ReviewID": "UR118125846", "Content": "Ideal location just off Broadway in SOHO. Staff were excellent and helpful but not overwhelming. Really nice good sized room for NY and very well appointed bathroom. Couldn't fault it.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“we loved it and we'll be back”", "Author": "barbara l", "ReviewID": "UR118010529", "Content": "we were a group of 12 persons, teens and adults( between 18 and 45 yo) and we stayed 5 nights. the hotel is very nice, the staff was very helpful,, the location is excellent, and decoration awsome i particularly would like to praise one of the concierg and john the doorman that was fantastic in helping us i would advise this hotel to everybody", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Milan, Italy", "Title": "“The place to stay in NY”", "Author": "arabella c", "ReviewID": "UR117964618", "Content": "Just open few months ago, we had a very glamour stay. Room are not large but this is well balanced by design furniture, cleanliness, amazing view of down Manahattan and a perferct location. Nine Imperial - the restaurant inside the hotel- is excellent and it is one of the coolest place in downtown. Keep in mind that you should like blue...since blue is the dominant colour of the hotel. Staff is kind and efficient.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Cool, convenient hotel which will appeal to many”", "Author": "tangek", "ReviewID": "UR117916369", "Content": "My partner and I stayed at the Mondrian SoHo for 2 nights, while we were working in NYC. We found an excellent deal on a discount hotel website, and ended up with a small but nice room on the 7th floor of the hotel. Our taxi driver was confused about where the entrance was, as there is no name on the hotel (typical for Ian Shrager hotels). But we found a lovely garden and walked through to see the entrance to the hotel. There is quite a lively bar/restaurant in the lobby, with gorgeous dÃ©cor and even more gorgeous people. (We later stopped down for a drink and found it to be pricey but exciting to watch). The front desk is one floor up from the ground. The staff were friendly and efficient, and were diligent about security procedures (verifying our identity). The elevators were a bit slow to take us to our floor. Our room was white-themed with a slightly whimsical design. We had a very comfortable queen sized bed with a fluffy white comforter, and drawers under the bed. There was an ample closet to both hold our suitcase and hang clothing, as well as having a safe. The room also had a desk area with ipad with lots of interesting selections/controls for the room. The TV was a flat screen with great quality â€“ only issue is that it seemed to be on some sort of timer, where it would switch off at 10:30pm, switch back on at 12:30am and again at 6:30am. Never could figure out how to turn it off! Our room had a window which opened, and a broad view of the street with a peek at some buildings on the skyline. The bathroom had an external sink (outside the bathroom door, with mini bar underneath. The bathroom itself had a toilet and shower/tub combination. We were impressed to see a handheld shower as well as an overhead one, and a deep tub as well. It would have been perfect if only there wasnâ€™t a small leak from the central control area. The toiletries were super interesting, e.g. mint shampoo and rum shower gel. And the towels were wonderful. The neighborhood is typical SoHo, quite industrial on the nearby blocks but quickly changing to shopping to the north and Canal Street to the south. The cab ride to downtown was quick and cheap, definitely a convenient location for Wall Street, etc. We would definitely consider staying again.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Another fab hotel in the Morgans hotels portfolio”", "Author": "AWalia", "ReviewID": "UR117809713", "Content": "Our family of 5 has just returned from a 5 day stay at this modern deign led hotel which can be described as a hip urban oasis in the heart of the uber-trendy SoHo area in Manhattan. As a former hotel owner/operator it was great to stay in a relaxed and friendly hotel where the fabric of the hotel and the staff come together in harmony. The fabric of the hotel is great as you would expect from this group but the staff make the difference and they were great from the bell boys to the concierge services team, just to mention a few. Nothing seemed too much trouble for them. Concierge services are provided in a relaxed environment and they arranged everything from best Broadway theatre tickets to exclusive sightseeing rides and airline bookings and providing very useful local tips. Check out the Penthouse suites for views to die for. Rooms come with an iPad for guest use for paperless guest service directory and connecting to the electronic world for free - nice touch. The GM (Gary Thomas) is a super guy and he has a great team around him. We will be back soon.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“GREATEST PLACE IN THE UNIVERSE (AND I'VE BEEN TO JUPITER!!!)”", "Author": "GrayBright", "ReviewID": "UR117474738", "Content": "This is in my opinion the greatest hotel I have ever been to. The hotel was opened in Feb and is gorgeous however, even with new decor and luxury appeal, the staff are what will make your time here the best time ever!!! The location, perfect. The interior, stunning The rooms, delicious The staff, greatest set of people in the world!!!! As soon as you walk in the door you'll be greeted by some of the most awesome people such as Sammy, AJ, Joey, Danny too many to mention all!!! In the lower foyer Jelena will help you out and set the mood with a smile and helpful directions up stairs to check in. You'll then hopefully meet Ben or Katie at the check in depending on what time you arrive, brilliant people. Before you go to your room, you have to meet the jewels of the hotel, Rachel or Lubna or Sasha. They work at the concierge desk, it should be called the \"MOST AWESOME PEOPLE EVER\" desk (I was going to write it on their desk however it may come across as vandalism...) You wanna go out and have a great night, they'll sort you out. You wanna know where to buy liquor and balloons, they'll sort you out. You wanna do anything, they'll sort you out. Now most places, yeah, I agree, most places will sort you out, but google can tell you were to go as well, it's their personalities that change everything. I spent 3 months in the US, going across 14 states and staying in hotels and this, this was the greatest place I have found. Honestly, it's a gorgeous building, perfect location (safe / friendly / shops all around ect...) but it's the staff, it's the staff that make it brilliant!!!! So serious I am about this review I'll even put my email address so if you ever have questions about it, email me gray@graybright.com and I'll fill you in (I seriously had that much fun there, I was there 9 days in total with 5 friends staying there as well, we all agree, greatest place ever).", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Cool”", "Author": "Atul1998", "ReviewID": "UR117423603", "Content": "Stayed here for a short nite...has the modern ian schrager look. Very new property at the time of this review - so everything was pristine. Superior room/city view - awesome view of downtown which was rare to see. Not too noisy either. Room had a separate living room area with its own tv and couch, ipad in the room, and bedroom although compact was well laid out with another tv. Downstairs the lounge in the greenhouse was very nice, but a bit noisy with the echo-ing off the glass and service was a bit slow despite it not being too crowded. Definitely a must stay for folks visiting NYC and wanting the downtown vibe - soho/tribeca access...", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Montreal", "Title": "“Luxury and style in a great location!”", "Author": "maze56", "ReviewID": "UR117254641", "Content": "I absolutely loved this hotel with its suttle whimsical Beauty and the Beast style. The suite was very spacious though I've heard the regular rooms are a tight squeeze. By far the best feature was the huge window in the shower! Never had a view like that while in the shower before!! Actually the whole room was floor to ceiling windows and simply breathtaking! Another smart feature is the iPads they provide in all the rooms... much appreciated :) The food was good... complimentary breakfast was basic continental but more than adequate and a good start to long days of walking the city. The same room for breakfast is a lounge/bar at night and is beautyfully decorated with stunnig chandeliers and a ceiling of windows... great room with an energetic vibe and many locals coming to hang out at the bar on any given night. The service was stellar and the location perfect I'd go back without hesitation :) Enjoy your trip!", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Freehold, New Jersey", "Title": "“Trendy Hotel. Great Location!”", "Author": "Orly5678", "ReviewID": "UR117252806", "Content": "Keeping to our theme of NYC weekends for birthday get aways, we decided to experience another Morgan Group Hotel. We had the best time in Miami at the Delano and looked forward to our stay in NYC. The service was great. The concierge was helpful in providing things in the area to do as well as restaurant reservation. Their recommendation for The Darby was a perfect fit for what we were looking for. If I were to provide any feedback in this regard I'd simply ask to be informed of any unique charges a restaurant would charge. The Darby provided live music which was FANTASTIC, but I was a bit surprised with the $50 \"Entertainment\" charge. The room was trendy and neat, equipped with an I pad, Ipod doc, great use of space. The walls were a bit thin so we heard the elevator as well as the pepople walking through the halls. But overall we had a great stay. The hotel in general was very fashionably decorated, so much so that I took pictures to add some style to my own home. The location of the Mondrian was ideal. We walked for hours and just loved the surrounding area. I'd recommend a stay at the Mondrian, along with any Morgans Group Hotel. I am looking forward to trying the next hotel from the group.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "New York", "Title": "“Our beautiful secret in the heart of Soho!”", "Author": "teachmetonite", "ReviewID": "UR117154742", "Content": "This was such a beautiful hotel - chic design, private, and outstanding service. The rooms were pretty small, but it is in the heart of Manhattan! A great value through Priceline and we felt so pampered by the staff that we want to come back every year! Walking distance to amazing shopping and restaurants in Soho - close to Chinatown, too. Highly recommended.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "USA", "Title": "“Don't bother - much nicer accommodations up the street”", "Author": "MajesticUsa", "ReviewID": "UR117002336", "Content": "I thought I would try the Mondrian as I am a fan of Morgans. Big disappointment. Location is not good and staff is below average, with attitude. Room was not functional and wear and tear is visible. Restaurant food was awful. The only nice thing is the decor. Service was painfully slow. If you're looking for a Soho hotel, go to Crosby up the Street. They get it. Or go to the Mercer - an old timer that beats Mondrian hands down. Morgans is off my list. There is so much better out there these days.", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“BEAUTIFUL, BEAUTIFUL”", "Author": "hihi_11", "ReviewID": "UR116867552", "Content": "What can I say, the Mondrian Soho is absolutely gorgeous. I stayed here for my wedding and it was a fairytale hotel, just fantastic. The problem is the staff at this hotel, they are rude and very unhelpful. Twice I called the concierge to schedule a limo for my wedding and both times they never got back to me. I had to book my own limo for my wedding, which was fine but irritating for such a fancy hotel. My reservations were under my first name and not my last so they couldn't find it and I was panicked as the front desk people tried to not look worried. When we asked what came with the room the desk person said a mini bar. We were never told about the safe, restaurants, internet or laundry service. My husband could not get over how unprofessional the front desk staff was. There was a bottle of wine in our room with a note for a different person---attention to detail, not so good. We had asked the person who booked my room many times about photos on our wedding day and I was assured it would not be a problem. 5 minutes into photos I was told the manager was upset and wanted to know who gave us permission for photos. I WAS LIVID. We were running late anyway for our wedding and then had to deal with this after I asked so many times if it would be okay. It started my wedding day off really bad. We asked the restaurant attendant how we went about getting some food and she snapped at us and said to ask the front desk she didn't know how it worked, we has to sign up in advance. She was so awful. For such an expensive hotel, you have to pay for internet! They do have ipads in the room that you can get on for free but it was set up to be quite a bother. We were also told that we would be able to use a steamer for our wedding clothes when we booked the room only to find out we couldn't and if we did we would have a huge charge. After talking with the manager we miraculously had a steamer in our room after being told by the front desk person that they weren't portable. On the up side, the room itself was INCREDIBLE, clean and like nothing I have ever seen, blue carpet and crisp white walls. Floor to ceiling windows with views of the city, perfect lighting for the make up artist and photos, an amazing bathroom and just over all outstanding and dreamy. I would stay here again just because it is that beautiful and it was perfect for a wedding. Hope the staff can try to smile and be a bit more friendly next time. They also let us stay an extra hour after check out time which I thought was very, very nice.", "Date": "August 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Amazing!”", "Author": "Detts11", "ReviewID": "UR116777084", "Content": "This hotel is amazing it has the nest location of any in SOHO. The staff is very helpful but definitely a little hipster which we enjoyed! If you are wondering where to stay, this is your place!", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Maryland", "Title": "“Great Hotel, Great Location”", "Author": "Imazoid", "ReviewID": "UR116624804", "Content": "When I booked this I must admit I was a little concerned about some of the reviews, however it seems the more critical ones were written just after the hotel opened, and these issues have been resolved, I cannot fault my stay here at all. The location is great. Very close to the Subway (Canal Street N,Q,R is the closest stop) and just a short walk to Little Italy and Chinatown. Finding the hotel initially can be a little challenging as there is no sign displayed, but as soon as you see a courtyard with a walkway with climbing vines, you've got there. Reception is not actually on the ground floor, you need to take an elevator up one level but don't be concerned about getting lost, the friendly doormen will make sure you head in the right direction. Checking in was very efficient. OK, the rooms. Like most hotel rooms in New York they are not large, but they are equipped with everything you need except a coffee maker, which I didn't find too burdensome as I've never been impressed by the stuff that hotels supply in the room anyway. Our bed was a king sized bed and very comfortable. I loved the fact that the bed had additional storage built into the base as well as a decent sized closet and a chest of draws. Every room has an iPad in it which largely takes the place of the big books that you find in most hotels. You can access the Internet for free via this iPad, accessing it through any other device can bring you a charge of approx $10 a day. The Internet service was reliable during our stay. You can also access the websites of some of the major papers via the iPad, I noticed the New York Times, Wall Street Journal, USA Today, and the British Guardian Newspaper for example. The bathroom is small, just enough room for a shower and a WC. Water pressure and temperature was great. If bathroom privacy is a major concern for you, be aware that there is frosted glass panelling separating the bathroom from the rest of the room, no you can't see what is going on in there but it's not the best sound barrier. The sink is actually in the room entrance foyer and separate from the rest of the bathroom The room also contains a Mini bar (which thankfully is not of the type fitted with sensors that charge you the moment you pick something up). It keeps things cool but not cold, for that you'll have to call for ice. A phone call to the front desk will quickly get you a large bucket of ice, the floors themselves do not have ice making machines and there is no ice bucket in the room. All the staff we encountered were very friendly and always seemed to be smiling, looks like they enjoy their work. Some earlier reviews did comment about the noise. I am a light sleeper but found this hotel no nosier than any others I have stayed in. In fact the hotel was fully booked but there was no noise from adjoining guest rooms. In the evenings, the ground floor restaurant and bar do appear to become quite a social attraction, coming back in shorts and a tee shirt did make me feel a little underdressed when compared to the patrons of the bar, but that didn't matter to the hotel staff who were always welcoming. If you do need food or drinks without using the hotel facilities, there is a 24 hour grocery store on Broadway and plenty of other places which are not 24 hour but may better meet your needs. Overall I was extremely satisfied with my stay, friendly staff, the rooms were kept clean, and a great location from which to explore New York City. If I find myself staying here again, I would not be disappointed.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "NYC", "Title": "“Glamorous but small”", "Author": "IslandHopper888", "ReviewID": "UR116514670", "Content": "I stayed at the new Mondrian Soho on Crosby st in downtown New York recently and had a great time. The room was small but well decorated and comfortable. Staff were pleasant and attentive and overall a great experience. Location is very helpful if you are working downtown, if not the subways are close at hand. Overall a fine property and one I can recommend to anyone traveling there", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Kingston, Canada", "Title": "“Can't wait to return!!!”", "Author": "Marmee14", "ReviewID": "UR116498221", "Content": "Everything about this hotel was amazing! The decor, right from the trellised entryway, to the dining areas and bar, were beautiful and magical. Service was very friendly, helpful and totally unpretentious. The location was excellent, close to good shopping and eating experience. The room was so comfortable, and the view so amazing from our room,that it wasn't easy to leave it every day! Next time we're in New York, this will be our hotel of choice.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Blackpool, United Kingdom", "Title": "“Super Hotel”", "Author": "Clancym123", "ReviewID": "UR116485048", "Content": "We stayed at the hotel for a weeks holiday and were very impressed with the hotel. We had read some mixed reviews on tripadvisor but put much of that down to issues with the hotel just being newly opened. This was our first trip to NYC and we just loved the location of the hotel. The staff were spot on with their recommendations for local places to eat and were always very welcoming and helpful. We never actually ate at the hotel or used the bar but both did look beautifully kitted out, as did the foyer areas. The rooms, although small, were well thought out in terms of their design and had a surprising amount of storage and the finishing and detailing was luxe. The mini bar was reasonably priced and had a thoughtful and cute selection of items for sale. The only negative feedback I would provide was a) the air con was difficult to manage and the console was quite high on the wall b) the shower had a tendency to flood the entire bathroom no matter how you directed the nozzel c) the safe was too high in the wardrobe and difficult to access We did however love the huge bed, crisp linens, in room iPad, orchids, toiletry selection and the amazing location. We would heartily recommend the Mondrian Soho to any leisure travellers. We had a wonderful holiday and look forward to returning.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Beautiful property, will be back.”", "Author": "taliaa", "ReviewID": "UR116362442", "Content": "My husband and I stayed at the Mondrian Soho for three nights in August 2011. We hadnâ€™t stayed at a boutique hotel in ages and we were pleasantly surprised. As others have noted, our cab driver couldn't figure out how to get to â€˜9 Crosbyâ€™, so instead of battling traffic again, we just walked half a block to the hotel. There is no sign outside but we recognized the greenery and canopy from the photos we saw here on Trip Advisor. We paid $30 including tip for our cab ride from La Guardia at around 12pm. The staff at the door were quite young - a trend we saw throughout the hotel. There weren't any 'grown-ups' over the age of 35 that we could see. The language and manner in which we were spoken to was professional but definitely California cool, very informal. \"Hey, Brother, let me help you with that.\" \"Hey man, my name is <insert name>, let me know if you have any questions.\" Perhaps itâ€™s because we were the same age and perhaps some of the older people in the hotel were not spoken to like that. Since we arrived too early for check-in, we left our bags with the boys. We went to check-in, which is located on the second floor and was relatively quick. We needed to send some work emails and they didnâ€™t hesitate to give us the WIFI code. As a result, we didnâ€™t need to pay for internet during our stay. Perhaps that was an oops on their end, but we were happy about that. Upon entering the hotel, there is a nice fragrance, the dÃ©cor is all blue and white and the restaurant and bar are beautifully decorated with glass and other beautiful textures and materials. It must be beautiful in the winter as well. There is a beautiful balcony opposite the check-in to just sit out and relax â€“ granted, its astroturf, but itâ€™s a beautiful contrast to the hotelâ€™s dÃ©cor and quite welcoming. When we returned to get our room after 3pm, we were upgraded to a King room from a Queen room on a high floor; the view was great. The elevator ride was surprisingly dark with a dim blue light and played loud music. We had trouble with our key, but still managed to get in the room. This problem was never resolved although we didnâ€™t mention it until late on our second day. Apparently all the vacuuming of the halls sends fibers into the air which block the key readers in the doors. The rooms are on the smaller side, but its standard for NYC as others have mentioned. The floor-to-ceiling windows were beautiful as was the dÃ©cor. The royal blue carpets were clean, but show every spec of dirt and dust. The layout was well thought out with storage in the base of the bed and a fairly large chest of drawers. Showers were decent; my husband didnâ€™t think there was enough pressure, but I found no issues with it at all and I like a very strong shower. The toiletries were very nice from Malin and Goetz. They were replenished each day even though the original bottles were not completely finished. The relatively small sink is outside the shower/toilet room â€“ wish they had a towel rack to hang hand towels/face cloths; nowhere to put them to dry properly. Safe was in the closet, but was high up on the shelf in the closet so for someone of my height (5â€™3â€�), it was hard to see what we put in there. Beds were beautiful to look at â€“ very comfy when lying down, but both my husband and I had trouble sleeping all three nights. The beds were a bit too soft for our liking and the pillows were feather. We changed them to foam, but still didnâ€™t sleep as well as weâ€™d hoped. There is no turn-down service in the hotel although there is room service which we never used. Overall, the room was very clean and Iâ€™m a complete germaphobe. Although I wanted to break out the Lysol, I fought the urge. Breakfast was included with our rate each morning. We were pleasantly surprised by the Continental breakfast â€“ not as bad as others have felt it was. Fresh fruit, nuts, cheeses, cold-cuts, muffins and the some of the most delicious croissant Iâ€™ve ever had â€“ reminiscent of visits to Paris. For $21, it would have been steep since weâ€™re not crazy-about-breakfast people, but definitely better than other hotels Iâ€™ve seen. The last day I should mention someone in the kitchen seriously screwed up â€“ they ran out of croissant at 9:05am. Come on. I know the number of guests dropped significantly on the last day, but come on. Youâ€™ve gotta have some bread for guests. I wasnâ€™t impressed with that oversight. Granted, they were apologetic and offered plain toast, but seems to me that kind of problem is resolved by calling a local bakery and getting more croissants STAT. There were line-ups of guests after we left breakfast â€“ Iâ€™m certain people were not pleased. They called our cab back to La Guardia relatively quickly from the Lafayette St. entrance and were very polite as they bid us adieu. Overall, our stay was quite uneventful and enjoyable. We liked the proximity to Canal St. and the Yellow subway lineâ€¦we got everywhere we need to go with that (including a mistake trip to Brooklyn on an Express train!), but we loved the area. After staying in the Upper East Side most of our visits to NYC, this was refreshing. Yes, it is on the lower east part of Soho, perhaps not really IN Soho but we didnâ€™t feel like we were not part of the excitement or too far into Chinatown. We would definitely stay here again and will likely recommend it to our friends. Be sure to check out consolidators such as Hotwire for great deals. We got a fantastic rate including breakfast.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Pasadena, California", "Title": "“Awesome !!”", "Author": "bajagirl2010", "ReviewID": "UR116309343", "Content": "This hotel is beautiful, the staff is amazing! This is a well run hotel! The rooms are newly remodeled and beautifully decorated ( we didnt even notice how small it was), the linens were very nice - the bed was soooo comfortable. Our room was floor to ceiling windows with a view of three bridges and the new york skyline. The hotel provides an Ipad in each room with free internet, ( although the internet was not as high speed as I would have liked and they put their own interface to help guests, but it made using the internet a bit tedious ) a small desk, and mini bar. Concierge services were excellent. They held our bags before check in as well as after as we still had several hours to see more of the city before our flight out . They even offered 1:00 pm check out at no charge, which I have heard other hotels charge for. They also have a few decks off of the lobby ( 2nd floor) for outdoor seating, with umbrellas, chairs and coffee tables.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Very modern, femme boutique hotel with friendly service in SoHo (food meh)”", "Author": "BizTravelerGuy", "ReviewID": "UR116281687", "Content": "Our Standard room was practically European small, but functional. Decorated in a very French feeling white wood with bright blue trim, with a modern albeit tiny bathroom. Cute, very Ian Schraeger-like. I have heard that their suites are very impressive. The standard room, though, actually was OK for us for 4 days despite its tiny size. Nice large screen TV. Free Wi-Fi which is good because I personally hate to pay for Wi-Fi - also good because their bandwidth is very limited. I have heard the restaurant food is good, but frankly the room service is NOT GOOD. Not terrible, just ... wrong items, poorly cooked, and a VERY small menu for room service. Also NYC expensive. You have to call down for ice, which means you have to tip every time you want ice ... lolwut? Windows open slightly for semi-fresh NYC air - but I like opening windows. Slightly noisy air conditioner but it worked GREAT, and NYC was HOT when we visited. One free bottle of water per day. Leaving a tip on the bed does not result in more goodies or extras like chocolate on the bed or more bathroom sundries. Nor a thank you from maid staff. Cute feminine inspired boutique hotel with extremely friendly staff. Would not recommend room service, ever. Very close to Chinatown! Very close to Little Italy. In lower SoHo which has terrible traffic but LOTS of \"action\" (people on the streets). Chinese food and Italian food surprisingly meh/average. Very surprising. Noah's Ark deli near Lower East Side (but in a nice area) is EXCELLENT NY Jewish deli. Seriously. Central Park in summertime is freakin' amazingly beautiful. NYC people were ALL - every. single. one. FRIENDLY. Someone has talked to the ENTIRE city of New York and they have evolved to be FRIENDLY to tourists. I would go back to NYC in a minute, and I would stay at the Mondrian SoHo for location, friendliness, and cuteness/cleanliness. Rates via American Airlines were $144 a night for a standard room, which is cheap. However, they don't tell you very clearly that a Standard Room means SMALL. My bad. Now I know.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Berlin, Deutschland", "Title": "“Great stylish hotel in SOHO New York”", "Author": "alberto_bruni_photo", "ReviewID": "UR115949228", "Content": "Mondrian SOHO is a really great stylish hotel in SoHo, New York. If you arrive you donÂ´t recognize at first that this is an hotel. A great Wintergarden as bar and restaurant in front of the hotel offers a great place to stay. The lobby is very stylish and I love the design of the hotel. The rooms are in white and blue colours. Windows from the roof to the top of the room offers a great view on New York City. Therefore I suggest to book a room in the upper level. The stuff is reall friendly and helpfull. The location is great even for shooping, restaurants and sightseeing.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "2.0", "Value": "3", "Service": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Very Poor Customer Services”", "Author": "newman8or", "ReviewID": "UR115792539", "Content": "I stayed at the Mondrian Soho in February on a business trip. The decor is very trendy and food is good, but I did feel that staying there for a week became a little too much as the hotel seemed to concentrate on private parties so getting any sort of respite from a long day at work was difficult as you found yourself surrounded by people not staying in the hotel who were obviosuly there to party. You want a quiet meal in the evening. Forget it. If you were going to NY for the weekend its fine but not for a business trip. Why have I rated this hotel so poorly I hear you ask? I have emailed the management there on 6 seperate occasions and not had one response back, not even a thanks for your email/query and we will get back to you - how terrible is that?! One was even adressed the 'The Hotel Manager'. I may sound pedantic but a simple response from the management is not too much to ask. Poor. Very poor.", "Date": "July 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Trendy Soho hotel with great service”", "Author": "neige8", "ReviewID": "UR115703131", "Content": "We got a great rate on booking.com so despite the critical reviews we decided to give it a try. PROS: Staff is really friendly and helpful. Super comfortable bed & pillows. Great soho location- shopping & close to the subway. Cool entrance, lobby and restaurant Nice Complimentary breakfast Hip blue and white themed rooms. Nice smelling bath products. IPads in all the rooms. Con. No free wifi and you pay per day & per device ( how hard is it to make this free) Taxis have no idea where this hotel is- make sure you have the address. Shower head aimed right at door- could not adjust it so it got water all over the bathroom floor. Small rooms- but where arranged to maximize the space. Overall we had a great stay and loved the trendy design and friendly service.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Very clean and with Great Service”", "Author": "andrykowski", "ReviewID": "UR115556628", "Content": "Great location with incredible views of the Hudson River, Empire State Building and the Brooklyn Bridge. Very close to shops and subways.I stayed at the hotel for a number of weeks and the service made me feel as if I were the only one there. I highly recommend this hotel.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“A little jewel downtown”", "Author": "magsweeney", "ReviewID": "UR115449561", "Content": "This is a really comfortable, funky and modern oasis in the midst of downtown Manhattan. Its beautiful entrance draws you in to a very smart, chic and friendly hotel that feels just a little bit different to other hotels. Bedrooms are really lovely and fresh and the hotel atmosphere is really classy and welcoming. Staff are very friendly, helpful and engage very professionally. This is a real little gem of a hotel , one which I'd recommend without reservation. We'll be back", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Service": "4"}, "AuthorLocation": "Orlando, Florida", "Title": "“nice and clean boutique hotel”", "Author": "LunaLaila", "ReviewID": "UR115354604", "Content": "I was there for a business meeting with a group of 12. The hotel room was a little small but very clean. There was an Ipad, but you can't use it fully. It's just for alarm and some hotel things. The metting rooms were good and food pretty good. The walls between rooms were very thin and I could hear what was going on next door. The area is good and short walking distance from stores and restaurants. There was a restaurant close by, La esquina, it was great. Make reservations for the regular underground dining room.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Gurgaon, India", "Title": "“Very stylish, great location, not family friendly”", "Author": "SSGurgaon", "ReviewID": "UR115315387", "Content": "We were booked here by our NY based friends on our USA tour last month and I was kind of skeptical about this hotel as was travelling with a child (8 yr old) and this hotel didnt seem at all family types. Well it surely is very hip, great location, had swarms of trendily dressed people in the evenings and while we did not exactly fit their desired clientele (read below 30s, nattily-dressed, party-animal sorts), the staff was always very nice and helpful. I found the room awfully small, we had a Double Twin bed room and there was barely any room around the beds, the bathroom was also tiny. I found the decor also wierd, stark white with some slashes of blue. But the beds were super-comfy with loads of pillows. They also need to light up the elevators a little bit more which are kept awfully dark for some reason (style again ??). And they really need to put a signage for the hotel outside, our cab went twice the street up and down before we found it.", "Date": "July 13, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York City, New York", "Title": "“Great hotel and personal!!!”", "Author": "Hattur631", "ReviewID": "UR114936453", "Content": "First time I write here but feel I need to because I use this site a lot and read some bad comments about the service before I arrived. If that was the case, that has definetelly been fixed. To give you couple of examples, I just got filled on my mini bar with cold beer at lunch. The one filling my mini bar did go specially to an empty room to get cold beers without me asking. The conciere fixes impossible theatre tickets to Book of Mormon (they have sold the productions seats until September) and the personal service of knowing who you are and where you come from from the first day and still very laid back. Have to mention that the double egg breakfast is to die for! You call for something and it is there in a minute. To name some, I have stayed at Tribecca Grand, Soho Grand, couple of W hotels, Hudson and several others in that genre here in NYC and I can say that Mondrian tops them all! It is a new Morgan hotel so no need to write anything about the facilities, they are top notch. Why am I writing this? Guess I just wants people like me to experience a great hotel in this wonderful town. The hotel is the foundation of a good trip and mine has definetelly been that and I have a few days left that I am looking forward to :-) Kris", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Absolutely fabulous”", "Author": "azanboutiquefan", "ReviewID": "UR114920292", "Content": "I stayed at Mondrian last week for one night, and let me tell you that i had an amazing experience. I live in new- york and we rented the room for a litle getaway with my wife. From the amazing decor, the beautiful and great staff we had an experience to remember. We definitly coming back as soon as we can .. I would recommend this hotel to anybody that wants to have different hotel experience.", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“Very cool movie-like hotel, amazing beds”", "Author": "rabbunn", "ReviewID": "UR113475336", "Content": "I stayed a night with my boyfriend and the staff was very nice and accommodating. The bed was awesome, we felt like we were sleeping on clouds. Only bad thing was that housekeeping woke us up at 10. Yes, we know check out is at noon, but if we came back late and can squeeze in one more hour of sleep before a long trip back (and considering that the price is not a bargain), then please let us wake up to the alarm - we'll still check out at 12 and you can clean the room then.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Excellent”", "Author": "kanta79", "ReviewID": "UR113433614", "Content": "Having read the review below, (dated 12/6) I throughly disagree with the review. I think the hotel got it extremley right when they picked the group of people that it wanted to attract. I Travel to NYC 4/5 times a year, this has got to be the best place I have stayed in by far, location, room and stay was excellent. Only fault I would say that there should be a sign as you enter to direct you to the next floor as its unclear where the reception is. Also the continental breakfast is very disappointing - I wouldnt bother to include this as a part of the deal. There are plenty of cheaper places to have breakfast a few blocks away.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“A force to be reckoned with!”", "Author": "sdchalmers", "ReviewID": "UR113399425", "Content": "From start to finish our stay was for lack of a better word, incredible. The design, location and especially the staff made our stay faultless. We will definitely be back.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Brussels, Belgium", "Title": "“The epitome of pretenciousness”", "Author": "fry_xx", "ReviewID": "UR112978390", "Content": "The location is good, this is undeniable. But the hotel pretends being trendy, hip, cool, classy and... it is none of those things. It is just pretentious (decoration, service, restaurant) and makes you feel totally unwelcome in the hotel, especially in the common areas, if you do not fit the type of client they are trying to attract. For a hotel of this prize, they should make you feel like you're the king of NY; in my case, I felt as though I was in the wrong place at all times. The hotel needs to make up their mind on whether they want 'normal' clients (if you are really a normal person you will know what I mean) or they just want the type of people who dress up like italian pimps at all times of the day. I've been in five-star hotels more expensive than this one and never felt unwelcome or out of place, so it is not a question of prize or stars, it is a deliberate choice of the management. If you don't think I am good enough for your hotel, please let me know before taking my money. The only good thing I can say about it is that the bed was comfortable and... yep, that's it.", "Date": "June 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Can NOT fault this hotel”", "Author": "fromlondon66", "ReviewID": "UR112428173", "Content": "Stayed here for 5 nights, we had a lovely room with an amazing view. Checked in with ease and were greeted with such a warm welcome. The room was perfect and having the I Pad in the room is a great bonus. le. The staff could not be more helpful here. I was staying for pleasure but would use this hotel for any future business trips too, as they pull out all the stops to make sure your stay is not only comfortable but memorable. A special thank you to concierge for checking me in on my flight back to london and printing my boarding pass for me and to the bell boys who stood outside in rush hour to ensure I got a cab on time to the airport. All in all the rooms are a good size, stylish and very comfertable, for the value for money this hotel excels. However it is the friendly staff that make this hotel so great.", "Date": "June 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Doing NYC right!”", "Author": "SashaYayo", "ReviewID": "UR112406549", "Content": "spend some time in the lounge and do yourself a favor, order a mojito, Number Eight and Number Nine from the cocktail menu. You will not be disappointed. A big thank you to the staff who made our newly engaged stay absolutely perfect! We'll definitely be staying here next time we're in NYC! What up Mondrian SOHO!", "Date": "June 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Modern New York Style at it'd Best”", "Author": "MikeLondonNW", "ReviewID": "UR111600135", "Content": "I was in New York with my sister for my nephews graduation and decided to stay at Mondrian Soho for it reputation, and location. We were not dissapointed, in fact the hotel exceeded our expectations in every way. The staff were so friendly, concierge's, Lubna and Rachel, gave us great origonal suggestions, always with a cheerful smile.The recepton team, including Kate and Sasha, were a delight. Cannot wait to return ad make more use of the fabulous bar!", "Date": "June 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“bottom line---I WILL BE BACK!”", "Author": "WindycityGAL82", "ReviewID": "UR111306890", "Content": "I recently stayed at the Mondrian with some friends and absolutely LOVED it! It is in the heart of Soho and the views from the hotel are amazing. I felt relaxed as soon as I entered the hotel because of its cleanliness and the beautiful blue and white color scheme! The people at the reception desk were extremely friendly and very helpful in answering any questions that we had so I would say that the staff and service are the best that I've come across in the City. The bar decor is chic and fabulous and the food at Imperial is impeccable! I will definitely look no further when booking a hotel in New York City...The Mondrian Soho is the way to go!", "Date": "June 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Vancouver, BC", "Title": "“Funky/cool SOHO hotel.”", "Author": "MikeDVancouver_BC", "ReviewID": "UR110434363", "Content": "We really enjoyed our stay at the Mondrian SOHO over the past four days. The hotel is beautiful, the location is great for SOHO shopping, the food in the restaurant is creative and amazing, and the staff has clearly been hired for their positive attitudes and love of customer service. Quick note: the restaurant/bar is rockin' well past 2am so make sure your room is at least on the 5th floor or not on Crosby Street or you'll hear the subwoofer pounding. We're definitely staying there again.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“mondrian soho is a winner!”", "Author": "spiritedtraveller51", "ReviewID": "UR109983789", "Content": "The Mondrian Soho is ideally located,in the heart of Soho,but on a side street with much less noise.Entryway and lobby inviting with a cool,chic sparse decor.Check-in upstairs,from entering to check-in,entire process seamless.The rooms exude style and while a tad tight,are efficiently laid out,including I Pads in each room.Bathrooms had a good strong shower and lots of room for toiletries,a plus in my books.The bar and breakfast area downstairs were casually inviting with a good variety of nibbles and drinks.Concierge was top notch and very helpful.Would return in a heartbeat!", "Date": "May 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Classy new hotel from Morgan's group in Soho, worth the visit”", "Author": "barbaraGeneva", "ReviewID": "UR109310289", "Content": "This hotel is the latest from the Morgan group, my favorite hotel group worldwide. When they offered a special deal in advance of the opening, I booked it for a New York business trip. The neighborhood is great, once you find the hotel--close to the corner of Howard and Crosby, or one block north of Lafayette and Canal Street. We were upgraded to a king suite--the two rooms together were the size of a spacious uptown double room (Sofitel, eg). The spectacular view across the rooftops from the floor to ceiling windows made time spent in the room incredibly agreeable. The bathroom configuration was interesting--all marble, a big shower and toilet in one room with a large frosted window, and the tiny sink on top of the fridge/minibar next to the entry. The color scheme is blue on white, soothing. The hotel is home to the most beautiful atrium bar I have ever seen in New York, drinks are very good but pricey at $20 for a martini. Downstairs reception-men are really helpful for info and cabs and whatever; reception is one flight up and personnel are helpful. The hotel opened just two months ago so housekeeping--impeccable at all Morgan hotels--is still fine-tuning.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Chapel Hill, North Carolina", "Title": "“Beware 'the glitch'! Serious safety issue!”", "Author": "mailtruck", "ReviewID": "UR108621334", "Content": "My wife arrived one night ahead of me for a three night stay. At 4am, she was awakened by someone who had just checked in and been given a key to our room! Luckily she had the safety latch locked. She called the front desk and they said it was a 'glitch.' They were totally unapologetic and unconcerned. That is a total lack of understanding of the importance of safety and security in a hotel, not to mention a terrible way to treat a customer who had just been frightened and was staying in her room alone. The next morning my wife tracked down the manager, who was more responsive and did comp us a free dinner after some negotiations. The manager said she had heard about the incident from the staff. I would have preferred if she had approached us about it if she knew that it had happened. There was not a good explanation of how this serious safety issue could have happened or whether they knew how to prevent it from happening again. Of lesser concern, but also problematic, is the room entrance design, which places your neighbor's door directly facing yours about three feet away in a very small hallway. This creates huge noise issues as your neighbor enters and exits their room (in our case every night very late). Noise is a big problem here as the walls are also poorly insulated. It is a great location, and our waiter at Imperial No. 9 was fantastic, but I can't recommend this hotel.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Nice hotel, terrible service”", "Author": "jwoodlee", "ReviewID": "UR106797020", "Content": "I usually stay in the Meatpacking District near my office but I wanted to try the new Mondrian Soho as they have fun properties elsewhere. I called to make my reservation as their booking system wasn't working and I was arriving on a redeye and wanted to have a room ready that morning. They didn't note that properly and cancelled my entire reservation when I didn't check in the prior night. Reservations couldn't help, the front desk couldn't help get me into a room so I could shower and change for my meetings. They were inflexible and generally unhelpful, especially considering it was their fault. Not even close to the level of service expected from such a luxury hotel. I will never stay again.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "SÃ£o Paulo, Brazil", "Title": "“great stay”", "Author": "F_Brz", "ReviewID": "UR105323795", "Content": "Stayed here for 4 nights in april, business trip. The rooms are clean, comfortable and silent. We got a room on the 21st floor - you can have a shower with a beautiful view of NY from the large window in the bathroom. There was an iPad in the room, providing information and concierge services. Service was great, from the doorman to the concierge. I needed help with some packages sent in the name of another person by mistake and the staff found them in just a few minutes. The doorman was extremely helpful, running almost a block to hail a cab for us when we left. I would stay there again for sure.", "Date": "April 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“A New Hotel that is a dump and cheaply built.”", "Author": "RichardQ61", "ReviewID": "UR105304569", "Content": "This opened in February and the rooms are terrible. Very small desk, very small sink counter. You can tell the rooms were cheaply put together with cheap wood trim and cheap closet door. Desk is very small, almost not big enough for my small computer. You have order ice from room service, which took 30-40 minutes everytime and one time they did not send it at all. The hostess at the \"gate\" to the dining room or bar, ignores you until she is ready to talk to you. You get the inpression you are not good enough to be in her space. They have tried to cram everything into a small space and it shows. I have stayed at the W , Times Square many times and it can be on the small side but there is far more space and a far nicer hotel. The bed was very comfortable and the bell service was very good. On Sat night at 7:00 PM I wanted some restaurant recomends and the concierge was not even there. The hotel is located in nowhere land. It is at the far end of SOHO where there is nothing happening or close restaurants. You have to walk several blocks to shopping or have dinner. Had I arrived on Wed night instead of Thursday, I would have definitely checked out and moved to another hotel. For the very large dollars I paid , I really feel it is a way overpriced hotel.", "Date": "April 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oxford UK", "Title": "“Super Cool NY Hotel”", "Author": "Louisesy", "ReviewID": "UR104437240", "Content": "Booked a 4 night stay with my friend with an introductory rate..(soft opening) We were not sure what to expect but we were so impressed with the location, the staff, and the comfy clean room. The room was small but very well equipped with ipad. The staff were always pleasant and very professional and went out of their way to be helpful, especially, Jonathan on the door, Ian head of front desk and the lovely concierge lady, sorry we cant remember her name . This is a funky cool new hotel and even though we are nearly fifty we did not feel out of place. We enjoyed meeting fun people from all walks of life. From reading previous reviews with many complaints we feel that there are bound to be glitches in a new hotel and we had our share (ie:phone not working) but these were rectified immediately. It has been a long time since we have stayed in such a fun hotel with great people...", "Date": "April 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great stay overall”", "Author": "Pinky Pig", "ReviewID": "UR104396452", "Content": "Stayed here for 3 nights during the opening period with my husband and 10 month old baby. We had a lovely room on around 15 Floor. I was worried about noise but didn't hear any (just our own adorable screaming baby in the middle of the night!) On arrival we tried to check in but had to wait several hours - think it was about 6pm when we finally got our room. They gave us a round of free drinks and a small upgrade so we were fairly happy with that. The rooms are lovely and ours had a great view. We had one with a broken towel rail - it got fixed almost immediately. Our ipad didn't work - tech support fixed it asap. Water pressure in the main shower head was useless but the secondary middle shower head was fine and we managed that way. We loved the door staff. One night we had torrential rain and the guy was out in it for 15 minutes tracking down a cab for us in the rain (thanks guys!) One tip if travelling with a baby: there is no kettle or teamaking facility in the room so heating anything ie bottles or food is almost impossible without a bottle warmer (which I didn't have!) The kitchen were happy to give me a jug of boiled water which I took to the room. Concierge arranged us a good car service with baby seat for transfer to JFK. All in all we really liked it. A fun, relaxed hotel with a 'cool young' vibe that was ok even for us late 30-somethings!", "Date": "April 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“GREAT STAFF......LOCATION PERFECT”", "Author": "hayd1405", "ReviewID": "UR103966026", "Content": "I was fortunate enough to stay in a Suite at this new hotel in Soho and wow what views of Broadway I had. The room was super comfy, bed was everything a bed away from home should be. The restaurant downstairs Imperial 9 was perfect for a drink or meal, great ambiance and super cool. The guys who ran the doors were so helpful to out of towner's with directions and subway info, made life very easy. I'm heading back in June and I wont be trying a new hotel.", "Date": "April 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York, New York", "Title": "“Put the hotel to the test”", "Author": "tmonk1968", "ReviewID": "UR103824225", "Content": "After reading the Tripadivsor reviews I expected the worst from the Mondrian. I expected the business cards I sent, via FedEx, to be lost (but they weren't. Instead, I picked them up from the front desk right on time). I expected the staff to be inattentive (but they were very quick to meet my needs). I expected it to be difficult to hail a cab (but it wasn't - in fact, the doorman actually ran a block and a half up the street to hail a cab). I expected poor service from the concierge (but it was absolutely stellar - in fact, Rachel, the concierge at the time, recommended a fantastic little neighborhood gem of a burger joint just perfect for a quiet, cozy dinner.). I expected room service to be slow (but it was perfectly timed). I really can't think of any other tests to put the Mondrian through. It looks like they've incorporated their learnings from previous responses and are well on their way of becoming a fantastic hotel. Will I be back? Yep - absolutely.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sandy Hook, Connecticut", "Title": "“Beautiful, but not Perfect”", "Author": "TomCT714", "ReviewID": "UR103774889", "Content": "I stayed at the Mondrian Soho for two nights, which was a combination of a business meeting and some time for relaxation. The hotel is very trendy and beautiful. As other reviews have stated, there is no visible sign outside and no directions to reception when you first walk in...but it's not that hard if you know the address and/or have seen pictures! I'm not a cab person...I prefer the subway, and the NQR/6 is right around the corner. Also steps to Chinatown and Little Italy and nice shopping, either boutique or Bloomingdales. The bed in my room was extremely comfortable and I can say that I had two of the best nights of sleep. The walls are extremely thin. I did not mind any of the noise from the lobby...not did I hear much of it once I reached my room. The music in the lobby and the halls fit the hotel very well. I would not expect rooms to be completely soundproof, but I was upset at being able to hear even the smallest noises (people zipping up their clothes next door when getting dressed in the morning) or conversations of the housekeeping members in the hallway and on their walkies. I did not complain, as I would not expect the hotel to ask someone to zipper quietly or re-insulate the walls during my stay, but sound between rooms and the hallway is something they should consider for the future. Housekeeping is done until 10pm at night. On my first day out, I came back from a meeting at 4pm and my room had not yet been made up. I wanted to take a nap before going out for the evening, and even though I put out a privacy sign, I got a call from housekeeping (after hearing a walkie talkie outside my door) asking when they could make up the room. I did see that on the iPad in the room, there is a section to request housekeeping, so it may be beneficial to use that when you first go out for the day so that you come back to a made-up room. By biggest problem was at check-in. As a little background info, I am one of the people who no longer carries a credit card. I have a debit card that can be swiped as a credit card. I usually keep my funds in savings, and transfer over small amounts to my card account to use when needed. So upon check-in, my hotel room was paid. I was asked to see a credit card, which would not be charged, but used to put a hold for incidentals. I was told that the card was declined and asked for another charge. When I asked the hold about, I was told that $300 was held for incidentals. I understand that copying a card or holding a small amount is common, but I found $300 to be very large. I didn't want to explain my full financial arrangements to the lady at check-in, but I told her that I would need to transfer some money over. I could not get internet service on my phone, and she told me that people tend to get service near the terrace. I still could not, so walked downstair and outside to call my bank, and by that time was unable to complete the transaction. I had enough to pay for the hotel, have a little cash for the night, and planned to do my transferring in the morning. I asked her (Kate, I believe), if there was any way I they could amend this to $150 until the morning. She spoke to her manager and came back and was able to do that. I have to say that Kate was extremely pleasant in what could have been an embarrassing situation for me. I mentioned that the $300 hold was not on my reservation or any paperwork and she apologized for that. Nothing was her fault and she handled it well. However, I believe that the hotel should let a guest know the hold beforehand, as $300 is a steeper amount than customary, especially when the room is fully paid for in advance. It made my first 1/2 hour in the hotel very uncomfortable. After that, besides the non-music hotel noise, I had a great time. I hope to visit this hotel again in the future. I did not get to enjoy the restaurant, but would love to on a future visit. It looked great.", "Date": "April 12, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Felt totally unwelcome.”", "Author": "skip-parker", "ReviewID": "UR103433894", "Content": "First of all, let me begin by saying that i am a seasoned traveler for both work and pleasure. And i have never felt so unwelcome and unwanted at a hotel than at the Mondrian Soho. The hotel is a beautiful, hip, cool-looking hotel in a great location. So when I could get a great rate for a weekend when I had to be in New York for a wedding, i jumped at it. Don't make the same mistake that I did. Yes, it's true, the place looks great. And the rooms, which are tiny, are efficient and nicely appointed and comfortable. But if you want room service, food at the restaurant, drinks at the bar or -- G-D FORBID -- A CAB -- forget about it. What you will get is a total disregard for your happiness or satisfaction. Your room service order: it won't arrive. The woman who took your order never told anyone or wrote it down or remembers you calling. And she won't apologize. She'll act like it's your fault. I actually walked down to the bar and got a pot of coffee, a tray, two cups and carried to to my room on my own. If i had left it to them, I'd still be waiting for coffee. Food at the restaurant? That depends. They don't serve between 3 and 5 pm. So no snacks after you've gone shopping. Of course, some staff will say that they have food. Others won't. The truth is: no food between 3 and 5. How convenient. Drinks at the bar? Hmmm. Let's see, you won't even get the hip waiters to even pay attention to you, so you're not getting a drink. But they may walk by and say, \"I'll be with you,\" and never come back. That will happen, for sure. Want a cab? You're not getting one with this location. The doormen, who may be the only slightly helpful staff at all, tried in vain to flag down a cab for me. But this location does not lend itself to getting a cab. Allow yourself 30 minutes to try and get a cab. Seriously. It took me 30 minutes on a Saturday night at 7. In nice weather. When I checked out, I very nicely told the front desk that I didn't appreciate how their staff gave me misinformation and made feel so unwelcome. The woman, suddenly acting friendly, regurgitated an apology. My advice: don't go there. Unless you want to see the most-depressing, dark, dank workout room ever built in a windowless basement. A down on his luck Rocky Balboa wouldn't have worked out there.", "Date": "April 9, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "LA", "Title": "“Worst service ever.”", "Author": "katherinett", "ReviewID": "UR102985410", "Content": "I arrived in the afternoon, had to shower and hurry out for a function, and called downstairs to ask for a shower cap. \"We don't have shower caps,\" I was told by Kate at the front desk, \"but you can go down the street to Duane Reade and get one.\" It was freezing rain outside. (The correct response would have been, \"Let me have someone run out and get you one.\" Also, what hotel doesn't stock shower caps? In the 4 days I stayed, the very heavy front door was held open for me once. There is no room service after midnight, and you can't get anything to eat in the hotel lobby between 3.30 and 5.30. The general attitude of the service staff is disinterested and lazy. The bedding is cushy, but you can't sleep for the constant thumping of the house music through 4am.", "Date": "April 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Centreville,MD", "Title": "“Beautiful Hotel”", "Author": "lexon", "ReviewID": "UR102461410", "Content": "Stayed 3 nights with my 14 year old daughter-explored SOHo and had a great time-Much more relaxing than staying in mid-town-Plan to stay here on my next visit to NYC-Everything was perfect", "Date": "April 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New Haven CT", "Title": "“interesting hotel”", "Author": "Snodgrass999", "ReviewID": "UR102408288", "Content": "Loved the overall look and feel of the hotel.....Its not that easy to find but it is an easy walk from the subway. We waited in the restaurant/bar for our room (available at 3 ) the service was very good and enthusiastic. Now the not so good part, we went upstairs to get our key at 3 and the young man at the desk did not even look at us. We waited and waited until finally I said \" can you please help us or at least call someone who can. He briefly looked up and went back to his typing. He then called through a door and a young lady came out to help. This entire process took over 15 min. There were no other guests in the lobby at the time. We went up to our room, it was clean, white and fun (no issues there).We did not have a problem with noise like in other reviews (15th Floor) I have to mention that the elevator is a little to dark and moody, You really cant see who is in there with you. Maybe that's the point ! I dont know! Finally, breakfast was great, and the service was perfect \"Eduardo\" was our waiter. If hotel management read this, hold onto that guy he is great.......an asset", "Date": "April 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baldwinsville NY", "Title": "“Overall...great experience”", "Author": "PatriciaJ51", "ReviewID": "UR101555588", "Content": "I recently celebrated my 60th birthday with a trip to NYC and a stay at the Mondrian SoHo. I was very excited to discover the hotel and to book the weekend at a very good introductory rate. I was enticed by the press that I read and by the whole experience of being at a hotel during its opening weeks. I have to say that, overall, I was not disappointed. The vine-covered entry way and outdoor \"courtyard\" were very welcoming. The funky, artsy blue and white decor of the lobby was quite unique. It was little confusing getting to the front desk (located on the second floor), and we started up the stairs with our luggage in tow, as we were unaware of the location of the elevator. But an employee quickly assisted me in carrying it up the stairs. We arrived from the airport at 1:30, but could not check in earlier than 3:00. The management did, however, store our luggage as we wandered around the area. (The location is great! I much prefer the little shops and restaurants in this part of the city to midtown.) When we got to the room, I was definitely impressed with the cleanliness and comfort...and, yes, with the ipad! The pillows are absolutely the best pillows I have ever had in a hotel! On the issue of noisiness, I had read reviews complaining about the \"thin walls.\" So we mentioned to the desk upon check-in that I was a light sleeper, so we got a room on the 23rd floor. We had no issue with noise, and the view was astounding! During our stay we experienced both the bar and restaurant. Though not inexpensive, both were excellent! And kudos to the bartender on Sunday morning...great guy! Actually, all of the staff was extremely friendly and helpful. But, there were a couple of glitches: it took quite a while for us to get our luggage after checking into the room. We actually had to call to track it down. There needs to be some more specific written directions in each room as to how to operate the ipod dock and the ipad. The tap water had a strange milky appearance...the hotel needs to provide bottled-water for no cost. We had a leak from under the sink and called the front desk. No one ever showed up to look into it. And the night club-like atmosphere in the bar and lobby at night was a little intimidating for those of us who are far beyond being 30 somethings! But, all in all, I would recommend this hotel. The management seems responsive to working on the glitches. The Mondrian SoHo is on its way to being a fine hotel!", "Date": "March 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "2.0", "Rooms": "3", "Service": "3", "Location": "5"}, "AuthorLocation": "london", "Title": "“Don't stay here if you actually want to sleep”", "Author": "kategem", "ReviewID": "UR101503424", "Content": "I'm not a precious traveller. I swear I'm not. But when you can hear every cough, footstep, door opening, door closing and elevator ping that happens, ALL NIGHT LONG, then you tend to get a little fed up. This hotel isn't soundproofed. At all. Maybe the good reviews, below, are from people who stayed before the hotel was full. Because if there's more than one person on the floor, it's ridiculous. And the elevator ping is way too loud. My room was the furtherest away from the elevator yet every time it arrived, I heard it. A doubleping. When you're standing next to it, it's geniunely deafening. Room service arrived promptly - food was middling, a 'main' salad was the size of a side, arrived without any bread or anything like that. The people are young, goodloooking, charming - but you can get that at any Soho hotel. And the room is tiny, cold, and beautiful. All in all, this place is severely style over substance. Why someone would build a potentially beautiful hotel and then give it the soundproofing qualities of an open hospital ward is beyond me.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Impeccable Experiance”", "Author": "cam516", "ReviewID": "UR101187277", "Content": "I must stay, being a long-time resident of the city, that the service we received was absolutely amazing. My wife and I spent the weekend at the Mondrian for a little \"staycation\" and had a marvelous time. Wilson, thank you for the hospitality.", "Date": "March 22, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Columbus, GA", "Title": "“Room Discrepancies and Horrible Customer Service”", "Author": "zonainhi", "ReviewID": "UR101098059", "Content": "Terrible overall experience. My girlfriend and I stayed at the hotel for one night and used the restaurant for a nice meal; the total cost was $700+. For that price, you would expect the phones to work (they didn't), room service (there was none), free internet (you pay for it), and flawless AC/heating (the unit is loud). You would also expect the valet to not leave your car unattended on the street with the keys inside (he did). Lastly, you would expect the staff to knock before entering your room (they did not, and a security worker walked in on my girlfriend and I while we were completely disrobed and being intimate). How did the hotel show concern for my horrible experience? 10% off the room price only (a $28 discount on my $700+ bill) and failing to return my emails. Give your money to somebody else; this place is horrible.", "Date": "March 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "xxx", "Title": "“Fabulous!”", "Author": "pacha23", "ReviewID": "UR100631530", "Content": "I stayed for 3 nights in a Superior King and experienced all the beauty and not the beast. Location: just perfect! Although the Crosby Street entrance was temporarily closed due to improvements. Our check-in with Dean was very professional and friendly. Our room was available at 1:00 pm. Room: gorgeous with a fabulous city view, including the Empire state building. I loved the blue and white design with all the mirrors, especially the blue one. The bed was just great. Very stylish and functional details, such as the wardrobe space or the shower. A fresh orchid and great bathroom amentities by Malin Goetz. We even got the Mondrian Soho cupcake. Although the hotel seemed quite booked and there were neighbours in the rooms next to us, we weren't bothered by and noise. Excellent room service - there were even check-ups wether the rooms were done properly - nobody should complain that they don't try to improve. And if you ran into service employees on the floor they were always very friendly and helpful. A request at the front desk was fulfilled within 25 minutes. Public spaces: simply stunning and beautiful with extraordinary design, although you sometimes need to get used to the darkness, especially in the elevators (but they turned up to the lighting). Check-out was quick and friendly, too and we got a late check-out. I can only recommend the Mondrian Soho, as I had a wonderful stay and I can't wait to come back there when I'm next time in New York...", "Date": "March 18, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Melbourne", "Title": "“Yikes”", "Author": "Britboyscott", "ReviewID": "UR100567270", "Content": "I stayed here for 3 nights. Of course all the trendiness we expect from the brand. I was on a low floor and the roadworks disurbed me. They have a great guest experience manager who moved me after front desk said I had to pay a surcharge to move to a suite. Room was good, but unfortunately the reviews I'd read about the thin walls eventuated. I have to say that hearing people having sex is quite revolting to me. How on earth can people who design hotels let this happen. Tomorrow moving to Murray Hill for the rest of my 2 week stay", "Date": "March 17, 2011"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "New York City, New York", "Title": "“Shocking Customer Service Before I have even stepped into the hotel!”", "Author": "u586148", "ReviewID": "UR100481794", "Content": "I have recently got engaged and have been looking for a place to hold the wedding, after viewing the website and reading reviews we were very interested in viewing the Mondrian Hotel in Soho. HOWEVER.. it has now been four days attempting to actually speak to someone so I have now given up! I have left numerous voicemails and actually spoken to two people who have taken my contacts details but the promise of someone calling me back has not materialized. Now as I have never been in the hotel I am unable to speak for the service recieved whilst staying there but if this is an indication of the service being given considering the money I am willing to spend I would stay away from this hotel.", "Date": "March 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“NEW STANDARD IN SOHO”", "Author": "interestingvibe", "ReviewID": "UR100259017", "Content": "Soho has always been cool, but with the addition of the Mondrian it is now not only cool but chic, comfortable, and service oriented. I enjoyed 3 days of bliss on crosby, great room, great bar, and great service. What I find amazing is that the hotel has been open for a week. I cant wait to go back after a month or a year. Congrats to morgans hotels for another rocking destination. My favorite is Delano but in NYC Mondrian will be my choice.", "Date": "March 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Princeton, New Jersey", "Title": "“Trendy decor but very thin walls”", "Author": "eliztravel", "ReviewID": "UR100024152", "Content": "Stayed here last night with spouse. NIce common areas ; trendy decor. Bar very busy at midnight. Room small and clean. Had a superior king room on 7th floor which had a door to an adjoining room - every sound from next door could be heard especially the loud, expletive ridden rant the occupant choose to give at 3 am. Normal level conversation also could be clearly heard as could shower, tv, hairdryer. Didn't make for a good nights sleep. Had pleasant lunch in restaurant - food nice and well presented. I pointed out to our server that ours and several other tables had the silverware set incorrectly - knife and fork reversed and glass on wrong side - he barely acknowledged this and did nothing to change any of the other tables. Very unprofessional.", "Date": "March 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“AMAZING!”", "Author": "amkaur", "ReviewID": "UR99638009", "Content": "I stayed at the Mondiran SoHo for 4night from March 4th. On arriving my check-in was smooth and very quick. I stayed on the 5th floor which still had pretty decent views of the city. My room was big enough and the bathroom was very large too, the room was amazing in the quality of the fittings and the bed was way too comfy! I had no problems with thin walls or noise from anyone else. The best bit about the hotel for me was Imperial No. Nine. Breakfast everyday was lovely! The staff at the bar were 1st class and so friendly, by the end of my stay the all the bar staff and security knew me by first name and would always stop to have a chat with me. It felt like chatting to friends, the hotel ahs a very personal touch and this shows in all the staff! I have been a Morgan's hotel junkie for a few years and i have to say this is the best hotel i have stayed in. I can't wait to stay again!", "Date": "March 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South Dakota", "Title": "“A Treat”", "Author": "cybee", "ReviewID": "UR99340666", "Content": "We stayed at the Mondrian Soho the first Friday they were open, so it was still well within the soft opening time frame and thus there were some initial kinks. Our room was not ready (turned out to be trashed by prior client) so we were upgraded to a double double room which also was not ready. No matter, we went to eat at Balthazar as the room was readied (Good resto not far from this hotel). Alas, the room was still not ready when we returned. Once we did have our room, we so enjoyed our stay! Now, keep in mind there is no sign in the front. It is a lovely vined front and while not fully completed when we were there, there is now an arched vined walkway in to the front door ( a \"verdant entryway\"). We were met greeted at the front door (Crosby Street) by a young fellow who took our bags and advised us to go up the stairs to the second floor to check in. As we entered the main floor, it was a delight to see the large blue chairs and artsy set up with fun Dr. Suessesque fluffy tall lamps. Of course, this is to channel the early (non-Disney) Beauty and the Beast movie. Thus one could describe some of the chairs as large enough for a beast but lovely enough for a beauty! Up the stairs we went, and Shawn (Sean) was a very gracious and friendly staff member who did the best to accommodate us as we checked in despite the problems of room availability due to previous late staying (and errant) guests. Once in our room, I was delighted again with the decor of white, blue and chrome! The pillows with the blue design are such a lovely accent. The view from our window was absolutely great! Yes, you do have a free iPad in your room (don't lose/take it...will cost you dearly!). The shower was great and the beds most comfy! We found our room to be quiet. In the morning we were delighted to have a free continental breakfast since it was soft opening time and Imperial 9 (the restaurant) was not open yet (opened March 1, I believe). We were most pleased with the food and decor of Imperial 9! I sat on a pretty golden benchette and I noted there were tastefully done \"fish scaled\" walls. Truly would love to go again! It had kinks to work out during the soft opening but despite that bumpy start, it was a true treat to stay at the Mondrian Soho.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Pennsylvania", "Title": "“small, loud and trendy”", "Author": "atravelergal", "ReviewID": "UR99242011", "Content": "The new hotel has a great design from the street and lobby but the rooms are small- extremely loud (from neighbors and street noise- you can hear a conversation down the hall and the subway). The staff seems to be struggling- we saw several people changing rooms and complaining at the front desk. The room and bathroom were very small. The views were great and the location was convenient. Probably best to go for a drink at the hotel and not to stay overnight. I am not planning on returning.", "Date": "March 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Beautiful Hotel. Great Location. Brilliant Staff”", "Author": "M4RKM", "ReviewID": "UR98708895", "Content": "Well, what can I say. I stayed here for one night, in room 406. View looked out on a courtyard, and another building, but those windows are something amazing, and let so much natural light into the room. It's better than my own bedroom back home. It is still in a soft opening stage, so I can forgive them for an empty mini bar, but the amenities in the room, loads of towels, amazing toiletries, and one of the best showers I've ever experienced easily made up for it. Then there is the bed. Sprung Mattress, plus memory foam topper on it, luxurious pillows, and numerous scatter cushions just made it amazing to sleep on. Solid sleep and I'm missing that bed already. I didn't hear any issues with walls, even in the morning. Maybe someone else heard my music, using the in room iPod Dock turned up loud, but, some of the previous reviews just seem a bit over the top, c'mon, what hotel or even house for that matter doesn't have \"thin\" walls. Then there is the staff. Upon check in, and check out, and any dealings I had with the staff, they're so enthusiastic about the hotel, its surroundings, and the amenities, including a demonstration on the in room iPad, (which saved money, as I didn't have to pay for WiFi for the laptop), just made me feel so welcome as a solo traveller, staying for 1 night on a bargain rate. They're obviously trained well, and love their job, which shows. I can see this hotel getting better once all the niggles and the main entrance being finally open, and everything is perfected. It oozes style, and is aiming at a younger crowd. If you want cheaper, stay at the HI down the road, but it won't be the same experience.", "Date": "March 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Charlottetown, Canada", "Title": "“Great for just opening up!”", "Author": "neiko1", "ReviewID": "UR98651062", "Content": "This hotel had just opened 2 days prior to our arrival, I have to say I was a little taken back and didn't know what to expect. Honestly, they did a great job! A few little thing that needed attention but nothing major and they handled everything quickly. Beautiful decor, hip, chic, all the cool stuff you would expect in Soho. Best bed and linen and the views were the best in NYC. We are use to a little larger room with a tub, but what you give up is size you get back in comfort and views. Congratulations to the staff, we will be back.", "Date": "March 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Unique Elegance”", "Author": "cwaisner", "ReviewID": "UR98576378", "Content": "Tucked away on a nice quiet street, just 2 blocks from the hustle and crowds of Soho, the garden entrance leads you into an elaborate and most beautifully colored and soothing lobby giving you a sense of peace, yet the surroundings are similar to other sister hotels. From the seating to lighting, and burst of colors, you already feel at home before you take the elvator to the 2nd floor lobby. Everyone was supper friendly and helpful and once we checked in, we felt like we were at home. The sleeping and seating areas were wonderfully appointed and comfy. Also loved the spacious bathroom, probably the most powerful showerhead in the world! Plenty of storage space yet the room never felt crowded or small. From the 23rd floor, i felt like like i was on top of the world. Would I go back, in a second. I highly recommend it and am planning my next trip already.", "Date": "March 1, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "melbourne", "Title": "“great if you like \"sharing\" your room with complete strangers......”", "Author": "vilany1982", "ReviewID": "UR98572049", "Content": "This hotel has all the visuals to mesmerize you at first and make you believe that you are staying in an \"IT\" hotel. We were as delighted as we could be until we realized that we were \"sharing the room\" with somebody else. Somebody has mentioned thin walls in the other reviews but that does not even start to describe it for me...we heard everything and i MEAN EVERYTHING WE were pretty much in the same room WITH THE PEOPLE NEXT DOOR......making the trip completely miserable ...... You are forced to live on somebody else's schedule when they are ready to go to bed you CAN finally relax too......oh but wait not so fast the windows are so thin you are lucky if you are able to get ANY REST!!!!!!!!!! Listening to people watching adult movies and being intimate at 1 o'clock in the morning is extremely unpleasant ....i have stayed in rooms that opened to each other before BUT NEVER IN ONE THIS POORLY CONSTRUCTED!!!!!!!!!!! WOULD NOT RECOMMEND WHAT SO EVER!!! OR LET ME REPHRASE : DONT GET A ROOM THAT OPENS UP TO ANOTHER ROOM!!!!!!(if that is possible) I honestly could not even focus on anything else in the hotel, i hated returning to our room i hated the place!!!!!!", "Date": "March 1, 2011"}], "HotelInfo": {"Name": "Mondrian Soho", "HotelURL": "/ShowUserReviews-g60763-d1786395-Reviews-Mondrian_Soho-New_York_City_New_York.html", "Price": "$282 - $573*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">9 Crosby Street</span>, <span class=\"locality\"><span property=\"v:locality\">New York City</span>, <span property=\"v:region\">NY</span> <span property=\"v:postal-code\">10013</span></span> </span> </span> </address>", "HotelID": "1786395", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/69/73/6973f0c73e21fec7b22ac3f7a83a963e6large.jpg"}}