{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "1", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Terible area”", "Author": "peymanir", "ReviewID": "UR126595232", "Content": "Location is terrible stuff very impolite the man in reception is very impolite", "Date": "March 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Verona, Italy", "Title": "“Nice experience”", "Author": "Veronica D", "ReviewID": "UR124982417", "Content": "I often visit in Ä°stanbul for business. So I found oppurtunity know many of hotels. But Nobel Hotel was very nice. Firstly all staff very personable and smiling. Rooms are clean and breakfast hall has sea view. Now it's my first choice. Thank you Nobel ...", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Everything is excellent”", "Author": "sofia n", "ReviewID": "UR124658453", "Content": "I and my daughter spent our holiday this private hotel last week. And we pleasured from everything :) Newly renewed. Also quite nice designed at lobby and our room. Besides open buffet breakfast was very good and quality. All staff very gentle. They interesting in whole guest. Transportation is very convenient. In addition they offer free of charge tea facilities for every day. Shortly Ä± advise this hotel everybody.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Good value and a free work-out”", "Author": "Philip W", "ReviewID": "UR120526499", "Content": "Smack-bang in the middle of a working class community but not too shoddy for that. Close to cheap and pretty decent restaurants and it has easy access to the T1 tram line ( a novelty to someone from Edinburgh). Rooms are clean and more than adequate. Unfortunately the lift was broken, which meant a lung-busting climb to the 7th floor breakfast area. On the bright side you were rewarded with great views of the Sea of Marmara and you felt no guilt at piling your plate with the buffet breakfast. Staff were friendly, although the concierge seemed determined to flog me no-end of overpriced trips. All-in-all worth the money.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Belgrade, Serbia", "Title": "“great hotel”", "Author": "jelenayork", "ReviewID": "UR118993357", "Content": "Just came back from long weekend trip to Istanbul. I booked this hotel based on rates and good reviews. Rooms are small but very clean, stuff very helpful. The breakfast room is on a top floor with great view. On a first floor is free internet and very nice lounge room. Very close to tram station, and if you don't want to walk much, tram will take you to Sultanahmet for less than 10 minutes, or Taxim for 15 min. Grand Bazar is 15 min by foot. All in all great hotel, and will recommend it to all my friends.", "Date": "October 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Skopje, Republic of Macedonia", "Title": "“Excellent value.”", "Author": "tinkaminka", "ReviewID": "UR117508523", "Content": "I don't have any complaints regarding this hotel. It was very clean and had everything we needed, including good internet connection. It was conveniently located near the Aksaray metro station, which goes straight to the airport and takes about 40 min to get there. There's also an ATM, pharmacy, restaurants, fruit stands and supermarket very close to the hotel.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cairo Egypt", "Title": "“We loved it and we'll be back again.”", "Author": "Mariam55", "ReviewID": "UR117016997", "Content": "The service we experienced is very good Although the room was small but I liked it , it is clean and has everything you need. The location was good and easy to go to any place you want The amenities in the room were sufficient for our needs. What I liked best is Mrs. Banu , the Manager of the hotel , she is a wonderfull woman and was very helpful and understanding", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "roma", "Title": "“so so hotel”", "Author": "sicisub", "ReviewID": "UR115041020", "Content": "Tha position of the hotel is near the aksaray tram station.Just 10 min by tram or 25 by wark from sultanahmet ( center). The tram is often overcrowded. So maybe is better chose an hotel near sultanahmet. The zone of the hotel is full of russian tourists I booked a twin separate beds for 6 nights.The first night they told me to go in a king bed room just for one night. The day before they rang me at 8.30 am to inform me to stay another day in that room.The 3rd day we moved to the win separate beds room.The 4th day they rang me at 8.30 am to ask me if I wanted to move again to another room. I sayd \"NO, it's enought!!!!\". The wi fi is not good in all the rooms, sometimes it loose the connection. The breakfast is very hearty, but the quality is medium (industrial stuff). Good just the fresh fruit and the yogurt. After some days it sicks. The cleaness of the rooms are insufficient: I found hairs in to the bath tub.They made the beds every days but not always clean the rooms and the bathroom. Positive: they gibe a bottle of wate and a pot of tea every day. the curtains of the rooms are insufficient, so if you don't like the sun in the rooms during the morning it is not confortable.", "Date": "July 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Very clean hotel - good value for money”", "Author": "Mhn22", "ReviewID": "UR94530287", "Content": "The hotel is conveniently placed - close to Aksaray square - so that the main places of interest are within walking distance. The rooms are small but very clean. Dinner is served on a roof terace with a nice view over the city and the sea.", "Date": "January 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“Conveniently located and reasonably priced”", "Author": "boldsoul", "ReviewID": "UR90725106", "Content": "The hotel is located conveniently in the centre of Old Istanbul in the Aksaray district. The tram, which is only a five min. walk from the hotel, will take you to Sultanahmet in fifteen mins. As the weather was surprisingly warm and mild during our stay, we walked to the city centre on several occasions,which only took us about twenty mins. at a leisurely pace. the hotel itself is small and cosy. There is an elevator, which you can take from the first floor. The lobby area is nicely decorated and there is a guest computer with free Internet access. We stayed in a tripple room on the sixths floor,which had a nice view of the sea. Even though it faced a busy shopping street, we didn't have much problem sleeping at night. The interior of the room was plane, and though it was not particularly spacious, it served the purpose. It was also cleaned regularly. What I found lacked in this otherwise fine hotel was a friendly attitude of the reception staff. Sami was the one exception: he was very sociable and friendly. The rest were rather cold and at times indifferent. Another thing that somewhat spoiled my impression of the hotel was an incident involving the 'free' airport transfer that is advertised on the hotel website. As it turned out,though the one way transfer was indeed free, we were expected to fork out 45 euros (later reduced to 25) for our return transfer. I refused to do so, as my family did not require a return transfer. The hotel manager had to be called in,who reluctantly agreed to honour the offer advertised on his hotel's website. All in all, the hotel was a great bargain for the price we paid (as we had booked over six months in advance), but the dodgy transfer offer and the attitude of some of the staff (which probably had something to do with my refusal to pay for the 'free' offer) were the only disappointments in what was otherwise a nice stay. All things considered, I would recommend this hotel.", "Date": "December 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Great service”", "Author": "charmingturkish", "ReviewID": "UR89987755", "Content": "Good location good value and nice friendly people. Helpfull and nice manager Mr.Murat.", "Date": "December 16, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kuwait City, Kuwait", "Title": "“OK Overall”", "Author": "Kholy", "ReviewID": "UR87732619", "Content": "I must admit the hotel is very clean which is what I care about most. On my arrival, I was promised to get a late check-out (at 2 pm) if there was availability on the day of my check-out. On the day of my check-out, I was told that the hotel was fully booked and there was no room for a late check-out unless I pay an extra fee....Didn't make sense to me. The staff are not so friendly (besides one guy there called Simeh who also speaks perfect English).They keep nagging day and night to take you to places, which they claim are must-sees, which gave me a feeling they are getting commission. Actually, they were nagging so much for us to go to a place called SULTANA, and they mislead us with their description of it and asked us maybe 15 times in 2 days to pay before the place gets packed. When we arrived, the place was almost completely empty and the food quality was terrible and was not a buffet nor had \"sheesha\" as claimed. The location of the hotel is very good, close to all the touristic areas, the internet availability sure adds a lot. The rooms are incredibly small. I would recommend this hotel as long as you do not listen to the staff o depend on them to make any plans. I paid almost 65 USD a night which was totally worth it.", "Date": "November 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Excellent Hotel with value for money”", "Author": "Sumit_sawhney", "ReviewID": "UR85949439", "Content": "Hi guyz, I stayed in hotel for 4 nights and found this hotel as value for money. Hotel staff was very helpful not even helped with hotel utilities and room service but also guided us with city sight seeing. Connectivity is very good to the hotel as its in city center. Many places was either walking distance away or connected via tram. Hotel serves breakfast in the morning which loads of variety. We booked 3 rooms and everyone was happy with this hotel. Regards, Sumit", "Date": "November 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great, comfortable and fantastic loaction”", "Author": "Tango008", "ReviewID": "UR85921445", "Content": "I stayed here for two nights travelling alone having just spent the weekend with friends. We found out on Sunday that there was a suicide bomber in Taksim Square and as my friends were leaving Istanbul, the prospect of two days alone was slightly scary. However, the hotel was very comfortable and welcoming. I had a single room which was small but perfect for me. There was a bowl of fruit, water and tea making facilities in the room which was great. The room was clean and had a balcony, a nice feature as sometimes hotel rooms can feel like prison cells. The breakfast was good - fruit, cereal, drinks, cakes, cheese, meats, etc. The breakfast room was on the top floor so you can see South towards the Marmara. The staff in the breakfast room were very efficient - every table was remade as soon as the diners left not like some hotels where you can never find a table that hasn't been used. All of the tables were immaculate and you would think noone ever came to breakfast. My only compaint is that one of the towels was dirty - it had maybe not been checked properly and left by a previous guest - but you know, these things happen. Oh and the rooms have thin walls so sound can travel. Semii is very helpful and is American Turkish so no language barriers. There are lots of shops around and the tram stop is a few minutes walk. It's 2 stops to the grand bazaar and 4 to the Blue Mosque and Hagia Sofia. All are easily walkable though.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Bacau, Romania", "Title": "“excellent city break”", "Author": "anka01", "ReviewID": "UR85682476", "Content": "We where 3 couple family friends who decided to visit Istanbul at the end of october.Everything was excellent in that w-end:the city,the wheather and of course the hotel.At the hotel you find the most friendliest staff always there to help you with anything, the breakfast is nice and the rooms are clean.When we came back for sure we will pick the same hotel.", "Date": "November 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Burbank, California", "Title": "“best hotel and services”", "Author": "Leila234", "ReviewID": "UR84124910", "Content": "My entire experience at this hotel was excellent!! I loved it and will defianetly recommend it to others. Very clean place, rooms are nice and the most friendliest staff always there to help you with anything.", "Date": "October 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dushanbe", "Title": "“Home in heart of Istanbul, all in one”", "Author": "Pilot7777", "ReviewID": "UR76129315", "Content": "Traveled a lot, but 2nd time to Turkey and first time to Istanbul.Lool for hotel not far from Attraction places. Like the hotel: Breakfast is very nice, rooms are clean, no problems with hot and cold water. Main think I like easy access to tram and Mc Donalds. Will stay in Nobel Hotel next time and advice to friends. I enjoy Wi Fi and very nice lobby which is in 2nd floor, aristocratic decoration and looks like that You are in some room of the castle in 17th or 16th century.", "Date": "August 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "vancouver", "Title": "“My home in Istanbul”", "Author": "verchun", "ReviewID": "UR75136625", "Content": "I stayed at this hotel for 8 days this summer and it was as comfortable, friendly and convenient as staying at my own home. It is situated at the Bazaar quarter, a 15 minute walk to The Blue Mosque area. The whole hotel is exceptionally clean. The breakfast room is air conditioned on the top floor with a beautiful panoramic view of the city. The food is plentiful, fresh and served beween 7-10am The rooms are very practical, also with a wonderful view, sound proof windows minibar and free wi-fi. You would get everything here that you would expect from a fine western Europan hotel for a fracion of the cost. (We even got a travel tooth brush and shoe polish! ) The staff is the best I''ve encountered. Friendly, warm, hospitable and extremely helpful. They will make you feel at home! This will always be my first choice when I visit Istanbul.", "Date": "August 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hudjand", "Title": "“We like this place.My 2 nd home in Istanbul.”", "Author": "Pari78", "ReviewID": "UR70753036", "Content": "Traveling to another country and stay in hotel always is more questions. If with child there is more question.But after finding such lovely place which is near and convenient: For Transportation, Not far from Airport, Walking distance to sea and interesting places.It adds more extra positive points. Friendly staff was happy to help us, Meal was good: Fresh, Tasty and Good choice. Amenity is daily and fresh. Kettle, tea and coffee during the day (facilities) very useful. Bads big and comfortable, normally I hardly fall asleep for 2-3 hours, until adaptation.Not this time :-)", "Date": "July 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Best location, Good Hotel with big and clean rooms...”", "Author": "Firik", "ReviewID": "UR68629289", "Content": "I like Big rooms, always hot and cold water ( did not face problem).Staff is helpful and even in the late everning and early morning happy to help. Maybe good hotel to stay with the family also. I like breakfast, food is nice. Shortly I will use this hotel for sure in future for my transit and short trips.", "Date": "June 25, 2010"}], "HotelInfo": {"Name": "Nobel Hotel", "HotelURL": "/ShowUserReviews-g293974-d1791037-Reviews-Nobel_Hotel-Istanbul.html", "Price": "$66 - $129*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Aksaray Caddesi No 27</span> | <span class=\"extended-address\">Laleli</span>, <span class=\"locality\"><span property=\"v:locality\">Istanbul</span> <span property=\"v:postal-code\">34130</span></span>, <span class=\"country-name\" property=\"v:country-name\">Turkey</span> </span></span></address>", "HotelID": "1791037", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/a3/66/a366776cb27e880a9e273cc8359a5b5d3large.jpg"}}