{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Beirut", "Title": "“Excellent!!!!”", "Author": "Harout F", "ReviewID": "UR128450261", "Content": "My wife and I just came back from short 3 day Istanbul vacation. I booked our room at Millennium Suites online after reading many good reviews from previous visitors to the Hotel. I can honestly tell you that our stay at Millennium Suites was very pleasant. We arrived at the airport and our driver was waiting for us as promised by the Hotel staff. Once at the Hotel, the Manager and the staff were very welcoming and went out of their way to make us feel relaxed and comfortable after our trip. The rooms were very clean, spacious and the beds very comfortable. The Hotel is located just a walking distance from the center of town. I travel a lot and finding comfortable beds and clean rooms is very common but what makes Millennium Suites even more special is the help and kind attitude you will receive from the Manager and Staff. I will no doubt stay at Millennium Suites on my next visit to Istanbul.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ploiesti, Romania", "Title": "“Unforgettable experience”", "Author": "eduard_manolescu", "ReviewID": "UR128279475", "Content": "My trip to Istanbul just finished. I booked a room at Millennium Suites and it was the best decision i ever make. After four days spent there i can say that this hotel deserve more than 5+ Star. Everything was just perfect, staff very professional and exceptionally gracious ready to help you to book daily trips or nights at restaurant,room it was very spacious,very clean and luxurious decorated and the entire old area very well preserved and with nice people. Don't forget to ask for a Bus and Boat trip, a night at Oriental House and a good and traditional dinner at Turquoise restaurant. I finish my review saying that this vacation to Istanbul was Perfect, Unforgettable and for sure need to be repeated. Of course at the Same Hotel--MILLENNIUM SUITES", "Date": "April 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Christchurch", "Title": "“\"Great Place to Stay\"”", "Author": "Cpilot", "ReviewID": "UR128243287", "Content": "Millenium Suites is definitely the place to stay in Istanbul. Great location, walking distance to all the main attractions. The owners and all of their staff were wonderful and could not do enough for us. The room was beautiful, clean and finished to a high standard. We will definitely be back and recommend it to all our friends. A perfect last night at the end of a magical vacation. Thank you.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "cairo", "Title": "“Odenmemis! Herrorragend! Uitstekend! Outstanding!”", "Author": "chuijgens", "ReviewID": "UR128173706", "Content": "Millenium Suites gets a 5+ Star rating from us for excellence in customer service, high standards of cleanliness, luxuriously decorated and well maintained rooms and lobby, well trained and exceptionally gracious staff AND the best coffee terrace in Sultanahmet for relaxing and people watching! I booked on-line through Istanbulhotels.com and was curious to see if the hotel lived up to it's billing. Alber and his staff were very friendly and exceeded our expectations in every area. After three nights stay, we felt sorry to leave! I would happily stay at Millenium Suites on my next visit to Istanbul. Best wishes for much future success to Alber and crew!! C. Huijgens", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington, District of Columbia, United States", "Title": "“Amazing, friendly and spectacular”", "Author": "Bruce S", "ReviewID": "UR127352901", "Content": "I was recently at the Millennium Suites for 8 days and loved it! The place could not have been more perfect. The location is awesome just a few minutes to the Blue Mosque and the Haggia Sophia. However the best part was the staff and workers. I have never stayed at any hotel where the people were more friendly. They are the best. They taught me about language and culture and they even arranged with great ease an excursion to Ephesus for us. They always had a great restaurant suggestion and could help us find our way about the city using the Tramway, Subway, Tunnel and Veniculars! After we had returned late from our trip to Ephesus they even ordered in pizza for us so we could simply have a bottle of wine and relax in the hotel. I give this hotel my highest rating and only wish I could return again very soon!", "Date": "April 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Honeymoon stay”", "Author": "CCCWi", "ReviewID": "UR127343269", "Content": "My wife and I stayed here in March of 12 for first 2 nights of honeymoon. The room was a nice comfortable size. The small hotel is newer and was real clean. I requested the room with the balcony (there is only one) which they said may not be available when I emailed them but was delighted when they led me to this room for our stay. The view is a bit sacrificed from this room as it is kind of a back alley feel. If you are looking for a better view you may want to ask for a room with a street view. Outside in front is a small quiet street with many nice restaurants to choose from. Metropolis is recommended. The service was excellent and were funny and helpful. It seemed they went out of there way to accommodate us. Welcome drink, wine in our room, recommendations, always running to the door to open it for us and picking us up from airport. The location also is safe being a couple minutes walk to the blue mosque and other major sites and near four seasons hotel. The hotel is recommended for those who have not been to Turkey as they make you feel comfortable in where you are at. One of the best places I have stayed. CCC USA", "Date": "April 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“FABULOUS!!!!”", "Author": "LeslieMarie_12", "ReviewID": "UR127292317", "Content": "I would recommend Millennium Suites Hotel in Istanbul to everyone. We stayed for 8 days in late March and did not want to leave. Every single one of the staff made us feel more like FAMILY than hotel guests and we had so much fun exchanging culture, language and gags with them. Its location in the heart of the Old City (Sultanahmet) is ideal. The rooms are lovely. Breakfast is a good mixture of Turkish cuisine and American standards like scrambled eggs and cereal. I can't say enough about Millennium Suites. Stay there. You won't be sorry.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“best hotel”", "Author": "monicadavydov", "ReviewID": "UR127245156", "Content": "This is the best hotel i've ever stay.Rooms are very big and comfortable, location is great, staff is very professional and very kind.Thank you very much for a wonderful vacation.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Voss Municipality, Norway", "Title": "“Perfect location in Sultanahmet!”", "Author": "5700Voss", "ReviewID": "UR126414584", "Content": "We stayed at The Millenieum Suites last weekend, and for us it was the perfect choice for our first trip to Istanbul. First of all the service was superb, and the room was very nice and clean. Since we arrived on my birthday, it was nice to find half a bottle of cold wite whine in the room, and a nice refreshment before we start to explore the sights in the neightbourhood. The staff was always helpful and their knowlegde about Istanbul was very useful fo us. There are also many nice restaurants in the same area, and we could really recommend Metropolis restaurant just across the street from this hotel. So if you are planning a romantic weekend in this fantastic city, this hotel would should be your first choice.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "East Northport, New York", "Title": "“Home away from home”", "Author": "davec9591", "ReviewID": "UR126400033", "Content": "My wife and I recently spent 5 nights at the Millenium but this is the type of place you could easily spend many weeks. We arrived close to midnight and were picked up by the shuttle at the airport. (one-way incl in hotel price and highly recommended.) Upon arrival at the hotel, we were warmly greeted by Alper, assisted to our room and were surprised to see a welcome gift (wine, fruit basket, and pastries) on the table. Traveling all day, we decided to grab a bite to eat and the recommended restaurant across the street was open and the food was delicious. Note that Akbiyik street has many good restaurants. This small hotel (7 rooms) is newly renovated, and the rooms are large and clean The following morning, we were greeted by Mr Alper (owner) and Azure who presented us a great spread for breakfast of local dishes, pastries, fruit, cheeses etc...and they also offered omeletes as well. (all also included). Both were very accomodating, polite and extremely friendly which I can say is true for the entire staff including Tanner and Soner who we met later upon our return visiting some of the local attractions such as Hagia Sophia, Blue Mosque, Topkapi Palace which are all within a short walking distance from the hotel. This hotel is in a great location which made it very convenient. It is also very close to the Tram which you can take for 2TL to the Grand Bazaar and other areas (if you don't want to walk). Also recommend taking the Bosphorous Boat tour. It was quite cold during our stay but every day when we returned \"home\" we were offerred a cup of tea/coffee etc... to warm up (also incl). Woman's Day also popped up during our stay where my wife was given a gift and we also received a departing gift. Needless to stay, we had a great experience with this hotel and they definitely get an A+ in service and made our visit to Istanbul a very memorable one. Kudos to the entire staff. Because of you we hope to visit again with our sons and friends.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hamburg, Germany", "Title": "“Overall OK with an amazing staff”", "Author": "galapiass", "ReviewID": "UR126374435", "Content": "There were a few hiccups at our arrival and in the bedroom however overall the hotel was good. We stayed there in March, hotel was less than half booked. I asked by email for confirmation of our airport pick up which i never got. Then i called (it was in the evening), and the person didn't speak English very well. I then heard him try to call someone to help him and then the line just cut off. I didn't call back and just took a taxi once i got there, only to be told that actually someone from the hotel was waiting for us. In the room, which was ok, there were a few issues. Big stains on the white curtains, a broken leg chair, some mold on the shower, however nothing really bad. The location was amazing. 5 minutes walk to the Blue Mosque, Tramway station and Saint Sofia. Cant be more central if you want to be in the old town for your stay. The staff were amazingly welcoming. Extremely nice and helpful to a point where it almost felt uncomfortable... but this is also what makes the strength of this hotel with the location.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Central, friendly - and lovely extra touches”", "Author": "BequiaWhispers", "ReviewID": "UR126217958", "Content": "We visted Istanbul for the first time and, spurred on by TA reviews, booked the Millennium Suites. Good choice! We endorse all the positives you've seen in other reviews, but would particularly pick out: - Sizeable room - Everything clean and (broadly) in good condition - Very friendly and helpful staff We had also expected it to be a bit noisy, given its location - but it wasn't. Perhaps we benefited from having a room at the back of the hotel? Finally, we particularly loved the small-but-special touches: the free drink on arrival, the personalised chat about what we might want to do and see (but with no hard sell), and the small gift on departure. Excellent value for money - we would return.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Concord, MA", "Title": "“Outstanding experience!”", "Author": "ConcordSL", "ReviewID": "UR125961290", "Content": "What a treat to stay at this warm, welcoming, clean and delightful hotel in a great area in Istanbul. The room was spacious, clean and had great amenities. The location in the Sultanahmet district is fabulous - it is walking distance to some of Istanbul's best sights, and easy access to public transportation. The breakfast was fabulous, with lots of great and tasty choices. However, with all that said, the best aspect of the hotel was the people - exceptionally accommodating, warm, great with advice on things to do and places to see, able to book great experiences for us, made us feel so comfortable and willing to do anything to make our trip great. Highly recommended!", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Lovely hotel with great welcome”", "Author": "emile57", "ReviewID": "UR125939378", "Content": "My partner and I stayed two nights in for his birthday . On arrival we were welcomed with a tea and sweets and a birthday fruit bowl and wine and a lovely vase of flowers . Breakfast was a real treat Arzu cooked us great eggs and her lovely smile was a great start to the day. Alper (the Manager) was so helpful with suggestions for our itineraries etc. We were also wisked from the airport by VIP car. When we left the young man on reception made sure we left with our gift of local soaps pack. Rooms are very clean and extremely comfortable . We will be back soon I hope thank you to all the team for making our stay so special.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“An excellent hotel in the Sultanahmet area”", "Author": "jjkeem", "ReviewID": "UR125864231", "Content": "When I arrived, a welcome drink was provided during check-in. Although there was no elevator in the 4 story hotel, one of the staff moved our luggages during check-in and check-out. The room size was adaquate and the room was very clean. One bad thing for us was that it was too dark to read a book in the room. Breakfast was Turkish style and quite good. In addition to basic food on the buffet table, fried eggs, omelet, coffee, and turkish tea were provided upon request. Alper, the manager of the hotel, was extremely kind and helpful for everything during our whole stay. I would definitely stay in this hotel again.", "Date": "March 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Short Hills, New Jersey, United States", "Title": "“A wonderful hotel!”", "Author": "Patricia N", "ReviewID": "UR125728843", "Content": "This is a lovely and most conveniently located hotel for a visit to Istanbul.l The rooms are spacious and immaculately clean. We were able to walk to most of the attractions on our list, and the neighborhood was lively, fun, quaint and overflowing with excellent restaurants, shops and charm. The manager and staff at Millennium could not have been nicer and more eager to help with any request. I rate this hotel highly with absolutely no reservations!", "Date": "March 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, England, United Kingdom", "Title": "“Perfect!”", "Author": "cas569", "ReviewID": "UR125645938", "Content": "Ideally located, close to all of the main historical sites, this hotel also provided the 5 star service of the likes of the Four Seasons which is only 2mins away. We could walk from the hotel to see everything that was on our list and we could also hop on the convenient tram to everywhere else. Having said that, we spent most evenings on the same street - there are plenty of great bars and restaurants and it really does have that cosy, chilled out Turkish vibe. On top of all of this, the staff went out of their way every day to make sure our stay was perfect. The room was very clean and comfortable. In fact, we would have been happy if we had spent all holiday in our hotel room only venturing out to eat in a nearby cafe!", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai", "Title": "“What a great place to stay!”", "Author": "Andrea P", "ReviewID": "UR125638057", "Content": "What a great place to stay. From the moment we arrived we were made to feel so welcome by the lovely staff. Its a smallish hotel, so they really made the effort to get to know each guest. In particular, they were great with our two year old - he never went short of attention! One of the ladies was even able to babysit for us one evening, and our son loved spending time with her! The rooms are very nice - spacious (plenty of room for a cot) and very clean and the bed was really comfortable. Breakfast was a delicious spread of fresh local specialities that changed every day. The location is great - only a few minutes walk from Hagia Sophia and the Blue Mosque and 10-15 minutes from the Grand Bazzar and the wharf for the ferry cruises. It's close to trams too. But the thing that really made our stay special was the staff at the hotel. They really had that personal touch and went the extra mile to help. They even gave us a present for our son and baby on the way, which amazed us! Thanks for a great stay!", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wellingborough, United Kingdom", "Title": "“\"Outstanding\"”", "Author": "kane18", "ReviewID": "UR125614340", "Content": "Just returned from a four night stay at this fabulous hotel. The manager Alper and the rest of his staff could not have treated us any better. I could go on and on about how beautiful the rooms are, the stunning breakfast, perfect location etc but I can hand on heart say that there is probably no better hotel in Istanbul than the Millenium Suites.... Shay Cullen (UK)", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Great location, great staff, clean and modern rooms, good value”", "Author": "cal776", "ReviewID": "UR125558001", "Content": "The Millennium Suites is an excellent choice for tourist visitors to Istanbul. Located on a side street in Sultanahmet, the ideal location in the city for tourists, the hotel is an easy five to 10 minute walk from the Hagia Sophia and Blue Mosque and only five minutes further on foot to either the Topkapi Palace or Grand Bazaar. The staff is incredibly friendly and helpful. The rooms are modern, immaculate, and well apportioned. Wi-fi is free, with a very strong signal. The hotel provides good bath amenities and a complimentary 1.5L bottle of water. Breakfast, which is included, is tasty and plentiful. There are a number of restaurants in the neighborhood, including Hayat Cafe, which I highly recommend as both inexpensive and delicious. The only slight negative is the street noise for the rooms facing the street. But even that can't detract from an excellent hotel.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Wonderful Staff and Service, felt like family”", "Author": "Susan W", "ReviewID": "UR125303479", "Content": "We booked the Millennium Suites based on other trip advisor reviews and we were thrilled with this lovely boutique hotel. The rooms were very comfortable with a king bed and everything was spotlessly clean. The staff were so friendly and helpful - they really went out of their way to make us feel welcome - we feel the best staff we have ever encountered in our travels. A big Thank you to Alper, Arsu, Tanir and the rest of the staff. By the time we left we felt like family. We enjoyed the breakfast buffet, omlettes made to order and a variety of pastries, cheese etc. The location is great, close to Topkapi, Blue Mosque and the Hagia Sofia and there are good restaurants on the same street. Albura was a favourite of ours. We enjoy small hotels and would highly recommend the Millennium Suites.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Munich, Germany", "Title": "“Fantastic staff and location!”", "Author": "Gypsygirl1", "ReviewID": "UR125230017", "Content": "There are so many good things to say about this hotel. It is close to many sites, not far from the Sultanhmet tram stop and there are many restaurants nearby. My husband and I booked at this small boutique hotel based on Tripadvisor reviews---THANK YOU!!! Alper, Arsu and the rest of team were so helpful and kind; they really showed us the very best of Turkish hospitality. We were met with welcome drinks (brought to our room with a vase of flowers) as well as a lovely hot breakfast each day and then some beautifully wrapped soap as a farewell gift. (Keep in mind we visited in the off season.) Although all of these touches were very thoughtful, it was the warm attitude from the staff that mattered the most: they obviously cared about us and their business and really took ownership. It was very clean and well cared-for. Satellite t.v., free wifi and bottled water each day reflect the attention to details; that matters to me. l've stayed in a lot of hotels in Europe and North America and this one is special.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great Stay”", "Author": "Udai B", "ReviewID": "UR124982323", "Content": "Havent wrote a review on trip adviosr before but this hotel made our stay really comfortable that i have to do this. Its located in prime location - very close to top 3 historic places to visit - topkapi, bue mosque and aya-sofia. There are really good restaurants on the same street, very cosy and romantic restaurants. I had this trip in winter so really liked the restaurants around with fireplace and outside seating etc. Apart from its prime location, the service is really great. We once overslept and missed breaktfast time but they still waited for us. Rooms are really nice and very good view of the street. I am always skeptical about hotel reviews but the hospitality at this place exceeds the reviews. Thanks Tanir for ourcomfortable stay.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Great service, excellent location.”", "Author": "Swiss_mountains", "ReviewID": "UR124774237", "Content": "We choose the Millennium based on other TripAdvisor reviews. We were not disappointed. The rooms are great, the location is minutes away from the Sultanahmet area with lots of attractions and restaurants. But all this would be meaningless if it was not for the great staff at the Millennium. They were always helpful, offered great advice and really did make it feel like you are visiting a friend's home rather than a hotel.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“A haven in a busy city”", "Author": "RichnIrene", "ReviewID": "UR124544869", "Content": "Istanbul is a lovely city and this clean and well kept hotel is in a very convenient location for many of the historic sites. We found all the staff at the hotel genuine, helpful, friendly and happy to make our stay in Istanbul a pleasant one. They stand out amidst a city full of traders who appear to be very hospitable but always with an agenda. It definitely feels like a haven at the end of a long day out. Will definitely go back there on our next trip to Istanbul!", "Date": "February 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“FantÃ¡stico Fantastic”", "Author": "comunitatgt40", "ReviewID": "UR124480112", "Content": "Se trata de un hotel acogedor, en situaciÃ³n privilegiada con un servicio excelente. La atenciÃ³n es muy buena, la limpieza extraordinaria y las habitaciones muy confortables.. Muy recomendable! This is a very nice hotel in prime location with excellent service. The attention is very good and the hotel and rooms very clean and confortable. Highly Recommended! Es handelt sich um ein sehr schÃ¶ntes Hotel in exzelenter Lage und mit ersklassigem Service. Das Personal ist sehr entgegenkommend und nett, die Zimmer gut eingerichtet und extrem sauber. Sehr zu empfehlen!", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chester, United Kingdom", "Title": "“Lovely Hotel with lovely staff”", "Author": "pippy100", "ReviewID": "UR124444470", "Content": "We stayed here for 4nights and the location was spot on for sightseeing as it was within walking distance to the Blue Mosque etc and public transport. The rooms were spacious and very clean and the staff were outstanding. Very friendly and nothing was too much trouble, we one day asked them to organise a few outings and while we were out they had sorted it all out and advised us of the times etc when we got back to the hotel, all done with no stress for us. Breakfast had a good choice but do not expect bacon,sausages etc. It had cereals,pastries, omlette or fried egg, cheeses,bread and fruit. It may be a small boutique hotel but it certainly has a big heart. Thank You to all the staff.", "Date": "February 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“One of the best experience in my life”", "Author": "Gino E", "ReviewID": "UR124396963", "Content": "Hotel very well presented, staff very very friendly, proffesional and helpful; Firts time in Istanbul and the Customer service make a good difference; Definetly I will recommended the hotel to our fellow Australian travellers. Location excellent and close to everything. I will back to use the service of the Millennium suites again. The staff was so proffesional and multilingual, so easy to communicate and to provide advise and recommendations.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Great Hotel in Istanbul”", "Author": "Lisa B", "ReviewID": "UR124286087", "Content": "My husband & I recently stayed at the Millennium an had a wonderful stay. The staff could not have done any more for us. The went out of their way to provide us with a warm and attentive service. Each morning we had perfect omelettes made to order, even on our last morning when we have a very early start. They organised our transfer from & to the airport and provided us with advice on where to visit and have dinner. Would highly recommend this hotel to anyone travelling to Istanbul.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "North Carolina", "Title": "“Millennium for the People with Discerning Tastes”", "Author": "etcetara", "ReviewID": "UR124214820", "Content": "My husband and I recently stayed at the Millennium in Istanbul for 1 week. The staff was extremely friendly and very helpful in meeting our every need. They went out of the way to be certain we were taken care of, in food, lodging, tours and travel to and away from Istanbul. They made it very possible for us to have a relaxing vacation and not be concerned with details. I would recommend the Millennium to anyone! It is quiet, clean, well located in area that does not require the use of taxis for the basics of tourist place to visit. They are very child friendly. Best of luck in your Istanbul trip, the country is amazing. Paul and April", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Excellent Hotel”", "Author": "GregandU", "ReviewID": "UR123801769", "Content": "We stayed at the hotel in January. The location is great, 5 min walking to Blue Mosque and Hagia Sophia. Service was outstanding, food was very good and everyone at the hotel was very helpful. Many thanks to Alper, great host and his staff for making our stay pleasurable. If we visit the Istanbul again we will stay at this hotel. Very highly recomended.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great hotel”", "Author": "Mohmmedak20", "ReviewID": "UR123695204", "Content": "Excellent hotel we enjoyed our time. The hotel management are very nice and helpful.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Valparaiso, Indiana", "Title": "“Millennium Suites...best of the new Millennium!”", "Author": "Kelly I", "ReviewID": "UR123638458", "Content": "If you are lucky enough to have chosen the Millennium Suites at which to spend your time in Istanbul, you could do no better. Alper Ozturk and his staff make you feel like family and go out of their way to fulfill your needs and meet your expectations. The rooms are beautiful, welcoming and comfortable. The breakfast each morning is extensive, satisfying, authentic and cooked to order no less! The location of Millennium Suites to all the \"must see and must do\" historical sights could not be any keener. You can walk everywhere within 15 or 20 minutes at most! The Turkish people are so friendly and that is exhibited in Alper and his staff at the Millennium Suites. The Millennium Suites is on a very quaint cobblestone street with other inns and restaurantss and there were even flowers still blooming in January! Just 2 or 3 blocks from the Marmara Sea, I would definately stay there again without hesitation...it was beyond perfect!", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tkibuli", "Title": "“Wonderful staff, great location.”", "Author": "Marianna Z", "ReviewID": "UR123312072", "Content": "Millennium Suites is on Akbiyik Street, which is a perfect location for walking to all the stunning sights -- Topkapi Palace, Hagia Sofia, etc. The staff at Millennium Suites sets it off from the other hotels in this area. They couldn't have been nicer, and were very caring about my comfort. I was treated as an honored guest, yet felt part of their family. The room was stylish and clean.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nashville, Tennessee, United States", "Title": "“A SPECTACULAR home away from home in Istanbul”", "Author": "Courtney M", "ReviewID": "UR123163858", "Content": "I only agreed to go to Istanbul because my husband was key on going somewhere outside the continental U.S. Due to his work schedule, we literally planned our trip two weeks before we left. I found the Millennium Suites via reviews on TripAdvisor and took a chance trusting the reviews. They did not steer us wrong. All the glowing comments we read were dead on. The location is ideal. It truly is right by the Hagia Sophia, Topkapi Palace, the Basilica Cistern -which was one of my favorite sites-- and the Blue Mosque. It's also super convenient to the tramway and all the restaurants that line it. However, Akbiyik Street itself also offers an abundance of excellent restaurants. (I'll list some at the end of this review.) As for the hotel itself, it's both charming and elegant. Actually, I don't think there's enough praise that can be given to Mr. Alper, the manager, Taner and Alper who were at the front desk, Sonar, or Arzu, who takes care of breakfasts and tea time. (And who's homemade pastries in the morning were AMAZING! My husband has missed those treats, let me tell you.) Taner took vacation while we were there so we had the benefit of his friendly knowledge for the first few days. Then Alper, who worked the front desk at night, came in on days for him. I unfortunately don't recall the man's name who took over for Alper at nights, but he was also super helpful and friendly. We had SO many questions, didn't speak a lick of Turkish, but it was okay. They all knew English. (As well as other languages. We heard them speak German and some French too.) The knowledge and courtesy they exhibited was THE best hands down of any I've received in any hotel ever. They connected us with tour agencies, told us places they liked that we might find interesting to see, never steered us wrong with restaurant recommendations, and even lent us umbrellas the one day it rained during our visit. I can't say enough nice things about the staff. The best thing was we had only booked 3 days to start with because we weren't sure what all we were going to do in Turkey. We ended up liking this hotel so much we asked if they had availability for the rest of our stay and they accommodated us. As for the rooms, the decor was elegant and was cleaned meticulously every day. (As is the case with most hotels, I realize, but they seemed to take extra care.) I felt like a princess staying there! The only thing some people might not like is no elevator. I quickly got used to it and enjoyed the extra exercise. If you're looking for good food on the same street as the hotel, I recommend Ocean's 7 (I just wanted a sandwich that night. They had a grilled chopped chicken one that so inexpensive and HUGE! I couldn't eat it all, but it sure was tasty. My husband had sea bass that he devoured.) and Kathisma (we had the baked mushrooms appetizer and a fish platter for 2 that was outstanding!). We had a great Turkish pizza around the corner from the hotel at the Palatium Cafe. Be sure to go in the courtyard and down into the ruins of the Great Palace of Constantiople (Palatium Magnum). Very awesome and romantic, especially at night. About a five or 10 minute walk from the hotel, and near the tramway, is Mozaik. Best calamari I've ever had. Also near there is Khorasani. We ate there twice. The lamb chops were incredible. Juicy and tender. We also had excellent calamari and fish at the Sultanahmet Fish House. It's walkable (about 15 minutes from the hotel), but if you make a reservation they also have a car service. The owner was super friendly and the service was spot on.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Moscow", "Title": "“wonderful hotel. all advise!”", "Author": "Nana O", "ReviewID": "UR123084542", "Content": "wonderful hotel! , Nice big rooms, very clean! feels like home! friendly staff, very hospitable", "Date": "January 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Home Suite Home”", "Author": "Jkaz1231", "ReviewID": "UR122453147", "Content": "Just returned from a week in Istanbul over the Christmas holiday and one of the greatest travel experiences of my life. We stayed 5 nights at the Millennium Suites. This boutique hotel is perfectly situated in the Old City, Sultanahmet, exactly where you want to be to enjoy the major sites like the Blue Mosque and Hagia Sofia and is also just a quick hop to the best restaurants, baths and tram line. Our room was big, clean and homey. All that said, the best part about this place is the people. Alper, Arzu and the rest of the staff were the most gracious and generous hotel staff I have ever encountered. Anytime of the day, they were available for questions and advice and a cup of tea. When we asked for a backgammon set, some wine glasses, whatever it was, it was given to us quickly and always with a smile. The breakfasts were comprehensive with baked goods, omelets, salads, etc and delicious. Everything about this experience was more than we could have asked for and we really felt like family was taking care of us. It was hard to say goodbye,. We love Istanbul and the Millennium Suites and can't wait for our next visit.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Above and Beyond”", "Author": "adina_allen", "ReviewID": "UR122450692", "Content": "Wow, what an amazing stay we had at the Millennium Suites! The rooms are spacious, beautiful, and well-appointed, the location is perfectly situated in the heart of the Old City, and the Turkish breakfast each morning is homemade and delicious. But what really sets this hotel apart is its incredible staff. Each and every person we interacted with was knowledgeable, helpful, warm, and welcoming. The staff helped us set up all of our tours, trips, and transportation (Bosphorous cruise, Turkish bath experience, Whirling Dervish performance) so that we could move effortlessly around the city. Whenever we returned back to the hotel from a day out exploring it truly felt like we were coming home. We would hang around in the lobby and talk about our day with the staff, who were always excited to hear about what we'd seen and how our day had been. We traveled with a 1.5 year old and it was amazing to see the staff play with him anytime we were in the lobby. We loved Istanbul and can't wait to return and know exactly where we'll be staying when we come - thanks Millennium Suites for making our trip so special!", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Turkish Delight!”", "Author": "Jordan B", "ReviewID": "UR122364250", "Content": "I will begin by saying that I have never written a review of a hotel, but this experience was so lovely that I wanted to share it with the worldwide web. From the moment we arrived at the Millennium Suites, we were given the best in Turkish hospitality. The rooms are very nice (large, modern, immaculate), and the hotel itself is perfectly located for visiting the major sites in Istanbul's Old City. For all that I could say about the room or the location, what really separates the Millennium Suites from other hotels is its spectacular staff. Alper, the hotel's manager, sets the tone with his warmth, sincerity, and helpfulness and the rest of the staff follows suit. We were traveling with our one and a half year old son, and it honestly felt like we were surrounded by loving family. Every member of the staff was sweet and kind, and they really catered to all of our needs. I could say a lot more, but the bottom line is that it was the best hotel experience I've had. The attention and service that we received were beyond compare. We can't wait to come back! Jordan B. p.s. The breakfast, with its many home-baked treats (thank you, Arzu) and Turkish cheeses was the perfect start to each day.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location, great services and super clean room.”", "Author": "Ekmal Z", "ReviewID": "UR121956613", "Content": "The location is great. About 5 minutes walking distance to the blue mosque. If you are a good runner, you can be there in less than a minute. Located in Sultanahmet area where you can find the Hagia Sophia, Grand Bazaar and all the other attractions. We even walked to the spice market from this hotel. You can save your money on transport. Hotel's staffs (Alper & team) are super friendly. Feel free to ask them anything especially recommendations for great restaurants. We went to all three restaurants that were recommended by them and we are really happy with their recommendations. They even arranged the courtesy transfer from hotel to the restaurants and back to the hotel. Don't simply walk into any restaurant since they might charge you the \"tourist\" price. Always talk to the hotel's staff first. The room is quite nice and relatively new. Room service is superb and they keep the place really clean. You can eat off the floor if you want to. The bed is nice and pillows are super comfy. It is a small boutique hotel which is a good thing where you don't have to queue for breakfast buffet and definitely more food for you i guess. In short, it is a great boutique hotel with great location and friendly people, Ekmal Zazi", "Date": "December 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Best Management/Staff I've Encountered. Great Location.”", "Author": "Robert K", "ReviewID": "UR121785034", "Content": "First, by way of context, I fly 80K/year and I spend, on average, 100+ nights/year in hotel rooms. This particular trip was one of the very rare adventures that was purely for pleasure (and on which I was able to bring my wife). We had an absolute blast. If and when I return to Istanbul, I will stay at the Millennium Suites or their sister hotel, Muyan Suites. We stayed in room 402 (top floor). It was incredibly spacious (by American standards, let alone European standards). It was well furnished in an elegant style, clean, well maintained, and in good condition. The television received hundreds of channels (not that you will need to spend a lot of time watching TV in that historic area of Istanbul). The bed was comfortable. The area was surprisingly quiet (given how close to the busy parts of Istanbul the hotel is). The hotel itself is in a great location. It is a 5-10 minute walk from the major sites: Blue Mosque, Hagia Sophia, Topkapi Palace, Archaeological Museums, Islamic Art Museum, etc. There are dozens of restaurants and food stands as well as a fairly high-class bazaar within 1-2 city blocks of the front door. So, for a relatively young couple on a middle-class budget who enjoys foreign travel and were looking for a relatively authentic Turkish hotel experience, the Millennium Suites is perfect. But, the real gem of the hotel is the manager (and I think owner?): Alper Ozturk. His staff is is great as well. There was a slight mixup with our reservation (booked through a third party, I'm sure it was partially their fault). So, for the first two of our four nights, the hotel was overbooked. Alper personally met us when we arrived, explained the situation, and then walked us (10 minutes?) to the recently opened sister hotel called Muyan Suites (please note: the pictures are of our room at the Muyan Suites). He offered to drive but we wanted the walk after the long day of flying. He had booked us in a gigantic suite there. He then proceeded to offer us everything and then some (he offered to book us a cruise up the Bosphorus, a free dinner and dancing show at one of the local restaurants catering to tourists, etc.). We did not actually take him up on those as we had a fairly tight schedule already. But, he ended up arranging a private car to take us to the airport when we made a day trip to Izmir and on our last day when we left Istanbul. And by arranged, I mean he paid for it too. On the third day, when it was time to move back to the Millennium Suites from the Muyan Suites, we simply packed our bags and went about our day. The staff moved the bags for us to the Millennium and they were waiting when we arrived just before dinner. Alper was incredibly nice to us...visibly working hard to make our stay a wonderful one. When we left for the airport our last day at 3:30am, Alper even got up to see us off. He presented my wife with a gift of Turkish soaps. Maybe I have been jaded by the so-so attitudes of most American hotel managers, and maybe I had low expectations because it was my first time in Turkey and so I really had no expectations at all. But, Alper made this stay in Istanbul one I will remember forever. Thank you, Alper.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newport Beach, California", "Title": "“Best Location, Best People”", "Author": "Courtney H", "ReviewID": "UR121718500", "Content": "I loved my stay at Millennium Suites for so many reasons--the location in the Old City is ideal because you can walk to interesting sites while still being on a small, less-trafficked street. The rooms are beautiful and the hotel is very well kept. The breakfasts are amazing with many fabulous choices of fruits, cheeses, olives, breads, coffees, teas, juices, etc. But the best part about the hotel is the people. Everyone who works there is very kind and very hospitable...I left feeling like I was friends with them, and now I miss them as much as I miss Istanbul!", "Date": "December 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Location, location, location!”", "Author": "wanderlust786", "ReviewID": "UR121684661", "Content": "The perfect location in sultanahmet. We were met at the airport and that was one of the best decisions. We also got the drop off too. Miss Arzu is the best, made our cook to order eggs with whites only and just a bit of oil, perfectly day after day. We stayed in the ground floor suite. Expected a larger room per the pictures as there were three of us, but we managed. The folding bed isn't the most comfortable, but can you expect it to be? The staff make this place! We were personally greated by Taner. The room was very clean and the flowers in the room were a great touch. I liked the personal care box that contained loofahs! I would recommend this hotel and would consider staying here again. Please go to doy-doy restaurant, they deliver!", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Riverside, California", "Title": "“Great location, Awesome staff!”", "Author": "John B", "ReviewID": "UR121583765", "Content": "I really enjoyed my five days in Turkey and choosing this hotel is part of the reason! The room was very comfortable and had a great outdoor private patio. Had it not been winter, I would have loved spending some relaxation time out there with a great book. Very convenient to all of the sites - was able to walk everywhere or take the tramway. Best of all however was the staff. They truly were concerned about the well-being of each guest! The reception staff was always ready to greet me by name and ask me about my day. The breakfast was great and the chef, Arzu, was fantastic. What a great personality. Thanks to Alper (X 2), Ugur, Somer, and Arzu for making my stay so welcome!", "Date": "December 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“IN ONE WORD PERFECT”", "Author": "larisalondon l", "ReviewID": "UR121467251", "Content": "A nice hotel centrally located in the old city.Millennium Suites has only 7 spacious so clean rooms and very friendly staff. Breakfast is served as a buffet and More than i expected.the staff never let you go out hungry even you wake up too late and miss the breakfast time without any extra charge.after breakfast always possible to have a cup of turkish coffee with turkish delights. It is really a few minutes away to the most important historical sights,Topkapi Palace,Hagia Sophia Museum,The Blue Mosque and grand bazaar is with in walking distance.the tram station is also so close to the hotel but always too crowded so never advise you to choose to somewhere else.Taxi might be a much better option and really cheap . We will of course back to the Millennium and Istanbul,highly recommended.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boonsboro, Maryland", "Title": "“Absolutely the Best!!!”", "Author": "cajonjon", "ReviewID": "UR121435024", "Content": "First of all, the room and bathroom were by European standards very large and well appointed and were kept spotlessly clean by the very capable housekeeper. The room and bathroom were equipped with everything one needs at a hotel. As many others have said, the hotel is very conveniently located within walking distance to all of the major sites. Secondly, the owner and hotel staff could not have been nicer and kinder to us! They made us feel like family and we will always think of them as part of our family. We have to send special thanks to Taner (our new #1 son), lovely Arzu who keeps breakfast going so well every morning, Soner (who is going to be a great chef someday), Alper (who always welcomed us back in the evening with a smile) and many thanks to the owner Mr. Alper for being such a good businessman and recognizing and hiring such a fantastic staff! Again, a million thanks to the Millenium Suites for making Istanbul so wonderful for us! With Fondest Regards, John and DiAnne", "Date": "December 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "California", "Title": "“surprised by joy : )”", "Author": "WheelsUp!", "ReviewID": "UR121404814", "Content": "At first I was disappointed. The reviews had been so good. The rooms looked so big. Turns out, it's a small hotel with HUGE heart. The staff is amazingly kind and helpful and they go out of their way to inform. The location could not be more convenient. And it's SPOTLESSLY clean. We would not hesitate to return; we felt as if we had made friends in a culture that was foreign to us.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Providenciales", "Title": "“great service, good location,a bit pricey”", "Author": "laluce81", "ReviewID": "UR121334251", "Content": "They were lovely hosts, met us at the airport which was a great idea. Very helpful w/ local info and superb travel agency introduction.It was an anniversary trip & they gave us a pretty vase of flowers. The breakfast girl is a darling!! the first floor room very quiet w/ a tiny patio.The location is brilliant w/ lots of resturarants,sights and shops nearby..Great for travelers on their first visit.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Prague, Hlavni Mesto Praha, Czech Republic", "Title": "“Nice little hotel, superb location, excellent service”", "Author": "Michal P", "ReviewID": "UR120904097", "Content": "Me and my wife spent 3 nights in this lovely hotel. As we were having our 10th anniversary I asked the hotel service to prepare some flowers and a bottle of champaign for our arrival - my wife was so surprised! The hotel staff was also very helpful when finding locations to visit as well as when we needed some tips on how to negotiate the price on the marketplace. Both airport transfers were managed by them we had nothing to worry about. When we left home we forgot something at the hotel and the manager arranged posting it via UPS. I could go on, but I would be just repeating other reviews. If you're looking for a nice small hotel close to all important attractions with really helpful hotel staff, you should definitely consider choosing this one.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kinderhook, New York", "Title": "“Istanbul 8 day stay”", "Author": "RobertA60899", "ReviewID": "UR120664740", "Content": "Although not a suite a very large, well appointed hotel room. The location is perfect, walking distance to many restaurants, sites, shopping and the T1 Tram that will take you to just about anything you would want to see in Istanbul. Staff was friendly, helpful, warm, they stood everytime you want into the lobby. Good breakfast (real coffee). Would go back without hesitation.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "rogers222", "Title": "“Great Boutique Hotel”", "Author": "rogers222", "ReviewID": "UR120530981", "Content": "The Millennium Suites is a small hotel just around the corner from the Blue Mosque. It's on a terrific street with dozens of restaurants and nice hotels. An easy walk for visitors to the bazaars, mosques, and palaces in the upscale Sultanahmet neighborhood. The property is less than two years old, so it is new and fresh and stylish with nice rooms and new bathrooms. The staff is terrific, discreet, and polite -- very well trained and attentive to guest needs. The small included breakfast, served in the lobby, is fine. The price is good. There is wi-fi, the rooms are quiet, and only two rooms per floor. A nice hotel, I will go back.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Great 8-day stay”", "Author": "JohnKWHo", "ReviewID": "UR120526683", "Content": "My wife and I just spent 8 great nights at this boutique hotel. Located just 5 minutes from the Aya Sophia, the Blue Mosque and Tokapi Palace, it is very convenient to the sights especially if one is tight on time. A 10mins walk will get you to the Sultanahmet tram stop which will get one to most of the other tourist sights. The hotel only has 7 rooms on 4 floors; no lifts. The hotel staff are more than happy to carry your luggage to your rooms but request for the sole ground floor room if you have issues walking up stairs. The rooms are quite spacious, two on each floor. The hotel is less than 2 years old, so everything is new and working. The room was kept clean and tidy by a very efficient maid. If you desire quietness, I recommend the rooms facing the rear. There's no views though. The hotel is on a street that is occupied by a community of mostly hotels and restaurants and a couple of excursion companies. This is an excellent cozy hotel where the staff knows you and vice versa. The team is extremely helpful and friendly. The two receptionists that served us, Alper and Taner, were both great conversationalists and gave us many helpful tips. At breakfast, we were served by Arzu. She lights up every morning with her bubbly personality and taught us Turkish phrases at every meal! She did not give up until we got it right! One thing to note is that they only serve breakfast, but there're restaurants up and down the street. All in all I would thoroughly recommend this hotel if you like small cozy hotels without the frills of a pool, hamam or a breath-taking view.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newcastle upon Tyne England", "Title": "“Excellent hotel”", "Author": "Disapp0inted09", "ReviewID": "UR119903538", "Content": "My husband and I have just returned from a very enjoyable six day break to Istanbul. We stayed at the Millennium Suites having read the previous travelers reports on Trip Advisor. It is extremely difficult to add anything original to previous reviews! In an ideal position for a trip to this incredible city. The hotel is small in size but big on everything else! Large comfortable, extremely clean and well maintained rooms. The beds are so comfortable with luxury bedding , the bathroom was modern and equipped with lovely soft towels and a fantastic powerful shower with endless supplies of hot water. The staff were extremely friendly and helpful and always available to offer advice. The location is in the heart of the Sultanhmet district within walking distance of the Blue Mosque, Topkapi Palace and Aya Sophia. A large selection of good eating places literally on your doorstep. A special mention to the Metropolis restaurant opposite, the food was so good we returned for a second visit. Would definitely stay again at the Millennium Suites and would have no hesitation in recommending it to other visitors to Istanbul;", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Beavercreek, Ohio", "Title": "“The Best Hotel in Istanbul”", "Author": "anginsan-01", "ReviewID": "UR119903360", "Content": "I consider the Millennium Suites the best boutique hotel I have ever stayed in during by travels. The location is superb, just a block away from the Hagia Sophia and the Blue Mosque along a street filled with restaurants and shops. There is a wonderful little bazaar just around the corner and Topkapi Palace is five minutes away. The rest of the major sites in the Sutanament area are easily within walking distance. The rooms are very large for a boutique hotel with ours being at least 350 sq ft or more. They were clean, nicely decorated and comfortable. However, if you do get a â€œfrontâ€™ room, of which there are three, bring your ear plugs, because since the street has many restaurants it does get noisy at night until around eleven oâ€™clock. This did not bother either me or my wife, but it could some. So if you want quiet ask for a â€œrearâ€� room if available. The breakfast was good considering there are only seven rooms in the hotel. But what makes the Millennium Suites a notch above all the rest is the staff. From Arzu, the breakfast chef, to Taner, the day receptionist/coinsurer, I have not met a friendlier, more accommodating staff anywhere. We would come in from site seeing in the afternoon and the staff would have coffee and snacks out for us. We would sit and drink wine and talk to the staff for hours before going out to dinner. We enjoyed the staff as much as we enjoyed the sites. They made a great hotel even better. I would highly recommend if you are going to Istanbul to make the Millennium Suites your place to stay.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto Canada", "Title": "“â€œCharming Hotel, Good Location, Great Breakfast, Best Staff â€�”", "Author": "khristian14", "ReviewID": "UR119777383", "Content": "Amazing, Quaint, Intimate Hotel. This intimate hotel is beautifully designed with open French glass doors, through a cafe leading upwards to a hidden spiral staircase, which brings you to your suite. Each floor houses 2 suites each, all creating such a warm ambience. Charming Staff, all extremely proficient in their duties, they all go over and beyond their call of duty to ensure our stay was the best. They offer extra service whether in assisting with dining recommendations or taking personalised orders for breakfast and or housekeeping requests. Accommodation: rooms were tastefully and artistically decorated. The bed was comfortable with the perfect set of pillows, all snuggled in soft linen. Trendy styled bathroom. Breakfast was first class, a delicious choice of fruit, cereals or special hot orders from the chef. Kudos and a special applaud to the waitress, her smiling face radiated such hospitality to the room. Location, ideal within minutes of walking distance to the main attractions of Istanbulâ€™s beautiful â€œold cityâ€�. (Blue Mosque, Aga Sophia) We highly recommend this boutique hotel to anyone planning a trip to Istanbulâ€™s Old City. We would most definitely stay at this hotel again. Special thanks to Millennium Suites for making our stay precious and cherished in Istanbul. M/M Dove", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NSW Australia", "Title": "“Home away from home”", "Author": "AussieBeth55", "ReviewID": "UR119523738", "Content": "I stayed here in the Milleniium for 4 nights and was extremely happy with my stay. The hotel is in a small cobble stone street in a quaint area of town walking distance from the Blue Mosque, Sofia Palace, museum, and trams to travel further afield. The entrance to the hotel is through their quaint cafe where you end up spending much of your time when you come 'home' for meals, taking a break over a coffee or wine, or just resting and watching the world stroll by. The staff are absolutely trustworthy, extremely efficient and have a great way of being friendly, relaxed yet professional and always keen to help and advise. The rooms were meticulously clean and nicely furnished, quiet, everything worked perfecty. The food in the cafe/restaurant was Italian style and was beautiful, good healthy, nourishing food to keep you going and i normally came 'home' for meals. Reasonably priced. Breakfast was included in the price. Did i say the staff really just couldnt do enough for you, without being gushy or overbearing. Very nice people. We stayed in Istanbul for a week and i found 3-4 days was enough in Sultanmet and then we moved up to the newer part of the city so it was good to have the variety, though you could easily stay there as a base.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cologne, Germany", "Title": "“Beautiful little hotel with excellent service in the heart of Istanbul”", "Author": "Charlie S", "ReviewID": "UR119454844", "Content": "We stayed there for only two nights but it was really a beautiful place, very clean, ideally located because very close to the main sights in the heart of Istanbul. What makes this little hotel so special is not only its atmosphere and delicious breakfast but the team that was extremely friendly and was always helpful when information about the town etc. was needed. I would definitely stay there again and can recommend Millennium Suites to everyone who is looking for a pleasant stay in a hotel with a friendly atmosphere!", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent, well-located hotel with large rooms”", "Author": "benjin", "ReviewID": "UR119441677", "Content": "This hotel is well-located only a few blocks from the major tourist sights and on a relatively quiet street lined with sidewalk cafes. It is small, I think maybe only 7 rooms. The rooms are beautifully decorated and quite large. The AC works fabulously well. Breakfast was excellent. The staff were helpful. Absolutely no complaints. We greatly enjoyed our time in Istanbul; it is a fascinating city!", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atenas, Costa Rica", "Title": "“A bit of a jewel!”", "Author": "Peter P", "ReviewID": "UR119373044", "Content": "We spent 8 days at the Millennium Suites. It is a real find, perfectly located with a staff that aims to please. All the rooms are large and well equipped. After a one-night stay on the first floor suite (too dark for us), we moved to room 402 facing the street. Our concerns about street noise were misplaced. The Topkapi palace, Blue Mosque and Hagia Sofia are within quick walking distance. The hotel's restaurant is good to very good. We have been privileged to stay in some of the best hotels in the world (typically on an expense account). Despite its petite scale, our stay at the Millennium Suites ranks in our memories with grander hotels. We hope to get back to Istanbul and there will be no question as to where we will stay.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fairfax, Virginia", "Title": "“You Will Like This Hotel In Istanbul!”", "Author": "mustang649", "ReviewID": "UR119300813", "Content": "I just had the pleasure of staying in this hotel for a week and I thoroughly enjoyed it and can only echo the comments of many other fellow travelers who have reviewed this hotel on TripAdvisor! I was here on business, but it is a great little hotel for most of the major attractions in Istanbul and I actually selected it because if its location. It is within walking distance of the Blue Mosque, Hagia Sophia, Topkapi Palace and many more places. It is also within an 8-10 minute walk of the tram, (Sultanahmet Station) which is a very good and cheap way to get around Istanbul. It costs only 2 Turkish Lira for a one-way ticket anywhere. It's also a good way to go to the port, if you're taking a cruise. It was so convenient that I didn't even use my rental car the whole time I was here. The hotel is very comfortable and the bed is one of the most comfortable I have ever slept in, in a hotel, and I travel a lot! The towels are Turkish towels - large and very soft! The shower is spacious by European standards and the room is larger than most European hotel rooms. The Wi-Fi worked great in the room! The breakfast is free and good - they even make omelets for you! The only drawback is the fact that the hotel has no elevator and only one of the rooms is on the ground floor. The other rooms are located on the other three floors of the hotel, but Taner, or one of the other clerks, will graciously carry your bags to your room. The hotel is situated on one of the most popular streets in the Sultanahmet area and is surrounded by numerous shops, restaurants and other hotels. You won't go hungry and you'll have plenty of places to contribute to the economy of Istanbul! The best thing about this hotel is the people! Alper, the Manager, is the consummate professional and very conscientious about his hotel and his guests. Taner, one of the front desk clerks, has a smile as wide as the Bosphorus and is a very courteous and helpful young man. He has a university degree and is actually a licensed tour guide, so he's a great source for finding out where to go, how to get there and what to do, in Istanbul. I had a wonderful visit here and I would come back here again and would highly recommend it to others.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Perfect little hotel”", "Author": "Diana E", "ReviewID": "UR119251028", "Content": "What a great little hotel. Very comfortable room (I now realise I need new pillows at home!), great breakfasts served by bubbly and efficient waitress, very convenient location for all the things we wanted to visit in a 4 day stay. Lots of restaurants and cafes nearby. The service was cheerful and really excellent, including sustained help with sorting out a charging mistake at a nearby restaurant, for which we are very grateful. Thoroughly recommend, even more so if a good price deal is on offer.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Lovely hotel close to the main attractions”", "Author": "Glenn R", "ReviewID": "UR118959714", "Content": "Just ended a short break to Istanbul where we stayed at the Millennium Suites. Staff were lovely and very helpful. The hotel is easy walking distance to Hagia Sofia / Blue Mosque / Topkapi Palace in an area which while obviously tailored for tourists is nonetheless a great spot to relax on a lounge with cocktail or a shisha pipe. The hotel itself is very small, but the rooms are large, well appointed, comfortable, very clean and with quiet and efficient aircon. The beds are super comfortable and the bathrooms have terrific showers to blast away the dust from the days sightseeing with high pressure hot water and a nice amenities pack, though no moisturiser which is a small oversight. There is a small restaurant / bar at the front of the hotel with outdoor seating which is perfect for a cold beer or a late lunch. A small but nice breakfast buffet is also served here with omelette made on demand. We also booked a tour of the main historical sights through the hotel and this was very useful in getting some historical background and bypassing some of the queues although you don't get much time to take photo's along the way. You may not get the views or the pools and bars of a big hotel here, but you really can't beat it for friendliness, service and convenience. I was staying in a room by myself and so I didn't think the price was especially good value but nonetheless I definitely recommend. One small gripe - it may say that you get a free airport transfer but that is only from Ataturk - not Sabiha, which costs â‚¬60 cash. This may seem like a lot, but when you get stuck in Istanbul traffic for 2.5 hours it begins to look cheap!", "Date": "October 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Le Mans", "Title": "“A wonderful hotel”", "Author": "Mike W", "ReviewID": "UR118939949", "Content": "On the reviews on Trip Advisor we spent 3 days at this wonderful hotel. A great location and staff made our first trip to Istanbul an unforgettable experience. They organized airport pick ups and walking tours of the main attractions. We can hardly wait to visit again. Thanks Taner and all the staff.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Peace and quiet, but close to all the action”", "Author": "fourbigkids", "ReviewID": "UR118909328", "Content": "Had a lovely time at Millenium Suites in Istanbul. Akbiyik is a busy street full of restaurants and boutique hotels, close to the main attractions in Sultanahmet. The rooms are quite and peaceful. The furnishings are very new and in pristine condition. The large rooms are kept spotlessly clean and the staff cannot do enough for you. Quality continental and 'serve yourself' breakfast with omlettes to order, a great start for the day. The in-house restaurant serves an interesting combination of Italian and Turkish meals. The Italian was a welcome change after a week of kebap and barbequed aubergine! Recommend this small hotel highly. Thanks Tanir and the team at Millenium Suites.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cherry Hill, New Jersey", "Title": "“Excellent choice!”", "Author": "MIKSTV", "ReviewID": "UR118810575", "Content": "My travel agent wife and I chose this hotel for its reviews and location. What a great welcome to Istanbul! Not only was the pickup at the airport efficient and friendly, but the welcome at the hotel was warm and inviting. We had a gorgeous room on the third floor (puff-puff), overlooking the street. Lots of fun opening the window, peering down on the street action below. Alper (the pony-tailed one...there are 2) was a great host, he and his staff could not do more for us, inlcuidng lugging our 3 heavy suitcases up the winding staircase (this was the first stop of a 19 day trip). Location close to all attractions is great. Blue Mosque, Hagia Sofia, Topkaki Palace, waterfront all within short walk. The Turks in general are very warm and friendly folks. We hired a private guide for 2 days who got us into everything needed, right to the front of the lines :) Thanks Alper and staff for making our arrival and stay most enjoyable and welocming!", "Date": "October 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Ramon, California", "Title": "“Wonderful small hotel”", "Author": "Susan C", "ReviewID": "UR118572448", "Content": "My husband and I spent 4 lovely days at the Millenium Suites in September 2011. This is just the nicest small hotel; wonderful staff; large well decorated room; execellent location; the owner and his staff were the nicest we have met in our world travels; they assisted us in setting up a great local private tour guide, arranged dinners at restaurants with free shuttle service and made our stay an enjoyable memory; we certainly hope we can return again one day. If you are planning on staying in the Sultanahmet area of town you could not do better at any price!", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent!”", "Author": "maclamb", "ReviewID": "UR118490061", "Content": "Stayed 4 nights in this lovely small hotel with 3 friends. We received a courtesy pick up and return trip to the airport and were looked after by the most friendly, helpful and knowledgable staff at the hotel. Our (many) requests were met always with a friendly smile, and we were made most welcome. Our rooms were impecably clean, large and had beautiful bathrooms. Really good beds. The other plus point is its location, a short walk to the Blue Mosque, Aya Sofya and Topkapi Palace. The Grand Bazaar is also walkable, around 15 mins (shortest route). Located in a buzzy vibrant street with lots of restaurants to choose from. Breakfast and meals at the hotel were very good too. Would stay here again and would recommend to others.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "K-U", "Title": "“Best experience”", "Author": "Grande_Muraille", "ReviewID": "UR118433588", "Content": "I stayed at this hotel with my friends and we had a great time. The staff was not only friendly and very helpful, but also very informative as well. We usually don't use travel agents for our tour and the hotel staff provided a lot of useful information which makes our days much easy and enjoyable. We appreciate this hotel and definitely stay here when we will be back to Istanbul again in future.", "Date": "September 22, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Plano, TX", "Title": "“Seven Nights at Millennium Suites”", "Author": "clayontheroad", "ReviewID": "UR118284674", "Content": "My wife and I spent seven nights at Millennium Suites last week. As described in all other reviews, the hotel staff is outstanding and location is perfect. Breakfast offered a nice variety of fruits, cereal, meats, and omlettes are available if requested (I suggest asking, they were very good). Alper, who runs the desk during the day (as opposed to Alper the manager), offered great suggestions and made several of our arrangements for us. All went smoothly. Our room was fine in size, the bed was extremely comfortable, and the bathroom was well appointed. We have traveled to Europe several times and always stay at boutique hotels found through Trip Advisor. This was the first hotel where the shower worked perfect! One thing to keep in mind. We stayed in Room 401 on the top floor. It's 52 steps up a circular staircase to get there. If you need to lose 30 pounds like me, then the exercise is not a bad thing! However, folks who have trouble climbing stairs may want to request a room on a lower floor. Our room faced the alley and we never heard street noise or the morning call to prayer. We slept very soundly with no interruptions. Alper (the hotel manager) understands that good customer service is more than just a smiling staff and clean towels. Our reservation had an unconventional aspect and he handled it wonderfully. When the back office runs as well as the front of the house, then you know you have spent your money with good people. If you consider these issues important, then Millennium Suites is an outstanding value and we would certainly stay there again.", "Date": "September 18, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Ann Arbor, Michigan", "Title": "“More than pleased”", "Author": "James C", "ReviewID": "UR118259357", "Content": "Great location, friendly staff, nice, well-maintained room in a boutique hotel. Ample fresh breakfast. The location is close ( a few short blocks) to many major attractions. Even the Grand Bazaar is within easy walking distance. We were only in Istanbul for two nights and had plenty to do and see locally and never had to resort to a taxi. The narrow street is home to mainly small hotels and street-side restaurants. The Metropolis restaurant (within throwing distance of the hotel) was our favorite. Some restaurants have a rooftop option with a view of the Bosporus. The cobblestone street is quiet in the morning and bustling later in the day (no sidewalk but fun to walk). The room was street-side and we worried about evening noise but it was no problem and fun to look out on the action. We would stay there again and would not change a thing (except, perhaps, a lower floor).", "Date": "September 18, 2011"}, {"Ratings": {"Overall": "5.0", "Rooms": "5", "Service": "5", "Location": "5"}, "AuthorLocation": "Hadda", "Title": "“Great time.”", "Author": "Kareem40", "ReviewID": "UR118221820", "Content": "When I had to find a hotel, after extending our stay in Istanbul, I found this hotel with a high rating. Few hours After completing my booking, I received a call from the hotel manager, extending his apologies that one of the rooms needs some maintenance that will involve little paint, which will cause a probably fumes. So he offered me to pick me up from the airport, reserving two rooms in an adjacent hotel, holding the same class, and cupones for a free tour, and a free dinner... The offer was hard to resist. Reaching the adjacent hotel, the Millennium hotel manager was waiting for us, and helped me check in, and when we got to the rooms we found two beautiful flower bouquets, with the compliments of the millennium hotel. At that time I knew why Millennium hotel is getting the high ratings, even before I step a foot in the hotel; it is the beautiful welcome and the help that they are very happy to extend to their clients. Having children with us, I needed some extra help, so when I checked the next morning in the hotel, I was given choices to be upgraded, but I didn't want that, we wanted rooms close to each other, so we were given two rooms in one floor (the hotel has only two rooms each floor) and from the stair way you had to open a door to walk to the landing area where the two rooms were, so we had that small hall, our room doors were open, and we had our self a beautiful flat! We all had a great time! All staff were friendly and helpful, and made us feel welcomed.", "Date": "September 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Socorro, New Mexico", "Title": "“Wonderful, friendly, small hotel in Sultanamet.”", "Author": "Marie G", "ReviewID": "UR117901424", "Content": "My husband and I stayed at the Millennium Suites recently and we would definitely stay there again. The room was comfortable and quiet; the staff were very friendly and helpful. The location was wonderful: Akbiyik is a vibrant street in the Sultanamet district which enfolds Byzantine ruins and is filled with Ottoman buildings. Many amazing places including the Hagia Sophia are a pleasant stroll away. We would love to return soon!", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Awesome location, awesome staff.”", "Author": "50CountriesSoFar", "ReviewID": "UR117809258", "Content": "The staff at Millennium are what set it apart. In a word, they are amazing. I have never been greeted so warmly and treated so pleasantly in a hotel, and I've stayed at my fair share of Four Seasons and the like (which, by the way, there is one around the corner so that says a lot about the location!). The value for money is excellent, and their Italian chef serves up a great pizza margherita if you are in the mood, and does an equally find job with Turkish fare. I enjoyed sitting at one of their lovely tables on the street watching the world go by while reading my guide app planning my day. The street is full of many tourist friendly hotels and restaurants so you can be completely in your comfort zone if you are a little nervous about coming to Turkey. Thanks for a wonderful stay!", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“EXCELLENT !!!!”", "Author": "SetianDim", "ReviewID": "UR117784798", "Content": "Excellent Location, very close to Sultanhmet Square. The service was perfect and we will stay there during our next visit to Istanbul. Julia Athens, Greece", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Heart of Istanbul Old City”", "Author": "KKQueen", "ReviewID": "UR117760000", "Content": "This is a real treasure situated right in the heart of Sultanamet, within minutes of Topkapi, Hagia Sofia and Blue Mosque. The hotel may be small but beautifully organised, spotless spacious rooms, with kettle and refreshments. Lovely toiletries provided. Very comfortable bed. The staff are very welcoming and friendly, and very happy to help with suggested sight-seeing routes. The restaurant is mainly Italian but we had the Turkish Specialties and they were delicious. All in all, we would recommend this hotel, and would definately hope to return again.", "Date": "September 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“You Will Feel Welcome”", "Author": "IlanDC", "ReviewID": "UR117685848", "Content": "We received a very pleasant welcome from Taner, the rooms manager, upon arrival, and without asking he offered us an upgraded room with a large patio. What we didn't realize upon check-in is that Taner's good English is unusual in Turkey, even in cosmopolitan Istanbul. The rooms (only 7 of them) are clean and nicely renovated, and the insulated windows are important since the hotel is located on a street with many bars and restaurants that play music until late at night. Within 10 minutes, you can walk to Topkapi, Ayasofya, the Blue Mosque, and the Basilica Cisterns -- or take the T1 tram to any of the other sites (like the newer Istanbul Modern art museum). The hotel features a comprehensive breakfast, including omelettes made to order, and their pizza is very good. All the staff are warm and friendly, and I would highly recommend this hotel if you enjoy staying in a nice location and interacting with the local staff.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "nirtak99", "Title": "“Nice hotel, great location”", "Author": "nirtak99", "ReviewID": "UR117483621", "Content": "For a stay in Sultanahmet, the location of the Millennium suites can't be beat. Easy walking distance to all of the major sites, located near lots of restaurants and a lively street. The room itself was large and clean and suited us just fine, and the hospitality was also very good, with Alper even preparing a plate of fruit for our hungry 2 year old after an arrival after midnight.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Heemstede, The Netherlands", "Title": "“Very friendly, warm and kind staff”", "Author": "Suat T", "ReviewID": "UR117191752", "Content": "We stayed at the Millennium Suites for 5 days (family of 4, parents plus children 10 and 12). We booked one room but they surprised us with two rooms. The rooms were clean and comfortable. The Millennium is perfectly located nearby Sultanahmet, Hagia Sophia (Aya Sofya) and Topkapi. The hotel offers a very tasty Italian/Turkish cuisine. Ask the Chef for something special and he will prepare something delightful. The staff is friendly, warm and very kind. Arzu, Taner, Pusat, Soner, both Alpers and off course the chef de cuisine: I'm looking forward to meet you again very soon in this inspiring city Istanbul. Thank you all for the hospitality!", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Diego, California", "Title": "“HÄ°GHLY RECOMMENDED”", "Author": "sehzadem_27_", "ReviewID": "UR117169650", "Content": "There are not enough superlatives to rate this hotel. It is the Best Hotel experience. We have ever had. The Hotel has 3 floors. The room was amazing and spacious and the service impeccable. The staff are genuinely interested in how you are finding your stay. Service, Friendliness, Cleanliness, Food quality cant be matched at any other Hotel.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“what a fantastic hotel”", "Author": "annieob66", "ReviewID": "UR117081489", "Content": "i booked the millennium suites hotel for my husbands birthday and what a find we could not praise it enough .all the attractions right on the doorstep .the hotel staff were brilliant so friendly and helpfull they made my husbands birthday extra special and also provided a birthday cake .we loved the size of the rooms and the tea/coffee facility were a welcome bonus as for istanbul what a fantastic city it is definitely going back and most definitely staying at the millennium suites . thanks to all the staff for making our break so memorable from ann and george obrien", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“excellent hotel in old city!”", "Author": "clarabautista", "ReviewID": "UR116951357", "Content": "we enjoyed the millennium suites.this hotel is small but has a big rooms and very clean..the staffs are very friendly.if you are stay in millennium suites,your holiday will be great.because this hotel location is very easy and you can walk everywhere in sultanahmet.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“small and great hotel!!”", "Author": "paoalonso", "ReviewID": "UR116942916", "Content": "this hotel is really small but the atmosphere is very nice.service is excellent!The hotel staffs are very friendly and helpful.we stayed 5days,everything is very clean.this hotel location is very good.we went to walkable to everywhere in sultanahmet.we liked this hotel.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Lovely Hotel!”", "Author": "Abudhabi2010", "ReviewID": "UR116890811", "Content": "I spent a night in Istanbul on my way back to Abu Dhabi from Prague. The hotel is in a wonderful location at the heart of the city. The room I was staying at was absolutely gorgeous, very clean and very very comfortable. I strongly recommend the hotel if you want to have a place where you can relax but at the same time be at the center of all action!", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Perth", "Title": "“Perfect place to stay”", "Author": "kitesurferPerth", "ReviewID": "UR116886621", "Content": "Very helpful and considerate staff. Large rooms, well furnished with very comfortable bed. Excellent location", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Welcome back!”", "Author": "Mikers_P", "ReviewID": "UR116763337", "Content": "I was staying with Millenium suites for second time. There were no significant changes in the hotel since our last visit (August, 2010), but they started Italian restaurant with perfect cuisine and great choice of pizzas!! The hotel is located very good - few steps from Aya Sofia and Blue Mosque, the historical center of the City! I can 100000% recommend the hotel for the great staying! And don't forget to book a airport transfer - they do it perfect! Wish you a good luck, Millenium suites!", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Very good”", "Author": "Luca D", "ReviewID": "UR116553591", "Content": "We (my family and I) spent 2 days in the Millenium Suites. The hotel is strategically located, close to the main tourist sites. The rooms are large and clean (everything is almost new). The staff is really friendly and helpful. What to ask more ? I definitely recommend this hotel, and we will be back next time we come to Istanbul.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Great location and very friendly staff”", "Author": "JW10_11", "ReviewID": "UR116415819", "Content": "We stayed here as a family of four and couldn't have been better looked after. Milleniium Suites is ideally located for the main tourist sites in the old town of Istanbul which are easily walkable. The street is full of restaurants and bars which have a lovely atmosphere at night and unlike one of the reviewers, we had no problems with noise at night and we were staying in street side rooms. The staff here are very friendly and welcoming and very attentive. We would definitely recommend Millenium Suites to anyone visiting the tourist sites of Istanbul.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Hong Kong", "Title": "“Friendly, comfortable and clean boutique hotel.”", "Author": "hktransplant", "ReviewID": "UR116352504", "Content": "We are a family of 9 (aged 3.5 to adults), stayed at the hotel for 4 days, and we occupied 3 rooms out of 7 rooms available. All the rooms are quite consistent: clean, good sized and comfortable. The hotel staffs are very friendly and helpful. If you don't mind to negotiate the stairs, the experience is comparable to the much more expensive hotel (1 room is available on the G/F). Overall, it is an enjoyable experience with all the major sights located nearby / walking distance. Will come back for sure if we are to visit Istanbul again.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Gold Coast, Australia", "Title": "“Great small boutique hotel”", "Author": "Lucy321", "ReviewID": "UR116034175", "Content": "A terrific boutique hotel experience with great beds and great staff. Situated in the \"old town\" a short walk from all the tourist must sees. Every day when we came back from sight-seeing we were grateful of the hotel's position and the staff. They seemed like family and were always very welcoming. We would recommend this hotel to anyone who wanted to be within walking distance to all the tourist sites.", "Date": "July 30, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Asia", "Title": "“Very nice small hotel”", "Author": "Panguin", "ReviewID": "UR116010478", "Content": "If you want to be around the Sultanahmet area, and the price is right--like when I booked several months ago, not what I now see on TA--consider this hotel. The road where the hotel is located, Akbiyik Street, is/was apparently a backpacker's alley. You will see many young people pulling their luggage along the road and there a few places with the label \"hostel\" emblazoned across them. MS, Senatus next door, Byzantiium across the road, are one of several hotels along the stretch. At the end of the road where the hotel is located, there is a taxi-stand, which makes things convenient. Although I'm puzzled why 9 of 10 taxi drivers did not know the street. So on the one hand, this means that there are a lot of shops and facilities catering to tourists. There is a laundry shop down the road opposite the taxi stand. There are a couple of tour companies on and around Akbiyik. Even a Turkish bath. There is a range of restaurants. The BalikÃ§i Sabahattin is right and down the road from the hotel. Up the hill towards Sultanahmet are ATMs that can give you your cash in euros and US dollars. On the other hand, it can get busy till pretty late. So if you do book a hotel along the strip, be sure the window is double-glazed. The windows of Millenium Suites apparently are. Also on the same other hand, do not expect much by way of facilities. MS has no gym (not even an elevator), no pool, no shop, just a restaurant. Reception doubles as the tour booking desk. There are only seven rooms in the entire hotel. In my book, a small hotel does not automatically a boutique hotel make. But it does make for a friendly atmosphere. Breakfast can be tailored to your taste albeit up to a point. It's very pleasant to sit on the patio for breakfast. The room I had was not particularly large although I gather from friends who dropped by that it was large by Istanbul standards. It is not, however, a room to spend an extended period of time at work unless you can work on a square wheeled ottoman (there, wanted to use the word in talking about a place in Istanbul). MS has comfortable slippers. Bathroom amenities are sufficient. The bathroom is a a little tight but comfortable. Water pressure is good. The shower stall's doors are water-tight. A small snag is the lack of a hook on the back of the door. Service is the highlight of the hotel. Staff generally go out of the way to get you what you want? No bread? They walk to a bakery nearby to get it for you. No plums? They borrow from a restaurant. Twice. Booking a tour? No problem. If the price fits, go for it. You may expect friendly service but nothing by way of facilities. And when going by taxi, stop at the Byzantium hotel because the MS signage is small and my car missed the hotel. Twice.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Great Hotel”", "Author": "Runaustralia", "ReviewID": "UR115887994", "Content": "A really nice small hotel in the centre of the action. Large spacious rooms.Service is excellent.We had the 2 rooms on the second floor 1 for our children and the other for my wife and I.With out hesitation would gladly recommend if you are used to 4 or 5 star accomadation this place is for you. Very central position close to al tourist attractions.5 minute easy walk.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Hamilton, Canada", "Title": "“Highly recommended, what a lovely place”", "Author": "Rigante", "ReviewID": "UR115810084", "Content": "I have just returned from a 3 day weekend in Istanbul where I stayed at the Millennium Suites. I can happily say that this was one of the most pleasant stays I've had at any hotel. First of all, the location is perfect for a first time trek into the beautiful maze that is Istanbul. It is located about a 5 mins walk from the Blue Mosque, Aya Sofia and the plenty other sites nearby. Akbiyik Cadessi is a very cool street in the centre of Sultanahmet that contains countless restaurants and cafes where you can drink, smoke a water pipe and eat some very excellent food. When I first arrived I was greeted by Alper (there are two Alpers, this was the long haired Alper) who took my bags and had a nice breakfast spread out so it was a good way to start my trip. The owner, Alper (short hair), is a very welcoming and nice guy, I was late for breakfast one morning so he brought me out a Turkish coffee and we ate a couple pizzas cooked by the chef in the hotels Italian restaurant. They were fantastic, the chef used to live in Italy and it shows. I spent almost a year in Italy myself and the pizza brought me right back there! We chatted and had some good conversation as if we'd been friends for a long time. I stayed in room 202, one of two suites on the second floor. The room I had was really great. It's surprisingly large and the bed was very comfortable. There's a flatscreen tv and the wireless internet was very fast. The bathroom is also very good, everything is nice, new and modern. Not to mention the water pressure from the shower is fantastic! Akbiyik Cadessi can be a pretty busy place in the evenings but I couldn't tell from my room, the windows are well sealed and I could barely hear a thing, I slept like a baby. I would definitely recommend this place, Alper and his team really make you feel at home there, and it didn't feel forced whatsoever. The Turkish people are very welcoming and this hotel is definitely a perfect showcase of that quality!", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "new jersey", "Title": "“Fantastic Staff, Clean Large Rooms, Wonderful Experience, We Miss It!”", "Author": "diytrying", "ReviewID": "UR115776504", "Content": "My daughter and I spent 6 great nights here and to repeat what previous travelers have said, this is a wonderful small hotel. The room and bathroom are large and extremely clean with lots of extra quality toiletries, the beds and pillows are extremely comfortable, air-conditioning works well and is quiet and the location is perfect. Only two rooms on our floor so it was quiet except for a little street noise. Lots of good restaurants and sights within easy walking distance. And the WIFI was free and reliable. But what makes it really special is the staff. I can't say enough about how accommodating and pleasant they were, from Alper the manager,( who gave us an extra tram pass he had) to the men at the desk who met every request quickly and extremely courteously. No one would let us carry anything up or down the stairs. They even held breakfast for us the first morning because we overslept. Plenty to choose from at breakfast and Arzu is the very best.....her smile and friendliness will make every breakfast the perfect start to the day. We missed you guys at breakfast the next day too and can't wait to come back.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Tehran", "Title": "“Small but very friendly and efficient staff run a really neat, little hotel in prime location”", "Author": "abbeylands", "ReviewID": "UR115705313", "Content": "MS is a small hotel, run efficiently by a small and very friendly staff, who are conscientious and accommodating. Both the rooms we stayed in were spacious and well lit. All the basic amenities worked well. The location is great for accessing virtually every part of the old city. The stairs were a bit of a slog for my old man, so we moved to the one room on the ground floor: folks with dodgy knees and hips should therefore beware. But altogether we had a great time.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "North Chicago, Illinois", "Title": "“Nice location, nice rooms”", "Author": "dugu99", "ReviewID": "UR115556446", "Content": "The hotel is located close to all major attractions, and the street that the hotel is on is lined with restaurants (some very highly rated on TripAdvisor) and very lively at night. The room is nicely decorated and air-conditioned. The breakfast is quite delicious. The staff are courteous and helpful. Overall I enjoyed the experience and will stay here again. Just a note: skip the hotel transfer, which at 25 Euro is not worth the money, since taxis to or from the airport (Ataturk) costs only ~36 TL (or 15 Euro).", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“'' in the centre of the history where east meets west & Luxury and well known Turkish hospitality''”", "Author": "lucas1985", "ReviewID": "UR115444613", "Content": "Istanbul is a unique city where east meets west.We decided to spend more time for a comfortable small hotel.The location is perfect, 100 yards from the Topkapi Palace and 200 yards from Hagia Sophia and the Blue mosque and the cistern as well. Excellent sound proof rooms.Hotel staff is so hospitable , friendly and helpfull.High marks to Millennium and its team.We have already decided to visit Istanbul again next year and definetely will stay in this nice hotel.", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Pune, India", "Title": "“A gem of a place in Istanbul”", "Author": "indiancouple", "ReviewID": "UR115327120", "Content": "Hotels can be impersonal, especially in a large city...but not this one. It exceeded all our expectations, and left a very nice feeling in our minds. It is superbly located in the heart of Sultanahmet, on a street which is lined with hotels and restaurants. It is a hop skip away from the Blue Mosque, the Aya Sofya and the Topkapi Palace. What floored us completely was the size of the rooms, which were palatial, and the decor was absolutely fantastic. The bathrooms were large and well stocked with toiletries. The free wi-fi worked like a charm. There were even fresh flowers placed in the room ! The trappings make you feel you are in a 5-star property, whereas the price is most reasonable. Just could not believe that we got such rooms at such a price. Learned that the hotel is just 10 months old. Its manager is also its part-owner, a young 31 year old man called Alper. He runs the hotel with his heart, and it shows in every part of his dealing. When we reached, he was waiting for us with the bad news that due to some goof-up, they had overbooked for the day, and we would have to spend the first night (out of 4 nights) in a hotel across the street. Just when we were about to scream, he pacified us by saying that this first night's stay would be free, and he was also throwing in a free Bosphorus cruise to make up for the mistake ! Now this was going beyond the call of duty. The hotel across the street looked the best on the street, so we readily accepted. The rooms turned out to be just OK, and we were expecting similar rooms when we were transferred to the Millennium Suites the next morning. But we were blown away when we saw the rooms at Millennium ! The breakfast spread was outstanding. The staff were so courteous and helpful. There is no elevator in the hotel, but the staff gladly carted our luggage up and down. When I inquired about the best place to change currency, Alper advised me to do it at the Grand Bazar. When I mentioned that I may not be going there for 2 days, he offered to lend me a few hundred Turkish Lire, which I could return whenever I had changed my currency...now that kind of an offer I have never received from any hotel in the world. And the day we went on the afternoon Bosphorus cruise, we ordered some sandwiches to be packed, which we took. When we offered to pay for them, it was waived away as a complimentary offering ! This is what I mean when I say that he runs the hotel with his heart. We were two couples, and we felt quite attached to Alper and his team by the time we left. I don't care if this review sounds like an advertisement.....I have posted far too many reviews on this tripadvisor forum to attract any doubts ! I rarely say this about any hotel, but I will say that this is one of the nicest stays I have ever had anywhere. I have stayed at much fancier places, but this place is real value for money. I don't know if Alper will ever make much money by handing out so much for so little a price, but I certainly wish him all the best !", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Innsbruck, Austria", "Title": "“Nice room, friendly staff, great value!”", "Author": "MrKays", "ReviewID": "UR115238556", "Content": "I stayed with my girlfriend six nights at the Millennium Suites Hotel in Istanbul. We had a pleasant stay thanks to very friendly stuff and a spacious, clean room in a central, touristy location. The breakfast buffet was good and the wireless internet was complimentary! We paid 100 euros per night which is a great value for this nice place!", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“wonderful hotel”", "Author": "mariacarolina0", "ReviewID": "UR115221725", "Content": "What a fantastic room, much better than the usual rooms in istanbul since we travel at least 3 times to Istanbul each year. The room had 1 large beds, extremely comfortable, lots of pillows and was a full size double bed, again very comfortable - much better than the standard bed style. The room itself was very large and airy, very clean and comfortable. The towels in the bathroom were very large, and the toiletries good quality. We thoroughly enjoyed the buffet breakfast - the variety and quality of the food was excellent. The staff were friendly and polite, and kept the restaurant very clean and tidy, used plates were quickly removed and finished tables cleared immediately. Although we only stayed two nighst I would recommend this hotel, and would have no hesitation in using it again. ....", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Mixed results”", "Author": "atw100", "ReviewID": "UR115125823", "Content": "We had two rooms for four people at the Millennium. One, which was upstairs, was very nice and certainly a good value. (We had relatives staying at the nearby Four Seasons, and our room compared somewhat favorably, especially for the price.) The room at the Milennium was modern and updated, spacious and comfortable. The second room we were given was downstairs and gloomier, on the same level as the restaurant. Unfortunately, the air conditioning for that second room was broken and never fixed during our two-day stay. With the warm weather, this made the room very uncomfortable, and the hotel offered nothing in the way of alternatives or a reduced rate. The rooms came with breakfast, which was quite good. The location is excellent if you are sightseeing in the old city.", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“\"we loved this hotel\"”", "Author": "edgar30", "ReviewID": "UR114827677", "Content": "We have just returned from our 4 night break and cannot find fault with Millenium Suites. The level and quality of service provided by Alper and his team was exceptional! The rooms are spacious and luxurious, as are the en suite rooms. The large TV provided good entertainment in the form of a vast array of channels. We personally did not have any problems with outside noise as the bars and restaurants tended to close before our bedtime, but I can imagine if a guest wants to go to sleep at 9pm this could be a problem. However the beds more than made up for any lost sleep as they were heavenly. In fact, I missed the hotel bed on my first night back home. Alper endeavoured to see to every detail of the trip, which included recommending superb tours and things to do during our visit, unlocking combination locks which had malfunctioned and organising birthday surprises!!! I donâ€™t think there is anything Alper will not do. The breakfast was great and we looked forward to the delicious choices on offer each morning. We didnâ€™t try the hotel restaurant however during the evening it was packed most nights which clearly speaks for itself. The hotel was situated a stoneâ€™s throw from Topkapi Palace, the Blue Mosque, etc so very convenient for tourists. Similarly, there were lots of places to eat out for those looking to relax. The cobbles and ancient architecture certainly gave it the â€˜Old Cityâ€™ feelingâ€¦ We plan to return to Istanbul soon, and when we do Millenium Suites will be our first choice!!! Cannot recommend it highly enough. It definitely surpassed our expectations.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Naples, Florida", "Title": "“A Jewel In the Sultanmet, Istanbul”", "Author": "tackless3", "ReviewID": "UR114783687", "Content": "Attentive and helpful multi-lingual staff, exceptionally clean, and very good food. A superb location within easy walking distance of 5 star restaurants and holy sites for both Moslems and Christians. Owners/managers Yelchin and Alper (phonetic) and their staff get our highest rating. We will be back.", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“great hotel!!”", "Author": "edward_johns", "ReviewID": "UR114730540", "Content": "We stayed at Millennium Suites for 4 nights in a lovely room.The breakfast is always offered with a smile.The manager ,Alper is always take care anything for our comfort.There is nothing he will not do for you.Millennium is a real boutique one if you are looking for this kind of hotel. All people are really friendly and honest and they know all about the city like a guide.Actually the front desk staff are still a student ,studying guidance. The rooms are really clean and large.It is good value for the money we paid.Its location could have been better,all important places ,mosques,museums are nearby.thanks to all", "Date": "June 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“A Splendid Little Hotel in a Great Location”", "Author": "hughstevens", "ReviewID": "UR113455968", "Content": "My wife and I and another couple stayed at the Millennium Suites for five nights during a recent trip to Turkey. Everything about this friendly little hotel was first rate: the rooms are spacious and comfortable, the bathrooms are well-appointed (the showers are particularly nice), the Turkish breakfast is lavish and varied and the location (easy walking distance to the Hagia Sophia, the Blue Mosque and the Topkapi Palace) is terrific. The very best thing about the hotel, however, is the staff. Everyone went out of his or her way to make sure that we were comfortable, to answer our questions, and to assist us. My wife became ill during our stay as the result of a drug reaction, requiring her to stay in the room and limit her diet to very bland food for the better part of two days. The solicitous and concerned hotel staff went out of their way to provide her with pots of tea and special meals. We have stayed in fancier hotels, but we have never had better service.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Antwerp, Belgium", "Title": "“Just fantastic”", "Author": "Filip73", "ReviewID": "UR111479608", "Content": "My wife and I stayed here together with my sister and my parents for 3 nights before getting married in the Four Seasons Sultanahmet. They had arranged a van to pick us up at the airport. The staff at the reception was very friendly and fast - don't be misled by the small reception desk in the back of the restaurant - these guys know how to run their business. During our stay we got personal attention, at the breakfast table or whenever we went out or came back in, we always felt so welcome. The rooms were new and luxurous and very clean with free wifi. When we moved to the Four Seasons they offered to send over our luggage, and later that day they sent flowers to our room in the other hotel! The day after we came back to pick up my sister and my parents to go the airport, and the whole hotel staff was outside to say goodbye. I travel a lot both for pleasure and business staying in hotels in all price ranges; this was definitely one of the best experiences ever and simply the #1 experience if I take the price into account.", "Date": "June 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montclair, New Jersey", "Title": "“The place to stay in the Old city, Istanbul”", "Author": "JQNelson", "ReviewID": "UR109724740", "Content": "We stayed at Millennium Suites in Istanbul for 4 cold and rainy days this May, but the Hotel Manager, Alper, and his wonderful staff, Taner and Furkan at the front desk, Cem, the waiter, and Arzu, made our stay feel warm, welcoming and comfortable. While you do have to use the stairs, the rooms are clean, the beds large, well appointed and comfortable, and the environment of the wonderful street, lined with open air restaurants and a lovely block from the Blue Mosque, make that unimportant.. Go..you will not be disappointed...", "Date": "May 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Nice and Clean”", "Author": "FWTravelor", "ReviewID": "UR109668559", "Content": "I enjoyed my stay at the Millenium Suites. The hotel and its rooms are nice and clean. The location is perfect for walking to the major city sites. The staff is very obliging. Yes, they will give you a glass of wine when you arrive. There are convenience marts on either side of the hotel where you can get fruit, chocolate, water and wine. The staff is happy to let you use their wine opener. The breakfasts were excellent and the rooms were very clean. I think it's important to know that there aren't free afternoon drinks and snacks as one might infer from the website (I did). Yes, there is significant street noise. I was on the third floor. Still, I slept through it. The call to prayers throughout the night will be heard. While I very much enjoyed my stay, 112 Euro is very expensive! I'm a Hotwire/Priceline user, and in retrospect, I would've given either a try to reduce the price. I usually stay in European cities using these websites for no more than $120 a night for similar quality. However, it may not have been possible to beat the price for the location. Without advance booking, the other hotels in the area were going for $200 Euro.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berkeley, California", "Title": "“Wonderful hotel”", "Author": "Walker313", "ReviewID": "UR108675260", "Content": "We stayed at the Millennium Suites from April 15-20, 2011. It was a perfect hotel for our visit. First of all, the hotel provided us with private pick-up from the Istanbul Airport and returned us there (without complaint) at 3:00 AM the morning we departed. Secondly, the location of the hotel couldn't have been better. We were close to so many major sites in the old city--the Blue Mosque, Hagia Sophia, Topkapi, and more. We walked all over the city--even across the bridge into the neighborhood of the Galata Tower and beyond. We never needed or wanted to take public transportation of any sort except for when we cruised the Bosporus. The hotel was so convenient. Third, our room was spacious, clean, and comfortable. We felt as if we had a private retreat from the bustle of Istanbul when we wanted to rest. Fourth, the food was plentiful and delicious. At any time of day we could eat a meal, have a cup of coffee, a snack or a drink. The hotel was cozy and the endless attention and service were fabulous. Fifth, the staff was delightful and conscientious. We began to feel as if they were good friends before our stay ended. In short, the Millennium Suites was a perfect hotel for our visit. We will return again if we are in Istanbul.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southampton, England.", "Title": "“Almost Perfect”", "Author": "grahamstevens", "ReviewID": "UR108221309", "Content": "Firstly, let me say up front that we really enjoyed our stay at the Millenium Suites and any score below 5 stars would be completely unfair given the quality of our stay. However, it isn't quite perfect. To improve things even further I would suggest: a second chair in rooms, tissues in the bathroom, replacing fruit at breakfast (the same tired looking strawberries were offered each day, bananas and kiwis weren't replaced), checking and replacing in room tea / coffee and toiletries every day. And that is all. Apart from that, everything went so smoothly. The staff are both friendly and helpul (but leave you alone if that is your preference), the rooms are spacious and well equipped, the beds amazingly comfortable, wifi and bottled water are free. There is some street noise from the front bedrooms although this didn't really affect us. Overall a great place to stay and pefect for my No 1 Istanbul tip - go to the Blue Mosque after it officially closes to visitors to see it free of tour groups. We went at 9.30pm and there were about 20 people there. A far more spiritual experience than seeing it earlier in the day.", "Date": "May 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow", "Title": "“WONDERFUL HOTEL”", "Author": "Irina111Moscow", "ReviewID": "UR107922574", "Content": "Everything is wonderful in the hotel. Excellent location, spacious beautiful room (I`m not sure that it`s really 35sqm, but it`s big enough to feel comfortable). The view is the only thing that the hotel doesn`t have. But there are a lot of restaurants near with terraces on the top with incredible views. The staff is very friendly and the atmosphere in the hotel is very enjoyable. Before Millennium Suites I spent 2 nights in 5 star Swissotel the Bosphorus Instanbul, and I wouldn`t say that my stay in Swissotel was better then in Millennium.", "Date": "May 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Excellent!!”", "Author": "nikos80", "ReviewID": "UR107914622", "Content": "Friendly and polite people, very good prices,very clean and fantastic rooms, too close to Agia Sofia and Blue Mosque ( about 5' on foot ). Thank u Millenium Suites for these great moments in that fantastic location!! our minds are still back there!!!!!!!", "Date": "May 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“A magical hotel located in the heart of Istanbul!”", "Author": "Farah_Pervez", "ReviewID": "UR107416935", "Content": "We have just returned from our 4 night break and cannot find fault with Millenium Suites. The level and quality of service provided by Alper and his team was exceptional! The rooms are spacious and luxurious, as are the en suite rooms. The large TV provided good entertainment in the form of a vast array of channels. We personally did not have any problems with outside noise as the bars and restaurants tended to close before our bedtime, but I can imagine if a guest wants to go to sleep at 9pm this could be a problem. However the beds more than made up for any lost sleep as they were heavenly. In fact, I missed the hotel bed on my first night back home. Alper endeavoured to see to every detail of the trip, which included recommending superb tours and things to do during our visit, unlocking combination locks which had malfunctioned and organising birthday surprises!!! I donâ€™t think there is anything Alper will not do. The breakfast was great and we looked forward to the delicious choices on offer each morning. We didnâ€™t try the hotel restaurant however during the evening it was packed most nights which clearly speaks for itself. The hotel was situated a stoneâ€™s throw from Topkapi Palace, the Blue Mosque, etc so very convenient for tourists. Similarly, there were lots of places to eat out for those looking to relax. The cobbles and ancient architecture certainly gave it the â€˜Old Cityâ€™ feelingâ€¦ We plan to return to Istanbul soon, and when we do Millenium Suites will be our first choice!!! Cannot recommend it highly enough. It definitely surpassed our expectations.", "Date": "May 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "leeds", "Title": "“Wonderfully friendly, great location, great value, simply great!”", "Author": "holidayfiends", "ReviewID": "UR107137694", "Content": "Stayed here for 4 days - couldn't have been better looked after! Beautiful, spacious room - lovely shower room - excellent range of goodies! Staff exceptionally helpful and keen to make your stay as enjoyable as possible. Nothing but praise for this unique hotel.", "Date": "May 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Great Location”", "Author": "scde069", "ReviewID": "UR106810179", "Content": "We spent three nights in two double rooms and had one whole floor for us! The hotel is very clean, the service is great, the people are very nice! The location is very good, there are a lot of nice restaurants and also the most important places of interest are in walking distance. Thank you for all!", "Date": "May 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Hampshire", "Title": "“Very nice boutique hotel”", "Author": "tacostuff", "ReviewID": "UR106241156", "Content": "My wife and I stayed here in April 2011. Usually, we don't stay at boutique hotels, and opt for hotels like the Four Seasons, Ritz, or Mandarin. This time, we figured we would try this hotel based on the reviews here on Tripadvisor. Overall we were very happy, and we would stay here again. I would not call it \"5-star,\" but it was perfectly nice. Here are some factual observations: 1. When we first checked in, we were given the room on the first floor. I would not recommend this room. It is right off of the restaurant and is basically underground. The view out the window is a cement wall. To their credit, as we were checking in (before we even said anything) they told us we could move to another room the next day when another room opened up. We did this without any problem, and they even moved our bags for us. 2. As a boutique hotel, everything is very personal. Everyone that works there knows when you are coming and going. We usually like the anonymity that you get at a major chain hotel, but it was fine. They were not overbearing, and were actually very friendly. 3. The location is great. 5 minutes to the Blue mosque, 10 minutes to a T1 Tram stop, and the road has lots of restaurants and bars on it. One thing to note, some of the bars are pretty lively (i.e., loud), which didn't bother us (especially since we were creating some of the noise!), but if you are sensitive to this, make sure you get a room that faces the back of the hotel. 4. They advertise the rooms as 35 square meters. I didn't have a tape measure with me, but I don't think the rooms are this big. They are bigger than most European hotel rooms I've stayed in, but probably not 35m2. Overall, not a real problem, because the room was plenty big. 5. One small nit, there are only a couple of outlets. If you are electronic-heavy as we are, bring a splitter to plug all of your stuff in!", "Date": "April 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Old Bridge, New Jersey", "Title": "“I'm not sure it get's better than this!!!”", "Author": "SugaReh", "ReviewID": "UR103923087", "Content": "My husband and I just stayed in Millennium Suites last week. I cannot say it enough, this is one of the best hotels we have EVER stayed in. We have stayed in all types of hotels all over the world and I think I may have to put this right at the top. First ....the staff, from the moment we walked in the door, exhausted from a traveling, time difference etc. We were immediately taken care of. We arrived very early, way way before check in and they gave us an available room to sleep in until our room was ready....No one does that.....They did! The room was excellent, very very clean and a very nice size...the bed was sooo comfortable!!!!. Decor sexy! Not gaudy! Our room was thoroughly cleaned everyday. Breakfast was excellent (buffet style and omelettes made to order!!!) ...Breakfast was included too...this was Huge!!!! The waitress greeted us every morning with delicious apple tea and a smile. ...Oh and the location.....it gets no better! Walking distance to everything!!! The Bazaar, All the temples and the street the hotel is located on has a bunch of restaurants including the one in the hotel which is EXCELLENT and a bunch of surrounding restaurants that stay open pretty late which was perfect!!! Oh, and little convenient stores at least 3 that were like 3 minutes from the hotel, perfect for late night snacks which me and my husband love!!!! If you come to Istanbul.....You Must stay here.....You will be soooo satisfied and impressed .....over impressed because they make your stay here unforgettable! Oh and the pick up from and to the airport, EXCELLENT! A very clean, large van so you can actually stretch out!!!....so we were impressed before we even got there. I really hope this review is helpful to you. My husband and I never ever leave reviews, BUT, because of the way we felt about this place, we had to. I would recommend this hotel to everyone!", "Date": "April 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great hotel, great service, great location, great value!!”", "Author": "jarujaru", "ReviewID": "UR102623453", "Content": "My partner Don and I stayed for 5 nights at the Millennium Suites in March and had a truly incredible time. The location is amazing- literally 3 minutes from the Blue Mosque, Hagia Sofia, Hippodrome, and all the major sites. The rooms were clean and though it is quite a bustling cobblestone street full of hotels and restaurants we found it very quiet at night and easy to sleep. The service was just amazing throughout. Dealt with the owner/manager Mr Ozturk on email before our stay and he greeted us when we arrived. Throughout our stay though we dealt with the amazing day/evening staff and cannot say enough about them. Furkon & Taner are great guys who switch off running the hotel and were full of great humor, advice and we really enjoyed getting to know them. A new waiter had just started when we arrived, Cem, and he also was just a pleasure to get to know. Arzu(forgive my spelling) set up the breakfast most mornings and made us omelets or cappucinos if we desired and we just loved her as well. When we went to Cappadocia for a few days the hotel was nice enough to hold onto our excess baggage downstairs which made traveling so much easier. I took advantage of the coupon I found on tripadvisor which included one way airport pick up, and a free dinner- as the hotel is still somewhat new they began by opening an all italian menu- the food was very good and Cem treated us very well- I hear though they are looking to expand and include more Turkish fare. The breakfast each morning was very nice and filling with a lot of options. I also appreciated that the staff understood that we were not looking for what the average tourist looks for in a vacation- package tours, dinner 'shows', etc.. and were able to accommodate our specific needs. But I am forgetting to mention the great value of the price- a great deal for the money(especially considering the location, cleanliness, service and the extra airport pick up and meal included) Did a lot of looking and searching for a hotel in Istanbul and though there are certainly fancier and more plush places to choose from I cannot imagine getting a better deal for the money and a better overall experience. We loved the city and getting to know the staff at the Millennium was a highlight of our visit. We will be back again.", "Date": "April 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Heaven”", "Author": "sacoholly", "ReviewID": "UR102406184", "Content": "The Millennium Suites in Istanbul, Turkey has been a great experience for me. Upon my arrival the desk clerk Furkan was of great assistance. The rooms are so large and have exceeded my expectations. Everyone at the hotel is very helpful and hospitable, I would have never wished for anything more. The hotel is in a gorgeous street called Akbiyik and is so close to everything from the Ayhagah Sophia Church to the SultanAhmet Mosque probably a two minute walk. Eventhough the weather is a bit called but I feel so warm because of the heart warm welcome of this hotel. The hotel is always clean and I have been here for two days here so far and can truely say that this little gem in Istanbul has been one of the best hotels I have to. It feels like I am in my own neighborhood. I have stayed at many world hotels to include the Four Season, Ritz Cartlon, W, and many others but have never felt so special as I am feeling at this moment. I will keep everyone updated regarding the rest of my trip but so far I give this hotel a 5 starrrrrrrrrr.", "Date": "April 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“great choice for seeing the sites in istanbul”", "Author": "cj_minneapolis", "ReviewID": "UR102233083", "Content": "Location, location, location! The hotel is just a 2 minute walk to the Blue Mosque, Aya Sofia, Topkapi Palace, and Basilica Cistern. We also walked maybe 15 minutes to the Grand Bazaar, and on another day maybe a 15 minute walk from the port for the cruises on the Bosphorus. Some highlights: 1) staff were really friendly and helpful with everything from luggage to directions to arranging taxis and tours 2) breakfast was great - simple european breakfast, but also included omelettes and turkish coffee and some other turkish treats 3) can't say enough about the location - and on a fairly quiet street compared to other hotels we walked by at night 4) room was new, immaculate, and well appointed. really comfortable bed and linens. 5) cash discount is nice 6) free wi fi 7) free 1-way taxi pickup, which is great - we ended up booking round trip with them a few potential drawbacks depending on how you like to travel: 1) while the street is fairly quiet, we were on the main street side and found it fairly loud even though we were on the 4th floor/top floor. something you may want to inquire about when booking. 2) restaurant is not the best on the street - it's italian food, which not sure why you'd want to eat that in Turkey? 3) we didn't mind a 4 floor walkup, but others may 4) there was not 1 english channel - not even BBC or CNN, which is rare in europe other tips: 1) eat at the meat house around the corner - they have great fresh bread that comes with your meal, and the prices are really reasonable 2) do not book the bosphorus cruises outside of topkapi palace - just go down to the port. we were told we were leaving by 1, and by almost 2 they kept saying they didn't know why the shuttle was not showing up. then took us there by taxi instead of shuttle, but then left us stranded there after the cruise! we ordered 2 cans of beer for the trip, and they charged us 20 turkish lira which is way overpriced. and the boat was small and bumpy - not at all like the photos. it was all quite sketchy. if we did it again, we'd just take the big turyol boats and call it a day.", "Date": "March 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stroud, Gloucestershire", "Title": "“Fantastic; we couldn't have asked for more!”", "Author": "cm2758", "ReviewID": "UR101555386", "Content": "After looking at a number of hotels, and reading many reviews on Trip Advisor my boyfriend and I decided that we would stay at the Millenium Suites for our short trip to Istanbul, and I am so pleased that we did. I had reasonably high expectations as the reviews I had read had been pretty good, but my expectations were exceeded. The hotel is in an incredible location; literally a couple of minutes walk from the Blue Mosque, Aya Sofia, Topkapi Palace and the Basilica Cistern - you can also very easily walk to the Grand Bazaar and Spice Bazaar from the Hotel. Not only that the room we had was beautiful and the staff made the hotel feel like a home from home - I was sad to leave after our short trip! I had read a few reviews that had said that the breakfast wasn't great; I think that this must have been taken on board as there was a lovely continental style breakfast and we were also offered fresk omlettes, Turkish Tea and Coffee each morning. It was a lovely way to start the day! I am usually quite sceptical about going on organised tours as they can be very expensive - however, I would highly recommend the tours that you can arrange through the hotel, especially boat tours along the Bosphorous and Turkish Entertainment at the Orient House; based on the prices we paid for dinner and entry to sights when we were out and about on our own we thought that they were excellent value for money. All in all, I would highly recommend staying here; the location and quality of the rooms are fantastic, but it is the highly efficient and friendly staff that make this hotel unique and wonderful!", "Date": "March 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great hotel near the main sites”", "Author": "Eduardo72", "ReviewID": "UR100390428", "Content": "Nice little hotel with very friendly staff. Rooms are clean and spacious. Beds are very comfortable and we slept well but there is some noise from the street. Breakfast is simple but nice - the cook can rustle up tasty eggs and coffee on reuqest. The hotel is within very easy walking deistance of the majhor sites. Highly recommended.", "Date": "March 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kuwait City, Kuwait", "Title": "“very good hotel”", "Author": "Jawadshahin", "ReviewID": "UR99675739", "Content": "it was a good idea to choose this hotel, first the staff was amazing and helpfull, especially its Manager. The location is very good, close to so many attractions, resturants, bars and cafes serving waterpipe and turkish apple tea. But do not expect huge hotel with spacious lobby or similar, it is a cozy small hotel suites. The hotel is 10 minutes walk from the grand bazzar, tram station, bus station and other shops. the hotel being in Sultanahmet area, provides transportation to and from many touristic places, and can arrage for your tours and cruises. My advise not to go to the fish resturant on the corner at the end of the street right side of the hotel.", "Date": "March 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Excellent Hotel in very good location”", "Author": "LEuler", "ReviewID": "UR99563733", "Content": "Hotel is in Sultanahmet District and is 5 minutes walk from the Blue Mosque and Topkapi Palace. The hotel has relatively few rooms but the service of manager Alper and his team is truely exceptional. Rooms are large and our room was very clean. WiFi was free and worked well. We ordered the airport pickup available on the hotel website and it worked very well. We can highly recommend the hotel and would choose it anytime over some standard brand.", "Date": "March 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "barra de navidad", "Title": "“What a find!!!”", "Author": "Goodtip", "ReviewID": "UR99489746", "Content": "An easy walk to ALL the sights!! The staff could not be more helpful!! The area is full of wonderful restaurants...icnluding the best fish restaurant in Istanbul just down the street!!....HIGHLY Recommend!!", "Date": "March 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Switzerland", "Title": "“Excellent hotel in great location”", "Author": "Simone79", "ReviewID": "UR99442568", "Content": "Very beautiful room, spacious and clean. Very nice, welcoming staff that are pleased to give sightseeing advice, even got a surprise dessert delivered in the room. Breakfast with fresh products and very tasty omeletes. Excellent location in small street a short stroll from Blue Mosque and Hagia Sophia on the one and the Palace on the other side. Absolutely recommended.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kuwait City, Kuwait", "Title": "“this is an excellent hotel”", "Author": "monaremon", "ReviewID": "UR99343366", "Content": "we enjoyed our trip to istanbul because we chose this hotel, it made our stay more convenient, the staff was very friendly and willing to help. the hotel is located in a street full of resturants and cafes so it was very easy for us to chose a place to eat or smoke nargila in.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Brilliant location; Extremely helpful and friendly staff”", "Author": "Arun_Ba", "ReviewID": "UR99193162", "Content": "We stayed in this hotel for almost a week while in Istanbul. The location is brilliant - it is a 2 minute walk to Topkapi palace, 5 minutes to the Blue Mosque and the Hagia Sophia. The rooms are clean and big. The best thing about this hotel though was its staff and their hospitality - they really made our stay memorable. We had a complimentary bottle of wine to ourselves - not to mention the endless cups of tea and Turkish coffee. The staff is extremely friendly - ever ready for a chat and even taught us how to make the Turkish coffee!! :) With just 6 days in Istanbul, we had a tough time deciding which places we wanted to visit - the city has so many things to do. Mr. Alper, the manager and Furkan, were always ready to chip in with their suggestions - restaurants, cruises, hamam, shopping etc. We would certainly go back to this hotel on our next visit to Istanbul. It was worth every penny!", "Date": "March 6, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York City, New York", "Title": "“Wonderful Experience- Incredible Staff”", "Author": "charmich41", "ReviewID": "UR98583385", "Content": "I chose this hotel based on the high reviews on trip advisor, and I am extremely glad I did. This small hotel makes you feel like you are really welcome - nothing is too difficult for the wonderful staff to help you with. Alper and his entire crew of people were all kind, cheerful, and extremely interesting to talk to. We stayed for only 3 nights, but they made us feel right at home. Regarding the rooms, they were wonderful. We had a queen sized bed on the third floor, and there was plenty of room for all of our luggage in addition to space where we could walk around. The bathroom was great, specifically the shower- big and good pressure. The beds were comfty, there was a nice flat screen TV- basically it looks exactly as it does on the website. The only suggestion I would have would be to add a DVD player to the room - the Sattelite TV was lovely but not many channels were in English. The restaurant downstairs was very nicely decorated, and also served as the reception area - it was a little awkword talking to the hotel staff when there were diners inches away having their meals watching you, but not too big of a deal. In terms of the food, I would say it was acceptable- the individual pizzas are a nice touch, and the prices are quite reasonable. It is one of the only Italian restaurants in the area, which I am sure some tourists appreciate, however they could put a bit more effort into their salads. The food in turkey is great (especially the kebabs!), so I would suggest having most of your meals elsewhere. While the breakfast buffet had a nice selection, some more fresh fruit would be great too. One morning we had breakfast delivered to our room- which was lovely- however the food itself was ice cold. If you are staying there, I would highly suggest eating downstairs - and to the hotel, I would suggest making sure the eggs/potatos/hot pastries etc are warmer. In terms of the location of the hotel - it CANNOT be beat. If it is your first time in Istanbul it is a perfect place to stay, as it is walking distance of all the touristic sites, without being in an area that's too loud and busy. Its on a quiet side street which gets lively at night, as there are many restaurants surrounding it. All in all, I really cannot say enough good things about this place - all the things I picked out were little faults, but I know the hotel staff is capable enough to work on them to make it an even greater experience. Alper and staff- thank you so much for a wonderful stay, and we hope to see you all soon in Istanbul!", "Date": "March 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leeds", "Title": "“Excellent hotel with fantastic service and great location!!”", "Author": "Laura085", "ReviewID": "UR98412374", "Content": "We would like to thank the hotel and the staff for a fantastic stay in Istanbul. From the moment we arrived to the moment we departed we were treat like royalty. The room itself was palatial and extremely clean and we arrived to a complimentary bottle of wine and cheese which was a very nice touch. The staff could not do enough to help you and offered great advice and nothing was too much trouble. We thought the location of the hotel was also superb on a quieter road next to various restaurants and within walking distance to the Blue Mosque etc- we much preferred the Sultanhamet area to other areas in Istanbul. We would without a doubt recommend the hotel to friends and family and once again would like to thank the staff including the lovely lady who served us breakfast for looking after us so well, you have a fantastic hotel.", "Date": "February 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Shanghai, China", "Title": "“A true, authentic boutique experience! Unpretentious hospitality.”", "Author": "Shanghai_Rose", "ReviewID": "UR98307353", "Content": "The hotel is located at the very charming area of Sultanamet. It is within a 5-15mins walk to many attractions, definitely a location you want to be if historic and cultural immersion is the purpose of the trip, Location aside, the hotel itself is another \"attraction\" for me. I was pleasantly surprised to find out that there are only 7 rooms in the hotel. With only 7 rooms to manage, service is definitely a strong point. In the morning, they tend to have 2-3 service staff to attend to your needs. For a small hotel, the staff will also cook eggs to your order. Turkish tea and coffee are served (willingly and cheerfully) anytime per request. Although there is no elevator in the 4 storey hotel, the staff will deliver all the luggages up to your rooms. This which is a big relief and much appreciated. Last but not least, the staff are just incredible. They are so genuine in serving you and making sure you are well taken care of during your stay. They even kept the buffet open for me when I woke up late for breakfast! On the while, it was a wonderful experience staying with Millenium Suites, a place where I will return to again with my family next time.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“excellent service, excellent location”", "Author": "abbasix", "ReviewID": "UR97635835", "Content": "This place was one of the best places I have stayed in. All the staff, specially the general manager, Mr Alper Ozturk, made our trip to this beautiful destination much more enjoyable. You won't need to ask twice for a service. They were all willing to go the extra mile to make your stay more comfortable. The location is excellent. It's located in a beautiful street close to most of Istanbul great attractions. There are lots of great restaurants within a short walk. If you are a fan of Turkish kebab I would definitely recommend a restaurant called \"khorasani\". The Millennium Suites is definitely the first one on my list if I decide to visit Istanbul again. I would give the hotel a distinctive 10 out of 10 and would recommend it to anyone planning a visit to Istanbul.", "Date": "February 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Born, The Netherlands", "Title": "“Great room, great location and the best service!!”", "Author": "jennifer091", "ReviewID": "UR97460104", "Content": "Two friends and I went to Istanbul to explore. This was a great location, close to the tourist highlights of the old city. Everyone at the hotel did their very best to make us comfortable and to facilitate our vacation. Three points so your expectations are relative: there is a smell from the drains sometimes, they know and are working to eliminate. Breakfast is ok and there are stairs not elevators. If you are ok with these minor things then this is the best place in Istanbul. I found the Millenium Suites just perfect.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tripoli, Libya", "Title": "“so romantic”", "Author": "melfituri", "ReviewID": "UR96866220", "Content": "good hospitality, and great services, all the staff was so kind . we liked the hotel very much and we liked the smile on all the faces of the hotel staff ,", "Date": "February 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tuusula, Finland", "Title": "“The best choice in Istanbul!!!”", "Author": "leena_jorma", "ReviewID": "UR96471961", "Content": "We stayed in Istanbul and at the Millenium Suites 4 days one week ago. Both Istanbul and the hotel was more than we ever expected. The best thing at the hotel was warm ann friendly staff and the manager, mr OZTURK was more than helpful. Our room was beutiful and almoust perfect, most of all the kingsize bed was wonderful! We have travelled quite a lot all over the world and stayed at different kind of hotels but the Millenium Suites was one of the best!", "Date": "February 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kas, Turkey", "Title": "“OUSTANDING VALUE”", "Author": "CEM69", "ReviewID": "UR96389501", "Content": "Stayed at Millennium Suites for 2 days before month-long trip to Thailand, and we are staying there again at end of vacation. Location is PERFECT. Service is EXCELLENT. Staff extremely friendly. Charming small boutique hotel with good value for money. Can't say enough good things about this hotel. Our new \"home\" when in Istanbul. Jason and Birsen Cappello", "Date": "February 13, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Very stylish, luxury accommodation, very well situated”", "Author": "Marcelle312578", "ReviewID": "UR96274198", "Content": "We had amazing service. The manager and staff were very helpful and accommodating to all our needs.'The rooms are large with extra king beds, wonderful linen and pillows and a separate shower . it was very well situated, right within walking distance to all the major sites. I really liked the way the rooms were decorated.", "Date": "February 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tripoli, Libya", "Title": "“Excellent place for romantic getaway.”", "Author": "Katya1234", "ReviewID": "UR96107383", "Content": "My partner and I stayed for six nights in this amazing boutique hotel. Very nice neighbourhood with spectacular sights in the walking distance. Rooms are very spacy with nice interior and big plasma :-) Staff is extremely friendly and helpful. They treat each and every customer with care and attention. Breakfast is also very good and can be served right in your room. Apart from that there are plenty of restaurants near by. To sum up, it is a wonderful place an we definetly come back there again!", "Date": "February 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Doha", "Title": "“best view of istanbul”", "Author": "andyDoha", "ReviewID": "UR95496048", "Content": "I was in Istanbul 2 months ago for 5 days. It was unplanned trip and I am recommended by my friends to stay in Millennium Suites Hotel. Me and my family had wonderful days. In a hotel, rooms are very big and comfortable. Hotel is located center of Istanbul, near Blue Mosque. It is big advantage for transportation, very close to rail way and port. Also hotel management and the stuff are very kind, helpfull and friendly. They bring us from airport when we arrived istanbul. definitely i will stay there again my next trip.", "Date": "February 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“One of my favorite hotels!”", "Author": "Ermie0812", "ReviewID": "UR95242313", "Content": "My husband and I stayed at the Millennium Suites on a 1 month summer vacation throughout Europe. My husband is a Platinum Member at the Marriott's and a Diamond Member at the Hilton. We were not quite sure about staying in a relatively â€˜unknownâ€™ hotel. However, this hotel blew pass our expectations. What an incredible experience. Great location! Literally, just a few minutes from the Hagia Sophia and the incredible nightlife of Istanbul. Iâ€™m glad we stayed there. The owner operator is great and the staff very friendly. The rooms are nicely decorated and had a great ambiance overall. We plan to travel to Istanbul again and we will definitely stay here.", "Date": "February 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baghdad", "Title": "“The stay was a very excellent,the staff & service were also excellent”", "Author": "MrFunnylooking", "ReviewID": "UR94234713", "Content": "Our stay started with the driver meeting us at the airport & taking our luggage to the van.We were then driven to the Millennium Suites & greeted by Mr.Ozturk.He & his staff were very friendly & courteous.The rooms were very clean and spacious.They even emptied out the mini bar for us so we could put our own items from the grocery store in the mini bar.Mr.Ozturk was more than helpful with all of our request.I would highly recommend staying atThe Millennium Suites to anyone that visits Istanbul,Turkey.It was my & my lady friends first visit to Istanbul & we stayed for 5 days there in Istanbul.It was just a great experince.One you must experince for yourself. We would stay at The Millennium Suites again if when we visit Istanbul,Turkey again.Written by Ed.Reich", "Date": "January 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“Excellent hotel - amazing service, great location”", "Author": "JaneHanim", "ReviewID": "UR93260184", "Content": "I stayed here for 4 nights in January 2011 and would thoroughly recommend staying here. The hotel is in an excellent location (and is just around the corner from the Four Seasons) and the service is amazing. I booked directly with the hotel - taking advantage of their special offers (which included breakfast and pick up at the airport). Hotel: The hotel has just 7 rooms and has been renovated to a very high standard (the rooms really are as shown on the hotel's website). The front desk is to one side of the restaurant and there's always someone available to help. Breakfast is buffet style - there's a great selection and they're also happy to make you an omelette if you'd like. And lunch and dinner (or just drinks) are available during the day. The room is comfortable (as are the beds) - and the shower is excellent. Bathrobes and slippers are also provided and there's a safe in the room. And a flat screen TV with lots of channels for when you're worn out with sightseeing and just need to crash for a bit (they also provide orange cupcakes and other sweets with the tea and coffee in the room, and there's bottled water etc. in the fridge). Service: Absolutely amazing service. I've stayed in many hotels over the years and can honestly say that the service from Alper and all of his team is the best I've ever experienced. I felt like one of the family. Everyone was very helpful and nothing was too much trouble - they happily arranged a half day cruise of the Bosphorus for me so that I got to see more of the Golden Horn and the Maiden's Tower. There was always a hot drink or snack when I came in from the cold; when my iPod was running out of power they charged it up for me. In the evenings, I could sit around drinking beers, reading or just chatting with Alper (the owner, who speaks very good English) and Mehmet (the barman, who speaks very good French and some English) - and learning more about Turkey and her people. I arrived a stranger, and left feeling like one of the family. Location: The hotel is in the old part of the city (Sultanahmet) and it's a five minute walk to the Aya Sofya, Blue Mosque, Topkapi Palace and the Archaeology Museums. There are lots of restaurants in the area and numerous shops and bazaar's (and ATMs). Most of the time I used Turkish Lira though I found that euro's were accepted at a number of the sites as well (and the ATMs could give out both). There's so much to see and do that it's hard to decide - I would definitely recommend all the above, though it was the Archaeology Museums that I returned to for a second day. I wouldn't wanted to have missed the Basilica Cisterns either. Nor the Bosphorus cruise. Basically, 4 days wasn't really long enough and I ended up spending most of my time in the Sultanahmet and Bazaar areas as I didn't want to end up rushing all over the city (and it's a very big city). And this is where the location of the hotel is great - everything is so close to the hotel that it's easy to pop back and rest for a bit, or grab something that you've forgotten. Travelling Solo: Travelling on my own I wasn't sure how safe I would feel in Istanbul. The answer is very safe - having a great hotel as a base really helped, as did the advice of one of Alper's friends (Aslan). I had asked how to make the people who came up to me offering guided tours etc. go away (as \"please go away\" wasn't working great and I didn't want to be rude) and he told me to ignore anyone who approached me when I was out sightseeing (very good advice, and I noticed that the local women also took this approach and just sailed past them like they weren't there). The street where the hotel is located always had people around and, overall, I found the Turkish people that I spoke with very friendly and helpful. Books to read: In addition to the guidebooks, any of Barbara Nadel's (I read Harem ) or Clive and Dirk Cussler's Crescent Dawn. All set in Istanbul and capturing something of the city. Finally, my thanks to Alper Bey and all of his team. Thank you for making my vacation wonderful.", "Date": "January 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Excellent Choice!!!”", "Author": "oakie13", "ReviewID": "UR92868200", "Content": "The best choice if you want to stay close to the most importants places. Everything was perfect!!!", "Date": "January 14, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Barcelona", "Title": "“Five-star position, five-star service”", "Author": "Runeberg", "ReviewID": "UR92109242", "Content": "We stayed at the Millenium Suites over Christmas. Position, position, position as the estate agents say. Not more than 5 min walk to Topkapi, the Blue Mosque or Haghia Sofia. 10 min to the market. Service: Alper Ozturk and his team couldnÂ´t have been more helpful - no need to say more! Room: spacious, comfortable, clean. The bedside lamps were not really for reading (though the bulbs were immediately changed for stronger ones. We were first shown a room at the back but found it too dark. The front room are on a fairly busy street, but it didn't bother us. The noise from the slightly loose hotel sign did, but that will now have been seen to. No lift so older people should make sure to get a room on the first floor. The bathroom new. I would have liked to have an anti-slip mat in the bath as it was quite slippery. I didnÂ´t ask for it though. Alper, will you make a note of that? I was told that in the US someone fell in the bath and was seriously injured. It cost the hotel $50,000 ... Don't chose this hotel if you want a view of the Bosphorus as there is no view of it. Alper showed us plans of the renovation of the lounge/ reception area to be done in February 2011. All in all, almost 100% perfect!", "Date": "January 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zebulon, North Carolina", "Title": "“Extreme comfort, New friends”", "Author": "arrieq123", "ReviewID": "UR91624552", "Content": "I travelled with my brother and his girlfriend to Istanbul and Cairo at the end of January. We stayed 4 nights in the Millennium Suites hotel and had a wonderful time. The hotel is small and intimate. We were able to get to know the workers at the hotel who took great care of us! They provided us with lots of ideas on what to do during our days in Istanbul. I think the best part of the small setting was that the hotel employees were kind enough to hang out late at night with us in the small Italian restaurant on the bottom floor of the hotel (that, by the way, has some great pizza!). It was great to be able to hang out, drink endless tea and wine, and talk with them! The rooms in the hotel are beautiful and immaculately clean. The beds were extremely comfortable. We were actually sad to leave Istanbul when we headed to Cairo!", "Date": "January 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“A very enjoyable stay”", "Author": "rwjc", "ReviewID": "UR91087495", "Content": "Although getting to Istanbul from London during xmas 2010 was a night mare [ but not as bad as some I'm sure ] and we were delayed our driver was still at the airport despite a 4 hr wait, thats when our holiday picked up. The hotel was well positioned just at the back of the blue mosque and within walking distance to the grand bazaar, with restaurants located all around it. The staff were great, very helpful and even helped us out when my better half needed a dentist in a hurry, within 1hr, less 1 tooth and a cost of 50GBP we couldnt complain. They organised day trips and our transfers to and from the airport. We couldnt recommend this hotel enough it was great.", "Date": "December 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tokyo, Japan", "Title": "“Great Room, Great Service But Terrible Street and Too Expensive”", "Author": "TheVastMachine", "ReviewID": "UR90918228", "Content": "As other reviewers have pointed out, the rooms are large and well-appointed, the beds are comfortable and the service is great. But despite all the other gushing reviews, you need to keep in mind that this hotel is on an incredibly tacky street, there is no lobby - it's a pizza parlor, pure and simple - and the neighborhood can be very noisy until midnight. (There was a guy playing the sax nonstop from 7PM - 12AM at a restaurant two doors down every night we were there.) The windows are not double glazed, and it takes a little bit of effort to arrange all the curtains to insure the street light doesn't get in to the room. And given the rates of other hotels in the neighborhood, no way is it worth the almost EUR250 per night we paid. If you can get this hotel for around EUR110 and are not bothered by noise / light, absolutely go for it.", "Date": "December 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "london", "Title": "“Really excellent hotel with outstanding service”", "Author": "DMEtraveller", "ReviewID": "UR90831174", "Content": "I have just returned from spending 4 nights over Christmas at Millenium Suites. From the moment we arrived to the moment we left we received outstanding service from the management and staff. My mother stayed in the ground floor room and I was on the 4th floor. Rooms were spacious, clean and comfortable. My room overlooked the back of the hotel and there was no noise at all from outside. Bed was large and very comfortable. Room had free wifi and a big LCD TV, with a few English channels such as BBC world. Nothing was too much for the staff. When we returned from sightseeing the first day of our stay, we asked for some tea and baklava. They didn't have any baklava, so the manager sent one of the team to the shops to buy some - and then refused to let us pay for it. It's a small hotel, on a street with other hotels and restaurants near to the Blue Mosque. If you are looking for a good value hotel to stay for a few days in Sultanahmet you really can't beat the Millenium Suites.", "Date": "December 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Wonderful hotel. Will definitely stay there the next time I'm in Istanbul”", "Author": "Single_Black_Female", "ReviewID": "UR90751074", "Content": "I found this hotel based on reviews on Trip Advisor and I am so happy I choose this place. I traveled to Turkey by myself for a nice relaxing vacation and stayed at this hotel for a total of about 8 days while I was in Istanbul ( I traveled to a few other cities in Turkey during the middle of my two week vacation there.) If you like small boutique hotels (only has 7 rooms) at a great value then this is the place for you. Why I loved this place: 1) The staff: Everyone from the owner to the guys working the front desk and the cook were extremely friendly and kind to me while I was there. In particular, Erhan, who works at the front desk went above and beyond taking me and and two other guests at the hotel site-seeing around Istanbul or shopping on his off time. He didn't ask or request payment for his time. Over the entire stay I found him to be very helpful and fun to talk to. Even the owner was extremely friendly and once he invited me to have lunch with him and the staff one afternoon when I got back early from site-seeing. **two stay fair and balanced, I will say that like all hotels if you ask them their opinion on site-seeing options they will promote tours offered by certain companies for which I am sure they get a commission. But as all hotels I've ever been too do this, this didn't bother me. 2) The rooms: The rooms are surprisingly large, clean and attractive. It appears as if the rooms have been recently renovated. I stayed in two of the rooms while I was there. They both had King size beds that were very comfortable. The rooms have all the basic amenities and they even provide you slippers to wear in your room. The first room I stayed in was on the first floor. The room is located behind the restaurant/lobby area. You pass through two doors to enter the room as a means of soundproofing. I will warn you that if you stay in that room, you definitely have to have the outer door closed or you will hear everything that is being said in the lobby. Also, the room is a little darker than the others because the window faces a wall that I think they stated is one of the old fortress walls that used to protect that part of Istanbul. The second room I stayed in, Rm. 201, is a great room in the back part of the hotel that has a large private terrace outside the room. I didn't really get to enjoy the terrace since it was a little cold to be sitting outside but I can see that it would be very enjoyable in the summer time. Be warned though that by private terrace I mean that it can only be accessed by 201 BUT the terrace faces the back end of apartments in the area so its not like you would go out there in your underwear or anything unless you want to give your neighbors a view....That being said, I have decided that that is the room for me if I go back. **additional disclaimer, when taking a shower in the bathroom it is best to use the shower-head as a handheld device. If you mount it on the wall to use it stationery, you will get water all over the bathroom floor because the shower doesn't have a door, just a piece of glass that only extends just under half-way across the length of the shower. **also, for those traveling in large groups, you should know that the hotel owns a large 3 bed room apartment on the next street over from the hotel which currently rents for 100 Euros a night. The flat was very secure with the top and bottom lock having 3 turns each to lock and there is a safe in each bedroom (the main hotel has safes in the room as well). Each bedroom has a king size bed so it easily sleeps 6 people comfortably. I had to stay in the flat the first night of my trip because the hotel was full. The flat was obviously recently renovated and was very attractive but at the time the kitchen was missing a microwave and there were no waste paper baskets. I pointed this out to the owner and I'm sure that has since been rectified. Lastly, because it is not located on the main property, it seemed that housekeeping has to be reminded to go there to clean (which I guess is okay if the point of a flat is to have more privacy). If I was traveling in a group, the flat would have been a great option. 3) The location: The hotel is located in the Sultanhamet district which is where many of the major culture sites are located such as the Blue Mosque and Haga Sofia. It is about a 5 minute walk to the tram stop and a nice relaxing walk (about 15 minutes) to the Bosphorus river.", "Date": "December 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South Africa", "Title": "“Brilliant hotel, outstanding service!”", "Author": "Joey55", "ReviewID": "UR89740682", "Content": "We stayed at the Millenium Suites for 8 nights in November 2010 after travelling through Europe on a 24 day Trafalgar Tour. Needless to say, we were exhausted when we arrived in Istanbul, and due to the fact that we had been travelling to so many countries before Turkey, I had not called the hotel beforehand to confirm that our transfer but we had arrived at the airport and our transfer was hassle free. We arrived at the hotel and were greeted by the hotel owner Alper and other staff and we were given a complimentary welcome drink and our bags were taken to our rooms, which were extremely clean, and the furnishings looked brand new. The rooms were also very large and the much anticipated beds had definitely met my expectations. The location of the hotel is extemely central, and two minutes from the blue mosque and hagia sofia which was fantastic, and the hotel also has an in house italian restaurant which has excellent food. The service I recieved at this hotel was second to none in Europe. Both myself and my wife were amazed at the hospitality of ALL the staff. We felt as though we were at home. Nothing was too much trouble for the staff at the hotel, even the housekeeping staff always had a smile on their faces and no request made to them was too much to ask. I am generally a very fussy person and I am very critical when I go to hotels, but I cannot find a fault with this hotel, I was very impressed and they had definitely EXCEEDED my expectations, and I will, without ANY hesitation recommend this hotel to anyone going to visit istanbul.", "Date": "December 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“so clean rooms and phenomenally comfortable large bed in a large well decorated room!!!”", "Author": "Anya_Surovceva", "ReviewID": "UR89711853", "Content": "This beautifull hotel is centrally located in a nice street that is full of nice restaurants,bars ,hotels and nice people from all over the world.This street and of course our hotel were like a meeting point where people come together from all over the world and close to the Blue mosque ,Agia Sophia,Topkapi palaces and less than 10 minutes to the Grand Bazaar by foot.I advise you to use TL as you are in Ä±stanbul and should do exchange in the grand bazaar too.Do make in at the airport and any other place.They pay too less for your money. The hotel has really large absolutely quite,so clean and very well decorated rooms and batrooms. There were anything in the room that you might need during your stay ( a smart kettle,any kind of teas , jacops and ironing board, toothbrush and shaving kits, wet napkinetc.) I have to underline that the bed was a queen size and absolutely the most comfortable one I have ever seen,even more than my bed at home. The staff is so friendly and helpfull and made our trip so enjoyable and economical by recommendations and special discounts.I can not thank you enough for their warm hospitality.We got the service to the airport for return with a reasonable price . It was really cheaper than taxi we got from the airport to the hotel.Advise you to get this service especially for the trip from airport to the hotel.We paid to much to the taxi driver who never knows the town and could not find the hotel ,get around and around to find .", "Date": "December 13, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York City, New York", "Title": "“Friendly, modern, convenient, great value”", "Author": "jczepiel", "ReviewID": "UR89157989", "Content": "The staff was welcoming, the room large and the bathroom very modern and done in marble. The location was but a less than 5 minute walk to the major sites. The street scene lively with many sidewalk cafes. We've already recommended it to friends", "Date": "December 6, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Miami, Florida", "Title": "“What a wonderful surprise”", "Author": "Akka33", "ReviewID": "UR88955567", "Content": "The hotel with which we originally booked was being renovated so we were \"forwarded\" to Millennium Suites. What a gem. Recently renovated, the bedroom and bathroom were large, very comfortable and beautifully decorated. We particularly liked the up-to-date energy saving touches. The staff was excellent, charming and always ready to help. Breakfast delicious. An added bonus was being five minutes walking distance from the Blue Mosque area and 15 minutes from the Grand Bazaar. The hotel has a restaurant and if you wanted to try something else, the little cobbled street had a wide range to choose from. We loved it and would stay there again.", "Date": "December 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Istanbul", "Title": "“Home Away Home”", "Author": "Gsad", "ReviewID": "UR88365910", "Content": "Thank you Tripadvisor, for helping me finding this lovely hotel and to plan a super 8 day holiday in Istanbul. Me, my wife and two kids spent all 8 days at an apartment (3-rooms, 1 bathroom a kitchen and living room) belongs to the Millennium Suites, which is less than a minute walk from the main hotel. The large, clean and comfortable rooms for the price I paid never prompted me to look for alternate hotels. All rooms are equipped with satellite TV, heaters and safety lockers. The kitchen too was equipped with a stove, dishwasher and fridge although we never used them. The manager Alper and his staff are so friendly and caring. The hotel is in a great location. It was walking distance to the most famous attractions like Topkapi, Sophia Hagia, and the Blue Mosque. The closest tram station (Sultanahmet) is just 5 minutes away. There are an ample choice of restaurants and some lovely gift shops around the hotel. The hotel can help you with some useful advice on where to go in Istanbul and arrange some tours with great discounts. Many thanks for Alper and his staff, and definitely looking forward to visit this lovely city.", "Date": "November 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Good Value and Great Location”", "Author": "adl1486", "ReviewID": "UR88087888", "Content": "The Millennium has a great location, helpful staff and clean rooms. The past reviews of the Millennium have been so great that we were disappointed. There are only 7 rooms in this boutique hotel. There are two rooms on each of the second, third and fourth floors, There is no elevator. You enter through a simple italian restaurant and the hotel counter is to the right within the restaurant. One of the 7 rooms is off of the lobby and the restaurant. We were in this room the initial night. I would recommend when making reservatons that you ask not to be in the ground floor room. The italian restaurant is very simple and the food is good especially if you are exhausted after a day of sightseeing and walking - salads, pezzas and pastas. The staff very helpful and responsive to our needs. We plan on returning to Istanbul and will definitely stay here again.", "Date": "November 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester UK", "Title": "“Quality rooms,great location very friendly & helpful staff”", "Author": "redandwhitearmy", "ReviewID": "UR88075767", "Content": "Booked the Millenium after reading reviews on Trip Advisor and it didn't disappoint us. Quality rooms (we stayed in 301 but presume they have all been done to the same standard) and a friendly, helpful team of staff especially Erhan and the tireless Arzu. Great location for the better known sights and close to the tram if you want to explore more of the city and waterfront. Recommend you visit the mosque, palace and bazar as early in the morning as you can - obviously they do get very busy!", "Date": "November 24, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Absolutely Fantastic!”", "Author": "Sweeps1970", "ReviewID": "UR87539570", "Content": "After a long and tiring train trip to Istanbul, we arrived at Millennium Suites. We couldn't have been happier with our reception - the staff were extremely welcoming and helpful, and even let us check into our room even though it was early in the day. The room itself was amazing - huge bed, roomy bathroom and all the facilities you could want, including WiFi. It was also spotlessly clean. During our stay we found every staff member went out of their way to assist us with anything we needed. Breakfast was also great! This hotel is within walking distance of all the major sites plus has good access to transport. Overall, I couldn't reccomend this place highly enough - it was an oasis in the heart of Istanbul.", "Date": "November 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "istanbul", "Title": "“excellent hotel of sultanahmet and istanbul”", "Author": "emreunlu", "ReviewID": "UR87285867", "Content": "i m from istanbul but i live in canada...i'm always on business travel so i come to turkey everymonth...i discover millenium suites newly.... the best boutique hotel i have ever seen...foods are delicious..rooms are wonderful..great staff, heartfelt and hospitable...thanks to alper and his staff..millenium suites hotel is my new home in turkey ....", "Date": "November 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nanoose Bay, Canada", "Title": "“Perfect safe hub for Istanbul visit”", "Author": "Humblecanadian", "ReviewID": "UR87274409", "Content": "We stayed several days after a cruise. What counts for us when renting a hotel room? It must be clean,safe,central,quiet,with help in dealing with travel and other arrangements and good value for the price. On this basis Millenium suites scores a ten. The rooms are new, totally clean,bright and. Big...and ours was very quiet at night even though the hotel is located on an active smaller street with lots of good restaurants. Location in the old city of Sultanahmet is ideal for access to major tourist targets Our hosts very patiently advised us on where to go, what to avoid,etc. We,d go there again in a heartbeat.", "Date": "November 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Was expecting a more luxurious hotel. That said, location is perfect.”", "Author": "SGmember", "ReviewID": "UR86949018", "Content": "There is a reason the website only shows the rooms...that's because there is practically no lobby to this hotel. We thought our airport transfer had made a mistake with the address. Why were they dropping us off at a restaurant? The check in is at a little counter at the back of the (Italian) restaurant and we felt quite awkward standing there with all our luggage amidst the diners. Given the price we were paying and their claim to be a luxury boutique hotel, that did not give the impression of being either. I must say I felt rather let-down. Nonetheless, the room was spacious, comfortable and well-provided (though our TV had no volume and the guy who was trying to show us how it works didn't make an effort to ensure that it worked before he passed the control back to us and left the room). The shower cubicle also leaked, flooding our bathmat which was rather unpleasant. They did give us a complimentary bottle of wine to welcome us though. Breakfast was a small spread, not fantastic, just sufficient. We thought it was strange that when we went for breakfast our 2nd morning, there were 2 guys there (who turned out to work there) who didn't bother turning the lights on for us in the dining room till they had finished with their smoke outside. That said, the location of the hotel was perfect. Given that we had only 1 day to explore, the proximity to the sights was extremely convenient as we did not have to waste travel time. The street on which the hotel is on is a nice one, filled with eateries and hotels - but is extremely touristy (with prices to match). I think I would have given a better rating if (i) we had been paying a more reasonable rate for the room - I just did not feel it was worth the price, especially with the sort of breakfast offered; and (ii) the website had given a more accurate impression of the sort of hotel it was. I have no complaints about the room itself (apart from the leaky bathroom cubicle which hopefully has since been fixed) - the bed was extremely comfortable and the room spacious, but I was expecting a more luxurious hotel for the price (which was equivalent to a 5-star one we had stayed in in Spain), and based on the impression given by the hotel's website. Oh yes, if you require airport transfer, I'd recommend you arrange your own. The hotel wanted to charge me 35 Euros one way, and I only paid 20 Euros for mine.", "Date": "November 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Close to everything”", "Author": "waynekeady", "ReviewID": "UR85673727", "Content": "Big rooms, huge comfortable beds and great staff. Thanks to Alper and his staff.", "Date": "November 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Millenium suites felt like home”", "Author": "Reenanaiah", "ReviewID": "UR84553670", "Content": "This was my first visit to Istanbul and I must say I am glad I chose to stay at millenium suites. The hotel location is amazing, walking distance to all the major sights and the grand bazaar. The rooms are very good, clean and spacious. For me Alper who runs the hotel made all the difference. He was most helpful arranging cruise tickets, helped us with sight seeing, even organized a cake for my birthday ... Amazing. I loved my stay there , we came in as guests and left as friends.", "Date": "October 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "chennai", "Title": "“Service with a Smile”", "Author": "spaceman000", "ReviewID": "UR84552971", "Content": "If the greatest asset of any hotel is the management, then without a doubt Alper Ozturk is the spirit of Millenium Suites. Our interaction with him started way before we landed, and Millenium Suites not only gave us exemplary service, but even during the days the room was unavailable, the hotel (and Alper) took care to ensure our stay was equally comfortable in another hotel. That was service beyond the call of duty. The room was large and overlooked a back garden space which remained regretfully unutilised simply because the hotels magnificent location ensured our absence from the room for the most part of our vacation. Its minutes away by foot from some of the most historical sites in old Istanbul.. Sultanahmet has such amazing attractions as the Blue Mosque, Aya Sofya, Topkapi Palace and the Square, and the Grand Bazaar just around various corners from the hotel and we didnt spend a minute in any taxi except to and from the airport. In keeping with all other hotels in the vicinity, the temperature control was geared towards heating rather than air conditioning this time of year, but even that was amended to suit our preference of cold rather than hot. The bathrooms were very clean, rooms were large and comfortable... and the television was adequate. Every need was personally taken care of, and two days after we returned home, the hotel (Alper again) communicated that we had left behind an I pod and that he would post it to any address we cared to choose. How could we give this hotel anything less than five stars after that effort?", "Date": "October 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“Just like being with a family”", "Author": "Celtic21", "ReviewID": "UR84238068", "Content": "This Hotel is excellent -all the staff are very friendly and they go out of their way to make you \"feel at home\" . There is a good selection for breakfast and the beds are very comfortable and the rooms both clean and well provided. We will certainly recommend the Millenium Suites to our friends and when we next return to Istanbul we will be staying there again Well done all we had a great time.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Your expectations will be exceeded at this fine Hotel”", "Author": "Rig11", "ReviewID": "UR83767495", "Content": "I have been to Istanbul a numerous times but i must admit this is the best hotel i have stayed in. This was my second stay at this hotel and i was not disappointed. The hotel is a few minutes walk to the Blue Mosque and all the attractions. It has charm and the management and staff will go out of their way to exceed your expectations and cater to all your needs. The rooms are very nice and quiet and the hotel restaurant has very good food. The Hotel location is set amongst a vast variety of restaurant and bars. I would like to thank Mr. Alper Ozturk and his team for another excellent stay at this fine hotel.", "Date": "October 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Matthews, North Carolina, USA", "Title": "“Certainly one of the best boutique Hotels in Istanbul at any price!”", "Author": "jban99", "ReviewID": "UR82614831", "Content": "It is an excellent new boutique Hotel with a great location, set in the middle of a block full of restaurants and only steps away for Sultanahmet main attractions. All the staff members were very cordial and always ready to assist us. A 5 stars recommendation and a good reason to return to Istanbul!", "Date": "October 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Florence, Italy", "Title": "“Beyond any imaginable expectations! Just excellent!”", "Author": "MarcoOfFlorence", "ReviewID": "UR81193680", "Content": "Me and my friend spent 5 nights at the Millennium Suites, Istanbul. Besides its unbeatable location - just a few steps to Blue Mosque, Hagia Sofia, Topkapy, etc, - the hotel has a very welcomed homy feelings, thanks to its manager Alpert and all his staff, that did whatever it took to make our staying memorable. The room was great, meaning spacious, clean, well appointed, and so was the bathroom. I could write more about this hotel, but I think I got my message across. All things considered I would go back there without any hesitation!! Thank you Alpert and all of the friends at Millennium Suites!", "Date": "September 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Beirut", "Title": "“Just like home”", "Author": "BeirutNada", "ReviewID": "UR81186517", "Content": "We had a stay of very enjoyable 3 days with hosts very friendly and helpful. Clean, tidy and very convenient to see all the amazing sites of old city.", "Date": "September 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "athens", "Title": "“Just perfect!”", "Author": "mariger3", "ReviewID": "UR80724241", "Content": "One of the best located hotels in town, two minutes walk from all major landmarks and monuments. The rooms are large and very clean, nicely decorated. the service was amongst the best we've ever seen in a hotel (very kind, very friendly, very helpfull and all this without being fake). Small and cosy hotel, that we recommend without hesitation. Only draw back that the matress was abit too soft for our taste. Theodore & Maria, Greece", "Date": "September 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Amazing hotel in incredible location”", "Author": "MelissaMfromNYC", "ReviewID": "UR80085713", "Content": "I cannot recommend this hotel strongly enough. The rooms are extremely clean and spacious, with a \"Turkish\" decor, which I loved. The bathrooms appear new and are also extremely clean. My room had a door to a balcony which had a small table outside, which was a wonderful addition. The location of the hotel is literally perfect. You are a short walking distance from every major attraction. The hotel staff is extremely helpful is directing you to anywhere you might want to go, and happy to suggest sights that might be of interest. The hotel itself is on a lively street with lots of cute restaurants and shops. There is a pretty restaurant in the bottom of the hotel where you can eat (including the free breakfast). I had no issues with noise at all in my room and the beds were very comfortable. The manager said that while a guest stays in his hotel, it their your home - and they mean it! I had trouble with some last minute travel arrangements I needed to make, and I cannot tell you the lengths the owner went to to assist me. He was incredibly gracious, patient and kind. In addition, the staff was beyond friendly and helpful. I left feeling as though I had truly made new friends. The pricing on this hotel is incredible for what you get - location, size and cleanliness of rooms, impeccable service. I would stay here again without hesitation and wish I had stronger words to recommend it!!", "Date": "September 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Constanta, Romania", "Title": "“The best hotel”", "Author": "Simona-sis", "ReviewID": "UR79946923", "Content": "Millennium Suites is a great oriental hotel. Intimacy and luxury are the best words to describe it. The bathroom is enormous, the bed and the entire room is magnificent. I will surely stay there again.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai", "Title": "“Best Place to Stay in Istanbul”", "Author": "Hamid_tariq", "ReviewID": "UR79670075", "Content": "We had and excellent and memorable stay at the Millimium Suites. Amongst the things we liked most were the Rooms (large and comfortable), staff (which was extremely helpful and effecient) and the location (2 minutes walk from Topkapi, Blue Mosque, Aya Sophia etc. The hotel Manager Mr. Alper is very kind and helpful. He arranged most of our tours as well as offered us best promotions and useful tips for shopping. I will never forget his timely support in returning our baby stroller to the airport which we were about to loose. Highly reccommended for visitors", "Date": "September 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sentosa Island, Singapore", "Title": "“Great and new find, yet hardly discovered by many”", "Author": "vid76", "ReviewID": "UR79293278", "Content": "When we booked Millenium, there were hardly any reviews so we took our chances. And what a great find! Firstly, the location is excellent if you wish to be near all the sites in the Old City Sultanahmet - such as Topkapi Palace, the Blue Mosque, hamams etc. Everything is within walking distance. Secondly, the hotel is situated in a quaint street that is lined with restaurants so you are spoiled for choice. The street has a nice, intimate feel to it and comes alive at night. Thirdly, the room itself is spacious (rare in Istanbul) with a big comfortable bed and large TV with English channels. I thought it was fantastic value for money. The bathroom is big too - the only tiny glitch is that the shower has no curtain, so the bathroom floor gets wet all the time. This can easily be rectified, however. The breakfast, while simple, is filling and similar to what you would get in most hotels in Turkey. Finally, the staff are excellent - gentle-mannered and helpful. They always made us feel at home and attended to any request we had. It was with regret that we left. We would definitely recommend Millenium Suites to anyone travelling to Istanbul.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“This place is a gem!”", "Author": "JennieUK10", "ReviewID": "UR78300036", "Content": "This little hotel was such a great find. It's situated in the heart of the Sultanahmet's restaurant area, the rooms could easily be mistaken for 5 star and the staff were incredibly helpful, friendly and professional. It would be my first choice on any return trip to Istanbul.", "Date": "September 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Den Helder", "Title": "“Excellent Hotel!”", "Author": "Mario1143", "ReviewID": "UR77877394", "Content": "Everything in the hotel was just brilliant. A very good service, the bedrooms were very clean. I have bronchitis and mostly I get sick when I stay in a hotel that's not cleaned well, however I haven't become sick in this hotel at all! Conclusion: The hotel is clean, has excellent staff that treats you like a king, and mostly I've had the holiday of my life!", "Date": "September 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Fantastic hotel, location and service”", "Author": "rejclarke", "ReviewID": "UR77764125", "Content": "When I booked this hotel there were no reviews as they had just opened, however the photos looked great as did the location. The reception staff were fantastic and the room was perfect. Really large, well decorated, great view from large french windows that open out onto the street below. You cannot hear noise from below at all despite there being restaurants below. The beds were really comfortable and great shower. Nothing was too difficult for the staff who were able to help with every request. The location was ideal, a short walk to the Blue Mosque and other sights and a huge variety of restaurants and cafes, alalthough the food looked amazing at the restaurant onsite, we didn't have a chance to eat there. Would definitely recommend!", "Date": "September 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "constanta", "Title": "“very nice”", "Author": "danielvranceanu", "ReviewID": "UR77445171", "Content": "- good quality and big rooms; - modern and comfortable", "Date": "August 30, 2010"}], "HotelInfo": {"Name": "Millennium Suites", "HotelURL": "/ShowUserReviews-g293974-d1822211-Reviews-Millennium_Suites-Istanbul.html", "Price": "$164 - $918*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Akbiyik Street No:42</span> | <span class=\"extended-address\">Sultanahmet-The Old City</span>, <span class=\"locality\"><span property=\"v:locality\">Istanbul</span> <span property=\"v:postal-code\">34122</span></span>, <span class=\"country-name\" property=\"v:country-name\">Turkey</span> </span></span></address>", "HotelID": "1822211", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/49/64/ce/millennium-suites.jpg"}}