{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Milton Keynes", "Title": "“Huge room!”", "Author": "BoldlyGO", "ReviewID": "UR128204549", "Content": "I arrived after a long flight from London to a very friendly reception. I asked about upgrading to a waterview but decided it was too expensive. The reception clerk said I was booked for a king which was quite small, and would I like a queen double which was bigger. It really was a large room, two beds and a sofa. It also had two windows and a small balcony at the back from which you could see the water do I was delighted. The service was excellent in the restaurant and bar, and I used the free wi if in the lobby area. I only had breakfast once as a treat, but it is costly so I can recommend Moonpennies ( turn left out the hotel cross at lights and you will see it at next junction ) I didn't like the music in the lifts but that is a personal preference. the pool was very good too. It is very easy for the convention centre and the shops so I would say it's worth it. If you are a Marriott rewards person you currently get half price on entrees. I thought that the level of housekeeping on floor 6 was exceptional .", "Date": "April 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Coquitlam, Canada", "Title": "“If you are looking for something extra special this isn't it.”", "Author": "Christie F", "ReviewID": "UR127487650", "Content": "Spent the night last night at the Renaissance Harbourview. The hotel was clean and modern, but we found it to possess few qualities which would elevate it to a 4 star status. Positives Very nice sheets, bed and pillows. Beautiful Avaida products in bathroom. Clean. Location. Negatives Slow check-in. Font desk service was not very helpful or friendly. Room small. Bathtub small. Overall a decent hotel, but with so many wonderful hotels in the city e would not go back.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Perfect Location!”", "Author": "MrEdnWilbur", "ReviewID": "UR127385265", "Content": "You couldn't ask for a better location in Vancouver. I was upgraded to a harbour view room and it was awesome. Right in front me was the float plane dock and I saw planes taking off and landing on the water. It's an experience that I will never forget. I didn't eat in the restaurant because there were so many other options within walking distance. But I did have a drink at the bar where I met a very friendly bartender who helped gave me tips on how and where to navigate around the city. So a big TY to all hotel staff!", "Date": "April 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Lovely hotel in a beautiful and convenient location”", "Author": "TexasOutdoorChick", "ReviewID": "UR127313042", "Content": "This hotel exceeded my expectations. I was expecting a non-distinctive, upscale chain hotel property but instead was delighted by how contemporary and attractive the decor is. While not as hip and edgy as W Hotels, the Renaissance Vancouver looks and feels up-to-the-moment. The location at the edge of the harbor provides a beautiful view from the lobby bar and restaurant. And even from my corner city view room, which lacked windows but had a “Juliette” patio accessed by a glass door, I could see the water and mountains. The bathroom was well appointed with granite around the sink and Aveda toiletries; however, it was a small space with barely any counter area for putting your stuff. An especially nice touch is the very relaxing, ethereal music -- like something you might hear during a massage -- that’s always playing in the background in the lobby area and adjacent spaces. Location, too, is an asset. The hotel is two blocks from the convention center (which was relevant for me since I was in Vancouver for a conference there) and an easy walk to other tourist destinations such as the Vancouver Art Gallery and Robson Street. I would definitely stay here again, especially if I could find a great rate on the Internet.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lehi, Utah", "Title": "“Comfortable 1st week in Vancouver”", "Author": "Matt M", "ReviewID": "UR126934807", "Content": "My first room was so hot, I had the maintenance man come in and \"fix it\". Was broke within 10 minutes of him leaving. They finally switched rooms, at this point I was getting frustrated, but the front desk staff were very sympathetic and helpful in making sure that my stay was enjoyable. The room they placed me in was very comfortable, bed was outstanding! More spacious than most guest rooms at hotels! Concierge Level services were fantastic! And can I praise Marriott for spending a little bit more to get HD level television service rather than having HD TVs with standard service!! So many other hotels get the HD TVs and then use Shaw standard service which looks worse on an HD TV!! Thank you Marriott for a great first week!", "Date": "March 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Calgary, Canada", "Title": "“Convenient location...”", "Author": "Ecneret", "ReviewID": "UR126878609", "Content": "which is within walking distance [3 blocks away] from the Waterfront Station. This is part of the Marriott Hotel chain and love sleeping on their bed which is very important for me - I was able to sleep soundly, undisturbed and not waking up to a sore back! Nothing too spectacular about a hotel room - my friend picked this for it's location and the brand name. My friend had also requested for a room away from the elevator shaft and ice-maker. But to our disappointment our first room was next to the ice-machine, second room was next to the elevator shaft before finally getting a quieter room! Another complaint we had was a noisy fan-heater which we had to shut off when we were sleeping. There are lots of other hotels nearby and around the Waterfront Station and will look into another one before choosing to come back here.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“I love this hotel :)”", "Author": "audilim", "ReviewID": "UR126767659", "Content": "I've been here several times, and it never disappoints. From check-in to check-out, I'm always happy with the experience. They've got a friendly staff, amazing rooms and great location.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "GA", "Title": "“definitely NOT my favorite”", "Author": "GaCare", "ReviewID": "UR126235840", "Content": "I must start out by saying that the staff at this hotel is awesome! The hotel itself is VERY tired and the guest rooms and hallways need desperately to be updated. The very obviously updated lobby and bar area is beautiful. There were long black hairs stuck to the ceiling in the bathroom that remained my entire 6 night stay - and what appeared to be a pubic hair on the side of the bath tub when we checked in (which I removed myself.....ewww) The food in the lounge is pretty good and again, the service outstanding. would not go back to this hotel.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bellingham, Washington", "Title": "“Great location”", "Author": "PNW2011", "ReviewID": "UR125851394", "Content": "This hotel is in a convenient location to Stanley Park, the waterfront and downtown. The room was clean and the staff was friendly and helpful. We got a good room price using our AAA membership. The buffet breakfast was great. I have no complaints about this hotel and would stay there again.", "Date": "March 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Fairly central and a nice place”", "Author": "reece501", "ReviewID": "UR125723819", "Content": "The hotel is overall nice....however if you have a higher vehicle or are renting an SUV chances are it wont fit under the low undercover parking and the closest alternative parking is expensive...the rooms are deffinately not sound proof as you can hear the conversation of people in the hallways rooms next to you etc other than this it's a decent place to stay", "Date": "March 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria,Canada", "Title": "“Great location and very nice hotel.”", "Author": "littleella", "ReviewID": "UR125672435", "Content": "I booked this on Priceline after a last minute decision to attend a conference at the Convention Centre. It turned out to be very close...a five minute walk away. Because I wanted to use the weight room (a very nice facility with pool) after a meeting, I got late check out without argument. The room was what one would expect with a 4* rating in Vancouver.. The Internet was expensive and not exactly reliable. It should be free in 2012.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, ON", "Title": "“Fine hotel, insane Internet prices”", "Author": "wjw0111", "ReviewID": "UR125420896", "Content": "The hotel itself is fine, nothing special, but nothing wrong either. I would not recommend staying here for business though - unless your company is OK with reimbursing Internet at $15.95 per day! Yikes... Amazing that they charge this for Internet in 2012!", "Date": "February 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ohio City, Ohio", "Title": "“BEAUTIFUL WATER VIEW”", "Author": "Rebecca_Mike", "ReviewID": "UR125033584", "Content": "I was in Vancouver for business. After an hour wait detained in customs by an inappropriate canadian officer, my room faced the water and truly calmed me down. Great customer service. The only complaint, the elevators are slow. You can walk anywhere, so close to Stanley park and the shops!!!!", "Date": "February 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Spokane, Washington", "Title": "“Great location but I expected more from a four star hotel.”", "Author": "ben a", "ReviewID": "UR124920585", "Content": "We (4 adults) stayed here in February 2012. Got a room for less than $100 bucks on priceline which had this listed as a four star hotel. That being the case, I was a bit disappointed. My conclusion is that the location must be worth three points alone. Our room was oblong shaped and facing south (downtown). Overall I thought the beds were comfortable and the room was clean. My only complaint here was that the room was too small for four people. The room was only about 10 feet wide. That being the case it was difficult for more than a couple people to see the TV at the same time unless you were all in the same bed. The hotel does provide parking at a rate of $23/night, however the parking garage has a max height of only 6 feet. This would've been nice to know in advance as we had skis on our roof which had to be removed. I did not eat at the restaurant or use the exercise facility/pool, though these did look nice. The location is great, just two blocks from the convention center and the bay. The service was great and the people were friendly. The common areas were well designed and very clean. Overall a good hotel but more like three stars than four. I would likely not stay here again unless I needed to be close to downtown and got a great deal on a room. If you have to pay full price I would say this hotel is a poor value.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“They care and they WOW!”", "Author": "mummybearof3", "ReviewID": "UR124698502", "Content": "My husband and I were very fortunate to WIN a one night stay at this hotel. We weren't sure what to expect, maybe a room on the lower floor with no view, or a room on a higher floor with a beautiful view. We didn't know what the customer service aspect would be like either. We are so happy to say that we experienced 'WOW'! We pulled up to the hotel and weren't sure where to park, valet was polite and offered to park our vehicle, or we could park our vehicle ourselves in the underground parkade. We were given very clear directions on how to get into the parkade and up to the lobby reception. Once at reception, we were greeted by Somayeh and Sam. They were both very professional and at the same time, very fun and entertaining. We were told our room was on the highest floor, facing the harbour; we couldn't wait to go and check it out. What a treat to be on the 18th floor and have such a magnificent view of Vancouver harbour. The room was spacious and impeccably clean, super comfy and quiet, even with the patio doors open (so nice to be able to open the windows or a patio door for some fresh air and see the harbour and mountains). We went back out and walked around the city, had dinner close by, then relaxed in our room. The lighting and decor in the room is well done. The room had robes that were oh so very soft. I love a hotel that has soft robes, towels and linens. I think it says a lot about the hotel and that it genuinely cares about your comfort. We ran into housekeeping a few times and they were very friendly and had lovely smiles, so nice to see. The next morning, we had breakfast in the restaurant, P2B, unfortunately this was not good and is our only complaint. The buffet food was cold and dry. However, there was a lot of variety. We didn't find the staff in the restaurant as pleasant or fun as the rest of the hotel. Other than the restaurant, which really is very minor since there are so many other places to dine nearby, this hotel really was BLISS, and we do hope to return again one day soon. And a very special thank you to Wendy Mah, you have a wonderful team who coordinated a magical and memorable stay for us :) THANK YOU!!!", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bothell, Washington", "Title": "“Best service in Vancouver BC”", "Author": "ShoeSister", "ReviewID": "UR124374867", "Content": "Great View in front of the Pinnacle Marriott!! Walking distance to Stanley Park... Vancouver has a wonderful \"Sea Wall\" walking path... Beautiful city and Great hotel for the downtown core.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Banff, Canada", "Title": "“Great views, comfortable rooms, and friendly staff.”", "Author": "Gazpacho16", "ReviewID": "UR124041762", "Content": "I stayed here in December 2007. I had a room with 2 queen beds and a great view of the harbourfront. I could watch the sea planes take-off and land... This was definitely a highlight, and I found it very amusing! The beds and bedding were very comfortable and I truly enjoyed the burger I ordered from room service. The staff is competent and very knowledgeable about the town. The desk agent spoke to me in Portuguese, and was able to provide me with very good input on activities and things to see during my visit. The hotel is clean and comfortable, and I will definitely return some day.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Nelson Bay, Australia", "Title": "“Excellent Harbourside Hotel”", "Author": "GRAHAM P", "ReviewID": "UR123771490", "Content": "Good location Large comfortable rooms Ecellent food Ecellent service", "Date": "January 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location, fantastic views”", "Author": "risto85", "ReviewID": "UR123416464", "Content": "Had a room on the 12th floor which was really spacious and modern. The room had a balcony overlooking the bay with the mountains in the background. The view is superb. The location of the hotel is great, service and staff are great.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Good location. B2P bistro great view, good service and decent food.”", "Author": "Berkeley604", "ReviewID": "UR123318591", "Content": "I stayed here on points. Do not get confused with the marriott across the street! The rooms were nice and spacious. The view is gorgeous. If you happen to get a room without a view, check out their restaurant at breakfast. The restaurant is very nice with floor to ceiling glass that brings in lots of naturally light. It is the perfect place to have breakfast before starting a busy day or if you happen to be in this part of downtown on a Sunday morning when most other places are closed.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Minneapolis, MN", "Title": "“Nice but pricy”", "Author": "laut0022", "ReviewID": "UR122491436", "Content": "I stayed here while attending a convention at the Vancouver Convention Centre. Overall, my stay was fine, but considering the cost of the room, I have had better value elsewhere in Vancouver. Pros: -Nice view of the harbor -Clean rooms and lobby -Comfortable bed -Nice workout facility -Aveda toiletries -2-3 block walk to the convention centre -In-room coffee maker Cons: -Cost of in-room wifi (internet access was free in the lobby and I was actually able to carry the signal back to my room (I was never charged a fee :)) -Small rooms", "Date": "January 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "York", "Title": "“Very good (second) stay at the Harbourside”", "Author": "pandoras_chocolates", "ReviewID": "UR122332276", "Content": "This was our second stay at the Harbourside; I'd been previously for a conference, when they were undergoing renovations in the lobby. We were staying this time for three nights to visit friends. We came direct from the airport, after flying up from San Francisco, and enjoyed (finally) taking the Skytrain right downtown. It was a short walk from the Waterfront station to the hotel. We had a room on a high floor, with a city view. The room was at the end of a hallway, and had a very interesting shape, with a large window. This meant the room was very bright in the mornings (when it wasn't raining ;-). We had a comfortable king-sized bed. Bathroom was clean and tidy as well. The room itself was extremely comfortable. The $15/day internet fee was pretty rich, but we weren't in the room much, and passed. We also didn't bother with breakfast; there are loads of places near harbourfront in Vancouver. All the staff we dealt with were friendly and professionally, particularly the concierge, who gave us good advice on where to go jogging. The only mild downside we encountered was with the room window: it sounded like it wasn't properly sealed - quite a bit of road noise came through, even though that part of West Hastings isn't terribly busy, and we were on a high floor. It didn't bother us much, though. As I said earlier, this was our second visit, and we would definitely consider staying again.", "Date": "December 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“amazing service”", "Author": "claudia v", "ReviewID": "UR122281899", "Content": "This is our second stay at this hotel. We had an amazing thing happen to us here... Alex, the concierge was utterly friendly, with a prodigious memory (she remembered our group from 2 years back... imagine! people everyday at all times, and she placed us immediately). While visiting the acquarium, my 5 yr old lost her camera, and was very upset. The next day, we went to Victoria for the day (she booked an amazing tour by ferry and hydroplane) and we left a note asking her if she could call the acquarium to inquire about lost and found. Upon our return, we found out that not only had she asked, she sent a cab to pick up the lost camera, put it in an envelope and had it sent up to our room with her name on it (Little Ms. Duarte) and a smiley face... we were at a loss of words at her amazing courtesy and out of the way service. Needless to say our daughter was thrilled at having found her 1st camera (which Santa had just brought)... We will remember this trip with the wonderful way her camera was found, not as the trip where she lost her camera! Many thanks Alex, you made us very happy!!", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seattle, WA", "Title": "“Nice hotel, good location”", "Author": "doggone31", "ReviewID": "UR122233378", "Content": "Room was clean & quiet. Mattress was firm but comfortable/ A/C was easy to use. Room had a small fridge, which was nice. Pool, whirlpool were clean; the well-equipped fitness centre was unusually airy and spacious. Free internet in the lobby. Staff were very pleasant. City view rooms, while pleasant, just look onto the Marriott across the street, so don't expect a sweeping city view. Next door to an Urban Fare supermarket and within easy walking distance of restaurants, shops, transit, Stanley Park, etc.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Squamish,BC", "Title": "“Really happy with the property and the price.”", "Author": "wannabestaff", "ReviewID": "UR121612201", "Content": "We were at the hotel for 3 days and thought the property and the service were exceptional for the price. The hotel we usually stay at wasn't available and we found this comparable at a better price so it's thr Renaissance from now on !!", "Date": "December 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Duarte, California", "Title": "“Not Bad”", "Author": "Pizzle01", "ReviewID": "UR121464834", "Content": "We went to Vancouver for a mini vacation. We stayed here at the Renaissance, and I'm not going to lie, my first impression was that the hotel looked very nice when you walk in. We went up the stairs to the concierge to check in and gave him my name. He couldn't find it, and the first thing he said to us was, \"Are you sure you are staying here at this hotel...are you sure it isn't the Marriott across the street?\" I was so offended because he was being so condescending! I know Renaissance is part of Marriott, but I also know the difference between the hotels and I am definitely aware of where I booked my stay!!! He finally found our reservation. After we settled in and we headed down to go to dinner, we stopped and asked the same guy if he had any recommendations on where to eat since we were only staying for a couple of nights and wanted to have the best experience we could. (we had to ask him cause there was no one else working there at that time). He didn't even look up from his computer, and said, \"there's a lot of places, just go to Robson street.\" My boyfriend and I both looked at each other and said to him, we will go there, but is there a specific place you can maybe recommend, and he said just go there and I'm sure you will find something. Worst customer service ever! We then proceeded down the stairs to try to find something to eat, and we figured we would try asking the doorman, Hector. I cannot tell you how great and helpful he was! He gave us 5 different recommendations and was super nice about it. He explained how to get to the restaurants and let us know that if we needed anything else he would be happy to help. Now that's what I call customer service! Cesar, who is another person that was working at the concierge was also super nice and helpful. He always had a smile on his face and helped. Honestly, the hotel was in an okay location of downtown. It's a 5 block walk to the main street, but the view of the Harbour is very nice. The rooms are decent, but the customer service really killed it for me. I wouldn't stay here again nor would I recommend it to my friends. Our initial meeting with the guy at the concierge desk really ruined my experience at this hotel. Renaissance hotel is known around the world and I've stayed at this hotel many times in other locations and I've never had this type of experience before.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "BC", "Title": "“Great From Check in to Check out”", "Author": "Dflyboy", "ReviewID": "UR121435976", "Content": "We stayed here for a couple of nights on a weekend trip from Vancouver Island. The whole experience was great from the upgraded harbor view room to the staff. This is the first hotel I have been in that caters to the techno geeks. They had loads of plugs built into the desk for all your techy toys. The room was was large and very clean with all the modern amenities. Would highly recommend.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Port Coquitlam BC Canada", "Title": "“Pretty good value”", "Author": "wanderlust1971", "ReviewID": "UR121171441", "Content": "I was staying here for business. I thought the hotel was very nice. Bed was very comfortable. Gorgeous view of the harbour (what you can see past the towers in front of you anyway) Residential neighbourhood mostly, so quite quiet. Easy to walk to most shopping on Robson and Granville Streets and the liquor store is only a 1/2 block away. Nice to have a glass of wine in my room after work. The heliport is a very short walk. I thought the front door staff on the most part were friendly although a few turned away when I made eye contact to say 'hello'. They have an amazing gym. Really top notch. Gorgeous indoor pool and hot tub too. Only complaint is that there was no signage for the underground parking. Had to go around the block 3 times before I finally found it.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "West Hartford, Connecticut", "Title": "“Get a harbor view room”", "Author": "jb645", "ReviewID": "UR121089927", "Content": "We walked to this hotel after our ride from the sky train from the airport. It was about a less than 10 min walk from the station. The check in desk clerk was friendly and received an upgrade to the harbor view room as my hubby is a Marriott rewards member. It is worth getting the harbor view room. We had a view of the mountains and we can see the little gas station floating on the water. The room was modern, spacious, clean, and comfortable. The concierge lounge was open late Sunday afternoon and we able to take advantage of it. The lounge served delicious hors d'oeuvres, soup, salad, and a variety of cheese and veggies. We went to see the pool and gym. The pool wasn’t anything big but it is a nice amenity to have and the gym was spacious with lots of equipment. There is a restaurant and bar on site but we didn’t try it. There was a long line in the morning but go elsewhere for breakfast. Just two blocks away, there are lots of places advertising full breakfast at cheaper prices and we took advantage of that. There are two computers in the lobby area and the valet guys were helpful in directions and taking care of the luggage. Overall, it was wonderful stay here.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cuiaba, MT", "Title": "“The hotel is very nice located”", "Author": "GLORIAGRAZZIOTIN", "ReviewID": "UR121061132", "Content": "Renaissance Vancouver Harbourside Hotel The hotel is very nice located, near you will find nice restaurants , delis and one Sven eleven. Our room was fine, and great bed 6 lovely pillows. It was quite and cleans room and has a beautiful view of the harbor (though obstructed by an apartment tower). Bathroom is a small but very clean having Aveda products , the shower was hot and amazing. Globe and Mail was provided in the morning. Breakfast buffet was superb - TONS of fresh fruit and anything else you could want. Quite expensive 26 dollars each. Wi-Fi is crazy expensive at $16 per night... not sure why they charge when the Starbucks around the corner is free. The bathroom is a little small for this type of hotel.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Vancouver, Washington", "Title": "“Good value for what I paid”", "Author": "BanSlug", "ReviewID": "UR120995882", "Content": "I was able to snag our room using Name Your Price on Priceline at a very good price. The hotel is well run and the front desk personnel very friendly and helpful. The room was very nice although, as others have commented, the climate control is odd - an old-fashioned disc style thermostat that we were never sure was actually working. The room was at time somewhat cool (not good in November) when we thought the heat should be on. But we were greeted by a paper in the morning, decent in-room coffee and WiFi in the lobby (with computers in the lobby too, a nice touch). The location is nice for a walk in the newer Coal Harbour area. The walk up to Robson Street is about 5-6 long blocks, which was okay so long as it wasn't raining too hard. Again, complimentary umbrellas at the hotel to use. We also enjoyed the pleasant, if a bit small, hot tub in the pool area. Overall, a nice stay and we'd stay there again.", "Date": "November 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "X-Pat in BC", "Title": "“Very Good not great”", "Author": "Jonnoh64", "ReviewID": "UR120319637", "Content": "I often stay here for business as I'm a Marriott Platinum guest and need to keep points up. This hotel is clean a d very well situated in the downtown core. If traveling on a romantic weekend - as another reviewer was - you could do better by staying at an independent niche hotel or go all out for the Four Seasons or try the newly renovated Hotel Georgia which has excellent art deco finishing. The Renaissance has good! Well equipped rooms with desks! Internet and flatscreen TVs. Breakfast buffet is very good with lots of choices.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Sancuary after travel”", "Author": "Trish B", "ReviewID": "UR119885727", "Content": "We booked our room on points at the very last minute after having travel issues with returning to Calgary from a long trip to Nepal. This place was exactly what we needed - great bed with great linens and 6 lovely pillows. It was quite and clean and we woke up to a beautiful view of the harbour in the morning. Globe and Mail was provided in the morning. Aveda products are provided as well. Nice tea and coffee are also provided. Shower was hot and amazing. Desk and coach provided. They also let us have a late check out - 2 pm. Wifi is crazy expensive at $16 per night... not sure why they charge when the Starbucks around the corner is free. The bathroom is a little small for this type of hotel.", "Date": "October 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "3", "Service": "3", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Large meeting rooms for events”", "Author": "cfilmcat", "ReviewID": "UR119847121", "Content": "We held several large events here. Nice area in front of the rooms for tea and coffee. Good lunch table service. Their projection system and screen was outdated, dark and soft focus.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Seattle, Washington", "Title": "“beautiful lounge”", "Author": "alyandoli", "ReviewID": "UR119369268", "Content": "Our room was a nice, though the decor was a bit dated. (My favorite feature was a column of shimmery blue tile in the shower. Least favorite - the striped carpet!) No robes or slippers, unfortunately. Breakfast buffet was superb - TONS of fresh fruit and anything else you could want. Quite expensive, especially since parking was almost $30 for one night. Fortunately we could walk everywhere, which was nice. The \"Harbourside\" is not quite on the water, though it probably wasn't too long ago that it had an unobstructed view...", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "SkylarCanada", "Title": "“Very Nice Hotel in Excellent Location”", "Author": "SkylarC", "ReviewID": "UR119315237", "Content": "Got a great deal on Priceline. Location was perfect. Nice wide open lounge with huge windows to see the view and have a few late drinks. The breakfast buffet had everything you could want.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Montreal, Canada", "Title": "“Nice to visit, poor for business”", "Author": "bobsyrunkle", "ReviewID": "UR119163630", "Content": "Spent 2 nights in a harbour view room. Room was fine (though had to call for a shower curtain), nice view (though obstructed by an apartment tower), and good, but not great location. The aspect that sank the hotel for me was the poor internet connection, both wired and wireless. Have seen the same issue at the Vancouver Airport Marriott: intermittent, very slow connection. It took me hours to synch my email. On that basis alone, I would not recommend this hotel to business travelers.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Kamloops, Canada", "Title": "“Mobile AC unit in a very expensive room”", "Author": "camihayes", "ReviewID": "UR119012749", "Content": "VERY expensive. Perhaps the harbour view rooms are better, but our 4th floor \"city\" view didn't have a view at all. Worst of all, rather than a centralized or even a wall-mounted AC system, we had a portable unit with a giant hose. Limiting access to our small deck, a piece of plexi-glass with a hole in it (for the AC hose) precariously sat between the 2 glass doors. We requested a room change but due to the convention no luck. If it weren't for the hotel cost being covered by the employer, we would have demanded our money back and stayed elsewhere. I've seen better at a Super 8, and Super 8's aren't nearly as expensive. Additional disappointments: Terrible shower and room service food Something positive: The room service staff was extremely professional and courteous. Excellent fitness center.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Washington", "Title": "“Would not stay again”", "Author": "SherryLinn777", "ReviewID": "UR119011563", "Content": "This hotel was not good at all. The staff was nice and thats about all I can say. The room was tiny and dark (room 942). The bathroom was a broom closet only one person could fit at a time and if you sat on the toilet you were facing the person on the bed(weird). The bathroom door was a cheap pocket door. The hallways were small and I could touch the ceiling (im 5'6\"). We heard loud people in hallway all night. I thought bed was ok but my husband woke up with a sore back. There was a small coffee pot. Honestly we should have said something but we were tired and only staying one night. Never again! The hotel was near empty, thought they would at least give us a decent room so we might come back and pay full price (we bought on priceline as a 4 star). Also they nickel and dime you the parking was $31 and if you wanted to use the wifi it was $16 for one day. I would say this hotel is a 3 star if that. I have stayed at many hotels and this is my first review.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "3.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "cork", "Title": "“holiday”", "Author": "ger o", "ReviewID": "UR118962008", "Content": "the hotel lobby and bar were very nice but the bedrooms on the city side could do with tripleglazing as the noise was unbleivable we might as well have been sleeping on the street! If your looking for peace and quite this is not the hotel to go to,espically when your put into a room next to generaters. linen on the beds should be changed more frequently because there was a stench of them,they could do with whitning powder!", "Date": "October 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Too expensive for rooms like that!”", "Author": "Mhcd78", "ReviewID": "UR118154407", "Content": "When I went for a business trip in Vancouver last July 2011, we opted to stay there since we wanted to make sure it's a decent hotel we were going to stay in. The room i got was designed well but surprisingly, I had no mini bar, though I had an ice bucket (??). Size of the room was enough and I liked the sofa, but my room was overlooking the road and not the harbor. I checked out the room of my colleague and she had a waaay bigger room, with a view, a veranda and a bigger bathroom. When we checked our room bill, we were charged the same rate!! And not just that, I stayed there for 3 days and 3 nights and each room had a total bill of CA$700+! A very expensive for a rather average room. I found out through another colleague that there are other hotels near the shopping street where it's half the price with bigger rooms. So, if I were to go on a business trip again, I'd probably consider this hotel again, but if I were on vacation or just want value for money, I'd check out other hotels.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Rochester, MN", "Title": "“Our room (#433) had a great view!”", "Author": "npm47", "ReviewID": "UR118020366", "Content": "We stayed at the Renaissance Harbourside for two nights until our weekly rental became available. The room we were assigned had a balcony with a tremendous view of the seaplanes and mountains. I imagine if we were a couple rooms to the left or right, our view would have been partially or totally obstructed by high rises. The interior was contemporary with extremely comfortable mattresses. The staff was able to fit a rollaway in the room since teenage siblings aren't keen on sharing a bed. The fitness center was impressive - quite an assortment of equipment and quite large.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Beautiful location with excellent service”", "Author": "makua", "ReviewID": "UR117958599", "Content": "We had a great harbor view room during our short stay in Vancouver. It was within walking distance of downtown. PROS: 1. Wonderful view with early check in 2. Ease of navigating the city, dinner reservations 3. The bellman rapid and courteous service 4. The service from the waiter for the wonderful breakfast buffet. CONS: None", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dublin, California", "Title": "“Exactly what our family needed”", "Author": "cazaresil", "ReviewID": "UR117940812", "Content": "We stayed in this property with points (15,000/ night) because any hotel in that part of Vancouver is expensive. We are a family of 4 with kids aged 4 and 2. We got a room with 2 doubles and a small sofa and in addition, we got a rollerway bed delivered to our room at no extra charge. The room wasn't large, but it wasn't small either.... bottom line, we had enough beds to accomodate everybody comfortably and the kids enjoyed playing with the beds. The view towards the harbour and Stanley Park is not unobstructed, but it's nice nonetheless. I did enjoy taking a morning picture of Stanley Park framed in between two high rises. What else is good: location. IMO, sleeping in the Coal Harbour area of Vancouver makes a huge difference. I regard Stanley Park as one of the greatests urban parks in the world, and probably the most beautiful. The pedestrian/ bycicle trail that joins the Canada Place and Stanley Park has to be one of the most pleasant walks anywhere. Another positive was the staff, very helpful. Regarding the previous comments about Internet, parking and breakfast... Internet is free in the lobby, so what's the issue? How many hotels of an equivalent brand name offer Internet for free anywhere in the property? Not many, so I thought this was a nice surprise that added value to my stay. Parking is expensive but if you are trying to save money, keep in mind that street parking in that area of Vancouver is super safe and free during the night. I actually left my car in a Chinatown parking garage (EasyPark close to Main and Keefer) for $10.50/ day during my all-Vancouver days. I picked the car up for our day trip to the Sea-to-Sky highway. Got back around 8pm and paid for two hours of street parking right across the hotel (there is a 2-hr limit so if you need more than 2 hrs you have to be more inventive). Free street parking starts at 9 or 10pm (can't remember). Bottom line, there are ways to save in parking. Yes, breakfast is ridiculously expensive... but... isn't that the case in any property of that level? I would come back.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“Very Nice”", "Author": "JWK_11", "ReviewID": "UR117811863", "Content": "We recently stayed at the hotel and found it very nice We have stayed here before and the hotel is certainly a lot better than it used to be The entire staff was very obliging and helpful We had a problem with the safe and after calling ,the repairman was there in 5 minutes which is really great Would definitely recommend the hotel to all my friends", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "london", "Title": "“Great location, stunning view and very professional staff”", "Author": "skinsid", "ReviewID": "UR117695724", "Content": "Trailfinders booked us here as part of our Canadian tour before joining a cruise to Alaska and we were very pleased they did. From the moment we arrived the staff were extremely professional and helpful. The rooms are of an excellent size and the view of the harbour is stunning. One way from the hotel you are within easy walking distance of the cruise terminal which is just next to Gastown and the other way is a beautiful walk along the waterfront, past the marina and into Stanley Park. The buffet breakfast was excellent and the concierge very knowledgeable and helpful in organising our trip to Grouse Mountain. Thank you for making our stay most enjoyable!", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "San Clemente, California", "Title": "“So So”", "Author": "scaldar", "ReviewID": "UR117296765", "Content": "I was expecting more from this hotel. It is clean decent but not up to normal Marriott standards. First no valet parking after 11pm. Its $31 dollars to park a night so at the least you would think they would have somebody 24 hours. Pool area is weak and Jacuzzi is a joke. Halls are kind of old. Elevator requires a key to go to your floor but seems to only work half the time. Not sure how many times I went to 19 floor first before I finally got it to allow me to illumenate the 10th floor where I was staying. Expected more for the price but then again Vancouver is a very expensive city.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "2.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Calgary, Canada", "Title": "“wont stay there again, overpriced, small and poor service”", "Author": "Arteleis", "ReviewID": "UR117096564", "Content": "Although the bed was nice, the 259 dollar room overlooking the harbor was not worth it. There wasn't even a bar fridge in the room, room service was closed at 10:00 and the lounge on a sat nite was closed before midnite. internet was extra, parking extra, breakfast extra, and when i asked to bring a bottle of wine at 10:05 to our room(for our romantic getaway) i was told to head to a pub or 711 if i wanted something else. Transferred us to an overpriced pizza place who took 2 hours to deliver. I was incredibly Disappointed it in this room. For the same price can have penthouse suites in other hotels that have far batter service and decor. Harbor view by the way is DEF not worth it either considering theres a giant chevron oil rig sitting in the middle with horrid bright lights. haha, horrid arts on walls colors are also a lie, pictures on their site did not tell the truth. May as well have stayed at a holiday in on top of a Dennys. Thanks Marriot for rippiing me off. Try the Listel hotel! Actually have taste and fantastic service. Good luck folks.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tauranga, New Zealand", "Title": "“bright, airy refreshing hotel”", "Author": "MelBid", "ReviewID": "UR116875700", "Content": "We had a lovely room with a balcony overlooking the harbour. it was everything we expected of an upmarket hotel. The gym and indoor pool and spa were great and of high standard. everything was clean and fresh in all areas of the hotel. we were able to use free internet in the lobby where there were 2 permanent computers. The food in the inhouse restaurant was excellent and the service good. we would go back", "Date": "August 17, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Dallas, TX", "Title": "“Wonderful place to stay in Vancouver”", "Author": "Texas_Traveler_30", "ReviewID": "UR116757960", "Content": "I found this hotel to be far above average, and I would be absolutely thrilled to stay here in the future. The room I had was on the 7th floor and faced the harbour. There was a lovely balcony with two chairs that was wonderful for relaxing in the morning with a cup of coffee (which is available in the room). The room was extremely spacious with a very comfortable bed, a chaise lounge, and a desk chair. One thing I loved was the media center on the desk with many outlets to charge all of your electronic devices. The tv was a newer model flat screen of a nice size for the room. I really loved the decor of the hotel. From the outside, it's relatively plain, but once inside you immediately see that the decor is very modern and chic. The hallways are red, and my room had walls of two shades of yellow. The bathroom had yellow walls with black countertops, very sleek. I also enjoyed the modern security feature of the elevator, which required a key card to select your floor when going up. I dined at the hotel restaurant one evening, and I found the food to be excellent and the service to be good. The same menu was available for room service, although I did not use room service during my stay. Each evening I returned to my room to find chocolates on the bed, which I thought was a nice touch. One of my friends returned to her room early one evening. Housekeeping knocked on her door and offered a warm towel along with her chocolates. I was never in my room early enough to benefit from this service, but I thought it was nice also. I was in the hotel for 3 nights, and on the afternoon prior to the last night, I recieved a call from the hotel asking if my stay had been satisfactory and if there was anything else they could have done for me. They truly care about customer satisfaction at this hotel.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Atlanta", "Title": "“Great location. Standard Marriott Fare. Would stay again.”", "Author": "maslowduke", "ReviewID": "UR116714483", "Content": "Great location for venturing into downtown Vancouver. Close to the Canada Place and Convention Center Piers - about a 5-10 minute walk. Great views of the harbor, water airport and Stanley Park. The hotel was clean, the service was good and it was a great home base for us. We didn't really take advantage of much in the hotel because of everything offered in downtown Vancouver. One thing I could have done without was the guy who owned the little lobby shop. Every time I went in there he tried to upsell me on something - mostly I just wanted gum or water.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "New York", "Title": "“Wonderful service and room with a great view.”", "Author": "seehunt", "ReviewID": "UR116592622", "Content": "We stayed at this hotel after a Holland America Cruise. The room here was HUGE in comparison to the boat, but it was also on the 14th floor with incredible views of the Harbor, part of Stanley Park, and the Seaplane terminal. Room was clean and comfortable, best bed on the entire trip! Service was also top notch. This place may be in the geographic shadow of the impressive Pinnacle Hotel, but it was top notch in every respect. Friendliest Hotel staff ever for such a large hotel. One small reservation, the lobby is very noisy much of the day and night, and there is no quiet area to use the free Wi-Fi in the lobby and do some work.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Orange County, CA", "Title": "“Good location for Vancouver sight-seeing vacation”", "Author": "GoCoGo", "ReviewID": "UR116442669", "Content": "Hotel staff was extremely helpful and friendly. The outdoor bar/restaurant patio is situated perfectly to watch the float planes take off and land from the bay. I forgot my toothbrush and razor and the front desk sent both up immediately. The concierge's restaurant recommendations were spot on and he/she also gave us great tips for our day trip to Whistler, even recommending sights along the way. The only downsides were the indoor pool ( It was unappealing) and the rooms could use a bit of an update. But the location is perfect for biking/walking Stanley Park, walking to Canada Place, or shopping areas. Car rental directly across the street.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "1", "Service": "5"}, "AuthorLocation": "Manila", "Title": "“Perfect stay except...”", "Author": "asa4598", "ReviewID": "UR116087896", "Content": "...for a CAD300++ you do not get a mini bar nor complimentary water bottles in the room. Service was great though, and it's a few blocks from downtown and the harbour.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“good top end hotel without the top end price”", "Author": "glenroben", "ReviewID": "UR116086660", "Content": "stayed for 2 nights and had one of the best beds after a 23 hour trip to relax and get some well earned sleep.The restaurant was excellent with a good quality menu and excellent service and staff, compared to a lot of big brand hotels this represented great value for money for those wanting a 4-5 star hotel.There is a chinese restaurant called the oriental which is located on the corner near a pub only 60 metres from the hotel absolutely brilliant food if you are a chinese food nut like me,...seriously as good as it gets and i have been to most all around the world", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "California", "Title": "“Great location”", "Author": "SoCalPals", "ReviewID": "UR115939539", "Content": "This hotel is right in the middle of Vancouver's action. In the heart of downtown, it's walking distance from the cruise ship terminal and beautiful Stanley Park. Our room had a great view of the Harbor and the staff was very helpful in making our stay in Vancouver exceptional. This is a great place from which to experience Vancouver before and after an Alaska Cruise.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "mt emu", "Title": "“Not great value for money”", "Author": "mtemu", "ReviewID": "UR115934106", "Content": "We stayed here 2 nights at end of our tour prior to cruise. It is very close to the cruise terminal but not otherwise particularly convenient to tourist attractions or restaurants. It was okay but nothing spectacular certainly think you could do better. Our room was missing a fridge which was supplied on request although it didn't fit the space. As it was on wheels seems this is a common occurence, others in our group had similar problems missing fridge.kettle etc. not all were rectified. If you need more than the miserly drop of milk provided for your tea/coffee provided go down the block to the convenience store don't as one of our group did ask for extra from front desk. $12 + room service charge for a glass of milk! This would be provided free of charge in the cheapest budget hotel in Australia. Obvious this hotel caters more to the business traveller than to tourist trade trendy furniture but not particularly comfortable.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Scottsdale,Az", "Title": "“Really enjoyed the experience”", "Author": "GPDScottsdale_Az", "ReviewID": "UR115918397", "Content": "From our early morning arrival,with our room ready the restaurant and things to do the staff was most helpful", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Excellent Hotel, Great Location”", "Author": "Wolfgang37", "ReviewID": "UR115908803", "Content": "The Renaissance Vancouver is an excellent hotel. The service was superb from the time we checked in until the time we checked out. The staff were very helpful, took care of all of our needs promptly. The location is great in the heart of Vancouver only 2 blocks from the harbor. The views from our room were tremendous.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Great hotel in one of the most scenic cities”", "Author": "1Gman1", "ReviewID": "UR115876485", "Content": "I have stayed at the Renaissance on a few trips to Vancouver. Service has always been good and the location is a short walk to Robson Street. While I usually avoid hotel restaurants, the food at this and other Renaissance hotels is usually quite good. This must be something this brand focuses on. Bring your jogging shoes and go for a run along the harbour (I have to spell it like the hotel does) and Stanley Park with a nice view of Grouse Mountain. If you really want a good workout, you can walk/jog a 5k or so hiking trail up Grouse Mountain and take the tram back to the base of the mountain.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Winter Park, Florida", "Title": "“On the water and very comfortable”", "Author": "grahamtrio", "ReviewID": "UR115809015", "Content": "We just returned from five days in Vancouver, one of North America's must-see cities. We really enjoyed The Renaissance Harbourside as it was easy to get to and from there, easy to get around town. It was a business trip for my husband, but also a chance to visit family. The staff was very accommodating and the service was excellent. The rooms were a nice size and had all of the amenities along with very comfortable beds and linens. We had a room overlooking the water, which was extra special.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Houston, Texas, USA", "Title": "“Perfect Location”", "Author": "dragonlady1969", "ReviewID": "UR115684429", "Content": "We happened to be in Vancouver on Canada Day. The Renaissance was perfectly located to experience all the Canada Day events and when it came time for us to leave on our cruise - we walked to the cruise terminal. Staff was very accommodating to our last minute requests.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Very nice hotel with friendly staff.”", "Author": "Petdankay", "ReviewID": "UR115666712", "Content": "We stayed in the Renaissance Vancouver Harbourside Hotel for 5 nights and it was a wonderful stay. The food was excellent and the staff was very friendly and helpful. We definitely will be back!", "Date": "July 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Irvine, CA", "Title": "“Nice place, nothing awesome”", "Author": "dbsanders", "ReviewID": "UR115447114", "Content": "Staying here using Marriott points, so not too aware of the cost. Parking is $30/day but that's expected in downtown hotels. Within walking distance of coffee shops, SkyTrain station, and waterfront.", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Lugano, Switzerland", "Title": "“Looking forward to go back”", "Author": "MySalami", "ReviewID": "UR115256127", "Content": "Even thought the main structure is not the newest, the main areas and the rooms are nicely renovated; providing plenty of comfort and everything else you'd expect from this category of hotels. Some of the rooms offer a nice view over the harbour, including an interesting view of the seaplane airport operation. Convenient location, halfway between Stanley Park and the city center, almost everything is at walking distance. Very polite and helpful staff. I had a very pleasant stay and i'm looking forward to go back, however, i have to mention a couple of minor remarks: from inside the room, i found the elevators a bit noisy when rumbling up and down, the old air-conditioning pack in the room is definitely too noisy and the Internet rated excessively expensive.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Auckland Central, New Zealand", "Title": "“Beautiful views and great location”", "Author": "yaven", "ReviewID": "UR115067128", "Content": "The hotel is in a great location just a couple of minutes walk from the convention center, and its harbor view rooms look out across the harbour. Our interconnecting rooms were spacious, and the beds were really comfortable. We had a very pleasant dinner one night in the hotel restaurant, and enjoyed the breakfast buffet and coffee machine in the Club lounge. The staff were all friendly and helpful, and we got some great sightseeing advice from the concierge, Alex. Will definitely stay here again!", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Michigan", "Title": "“Marriott Renaissance - great location and harbor views”", "Author": "lithlith", "ReviewID": "UR114960799", "Content": "My husband and I stayed here for 1 night in June 2011 prior to leaving on a cruise. The club level floors are the 18th and 19th floors, but the club lounge closes at 11am on Friday and doesn't reopen until Sunday at 5pm, so be aware of that if you are staying on a Friday or Saturday night. Since my husband is a platinum member, he talked the desk into giving us coupons to have breakfast in the restaurant since the club lounge was not open while we stayed there. The breakfast in the restaurant was a large buffet with lots of choices including an omelet station. We were in a large room on the 18th floor. We had an enclosed/glassed in balcony with great views of the harbor and float planes. Our room was a typical Marriott room in terms of decoration, but I can't emphasis enough how huge our room was. We spread out all of our luggage and had lots of room to spare. There was also lots of desk/work space. We spent quite a bit of time sitting on the balcony watching the float planes land and take off. There was an in room safe, hair dryer, iron/ironing board, robe, lots of closet space, coffee and tea. The only thing we didn't like was the bathroom was very small, there was not a separate sink and toilet/shower area, and there was no way to lock the bathroom door. There is lots of sitting space in the lobby area just to hang out. There were also two computers with free Internet access in the lobby. It is about a 4-5 block walk (downhill) to the convention center/Canada Place/cruise ship port from the Renaissance hotel. We didn't take a cab, but I suppose you could if you didn't want to walk (you could expect a 2 minute cab ride for about $5). This hotel would have far superior views of the harbor than the Marriott across the street, so if you are deciding between the two hotels, go with the Renaissance.", "Date": "July 2, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Los Angeles, California", "Title": "“Very friendly staff”", "Author": "Noush01", "ReviewID": "UR114943874", "Content": "I stayed here over a weekend in June. The staff were very friendly and the room was good (oddly shaped though). My friend would be upset if I didnt mention the parking though. It's hard to see how to exit signs in the parking. They dont have big signs but those small exit signs by stairways!", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "hampshire", "Title": "“lobby ok then onwards going downhill”", "Author": "HampshireMax", "ReviewID": "UR114230063", "Content": "just returned from a 3 night stay at this hotel. When we checked in we asked if poss for a room with a nice view was told the hotel was pretty full but said he had found us a nice room. If the room we were given was nice I would hate to think what bad was. Dark dingy and a corner window overlooking the back of hotel. We had to permantly have the lights on in this room as hardly any daylight could come into this room. I would say that the hallways to the rooms and the rooms need a lot of updating cheap and tacky is the words i would use to descibe how we felt about this hotel. I would defently not stay in one of these hotels again.", "Date": "June 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“Nice hotel”", "Author": "teeDoan", "ReviewID": "UR113186127", "Content": "The hotel itself is nice enough. Our room was comfortable, clean, and updated. The walls are super thin, and you can hear everything going on in the hallway, but I've found this to be true for many hotels. The location was pretty good. We were a few short blocks away from Robson/Granville and a good walk from Stanley Park. There is free wi-fi and free internet stations in the lobby, which is really nice. There is a daily internet fee, if you want to have access in your room. Parking is $20+ a day, but that is pretty normal for Vancouver. Overall, I liked the Renaissance better than the Sheraton Wall Center and Sutton Place. It's probably on par with the Hyatt, but the Hyatt has a better location (but less comfortable beds).", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Boston", "Title": "“Excellent location, great service and what a view!”", "Author": "MartzBoston", "ReviewID": "UR113108053", "Content": "Booked this hotel because it was close to the Vancouver Conference Center and the closer conference hotels were fully booked. Boy, did I luck out. The room was spacious, overlooked the harbour--I could see the seaplanes take off and land, there was free wi-fi and the hotel was close to everything. Unlike the conference hotel which was like a big mall, this hotel was smaller and nicer. The staff were terrific and the room was really huge. I could walk to the harbor park in 2 minutes, to the conference center in less than 5 and to Robson street (major shopping) in 5-10. Also, the beds were soooo comfortable.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Lancaster, Pennsylvania", "Title": "“Nice hotel”", "Author": "tinkerman33", "ReviewID": "UR112113627", "Content": "Clean, centrally located, walk a few blocks to Olympic center, waterfront, conventions center , sightseeing buses, room view over water was nice.. everthing in Vancouver is a little pricey, but a great city to visit. Staff was friendly and helpful..great fitness center and pool for location... ****If you pay $ 15 a night for internet , you get FREE local calls and calls back to USA.. ( great deal)", "Date": "June 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC", "Title": "“Renaissance and Amanda Bye Saved The Day”", "Author": "WallabyD", "ReviewID": "UR110378091", "Content": "Upon arriving in Vancouver, one day prior to our cruise departure, it was apparent that the hotel we had booked was not in a good part of town. Desperation set in and we hopped in a cab and headed back downtown to the Renaissance Vancouver Harbourside Hotel. Upon arriving, a young but very Professional and understanding Miss Amanda Bye listened to our plight and got us into an amazing room at a last minute special rate. She was extremely helpful and kind and in a world of not so great customer service, Miss Bye exceeding all of our expectations and turned a very bad first night in Vancouver into a very good one! The rooms and views are breathtaking, looking out over the harbor, the location is perfect, a few blocks from the Waterfront stop from using the SkyTrain from the airport and it's just a one block walk down to the waterfront itself where there is a plethora of restaurants and yummy eats such as gelato. The staff overall are very accommodating and the buffet breakfast is top notch. I would not hesitate staying here again on our next visit and I would hire Miss Bye in a heartbeat if I owned any type of establishment. Thanks again AMANDA!!!!", "Date": "May 29, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Charlotte, NC", "Title": "“Bad service, old hotel”", "Author": "RichardCLT", "ReviewID": "UR108494881", "Content": "What a rubbish hotel. Its right from the 70's. Rip off parking, bad rooms with old school air con Nice view but thats about it. Staff are icompetant. Did nto deliver my platinum welcome amenity. When I called they accused me of lying. very odd. I will NOT return.", "Date": "May 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago", "Title": "“Outstanding staff”", "Author": "ChicagoCatman", "ReviewID": "UR108120693", "Content": "In my almost weekly travels I stay at many nice hotels, but not every one distinguishes itself with the superior customer service offered by the front desk staff at this hotel.", "Date": "May 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Northern New Jersey", "Title": "“Great location, good business hotel”", "Author": "NJGIRL", "ReviewID": "UR107970934", "Content": "It's nothing fancy but it really works as a business hotel. The rooms are fine and if you get one with a view of the lake/mountains, it's much more than fine! If you need to be downtown and/or near the Convention Centre, it's hard to beat for the price.", "Date": "May 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Berlin, Germany", "Title": "“Great day despite of rainy weather”", "Author": "chr_marotzke", "ReviewID": "UR106987537", "Content": "This is a great hotel, Personall is verz friendly. Breakfast was excelent. Champain in our honeymoon escape rate was the way we wanted it, cold and dry. The only thing we did not like was the parking facility. This was quite difficult to find.", "Date": "May 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City", "Title": "“A nice hotel in a nice city”", "Author": "Tina_Greg44", "ReviewID": "UR101513654", "Content": "The rooms are good, the service is good, and the prices are reasonable. I decided to choose this hotel following previous reviews on trip advisor, and I wasn't disappointed. I would recommend this hotel to my friends. Vancouver is a really nice city, and this hotel is pretty well located.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Very nice but loud party ruined experience”", "Author": "Hedgesa2", "ReviewID": "UR101004124", "Content": "Stayed at the Renaissance in downtown Vancouver while working a trade show at the Vancouver Convention Center. Overall the rooms were very nice and well appointed and the hotel staff was very friendly. Unfortunately during our stay there was a party for Persian New Year and the vibratiions and noise could be heard throughout the hotel during the night and very early the next morning. Being in the travel industry (I work for a CVB) I understand how much revenue those events provide but what I don't understand is why a more reasonable time limit was not placed on the music. When I brought it up to the hotel staff the next morning they said they had received a number of complaints from guests and were very sorry. Here is an idea to avoid complaints, turn off the music at 12:30. Had the party not been going on I would definitely have reccomended this to other business travelers. I think next time we are in the area however we will stay at another property.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Beautiful hotel”", "Author": "MOSANTA", "ReviewID": "UR100920846", "Content": "Great hotel in a great location with very friendly staff. Room service was a bit slow otherwise no complaints. Clean rooms we had a partial view of water and mountains. Clean and beautiful surroundings.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rockville, Maryland", "Title": "“Above and beyond the call of duty.”", "Author": "Forest20851", "ReviewID": "UR99157807", "Content": "I knew that Vancouver wasn't huge, geographically, so I wasn't worried about needing to get to the airport for sidetrips to Calgary, Kelowna and Victoria during my stay. Unfortunately, I hadn't factored in downtown traffic. Because the Harbourside was some distance from the airport, which is actually in Richmond, I found myself at the valet station at 5am three days in a row. The first two days, there was no problem as there was someone on duty each day. The third--a Sunday--a \"suit\" came to the valet station asking what I wanted. I gave him my parking ticket, and explained that I had to catch a plane. He ran off and drove up in five minutes with my rental car. I offered the gentleman a $10 bill which he declined to accept--explaining to me that he was the manager-on-duty of the Harbourside (Whoa!). I realize this is what five-star service is about, but I still worried about finding my luggage on the sidewalk when I returned to the hotel. I also had faxes placed in envelopes and delivered to my room as soon as they arrived--in one case it was the middle of the night. The night before my day of departure, I explained at the valet station that I had to return my rental car and be through airport security and at my international departure gate at 5:30am. A valet jumped into my rental car and drove me into the underground parking garage. He placed my car near an elevator and gave me my keys. I made my plane with time to spare. I know this sounds like I spent more time *outside* the hotel than *inside* to hotel. But the fact is that without the exceptionally high level of service the Harbourside provided, my visit to Vancouver would have been a complete failure.", "Date": "March 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Beijing, China", "Title": "“Great location and great hotel in the heart of Vancouver”", "Author": "CDNRower", "ReviewID": "UR98568591", "Content": "Very nice view from our hotel room afforded us the colors of sunrise set against the majesty of a mountain range to and the goings on of a bustling sailplane business. We are Marriott concierge members so were able to avail ourselves of the 19th floor Concierge Lounge. Very nice hosts up there and when we did dine at the main level buffet it was also pleasant. Room is somewhat dated, but very clean and comfortable. We really enjoyed the complimentary jogging maps -a nice touch.", "Date": "March 1, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Seattle", "Title": "“Not what Was Advertised”", "Author": "SeattleKiki", "ReviewID": "UR98270399", "Content": "The Hotel from the outside looked old and Shabby far from the pictures posted on the web site. Check in was not a good experience it was 3 times befor we could get a key card to work to get into the room and on and on. The Restaurant looked nice but did not live up to the expectation.food was not good ,service was slow.20 minutes after coming into the restaurant we actually caught our waiters attention and it was not even that busy. Breakfast buffet was sub standard food was not fresh. Dinner promised to be something nice. It was not it was really just average compared to alot of other places near by this P2B restaurant is poor . Rooms were smaller than we expected .Did not like the dirty bathrooms and garbage in the side drawer made me feel dirty. Parking was excessive Internet was expensive 17 dollars for the day and we wee only on an hour All n all thiss is a low 3 star at best .Go elsewhere for a better experience", "Date": "February 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great price, amazing value for money, awesome location”", "Author": "AmitSa", "ReviewID": "UR98030369", "Content": "Great hotel overall. Secure, very clean, safe and great value for money. I would rate it equivalent to any great hotel in Vanc for much lesser price(Check for promotions) and if you are a regular, they would upgrade you to a harborside. Good resturant, easy access to everywhere, highly recomended.", "Date": "February 25, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Victoria, BC", "Title": "“False Advertising, Dirty & Disorganized”", "Author": "Lisabelle5", "ReviewID": "UR96522028", "Content": "It is a good thing I booked this hotel through priceline at a discounted rate, the quality and service we received for this hotel was not even on par with a two star hotel. Even with the discount in mind, for what we paid I was still quite disappointed. First of all - this was a weekend girls getaway for two working professional women who wanted to visit the city and pamper ourselves (at least a little bit.) I saw on the website that this property had a pool and jacuzzi open 24 hours as well as a sauna. The Jacuzzi was closed for cleaning, and then was out of order for the entire weekend. We were ok with this as we thought to just use the sauna - There is none! The website falsely advertises this feature (amongst others). I was told by a hotel staff who was laughing that it was \"not replaced when the hotel was renovated\"..IN 2008!!!!! I don't think it takes 2+ years to change details on the website. There were blood stains on my sheet and the balcony was filthy. I met the housekeeper of our floor and she was so lovely and sweet, the attention to detail of these issues was likely an oversight as the result of being allotted to many rooms to clean. The decor is best described as \"confused\". It is modern minimalism meets country western/Mediterranean. The hotel doorman was very gracious, the beds were ok and the location was near a skytrain station. These are only the good qualities this hotel has to offer. Like I said. Stay at a two star hotel and save your pennies. Why exactly is this hotel considered a four star luxury hotel anyways? They even charge for internet.", "Date": "February 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Brunswick", "Title": "“Great view”", "Author": "keenvisitor", "ReviewID": "UR93868787", "Content": "Stayed here for 3 nights whilst DH attended a meeting. The hotel is very central within easy reach of skytrain, Stanley Park, shops etc.. We had a good sized room with enclosed balcony and a great view of both the bridge and the harbour. Comfortable Marriott beds and bedding. The staff were courteous and efficient (brought luggage rack and chairs for the balcony within minutes) and check-in extremely quick. Some people seemed to have great difficulty with the elevator where you have to insert your room key before you press the floor number, but I think it is a good security feature. Internet access is around $15(+ tax) noon to noon, although it is possible that some room rates include the internet, and the parking is expensive (did not have a car but glanced at the rates) but it always is in big city hotels. The lobby is modern but IMO the rest of the hotel has exceedingly garish carpet and the rooms seem to have been designed by a committee which never met together. Bright striped carpedt competing with elegant navy pin striped bedskirt; Modern dark/light geometric headboard next to blonde wood table: yellow block wallpaper and matching sheers - very 70;s to me. We stayed here as a change from our usual hotel and found it very comfortable, however we will probably revert to our usual hotel next visit.", "Date": "January 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "nyc", "Title": "“Pretty decent - but parking a MASSIVE scam”", "Author": "weddingbelles", "ReviewID": "UR93484703", "Content": "Really would stay here again were it not for the MASSIVE scam that is the parking situation - they charge like $30 for a \"day\" - but the \"day\" concludes at 6am the following morning, then you're charged for another day!!! I nearly paid more for parking than I paid for the hotel room.", "Date": "January 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Fort Collins, Colorado", "Title": "“Updated Hotel near downtown”", "Author": "BluDragonFlyer", "ReviewID": "UR93062666", "Content": "Hotel has new very modern lobby, I was checked in quickly, but had to ask twice to get a room without an adjoining door. The rooms are updated in modern look with flat-screen TVs, plenty of closet space, and nice work area. The bathrooms are very tiny but the vanity area is large enough to accomodate make-up, hair dryer etc all at the same time. The bathroom is all new and attractive. Just on the small side. If you had two people trying to get ready to go at the same time. It would not be possible to even move around each other. Beds are comfortable--nice linens and comfortable pillows. The restaurant in the lobby is overpriced for the quality of the food.", "Date": "January 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Salt Lake City", "Title": "“Only problem is that it's in Vancouver”", "Author": "chaub", "ReviewID": "UR91421233", "Content": "This was a nice hotel ,very similar to the W hotels. They didn't have my king bed (that I reserved) so they gave me two doubles with a harbor view of the sea planes. Really pretty view. I went during the Vancouver Film Festival, so it was pretty busy. They have a nigh club/lounge area downstairs that seemed to be pretty popular. The parking garage is kind of annoying and can be difficult to find a space, but i've dealt with worse. There's a fantastic dim sum place a few miles away called Kirin (the west one) that was very packed on a saturday morning. Overall I've been to many big cities, and I have to say Vancouver is the busiest and most obnoxious of them all. I will never go back to Vancouver if I can help it. Just a very gloomy, depressing place.", "Date": "January 2, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Coquitlam, Canada", "Title": "“Gala Night”", "Author": "Hamidreza465", "ReviewID": "UR91335383", "Content": "That was the worst New Year Gala ever...! My girl friend's Jacket and her keys got stolen, we got push several times by crowd and security, the coat check was disaster, people took any jacket they liked...! and then we asked Hotel Rep to get us a Taxi since my girl friend didn't have any coat to wear in -7 dgree outside, which took more than 2hrs to arrive. During this 2hrs we had to seat in the hotel cold lobby where we witnessed several drunk people vomiting and swearing. They didnt even get us a cup of water...! I am pretty sure lots of these guest weren't in age range that was claimed 25M/21F...! \"Thank you Renaissance and Icon Nights for ruining our New Year night\"", "Date": "January 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great place”", "Author": "YVR-AKI", "ReviewID": "UR91321907", "Content": "This was the second time I have stayed at the Renaissance, the preivous time being with an-ex girlfriend the previous year. Both times were great and with a great rate through Priceline. Location is excellent, only a few mins walk from Burrard station skytrain, a bit further from Waterfront station where one can catch the line to Vancouver Airport. Nothing stopping you from coming into Waterfront station from the airport and taking the expo line to Burrard station and walking from there ( or vice-versa when leaving). Taxis are queued out front and it is a short walk to either Robson street or the waterfront if you want to go for a run. Never ate at the restaurants because there are too many great places nearby to eat out or pick up food including Waves Cafe and Urban Fare which are less than a block away. There is also a 7-Eleven and Shoppers Drug Mart nearby for picking up things. Like others have said, the rooms are a bit date with some pretty funky design carpets. But really you can't complain because it is clean and the rooms are spacious. W. Hastings past Burrard street is quite quiet especially at night with the most noise coming from the bar/lounge across the street at the Marriott. Beds are comfy, nice flat screen TVs and Aveda toiletries which the gf really liked. Overall a really great deal especially if you get the priceline rate and a hotel that I will certainly be using again. Only complaints would be the price of the internet access in room and no complimentary water, but then again it is Vancouver and the tap water is great.", "Date": "January 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kailua-Kona, Hawaii", "Title": "“Did the Job”", "Author": "DofSales", "ReviewID": "UR90505036", "Content": "I had to stay here for the night as I was hosting a function in one of their ballrooms. Rooms very pricy. I travel a lot for business, and it seems the more I pay for a room, the less I get. I had to pay for bottled water, (a crazy amount) paid for internet, no newspaper delivery. Room was large, comfortable clean, but you can get this now at many 3 star properties if you look, and they give you the water, internet, paper, parking etc. When in the city, I don't mind paying for parking, it is what it is. as long as it's consistent. Fitness room was nice, well equipped. I had no problems with the hotel, other than I would probably choose to stay elsewhere for less. Please don't get me wrong, great, clean well maintained rooms, I'd recommend the hotel if you don't mind spending top dollar. Me, I'm usually on a budget, spending my companies money, so I look for a bargain, with value and good quality where I can.", "Date": "December 22, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Sechelt, Canada", "Title": "“3 stars is pushing it”", "Author": "Stev53", "ReviewID": "UR89014437", "Content": "Older hotel with makeover, No bathrobes, no wine glasses, paper coffee cups, lack of furniture in room, only double beds if wanted a king it would have been $30 more, front desk would \"not\" compromise, parking advertised at $23 a day but with taxes over $31. We did get a good price booking through the internet but does this mean you should receive less then average service. I will not make this mistake again there are plenty of good hotels in Vancouver that \"do\" want your business.", "Date": "December 4, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Great Hotel, Good Views, Restaurant needs some help”", "Author": "JaxxCoach", "ReviewID": "UR87193465", "Content": "Hotel was very clean and upscale. Views of the harbor were fantastic, close proximity to pubs downtown and other eatery's. Being very close to the conference center was a plus. Restaurant could use some work on the service side but other than that everything was great. Highly recommend.", "Date": "November 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“great location downtown YVR, older hotel, good service”", "Author": "FredShuuz", "ReviewID": "UR86219873", "Content": "location is awesome if you are at a conference or want to be in downtown Van it is great this is a Renaissance property. like the skydome hotel it was built many years ago - 20? or at least in the style of the 80s/90s i booked this through priceline so value was excellent at priceline price - 85 USD then add tax clean. as clean as other Marriot properties i was at arrived early. they didn't let me check in as the room wasn't available at 11. waited an hour in the lobby with free internet and then checked back at 12, expecting to check my bags with the doormen, but they gave me a room walking in: big room. lots of space. king bed. door opens to a tiny balcony where i could partially see the harbour bathroom was clean. tub. toilet. no rack for hanging your towels to reuse. my room had a little couch. safe in room checkout is at 12. max till 1. wouldn't let me check out at 130. grrr aveda toiletries swimming pool is small as is the weight room but you can get an adequate session in.", "Date": "November 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Albuquerque", "Title": "“Over 100 Nights and wouldn't change a thing”", "Author": "Mik505", "ReviewID": "UR85493922", "Content": "I have stayed at the Renaissance in Downtown Vancouver for 40 nights in 2009 and 70 in 2010 (so far). I have come to rely on the consistant quality of this hotel, it's restaurant, lounge, and the nearby facilities. The lobby restaurant is wonderful - though pick the Tenderloin over the Ribeye. Every night there is a 9pm shot from the cannon at Stanley Park to the North. I would recommend walking to the Olympic Torch across the street to get the full effect of the echo.", "Date": "October 31, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Los Angeles, California", "Title": "“Wonderful stay at the Renaissance”", "Author": "dancerLosAngeles", "ReviewID": "UR83854944", "Content": "Wonderful stay at the Marriott Renaissance. Better than Pinnacle. Spacious rooms, lovely views and walks along the seawalk. The concierge, Alexandra Monetta is superb! Anthony at front desk is very helpful and friendly. Loved my stay and will always want to stay here because of the views, the lovely walk along the harbor right outside the doors, the convenience to skytrain taking me everywhere in town and the service of the hotel. Rather expensive buffet breakfast but you can order anything a la cart: lots of wonderful coffee shops including Starbucks one block away and Urban Food, fabulous grocery ,there also.", "Date": "October 17, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Los Angeles, California", "Title": "“Beatiful hotel with breathtaking views in the center of town”", "Author": "Megan39", "ReviewID": "UR83044807", "Content": "On the water with a view of the ice capped mountains, walking distance to all the neighborhoods in downtown Vancouver. Modern nicely appointed rooms, and wonderful customer service.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "lansing", "Title": "“We loved this hotel right on the harbor in Vancouver.”", "Author": "LansingGayle", "ReviewID": "UR82965069", "Content": "The staff was very accommodating. The room was exceptional - modern, clean, excellent view of harbor, comfortable bed, coffee/tea in room, 6 blocks from our cruise ship dock, we could walk to everything, excelletn location, we would stay here again.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "riverside california", "Title": "“ok but expensive for what it is”", "Author": "attytrav.", "ReviewID": "UR82653529", "Content": "I stayed for 3 nights for a business conference. My room was large although long and skinny. streetside view. quiet enough and good business set up (lots of plugs, long desk etc) comfortable beds and nice bed linens. small bathroom, thin cheap towels. nicely appointed gym. Desk service was fine. in other words a standard business hotel. I thought that 265 a night plus all the taxes was a lot for the room. however this was my first trip to Vancouver and maybe it is just an expensive city.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lubbock, Texas", "Title": "“A good hotel with an excellent restaurant”", "Author": "Dellinda20", "ReviewID": "UR82205270", "Content": "We stayed three nights in September and found the hotel to be everything one would expect of a luxury hotel. We had stayed one night last year across the street at the Marriott, equally nice, but decided in returning we wanted to stay at the Renaissance in order to be on the side with a view of the harbor and the mountains. Although the view is between two condo buildings it was still very beautiful, and we enjoyed looking outside and leaving the window open to enjoy the breeze. It is in a good location for walking and taking the bus, and we found the restaurant to be a good place to eat a couple of evenings when we were too tired to walk elsewhere. There are several good breakfast options within walking distance, however, which are much less expensive than the $22+ buffet it offers. It is easily accessible to the waterfront for walking and relaxing.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Wiesbaden, Germany", "Title": "“OK room - great food and service”", "Author": "jo1970Singapore", "ReviewID": "UR82136681", "Content": "Stayed a week and the location was perfect being right near the Congress centre, waterfront and shops. Average room with twin beds instead of a King. At least the beds were large and comfortable with good soundproofed windows. Sleep quality was good although the walls were not quite thick enough to drown out the coughing next door. The food in the restaurant was excellent and I was quite happy to eat there for various lunches and dinner as the menu changed during the day. Staff were always very helpful and efficient. Breakfast buffet had a large range of hot and cold foods and was well worth the cost. Internet service in room was both wired and wifi with good connections. Gym had a good variety of equipment and I did not have to wait for a machine at any time even when htere were a few people in the gym. 4 treadmills, 4 steppers, 4 bikes and various weight machines as well as free weights. Pool & spa looked good but did not try. No minibar in room but there is a shop in the foyer and a vending machine in the gym. Also, a 7-11 just around the corner as well as a Starbucks. Good choice in Vancouver with an easy walk to local shops.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Barrie, Canada", "Title": "“Stayed for 2 nights. Great service...”", "Author": "sjhanlon", "ReviewID": "UR81731311", "Content": "Stayed for 2 nights. Great service. Check-in was quick and easy. Upgraded to Club Level without asking for being Gold Elite. Club Lounge was nice. Room was clean and had the nice technology panel that Mariott has rolled out. Great location. Walked one block to Convention Center.", "Date": "October 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Mediocre, would not recommend...”", "Author": "mafo_1011", "ReviewID": "UR81541421", "Content": "I noted that the other reviews on tripadvisor for this hotel were not that good. But I have Marriott rewards points and therefore I decided to stay with points (unfortunately at the Marriott across the street it was not possible to reserve with points at that time). Despite being a good Marriott customer and despite staying for 5 nights in a row they gave me the smallest room on the entire floor just next to the elevator. This seems to be their policy how they treat their best guests if for once they don't pay for the room but use the points they earned during previous stays... not that it mattered a lot because I wasn't in the room very often besides sleeping... but it just shows how much frequent guests are appreciated by Renaissance... Otherwise the room and hotel was ok but nothing special at all. Everything seemed a bit old and a general refurbishment wouldn't harm. Oh n for Internet in the room they wanted to charge 15.95$ per day - only in the lobby it is free. The good thing is, that they don't seem to be tech-savvy: you can take your laptop to the lobby, get a free login there and bring your laptop up to your room again and it is working for free :-)) So overall the stay was ok as I didn't have to pay but I would have been disappointed would I have paid for it. After 5 nights I checked out and changed to another downtown hotel: I got a great room with nice views and even a balcony. size was about twice as big, Internet in the room for free and cost at 150$ below any rate you can get at the Renaissance! So unless you have particular reasons to stay there I wouldn't recommend Renaissance at all.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "denver", "Title": "“A Nice Stay at the Renaissance in Vancouver”", "Author": "finesilver", "ReviewID": "UR81000124", "Content": "Spent four nights this past week at the Renaissance in Vancouver. Found many things to like, a few challenges. On balance, though, I can recommend. The pluses: -Great location two blocks from the water front, near 20-30 restaurants within walking distance. A few blocks to the convention center where the Olympic torch is located and one more block down is Canada Place. -One of the best hotel restaurants I have been to in a long time, at there three times, all darn good meals. I am submitting a separate review of the restaurant too. -An accommodating staff and management -Well connected and informed concierge staff -wireless internet in the lobby -great door staff The cons: -the decor is a little dated, some of the carpet made me feel like I was in a bowling alley -housekeeping had its challenges, missed cleaning half the room on day, another day left a scrub brush on the floor of the bathroom -cost of $16 per night for internet in the room seems quite high, the trend is free or under $10; I needed the convenience for work so I paid it, still seemed expensive, plus the internet was very slow speedwise -the gift shop was blah, most are, lost opportunities there and lost convenience for gurests -two distinct views one harborside and one cityside, the hotel is quite protective of the rooms with a view, perhaps unnecessarily.", "Date": "September 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Could use a little attention to the details.”", "Author": "BigTipper", "ReviewID": "UR80879869", "Content": "Stayed for a couple of nights, midweek. Check-in was smooth and didn't have any issues. They didn't have king size available for me, so I had to take 2 queens. Didn't sleep too well due to 2 issues: 1. I woke up covered in perspiration ( I suspect they use one of those plastic mattress covers, and there is a heavy duvee), 2. pillows aren't as large and firm as I prefer. Desk chair was very poor. Could not lock it upright, and it would not raise as high as I needed to work at the desk. I'm 6 feet tall, but I was still working up at an angle to the desk. Sink/facet combo in bathroom is modern, but facilitates splashing. Had to wipe the counter constantly. Parking level for hotel takes a bit of driving to get to, and out of, but is convenient to the elevator. There is a safe in the room, and there large flat screen is connected to a panel of connectors on the desk, so you can hook-up just about anything to the television, like your computer, DVD player, MP3 player, etc. Patio doors open, but there is no balcony, only a railing. Overall, felt a little dated. Seems like it could use a bit of sprucing-up.", "Date": "September 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Northern VA", "Title": "“Great hotel with a view of Coal Harbor and Stanley Park”", "Author": "Foster32", "ReviewID": "UR79289166", "Content": "The view from our room in the Renaissance overlooked Coal Harbor and Stanley Park. We enjoyed watching the seaplanes take off and the various water traffic. Far off we could see the mountains. Our room had the classic Renaissance features and quality. The breakfast was worth getting up early for. Wished we could have stayed longer.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lancashire", "Title": "“Welcoming staff great location”", "Author": "Ladygolfer31", "ReviewID": "UR78511540", "Content": "We arrived at 8am, following an early morning departure from an Alaskan cruise, given a warm welcome by the receptionist and advised our room was ready. Great to be able to relax for a couple of hours before exploring Vancouver. All the staff very helpful and efficient. An excellent location for downtown Vancouver and the harbour. Excellent stay.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Really good place”", "Author": "theriex", "ReviewID": "UR77702181", "Content": "Stayed here for one night after coming off a cruise. Very clean. Comfortable bed. Great transportation, tourist tips and good maps from the service desk and concierge. Breakfast was excellent. No prob storing our bags for the day when we arrived at 7:30am. Would stay here again.", "Date": "August 31, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Denver, CO", "Title": "“NEVER AGAIN!”", "Author": "stuawa", "ReviewID": "UR77573913", "Content": "My wife and I needed a hotel in downtown Vancouver for a one night stay prior to an Alaskan cruise. We chose this hotel because of a nice discounted offer. We were shocked when we arrived and saw the room. It felt like being in a matchbox with little room for 2 people to move around. It was sparsely decorated, and the bathroom was a joke. There was not even a hook in the bathroom to hang anything on. The view was of a city building. I went to the front desk, and I requested a different room. I was told there would be no other room available at the price I paid, but I could get another room if I was willing to pay more money. I refused and I decided to tough it out. When using the bathroom, we found that the sink would not drain. I called the front desk, and they said a plumber would be sent up. After we waited 30 minutes, the plumber arrived, and he worked on the sink. He said he could not fix it completely, but he thought it would now drain better. After he left, we discovered, it continued to drain sluggishly. I went to the front desk to request another room, basing my request on a non-working sink and I was once again told there were no rooms available unless I was willing to pay more! I again refused and decided to just deal with it. I am amazed at all the good reviews of this hotel. It appears others had a better experience. In my opinion, the room that we stayed in was not a 4 or 5 star room, but more like a 1 or 2 star room at best. We would have done far better to have stayed at a Motel 6, a Comfort Inn, or a Hampton Inn. At least, we would have had more room, a working sink, and a breakfast. Also, it should be noted that for those with a car, the parking fee is $42 per night! In my opinion, the only thing this hotel has going for it is the nice location. I have a feeling that this hotel has a block of less than adequate, lower end rooms reserved for those who take advantage of a special rate, and once they have you in house, they try to get you to pay more for a decent room. I will avoid the Renaissance brand in the future for sure!", "Date": "August 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Haddington, United Kingdom", "Title": "“Great Hotel, great location, great staff, great food.”", "Author": "Canadafan2010", "ReviewID": "UR76600141", "Content": "Just back from a trip to Canada, last 3 nights spent at Renaissance Harbourside Vancouver. Over the years we have stayed in different hotels in Vancouver and we would say this is our favourite. The Reception Staff were excellent and upgraded us (for a price) to a great room with a view over the water. We could see seaplanes land and take off and lots of boats. All of the staff were polite and genuinely helpful and made our stay very memorable. The breakfasts were great too, although pricey, but lovely food and smoothies. Pool and gym were nice although an outdoor pool would be better but at least there was an outdoor sun deck.We loved it and hope to return one day.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Irvine, Ca", "Title": "“Great Location”", "Author": "SusanIrvine_Ca", "ReviewID": "UR76000471", "Content": "My family stayed at this Renaissance Hotel on 8/12-8/14. The location of the hotel is great! Walking distance to a lot of places. When we arrived at the hotel and parked our cars on the curbside (loading zone) the attendant (I think they were the bellhop...not sure but he was wearing a tan polo shirt with the hotel logo on it) was quite pushy telling us to go park the car. We were about to unload our luggage. We ignored him, but a few minutes later he again was very pushy about getting our cars out of the curbside telling us we were going to get ticketed. There were 10 of us and my dad had a knee injury so he couldn't be rushed. I didn't know why the guy (he was the older one) was so pushy. Thank goodness the front desk was very pleasant and helpful to make up for the guy outside. The rooms weren't that big. They had Aveda products which was nice. There is a lot of construction going on in downtown Vancouver so the last morning we woke up early to a lot of noise. There are 2 computers in the small lobby, but they are SO slow. We got a great deal on Priceline. I would not stay here for hotel website price. There is a small indoor pool and exercise room. I would only recommend this hotel if you get a great deal through Priceline or Expedia etc. I must say Vancouver is one of the cleanest cities I've ever been to!", "Date": "August 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sugar Land, Texas", "Title": "“Very Nice........”", "Author": "nulung95", "ReviewID": "UR72784467", "Content": "I spent the 4th of July weekend with my husband and we had a marvelous time. The room package came with a free companion ticket and free hot breakfast. We arrived late and had dinner at the restaurant, the server was very friendly and attentive to my special needs ( I try to avoid too much sodium when traveling).... The Halibut dinner was excellent and my husband ordered the filet....delicious!! The room initial room was very small, but I realized we were in Canada, but they promptly upgraded us to a harborview room so the large patio window made all the difference...although no chairs available to sit on the balcony..... I would definitely come back when visiting Vancouver again....", "Date": "July 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Salisbury, United Kingdom", "Title": "“Super Hotel with Great Location”", "Author": "TheMcGovernFamily", "ReviewID": "UR71120897", "Content": "We had a really great stay at this smart hotel. Everything was as it should be and the standards were high. Staff very attentive. There was some music noise due to a Prom Night (it was a Saturday), which was just one of those things but regrettable, but guess what, they reimbursed my points to me. Thought the staff were really excellent. Try for a room above the 11th floor with a harbour view. If you have kids, there is a good food court beside Tim Horten's five minues away beside the cruise terminal. Tip: walk towards Stanley Park and you will see bicycle rentals. A cycle around the park with kids is just superb!", "Date": "July 16, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tucson, Arizona", "Title": "“High-priced average hotel”", "Author": "Rumples", "ReviewID": "UR70052591", "Content": "We stayed here for one night at an excellent price secured via a bid on Priceline. It was good value at that price but definitely would not be good value at the rack rate. Our 12th-floor standard double room had been remodeled but the furniture seemed low quality with knicks and scratches already marring surfaces. The new carpeting (stripes in bold colors that proved a distraction in the room) was already rather grungy. The room was good-size, though, and had a comfortable bed. The small bathroom was adequate and had Aveda products. There was a limited view of the harbor, which was pleasant to look out on, from the corner window. Our room was quite a ways from the elevator, which meant that I saw far more of the hallway carpeting than I wanted to see. The pattern -- two geometric designs featuring primary colors -- had a dizzying effect on me. This decor (and that within the room) is not what one usually encounters in a 4-star hotel. The hotel advertises a $23 daily parking rate. With tax, that actually comes to a daily rate of $31 plus some change. We thought that a bit steep so parked our car in a nearby Easy lot, where the cost is only $6 from 6 p.m. until 6 a.m. At 10 p.m., we moved the car to a parking meter across from the hotel. Meters only charge between 9 a.m. and 10 p.m. We checked out just before 9 a.m. so had no further parking fees, though the hotel tried to bill us for using its parking facility even though we never did use it. We finally managed to get that charge removed from our bill. Vancouver has many fine 4-star hotels. If you plan to pay the regular rate, I suggest looking elsewhere for your stay.", "Date": "July 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great harbour views”", "Author": "SimonFlyer", "ReviewID": "UR69812026", "Content": "The hotel has clearly been remodelled and the strange shaped hallways betray its age. However, the rooms are spacious and well decorated. A new apartment building obscures some of the view but there is still a fantastic view of the harbour from the north facing rooms. The executive lounge breakfast is excellent. The lobby is a bit noisy and always busy as the bar/restaurant is part of the reception area. Walking distance to all major downtown attractions. Beware that some rooms near the airconditioning unit can be very noisy.", "Date": "July 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Decent hotel, great location, way overpriced”", "Author": "Summit_Seeker", "ReviewID": "UR68678241", "Content": "I stayed here for a weekend getaway with my wife. The rooms are small (for a \"4 star\" hotel at least) but clean. Very quiet for an inner city hotel, double windows keep out the noise. The free gym and pool are nice perks. No real complaints about the facilities, just the price/rating. I booked through Priceline and snagged a room for $85. After winning I went to the hotel's website and checked what the regular rate is- about $280! So I thought I hit the jackpot by getting it for $85. When we arrived and I saw the room, it was much closer to a 3 or 3.5 star, $150-$180 a night hotel. So I was still happy with my rate, but this is not a 4 star hotel by any means and it kinda put a damper on the weekend. If you stay here DO NOT pay retail price or you will be disappointed.", "Date": "June 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Harbor view room made the trip”", "Author": "luxurylady99", "ReviewID": "UR67945903", "Content": "We went through Priceline and got a great deal. When we showed up, there was a problem with our reservation, but with patience on our part, it was resolved. I think dealing with the staff nicely led us to being assigned a room that overlooked the Harbor. It was beautiful. It was on a lower floor, however, so once the planes started up---pretty early in the morning---we could hear them. But once you were ready to get up, watching them take off and land on the water was awesome. They sort of nickle and dime you here. We wanted wine glasses in the room, and they charged us $5 for them. And if we didn't have such a great room, I wouldn't have been as happy with this hotel. The hallways were fairly beat up, but the rooms were brand new--this was pre-Olympics, it looked like the whole place was due for a makeover. This place was a zoo on Sunday with a whole slew of people staying here on pre-cruise reservations through a cruise company. The lobby becomes a disaster, with everyone downstairs with their luggage. Just know getting your car will take a long time. Not as nice as the Marriott Pinnacle across the street.", "Date": "June 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Switzerland", "Title": "“Great stay during the Olympics”", "Author": "ladyswiss", "ReviewID": "UR67791992", "Content": "Stayed here during the Winter Olympics for work purposes (designated Olympic Family Hotel). Everyone we met was really friendly and helpful and couldn't do enough to make our stay as pleasant as possible. My room had a great view of the harbour and the Olympic cauldron. Loved having the sliding door open to get fresh air but it was a bit too noisy to sleep with the door open. The air con was a bit noisy too. The minibar (empty!) got unplugged on the first day as it also whirred pretty loudly.", "Date": "June 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Seattle", "Title": "“Great Service, initally a little biased but corrected.”", "Author": "tennisbummer", "ReviewID": "UR67315731", "Content": "Booked a great rate through one of the bidding services. When we arrived, they initially gave us a room directly above a band playing for a special event, right next to the swimming pool entrance - however, when we complained, we were promptly given a room higher up. Excellent attitude by the staff, good amenities (pool, workout facility, restaurant, and parking on the premises), and a clean room all added up to a great stay. Could walk to Robson Street. Wish they had a fan in the bathroom.", "Date": "June 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bern, Switzerland", "Title": "“Conveniently located”", "Author": "wucie", "ReviewID": "UR63080969", "Content": "We booked a double bed/harbour view room at this hotel through our Visa reward program. The location was good and check-in was fast. Too fast it turned out because when we reached our room it was facing the city. Back at reception, the employee responsible for issuing the room was apologetic, but her colleague was cold and a touch rude. Our second try revealed a room with a harbour view (and even a balcony).... and twin beds. This time we phoned reception and asked for another room. Meanwhile we kept crossing our bags which where being trolleyed about one step (or rather several floors) behind us. On our third try we finally got the room we'd asked for (though this one had no balcony and was strangely elongated due to the building's weird shape). The bathroom was small but well appointed and clean, and the rest of the room was equally spotless and tastefully done. We found the insulation to be good (there were even two sets of windows) and the bed was very, very large and comfortable, so we both slept well. The hotel is centrally located and not too far from public transport (though a bit far to walk with 4 large bags + 2 carry ons to the Canada Line or Sky Train) and overall the staff were pleasant and friendly (with the exception of the receptionist and one concierge). I'd probably stay here again, though I prefer the downtown Fairmont with its great location, lavish rooms and customer pampering.", "Date": "May 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Snohomish, Washington", "Title": "“Good value and service.”", "Author": "JoshuaandMelissa", "ReviewID": "UR61947401", "Content": "My wife and I stayed here for a quick weekend getaway. Considering the great deal we got through Priceline, the hotel was excellent. We arrived three hours early, and when I asked them if they could check our baggage in so we could tour around Vancouver, they did us one better and got us room without delay. The common areas were very clean and well-appointed. Where the hotel loses clout with me is in the size of the rooms. For a four-star, it seemed the rooms were very small, and the bathroom was downright claustrophobic. The bed was very comfortable, though, and television programming was plentiful (which was nice when we were taking a break from walking around town). In-room coffee was very good. If you want Internet, it is nearly $16 CAD per day! Which was tough, because I had to do some work. To summarize, though, the hotel was excellent for the Priceline bid we put in. I would have been less thrilled if we paid the off-the-rack rate of $170-200, given how small the rooms are.", "Date": "April 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“great hotel”", "Author": "spinach15", "ReviewID": "UR60460462", "Content": "Stayed at this hotel for 3 nights. Got a great deal on priceline. The hotel itself was very nice, clean and the people were very helpful. The city view room was clean and we got early check-in available because we arrived in the morning at the airport and I called in to ask for it. They were very nice to accommodate. Its in a great area, about a 10 min walk to the closest train station and/or to Robson street. Great view of the water if you're eating at the restaurant. The only slight negative is that the bathroom, didn't have a lock or a proper door. It was like a sliding closet door.", "Date": "April 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“Superb Location, Hotel and Service”", "Author": "MAXII", "ReviewID": "UR60351125", "Content": "Very pleasant and helpful check-in. We had the room via Priceline but there were no knowing looks or comments we sometimes get when we have booked using the P/Line bidding system. We had a beautiful 16th floor room facing the front of the hotel. Window opened okay and there was very little noise from the street. Well appointed room, complete with safe. One thing we did notice was that there was only one bath/handtowel/facecloth per person. Not a big deal as I am sure we could have had extra if we had asked for them and they were very good quality anyway. Bed very comfortable. Room very quiet even though it was an adjoining room and one of the nights there were people in the other room but hardly noticeable. Just as we got to the room there was an emergency announcement over intercom made by the duty Manager advising us not to use elevators and that we would be advised accordingly. Little nerve racking as we were up on the 16th floor and then the emergency vehicles arrived. However, Duty Manager made at least two more announcements keeping us apprised which was reassuring. It was a false alarm but all the staff we very reassuring and helpful. Hotel itself is beautiful very spacey, clean and all staff we encountered were friendly and helpful. Great deal for drinking at the hotel itself as there is a different beer and wine special of $5 each every day. Also, free computer use is available in the lobby. Location was perfect, especially if you don't have your own transport. Hotel is within walking distance to buses, cafés, restaurants and all the local attractions. We even walked to Granville Island and though it is a good walk we enjoyed it.", "Date": "April 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Victoria", "Title": "“too bad about the soundproofing”", "Author": "Tony506", "ReviewID": "UR60100540", "Content": "This hotel bills itself as a 4 (and sometimes 5) star hotel depending on which website you explore. In short, while decently renovated with good cosmetics, all the renos in the world can't compensate for a complete lack of soundproofing. We thought the lobby was adequate, the decor interesting although not opulent. Our kingsized room was sparkling clean and had a very comfortable bed. The bathroom door was an odd sliding arrangement designed to minimize door swing and thus allow a king sized bed into a smallish room. That's where the good news ends. The bathroom door affords no sound privacy which could be an issue for friends sharing a room. A bigger problem is that hallway noise transmits so directly through the main door that you would think the people in the hall were standing in the room with you. Between rooms, conversations can easily be heard and we were blessed by next door neighbours who let their baby (after waking crying at 6 am as babies do) bang on a recycling bin or something for the next 30 minutes at 6:30 in the morning. This was not a muted sound. While the drumming stopped the baby's crying, it started ours! Other friends stayed here and commented independently on the same problem with noise and they had a problem with their neighbours leaving the bathroom fan on all night ((presumably to drown out hallway noise?) . Bar food and drinks are expensive relatively speaking, and service while friendly was very slow. However, our friends had dinner in the restuarant (we did not) and said the food was terrific and good value for top dollar. We thought the continental breakfast was good quality although toward the top end of expense.Service was better at breakfast, speed wise. You cannot beat the location of this hotel for easy access to shopping and an inexpensive cab ride to good restaurants and thus my recommendation at all, but the noise thing really is a large problem. If you drive, take the valet parking at 40 dollars a day because finding your way to the self park for 30 dollars a day (OK, 27ish) is a challenge that you don't want to repeat in a city you don't know. I would rate this hotel as a 3 star at most largely because of the noise issue.", "Date": "April 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Gulf Island, British Columbia", "Title": "“A Bargain on Priceline”", "Author": "Dogswood", "ReviewID": "UR59872802", "Content": "We recently had to spend a night in Vancouver because of an early flight out of YVR. We found that it was cheaper staying in downtown Vancouver at a quality hotel than by the airport. Because the new Canada Line runs from downtown to the airport in less than 30 minutes for only $2.50 after 6 and weekends, it's actually easier than waiting for airport hotel shuttles. We paid $70 a night on Priceline for the Renaissance and was pleasantly surprised by the experience. We were there during the last weekend of the Paralympics and yet check-in was quick and the room assigned was roomy and comfortable. Unfortunately, I am a light sleeper and the first room was on a floor with noisy young people running between rooms. However, we quickly got another room without any argument and were told that if we were not happy with it, they would find us a room that would make us happy. It turns out that the second room was behind the elevator shaft so.....we were cheerfully given a third room. Luckily, the third room was quiet and comfortable. Five stars for the front-desk's cheerful and \"make-right\" attitude. Other so-called 4 star hotels should learn from this attitude.", "Date": "March 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Good enough for a priceline win!”", "Author": "Velvalee", "ReviewID": "UR59367293", "Content": "We won this hotel for the first time on a priceline bid, and it was pretty much exactly what I expected based on the reviews here. We got a 12th floor city-view room for $70 on priceline, and since the Vancouver Paralympic Games were just wrapping up that weekend, we thought it was a good deal given the location, etc. It is right across the street from the Marriott, and a block from the waterfront. Check-in was swift, and they took my Marriott card for points against any \"extras\" (no points on hotel rate, of course, since thru priceline). The staff was very polite and professional and made sure no one waited long. The lobby is quite modern and elegant, and previous hints about capturing the free wi-fi in the lobby were accurate; we were able to use it subsequently in our room, though we only tried it once very briefly, to see if it would really work. Simply boot up your laptop in the lobby and sign on to the free lobby wi-fi. A password is provided for accessing it again later, although my machine didn't ask for it when we got up to the room--it just connected directly. It's for reasons like this I don't understand why free wi-fi is not just as ubiquitous as free toiletries and coffee... Self-parking was $29 per day with taxes, and the hotel staff were unhelpful about options for parking nearby. Understandable, I suppose, so do your own research in advance if driving. I read of a $6/day lot nearby in another TA review, but we found no such deal. The room we were given was a double (2 beds), and if not exactly small, it was definitely on the \"trim\" side. Perfectly fine for a couple or pair of friends traveling together, but I would not recommend this room size for a family (unless it was with a single infant). The beds were nicely made up with quality linens and pillows, and while the mattresses were just a bit firm for my taste, my partner (as usual) loved them! I appreciated the mix of foam and down pillows and the lofty comforters. There is a single nightstand between the two beds, which is a bit inconvenient for us, as we had to share a lamp and the electrical outlet for our accoutrements, but I travel with a Belkin Mini (thanks CdnTravelWriter) travel plug which has come in infinitely handy for these situations! Also, the room had a lovely chaise next to the ceiling-to-floor windows, which made quite a comfy reading nook in the mornings. Also, these windows are actually sliding-glass doors that open to a small...well, it's not exactly a balcony, but you can step out between the windows to a railing...I think it might be called a \"juliette balcony\". There are no smoking stickers on the doors, of course, as it is a non-smoking hotel, but I saw people dangling cigarettes above and below on more than one occasion. Even 12 floors up, the noise from the streets is noticeable with the door open, but the chance for fresh air is a nice plus. The room does have A/C, however, and it seemed to work quite well. The room's decor is a bit on the bland side and seems a little mismatched, although everything was perfectly clean and in good condition. There is a large radio alarm clock, though not the iPod kind which most 4* hotels provide these days. However, props for the \"coffee and tea\" box, which was amply stocked with 2 different kinds of tea, regular and decaf coffees, liquid non-dairy creamer, and a variety of sweetners. These are replenished daily and do not come in those ridiculous pre-packed packets, so you can have as many or few condiments in your coffee/tea as you like. I also appreciated that the tiny one-cup-at-a-time coffee maker is one of those newer models where the coffee packet is actually the tray that you slide in for the water to brew through--much less chance of finding a grimy machine or moldy old grounds left in it! The bathroom was on the narrow side, but with plenty of counter space and--much appreciated by the female traveler!--with a mounted, move-able, make-up mirror. Too many newer hotels are dispensing with this luxury, and I mourn the loss! The linens were well-stocked, and while the toiletries were on the sparse side--shampoo, conditioner, body lotion and soap--they are Aveda's Rosemary-Mint, which my partner and I both like the scent of! Also, the shower curtain is on a curved rod, and the tub was what I consider slightly wider than standard, so despite the narrowness of the room itself, the shower did not feel in the least cramped. Plenty of water pressure and hot water, at least at 12 floors up. There was a sliding door closet (the bathroom door was a sliding pocket door) and this design kept the small entryway clear of annoying door jams (get it? lol!). The closet held no robes, but did have an in-room safe big enough for a laptop, plenty of hangars (for us, anyway), an iron and ironing board, and a suitcase stand. The bureau, more functional than attractive IMHO, held a large flat screen TV (I want to say 32\"?), six large, deep drawers for unpacking, and a desk at the opposite end, equipped with a business console--extra plugs, etc. A nice desk chair was also provided. As mentioned by previous posters, noise is in the hallways--particularly by the cleaning staff--is both noticeable and prevalent. The room's door is clearly not sealed--with the lights off, you can see a good inch of hallway light beneath the door, and probably a half-inch around the sides and top. I don't really understand why the hotel wouldn't invest in a bit of stripping around the doors to seal them and block some of the hallway noise, because it would surely make a difference. Also, as reported here on TA, the cleaning staff apparently makes a habit of knocking lightly on all guest doors between 8-8:30 am (at least on the weekends), regardless of whether your \"Marinating\" sign is out. We forgot ours our the first night and were woken by knocking at 8:15; the next night we put out our sign and the knocking came at 8:30. They knock lightly--by no means a pounding-- and move on, but I find most people sleeping in a hotel room will react to a knock on their door, no matter how light! And the staff ensure you don't drift back to sleep by making an astonishing amount of noise as they clean the rooms around you--toilet lids are slammed down, closet doors slammed open and closed, hotel doors knocked against walls, trash buckets rattled against the side of the cart...it's very obvious that the intent is to wake guests and move them along in their day so that the staff can get into the rooms and clean them. I can see the strategy, but if I were trying to have a late, leisurely morning, it would be annoying. However, the cleaning woman we met was very polite and friendly, asking when would we like our rooms to be ready, etc. and she did an excellent job of cleaning and straightening the room. She was generous with replacement items (even 4* hotels are getting stingy about replacement supplies these days!). We did not try the restaurant, room service, or use the pool or business center. I will post room photos when I remember to download them off the camera. All in all, I felt the quality of the hotel for the price we paid was fair, although we've won hotels on priceline with a little more of a 4*-feel in this same price range. The rooms are comfortable and clean, the staff is polite and performance-based, and the location is excellent if you are focused on downtown activities. However, I would not rate this hotel in exactly the same category as the Fairmont or Four Seasons, which priceline does. In fact, of the 4* hotels we've won in Vancouver (we've done this 7 times now), this property was probably our least favorite--not because it's not nice or comfortable, etc, but let's face it--staying at the Sutton is not the same experience as staying here, by a long shot! But that is really a priceline issue, so I won't belabor it. I would recommend this hotel as part of an $80-or-less 4* bid on priceline; I would not recommend it to anyone who specifically wants to book a 4* hotel in Vancouver at the regular rate, as there are better values at full price.", "Date": "March 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cockeysville, MD", "Title": "“Olympic stay enjoyable!”", "Author": "ajgeb", "ReviewID": "UR57963848", "Content": "I and a friend stayed at this hotel for the first 11 days of the 2010 Vancouver Winter Olympic Games. It is not possible to discuss value and/or price, because these are always way different during the Olympics in any city. However, what I anticipated to be a 3-1/2 to 4 star hotel was surprisingly comfortable, with overall pleasant and excellent service, and all that during the most frenetic time any city is likely to see. The staff were friendly and helpful. The room was cleaned and straightened at least twice a day, and if we happened to be in the room, housekeeping made it a point to return later. The room was satisfactory for its purpose. In what was supposed to be a twin bedded room, the beds were actually larger doubles, making sleeping that much easier. Although the bathroom was small, it was evident that it had recently been refurbished. The furnishings were new, but fairly plain. We heard no noise from next door, or the hallway, and often slept with the window open to cool off the room (it was overall quite warm in Vancouver, and Canadians seem to crank the heat up more than we do at home). The hotel restaurant was surprisingly good, with an excellent buffet breakfast and a couple of dinners that were, once again, surprisingly good with fine service. I read many posts on Trip Advisor with respect to this hotel, and not all were positive, so I was somewhat concerned about our stay. But all in all, it turned out to be quite pleasant and satisfactory during what must be the busiest time ever for any hotel.", "Date": "March 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Boucherville, Canada", "Title": "“Pretty nice”", "Author": "Goulz", "ReviewID": "UR51016633", "Content": "Stayed at the Renaissance Harbourside for three nights. I had a 15th-floor room with one king bed. Room had lots of space, with a couch and plenty of storage. Great showerhead. Had buffet breakfast. Eggs benedict were delicious, along with waffles and french toast. Service was excellent, and housekeeping was very efficient. Only bad note goes to the fire alarm with went off two nights in a row, making the elevators work on and off.", "Date": "December 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Iqaluit, Canada", "Title": "“Very nice hotel”", "Author": "sir67", "ReviewID": "UR50715204", "Content": "The room was very nicely appointed. The King bed and eight pillows were very comfortable. The large LCD TV was nice to watch. But by far the best part of the room was the harbour view. By all means, if you stay here, get a room 11th floor or higher with a harbour view. The balcony with glass exterior was roomy enough to sit on and enjoy the evening. A lounge and restaurant on the lobby floor serve food and drinks, however all I tried there were the drinks and some bar food. All of it good if just a tiny bit on the pricey side. All of the staff took genuine interest in helping.", "Date": "December 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Seattle", "Title": "“Great hotel, a few minor complaints”", "Author": "HelloFromSeattle", "ReviewID": "UR50359383", "Content": "We stayed here over American Thanksgiving after getting an excellent price on a room. The front desk staff was extremely friendly and useful, recommending a great Sushi place in the neighborhood. The rooms were clean and the fitness center/pool area was quite nice. The only downside of this hotel was the agressive cleaning staff. They started coming by around 8am, and either knocked on the door, or in a couple of cases just walked right in while we were in the room. Nothing that the door lock and Do Not Disturb sign couldn't fix, but slightly annoying none the less. Parking cost about $23CAD/day if I recall correctly, and the lot itself seemed a bit dodgy, but we didn't have any security issues.", "Date": "November 30, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Calgary", "Title": "“Great price on priceline, 4 star”", "Author": "Bobbob999", "ReviewID": "UR49717933", "Content": "Overall I was quite impressed with this hotel, especially for the incredible priceline rate. In my opinion, this is a flat 4 star hotel. It's funny, when I read these reviews before staying in a hotel, I find I'm looking for things. There were a few things I did notice that could have been better, but they would not impact my choice to stay at the hotel again. For example, yes, the windows, doors, and walls seem thin, in other words you can hear sounds from the hall, and the street. Internet is not free, yes, you have to pay, oh well, I paid less than half the rack rate for the room. The parking, it is NOT hard to self park, why not save the $6.00 per night and self park it. The lot is next to the elevator, very easy and worth the savings. I was over charged for internet, but they fixed it right away, not sure what happened there. Ok, one thing that I did find strange. The maid, came in my room with a very quick knock at 4pm on two consecutive days. The second time she just looked at me and said, is everything ok.... umm ya, why are you in here. I probably should have reported this, but I tend to look for the good in people, hopefully it was a mistake. The room was already clean by the way. Anyway. Great deals i n the restaurant, clean, attractive looking lobby, great beds, great location... come on people, walk two blocks and you're in the hear of it. And you get the waterfront as well. Location is perfect. I would stay at this place again, but would liekly look elsewhere if I had the pay $200 plus a night. G", "Date": "November 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Tampa, FL", "Title": "“Wonderful location, but a bit noisy”", "Author": "LaursieBug", "ReviewID": "UR49421600", "Content": "We stayed 2 nights with our 2 year old. We booked through priceline and got a fabulous rate, and ended up with a king harborview room. We were impressed with everything about the hotel, except the noise from next door. We could hear every conversation taking place in our neighbors room, which kept us up half the night. Otherwise, we couldn't have asked for a better stay.", "Date": "November 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Seattle", "Title": "“Comfy beds!”", "Author": "seattledaisy73", "ReviewID": "UR49366110", "Content": "While this location is a little off the path of the hustle and bustle of the city, it was a great place to stay for the weekend. The beds are amazingly comfy and the staff was very pleasant. The views are great both of the city and the harbor. It was a little bit of a walk to Robson and the shopping district, but overall I would stay again.", "Date": "November 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Victoria, BC", "Title": "“Clean and comfortable”", "Author": "sisabell", "ReviewID": "UR49292157", "Content": "This is the third time we have stayed here this year, always after winning a 4 star downtown Vancouver bid on Priceline. This hotel is very clean, and provides a good basic room. The bathroom has some nice touches like the curved shower rod, and the linens on the bed are excellent. I would say the only downfall would be the price of the wifi (15 per day) and the parking (23 per day), although these are pretty standard across downtown Vancouver hotels. The location is excellent, and the staff were friendly and efficient. Pass on the restaurant and room service... highly overpiced for what you get... there are so many good restaurants in Vancouver I wouldn't waste my time again at this restaurant.", "Date": "November 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "State College, Pennsylvania", "Title": "“Great location and view”", "Author": "ellenStateCollege_Pa", "ReviewID": "UR49242881", "Content": "Had a short layover in Vancouver but did not want to stay by airport, took Skytrain, Canada line from YVR to Waterfront stop then 6 blocks to Hotel. Would recommend the Skytrain, $2.50 cents, easy and quick. Less than 30 minutes. Hotel is close to everything with nice views of Harbor. Club Floor was great. Room on 17th floor, faced harbor w/ small balcony area...odd just opened up to outside area w/ another window, can't sit out there. Room was spacious, clean and looks renovated. Club lounge faced city, nice offerings. Had dinner in restaurant facing harbor, safe bet when traveling alone. Served fry bread and homeade tomato jam and gave you recipe, nice touch. Great drinks and food, good price. Staff very helpful. Have to go up some steps to lobby from street, hard w/ bags but staff were quick to take bag up for you w/out asking. Excellent place to stay in my opinion. Free internet access in Club lounge was great b/c I didn't take my laptop w/me.", "Date": "November 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Vancouver", "Title": "“I liked it!”", "Author": "wrldtvler", "ReviewID": "UR47342245", "Content": "I booked this hotel through Priceline for $64 a night. What a great deal! The hotel appears to be recently renovated and everything worked out well. I saw that some people were complaining about the cost of parking or the internet, but if they had a clue about anything, they would know that all of the comparable hotels in Vancouver charge the same prices. (Hyatt, Delta, Marriott, Sheraton) and I have stayed at all of them. This hotel is right there in the same class. My complaint would be that the hot tub is tiny, there was a family in there so we went back to our room watched a movie instead. The gym was big though. Also there was an alarm that went off in one of the rooms for 45mins, we called down and someone came up to switch it off within 5minutes.", "Date": "October 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "toronto", "Title": "“Great hotel, great views”", "Author": "bliss24", "ReviewID": "UR46795594", "Content": "We stayed at this hotel for a conference. We had a harbourside room, and the view was breathtaking. The room is very clean, comfortable and modern. The fitness facilities are great too, very well equipped, and little touches like fresh fruit in the fitness center are the kind of attention to detail that make a hotel stand out.", "Date": "October 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Silicon Valley, CA", "Title": "“Gorgeous view, great hotel in downtown vancouver”", "Author": "3ecrm", "ReviewID": "UR46704917", "Content": "Renaissance Vancouver Harborside is a great hotel for stay in this dynamic city, 2 blocks away from shopping, restaurants, museums and the harbor. This is our 2nd time staying at this hotel, both times, we got a harbor view room on upper floors on the corner, the view is simply gorgeous. The hotel staffs are very friendly and helpful with suggestions on sightseeing, restaurants and cultural events. It is a pity though that more and more of the views are obstructed by the high rising condos between the hotel and the harbor.", "Date": "October 13, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Francisco", "Title": "“Gorgeous Views, Exceptional Service, Good Location”", "Author": "jakelee", "ReviewID": "UR46241618", "Content": "The Renaissance was amazing. Gorgeous views if you're facing the harbour and up high enough. The staff was incredibly friendly and took care of our needs. You can tell the building is a bit older, but it's still quite nice. The parking garage is sketchy, smelly and confusing to navigate. If you've got the money, just avoid self-park and valet it.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Las Vegas, NV", "Title": "“Overall great stay”", "Author": "PhiPsi32", "ReviewID": "UR45547033", "Content": "The accommodation is very good, but you're paying for it. Even with the group rate I paid $190 (CAN) plus room tax and VAT. However, I had a very nice harbor view. In room internet is $16 a day for 12pm-12pm access (not even consecutive 24hrs). There are two computers in the lobby with free internet for guest use. There are a few coffee shops and one restaurant nearby with free WiFi (if you have a laptop computer). Otherwise, the rooms are spacious and well furnished. The staff is very helpful and can provide good info for first time visitors. There is a very nice upscale market roughly one block west of the hotel called \"Urban Fare\". It's a good place to buy drinks and snacks for your room and also a pleasant venue for a casual lunch. There are several cafes and pubs within walking distance. Two blocks east on Hastings, you'll find the Elephant and Castle pub which shows Setanta Sports (for the European football fans). There is ample food, drink, and shopping within walking distance. Check out the travel guide provided in each room. At around $200 a night, free internet would be a welcome perk. Otherwise, this is a great place to stay in Vancouver.", "Date": "October 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Liberty Lake, Washington", "Title": "“Service was Outstanding”", "Author": "stevetanyaTexas", "ReviewID": "UR45337122", "Content": "We came to Vancouver to celebrate my birthday with our 3 children. In the beginning, not everything went smoothly. The person checking us in wasn't very personable. I'm a Marriott Platinum and he didn't acknowledge that. However, when I let the front desk manager know the feedback, they were very appreciative and sincere. The next thing was that my wife took the kids to the executive lounge for some breakfast. There she was not treated very warmly and was in fact scolded by the associate for allowing our 4 year old to stand with our 13 year old as my 13 year old served herself some breakfast. Again, I called the manager, and they were very sincere and apologetic. I always appreciate sincerity. After that, service kept getting better and better. We went to the executive lounge after a day of sightseeing and we brought a bottle of my wife’s favorite wine. The associate working told us politely, that even though we are not allowed to bring our own wine, she would open it for us and pour us a glass…but wanted us to know the rules in case a manager showed up. She was great. The next morning at breakfast, I tried to order a Bloody Mary for my birthday breakfast…not caring that it was 9 a.m. I found out 2 things, #1, it’s called a Caesar in Canada, and #2, they don’t serve until 11.m. However, the waitress came back a few minutes later with a candle-topped chocolate cake slice with “Happy Birthday” written in decorative chocolate. That was wonderful. Then, the manager sent up a bottle of wine and some snacks to our room during the day with a Birthday card. We arrived back at our hotel to find this pleasant surprise. The Concierge was friendly, knowledgeable and happy-go-lucky. She helped us out with a lot of information and reservations. All in all, I would recommend this property to any of my friends.", "Date": "September 28, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Toronto, ON", "Title": "“For the price, stay elsewhere”", "Author": "Ontariogirl", "ReviewID": "UR43764696", "Content": "I stayed here one night in September and overall I was very disappointed with the hotel and considering the price, I would have preferred to stay at the Pan Pacific or the Fairmont. Negatives: The bathroom door is basically a sliding closet door and ours actually had a shoe kick in it. The tub in our room did not drain properly, I ended up showering in another room. We tried to use the indoor pool and hot tub but didn't even get in. The pool looked as though it had not been cleaned, there was hair and debris floating on top. We went to use the hottub and there was a ring of dirt around the tub. When the jets started, it began foaming pretty bad. It was very gross and I was afraid of getting a skin infection if we had went in. The fan in the room was noisy and kept us awake most of the night and there was big gaps around the door that led from our room into the hall so we had light shining in all night too. Positive: The staff gave us free breakfast buffet for all of the inconvenience, which was nice, but the hotel was still a waste of money as far as I was concerned. Restaurant has a fantastic view. Not a good experience.", "Date": "September 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Boston", "Title": "“Could not ask for more.”", "Author": "abenakee", "ReviewID": "UR43679667", "Content": "Three wonderful days at the Renaissance Vancouver Hotel Harbourside. The view of the harbor from our room was outstanding and the maid service immpecable. Though a busy hotel, we never felt rushed or forgotten. The service from the front desk, concierge, diningroom and house staff was flawless. The bellman were very helpful with transportation and restaurant and sightseeing recommendations. The Renaissance should be on everyone's list when visiting Vancouver, a wonderful city.", "Date": "September 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Washington, DC", "Title": "“Beautiful Views, but...”", "Author": "Zaw50", "ReviewID": "UR41716702", "Content": "The hotel offers beautiful views of the waterfront and the rooms are spacious and relatively modern. I found the staff to be less than friendly and not very accomodating, particluarly the staff in the restaurant. If traveling for business, this hotel is not a great option. Lack of a business center is problematic if you need to print anything. Hotel turned former business center into a small shop leaving guests forced to share two computers and one printer located in the lobby - which means you are often waiting on someone to finish checking email.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Boston, MA", "Title": "“Customer service and room quality poor”", "Author": "MollyMolly", "ReviewID": "UR40625350", "Content": "I've never been motivated to write a negative review of a hotel before, but if you are expecting minimal customer service and a decent room, don't stay at this hotel. When reviewers complained about outdated decor, that wasn't particularly worrisome, but I should have paid attention to previous complaints about poor customer service. Of far more of concern than the 80s-style decor, chaotic and insufficient lobby and the hot tub covered with a layer of scum, the customer service was nonexistent. Our room was dark with a slit of a window that looked out on the backs of bushes half a level up from our room, so it felt like we were in a basement. The beds were so crammed in that the desk chairs couldn't fit at the desks, so they were weirdly placed in the corners of the room. Free Internet was only available in the lobby, but when I took my laptop to the lobby, there were only a few occupied chairs and ottomans available to sit in -- I could sit in a chair in an otherwise empty lobby lounge, I was told, only if I bought a drink. Two different staff people told me \"you can go sit on that ottoman\" the only unoccupied space in a lobby which was always packed with people loading and unloading onto tour buses. I never saw the front lobby space without hundreds of pieces of tour luggage crammed in it. Since it was rumored that the hotel had views of the harbor, I took my laptop out onto the patio. There was a huge expanse of patio without chairs, and one area for restaurant patrons -- like the \"free\" Internet, if you wanted to enjoy the view, there was no option but to pay. To add insult to injury for this horrible stay, I had reserved via the Marriott web site and used a code to get a special rate. I had called the hotel directly to make sure they had the rate noted -- they didn't, but assured me they would. When I checked in, the front desk staff tried to charge me a different rate. When I asked them to look again, suddenly they found the note in the reservation. The entire place was run so unprofessionally, and the staff were so openly sullen and bored, I am shocked that this hotel is part of the Marriott brand.", "Date": "September 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Somewhere in the Midwest", "Title": "“Loved it! Great location and views”", "Author": "HappierTraveler", "ReviewID": "UR40218010", "Content": "Stayed here pre-cruise (out of Ballantyne) on points. We walked from the new Canada Line and was a little more of a hike than we thought, but if you are active, it should be fine. Checked in to find that we had a room with gorgeous view of harbor, Stanley Park and a little glimpse of the Lions Gate bridge. Loved the decor in eclectic reds, golds and blacks. Room was clean and beds were comfortable. Had the buffet breakfast in the morning and it was VERY good and the setting was so beautiful. We walked to Granville Island from here (quite a walk) and Stanley Park to rent bikes. Would stay here again in a heart beat! Great way to start a phenomenal vacation.", "Date": "September 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "madison, wi", "Title": "“Nice Hotel and Great views of harbour”", "Author": "WiMadcitytraveler", "ReviewID": "UR39723940", "Content": "Hotel was very nice with great view of harbour and float plane pier. Had a deck to sit out and eat or have a drink and close to boardwalk. Highly recommend, try and get a room with view of water.", "Date": "September 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“Wonderful location and Staff”", "Author": "GibbsvilleGirl", "ReviewID": "UR39172043", "Content": "We spent 5 nights at the Renaissance and enjoyed our stay immensely. The friendly staff really add to the experience. They could not have been more helpful particularly the doormen/bell staff and the waiters and waitress in the restaurant. The rooms may be on the small side but are lovely with more then enough space for two adults. The large windows provided great views of the city. Most rooms have a sliding glass door with a Juliet balcony. We enjoyed the fresh air this provided but may have felt differently if traveling with small children. The location is perfect for touring this beautiful city - morning walks along the sea wall are wonderful. Plenty of options in the neighborhood for breakfast. Yes, the hotel restaurant is expensive but the dinner we had there was very good. The fitness center and pool area are also well-maintained and spacious. We did not experience any of the problems others mentioned with housekeeping. Our room was always spic & span clean and had a full supply of towels, shampoo, etc. Plenty of public transportation nearby and if you are a tourist the hop-on/hop-off bus stops right across the street. Enjoy your visit to beautiful BC.", "Date": "August 29, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "island bound", "Title": "“accessible rooms ok as long as you don't need much space”", "Author": "april61997", "ReviewID": "UR38917549", "Content": "was here for 3 nights mid- Aug. Great location. Expensive food  $23 plus for bacon and eggs??  Booked a 2 bedded assessible room and was told it was confirmed. When we got there I was informed it was either 2 dbl. beds with no assessiblity or 1 with a king bed and a chaise with assessiblity. I chose the king bed (I was with my 82 yr old mom and wheelchair bound sister. There is only enough room in the 'assessible' room to get the wheelchair in. Not enough room to get the chair around the room. The bathroom has grab bars at the toilet and in the shower/tub (if you need a roll in shower you are S.O.L)...Had to call twice for the extra bedding so I could sleep on the chaise . When I asked where a certain restrurant was I was told it just just a few blocks away (it was 8 blocks UP HILL and I was pushing a wheelchair).  You get 1 towel per person, some days we had shampoo/conditioner and lotion, other days we had no soap ,1 shampoo and 2 lotions. The bed  I was told was comfortable. I was woken up one night at 3am from the alarm clock in some other room. If you are not on the harbor side you get street noise till 2am.", "Date": "August 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "MN", "Title": "“Excellent Hotel and Location”", "Author": "MN_GIS", "ReviewID": "UR38495342", "Content": "We stayed three nights, We had an awesome view of the harbor, the room was perfectly sized. We had asked for a fridge and it was brought to the room in 10 minutes. The room was very quiet, never heard a single thing. The parking is very secure and you have in and out rights. The hotel is located in an excellent location. You can walk to Stanley Park and take the park shuttle, Robson, Gastown etc. The staff was very friendly and helpful.", "Date": "August 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "JKMillerInc", "Title": "“NOT a four star, but you can see through all four sides of your door!”", "Author": "JKMillerInc", "ReviewID": "UR38086845", "Content": "My husband and I booked this through priceline, thinking we'd be staying at a four star hotel. We were certainly impressed with the name, delighted by the deal and looked forward to the location. Upon arrival, the lobby was chaos with luggage strewn everywhere for a Coors Light/Maxim event...it felt like a frat house. Reception was chilly and the only time the desk clerk smiled was when she offered us a room with a water view for an extra $30 per night. Seriously? We went to our room to freshen up and were nonplussed. It was fine, but certainly not four star. The chaise lounge was stained, the desk was dusty and the bathroom was cramped at best. We took off to see the sights and returned later that evening to get ready for bed. Well...we didn't notice this during daylight hours, but upon closing our room door and dimming the lights, we noticed that we could see clearly into the hallway via spaces between the door and doorjamb. Not just light, but actual people passing by! On all four sides! If that wasn't enough, this also allowed quite a bit of sound to travel through to our room, and we heard every step, cough, door click, etc. all night long. We were SO disappointed! Good thing it was only one night!", "Date": "August 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Great Hotel”", "Author": "sparky1978", "ReviewID": "UR36400883", "Content": "The location is wonderful, the hotel is nice, clean and beautiful. I thought the service was excellent from the Concierge to the front desk. I work for Marriott and they didn't know it, but still went above and beyond. The fitness equipment could use some maintenance. I would definitely recommend eating breakfast and the Urban Market next door. Amazing omelets (plus potatoes and toast) for $10.00! We ate there everyday. You can also pick up sandwiches and snack items if you hit the hiking trails (Grouse Grind is a must if you want a workout).", "Date": "August 1, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Seattle", "Title": "“Good location, nice pool, but poor customer service”", "Author": "flycake99", "ReviewID": "UR35946110", "Content": "This hotel has a great view and is located in a continence location. The pool and gym are very nice. The room is not too spacious but it is still a good size. The bathroom is kind of small but at least it is clean. The parking is terrible and super expensive. The customer service is poor. Our bath tub didn’t drain very well the first night we stayed. We told the front desk in person and asked them to fix it the next morning. However, the bathtub still did not drain well the second night when we showered. Apparently they did not take care of the problem at all. I called the front desk about this problem again, but they told me there was no engineer stand by in the evening. However, we can just let the water over flow. I really felt sorry for the house keeper. This hotel really needs to improve their management. We got a good deal from Priceline so I was guessing that’s why we got a room with a bad tub. They definitely discriminate Priceline customers. Overall, the stay was not too bad for the price we paid.", "Date": "July 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“A great hotel with a fantastic view”", "Author": "tikimermaid", "ReviewID": "UR34768555", "Content": "We really enjoyed staying at the Renaissance. I had booked the hotel through Priceline and got a fantastic deal. When we arrived, I asked for a double room, as I was traveling with my husband and son. They were sold out but they offered me a bay view room on the top floor with an extra bed at no addtional charge. The view was absolutely fantastic. The room was generously sized and looked to be recently updated. The outside of the hotel looks a bit tired but the inside is lovely and the service is incredible. I would definitely stay there again. If you are going on a cruise, the terminal is within walking distance from the hotel.", "Date": "July 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Muenchen", "Title": "“Great Service, excellent place to be”", "Author": "Sese74", "ReviewID": "UR34119497", "Content": "High End Hotel with excellent service, great food and incredible view of the bay. It is located near the floatplane \"airport\", which doesn't cause any trouble due noise. The location of the hotel between Stanley Parc and Gastown makes the exploration of Vancouver Downtown easy, by bike or by foot.", "Date": "July 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "SalesKing", "Title": "“Great Place to Enjoy Vancouver for Business & Pleasure”", "Author": "SalesKing", "ReviewID": "UR33835773", "Content": "The hotel was suggested to me by our Canadian Distributor. Upon check-in I noticed the Maxxim Coors Golf Modeling tryouts. Hundreds of beautiful girls vying for the opportunity to represent Maxxim and Coors were in a part of the lobby. Additionally, the hotel is located walking distance to the water and Stanley Park as well as other nightlife locales. It is also walking distance to the Convention Center where my distributor, colleagues and I participated in the Canadian Anesthesia Society Meeting; our main reason to be there. The Concierge Alex (female) is outstanding. I had an urgent medical need last Sunday and she coordinated the entire Medical Office Visit. She is great and is my hero who is a true asset for the facility.", "Date": "July 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "phx", "Title": "“Great room in a very good location - no frig”", "Author": "worldgypse", "ReviewID": "UR33773084", "Content": "Stayed using points. Very clean with very nice bedding. Great shower head. Surprising quiet for a hotel of this size. Very friendly/acknowlegeable staff. Free internet (not so typical for high end hotel which usually charges for internet). Only negative is no refrigerator in room. Good location to Stanley Park, Grouse Mountain, and other downtown activities. Parking for a fee ($26 for 24hrs self park, slightly more fo valet)", "Date": "July 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Cypress, Texas", "Title": "“Quirky hotel - good location but past its prime”", "Author": "jbtexas", "ReviewID": "UR33390410", "Content": "We spent four nights at the Renaissance on a recent vacation in Vancouver. Overall, we had a good experience at the hotel, but could not quite get past some of the hotel's quirks. We ended up in a harbour view room. This after an intervention by a very helpful bellman, who asked my wife how our stay was shortly after we checked in and were \"upgraded\" to a city view room to be given a king size bed. Note that the harbour view room also had a king size bed. The harbour views are excellent - or at least were from our room. It appeared that the high rise condo across the street could block views from some rooms. There are two sets of sliding glass doors which both allow you to open the windows and / or block out the seaplane noise. With the windows closed, the room is very quiet. The room itself - as noted on other reviews - is quite small. The closet area is not very deep. Hang a shirt or jacket on a hanger in the closet and you'll have to turn it sideways to close the closet door. There is a very modern set up for accessing the internet and displaying your PC on the flat screen TV in the room. We did not try this set up. Internet access in the room costs $16 CDN per day. The bathrooms were small, and the light switch was a bit of a reach around the corner on the outside of the room, if you forgot to turn on the light before entering. The bathroom servicing was one of the quirks. Most hotels will leave 3-4 bath towels for a room with two guests. Consistently we were left only two towels. I don't know if this was conservation, hotel cost saving measures or just a quirk of the cleaning staff on our floor. The biggest quirk by far is the elevator system in the hotel. The doors close very quickly and on arrival, I actually rode the elevator up and back down and up again from the parking garage as by time my wife got off the elevator, the doors closed before I could get off. As noted in prior dated reviews, a room key is needed to operate the elevators to guest floors. I had several interesting experiences as the elevator began moving before guests could punch the button for their floor. There is a very large pool / fitness center area on the fourth floor. This would definitely be one of the pluses of the hotel. Upon check in, no recognition was given of the fact that I was Marriott Rewards Silver Elite status. Given the large number of tour groups staying here, I would have to think that not many Elite members stay here, although I may be wrong. At any rate, I was not made to feel welcome or in any way special because I was elite. This was in contrast to the helpful bellman, who was very specific in his recognition of our elite status (different marking on room key). The hotel's parking garage is a maize of underground twists and turns, including a few blind turns. Should you self park, drive slowly and carefully. Also, it is easier to turn right out of the exit onto Cordova than following the main signs to exit onto Hastings. In light of recent notoriety about gang crime in Vancouver, I would say that the hotel is in what appears to be a good location. A three minute walk will take one to the Seaside bike and walking / jogging trail which extends around Vancouver's beautiful waterfront and includes the walk around the seaside perimeter of Stanley Park. I did the walk from the hotel, around Stanley Park and back via Denman in two and a quarter hours. There are suggested nine and four mile walking / jogging routes on business card sized cards available in the fitness center. Going east from the hotel, it is a short walk to Canada Place, the new convention centre, and Burrard St. Burrard Street is where to go to get most city buses. The Skytrain can be boarded at the Waterfront Station opposite Canada Place. Tip: if you want a Translink day pass, they are sold in the city's visitor information centre opposite Canada Place (the place listed on the Translink web site in the 1000 block of West Hastings as selling transit passes did not sell day passes - at least not the day we tried to buy them there). The appearance of the hotel from the outside is definitely showing signs of age - but that may be in part due to the contrast to the newness of the hotels and condos surrounding the hotel. On the whole, we had a good stay, but on the whole I would most likely choose another hotel on my next visit to Vancouver. And I do want to acknowledge that despite some issues with service (towels, check-in), the helpful intervention of a great bellman really made our stay.", "Date": "June 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Phoenix", "Title": "“Excellent views of the Harbour”", "Author": "guienriquez", "ReviewID": "UR32132138", "Content": "Me and my partner stayed there one night after getting off an Alaska Cruise. It's very close to Canada Place where ships disembark, so we just walked about 5 minutes. The outside of the hotel looks discouraging, but once you go in you see that the hotel is very nice indeed. The rooms were very spacious and had a beautiful view of the harbour. The decor is bright, airy and modern without being to silly. There is not much happening on the harbour front area, but this is a good quiet location and you can walk to Robson or Davie streets in about 15minutes. Would definitely stay here again!", "Date": "June 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Boston, MA", "Title": "“Good location but poor physical plant and signs of high crime”", "Author": "andrew02459", "ReviewID": "UR31499287", "Content": "We stayed here three days midweek in mid May. As noted elsewhere the lobby and bar areas were under construction (not that we saw anything being done). The reg. desk was a tight fit for three employees but usually only two were there: long, long lines almost always for service. Given the lobby was large (think high school basketball court on two levels of marble) it was empty aside from a small bell captain station, the reg desk and the business area. It could be a full refit will address this but certainly whoever was in charge of interim planning should have allocated space better...this is one large hotel. The business centre area had two computers for guests..way insufficient for the hundreds of rooms in the hotel. The computer in the concierge lounge upstairs had to be \"opened\" by an employee..seemed really to be there for their use. All elevator trips had to be done with your room key activating the elevator and the rooms on the concierge floor where we were had large metal panels inserted covering the jamb where the latch was to prevent jimmying...made us very aware there must be some crime (papers there were calling Vancouver the new Columbia re: drug wars and gangs). The jacuzzi had hard blue mould growing on it and the lockers for the pool looked like veterans of a high school: most of them were well hammered, doors bent out of shape. There was a plentiful supply of new looking exercise machines. The actual room (again on the concierge floor) was quite small altho with a good view of the harbour. The hallways were done in a red/yellow/orange/black modern paint/carpet garish swirl...hard to take first thing mornings and just plain ugly at other times. The hotel seemed popular with Japanese families: loads of little kids running around. There was WiFi but it cost $16/day. This was more like a Courtyard than a Renaissance level Marriott.", "Date": "June 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "British Columbia", "Title": "“Beautiful Hotel”", "Author": "Soonie68", "ReviewID": "UR31306425", "Content": "This is a beautiful hotel to stay at with wonderful rooms especially facing the harbour. Very nice beds with high quality linens and duvets. The restaurants are not great, but with so many great choics in the area, it doesn't matter. Nice lounge. Great staff.", "Date": "June 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great Vancouver weekend bargain”", "Author": "PlannerGeek", "ReviewID": "UR30853593", "Content": "Spent a get-away weekend in Vancouver...as usual on weekend trips, we chose our hotel via Priceline, and once again had good luck. 3 1/2* and $65 got us the Renaisance Vancouver Harbourside. The Ren is an absolutely standard downtown business traveler hotel. Room was small but comfortable, very clean, quiet, and acceptible in every way. Not much character, but who cares, we weren't in Vancouver for the hotel. Parking is limited downtown...you can park yourself in the underground lot for CAN18 / day, which is CAN10 cheaper than at the hotel. Just keep going west on Hastings past the hotel, and the entrance is well marked at the end of the block. Overall, hotel location is good...it's in a stretch of hotels and office buildings along the waterfront, maybe 4-5 blocks from Robson shopping, and walkable to Gastown, Yaletown, and Stanley Park.", "Date": "May 26, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Seattle, Washington", "Title": "“Expected A Little Better”", "Author": "rjc260", "ReviewID": "UR30559286", "Content": "Although this hotel has a great central location, there were several drawbacks including very small rooms (especially the bathrooms) and construction in the lobby. The rooms appeared to be recently renovated but we found it to be very tight for two people. The bathroom fixtures were fine but nothing special. We did have a nice view of the water however. As mentioned, there was construction in the lobby and it was an uncomfortable place to work on the internet (to avoid the steep browsing fees in the rooms). The business center had one terminal that was occupied and the concierge floor lounge was closed over the weekend so it was a small hassle to do some work. ATM machine was also broken so we had to walk down the street. The health club is very spacious and has a nice pool and hot tub but the room still has a cicra 1970s feel. We didn't take advantage of the restaurant but it at least appeared to have a nice ambiance. We were also recommended a \"romantic\" restaurant by the front desk..not a bad place but it was packed with large, loud groups of drunken 20 somethings where you had to shout to be heard three feet away (confirmed by online reviews we unfortunately read after the fact). Otherwise service was decent.", "Date": "May 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Gold Coast", "Title": "“Top notch service and incredible art!”", "Author": "Alice_Springer", "ReviewID": "UR25893511", "Content": "I travel a fair bit and am experientially weathered with the offerings of various hotels around North America in particular. I stayed at the Renaissance Vancouver and was initially put off that they were undergoing renovations to their lobby. However my chagrin soon changed when I was attended to chivalrously and promptly upon my arrival setting a standard that was maintained througout the entirety of my stay there last week. I spent a great deal of time at the entrance admiring the awe-inspiring art pieces that they have on the walls. I have never seen anything like the illuminated art work displayed. My inquiries revealed that Ron Sombilon, a local Artist, is the exhibitor. I commend wholeheartedly the Renaissance Vancouver for recognizing and nurturing their local talent. I will definitely make this hotel my first choice on my next trip to Vancouver.", "Date": "March 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "2", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Beautiful view and location”", "Author": "bab", "ReviewID": "UR25720515", "Content": "Beautiful hotel. Comfortable bed. Very modern and well equiped fitness center. Staff attentive and willing to help you with anything. Ask for a room away from the elevators as thy are very noisy. Hotel well located for visits to Stanley park, the Aquarium, shopping(Robson street). Breakfeast is a little expensive as the parking and the internet access from the room. Overall, nice hotel with incredible views.", "Date": "March 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Seattle", "Title": "“A Nice Remodel”", "Author": "DaveFrancis", "ReviewID": "UR25163822", "Content": "I reviewed this hotel before, and found a few issues, but things have changed a bit....We stayed here with some friends during a long weekend and found the room upgrades to be very nice. Yes, it is the same hotel that now has a building blocking those wonderful harbour views, but it is still a great place to stay. We called while waiting at the border, and were given the internet price right away with no dickering. We were greeted at check in with the usual warmth we have always found at this hotel. The big suprise was the room remodels. They have done a nice job. I also think it is worth mentioning the restraunt downstairs. If you want a truly hassle free, great breakfast, thats the place. I usually stay clear of hotel eateries, but the staff and good food make it a real bargain....Kudos to you Marriott. You have dazzled me again...", "Date": "February 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denali National Park and Preserve, Alaska", "Title": "“Excellent chioce”", "Author": "kevin_from_AKandCO", "ReviewID": "UR23813497", "Content": "Great place. All staff we interacted with were welcoming and friendly. Room was beautifully decorated, modern, and very clean. Our visit started off nicely when we arrived at 10am, expecting to be able to just drop off our luggage until we could check in later. Without us asking, they quickly put us into a room. We had a great view of the city and the harbor, which made for nice viewing at sunset and sunrise. The location is great, as it is close to much of the action in Vancouver. Stanley Park is just a few minutes' walk away. Dinner at the restaurant was good, though like most hotel restaurants, pricey for what it was. A nice touch was the wheelchair the hotel has to loan guests (no charge), as my wife had just broken her ankle a week before. While the wheelchair was hardly top-notch, it did greatly increase our mobility. I recommend this place.", "Date": "January 23, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "alberta", "Title": "“loved the views, bedding is wonderful”", "Author": "jocelyn5911", "ReviewID": "UR22456133", "Content": "this is a great, beautiful hotel with a great location. m husband and myself, with our teenage son, wanted a budget hotel with all the amentiees so when ama offered us the harbourside for 117.00 per night including all taxes we jumped for joy! this enabled us to have two rooms for all of us to enjoy and relax. ongoing pre-olympic renovations were a daily ocurance but did not disturb us at all. we were on a higher floor with unobstructed views coal harbor, walking distance to shopping and stanley park. we spent our mornings drinking coffee from room service watching the harbour planes landing and fed sea gulls from our balcony. the longest we waited for room service was 15 minutes, excellant by our standards. the staff sent up chocolate covered strawberries and a hand written note wishing u a happy 20th anniversary. the valets provided us with driving directions and ideas of things to see and do locally. i highly recommend this hotel and will stay here again. we travel to vancouver frquently for quick romantic week long getaways to escape the alberta snow.", "Date": "December 4, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Edmonton, Alberta", "Title": "“Disappointment at the Renaissance”", "Author": "Paulyester", "ReviewID": "UR22444761", "Content": "The hotel is well located close to the harbour, shopping on Robson street and walking distance to Stanley Park. When we checked in we inquired about the fitness facilities as advertised on the web site. We were informed that they were closed for renovation but we could use the facilities at the Marriott accross the street. Had we known this in advance we would have booked our room at the Marriott. Our room was recently renovated, spacious and with a city view. We found the rate for parking to be a little pricey at $21 per day. We went down for breakfast and were seated quickly but ignored for almost ten minutes without being offered coffee. The breakfast buffet had limited selection and was overpriced. When I asked for a newspaper they informed I would have to go accross the street to get one at the gift shop in the Marriott. There are lots of choices of hotels in this price range in this area of Vancouver. I would not stay here again.", "Date": "December 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Evanston, Illinois", "Title": "“Nice View on the Harbor”", "Author": "pikapptcu", "ReviewID": "UR22441215", "Content": "Stayed here on Dec 3, 2008. This is a nice Renaissance with harbor views. I booked a harbor view room and was given a lovely corner room on trhe 8th floor. While the hotel is not right on the water (there are a few condo buildings closer to the water) I was still able to have a nice view. The workout room was under repair during my stay, but they let guests use the Marriot workout room which is across the street. I can also see why this hotel is popular with cruises since the location is close to the terminal. I didn't eat on site, but do recommend Joe Fortes Seafood and Chop House. Vancouver is beautiful and I can't wait to return in January for my next business trip.", "Date": "December 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Weston, Florida", "Title": "“Pre Cruise Gem”", "Author": "Carlanna", "ReviewID": "UR20868676", "Content": "We initially booked a water view rate for 1 night directly with the Marriott reservation # as with Marriott I don't usually find a better rate with any of the web discounters. With AAA discount it was a decent rate for a good downtown hotel and we were only staying 1 night before leaving on a 22 night repositioning cruise to Asia. Because I get E-mails from Marriott Rewards a few weeks later they sent me an offer for the same hotel for a special renovation rate that was even less. I had read 1 negative review that said someone had stayed in a room that had not been renovated so I was sure to request that I be put in a room that was newly renovated just in case. The reservations agent explained for the renovation rate special I would not have a water view but that was OK with me since we would be on a cruise ship for 22 nights and would see plenty of water. When we checked in (prompt and efficient) and went to the room I was very pleasantly surprised to have a wonderful water view. In fact the next morning we were able to see several cruise ships on their way to the port. The room was newly renovated, bed very comfortable, very nice decor and nice toiletries . Housekeeping brought us extra pillows (standing request on my Marriott rewards account) and I remember calling for something like extra coffee and they brought it right away. We have stayed in many lower level hotels that included free internet and this would be the 1 downside as we had to pay for internet use in the business center. We did not choose the rate that included breakfast as it was pretty pricey. Instead that night we wandered into a nearby gourmet market that the concierge told us about and they had delicious looking baked goods . We purchased a scone and a muffin and some cream for coffee and ate in the room the next morning. We checked out and rolled our luggage to the nearby cruise port to embark on our cruise. I understand that not all cruise lines use this port so if port proximity is important to you then I would suggest verifying this before you book the hotel.", "Date": "October 14, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“great location”", "Author": "jkiel", "ReviewID": "UR19725078", "Content": "This hotel is situated in an ideal location for wandering around the harbour, with all the associated sights and sounds. The room we had was very comfortable, and since it was angled toward the street, we had a great view down the street towards many of the skyscrapers in Vancouver. Our only - not really a complaint, just an observation - is that the doors to the rooms are not as tight as in other Marriotts, which allowed some hallway noise into the room.", "Date": "September 3, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "British Columbia", "Title": "“If it's your romantic weekend away, don't book this hotel”", "Author": "smallr", "ReviewID": "UR19670976", "Content": "If you're planning a romantic evening away, don't book this hotel. I booked a room for my nephew, as a wedding gift. Despite having talked with the front desk twice, the latest being the morning of the wedding and making them aware that this was a wedding present and being assured that all would go smoothly for the couple, it did not. The front desk gave my nephew & his bride a hassle when they checked in. The clerk at the front desk was rude and the night Manager was even ruder. The clerk insisted on getting a credit card for a damage deposit, even though the room had been paid for in full and I had discussed, when I made the reservations, the fact that he did not have a credit card and I was assured this would not be a problem at check in time. In fact, the night Manager ended up calling me at home and insisting on getting a damage deposit, using the credit card I had booked the room with. After 45 minutes, the problem got resolved. I must say I was very patient, even though I was extremely angry at the fellow. I think the staff need better training on how to resolve problems and in talking with their customers. The view was excellent ,but the room was very tiny.", "Date": "September 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dorset UK", "Title": "“Fabulous Fantastic Fun”", "Author": "suemikey", "ReviewID": "UR19582584", "Content": "Well the hotel was superb in every way. The staff caring, friendly and polite. Room was just so perfect, overlooking harbour and float planes. It was my 60th birthday, and they made it soooo special, we cannot thank them enough. Hotel spotless throughout. The best variety of breakfast , and such happy staff. We will deffinately stay here again. If you want a great stay and location, and want to feel special, then stay here. Wow", "Date": "August 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "northridge, ca", "Title": "“hotel was okay - would probably stay elsewhere until redone”", "Author": "californiamom", "ReviewID": "UR19451730", "Content": "the location is great, walking distance from marina, skytrain, urban fare supermarket (one block) with views of the ocean. great concierge, bell staff, front desk, everyone we encountered. there was also a beautifully fragrant smell in the lobby from all of the fresh flowers. with that being said here's why i would probably stay elsewhere. (1) the hotel room that we had was old, outdated, stained and scratched with some real 70s type wall paper. the furniture was completely scratched up and definitely looked like it had seen better days. and i mean really scratched. i would hope that the room is going to be revamped in the future. eeek!! (2) the air conditioning, heater never got to the right temperature, i.e., it was either too hot or absolutely too cold. (3) no in room safe (4) bathroom was beyond tiny. i've had cruise ship bathrooms that were larger - get the idea? and i'm not kidding. one person at a time definitely! so even if the room itself gets redone it'll still have the bathroom that size! (5) the bathroom smelled of some kind of a musty, shower curtain mildew type smell that lingered in the air. (6) the bathroom sink had this weird type of water temperature. usually the middle of the faucet is warm. so i would put it on warm. the water would get piping hot. so i would then put it on colder. the water would then get freezing cold. so i would move it to 1/2 of the way between warm and cold and then the water would boil again. a couple minutes later the water would get cold again so i'd have to move it closer to hot. this continued on and on until i finally got frustrated and left it on completely cold. (6) due to construction the restaurant at the top of the hotel with a view was closed. in any case, i would probably pick another hotel. the marriott pinnacle is literally right across the street. i saw the sign in the hallway that said that as of dec 07 that the hotel was going to go through renovations, so i would assume that the room we had is going to be completely redone. let's hope so.", "Date": "August 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "chicago", "Title": "“Great location and renovated rooms, poor in other areas”", "Author": "niujoe", "ReviewID": "UR17555638", "Content": "I travel for work a lot and usually stay at Marriott/Starwood properties. This is your average Marriott/Renaissance property. The new renovated rooms have the revive bedding which is great. The bathrooms are small but also renovated. The lobby, pool/sauna/workout, and other common areas are straight out of the 80's but if you don't mind that, the hotel is great. You can't beat the location, the rooms are renovated (hopefully you get one, because there is still construction going on as of July 5th) and overall the service is pretty good. I think the only complaint i have is this construction noise directly above our room that wakes us up in the mornings but it's not to the point of misery. Also, I used points for a city view room and I asked for a harbour view room and was given one, so I guess I can't complain about the construction noise too much. I highly recommend if you can afford the harbourview room, to book that because the view is great.", "Date": "July 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ontario", "Title": "“Very nice stay”", "Author": "Codester", "ReviewID": "UR17256523", "Content": "This was an excellent hotel. The rooms were nice, and looked as they do in the hotel pictures. The staff were very friendly. The pool was large, with a large gym with washrooms and change rooms. There is also a sauna and hot tub. The pool and area were bigger than I was expecting for that area of Vancouver. I walked to the harbour every day and we often ate in restaurants by the water. There is an IMAX within walking distance, and we watched the 3D underwater movie there, it was a very nice date and we looked rediculous in 3D glasses. It was worth the money. It was within walking distance to Stanley Park also where i saw a seal and collected shells. This hotel was very nice and worth the stay, if I return I would be very likely to stay in this hotel again.", "Date": "June 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Clarksburg, Maryland", "Title": "“Great Weekend Getaway!”", "Author": "bfotos", "ReviewID": "UR17112415", "Content": "LOCATION: The Renaissance had an excellent location. It is walking distance to great shops at Robson and Pacific Center. CHECK-IN: Check-in was fast and easy. Clarissa and Anthony took some time to walk us through all of the tourist attractions and activities since it was slow for them. They also sent over coupons and brochures to our room while we were out shopping. BTW, we booked through Priceline. THE ROOM: Our room was a great size. It was on the 10th floor and it was adjacent to the Marriott on the city side. One nice thing about the room was that it had a wide sliding door which let the fresh cool air in the room. I’m sure the water side was so much better, but we were satisfied with our view even from the 10th floor. The other big plus was a media hookup on the desk. You can hook up your ipod and laptop to the LCD TV using several different connections including HDMI. There were also 4 plugs available that came in handy to charge our phones, cameras and laptops. The bathroom is a decent size and very clean. RESTAURANTS: We were too busy running around town so we missed out on their restaurants. AMENITIES: We briefly scoped out the indoor pool and sauna. The sauna was large and clean. I definitely would’ve used it if I had time. RECOMMEND: I would definitely recommend it.", "Date": "June 21, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "uk", "Title": "“Very Comfortable stay - with lovely View”", "Author": "Chrissybear", "ReviewID": "UR16976784", "Content": "We stayed here the first night of our Rocky Mountaineer tour, this was not our chosen option - but we were very impressed. Lots of guests had concerns over refurbishments, but we saw no evidence I think they may have finished these. Check in was swift, we were given an upgraded refurbished room with a lovely view of the float planes landing strip directly in front of our window, there was no noise from these as they seemed to stop after about 7.00 pm, and were terrific to watch from our balcony. The bed was really comfortable. The bathroom was small but adequate with fluffy towels and good soap . A very nice stay. Thank you", "Date": "June 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Colorado", "Title": "“Great location and nice renovations”", "Author": "FrostyTraveler", "ReviewID": "UR16825645", "Content": "My family (7 total) all stayed at this hotel for the World Championship Triathlon and really enjoyed this hotel. It was the host hotel which made it convient for the athlete in our family but was very convient to things we wanted to do in Vancouver. My sister and her husband stayed on the 6th floor and their room hadn't been renovated yet but was still fine. We stayed on the 18th floor (club level) and had a very nice room but no view of the water which was fine for my husband and I. The 19th floor club lounge was well equipped with breakfest(only Monday thru Friday). We were not aware it wasn't open on the weekends so the hotel gaves us vouchers to eat at the downstairs restaurant after we complained. We made it to drinks in the lobby every afternoon and the server always remember the wine my mom wanted which was nice. The conceirge was wonderful and gave us very thorough directions to local attractions (walking and driving). The restaurants they recommend were NOT cheap so make sure you specify that if you ask them for reccomendations. I didn't hear any contruction noise which other guest wrote in their reviews. The only downside to the hotel was that not every room has been renovated so make sure you ask if you want a renovated room.", "Date": "June 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Excellent Renovated Hotel, Perfect Location, Outstanding Views”", "Author": "raquaman", "ReviewID": "UR16376293", "Content": "Just checked in today (24 May) and received a newly renovated room with a spectacular view of the harbor. Check-in was extremely friendly and prompt, in-room internet access is complementary, and the location is great--located in what appears to be the center of the downtown harbor area. I highly recommend this hotel to anyone.", "Date": "May 24, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Saskachawan", "Title": "“Very Nice NEW ROOMS”", "Author": "Mikey1000", "ReviewID": "UR15786261", "Content": "I stayed at this hotel when I attended a conference recently and was pleasantly surprised with the NEWLY RENOVATED ROOMS! The bed was very very comfortable, you just sink in the luxury of the sheets! The location was awesome close to everything the city has to offer, shopping, restaurants and the convention centre. The service was prompt and genuine. I highly recommend this hotel.", "Date": "May 8, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Noisy, smelly. Bad service for the price paid”", "Author": "alecb2008", "ReviewID": "UR15130238", "Content": "Renovation creates noise and strong paint smell on selected floors. Room was left uncleaned twice until one of the staff was directly asked. Noise from the hallway leaks into the room through the door. Bathtub does not drain properly. When complained was promised quick resolution. Still waiting. For the price: CAD199 it is truly bad.", "Date": "April 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Worcester", "Title": "“Excellent time away”", "Author": "Terry68", "ReviewID": "UR14810625", "Content": "We stayed at the Renaissance, Vancouver for 5 nights and we had a superb time. Yes, the hotel is in the midst of some major refurbishment but we were on the 8th floor and weren't at all affected by the work going on above us. We didn't have any complaints - our room was spacious, the beds were very comfortable, and the food was delicious and very well presented. The service we received was excellent and all the staff we met from the doormen to the concierge organising some of our day trips, couldn't have been more helpful. It was our first time in the city and because of our experience here we will definitely be returning and hopefully staying in the same room as it had an excellent view of the harbour and the mountains...", "Date": "April 5, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Lynden, Washington", "Title": "“There is a lot better nearby”", "Author": "kengaroo", "ReviewID": "UR14371806", "Content": "Saw a rate of $99 with AAA card, and decided it looked pretty decent for the price, so booked it for one night...a Saturday. It is not close to the water as it appeared to be in the photos. Just a view of the water if you got high enough to clear all the other buildings surrounding it...we didn't. Check-in was fine, even got our room much earlier than requested. Parking is $20 a day, but you can only park there if you have a rather low clearance vehicle heightwise. Room was better than I expected, as I was very concerned walking down the hall and seeing just how old this place really is. Two balconys with doors, but you have to be very thin to access them...rather useless balconys to say the least, thin or not. Room was clean and spacious, and the bed was very soft and cozy. Water pressure was pitiful in the bathroom. The pool was warm and looked clean. The hot tub was simply filthy. Scum buildup all around it. The excercise room was very well equipped...quite impressive. We never heard any building noise as mentioned in other reviews...maybe because the noise from the streets over powered it. This is not a quiet place as it absorbs every sound around it. Had no issues, they didn't even ask to see my AAA card. For $20 more, I could have stayed at numerous places I saw later to be much nicer and newer looking. Maybe next time.", "Date": "March 18, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Prince Rupert", "Title": "“Car robbed, no help, terrible service, HORRIBLE STAY”", "Author": "kadhnel", "ReviewID": "UR14332473", "Content": "We stayed at the Renaissance Harborside hotel in February two times, one night after arriving in Vancouver, and the second time for two nights before returning home from the same trip. My boyfriend and I are both in our early 20's and we decided to drive down to stay with my mother during her business trip. The stay was mediocre at best, there was construction going on and it was always noisy. Because we were younger, we were treated with disrespect, despite probably having an income greater than any of the hotel staff. The first time was definitely the better of the two times we stayed there, we had paid for a deluxe room with a king bed facing the water, we got two doubles, in their \"deluxe\" room, which was not all that deluxe but was nice enough. Both times we were put on floors where there was construction, which wasn't such a problem, but was annoying. On the day we were to check out, we returned to our car which we had self parked in the parkade, trying to avoid having anyone drive our car because we had almost hit a skunk and our car smelled terrible, and we noticed glass all around our car. Shocked, I walked over to the passengers side door to see that the window had been broken and all of our valuables, including our navigation system, my digital EOS camera, lenses and accessories, two ipods, money, car chargers, our cell phones, designer sunglasses and various other items, had been stolen. Devastated, we went to the lobby, furious that no one had reported the break-in, including the car that had been parked beside us the night before, which we figured must have been there since the glass had splattered and left the outline of their car. There were also supposed to be 2 \"security\" guards who were supposed to be doing laps around the parkade to ensure things like this didn't happen. When we went to the manager, he passed us a paper that had all of the autobody shops nearby and a map how to find them as well as the procedures in how to deal with a police report and the insurance people, and they also had plastic, tape and a vacuum nearby the parkade. This was not reassuring. It was clear that these problems happened frequently. Given the low wage of the valets and hotel attendants, we were almost suspicious of them because of the fact that it was 11:00 am when we were leaving and our car had not been reported despite the enormous amount of glass that was all around our car. As well having stayed there a week before and having valet deal with our car the staff knew exactly what was in our car and where, considering that the compartments that were checked had been the hidden locations where my boyfriend had left his wallet the time before. It was clearly a smash and grab job as nothing from our trunk was taken, and not even the door had been open, which is was even more suspicious. We were parked right beside the elevator, which was at a dead end in the parkade as it was at the very bottom and our car is a new Mazda 3 GT Lux. but was not comparable to the many BMW's and Mercedez which littered the many parking spaces. Why our car? It makes absolutely no sense, the thief must have either been in our car before, or had known that we had a GPS stored inside our glove compartment and that all times, except that night, we stored our wallets in a hidden compartment on top of our middle console. It made us really wonder about hotel staff. What was even more unsettling, was that when we reported our claim through our house insurance, the man dealing with our claim laughed and said, \"that's funny, I'm looking at the Renaissance hotel right now, it's right across the street from me, I am right across the street from them and I won't park my car there, I park my car 4 blocks away because I get claims coming out of there every single week, that place is notorious for being broken into.\" So there is some food for thought, I would definitely tell recommend the Four Seasons, because they have extremely safe security when it comes to parking your car, and theft is serious to them. At the Renaissance, when we told them we had gotten our car broken into, they looked at us as though we'd just told them we got a flat tire, not like all of our stuff had been stolen and our car was broken into. We do intend to follow this up with the Marriott.", "Date": "March 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto, ON", "Title": "“Good place for kids”", "Author": "Beeker99", "ReviewID": "UR14192834", "Content": "Good quiet location close to Robson St, Harbourfront and Stanley Park. Very friendly staff, great buffet breakfast where our kids (3yrs and 1yr) were made to feel most welcome. Don't be alarmed by current reno's, just in the rooms (floors are closed) wouldn't have known there was any reno's happening if the hotel website hadn't mentioned it. There was no noise...however, we were a weekend stay. The rooms do need the upgrade, clean and comfortable just a bit dated, I hope the price stays reasonable post reno. Pool is great! Not advertised but they have a kids play area beside the pool, a tree fort type of play set. Again made the place seem very kid friendly for a location I would generally think of as business oriented. Great workout facility too...right beside the pool and kids play area. Would definitely stay again. Kid friendly atmosphere might have been due to weekend stay, perhaps Sun-Thursday there is more of a business crowd?", "Date": "March 10, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Chicago", "Title": "“Old / Has Odor / Ended up moving”", "Author": "identraveler", "ReviewID": "UR12278382", "Content": "The Renaissance Harborside was a big disappointment to our trip. It definitely does not live up to the other (full service) Marriott's I have stayed at in the past. I am using my reward points for this stay. One positive thing is that we got a Harborside view instead of a city side view (despite what the reservation says) - so its fair to say they upgraded me. Another good thing is that the gym&pool are 24 hours. So - on to the ranting... 1) To our disappointment, the club lounge was closed for construction. --a) We were issued vouchers for \"nightly h'ordeurves\" and \"breakfast buffet\" --a1) The Club Lounge usually offer free unlimited food and drinks (bottled water, soda) for all registered guests. The one \"appetizer\" voucher got us ONE order of a \"small item\" from the menu at the \"Coal Bar\". And we even had to pay for the VOSS. --a2) We love to relax and kick back in the club lounge - this \"Coal Bar\" was - well its a BAR - not really a relaxing and kicking back experience for us. 2) There was no room safe 3) The whole place has an odor. --a) The entrance from the garage smells like a nursing home. --b) The room, and even the hall ways have an overwhelming (fragrant) cleaning agent smell. (it doesn't necessarily smell BAD...its just always present and distinct) 4) There are 2 new high rises blocking the view of the harbor.(My room was on the 12th floor) 5) There was no complimentary bottle of water (usually ~20oz) in the room. one word sums it up - OLD I'm going to move across the street to the Marriott Pinnacle. At the very least their lounge is not closed.", "Date": "January 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Seattle, WA", "Title": "“Don't Self-Park in the Garage”", "Author": "camseattle", "ReviewID": "UR11679280", "Content": "I've stayed at the Renaissance in Vancouver twice now over the past two years and have always enjoyed my stay. The rooms are comfortable and clean and the staff is very hospitable. I love the indoor pool and hot-tub and the fitness center is very large for a hotel. I've also always valet-parked my car since it is only $6 more ($25 / night) then self-park. Unfortunately, my girlfriend self-parked ($19 / night) and we found her car in the morning with a smashed window and stolen GPS. Both valet and self-park are in the same garage but I guess the valet level may be more secure or at least have more activity with the ins and outs of guests and staff. According to security, they experience at least one reported break-in per week since any one off the street can walk into the garage. There is only one security guard assigned to patrol multiple levels of parking. The hotel comp'ed our parking for the night (gee you think?!) and sent housekeeping with a shop vac to clean up the gas. They also sent maintenance to tape up the window (we are from Seattle so the car had to get back into the States for repairs) but he did such a poor job that the plastic blew off before leaving the city. So if you're headed to this hotel, either take your chances and valet park or see if the Marriott directly across the street has a more secure parking garage (I believe they have a locked gate).", "Date": "December 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Unimpressed”", "Author": "jac2028", "ReviewID": "UR11117414", "Content": "This hotel gives you exactly what you would expect from a Marriot however is far too overpriced. You have to pay for internet which is disapointing too. The hotel service is great though and the food is too. The hotel is also a little further out of the way.", "Date": "November 28, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Spokane, Washington", "Title": "“Nice room, great location”", "Author": "thegoaliegirl", "ReviewID": "UR10360701", "Content": "I've stayed at this hotel twice. First time I had a city view, which was nice. Second time I had a harborview. Nice to look out and see the seaplanes land. With the construction across the street, the water view is partially blocked. Both rooms have great beds and nice linens. Wallpaper is an odd blue star patern, but oh well. None of the interior seemed to be the same (wallpaper, chairs, curtains, etc but the bedding was the simple white). Didn't eat at the hotel. Pool area is nice. I would stay there again.", "Date": "October 26, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Phoenix, AZ", "Title": "“OK Hotel But I expected more from Marriott”", "Author": "bssc", "ReviewID": "UR10033174", "Content": "We stayed at the hotel because we were leaving the next day on a cruise. It was very convenient to the Canada Place cruise facility. Unfortunately, our ship left out of Ballantyne pier which is not walkable. The hotel is OK. It is completely non-smoking, which is a big plus. It was quiet. The building was secure, you needed a room key to get to your floor and then the doors were reinforced. The room was in good condition and we did not use any of the other facilities. On the negative side, the room was small, the bathroom smaller and the bed was not very good. Check in went smoothly. There was a issue with the price but it was resolved at the desk (they had not given me the AAA rate) but I had a printout from my travel agent showing the rate. The location is good. We went up to Robson Street. We recommend the Bread Garden right off it, the HON (House of Noodles) Dim Sum but could not recommend Moonpennies. All in all, I would give this a 3 1/2. For the amount of money we paid, I think that we could have done better.", "Date": "October 2, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Plymouth", "Title": "“Great hotel”", "Author": "Karl80", "ReviewID": "UR8665361", "Content": "Excellent hotel with great views from the bar (and our bedroom) over to Grouse Mountain. We had a very good deal with this hotel (price wise).", "Date": "September 6, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London,England", "Title": "“not bad”", "Author": "traffic-cone", "ReviewID": "UR8548140", "Content": "We booked this hotel as a finale to our holiday & decided to go above our budget: I'm not convinced it was worth it. We had planned to stay 4 nights but because our hotel in Nelson was so awful we extended our stay by 2 nights to 6. The hotel wanted to charge us an extra $49 per night extra for ALL 6 nights for the privilege as was we booked these 2 nights by phone & not the internet! However, after some heated discussion we agreed to pay the extra for the additional 2 nights only which was still annoying. Don't be fooled by the tag \"harbourside view\": since the hotel was built the harbour has been extended & 2 years ago an appartment block was erected in front of the hotel partially blocking the view. Also, a second block is under construction limiting the view still further. We had specified a harbour view & the first rooms we were shown DID have a view but only if you can see round corners (needless to say we soon complained & were moved). The hotel is in a great location for exploring Vancouver & for taking the seaplane to Victoria. The rooms are spacious but have neither a fridge nor a mini bar. One recommendation is the restaurant on the ground floor-the food & service are great.", "Date": "August 30, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Southampton, England", "Title": "“Great Location”", "Author": "Sally023", "ReviewID": "UR8434281", "Content": "First visit to Canada and stayed at this hotel before and after going on Rockie Mountain Tour, thought it was in a great location, easy to get to and find everything. Found the staff very polite and helpful. Rooms very spacious and the beds very cosy and comfortable. There is some building work going on behind the hotel, but with the preparations for the 2010 Olympics going on it is difficult to find anywhere that doesn't have building in progress, we were not affected by any noise at all and would definately stay there again, and recommend it to everyone.", "Date": "August 16, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Northern ireland", "Title": "“Great hotel”", "Author": "hmarriott", "ReviewID": "UR8278782", "Content": "We really enjoyed staying at this hotel. The location is very central and has beautiful views of the harbour. Unfortunately there is some building work taking place in front of the hotel but still the view is fantastic. We found the hotel staff very helpful and accommodating. Rooms were spacious and modern.", "Date": "August 2, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Northern Ireland", "Title": "“Comfortable stay in downtown Vancouver”", "Author": "Ballybrick", "ReviewID": "UR8248586", "Content": "Stayed in this hotel for two nights while meeting friends. The room was well presented, comfortable and quiet although if we had wanted a good view we would have been disappointed. We had arrived in Vancouver on the Rocky Mountaineer and our luggage was delivered direct to the hotel and while staff were helpful and pleasant we were a little concerned that the bags were left on the footpath until we arrived to identify them. On the first morning we wanted to get away early and hoped for a quick continental but found we had the choice of waiting in a queue for a full breakfast or take the grab and go choice. 2nd morning we had more time and full breakfast was good. On the plus side, for those wanting their own transport underground car parking is available and Hertz have a desk in the hotel. Overall, nevertheless, a reasonable downtown choice for a short stay.", "Date": "July 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Outdated and Lacking”", "Author": "R0adWarri0r", "ReviewID": "UR8226453", "Content": "I choose this hotel over the newer Marriott which was across the street from the Renaissance because I wanted a harbour view from my room. The view was limited due to a new high-rise being constructed between the hotel and the shoreline. This was not a major upset as we still commanded some pretty nice views but the room was well-worn and outdated. I normally have room service once or twice but the menu was very limited as were the availability of the restaurants in the hotel. We ate at the buffet for breakfast which was pricey for what was offered. Service was very slow if you ordered anything from the kitchen (e.g. an omelet). Also, the overall ambiance of this hotel is 'dark'. I am use to brightly lit lobbies, corridors and rooms. This was not the case here. I would not recommend this hotel given better choices nearby such as the new Marriott across the street.", "Date": "July 24, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Ely, United Kingdom", "Title": "“OK”", "Author": "Andy99", "ReviewID": "UR8183059", "Content": "One night stay due to the Marriott Pinnacle being fully booked for my last day in Vancouver. Just across the street, so I was at the front desk in seconds. Efficient check in and got my room immediately despite being early, nice room with view of sea. Slightly tired decor, but clean and comfortable. Seems to be more of a tourist hotel than the Pinnacle, lots of coaches so if you are unlucky it could be a long wait to check in. Room rate was very high for the quality of accommodation on offer. But no real complaints.", "Date": "July 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, California", "Title": "“Above average, but could be refreshed”", "Author": "Paris-Amsterdam", "ReviewID": "UR8078930", "Content": "First, the view was extraordinary. There is construction blocking part of the view, but staying in one of the western-most rooms still gives you a terrific field of view. Rooms -41 and -39 are in the western corner. Enhancing the view, is the fact that there is an enclosed balcony with a couple chairs. You can even open the window and get fresh air. Very nice. Downtown location is great. It's a nice part of town and it's not too far to walk to Robson street, Stanley Park, or along the waterfront. Not too many restaurants in the immediate area, so plan on going somewhere else if you want to eat other than in the hotel. There are nice ammenities to the room, such as the heated bathroom tiles and very comfortable beds. However, the decor is aging somewhat and I expected something fresher. It didn't take away too much from the week-long experience, but kept it from being an excellent room. The new construction does block the Canada Day fireworks completely, which are a little further up Coal Harbour. (Take note for 2008!) Ultimately, I would stay here again. I would hope that the rooms are rennovated before my next visit, but it wouldn't stop me.", "Date": "July 8, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "las vegas", "Title": "“Excellent Service”", "Author": "jemba", "ReviewID": "UR7774677", "Content": "The Renaissance Hotel in Vancouver is wonderful! front Desk do a great jo in welcoming you and guiding you around this lovely city!", "Date": "June 5, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "harlow essex", "Title": "“good hotel”", "Author": "peterandpam", "ReviewID": "UR7740501", "Content": "This hotel is on the waterfront facing the seaplane terminal. Get a harbor view room and the view is good. Stanley park a short distance away and close to cruise terminal.The rooms are a good size. food is very good.Staff very helpful.The only down is if you haveyour own car it costs$19 every time you go in and out the car park.", "Date": "June 2, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Jersey", "Title": "“Nice and clean”", "Author": "Willsons", "ReviewID": "UR7709239", "Content": "Did ask for early check in, but hotel was full so not able to check in until 3PM, although they did look after our bags for us. Late check out was 1PM, and again they looked after our bags. Location was really good, 15 minute walk to Robson Street and great views of Stanley Park and the harbour. Nice clean rooms, really spacious and very comfortable beds.", "Date": "May 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Fantastic hotel with great service”", "Author": "arandle", "ReviewID": "UR7378605", "Content": "We spent 4 nights here in March 2007, and were delighted with the accommodation. The hotel was located near the harbour and was within walking distance to Pacific Centre (one of the main shopping centres) and Robson Street. The front desk staff and doormen were polite and helpful, and the Concierge lady was excellent. She helped us organise tours, find places to eat and made us feel most welcome. The hotel also provided free internet access in the lobby. Our rooms on the 14th floor were immaculate. Complete with a small balcony, the room provided a fantastic view of the harbour (included a snow covered mountain and sea planes), heated bathroom tiles and one of the most comfortable beds I’ve ever slept in. The Renaissance was one of the best hotels we have stayed in, and we will definitely stay here again.", "Date": "April 17, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Seattle", "Title": "“A good choice for downtown Vancouver”", "Author": "constant_tourist", "ReviewID": "UR7155595", "Content": "If business or vacation takes you to the heart of Vancouver the Renaissance Vancouver Hotel Harbourside certainly is a great choice. I got to play tourist for 2 days while my wife attended business meetings. Book a waterside room for a nice view of the north shore of Burrard Inlet, Coal Harbour, mountians, ship traffic, float planes, Stanley Park, etc. Parking garage was $19 a day (ouch). The staff we encountered generally displayed excellent customer service skills (okay, a couple of them registered low in the smile catagory). I am fairly certain that Alexandra at the concierge desk speaks spanish, portuguese & Italian in addition to english. They graciously pointed me to the best bus to Chinatown (it's the #19), the nearest Skytrain station and the Steam Clock in Gastown...yes I said Steam Clock. Oh, just go see it. Public transit is great. Didn't dine at the hotel restaurant. Found breakfast and lunch at cafe's in Chinatown, downtown and Granville Island. Had dinner one night at Joe Fortes on Thurlow St. and the next night at Cardero's Restaurant & Marine Pub on Coal Harbour Quay. Both an easy walk from the hotel. Joe Fortes ain't no Outback Steakhouse, it's a very pleasant restaurant and, dining solo, my dinner bill came to about $40. Life's too short for bad food. Cardero's is a bit noisy but great atmosphere with very good pub-style food. If you're driving into Vancouver remember that there is no expressway to whisk you quickly and effortlessly to downtown. Finding your way should be easy, but you are on surface streets and they can be slow. If you are feeling \"touristy\" go ahead and see Granville island. Plenty of shops, stores, galleries and food stands, plus the public market to entertain you. The parking there is limited...and that was on a Tuesday morning. Next trip I'm hitting the aquarium in Stanley Park and some of the museums.", "Date": "March 13, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Chicago, IL", "Title": "“Sub-par for the price”", "Author": "MJTravelBuff", "ReviewID": "UR6837849", "Content": "My fiancee and I stayed at the Renaissance Harbourside as an interim stop between Whistler and Seattle. Because it was ranked so high in Trip Advisor, we thought that it was a safe bet for a good night's sleep. Not the case! We booked the room the same afternoon we stayed - payed around $230 CAD, $200 american. We were \"upgraded\" to a harborside room, which had 2 connecting doors to the rooms on either side of us. We were subject to babies crying, people talking loudly on the phone, tvs blaring all night. Additionally, the rooms in this Renaissance are old, worn and not worth the price tag. If you can get it cheaper, then maybe stay, otherwise there are many more hotels in Vancouver with nicer appointments, better locations, and thicker walls. My summary - dated, smelly, old, family tourists, etc. Avoid because you have the choice.", "Date": "February 25, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great Hote, Perfect Service and location”", "Author": "EdRicarti", "ReviewID": "UR6737524", "Content": "Great hotel, staff was very friendly and helpful. I arrived at 11am, and they gave me a room right away, and I also they allowed me to check out at 2pm. Is that a customer oriented environment or what? The concierge was very knowledgeable and gave us an updated map, and also suggestions of places to go. Will definitely stay there again. Tip – In gastown there is this bar-restaurant called “Black Frog”, it is a must go when in Vancouver. Not to far from the hotel. Perfect ambiance and food.", "Date": "February 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "zurich", "Title": "“Cool location, but hotel becoming oldish”", "Author": "nico_ch", "ReviewID": "UR6444961", "Content": "I stay at the Renaissance usually once a year, and I've to say that as much as I enjoyed it 4 years ago, today it's not the case anymore. The hotel's location on the waterfront is really cool (nice view of Grouse mountain). Ask for a high floor and the waterfront for the view and the noise of the water-planes that take off/land in the early morning. There's a new row of building being built between the hotel and the waterfront, and it's been going on for years (i.e. noisy all day long). The hotel itself needs to be refreshed. It's becoming really oldish and the room rates don't match anymore with the quality of the hotel. Breakfast is good but the menu hasn't changed in years.", "Date": "December 15, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Oregon", "Title": "“Good, not Great”", "Author": "sacheat", "ReviewID": "UR6359673", "Content": "As a Marriott member, I expect great things from their hotels. This hotel had excellent service and views, but lacked on decor and cleaning. The staff was very helpful in suggestions of nearby things to do and getting around. We had to change rooms due to a moldy bathroom, but this was done quickly. Both rooms need to be updated. I must say the beds were the most comfotable I've ever slet in though. If you don't mind the prices, both restraunts are excellent choices. The hotel is within walking distance of Stanley Park and Robinson Street. We had a baby, 2 year old, and 5 year old in tow and never had difficulty in finding things to do. I might also add the hotel provides a playroom beside the pool. I reccomend this hotel for families and the business traveler, but not for those looking for modern luxury.", "Date": "December 11, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "drag-po", "Title": "“Not bad hotel, but amazing beds!”", "Author": "drag-po", "ReviewID": "UR6305458", "Content": "Hotel has friendly service, with the doorman, desk clerks and housekeeping all seemingly happy, helpfull and warm. The rooms are a bit dated, though they are very clean and well kept. But the best part of the stay was the bed. It was amazing. I want one like this at home – I don't think I've ever had such good sleeps.", "Date": "November 29, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Seattle, WA", "Title": "“Perfect Stay with Great Service”", "Author": "MRSBAX", "ReviewID": "UR5984648", "Content": "Just returned from a sunny weekend in Vancouver. Hotel was gogeous and the service was impecable - from the valet to room service to the desk clerks. Our room service orders were brought up quick, our room was cleaned and stocked with ease and every staff member we encountered had a smile. Kids were thrilled with the indoor pool and hot tub and the fitness room was well equipped. Not busy at all. Our room over looked the harbor where we could ships and boats and sea planes taking off and landing. Two comfy beds, with fluffy duvets and the softest pillows I have ever laid my tired head on. Hotel location is in a safe neighborhood with a quick walk to Canada Place and Gastown. We even hoofed it back from Robson St but I recommend that unless you have more comfortable shoes on than I did. Not a lot restaurants close by but since it is in the business district, we expected that. We ordered room service twice, once for a late snack to go with a movie on TV and breakfast one morning. (a hearty \"Canadian\" breakfast so big that my kids shared) Ther were kind enough to send up a ice bucket and wine glasses so we could enjoy a bottle of wine we bought during our shopping outing. The previous review about the poor service surpises me since we were treated so well. With such a large group bombarding a restaurant, not sure what they would expect. Overall, it was lovely stay.", "Date": "October 22, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cardiff, Wales", "Title": "“Wonderful all round”", "Author": "SPsquared", "ReviewID": "UR5818961", "Content": "Never been to Vancouver or indeed Canada before but if this hotel is anything to go by we'll certainly be back. The view - admittedly we paid extra for it - is fantastic, across the harbour (and the seaplane base) to the mountains: you'd find it hard to beat at any hotel in any major city anywhere else in the world. Despite the size of the hotel, it remains friendly and welcoming, with genuinely helpful staff, who were all too keen to resolve a confusion over our bill which elsewhere could easily have become a dispute. And the price we paid (C$250 or so for one of the best rooms in the place, and champagne, and breakfast) wouldn't buy you anything nearly as luxurious in the UK. Very highly recommended.", "Date": "September 20, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Helensburgh, Scotland", "Title": "“Great rooms, dire service”", "Author": "FrancesScott", "ReviewID": "UR5815740", "Content": "Arrived at this hotel as a group on a geology study-tour. Travel-agent had suggested a luxurious hotel for the final night before we flew back to Scotland.. Despite arriving well after 3 p.m. (check-in time) three of the group's rooms were not ready. We were left hanging about the lobby beside the very posh front door - then were shooed out of the way, as we were told we were blocking the door. We could not leave our luggage as there was a great heap of suitcases, obviously from another group about to depart. After twenty minutes two of us went to see if they would at least offer us a drink and somewhere to sit down. At this point, the young man at the desk phoned someone, and then told us that our rooms were ready. No-one apologised for the delay. The next morning a buffet breakfast has been booked for us in a private room - we were due to go on a tour of Vancouver for the rest of the morning, before headng off to the airport. There were thirty-two people in our group. There were chairs and place-settings for only twenty-four. The one and only waitress was hurtling around like a banshee, trying to fill up the buffet dishes, supply people with tea and coffee, find more dishes and cutlery, not to mention chairs. Two young male managers did appear, and stood around looking concerned - but didn't actually DO anything. It was the most frustrating and unsatisfactory meal. We then went up to our rooms to collect our suitcases and got into the lift. One of the older members of our group tried to keep the doors open for another member, but presumably hit the alarm button by mistake.The alarm went off and the lift continued down to the ground floor - and no member of staff came to investigate if there was a problem. When the last member of our party came down, ten minutes later, the alarm was still going off!", "Date": "September 19, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sandhurst, UK", "Title": "“Couldn't fault them”", "Author": "Good Names All Gone!", "ReviewID": "UR5811434", "Content": "We stayed here for 3 nights at the start of a touring holiday in Canada. The sole reason for choosing this hotel is that my husband travels frequently on business and we paid for the room using loyalty points. But we were delighted with our choice. We arrived mid afternoon and the welcome was the most friendly and sincere one I've ever known in a large, corporate hotel. Because my husband is a Marriott Elite customer, we were upgraded to the Elite rooms and we had a harbour view. OK, so the stunning view is somewhat marred by the building site outside, and the large crane but you can't blame the hotel for that. We couldn't hear any noise from the building site. The room was clean and comfortable, and the bed had a really thick mattress protector which made it extremely snuggly and comfortable. We were entitled to use the members room which included complimentary continental breakfast. This was very good and the room was kept well stocked. Because they don't provide breakfast here at weekends, we ate in the restaurant downstairs. It's the usual big hotel buffet. Good quality food but as always with these, I feel you have a eat a BIG breakfast to get your money's worth. There is a swimming pool and gym which was adequately equipped although if the gym is busy, you might have to wait for a particular piece of equipment. Hotel is well located, an easy walk from Gastown and the beautiful Stanley Park. I'd have no hesitation in recommending this hotel if you want one in this price bracket. We couldn't fault them.", "Date": "September 18, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Hamburg", "Title": "“Great hotel & location”", "Author": "Hamburger_Deern", "ReviewID": "UR5788590", "Content": "Apon arrival we received a room with a cityview. There was an air conditioning on the other side of the street that was quite disturbing. We complained the next day asking for a more quiet room and got the most perfect room facing the habour. It is absolutely worth it to book a room with habour view. You can see the sea planes take off and land and have a beatiful view on the ocean and Stanley Park. The beds are just great, you sleep like on a cloud. There is construction work going on but this is not disturbing at all. I can totally recommend this hotel to anyone visiting Vancouver!", "Date": "September 11, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "British Columbia", "Title": "“A Great Place to Stay”", "Author": "JetsetJanet", "ReviewID": "UR5699475", "Content": "We stayed at this property for two nights and requested a harbour view room. The view was worth every extra cent as it was gorgeous day and night. The decor was a little dated but the room was very clean and comfortable. The bed could not be more comfortable and the heated tiles in the bathroom were a welcome treat after walking the streets of Gastown in the rain. If you are looking for a great downtown hotel with a bit of luxury, then look no further!", "Date": "August 22, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Surprised”", "Author": "Ellida", "ReviewID": "UR5609449", "Content": "We left booking a hotel in Vancouver to the last minute, and so kinda rushed our booking into this hotel. It turned out to be a great choice - nr downtown, an ocean view room, nr the float planes (essential for that trip to Victoria!) and with the most helpful staff! The construction work didn't bother us too much, although I do wonder what will happen to the great views!", "Date": "August 14, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "maryland", "Title": "“Surprisingly Great Hotel”", "Author": "hiker123", "ReviewID": "UR5564455", "Content": "We booked a trip to Vancouver at the last minute and could not get into the hotels that had been recommended as the \"top\" hotels in Vancouver. The picture of the hotel on the hotel web site was not very attractive. We were also concerned about the construction noise mentioned in other postings. We were a little apprehensive about this hotel. We went with this hotel because they guaranteed a waterview room/king bed/nonsmoking and the price was reasonable. The hotel was fantastic!! By far the best view and location I can imagine. After days of walking around the city I think its overall location is the best. We looked out our large windows and saw the harbor, seaplanes taking off and landing, boats, and mountains beyond. Incredible views and a very comfortable bed. The room was extremely quiet. The construction, mentioned in other postings, is past the pile driving phase and so noise was not an issue at all. All hotel personnel were kind and helpful. I recommend this hotel to anyone.", "Date": "August 6, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Glasgow, Scotland", "Title": "“Surprisingly Good”", "Author": "Glasgow_Member06", "ReviewID": "UR5480413", "Content": "If you saw the outside of this hotel you wouldn't pick it - it's the pink painted concrete one amongst the gleaming glass towers. However, don't fall for the first impression. A very attractive lobby and clean, bright, well-decorated bedrooms. The staff were very friendly and helpful. We had one of the most thorough maids that we've encountered. The room was well-cleaned and tidied - usually by mid-morning. We emailed the hotel asking for a kingsize on a high, non-smoking floor and got one. Room 1417 overlooking the bay. A number of reviewers raise the issue of the nearby construction work but the hotel has secondary double-glazing so we didn't find a problem with noise. In fact, often in late afternoon we opened the windows to watch the ships in the bay and the floatplanes (my wife convinced me to take a floatplane trip to Victoria - it was a great experience). I would have no hesitation in recommending this hotel - fifteen minute walk to Stanley Park and ten in the other direction into town. I was told that when the construction work in he harbour stops, it will only be four storeys high. If this is true, then the views from the bedrooms will largely be unaffected. We loved Vancouver and would happily return to the Renaissance", "Date": "July 18, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Warrington, Chershire", "Title": "“Loved it”", "Author": "A TripAdvisor Member", "ReviewID": "UR5424448", "Content": "This was the first hotel we stayed at during our tour from Vancouver to Calgary. We upgraded our room to the harbour view and it was worth every penny. The views were amazing. Out of all the hotels we stayed at in Canada this was the best. The room was really nice the bed was really comfortable. The only downside of the this hotel is that you have to pay £10 (just like any other city) per night for parking, however if you are staying in Vancouver for a few days, just get a taxi from the airport. During our 4 days in vancouver we only used the car once. There is some building work going on in front of the hotel so I dont know what the views will be like once this has been done.", "Date": "July 4, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“Great Hotel”", "Author": "dona3853", "ReviewID": "UR5363778", "Content": "This is a wonderful hotel. The staff were so friendly and helpful, the rooms were clean and comfortable. A harbourside room is worth requesting despite the construction work taking place.", "Date": "June 20, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Somerset, England", "Title": "“Wonderful Hotel”", "Author": "orange2802", "ReviewID": "UR5183794", "Content": "This was our first trip to Canada and we stayed in the Renaissance for two nights and again two weeks later for one night before we returned home. Our room was lovely and the bed was the most comfortable we had ever slept in!. The only downside was that our first room looked out onto other buildings and it was quite noisy from airconditioning units, however, we upgraded to a harbourside view on our last night and this was quiet and the views were gorgeous. Unfortunately there is building going on directly opposite and the view will be affected. We would definately recommend the Renaissance, the staff were all extremely friendly and provided a first class service. The food in the restaurant was superb and the location was perfect.", "Date": "May 20, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "San Francisco", "Title": "“Great Service”", "Author": "WineCrazy", "ReviewID": "UR5046051", "Content": "I'll have to agree with the last poster from Minneapolis that the hotel is a bit old, but the service and amenities are terrific. I am a regular Marriott Platinum Member (75 + stays per year) of this hotel and I really don't think outside variables such as construction can affect service. I guess people will always see things the way they want to see it. I could see things such as \"bad weather\", pollen count and full moons would bother this type of traveller too. I am there on a weekly basis and the staff are always cheerful and willing to help. Unfortunately, hotels are not a fantasy land where the rain, traffic etc will suddenly disappear but I can assure you that the smiles will always appear. Everyone has the option when they wake up to be positive or negative. I'm sure you know what my choice is.", "Date": "May 10, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "CT", "Title": "“Absolutely fantastic hotel!”", "Author": "Writer312", "ReviewID": "UR5025705", "Content": "I was absolutely, completely satisfied with my stay at this hotel. From the moment I walked in the door (held by a doorman) to the moment I checked out the next day I was treated like I was the queen in her castle! The service was phenomenal, the rooms clean and spacious, and the view gorgeous (not for long unfortunately, a building is being built blocking the harborside view). The hotel is in easy walking distance to many of Vancouver's attractions including Robeson Street known for its shopping and restaurants. The staff was extremely helpful in recommending an inexpensive place to eat in the area. The hotel is also in a very safe area with inexpensive garage parking. The revolving bar at the top of the hotel offered great views of Vancouver and a wide variety of local beers. Overall, I was extremely impressed and would definitely recommend the hotel to anyone staying in Vancouver!", "Date": "May 1, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "St. Catharines, ON", "Title": "“Great stay, great view!”", "Author": "Mother_Bates_8", "ReviewID": "UR4982322", "Content": "We enjoyed our stay at the Renaissance in Vancouver. There are only 5 Renaissance hotels in all of Canada. They are all unique in their own way and try to showcase the area they are located in. The front desk staff were extremely warm and welcoming. We were upgraded to a Harbourview room. When we entered the room, it was very clean. The view was terrific! The door slide open to a mini-balcony. The bed was amazing-we hadn't had a sleep that well for a long time. The new featherbed was amazing and so comfortable.", "Date": "April 17, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Nice hotel, wonderful staff”", "Author": "Flugschein", "ReviewID": "UR4724300", "Content": "Stayed at the Renaissance in the middle of a slow week and was upgraded to a harbour-view room. The view was fabulous, despite the low gray clouds and occasional rain showers. I found the room itself to be perfectly acceptable. The bed was comfortable with ample pillows and the heated bathroom floor was a welcome feature. This would not be the hotel for anyone looking for hip, modern or high-tech, however. The staff really make the difference at this hotel. I found everyone I came in contact with - from the front desk to the concierge to the servers in the restaurant - to be genuinely friendly and eager to help. On a final note, there is a lot of construction going on in the area. You may hear a bit of the noise during the daytime, especially on the lower floors. As others may have mentioned, it would be a shame if the hotel were to lose its prized views of the harbour and mountains as a result of all these new buildings going up in the neighbourhood.", "Date": "March 22, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Great position”", "Author": "is it hot or is it me", "ReviewID": "UR4559349", "Content": "My husband and I picked this hotel as it was a little away from the noise and bustle of Robson/Granville Street and we were not disappointed. Fantastic views from our windows overlooking the harbour and Grouse Mountain. What a way to wake up every morning. The staff could not do enough for you, especially the reception staff who were extremely helpful. Very clean and had a great pool and jacuzzi which was great for those weary bones after walking around Vancouver all day. I would not hesitate to recommend this hotel again. Only thing is that another hotel is being built nearer to the harbour and in front of this one, so I wonder what the views will be like once the new hotel is built. Easy to walk everywhere from this hotel. Also very good was the business centre they have for residents which means you can use internet for free. Great idea.", "Date": "February 27, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Great Harbor Views, Good Location”", "Author": "CKL57", "ReviewID": "UR4411856", "Content": "I stayed at this hotel for 5 days in October 2005. It is in a great location; situated in a quiet part of town but within walking distance to Canada Place, Robson Street, Gastown and Chinatown. Even Stanley Park is within reasonable walking distance. It is also a scheduled stop for the Airporter Bus so it has easy access to and from Vancouver Airport. I was given a room on one of the higher floors overlooking the Harbour...the views were absolutely magnificent with the mountains and North Vancouver as a backdrop! The room was spacious with all the latest amenities and even a heated bathroom floor. However, the decor is a bit dated. The entire hotel needs a fresh coat of paint both inside and out since it looks very old and tired compared to the Marriot Hotel opposite. There was new development on the Harbor front with a lot of building activity so it was rather noisy during the daytime.", "Date": "February 3, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "5", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Seattle, Washington", "Title": "“Nice Views.”", "Author": "innharmony", "ReviewID": "UR4322304", "Content": "Good Location if traveling for business or you have a car! Got this hotel thru a discount travel company and paid $65.00 american a night. Excellent deal at this price. We had a terrific view from the 16th floor. Unfortunetly the view is going to be partly blocked with yet another \"Glass tower\" going in. The room was spacious and clean. No tub in our room. Bed was really hard and needed 4 extra pillows. The TV was not working properly. room felt sort of dated in interior. Hotel itself was very clean and so were the amenities. Front Desk staff very nice. Very unsatisfied with long distance calls to USA. Was told one rate and got billed $$$. check out staff, smiled and said thats the rate. Unacceptable. Woould stay here again in the future. -) Happy New Year!", "Date": "January 4, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Wolcott, CT", "Title": "“Great hotel and location”", "Author": "stejoho40", "ReviewID": "UR4300919", "Content": "Beautiful hotel and in a great location. We had a room that overlooked the water. However there is a lot of constuction going on, so soon they will lose most of that fabulous view. We spent about 3-4 hours at the revolving rooftop restaurant one night. That was one of the highlights of the trip, and a definate MUST if you stay there.", "Date": "December 26, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Minneapolis, MN", "Title": "“Very fine”", "Author": "timminn49", "ReviewID": "UR4300300", "Content": "Last time I stayed in Vancouver I was at the Marriott across the street. The Renaissance is definitely a cut above. Excellent room, fine staff, attentive service.", "Date": "December 25, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Scotland", "Title": "“Nice Hotel, Great Location”", "Author": "Addictedtotravel1", "ReviewID": "UR4005126", "Content": "We spent a few days at this hotel before and after an Alaskan cruise. For the first few days we were in a harbourside room on the 6th floor. The view across the water was great and we loved watching the sea planes take off and land. Shame about the building work off to both sides of the hotel though - the views will soon be lost! Even though there was building work going on outside the noise was not too bad due to an extra set of windows on the outside of the balcony. When we returned to the hotel after our cruise we were greeted by an exceptionally helpful member of reception staff who let us check in at 11.00 a.m. and went out of her way to find us a nice room. This time we were on the 14th floor in a massive room with a huge bed and sitting area with sofa bed. The room was facing the city this time and, unbelievably, the construction noise was worse than on the harbourside as there was no extra set of windows for soundproofing. It didn't bother us too much though as it started at about 7.30/8.00 a.m. when we were awake anyway. All in all this is a nice clean hotel with friendly, helpful staff in a lovely location - the walk along the marina to Stanley Park was beautiful, we even seen seals in the harbour!", "Date": "October 10, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Toronto, Ontario, Canada", "Title": "“Great!”", "Author": "StPaulus", "ReviewID": "UR4002099", "Content": "We stayed at this hotel for 4 nights in a 17th-floor room facing the harbour. Check-in was quick and efficient, the room well maintained and clean. Our request for foam pillows was promptly fulfilled. As mentioned in other reviews, there is construction in front of the hotel, and seaplanes start and land frequently after 7:30am on weekdays. While the extra windows on the balcony do a pretty good job of minimizing the noise I would recommend bringing earplugs if you are a light sleeper and if you are planning to sleep in. Once you get up, a terrific breakfast buffet awaits you. We managed to get an excellent rate and really enjoyed our stay.", "Date": "October 8, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "new jersey", "Title": "“A breathtaking experience”", "Author": "paul1021%", "ReviewID": "UR3831921", "Content": "My first visit to Vancouver, British Columbia was exceptional. Upon entering the hotel, we were treated with personalized courtesy from the bell captain to the lobby staff. The front desk lady greeted us by name and went out of her way to accommodate our room preference. The harbour views were breathtaking and exciting. Even though, there was constuction taking place near the harbour it was negligible to the serene water views we experienced. We stayed on the 10th floor on the right side facing the water. The view of the harbour is better toward the right side. The construction is necessary so that city of Vancouver can prepare for the 2010 Winter Olympics. Yes, we definitely would stay here on a return trip!", "Date": "August 31, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "New York", "Title": "“Vancouver's Bird's Eye View”", "Author": "A TripAdvisor Member", "ReviewID": "UR3756658", "Content": "This was my first trip to Vancouver and our stay at the Renaissance was the highlight of a wonderful trip. THe view of the harbor was to die for!!! It was heavenly waking up to such an amazing view of the water and turning in with a lovely view of the sparkling city across the way. Each day we would return to the hotel after hours of sight seeing and the view was so breathtaking I think would have been perfectly content watching the planes land/take off from the water all day long. Besides the view, the bed was absolutely divine. We were in Vancouver in September and it was slightly chilly but the heated floors of the bathroom was a great touch. There is nothing I would change about this hotel or trip. THe staff was very polite and helpful, esp in organizing one of our excursions to Victoria Island. We definitely stay here again.", "Date": "August 12, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Sacramento, CA", "Title": "“Great people, horrible rooms”", "Author": "SacWilly3", "ReviewID": "UR3686052", "Content": "The only positive thing about this hotel was the staff. The concierge, Alex, was fabulous, as was Erika. We arrived at 4pm on July 3rd, and our room was not ready until after 5pm (strange, considering check-in time is 3pm). Unfortunately, the room wasn't worth waiting for. It was filthy. The counters in the bathroom, the top of the toilet, and the rim of the tub/shower hadn't been wiped down in weeks, if not months. The floors were even worse. There was lint and tiny pieces of garbage all over the carpet, and hair (even one large wad) on the bathroom floor. The beds looked like they'd been slept in, although I don't know how anyone could sleep in them in the first place, because they were hard as a rock. The mattresses had to have been at least 20 years old. And, we had reserved two rooms - they were both just as filthy and beds just as bad. We paid over $200 CDN/night for each of these rooms, and they were worse than Motel 6. I'm shocked to see how anyone can rate this place above a zero, because I can't imagine things could be so different on a different day or in a different room.", "Date": "July 20, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles, CA", "Title": "“A Wonderful place to begin our Alaskan cruise vacation!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3481747", "Content": "What a wonderful way to start our vacation. My wife and I and another couple flew from Los Angeles to Vancouver on May 5, 2005. This was our first trip to Canada. We booked two nights at the Renaissance, enroute to our Alaskan cruise. We got a room on the 12th floor city view for $203.00 Canadian. The room was clean. The front desk staff provided outstanding service, going out of their way to help us. I would not hesitate to recommend anyone going to Vancouver, BC to stay at this hotel.", "Date": "May 18, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“love the view”", "Author": "Peg152", "ReviewID": "UR3453083", "Content": "You walk into this hotel and the wall of windows looks like a giant lite wall mural of all the beautiful mountains across the bay! This hotel is on the harbor and has city view and harbor view rooms. It is walking distance to gastown and has a lovely revolving restaurant on top with great food. Everyone is very friendly and eager to please. We have stayed her 4 times on various trips to Vancouver from Chicago.", "Date": "May 9, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Fort Worth, Texas", "Title": "“what a bargain”", "Author": "newface", "ReviewID": "UR3355526", "Content": "I cant believe i got this for 50bucks a night on priceline. Its basically all you expect from a 3and a half star hotel. pool, sauna, training room was excellent along with security. It was a little far from the cheepie restuants and the subway. Great views and service.", "Date": "April 13, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Penticton", "Title": "“Rooms need overhaul and soundproofing”", "Author": "A TripAdvisor Member", "ReviewID": "UR3303754", "Content": "While the location of this hotel is great - walking distance to many restaurants and shopping - the rooms are awful! I expected the bathroom to like the picture on the internet - beware it is NOT. The bathrooms are old - not updated and I had mold in the tiles around tub. The bedspreads,curtains,wallpaper is very outdated and hard on the eyes. We were on the 12th floor and I could hear the room next door perfectly - everything they said, did -heard their tv - if they sneezed coughed. My employee was in the room on the other side of me and she could hear me talking of phone and my tv (I speak very quietly and my tv was on very low). The adjoining room doors were thin and the light from the other room shone through along with the light from the hallway from the front door. Rooms seem very old. Towels actually had holes in them!! Was quite shocked as I stayed in the Marriot Victoria in October and was told this was part of the same chain - you would never know it. The pool was fine but no towels first night there only small hand towels and scug around the hot tub. Overall - nice location but I won't stay there again unless they soundproof, update doors and bathrooms and redecorate.", "Date": "March 26, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Castle Donington, UK", "Title": "“Great Hotel”", "Author": "KayCastleDonington", "ReviewID": "UR2974735", "Content": "We stayed at the Renaissance between Christmas and New Year. We are members of the Marriott Rewards programme so were given a room on the club floor with access to the club lounge. Breakfast in the lounge was wonderful - Alix, the club lounge hostess was so helpful suggesting places for us to visit and arranging late check-out on our final day. She really made our trip! Overall the hotel was very good although, even from the 17th floor, the view is spoilt by the ongoing construction work. However, it was fantastic value for money and I would happily stay there again.", "Date": "January 4, 2005"}], "HotelInfo": {"Name": "Renaissance Vancouver Harbourside Hotel", "HotelURL": "/ShowUserReviews-g154943-d182542-Reviews-Renaissance_Vancouver_Harbourside_Hotel-Vancouver_British_Columbia.html", "Price": "$219 - $367*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1133 West Hastings Street</span>, <span class=\"locality\"><span property=\"v:locality\">Vancouver</span>, <span property=\"v:region\">British Columbia</span> <span property=\"v:postal-code\">V6E3T3</span></span>, <span class=\"country-name\" property=\"v:country-name\">Canada</span> </span></span></address>", "HotelID": "182542", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/5a/da/5ada816499887e6413bf659321f803138large.jpg"}}