{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Excellent location, staff and food.”", "Author": "GoldenTraveller", "ReviewID": "UR126048421", "Content": "I have stayed at this hotel on several occasions for both business and pleasure. Every time I go, I am glad I didn't venture elsewhere! The food is actually excellent! The rooms are clean and well appointed. The staff are super and they always remember repeat guests. Even the piano player in the evenings is excellent. Very good value for money. Across the street from the Yorkdale Shopping centre which huge with plenty of good shops (including an Apple Store!) and restaurants. If you haven't already tried it; the Pickle Barrel is definitely worth trying. The menu is somewhat of a book; but despite the extensive types of foods offered, never had a bad meal there. Furthermore, the hotel is only a short drive from the airport...very convenient. Highly recommend, and if the opportunity presented itself, I would definitely return.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Great location”", "Author": "castravel56", "ReviewID": "UR125316369", "Content": "We recently stayed 1 night at this property. Check in was quick and very efficient on a busy holiday weekend. Staff were friendly and helpful and gave us a quiet room on request. The hotel was very busy but our room was quiet and very comfortable. Location is perfect for a little shopping at Yorkdale and convenient to the subway, so downtown is easily accessible as well. We did not have breakfast at the hotel but rather at the mall which was very fast and inexpensive.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "the netherlands", "Title": "“Holiday Inn as it should be”", "Author": "germaniris", "ReviewID": "UR124332573", "Content": "Beautiful hotel in a good location. Nice interior, guest room good and clean. Breakfast not cheap, hot food is not good value for money, I think. Gym and pool available, however, the pool is in full view - nothing for shy people. Mall across the street in short walking distance, however, the mall sucks as there is no toy shop (don't think you'll get your gifts for the kids back home there).", "Date": "February 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kitchener, Canada", "Title": "“Well located, accessible and a delight!”", "Author": "geeko30", "ReviewID": "UR124033344", "Content": "For business trip or for vacation, you will always be greeted by their professional and pleasant staff. The hotel is well located near major highways, public transit, Yorksdale Mall and several restaurants. You can easily travel to Toronto, Mississauga and GTA. The breakfast and dinner were wonderful no matter what your appetite is (for light and full meal courses). There is a lot of variety. The rooms are very comfortable and clean.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Delhi", "Title": "“Pleasant, relaxing and easily accessible”", "Author": "Pritiweekendtraveler", "ReviewID": "UR121410205", "Content": "I went there for a business purpose. The location of the hotel is good. Just opposite to the hotel is Canada's biggest mall (as read on Internet). The service, rooms, cleanliness, promptness of the staff is commendable. I stayed there for about 4-5 days.. The stay was pleasant. Surely recommend my friends to stay.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Saskatoon, Canada", "Title": "“always a good experience”", "Author": "cds4713", "ReviewID": "UR121167869", "Content": "I stay here often on business travel. The rooms are always clean and the staff are always top-notch. The Yorkdale Mall is just across the street and offers many great restaurants and of course shopping. The subway station is in the mall providing access to downtown Toronto. The pool is nice and the gym is ok but I always find the gym hot and humid being so close to the pool. The rates are a bit high but you pay for the convenience of this hotel and the amenities that come with it.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“unmanageable overall.”", "Author": "McScenic", "ReviewID": "UR120963197", "Content": "I was assigned a room which was outdated,need to be mantenanced, and poor cleaning. Housekeeping staff who looks old with some problem on her legs and very talkative and often imply me pay tips in advance cleaning the room and also asked me wrote good word to her star card that left me feeling uncomfortable. Not good for hotel apperence and impression to guests. Overall, I am confused why your hotel staff behave like working in this manner. About your star card, which is key important for your staff? Or they can write it by themself for their benefit? Or push guests to write it for them? It is not good!", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tacoma, Washington", "Title": "“A good hotel that the staff make great.”", "Author": "joeylikestoast", "ReviewID": "UR120829065", "Content": "I stayed here for an entire month and the staff really made me feel at home. Good location with proximity to the mall and subway. The hotel restaurant is a bit overpriced but the food is great and as I mentioned before the service was top notch.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Laval", "Title": "“Great staff for a great hotel.”", "Author": "Greenwood143", "ReviewID": "UR120434363", "Content": "This hotel is very well located. The downside being the constant highway noise if your room is facing in the 401 direction. The staff is very helpful, polite and efficient. The restaurant offers a great choice of food. 8$parking but there's always a spot. Wireless internet free but a tad slow. Perfect for a short business stay.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Edmonton", "Title": "“Good hotel, TV & internet is a problem”", "Author": "gasp262", "ReviewID": "UR119733897", "Content": "Hotel was clean, quiet, good location near shopping and subway. Rooms were fine. The TV is standard def and as a result the quality sucks - why modern hotels persist with old television technology and old TVs is lost on me. The internet service (wireless) was slow and at times unworkable. The hotel was aware it was a problem and indicated it would be fixed.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Not the hotel it used to be”", "Author": "eos75", "ReviewID": "UR118871796", "Content": "I've stayed at this hotel many times over the last 5 years, and have seen a gradual deterioration in the service provided. On this stay the room smelt (stale smoke?) on arrival and there was a stain on the carpet. The bathroom, as with most rooms I stayed in there, was in need of general maintenance. The TV was a new LCD model but only had the first 30 channels tuned in and the sound was completely out of sync with the picture; so fairly unwatchable. I've been a platinum member for 4 years - initially I was generally given a room on 12th floor and there was always a nominal gift in my room on arrival. That has all long gone, along with benefits such as bottled water. Even the nice touches such has handwritten welcome note seem to have gone as of this last stay. As others have commented, the food service is somewhat expensive. $40 for a sandwich, dessert and drink! Easily $75+ per person for a full meal. The hotel itself is quite tired, and the building is not kept as presentable as it used to be. The front entrance in particular doesn't give a good first impression. Quite often dirty glasses and plates from guest rooms were left on the floor in the corridor all day before being collected. The hotel staff are not the same as in recent years. Many of the old faces no longer work there and the hotel has lost a lot of the spirit and atmosphere that used to make it special. Some of my interaction with the current staff left me feeling uncomfortable where they have been border-line rude or have openly criticised their management or the hotel in general. Not good! The hotel makes much of its award winning past, but unsurprisingly it hasn't won the top award for at least a couple of years. Certainly the hotel's claim to be one of the current top 10 Holiday Inns in the world is somewhat laughable. It's not a bad hotel, but for all it's hype it is fairly average. I've stayed in better Holiday Inns elsewhere in Canada and other countries in the world. I always used to be an advocate for this hotel, and 4 years ago would have given it a 5. However this last stay was so disappointing overall that I doubt that I'll return anytime soon.", "Date": "October 3, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Quebec", "Title": "“Good value”", "Author": "camper222", "ReviewID": "UR118799326", "Content": "Clean, recent and good service. Fridges in rooms and free wifi internet. But the gym is a bit small and the restaurant prices are exuberant...", "Date": "September 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Always good to be here”", "Author": "Janielapierre", "ReviewID": "UR118515659", "Content": "Great stay here? Bed a little small but great place!", "Date": "September 24, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "2", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“would be a nice place for families”", "Author": "Dionisiamdx", "ReviewID": "UR118131057", "Content": "I stayed at the Holiday Inn Yorkdale recently for three nights on business. My room was on the 10th floor, which is one of the executive floors. The room was nice, but the tv was still old style tube, my associate was on the 12th floor and he had a new flat screen. What I did really like was that the window opened and I was able to enjoy a nice breeze. However, I hated the bed, it was too firm for my liking and the second morning I awoke with terrible back pain. My bed at home The restaurant is nice, great sushi bar.....but very epensive...if my company wasn't picking up the tab I would not have eaten at the hotel. The shopping center across the street is very nice, with both very expensive stores like Coach and Louis Vuitton and normal stores like Old Navy and H&M. The hotel has a very nice pool, hot tub and sauna and a arts and craft area for kids as well as a pool table and a space near the pool area with some fake grass with a net where you can play tennis. I saw a few families really enjoying themselves. It was nice, but if I was paying I would not stay here because of the cost and the uncomfortable bed (unless you like a firm bed).", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "North Bellmore, New York", "Title": "“Great place for families and business”", "Author": "smog100", "ReviewID": "UR118012859", "Content": "Easily located off of hwy 401. Across street from huge shopping center(Yorkdale). Pool, sauna, exercise room, pool table, etc. - great for kids - family. Nice rooms - very comfortable. WiFi. Very accommodating staff. Morning paper, restaurant, bar - very comfortable. Only negatives- old tube TV's, parking is $8 per day and a nuisance.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "istanbul, turkey", "Title": "“Not worth the money”", "Author": "viri", "ReviewID": "UR117186290", "Content": "Stayed at the Holiday Inn, Yorkdale for about four nights in July. Considering the price, about $170.00 Can a night, Idid expect more. Carpeting in the hallway looked a bit shabby. Restaurant food was terrible, except for the soup. I can only assume the price is due to location, it's opposite the Yorkdale Mall and metro. They gym could be bigger and for that price I would've liked a bigger room. To enter frome the Yorkdale end was confusing, as their was a bar at the entrance saying you had to buy a ticket for parking. This confused the taxi driver who made me take out my bags and walk. I later realized that other people just raised the bar, drove in, made their drop and exited. The staff is extremley polite and helpful. There was no fridge in my room, I made a call and they sent one up. Would've thought at that price there would be a bar but no such luck. I later went to the Holiday Inn Express - 20 dollars cheaper, same size room, no pool/gym and I had to take one bus to the metro but I was cool with it. V", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Convenient -- a good stay”", "Author": "WesternTravelGal", "ReviewID": "UR116139153", "Content": "We stayed here while visiting family, and found the staff to be friendly and helpful. Rooms were clean and the setting was quiet. We liked being walking distance from Yorkdale mall and the subway, and the parking was convenient as well. Overall, a pleasant stay, and we'd stay again. The restaurant leaves a bit to be desired, especially for the price of the food, but otherwise a good experience.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Windsor, Canada", "Title": "“Frequent Guest - our favourite”", "Author": "PetitSacconex", "ReviewID": "UR115171529", "Content": "We have stayed here a few times now, and have always had great experiences. We are Club members, but have no noteworthy status, yet receive complimentary room upgrades each time, which keeps us quite happy. We receive complimentary chocolates and bottles of water as well - little touches that impress. Service always excels here. The location is convenient - right off the 401, and walking distance to Yorkdale mall. Our two small children love the pool and other activities. Rooms with a balcony facing inside the hotel pool area are great if you like to people watch!", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Salzburg, Austria", "Title": "“very convenient location and friendly staff”", "Author": "sial", "ReviewID": "UR114818626", "Content": "The hotel is very conveniently located just off Hwy401 and right across a big shopping center (Yorkdale Shopping Center). Right behind the shopping center is also a train station. The train takes you downtown in about 25 minutes. Parking is 7dollar per day (which is not too bad). The lobby and the pool/bar area looked very nice and inviting, but there was no time left to get a swim or a drink there. The room was very clean but the furniture, the ac and the walls were already a bit dated (but not too bad). I was missing a fridge, but we brought a cooler and there was an ice machine on our floor. We had a balcony, which was pretty cool. All in all i would definitely stay here again, because the price and the location can't be beaten.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Timmins, Canada", "Title": "“Access to Downtown Toronto without the Hassle”", "Author": "2eratics", "ReviewID": "UR114755137", "Content": "This major hotel is located just off Highway 401 at Dufferin. The entrance is through a (now closed) car dealership but once you figure that out, it is easy to find. If you are driving to Toronto but want to avoid the headaches of driving downtown, this hotel is an excellent choice. Across Dufferin Ave. is the massive Yorkdale shopping centre. This mega-mall has just about everything in retail but also a GO bus terminal and a TTC subway stop. You can get downtown in about 45 minutes. Keep in mind the mall closes after 10pm so if you are coming back late, you have to walk outside back to the hotel. The hotel itself is very nice and as the other reviewers have indicated, the beds are comfy, the staff friendly and the atmosphere is quite pleasant. The room I had was circa. 1997 - old TV with a remote so well used the numbers on the buttons were completely worn off, beaten up balcony doors and screen and a slightly mildewy smell in the bathroom. Be forewarned of the cost of eating in the hotel restaurant. There are no close by restaurants except for the mall food so although very good quality, the meals are expensive - $20 for a continental breakfast. The exercise room is sort of a \"hut\" in the concourse of the hotel. The equipment was modern and generous - it is just in a kind of odd location next to the dining area. If you have time, check out the Efton Scientific store nearby - lots of neat stuff you will not see in the mall.", "Date": "June 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ontario", "Title": "“Not bad...better than I expected”", "Author": "newfie99Ontario", "ReviewID": "UR101807349", "Content": "We were here for a full week over March Break. Nice room....2 queen beds would have been very nice but we survived. Staff we very friendly. The manager said good morning to me every morning. We had to pay for a fridge which I though was kinda lame. The pool was very nice and the hot tub was very warm!!! We didn't use the sauna. We never ate here but there is a bar and restaurant. The TVs were never on which I thought was kinda odd considering the Leafs played like 4 times that week. I would stay here again for sure!!!", "Date": "March 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Switzerland", "Title": "“Staff great, hotel rather tired...”", "Author": "Zed_Gordon", "ReviewID": "UR100019192", "Content": "We visited Toronto to shop and visit relatives. For both the hotel is in a great central location. The staff are great. They are friendly and efficient and I couldn't fault them. The hotel itself is rather old and tired. The windows were not properly insulated and allowed cold air into the room. The heater was old and stopped and started every 10-15 minutes making an incredible racket. Internet connection was weak and kept cutting out which proved to be most frustrating. Despite the great location and the friendly staff it is unlikely that we would stay here again until the facilities have been significantly renovated.", "Date": "March 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Relatively well-maintained Holiday Inn, with excellent service”", "Author": "ottwatrvlr", "ReviewID": "UR97227316", "Content": "The Holiday Inn Yorkdale is a relatively \"typical\" hotel when it comes to room layout, amenities and services. For those needing to do business north of Toronto (Downsview area, North York...), looking for a stopover along the 401 or binge on shopping at the Yorkdale mall, this will be a convenient spot. Although it is quite obvious to the trained eye that this is no longer an hotel in its prime, common areas as well as the rooms are clean and well-maintained. Everything was in working order. The HI Yorkdale may offer a little bit more than the standard HI as the \"common area\" with restaurant, pool, gym is much larger than usual. It actually somewhat reminds me of the Delta Toronto East in the Scarborough area. The gym is good with a few diverse piece of equipment. The room decor is fairly standard. Bed was comfortable. As I came in late, I had to order room service which was priced reasonable and put a few original twist on classics. For example, the \"club sandwich\" was more \"grilled panini\" style. Portion size was generous, making it relatively good value. The one great quality of this hotel is its staff. Extremely friendly. Although I would not go out of my way to stay at this hotel again, I would definitely recommend it for anyone who is looking to stay in this area", "Date": "February 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Corfu, Greece", "Title": "“Excellent!”", "Author": "tassosGR", "ReviewID": "UR95183126", "Content": "I had a very pleasant stay in Holiday Inn Yorkdale for 12 nights. The room is big and comfortable, the bed is perfect and the internet wi-fi connection is almost faster than my home connection! There is good restaurant in the hotel (with a sushi bar), bar, pool and a gym. The breakfast buffet is absolutely huge, more than you can expect! But I think the best part is the staff which is very friendly and helpful all the way, I really appreciated the hospitality! Across the street is a really big mall where you can find almost everything (except from a grochery shop..) and a train station from where you can catch the train to Toronto downtown, it takes 25-30 minutes. I would definitely recommend Holiday Inn Yorkdale to anyone looking for a hotel in this area of Toronto.", "Date": "February 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kingston, Canada", "Title": "“Excellent choice for a weekend getaway!”", "Author": "hollywood05", "ReviewID": "UR92348074", "Content": "Great hotel for a family getaway. The staff are very friendly. The hotel is very clean. I could tell the hotel has had some updating and I was impressed. The kids had a great time. The pool, hot tub, indoor tennis court, ping pong table, pool table, workout facility and kids club were all enjoyed thoroughly. The food in the restaurant was delicious and the service amazing!! The hotel is literally a 2 min. walk across the street from the Yorkdale mall! Very much appreciated by all! We are looking forward to our return to the hotel for our next Toronto getaway!!", "Date": "January 9, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Pretty good but not that accommodating.”", "Author": "Ellsie08", "ReviewID": "UR90956428", "Content": "Overall I'm pleased with this hotel. The price is right and it's clean and comfy. There's a pool so I can take my little one swimming. The kids activity room is not open during this particular week. I was disappointed to find this out when we arrived, as this was the main reason we were staying there. We were planning on staying at the Yorkville Holiday Inn, but decided on this one because of the kid's activity room. When I booked th hotel room I told them I asked if there was a fee to use the kid's activity room and they said no, they didn't mention it would be closed though. I told the manager we were disappointed and she said to me, as if I was an idiot, \"it's been this way for 10 years.\" Nuff said. The restaurant was under renovation so I had to feed my baby in the room. I asked if I could grab a high chair from the restaurant but the manager couldn't find one. So we eventually fed her in her stroller. It was annoying. But things could be worse. I don't want to sit here and say it was bad. It was nice and convenient and I like the hotel. I just thought, with all the awards they have, they would have been more accommodating.", "Date": "December 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sherkston, Canada", "Title": "“I can't wait to come back!”", "Author": "Jan1818", "ReviewID": "UR88353216", "Content": "I came to Toronto for a friend's birthday and the Yorkdale Holiday was recommended to me because it was close to where the party was and the price was so reasonable. I was so pleasantly surprised how friendly and helpful the team members were starting at the front desk. I was greeted with huge smiles and they were so polite and helpful. I went to my room and found this elegant lovely room. I was impressed how nicely the bed was dressed with linens and even the choice of pillow comfort. It was surrounded with a lovely desk, couch and coffee table. Within 20 minutes I received a call from the front desk to ensure everything was to my liking...unbelievable service again. I didn't want to go to the party anymore; I would have enjoyed staying in.", "Date": "November 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cleveland", "Title": "“They don't make Holiday Inns like this anymore”", "Author": "howieeg", "ReviewID": "UR86461687", "Content": "Maybe itâ€™s just the way things are done in cleaner, friendlier, more polite Canada, but the Holiday Inn Toronto-Yorkdale has to be one of the best Holiday Inn experiences I ever had. Although my stay was through Priority Points, the hotel honored all the extras that go along with being a Platinum member, including premium parking (only $7 a night) and an upgrade to the club level for a beautiful room that would be at home in most four-star hotels and higher: Flat-screen TVs, decorative plants (even a bamboo plant in the bathroom), bathrobes and new-looking carpets, drapes and walls. Because I had to go to Toronto at the last minute, most downtown hotels were booked solid, but this Yorkdale facility, about 10 to 15 miles from downtown, is still connected by subway (actually at a huge mall right across the street). Yet, it offers a lot of amenities one would find in a mid-level resort.. Even if I paid a regular rates here, it would be a fraction of Torontoâ€™s downtown hotel prices. Amenities in this 12-story hotel include an atrium-style center, with full pool, spa, sauna, balconies overlooking well landscaped interiors, water features, special family games, a kids area and a work-out area in a gazebo style structure -- a summer vacation any time of year. The restaurant is okay, and so is room-service, offered without mandatory built-in gratuities and a modest surcharge of $3.50 CN. A minor glitch in room service (no table as requested) was rectified with complementary breakfast vouchers. Iâ€™m glad I tried the buffet rather than room-service breakfast, because the variety and quality were astounding -- with European, Canadian and American options -- and many ways to build a healthy, low-fat, low carb meal. Most importantly, youâ€™d have stay in a much pricier big-city hotel in the U.S. to get the degree of politeness and professionalism of this hotelâ€™s staff. I may still stay there again even if some of the downtown hotels are available.", "Date": "November 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“My Home away from Home”", "Author": "Taylor330", "ReviewID": "UR79979949", "Content": "I stay at this hotel 6-8 times per year for work related head office visits. The service is always fantastic, the staff always accomodate every request with a smile and are amazing! I usually hate staying in hotels, but I am always relaxed and put at ease everytime. The gym is good, the business centre in great, and I actually look forward to my stays. The hotel is located close to all amenities and within quick driving distance downtown and across from the great Yorkdale Mall.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Austin", "Title": "“Great amenities and service”", "Author": "thumperbopper", "ReviewID": "UR74092253", "Content": "Went with family and wanted to stay closer to downtown, but found a great deal with this hotel in Yorkdale. The rooms were comfortable and they had a nice pool and workout room. Even had small tennis court and ping pong table for kids. The staff was very nice and helpful. The only thing I didn't like was that we had to pay for parking. It wasn't much ($7/day) compared to what you'd pay for parking at a downtown hotel, but there was so much parking space for the hotel and around that area, so didn't feel it was necessary to charge.", "Date": "August 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ontario", "Title": "“Mixed bag”", "Author": "travelteachOntario", "ReviewID": "UR69500906", "Content": "I have stayed at this hotel many, many times but not for about 10 years. I was looking forward to the stay there as I have always found it to be a positive experience. I was happy to see that they still offered a buffet breakfast which is really great. I was disappointed that the fitness centre had not expanded but happy that it was still there. The room I stayed in was, on the surface, very nice. However, there were issues with the cleanliness, which really surprised me. I am hoping that this was a one time occurrence and not an indication of decline at this old standby.", "Date": "July 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "texas", "Title": "“Don't understand the negative reviews -- this place is great”", "Author": "carolat", "ReviewID": "UR61146510", "Content": "The service orientation of this hotel is stellar. The food is good, and the location is convenient to a great mall, the airport and downtown (by car or subway). We have been here for 6 nights now and couldn't have enjoyed our stay more (given that there were a lot of kids in the hotel over the weekend...) Thoughtful staff, clean, etc. etc. What more can I say. Have stayed all over the world and the staff here is above most all hotels! Also, free wifi.", "Date": "April 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kolkata", "Title": "“Great stay at Holiday Inn”", "Author": "SusantaMukhopadhyay", "ReviewID": "UR53997526", "Content": "I stayed at Holiday Inn in Toronto with some of my colleagues. We were in business travel, as well as we also want to have a tour in Toronto, the business hub of Canada. We stayed there for about a month. In terms of facilities the hotel is great. The location is little far from the main city. But train station is near to the place, where you can always take local metro. You can go to the station through one of the biggest shopping mall Canada. It is just opposite of the hotel. You can have your food either in the food court of the mall or also in the hotel. The rooms do not have cooking facility, only coffee machines and refrigerators you will get just like other hotels. Rooms are spacious, the hotel also have swimming pool, gym, good network and place of sauna.", "Date": "January 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Toronto", "Title": "“Do not eat at the restaurant”", "Author": "TorontoPolly", "ReviewID": "UR50221849", "Content": "Though the staff was friendly I would not advise anyone to eat at the in house restaurant. The restaurant was filthy, period. The trays the sugar bowls sat on were disgusting, ketchup and what looked like dried egg yolks were all over these trays, I moved tables once noticing this thinking this particular table had just been overlooked, but the next table was the same. The same went for the salt and pepper shakers, sticky with dried food from other peoples dirty hands. Salt grains were all over the table so it had obviously had not been wiped after the previous guest. The milk jugs for coffee are put out on the tables first thing in the morning and then left out all day, this is very unsafe, you would think in a large chain hotel like this the staff would have to take a health and safty course at some point. Eventhough milk is pasteurized it still contains bacteria. Milk left out for more than an hour at room tempature increases the number of pathogens that are present and will become become unsafe to drink in about 4 hour (and I wouldn't wait that long). I overheard a server telling another one she was going to leave a couple of these milk jugs for the girls on dinner shift in the service stand once she was finally removing them. (this was at 2pm, now already left out for aprox. 7 hours) I never once saw any management for the duration of my stay, (restaurants where the management sits in the office all day never do well) so the staff has no guidence. They also seem to be very understaffed. One poor girl was franticly running around taking care of at least 15 tables, guest sometimes waited for more than 5 - 10 minutes to get coffee, eventhough most people take advantage of the buffet you have to aks for a menu if you want othewise, and just because it is mostly buffet that doesn't mean service is not needed. I then continued to watch a mother and her young son sit at a table, the son then proceeded to play with the extra settings at the table. He had put his hands all over the cutlery, coffee cups, saucers and the side plates (using them like building blocks) and of course when the server came to clear the table after the guests had left she only took away the plates they had directly eaten off of and just repositioned the so called \"clean\" table settings. Once again very unsanitary. I'm sorry but with this horrible N1H1 epidemic going around I would not want to be eating off of plates and putting cutlery in my mouth that people had touched all over. I was impressed with the selection of the buffet (well overpriced though) but I could only imagine what kind of practices go on in the kitchen behind closed doors after seeing the state of the front of house. This hotel has aparently won a bunch of awards (that are hung all over the wall on the way to the restaurant, which looks quite silly) and I don't understand how. This restaurant needs some serious guidence and proper sanitation/ health and saftey trainning. I commend the servers for their great attitudes but not for their practices. The decor could also use some updating, the back room looked likes a 80's banquet hall, and the front looked like someone had tried to make the room look updated but it turned out looking more tacky.", "Date": "November 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "SE WI", "Title": "“Nice, quiet and family friendly, too!”", "Author": "Zahava", "ReviewID": "UR47262557", "Content": "My husband and I stayed here for a weekend. It is a large complex with many kid friendly areas, but it was very quiet., although right off a major highway. The staff are extremely friendly and eager to help. The ONLY thing i did not care for was the $7.00/day charge to park in their lot, and there did not appear to be options-you can come and go without additional charges during the day.", "Date": "October 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, Ontario", "Title": "“Great staff, great food, great value.......Will stay again”", "Author": "AmblesideInn-Host", "ReviewID": "UR45831526", "Content": "I travelled this weekend with my mother and 2 sisters. It became my responsibility to book the hotel. I depended on the reviews of this Holiday Inn to make my choice and I wasn't disappointed. From check-in to departure, the staff were all polite, pleasant and helpful. When we need 2 additional mugs for morning coffee and an extra bath towel, they were delivered to our room within minutes.......and this was 9pm on a Saturday night. Our pre-fixed 3 course dinner was excellent as was the service provided. The breakfast buffet was filled with a wide variety of items for every taste and the quality was excellent. I'm sure we'll be back for next year's Mother/Daughter get-away weekend.", "Date": "October 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Very hospitable”", "Author": "Sammy2607", "ReviewID": "UR39714620", "Content": "I stayed at the Holiday Inn for a week with extended family during my visit to Canada and was very impressed. Although some may feel it is not really a place to call a hotel I couldn't disagree more. We were dropped off to the hotel by family and went to check in. The staff at the hotel were extremely welcoming and friendly and we had no trouble at reception. We were shown to our rooms which were opposite each other, and I got quite a shock. The room was huge, with a large wardrobe and bathroom. I was sharing the room with my sister, so we had a double bed which was enormous and very comfortable! Our window looked down to the inside of the hotel where the pool and restaurant were, but we didn't hear any noise at all. The room was kept very clean by the excellent housekeeping. Down the corridor was a machine for drinks and ice which came in handy for late night snacks. The TV was very big and could play many channels. The breakfast was nice, with tea, coffee, eggs and more. The servers were all very polite and we could talk with them without being made to feel a nuisance! Even after me and my sister left out key in the room, the staff at reception had no issues sorting our problem out right away. We enjoyed our stay at the Holiday Inn and was surprised by how attentive their staff was, and generally how nice the hotel was inside.", "Date": "September 3, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Rooms": "4", "Service": "5", "Location": "5"}, "AuthorLocation": "Berlin, Germany", "Title": "“One of the best HOLIDAY INNs in Toronto-great indoor experience”", "Author": "rogue2009", "ReviewID": "UR38669384", "Content": "Westtower rooms are noisy. The rest of the hotel is a great experience. It offers a huge lobby hall with indor tennis, swimming pool, pool table and romantic restaurant as well as a fitness room. From the nearby bar, parents can supervise the children playing or swimming. The hotel has a very good access to the city metro system (30min.from city centre).", "Date": "August 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Montreal", "Title": "“All around , very nice”", "Author": "Louislesvins", "ReviewID": "UR35258652", "Content": "We were heading to Detroit from Montreal and stopped in at this hotel for the night. The service is great. The hotel is very clean and the rooms exceptionally quiet. The food at the restaurants is expensive. (20$ for breakfast buffet) But i guess its toronto! Its right next to a big mall. Free WIFI was a great plus.", "Date": "July 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "timmins,ontario", "Title": "“exceptional service”", "Author": "tichine", "ReviewID": "UR24434707", "Content": "the staff at this property are well trained and I was always met with a smile and a courteous remark the food was above expectation... the lunches were looked foward to ... the warm cookies at break were a treat!! the fruit was fresh and flavourfull... well done!! I must add that after a particularly heavy snowfall, my vehicle was swept off, when I went out to take a day trip.. this was REMARKABLE - keep up the good work...", "Date": "February 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ontario", "Title": "“Happy Kids, Happy Parents”", "Author": "SillyWillie", "ReviewID": "UR24312745", "Content": "My family and I are repeat visitors to the Holiday Inn Toronto-Yorkdale primarily because of the child-friendly amenities and the convenient location across from the Yorkdale mall and subway system. Having an infant, a toddler and a school-aged child, safety and cleanliness are critical and neither has been an issue for our family at the Holiday Inn Toronto-Yorkdale (unlike at other hotels). As well, traveling with an infant has its challenges, but the front-desk staff and the kitchen staff have been extremely helpful in heating baby bottles for us when needed (again unlike many other hotels). We know as parents that weâ€™ve made the right hotel choice when our kids ask to go back. Thank you Holiday Inn Toronto-Yorkdale for helping us create happy memories with our family!", "Date": "February 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ontario", "Title": "“Torchbearer well deserved....”", "Author": "BernadetteOntario", "ReviewID": "UR24206002", "Content": "Holiday Inn Yorkdale is a rare find...excellent location for business and shopping...staff who are warm, accommodating and well trained...a housekeeping department well above average...the most pleasant surprise was the accommodation for the children/grandchildren...a quaint poolside clubhouse complete with an excellent child care supervisor to encouarge arts, crafts and sporting activities....the young ones loved it!!!", "Date": "February 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "St. Croix", "Title": "“Nice location and lovely people”", "Author": "DHC6Driver", "ReviewID": "UR24174737", "Content": "I stayed here for a week and would highly recommend the hotel. The staff was extremely helpful and very pleasant to deal with. The rooms are clean, beds are comfortable, and the heater in my room was excellent. Across the street is a large mall that has a pharmacy, there is a foodcourt if you tire of the hotel restaurant-which was excellent. This is the second time I stayed here and I would definitely stay here again.", "Date": "February 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montreal, QC", "Title": "“What an Exceptional hotel”", "Author": "Alan_MrPig", "ReviewID": "UR24004284", "Content": "As a frequent guest of the Holiday Inn Yorkdale I cannot begin to tell you what a wonderful hotel this is. The hotel is located right alongside the 401 and is therefore easily accessible for most of my customer visits in the Toronto area. The hotel is very well appointed and provides all of the modern necessities. The rooms are very clean and have been updated regularly over the years. The main reason though that I love this hotel is the staff. As a frequent traveler I have stayed in numerous hotels but I have never stayed in another hotel with staff as exceptional as the Holiday Inn Yorkdale. The Management at this hotel provides their employees with the motivation to excel in customer service. From the friendly smiles at the front desk to the incredible staff at the restaurant this hotel provides the standard that all other hotels should strive for. Each week, the management throws a fantastic customer appreciation night. This has become an excellent means of interacting not only with the staff but also with the other frequent guests that share the hotel with me. We share stories, jokes and even the occasional song. This is an event that I look forward to with each visit. So you may be asking why after staying at this hotel for so long I am only adding a comment now? Last night in Toronto there was a snow storm. When I went out to dig the snow off my car I found that every car in the parking lot had been cleared of snow by the hotel staff. This is a fantastic example of the level of customer service that emanates throughout the entire hotel. So if your travels ever bring you to Toronto, I highly recommend this hotel. If you do stay at the hotel, just tell them that Alan sent you. They will probably know who you are talking about!", "Date": "January 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hamilton", "Title": "“Delightful Surprise”", "Author": "clcotton", "ReviewID": "UR23988989", "Content": "Whenever possible I stay at the Holiday Inn and have come to expect a high level of customer service. The Holiday Inn at Yorkdale exceeded my expectations. An example of its exceptional hospitality was the evening reception for priority guests. It offered a laid-back venue to socialize and relax after a hectic day. The guests were from around the globe and the conversation engaging. The decor in the public areas is warm, inviting and calming. You will enjoy your stay.", "Date": "January 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ontario's Near North, Canada", "Title": "“Priority Club Check-in Impressive”", "Author": "NorthYorkian", "ReviewID": "UR23810858", "Content": "I stayed at the Yorkdale Holiday Inn from 20-21 Jan 09 while on business. I arrived at approximately 8:30 pm and was able to experience the personalized check-in that Priority Club members are entitled to. Once you identify yourself as a Priority Club member you are asked by the front desk staff to check-in through a private room set off to the side. In this room I was met by the lovely Caroline and the smell of fresh baked cookies. Check-in was very friendly and efficient. You are also offered a glass of sparkling wine, sushi and a grab-bag of soda, chips and breakfast bars to take up to your room. Finally, I was also given a coupon for 25% off breakfast for each of my nights stay. Very nice touch indeed. I was given Room # 1235 in the East Tower which I was led to believe was an upgraded room. This room was on the top floor, was at the opposite end of the elevators and had a balcony facing the Yorkdale Shopping Centre. Unfortunately, I found the room to be a little disapointing as it only had two standard beds (vice queen size), had paint/wallpaper peeling by the balcony door and had smallish bathroom. This opinion is in relative comparison with a room I had in the same hotel six months ago in the West Tower which seemed larger and nicer. Although I am not 100% sure, my sense is that the hotel was fully booked and due to my relatively late arrival, I was given what was left-over. Due to my short stay, I did not complain and accepted the room as presented. Due to my schedule, I was not able to make use of my breakfast buffet coupons however the coffee bar was very convenient, if not a little pricey. The hotel lobby was very clean and efficient. The waiting area was well appointed with stylish sofas and chairs and the gas fireplace is a nice touch on a cold, winter evening. I did find the bed linens to be clean and crisp. The towels were new and fluffy. Overall, the room was very clean and quiet. I can see why this hotel's housekeeping wins awards. Finally, I too found the wireless Internet to be quite slow, although it was complimentary. I am not sure whether my location on the 12th floor had anything to do with the signal strength. Overall, I enjoyed my stay and would recommend this hotel to either business travellers or families.", "Date": "January 23, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Henryville", "Title": "“Good hotel overall, beware of extra charges!!!”", "Author": "salusas", "ReviewID": "UR22396118", "Content": "I just returned from a 3 day stay at the Holiday Inn Yorkdale. Like many other reviewers, I found the staff extremely friendly and helpful. The hotel is nicely appointed and the rooms very clean and comfortable. I was traveling with a baby and as I've done at other Holiday Inns (I'm a Priority Club member and stay almost exclusively within the chain) , I requested a fridge and microwave for my room, necessities for feeding. In past stays at other hotels, these have always been provided free of charge. I was told there would be a 12$/day fee for the fridge and there was no microwave available. When the fridge arrived I was surprised to see how old it was. You'd figure if they are going to make you pay extra, you might actually be provided with a current model! When I reserved my room I opted for the Best-4-Breakfast rate. Agin, at other Holiday Inn stays, this has always provided me with extra value for money when enjoying breakfast at the hotel restaurant. In this case however, paying the $20 premium per night only resulted in a voucher for $20 off my breakfast bill. Huh??? The staff were all very professional and the hotel itself was quite nice, I guess my gripes are with managerial decisions that leave me scratching my head. All in all a good stay but beware of nickeling and diming at this one.", "Date": "December 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Ontario, Canada", "Title": "“Good price, nice rooms!”", "Author": "PMedMoe", "ReviewID": "UR21246296", "Content": "I stayed here for business on Oct 14-16, 2008. This was my first time at this Holiday Inn and I have to say, it's a very nice hotel. The King rooms are spacious and have plenty of amenities although the wireless internet is pretty slow. The hotel's bar and restaurant were above average and the food was fairly good. What I really enjoyed was the little coffee stand in the mornings. Get the breakfast blend, it's the strongest! Express check out was great as I didn't need to stop by the front desk at all. My bill was slipped under my door sometime through the night and all was correct. I wouldn't hesitate to book this hotel again or recommend it to others.", "Date": "October 26, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Dartmouth, NS", "Title": "“Good Hotel, Horrible Service”", "Author": "appletravel81", "ReviewID": "UR19803235", "Content": "We have just returned from our four day trip to Toronto in which we stayed at the Holiday Inn Yorkdale. After winning so many awards and seeing the beautiful pictures I was confident that our stay would be great. Upon returning to our room on the second evening we found our patio door opened, which we discovered wouldn't lock. After notifying the front desk they assured us that it would be fixed in the morning. Two days went by and they never fixed it, along with no face clothes one night (they sent us up 3 hand towels and 1 face cloth) and the Cafe Express not being opened because of their summer hours (no signage to indicate this). This hotel has a \"Hospitality Promise\" that states that you will not have to pay for the portion of your stay that you're not satisfied with. Since I wasn't satisfied for the last two nights of my stay I mentioned this at checkout and the manager tried to refund us $50 which he switched to one night free once he found out that the first representative offered the four of us all free breakfast which was a better offer than his, even though $50 off was \"his best\". I couldn't believe that a hotel with so many awards could have such poor customer service and they instructed me to call 1-800-Holiday for more of a refund. Upon calling their toll free number one of the managers told me I should have left the hotel and one nights refund was sufficient in her opinion. I will pass on Holiday Inn's own recommendation to everyone and recommend that you stay at another hotel. Obviously the safety and satisfaction of their customers is not a priority and they do not stand by their Hospitality Promise.", "Date": "September 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Long Island, NY", "Title": "“Fabulous Hotel - Service and quality”", "Author": "NYMom_of_2A", "ReviewID": "UR19624968", "Content": "This hotel was clearly built in the 60's or 70's - but has been updated beautifully. The entrace to the hotel is tricky - through the lot of a car dealership. It looks as if the road was widened and the hotel lost their entrace - but once you figure out how to get in to the hotel - it's a great experience. The rooms have been updated with granite countertops, nice furniture, a comfortable easy chair and roomy desk with a comfortable office chair as well. There was adequate room for 4 suitcases and more, the beds were reasonably comfortable. But the best parts of this hotel are the restaurant, the staff and the indoor sports/pool area. I've seen other Holidays Inns with atrium areas - but they are usually made up of a pool, jacuzzi and lots of arcade types video games. However this Holiday Inn has a nice pool, jacuzzi, sauna, workout area with enough machines to occupy about 10 people, an indoor miniature size tennis area (carpeted!), pingpong and a toddler area with toys and coloring and changing rooms. All of this is free for guests. There's also a pool table ($1.50 a game). The restaurant is nicely appointed - but you woulnd't expect the food to be of the very high quality that it is. We had the breakfast buffet 2 mornings ($17.95 - and kids eat free) and it includes everything from eggs benedict, sausage, ham, bacon to smoked fish (high quality) fesh fruit and these amazing smoothies . The french toast, bakery/home made breads were delicious - all very much worth the money. The dinner buffet had a limited entree offering - but entrees were made to order and were done perfectly. The night we were there the available entrees were salmon, shrimp, steak & pasta. The steak was prepared with a flavorful rub and grilled perfect to medium-rare. The salmon was panfried with a sweet & tangy glaze. Pasta and shrimp were also done perfectly. The salad bar was gourmet - fresh mozzarella, cold seafood salad, smoked fish and roasted vegtables, and all varieties of lettuce and accoutrements and the breads were artisanal. Kids could eat free from a kids menu (mac & Cheese, mini-pizza, etc.) or half price fromt he buffet. We had one kid take the pizza dn one dop the half price buffet. She loved the food. But above all - the service here was fabulous. All of the people we came in to contact with - waiters, the buffet chef, the young lady manning the pool and sports area, etc. were all very helpful. They offered useful travel advice, another got me a map of toronto and made a call to get open and closing times of a lcoal atraction, etc. All offered without me hainv to ask. And no matter how many tennis balls got lost in the bushes surrounding the indoor sporting area the young lady was always sweet and kind and managed to find another tennis ball somewhere. My kids wanted to stay at the hotel \"forever\". Tip - the mall is across the street and the subway is on the grounds of the mall - but it is on the far side of the mall and involves a walk of about 3 city blocks by the time you cross the parking lots on both sides of the mall and a very heaviuly trafficked street. So you may want to drive your car to the other side of the mall if you're taking the subway and are traveling with kids. Tip - the hotel does charge a $7 parking fee. I don't know why - and it really doesn't make sense. Given how fabulous this hotel is they should just add the $7 to the rate.", "Date": "September 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Fantastic place to stay.”", "Author": "mamajuls", "ReviewID": "UR18017216", "Content": "The Holiday Inn Yorkdale was lovely. I have not stayed at a Holiday Inn in years and was very pleasantly surprised. Check in was very efficient and because we are members of their free \"Priority Club,\" the kids were all given Welcome Bags upon check in, with chips, drinks, Nutri-Grain bars and some other items. Everyone was extremely friendly and helpful. The rooms were large, very nicely decorated and very cozy comfy beds. There is a large atrium area with a pool, hot tub, small tennis type court, supervised kids play house of sorts and a ping pong table. There are some rooms with balconies either overlooking the pool are or the front of the hotel. There was also a restaurant with a very nice but sophisticated eclectic menu, most entrees around $20.00 and a children's menu with a good selection. When we returned to our room in the evening, there was a message from the front desk checking to make sure we had everything we needed and a little box of chocolate truffles with a card. There is a very large updated mall across the street where one can board the Toronto subway. All in all, the whole family gave this hotel very high marks.", "Date": "July 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Co Clare", "Title": "“Great staff, but guest rooms need freshening up..”", "Author": "MDH_CoClare", "ReviewID": "UR14601645", "Content": "I've stayed at the Yorkdale Holiday Inn a couple of times in the past 6 months, and the staff are probably what makes this hotel worth coming back to. The team at the Yorkdale could teach their counterparts at some of the more 'celubrious establishments' the true meaning of the words 'Customer service'. The Public areas look good, food is very good, overall atmosphere in the hotel is also good. Conference facilities are generally fine. However, the hotel guest rooms are in need of an upgrade. They look tired and shabby in my experience, but clean and well serviced. Having to go and pick-up a piece of equipment at the reception desk to get internet access is inconvenient (vs making it directly available in the rooms), but it works and it's free.", "Date": "March 28, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "kingston", "Title": "“surprising!”", "Author": "masi1", "ReviewID": "UR11174992", "Content": "This hotel has many plaques and posters proclaiming its assorted awards for customer service, and I must say, I really like it here. I've stayed there for business (it's a great location if you are in the fashion industry as all of the Toronto reps are 5 minutes away), and with my toddler (great indoor pool and games area). The hotel is spotless, the beds are comfy, and I enjoy how close I can park (for a fee). It is across the street from arguably the best mall in Toronto (Yorkdale Shopping Centre), and it is right on the 401 if you need to hit the road, or you can pick up the subway at the mall. It's primarily a driver's neighbourhood, so if your attractions are downtown, stay downtown. Otherwise, I'd recommend it. The room service, coffee bar and yes, sushi, are great. It's not your typical Holiday Inn, as the family aspects of the Holiday Inn stereotype are represented (in a good way), and the business traveller would find it up to par as well. I will stay there again.", "Date": "November 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Penetang", "Title": "“Classiest Holiday Inn Ever”", "Author": "ckjjst", "ReviewID": "UR8682215", "Content": "Can't say enough good things about this hotel. We were greeted quickly and pleasantly on arrival. Room was very spacious, luxurious, clean and odor free. All the staff we encountered were friendly, helpful and always smiling. Pool is a salt water pool, was very clean and a heavenly 88 degrees. You won't be sorry you stayed here. Our 2 girls aged 8 and 9, who are no strangers to hotels, said they felt like royalty at this place.", "Date": "September 9, 2007"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Buffalo, New York", "Title": "“Clean and great for kids”", "Author": "H203", "ReviewID": "UR7430955", "Content": "My family and I went to Toronto for the weekend and stayed at The Holiday Inn Yorkdale. The hotel was exceptional for the price. We were greeted quickly and were made to feel welcomed right away. The staff were pleasant and accomodating. Our room was in the West wing. The room seemed newly remodeled and was VERY CLEAN. The bathroom was large with a full length countertop. The beds were comfortable. We were given a room overlooking the pool area. The pool was large enough and very clean- with a whirlpool and sauna in the same area. The hotel has a small fitness room and a kids' area (more for toddlers-5 years). There is also a pool table, a ping-pong table and a \"tennis court\" with a foam ball- lots of fun for the kids. We ate in the hotel restaurant for breakfast. We had the buffet which was very good with a great variety. Kids eat free- but the adult prices are high. My husband and I paid $17.00 each for breakfast. Although the price was high, it was not high enough to keep us from going back for breakfast the next day! One additional tip- the mall across the street has quite a few restaurants to choose from. We ate at The Pickle Barrel and had a great meal. The drive into downtown Toronto was about 15 minutes to 30 minutes straight down Dufferin depending on the traffic. I would definitely stay at this hotel again.", "Date": "April 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "ontario", "Title": "“excellent service”", "Author": "steffycanuck", "ReviewID": "UR5835658", "Content": "it is rare these days to find a hotel that exceeds expectations. we arrived at the HI yorkdale at 1 pm and were immediately checked in to our priority club gold floor room, given gift bags with chips, iced tea, water and a nutrigrain bar and warmly welcomed. sarah from guest services called to check on us about an hour later. the room was lovely, with nice amenities and a view of the toronto skyline in the distance. we were just across the street from the huge yorkdale shopping centre (which is under MAJOR renovations right now, which is a bit of a pain) and spent a couple of hours there before heading downtown on the subway for dinner and an evening of theatre. (go see Legends, it's a hoot!) We had a quick latte and croissant at the coffee bar in the morning before heading out. I would also like to mention that there was a long line at the coffee bar and two staff members immediately moved in to help out and ease the wait. Excellent, excellent service. Parking was also only $6/day with in and out priveleges. We will stay there again for sure.", "Date": "September 25, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "durham", "Title": "“well recommended”", "Author": "canadabound", "ReviewID": "UR5631529", "Content": "The hotel is very easy to find from the airport,outside not particularly impressive but extremely nice inside.The indoor pool is situated in the main atrium area and is set out like an indoor tropical oasis,restaurants and bar area all set amongst this very fun looking area. the hotel has separate floors for members of the priority club hotel loyalty scheme-as a gold member we were given 2 free breakfast passes,otherwise the food would have been pretty pricey. The shopping mall over the road had a good variety of shops and eating places and from there the subway system will get you into central Toronto in under 30 mins for approx$2 each", "Date": "August 21, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Detroit, MI. USA", "Title": "“Very nice hotel”", "Author": "cucauribe", "ReviewID": "UR5607238", "Content": "I just arrived from a longweekend on Toronto. The city is fantastic but I am here to write about the hotel. I agree with most of the comments (as usual) about this Holliday Inn. It is a little far from downtown Toronto (20 minutes in car) but the price was good and the hotel is VERY NICE. From the outside it looks like any hotel next to a big highway. But on the inside it is very nice. The staff was VERY nice, the rooms were nice and the buffet breakfast on the restaurant was delicious! The only bad experience on this hotel was that the bottom of the toilet was a little dirty. I called to ask for this to be cleaned and they did it right away. Overall, if you stay here I think you will like it very much, just be prepared to be a little far from downtown.", "Date": "August 13, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "3"}, "AuthorLocation": "MontrÃ©al", "Title": "“Great Hotel but Really Out of the Way”", "Author": "Roger123", "ReviewID": "UR4949661", "Content": "I am at this hotel as I write this making use of the free wireless internet in the rooms. I agree with other posts about the friendly service; it really is friendly and efficient. The rooms are pretty typical for a mid-priced chain equipped with iron and ironing board. Note that there is no minibar, safe or bathrobe although you can rent a small fridge from the hotel. The maid service seems very efficient and the rooms are well cleaned. The restaurant is great and there is a small coffee bar where you can get a cafe lattÃ© to go in the morning. The restauarant has a wide selection and pretty decent sushi provided by a caterer. Yes this hotel is across the street from a very large and upscale mall and the subway is a 10-15 min walk away. But, and here's the thing, that is all that the hotel is near. If you want to out for an evening stroll you are walking beside a very busy road through essentially a commercial (not retail) area; not very pleasant nor interesting. So, all in all a great hotel for the price but I think I'd rather be in an area that is a little more walkable so I didnt feel quite so stranded without a car.", "Date": "April 7, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Bedford, UK", "Title": "“Great Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3184393", "Content": "Stayed in this hotel whilst travelling through Canada last October - read the reviews on Trip Advisor before I booked and was not disappointed. We had no problems with the hotel accomodation, or the staff, although I would say it was aimed towards the business traveller, rather than the individual. Didn't stay long enough to sample the pool (which is rather public!) etc, so can't comment on that, but everything else was fine.", "Date": "February 14, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Essex, United Kingdom", "Title": "“Wonderful Hotel”", "Author": "Melanie_2004", "ReviewID": "UR2180802", "Content": "We stayed at the Holiday Inn Yorkdale from 28th March - 7th April this year. I have to say it was a wonderful hotel. The staff were excellent, very helpful, and service was 'top class'. The outside of the hotel is a little off putting, but once inside you will not be disappointed. The pool looked lovely, but slightly on the small side. The restaurant for breakfast was one of the best i've ever had, although a bit on the pricey side, but worth it for a treat. Our room was on the 8th floor and had a wonderful view of downtown Toronto, and was very spacious, the bed was the biggest i've ever seen in a hotel. This hotel is in an excellent situation, opposite the Yorkdate Shopping Mall, with the subway station a 15 minute walk away. Overall I would consider this hotel as an excellent choice, and would go back again.", "Date": "June 10, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Raleigh", "Title": "“Great service and Locale”", "Author": "wordmobile", "ReviewID": "UR1399878", "Content": "When your business requires you to stay at Holiday Inns, you get a good feel of which ones are top in service and quality. This one is up therebig time! Dont be bothered by the outdated red-brick highrise look. Inside you have superior service, excellent rooms and a top-notch restaurant. Located off HWY 401, its north of downtown Toronto and 15 minutes from the airport, and Â¼ mile walk from Yorkdale Mall and Torontos subway system. Toronto is a mega city in area and population -- so the subway gets you lots of places without the problems of car parking. I could stay at the Hyatt downtown, but the staff and service at Holiday Inn make me return as a regular customer.", "Date": "October 20, 2003"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Ottawa, Ontario", "Title": "“Great Service at Yorkdale”", "Author": "A TripAdvisor Member", "ReviewID": "UR1223276", "Content": "This hotel is probably the best Holiday Inn that I have stayed at, and I have stayed at over 100 different Holiday Inns in North America. It is in an excellent location if you are driving, right off the 401, near the subway, and less than a half hour drive to Wonderland. It is great for kids as well as for business.", "Date": "August 12, 2003"}], "HotelInfo": {"Name": "Holiday Inn Yorkdale", "HotelURL": "/ShowUserReviews-g155019-d183067-Reviews-Holiday_Inn_Yorkdale-Toronto_Ontario.html", "Price": "$144 - $194*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3450 Dufferin Street</span>, <span class=\"locality\"><span property=\"v:locality\">Toronto</span>, <span property=\"v:region\">Ontario</span> <span property=\"v:postal-code\">M6A 2V1</span></span>, <span class=\"country-name\" property=\"v:country-name\">Canada</span> </span> </span> </address>", "HotelID": "183067", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/bf/ee/7f/holiday-inn-toronto-yorkdale.jpg"}}