{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "alberta", "Title": "“Customer Service? Where???”", "Author": "chergib", "ReviewID": "UR126618291", "Content": "We booked a room at this hotel through Air Canada for a place to shower and have a quick nap during a 6 hour layover. We requested a 3:30am wake up call that we did not get. When I asked the front desk clerk why we hadn't received our call she said that the system was down, yet another guest said that they had received their wake up call. Our room was 4 rooms down from the front desk and she never got off her fat !ss to wake us up. Good thing that my husband had suggested setting the alarm just in case. Our shuttle driver also decided that it would be a good idea to run to another hotel on the way to ours and do a little pickup. Not great if you have been up for 18 hours already. DO NOT STAY HERE.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Hamilton, Canada", "Title": "“Undercoverboss should visit here”", "Author": "taylorsdad", "ReviewID": "UR126070797", "Content": "Where to begin. They did not have our reservation for smoking room and made this mistake on our stop over before and after our vacation. Property is in disrepair with dangerous ice on all walkways (no effort to clean it up. Beds pathetic; could hear noise of every adjacent rooms. Room not made up. Free breakfast better at homeless shelter then here. Al-round ghetto experience. Spend 20 bucks more and get a real hotel. Shut this place down", "Date": "March 13, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Decent value with parking”", "Author": "Fr8guy", "ReviewID": "UR125839866", "Content": "The room was clean and ready at check in. The front desk service was horrible. At first I was told that my reservation didn't include parking. When I pointed out that was the reason I was staying, she reread my paperwork and 'found' where it said parking was included. There was no restaurant on site so I was directed to a menu board. I had to place the order from my room as there was no courtesy phone. At checkout, I was charged $1 for the local call. I unwillingly accepted it until I returned to my room to see 'FREE LOCAL CALLS' written on the phone. When I insisted on a refund I was told they couldn't. I was adamant and the clerk finally relented and processed the transaction stating that she 'didn't see what the big deal was ... It's only a dollar'. The night before, while waiting for my food, I decided to visit the bar. There was no attendant. To get a beer, I had to go to the front dear, get the key, serve myself. I wasn't able to get a second beer because the front desk was 'too busy' to pass me the key. EXTREMELY DISATISSFIED", "Date": "March 9, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "", "Title": "“Okay if you need it for the parking”", "Author": "dr_mas80", "ReviewID": "UR125208325", "Content": "I parked my car at the hotel for 7 days and had to pay 90$ tax included with one night stay afterwards. For me it was a pretty good deal. The receptionist was very rude as when I called from the airport to ask about the sign on the shuttle bus she was very offensive that the bus was there and I should have called to ask for it , I explained to her that I wasn't complaining and I just wanted to know the sign on the bus so I can know it at the airport , the shuttle bus has a sign of a different hotel too ( parks inn ) , the washroom was clogged and the room was outdated but it was okay and I didn't smell anything too , breakfast was croissant , coffee,milk. On checking out I found a lady with her dog in the lobby , I didn't know that it's pet friendly , if I knew it I wouldn't book it for sure. But considering what I paid for the parking only I was happy for the deal.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Ottawa, Ontario, Canada", "Title": "“A total dump”", "Author": "Ken A", "ReviewID": "UR123330031", "Content": "Sleep in your car before staying at this place. This place is hard to find, stuck in the middle of an industrial park, was probably built in the early 50s and not renovated since except maybe to add a weird atrium so your room door, which formerly opened to the outdoors, now opens to the atrium. Spend $10 more and find someplace else nearby.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Average but affordable”", "Author": "labrecquee", "ReviewID": "UR122574884", "Content": "2nd stay at this property. It's affordable to stay in Montreal for a couple of days if you are going to visit family and drive. It's not exactly well connected to the public transit. The parking lot is huge, but most of the closest spots will be full with cars that stay there a long time. The hotel is rated 2 stars so it's not a luxury hotel. Breakfast is decent although limited in variety. Agree with an other rating that the room will influence the quality of the experience. This time, we were warm but the last time it was a bit cold. We had granit countertop while the last time it wasn't. Ultimately, I'll go back for the price.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Don't recommend it”", "Author": "tcdubs", "ReviewID": "UR122385578", "Content": "I left my car here while on vacation and stayed 1 night afterwards. No complaints about the parking. I was very unhappy with the room. The room we were assigned ended up being full of folded-up beds, shoes, and cleaning carts ... it was being used for storage I guess. I went back to the lobby to ask for a new room. The next room was a smoking room (and it was VERY smoky), but I requested non-smoking when I booked so I went back to the front desk to change AGAIN. The next room I was given had not been cleaned ... the bed was unmade and the towels were dirty. The FOURTH room we were assigned looked ok through the window but our swipe card would not work. I went back for a new card. The receptionist made me a new card which also did not work. She then gave me a real key to use, saying that I had to bring it back after. (All rooms were on the 2nd floor, so I made 6 different trips to the front with my luggage). I think the key she gave me might have been the master key or something (WTF???????) because at 1am we woke up to the shuttle bus driver and his friend knocking on the door asking for the key back. Not a phone call from the front desk asking for the key, but sending two men up to knock on my door in the middle of the night asking me to open the door for them. The thermostat didn't work and the room was very hot. I asked for a discount in the morning ... the new receptionist was sympathetic but said she could only give me a $10 discount because I booked online.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Richmond, California", "Title": "“A little isolated”", "Author": "Antroxu", "ReviewID": "UR120133949", "Content": "This hotel from the Econo Lodge chain is a little isolated and not very easy to find, specially if you arrive late by night, since it is located within an industrial area. If you are hungry, you will have to drive a few miles to reach the nearest restaurant. On the other hand, it's clean and well maintained and about 3 miles from the Montreal international airport.", "Date": "November 3, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Fredericton, Canada", "Title": "“Very basic, but clean.”", "Author": "KSelway", "ReviewID": "UR117335100", "Content": "It isn't a fabulous hotel but the sheets smelled like they were recently bleached and the room was clean. It is a little difficult to find if you aren't familiar with the area. The staff checked us in even though we were early, which was super nice.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Toronto, Canada", "Title": "“Good if you lack a sense of smell. Otherwise, stay elsewhere.”", "Author": "MaestroBobCobb", "ReviewID": "UR116922347", "Content": "If the smell of stale cigarettes, the obtrusive look of 70s-style blue and orange carpeting, and soap that smells like rendered animal fat are your kinds of things, then by golly gee Mister, you found the right hotel! But, if you're like everyone else and don't fancy the above, I'd consider staying away. Far away.", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Montreal, Canada", "Title": "“\"Will never be back to Ecololodge,even if they offer me free\"”", "Author": "ganesh m", "ReviewID": "UR116558795", "Content": "Stayed in Econolodge for 2 days with my family for business trip.Hotel is just the dirty place including the manager,workers and owner.The free breakfast is like outdated food bought from FoodBasics or Dollarama. No quality in hotel and not even fridge or Mirooven in the room and No Coffee maker\" My overall experiance was very bad from checkin to checkout. There is no lift and we have to manually carry our lagguage and no one to guide about the room and help for any basic needs like pharmacy etc. no restaurants near by and its just like hell.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "2.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Toronto", "Title": "“Extremely Basic Room”", "Author": "geoa5", "ReviewID": "UR113023680", "Content": "We stayed here for one night in June. The reason we chose this property was becuase of the price. It had the lowest price period of all the hotels I found; still not really cheap since it was the Grand Prix weekend in Montreal ($100 plus tax), which is a high price for what you get there. The room is extremely basic, old furniture, but bed/pillows were comfortable and clean; and so was the bathroom. Old furniture otherwise, and no fridge. Free wireless internet, and good speed. The staff was friendly. A continental breakfast was included. The choices available were croissants, muffins, toast, 4 cereal choices, toast, and coffee/tea/O.J. So very basic, but decent and fresh, and included in your room price. It was extremely difficult for me to find this property as my GPS for some reason wouldn't locate it. We didn't have any problems with parking. I would only stay at this property again, if the price was much much lower than other properties, which was the case this trip.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "", "Title": "“WARNING YOUR CAR WILL GET TOWED if you choose to park car there when you fly, also old dirty rooms and awful customer service, p”", "Author": "sarahnm1987", "ReviewID": "UR100652289", "Content": "Hotel does not have enough parking spaces to accommodate the amount of rooms they book out. Instead they tell you it is ok to park in the far end of their lot (when these areas are actually for a nearby steakhouse and bently dealership) and while you ate away on vacation your car gets towed. Coming back from holidays to this was a disaster. After complaining endlessly the manager contacted the owner (who lives in toronto) and he said he wouldn't do ANYTHING about it, even though it was the mistake of his customer for telling us to park there. Save youself a few hundred dollars of cab fees (to get to laval), impound fees, and a huge inconvienece and delay and STAY ANYWHERE ELSE!", "Date": "March 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Edmonton", "Title": "“OK for a one night stay”", "Author": "The_Travel_G0ddess", "ReviewID": "UR100547102", "Content": "Stay here if you need a relatively cheap stay over hotel within reasonable distance to the airport - remember you get what you pay for. There is a free shuttle service to and from the airport and a basic continental breakfast included.", "Date": "March 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Very comparable to PSYCHO's Bates hotel!!!!!!!!!”", "Author": "boogie1952", "ReviewID": "UR100189232", "Content": "Seen hotel and pics online.Rooms looked NOTHING like advertised.Paid for 11 nights to stay in advance but stayed for ONE after seeing room.Room smelled like stale cigarettes,hair found on supposably clean sheets,furniture was old and beat up.Checked out and asked for refund for the 10 nights we didnt stay there were STILL fighting after almost a month to get back our money after the staff gave us the run around and basically blamed us for paying our room in advance with debit.Staff were rude and told me to \"quit phoning\" when i was there basically because my daughter was having a surgery.Witnessed cleaning staff and manager in a screaming match with each other in front of other customers.VERY unproffesional.Hallways were freezing as the staff sitting at the front door wearing winter parkas should have been a dead give away!Room was hot and uncomfortable as we could not control the heat.WORST hotel ever stayed at and would not recommend for ANYONE to stay here.", "Date": "March 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Montreal, Canada", "Title": "“Unscrupulous management”", "Author": "stellier68", "ReviewID": "UR94498230", "Content": "For those wondering how the Hotel can offer a Park-and-Fly service that cheap? Easy, they simply (illegally???) invade all the nearby parking spots from the neighbourhood which include: office buildings and restaurants... I guess that this type of rodent-infested, stinky hotel needs some very creative marketing strategy to pay their bills...", "Date": "January 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "4"}, "AuthorLocation": "New York, NY", "Title": "“Difficult to find, basically ok, lacks parking”", "Author": "jamish2007", "ReviewID": "UR92134277", "Content": "One night stay before a flight. Hotel is awfully difficult to find -- GPS would help! Room was clean, beds comfortable and shower nice; but room was excessively warm and too noisy from people walking on floor above us and leaving for airport at all hours. The free breakfast was supposed to start at 6:30 but we stopped by at 6:40 and there wasn't anything but cereal and toast without any milk, coffee, OJ etc.", "Date": "January 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Red Bank, New Jersey", "Title": "“Not Econo Lodge; Cheap Lodge”", "Author": "jcoafamily", "ReviewID": "UR74098228", "Content": "The room has big brown stains on carpet, smells musty leaving one wondering cleanliness. Bathtub clogs. Left after one night eventhough paid for two. Would not recommend to families.", "Date": "August 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Falls Church, VA", "Title": "“WORST DUMP I've EVER STAYED IN!”", "Author": "ctbeachbm", "ReviewID": "UR72869375", "Content": "Stay away from this hotel at all costs. Terrible neighborhood with the worst parking lot I've ever left my car in. The worst part of this hotel is the fact it had NO HOT WATER. Nothing like travelling 16 hours to arrive at a hotel with no hot water. When I called the front desk and asked when it would be turned back on I got no apology and a response of \"I have no clue.\" It never came back on during my stay, disgusting that they served their continental breakfast the next day.", "Date": "July 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Toronto", "Title": "“YOU GET WHAT YOU PAY FOR .....”", "Author": "Bkog", "ReviewID": "UR68033005", "Content": "PLEASE IGNORE MY COMMENTS ABOUT THE DAYS INN ST LAURENT - THEY SHOULD HAVE BEEN PUT WITH THIS HOTEL. As another reviewer said - NO FRILLS, and cheaper than others. Best thing was the very nice and helpful staff. Otherwise, very hard to find the place, no drive-up front door - you need to park and walk around the building to check-in. Rooms are not very clean (hair on bathroom floor etc), rooms need fixing (broken toilet) and updating (old carpets, holes in blankets, lumpy small pillows, etc.) Best part of breakfast is it's free = very basic cereal, toast, muffins, coffee & juice. Fairly quiet. OK for one night ONLY, and if you need to be near the ariport.", "Date": "June 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "montreal, qc", "Title": "“Decent no-frills hotel near airport”", "Author": "drbMontreal", "ReviewID": "UR59669335", "Content": "I found this hotel to be very average for cleanliness, quality of the room, noise level, etc. It is a good choice for one night to be close to the airport for a relatively cheap price, but a good example of how you get what you pay for. I have nothing bad to say about this hotel, but not much good either - it was average. I would not recommend it for a romantic weekend getaway, but for one night where you want to sleep for cheap - it's a good deal.", "Date": "March 27, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Quebec", "Title": "“NO WAY, never again”", "Author": "marilyn69", "ReviewID": "UR55107138", "Content": "Service poor, never again I will stay there Manager insulted my friends and it was so hot in the room, we did not sleep at all. Thermostat was broken.", "Date": "February 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Petawawa, Ontario", "Title": "“Park-Sleep-Flyers Beware! Free parking deal may cost you a Vehicle!”", "Author": "bullfrogbabe", "ReviewID": "UR53575754", "Content": "We took advantage of the great Park-Sleep-Fly deal when we took are vacation before Christmas. The value was great and the shuttle service was fabulous. The room wasn't the cleanest and a little tired but we didn't expect much for what we had paid. The hotel is in close proximity to the airport and the shuttle service to and back from the airport was perfectly executed. The free parking deal ended up being a real steal! Unfortunately our 2009 Venza was stolen from the hotel parking lot while we were away. The parking lot is not secure (no fence) or monitored by security cameras as indicated on the Sleep-Park-Fly website ad for this hotel. The hotel is not tracking the presence or absence of your vehicle while you are away despite putting your name and license plate on a tracking list -- they didn't notice that our vehicle was gone before our scheduled return. If you drive a newer SUV, crossover vehicle or expensive car don't park it here or at any other hotels near the Montreal Airport. The police officer that filed our stolen vehicle report that night indicated that very high tech car thieves are regularly targeting parking lots at hotels near the Montreal Airport. They are literally \"shopping\" parking lots for vehicles to steal. Our car had modern anti-theft features but that didn't matter they stole it anyway. Most of these stolen vehicles are never recovered as they are being shipped out of the country as fast as they are stolen to be sold to someone in some other foreign country. The shuttle service was great but we had no vehicle to return home in once we arrived back at the hotel after our 2 weeks away. None of the car rental companies at the airport wanted to rent us a car to go home to Ontario in; they were more worried about getting their rental car back to Quebec than to help out stranded travelers. It has all worked out but don't let this happen to you! If you have a choice park your older vehicle instead, pay extra for valet type parking at the airport (police said Park-N-Flys are not totally safe either -- thieves pay and drive out with your car -- the guy at the gate doesn't check that the driver is the car owner), or have someone drop you off at the airport and leave your car parked safely at home. The free parking deal may cost you your car! Be aware! This is a real risk in Montreal despite those who downplay the problem.", "Date": "January 16, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "montreal", "Title": "“ok”", "Author": "anamebyanyothername", "ReviewID": "UR47036265", "Content": "I stayed there with my spouse after a wedding reception at Le Biftheque next door. The location was great. The room was ok and the free breakfast was free. I only stayed one night and it served its purpose and was very cheap with a AAA discount. I was satisfied.", "Date": "October 16, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Saskatoon", "Title": "“I kept thinking to myself \"OMG\"!”", "Author": "bellezzajess", "ReviewID": "UR38712053", "Content": "On our way home from our 3 week vacation, we had a layover on Montreal so decided to go online and find a nice, reasonably priced hotel where us and our two young children (9 years and 6 months) would be comfortable. Got to the hotel and first of all, the closet in our room was missing knobs, 1 of the 3 lanterns in the room worked (one had no bulb in it and the other one was plugged in but no light) there was hair in the tub. I kept telling myself, \"all you need is a bed, all you need is a bed\"! When we went for the complimentary breakfast the next morning, the bread was stale and I noticed that in the sink/ garbage area, one of the cupboard doors on the bottom of the sink was bigger than the other one, causing it to overlap and unable to close. It was a \"lets use whatever we have\" patch job! I thought perhaps because they offer \"lower rates\", we paid $99, that perhaps they couldn't afford door knobs, light bulbs or matching cupboard doors?!?! After reading reviews online, I didn't think it would be bad but I was completely disappointed!", "Date": "August 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "1", "Rooms": "3"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Very cheap, very clean, but very out of the way.”", "Author": "Gottalock", "ReviewID": "UR33195366", "Content": "I satyaed at this hotel twice in a week as it was used as a place that nyself and my friend can lay our heads before flying out to Cuba and coming back late. We stayed on the 2nd floor for the first night and the hotel is very dated and looks like something out of the 60s but its kinda carming. Also the mattresses were very hard and borderline unsleepable but the room was decent and clean. There is a shuttle that will take you to the airport and to Via rail if asked for which is nice. The shuttle is shared between this hotel and a days inn but its pretty quick seeing it is June and the hotel was not overly full. Coming back from our trip we stayed on the first floor amd the room was much better and the pics that I posted along will show again its standard but clean. The bathroom was decent and the beds much better which I will recommend guests to ask for a room on the first floor. The real issue I had with this hotel is so difficult to get too and the cab from the wirport had no idea how to get to it. The best directions I could give him is that the parking lot is connected to Le BifthÃ¨que which is really the only thing around to eat at but the food is good and not too expensive. The main reason we stayed here was the cost seeing most airport hotels in the area run $150 with taxes but here it was $91 a night with said taxes. The breakfast in the morning is poor seeing its just bread, home made muffins, and cereal but is free. Looking from a cheap place before a flight and don't spening $20 for cab fare for 6KM due detours then this is your place but if not please look elsewhere.", "Date": "June 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "London, Canada", "Title": "“Worth the savings”", "Author": "ChappyLondonOntario", "ReviewID": "UR30829562", "Content": "Hey, we usually stay at this hotel because it is actually very fair in price compared to others in Montreal. I've lived here for 30 plus years and when I visit this is where I stay. It's easy access for us with a car. We're not looking for any attractions in particular and when we do we just pick up and go downtown or so. Again, clean..familiar to us and worth the savings I tell ya. It's a no frills place and worth the savings! Colette", "Date": "May 26, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Vancouver", "Title": "“Looked like best value on Expedia”", "Author": "Cartervan", "ReviewID": "UR29064587", "Content": "Air conditioning not on, room was hot. Front desk staff were cooperative. No restaurant.Lacked a lot of things. For $20 more it would have been more convenient pretty well anywhere else. Not a lot has happned in this hotel in 20 years. Staff talked too much and were loud", "Date": "April 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "canada", "Title": "“Great Choice”", "Author": "aracyul", "ReviewID": "UR19903022", "Content": "Very helpful staff. Rooms were clean. Loved the solarium all around. very unique layout.", "Date": "September 9, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "BRitish Columbia", "Title": "“Worst hotel I have ever stayed in”", "Author": "AJay1974", "ReviewID": "UR19528207", "Content": "Probably the worst hotel I have ever stayed in, and I've stayed in some dives in third world countries. Room was filthy, carpet dirty, sink still had tooth paste in it, drain was plugged, toilet was not clean, dried red wine (or was it blood) on the cabinet. Sheets extremely warn, beds very uncomfortable. Room smelled. I would rather stay on the street that stay in this hotel again. The only positive was a very helpful shuttle driver.", "Date": "August 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Toronto", "Title": "“This Motel is a Dump”", "Author": "vincenzoToronto", "ReviewID": "UR10053420", "Content": "The room was not cleaned when we checked in. Carpet is dirty. The place is dingy and smells of cigarette smoke. The motel is in the middle of nowhere -- no shopping, no restaurant, no amenities nearby.", "Date": "October 8, 2007"}], "HotelInfo": {"Name": "Econo Lodge Aeroport", "HotelURL": "/ShowUserReviews-g155032-d183284-Reviews-Econo_Lodge_Aeroport-Montreal_Quebec.html", "Price": "$79 - $100*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">6755, Cote-de-Liesse</span>, <span class=\"locality\"><span property=\"v:locality\">Montreal</span>, <span property=\"v:region\">Quebec</span> <span property=\"v:postal-code\">H4T 1E5</span></span>, <span class=\"country-name\" property=\"v:country-name\">Canada</span> </span></span></address>", "HotelID": "183284", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/dc/b0/dcb01b2923011c8e32de051df26d79274large.jpg"}}