{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Good hotel - caution about leaving car on property”", "Author": "Cheekywoman", "ReviewID": "UR126590030", "Content": "We stayed at the Double Tree for one night prior to departing for our March Break vacation. The hotel was fine, albeit a little dated, and as a Hilton Diamond member we had access to the executive lounge for cheese/crackers and appetizers, which were just OK. They have several on-site restaurants. We parked our car for the week, and it was a real upset to return and find that it had been broken into. The crooks had smashed the back window, and stolen the steering wheel airbag. (They make you park in a far parking area, away from the hotel. We made the mistake of parking up against the fence.) Needless to say, we won't stay here and leave a car again!", "Date": "March 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Perfect Airport Hotel”", "Author": "TimfromTBay", "ReviewID": "UR126042224", "Content": "My job has me travelling and staying in a variety of hotels in various cities but my favourite is always the Doubletree at the Toronto Airport. The rooms are beautiful, modern and very clean. The rates are the most reasonable rates around the airport. The beds are comfortable. The bathrooms are a good size. The restaurants offer excellent food at great prices. The staff and service is second to NONE - always pleasant and professional. We've used this hotel for meetings as well and they've always been able to accommodate my needs, even with little notice. The Business Travel staff, especially Pamela, have gone out of their way to make each stay or meeting flawless. Definitely the best at the airport!", "Date": "March 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent Stay & Park Option”", "Author": "KevinFromCanada", "ReviewID": "UR125905752", "Content": "Flying out of Toronto Pearson early? I highly recommend staying here the night before and leaving your car. Considering cost of other park & fly options, their package is very reasonable. Free shuttle runs every 30 minutes. Rooms are spacious and clean. Beds are very comfortable. My only complaint: I'm only 6' tall but shower nozzle was nose high. Otherwise great stay!", "Date": "March 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Phoenix, Arizona, United States", "Title": "“Everything you need!!”", "Author": "PhoenixRising7", "ReviewID": "UR125775187", "Content": "The best part about the Doubletree is that it has most everything, and more, to fill ones needs. The gift shop, indoor swimming pool, roomy and equipped gym, 4 restaurants....i mean the list goes on. For Hilton HHonor members i especially appreciate the evening receptions on Wednesday nights and also the excellent food selections and service in the lounge on the 12th floor. The staff has always been courteous and so approachable for anything i've needed. I've been coming here each month for the past year, and i keep coming back cause of how much i have available to me at the hotel. Definitely worth the money!! :)", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Antonio, Texas", "Title": "“My second home...”", "Author": "soulmusiq", "ReviewID": "UR125586559", "Content": "I'm a business traveler and this Doubltree has been my second home since May 2011. My room is a corner king on the street side of the hotel. The view is not much but better than the parking lot and powerlines on the other side. Over any long stay at one hotel you are bound to encounter some mishaps. Each time the entire staff has gone above and beyond to make sure my stay is comfortable. As for my room, (Pros) bed is comfortable, the TV is up to date, and very clean by hotel standards. (Cons) Not enough outlets by the bed, dark carpet, dated sofa and side chair. Resteraunts: Japanese, Chinanese, Italian, and the traditional hotel resteraunt. The breakfast buffet is really nice. But there are several other chain brand resteraunts within a 5 min drive. The hotel is close to the airport and Toronto convention centre, but getting downtown can be an experience. Overall I recommend this hotel. You can't beat the great customer service.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Crown Point, Indiana", "Title": "“Home away from Home”", "Author": "dgumbine", "ReviewID": "UR125302993", "Content": "I am a long term guest at thgsi Double Tree, will have been there a year in March and will be here about anotehr 2 years. I never check out of my room, so I keep everything here which makes travel a lot easier. The staff have made me one of the family! The GM, Sales Manager, Front Desk, Resteraunt staff, Bell Staff and everyone have been great. Very responsive to our needs. I recommend this hotel to anyone - both for personal and business travel. It has lots a family oriented items and its proximity to airport is great.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kingston, Canada", "Title": "“Doubletree by Hilton Toronto Airport”", "Author": "tinman1950", "ReviewID": "UR125281874", "Content": "If you are looking for a great hotel that makes you feel like you are at home this is the place you are looking for the staff are extremely friendly and helpful. I stay there for business and family trips both and the staff treat you like family they are there to make your stay comfortable from check in to check out. They have a great pool and work out area as well as spacious rooms. They have a great welcoming night on Wednesdays for their corporate clients so you get to know each other. There are restaurants with great food in the hotel as well as a bar or you can walk across the road to a half a dozen other places to eat. I would recommend this hotel for both their hospitality and convenience to Pearson International Airport and the easy access for those driving to highway 401.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Excellent location, better service”", "Author": "Joel M", "ReviewID": "UR125152225", "Content": "With a great location near the airport and an excellent staff, I've been staying at this hotel for each of my Toronto visits. The staff goes out of their way to exceed your Hilton Honors expectations and does their best to ensure you feel at home. By far the best value in the Toronto airport area! I recommend this hotel for both business and casual travelers.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "sudbury, ontario", "Title": "“A hotel that makes you feel at home.”", "Author": "kamyr", "ReviewID": "UR124758308", "Content": "I have stayed at this hotel numerous times when flying out of Toronto. They make you feel so welcome. That chocolate chip cookie upon check in is always warm. Nice touch. The staff is so helpful and friendly and the rooms are well kept. Rooms a clean, well stocked and the beds are comfy cozy! The shuttle runs every 30 minutes and you are always looked after to ensure a safe arrival to the airport. Thanks Doubletree for a great stay.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canada", "Title": "“A return visit!”", "Author": "CanadaVirgi", "ReviewID": "UR124670392", "Content": "This is our second stay here and that's because we so enjoyed our stay here last year. We usually have a very early flight so we come to Toronto the night before to save a really early morning drive - and we stay here at the Double Tree. The staff are extremely friendly and helpful, room service is fast and hot when it arrives, and there is a free shuttle to and from the airport. On top of all this we can have our car stay here for the two weeks we are away for just the cost of our overnight stay. This hotel is clean, quiet and has the most wonderful beds! Over the years we have stayed at 6 other hotels in this area near the airport and this is the one we will always come back to! It is one of the best!", "Date": "February 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "toronto", "Title": "“good choice for airport stopover”", "Author": "bruce14", "ReviewID": "UR124091935", "Content": "Large hotel with pleasant standard size rooms, usually offers a reasonable deal for leaving your car while on holiday, efficient shuttle service to and from the airport. Staff friendly and generally efficient.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Hotel needs to be updated”", "Author": "travelme79", "ReviewID": "UR123706522", "Content": "Not a bad hotel but the rooms need to be updated..I am honors member and the free breakfast is pretty bad but its free.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Northwestern Ontario", "Title": "“Extremely Friendly Staff & Wonderful Beds”", "Author": "JanaLB", "ReviewID": "UR123623209", "Content": "We were given a voucher from Westjet to stay here as our flight was delayed in Puerto Plata which caused us to miss our connection in Toronto. We checked in at 11:30 pm last night. The staff was the best ever. Starting with a pleasant check-in, to fabulous service when orderring food @ bar to bring to our room, (since we had not eaten all day) right down to the bell-man handing my family warm cookies while they were waiting for all this to finish. My children feel asleep as soon as their heads hit the pillows and they told me in the morning it was because the beds were so comfy!", "Date": "January 25, 2012"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Possible bedbugs”", "Author": "Wellsieiscool", "ReviewID": "UR123472435", "Content": "Thurs. Jan. 12, 2012 my husband and I were given coupons to stay at the airport doubletree by air canada after a flight cancellation. 8 days later he started showing several dozen bed bug type bites (they can show up shortly after to 2 weeks after the bite). I started scratching a couple days after. We are now quite covered in the bites. We stayed on what I think was an unrenovated floor in the hotel that... left a lot of be desired in terms of decor, modernity, odour etc. but we were there for one night, so what the heck. Anyway, there's no real way to say for sure, but I would be pretty surprised if it was something else.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canada", "Title": "“the cookie!!!”", "Author": "CaribbeanCanadaQueen", "ReviewID": "UR123001430", "Content": "its that warm cookie when you check in that keeps us coming back....or is it the amazing staff.....its everything. hey to manny at the bar your the best!!!! the staff are amazing.....awesome location...the beds are to die for. we come here for the park and fly a couple times a year. the best place to stay....", "Date": "January 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ancaster, Canada", "Title": "“Great Hotel”", "Author": "coco_ty", "ReviewID": "UR122671957", "Content": "I stayed one night for a conference and it couldn't have been better. The staff are very friendly and always willing to help. Great choice of restaurants. Room was spacious and bed comfortable.", "Date": "January 6, 2012"}, {"Ratings": {"Overall": "4.0", "Location": "4", "Service": "4"}, "AuthorLocation": "Ontario Canada", "Title": "“handled it pretty well, considering”", "Author": "Labwonder", "ReviewID": "UR121894157", "Content": "Nov.30, 2011 we were to stay at the Doubletree, prior to flying out the following morning. Upon arrival at the hotel, we discovered that the hotel had just had a major water \"leak\" and power outage. But, I thought the staff handled the entire affair quite well and in short time they were arranging to have people moved to another hotel, as the staff was unsure of when we would be able to check in at the Doubletree. Doubletree arranged/ensured that the other hotel honoured all parking, room requests, etc. and it all worked out quite nicely for us. I was impressed. Thanks Doubletree. We will give you another opportunity another time.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, Canada", "Title": "“Great Airport Hotel”", "Author": "ETBrown", "ReviewID": "UR121852279", "Content": "Everything about the Doubletree was great. As the end point of my trip to India, I was able to conveniently park my car, take the shuttle to Pearson. A great breakfast and friendly staff on my return.", "Date": "December 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great Hotel”", "Author": "Beachcomber626", "ReviewID": "UR121813070", "Content": "We stay at the Doubletree the night before flying out on vacation, every time. It is a clean, attractive hotel with very comfortable beds. The Orchid Cafe is a great place to eat..we have ordered from the menu and tried the buffet, also. The food and service are great. We love the cookies that they give you when checking in...what a treat. No need to stay anywhere else!", "Date": "December 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edmonton", "Title": "“Good location, good facilities”", "Author": "YEGcg", "ReviewID": "UR121510519", "Content": "My partner and I stayed here unexpectedly, as a result of a flight delay (room paid by Air Canada). At check in, the front desk clerk repeatedly suggested a room with 2 beds, although we only needed one. We took the room with 2 beds - I have to say, it's nice to have a comfy hotel bed to yourself once in a while! Also at check in, there was a young family that had a lot of luggage who were checking in at the same time. It would have been nice to see a staff member offer assistance (a staff member gave them a luggage cart - on condition that they bring it back right away). The beds were good, the Internet fast, and the room/bathroom were clean. I'd stay again.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "St.John's", "Title": "“Clean, comfortable hotel, fantastic food!!!:)”", "Author": "steph86727", "ReviewID": "UR121090985", "Content": "I ended up staying here because my flight was cancelled, therefore west jet put us up in this hotel. Very clean hotel, the beds were so comfortable and the pillows were amazing! Food at the orchid cafe was amazing, we had the buffett lunch which included, sauteed red potatoes, lasagna, rice, steamed vegies, salad bar, stuffed chicken breast with cranberries, fruit and cheese, and lots of dessert to choose from; decent price 17.95. We hyad west jet vouchers to use so it only ended up costing us 6 bucks lol Great location for the hotel close to the airport:) Only downfall we had was we had to check out of our room at 12:00 noon, and wait around all day for our flight,they should allow customers to keep their room until at least 3:00 pm, but oh well it was only for one night.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Barrie, Canada", "Title": "“Great Stopover Rates”", "Author": "Milandralove", "ReviewID": "UR121045595", "Content": "We stay at airport hotels prior to all vacations for the ease of transport to the airport before our flight. We have tried a couple of other hotels on the strip and always end up coming back to the Double Tree. They have great stopver rates where you can leave your vehicle at the hotel for the duration of your flight. They have shuttles to and from the airport. The rooms are nice, clean and up to date. Check in is always quick and they always give you warm chocolate chip cookies during check in. We will definately be returning to the Double Tree prior to our next vacation.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Home away from home”", "Author": "gereme", "ReviewID": "UR121008220", "Content": "Time spent at the Double-tree Hilton hotel in Toronto, Ontario, Canada was truly a home away from home experience for me. I enjoyed spending three nights on one of the most comfortable bed I have ever slept in. Room service was simply the best hospitality ever imagined, and the staff treated their guests as if we were their royal family. Included in my room was a computer and high speed internet which worked like a charm considering that a TV and good old fashion cable was all that I expected to find when I got there. Overall I think that this hotel is one of the best that I have ever stayed at and I would like to rate it with (5) stars.", "Date": "November 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ontario, Canada", "Title": "“A good place to stay”", "Author": "nearnorthduo", "ReviewID": "UR120761272", "Content": "Stayed for three nights and found the accomodations to be very good. The executive room was comfortable and well appointed and clean. I am a stickler for clean! I would stay there again.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Toronto, Canada", "Title": "“Good sleep, free airport shuttle. Dated rooms.”", "Author": "archangeli", "ReviewID": "UR120386118", "Content": "2.5 stars: check-in process was rushed (but I did stay here on one of their busiest weekends of the year and it was 100% fully booked) and I almost didn't get a parking pass. Got my Doubletree cookie though! The staff were polite and courteous though. I was told they had no fridges available, when I has specifically requested one in the room when I booked. The beds were comfortable and there was a nice flat screen LG tv (which incidentally I never turned on all weekend) but the rooms are definitely dated. There are 4 pillows on each double bed, with 2 extra in the closet but no extra duvets. Fold-up cots are available from the front desk on request (subject to availability, and possibly a fee?). The overall decor of the room is dated and starting to look a bit worn, especially if you look at the ceiling. There is industrial fluorescent lighting in the bathroom (not ideal). Also, the placement of the shower head is ridiculous! It was aimed below the nape of my neck (and I'm 5'8\") - so it was installed with someone 4'5\" tall in mind?! One of my friends who is 6'2\" had to squat in the bathtub to wash his hair. However, the Crabtree & Evelyn amenities were nice. Our bathroom had drainage problems in sink & toilet. When we got around to phoning the front desk about it at 11:30pm we were told someone would come right up... by 1am no one had shown up (and my roommate and I wanted to go to sleep!) so we phoned the front desk again. We were informed that there was no maintenance staff on duty at this hour, that they could send someone up with a plunger but we would have to take care of it ourselves!! There is a very sensitive thermostat- it got either too hot or too cold quickly but was impossible to get the temperature to stay at something comfortable. There is complimentary wifi, but it was not working both nights I stayed. The pool (and waterslide) are accessed through the main lobby and anyone walking by can see you in there. My friends went in for a dip at 5-6am and the hot tub was COLD. The Grand Chinese Cuisine restaurant is excellent (but a bit pricey). There is a hotel shuttle to Pearson International Airport, and a bus stop right outside the hotel where the TTC and GO buses stop. It is also located directly in front of the Toronto Congress Centre.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Prince George, Canada", "Title": "“Comfortable but dated”", "Author": "Jay G", "ReviewID": "UR120314242", "Content": "I have stayed at this hotel in the past and gave it another try. Next time I will stay at the Hilton down the street! The hotel is getting dated. While it is clean and the staff are great it is time for the hotel to get a major facelift.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Oshawa, Canada", "Title": "“Nice stay”", "Author": "craigger", "ReviewID": "UR120147261", "Content": "Stayed here for a night as a stopover package. We had parking for up to 2 weeks. Staff were friendly, rooms clean, enjoyed the planes going by. Not loud for an airport hotel. Overall a nice hotel and will stay here again.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "BC, Canada", "Title": "“Comfortable 3-Day Business Trip...”", "Author": "sillysavage", "ReviewID": "UR120026745", "Content": "My husband and I stayed at the Doubletree for 3 days in March for a work-related convention. The convention centre was directly across the street from the hotel, so the location was ideal.Upon arrival we were treated to warm chocolate chip cookies at the front desk. There was a problem with our initial room (we were given 2 Queens, instead of the King we requested), which was quickly sorted out. We did have noisy neighbours across the hall that kept us up past 1 am, but the front desk was efficient and dealt with it quickly. We ate one meal in the hotel, there are many restaurants in this huge facility so I cannot fairly say the quality of the food served at all of them, but the one meal I ate in the bar the first night we were there left me with stomach cramps that lasted 2 days...so maybe skip that one? Otherwise, the stay was a perfect fit for our needs, the staff was friendly, the room clean and vast, and our cleaning lady was awesome & friendly.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canada", "Title": "“I will return!”", "Author": "CanadaVirgi", "ReviewID": "UR118865579", "Content": "My husband and I stayed at the Doubletree because we were flying out at 6:00 a.m., the following morning. Checking in was quick and easy, and of course included the famous warm chocolate chip cookie.The room was clean and spacious and had all the amenities. We ordered room service, it took awhile to actually connect with them, but once we did the food arrived quickly and still hot. The wake up call was on time, the shuttle to the airport was free, and our car stayed in their closed in parking lot for 2 weeks for the price of the room. All in all it was a great experience and we will be back!", "Date": "October 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Would stay again!”", "Author": "Tiggersue2u", "ReviewID": "UR118737296", "Content": "Only stayed for one night but the hotel was clean and service was friendly. The room was nice but nothing over the top. The bathroom could use some updating but for a business trip it was more than needed.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Dallas, TX", "Title": "“Very good airport hotel.”", "Author": "kballtex", "ReviewID": "UR118431629", "Content": "Stayed here for a night. Non smoking room but reeked of smoke. Other than this it was pretty decent. Be advised that parking is pretty pricey.", "Date": "September 21, 2011"}, {"Ratings": {"Location": "2", "Overall": "3.0", "Value": "2", "Service": "2", "Rooms": "4"}, "AuthorLocation": "ontario", "Title": "“If your a family you might want to pass on this hotel”", "Author": "warwiac", "ReviewID": "UR118312935", "Content": "Stayed there on a Saturday night. Met family members there to take advantage of the pool and a low room rate (89). Parking is an additional $12, and seems very convoluted with vouchers required everytime you leave the parking area. Free internet. The pool is nice for families, with 2 slides (if there open, check that first before you stay) However the pool is located probably 500 yards away from the elevators, so it's quite a journey to get there. Hotel isn't particularly family friendly, obviously more geared to conferences and 1 night in and out airport travellers. One thing I particularly didn't like is the complete lack of luggage carts, there may have been a 1/2 dozen for the entire hotel which are kept locked up. Obviously this is a ploy to generate revenue for the bell staff, making it very difficult to get one for yourself. Hotel is directly on the take off flight path for the airport, so expect a thurndering takeoff every 2-3 minutes. The room was small but in good shape and clean. All in all, if your going to take the family as a getaway or for the pool, you can find alot better than this. Wouldn't stay here again.", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Powassan, Canada", "Title": "“Nice clean hotel... Good location for Stay, Park, and Fly...”", "Author": "CuteTravellers", "ReviewID": "UR118003703", "Content": "My husband and I (plus three other couples) stayed at this hotel prior to flying out to Cuba. We checked in, had some dinner, and spent the night - then caught the shuttle to the airport. All was good, except it would be nice if the airport shuttle did not shut down between 2 & 4 a.m. as that is when we have to go to the airport, so you either have to go really early, or risk being late. Otherwise all was fine and we would recommend this hotel.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Buffalo, New York", "Title": "“Hotel for Quick Business Trip”", "Author": "Rav22", "ReviewID": "UR117790965", "Content": "I picked this hotel since I was tired of the Courtyard on Carlingview where I always seem to stay. Also, this hotel was close to where my work was. It was cool to see the planes fly over the building right before landing. It appears that the hotel was soundproofed very well, since the noise from the planes was minimal. The front desk staff was very helpful at check -in. The price for parking (C$12.00) was reasonable, compared to other hotels in the area. There were two minor issues that I had with the hotel: 1. It was difficult to park nearby when checking in. There were no signs to show where check-in was, and the parking to check-in could be better. I found a place near the taxi stand, but it wasn't the right location. If you're driving, the other location in front of the hotel is awkward since you will need to go around the block to park in the lot. 2. I asked not to receive a newspaper, which I didn't. However, it was not deducted from the bill.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great beds, but a/c issues..”", "Author": "MikeGB2", "ReviewID": "UR117605266", "Content": "I stay at the hotel for 5 nights twice a year, due to a convention in the hotel, so I have come to know it well. At last the elevator upgrade has been completed this year so they are MUCH better than last year, so at least no line ups. My big problem this time was the A/C in my room. You can't turn off the fans in the rooms which are noisy at best, so I generally set the temp to ambient so hopefully it doesn't keep blowing through the night, as it definitely disturbs sleep. This time, nothing I did made the a/c keep quiet and it was a big problem. My final night, for some reason the a/c was blowing ice cold air all night and it was freezing in my room. I like a cold room but that was like a fridge. I spent most of the night awake as it was so cold, and on complaining in the morning I was offered a breakfast, which to be honest I never eat there as the buffet is not great. The girl asked what she could do for me and did eventually credit the night when I suggested it. I thought it should have been offered a bit sooner but I did leave happier, albeit very tired due to lack of sleep. This was on the exec floor as well so I was disappointed. I have never found the air traffic a problem at all, and have always found the rooms to be quiet, except for the a/c! All in all, a very nice hotel, comfortable, good staff, although as I mentioned, the breakfast buffet is expensive and not very good value, although the choices are reasonable. I use the Tim Horton's across the road as a rule. The bar staff is great, and it is also nice to see that the bar menu has changed at last. Not before time. I really do think that the hotel all around needs a bit of an update, especially the a/c's in the rooms! The Japanese restaurant is very nice but expensive although not owned by the hotel. I use the sushi restaurant half a block away. It's really great. LOVE the cookies at check in! Try the room service chocolate chip ice cream sandwich....fabulous!!...but only eat 1 if you as the calories will kill you!", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Hotel too busy for customers?”", "Author": "Arxxra", "ReviewID": "UR117558914", "Content": "5 friends and I were going to a convention at Toronto Congress Centre. We arrived at the hotel after a 6h trip with 2 rooms booked at least 4-5 months earlier. It said that we could get our rooms starting 15h00 but even at 17h30 the rooms were still not ready and we had lots of packages, including food, that we couldn't leave in the car. The first staff member we saw at 15h00 admitted that the hotel was overbooked, and that if we had arrived a little later, we might have ended up with no rooms at all. After 2h30 we were scared to loose our food ( our cooler needed to be plugged in the wall) so we went back and after a lot of talking, we got two rooms, different from the ones we reserved in the first place and not on the same floor but at least we could plug our cooler. When we booked the room, we asked the hotel to reserve a fridge for us in one of the room, no fridge were available when we arrived. We met with a guy who was part of the \"overbooked\" people, and he had to carry his luggage all day long for 2 days, with no sleeping place since no other hotel was available either. He stated that he was sleeping in the fast food around the corner... - Forget room service if you're not ordering food. - Mastresses are very comfortable and is the only thing I really enjoyed. Perfect bed according to us. - The room was clean and big enough for us. It is the type of hotel you don't stay in all day, you go out for activities. - The room is overprice for what it offers. We had better service and room in other Toronto hotels the previous years. I know that during the convention, hotel staff are busy since the hotel participates to the activities, but I believe they could have planned more staff and not overbook (so that people don't sleep in the streets!)", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Much better than I expected”", "Author": "marielco", "ReviewID": "UR117443359", "Content": "I had read some very negative reviews of this hotel before attending a four day conference there in June. I was pleasantly surprised when I arrived to find it far more pleasant than these reviews had led me to expect. My room was clean and well appointed. The free Wi Fi worked perfectly. I found the staff to be courteous and efficient. As I was attending a conference I did not get to use the leisure facilities. The food provided for the conference was very good. I did find the breakfast buffet a little dissapointing. I used the business center to prepare and print some documents with no problem.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“nice hotel”", "Author": "familytravelx3", "ReviewID": "UR117427212", "Content": "The room was very nice. It was clean, comfortable, modern, but not very large. The pool and water slides are great for children. Must be 48\" to use the water slides, and they're only open when lifeguards are present. Our room was not cleaned very well during our stay but was very clean upon arrival. On-site restaurants are pricey for family dinners. There is plenty of parking for a fee. There are very large power line towers in the parking lot. And of course many airplanes passing closely by. Staff was child-friendly.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Sudbury,Ontario", "Title": "“Standard Hotel room...Top notch Service!”", "Author": "JaneDoe99", "ReviewID": "UR116539026", "Content": "We had booked this hotel for a Stopover rate with parking included for 14 days , and by far it was the best deal this close to the airport. The hotel room was large but dated...it really needs a refurbishing. The hallways outside need the carpet replaced or extensively cleaned...it was beyond stained! But as I said the room was big because we had a corner room with a king bed and a pull out sofabed.We also had a great view watching planes take off and land at the airport, which was a thrill for my small daughter. BUT...due to the great plane watching it was EXTREMELY noisy at night when you are trying to sleep. The roar of jet engines kept me awake until around midnight I guess..that is when most late flights end. The swinmming pool was large but the water slides were only open from 4 to 7 pm, when a lifeguard would be on duty. My little one was very dissapointed. As was I , due to the fact I was not aware of this when I looked online. Maybe I missed it posted there , but if I had known I would have arranged my arrival time and pool time a little differently. But now the really good! When we had left the hotel to go to the airport we realized that our daughter had misplaced the beloved stuffed toy she was carrying. I told her we would check back with them when we landed after our trip but to not be too disappointed if they couldn't find him. When we arrived back at the hotel and asked at the front desk, both men working smiled and one pulled the stuffed toy from the lost and found bin and returned it to a very happy girl! Not only did they both seem happy that they made a little girl happy, they then asked if she would like a cookie (they give warm ones at check-In). Wow...she didn't think her day could get any better, and neither could I . It was so appreciated , and they were so friendly. Cudos to them :)", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tarpon Springs, Florida", "Title": "“Great Location, Great for Kids, Pet Friendly”", "Author": "JeniferTravels", "ReviewID": "UR116486528", "Content": "We really liked staying at this hotel for several reasons: *great indoor pool for the kids *convenient location to the airport, close to the main roads that go to downtown Toronto *pet friendly *excellent price for close to $100/night This hotel was big and spacious. Every employee we encountered was professional and offered impeccable customer service. The food offered via room service is good and there is a spa if you need to relax and unwind. There is also a secured parking area, which made us feel comfortable. Overall this is a great hotel and we will stay here again.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Very friendly staff but hotel (not the logo) needs a makeover”", "Author": "Finke", "ReviewID": "UR116281070", "Content": "Stranded here b/c missed connection and arrived as a family of 5 at 11:00 pm. Front desk staff was very helpful, friendly, and listened carefully to our concerns to find the room arrangement that would work for us. Got connecting rooms (each kind and pull our sofa), which were very spacious. While everything worked, both rooms need a makeover of everything - most importantly carpet and paint. They have such a 1980th kind a feel... Both rooms were clean, but the elevator areas and the hallways were not. The breakfast was ok for a doubletree and, again, the staff was very friendly. The hotel has pool with two water slides, which would potentially be a lot of fun for the kids if we would have been there between 4 and 8 pm; looking at the \"water slide closed\" signs, however, is a bummer... One final sidebar: the lobby had a large display about the fact that Doubletree had change their logo: who had that crazy idea? The old logo is one of the few hotel logos that are really great and you change it to D and something else?", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Freezing in MN", "Title": "“Much better than I expected!”", "Author": "momof6kidsinMN", "ReviewID": "UR116220504", "Content": "I ended up at this hotel quite unexpectedly after missing my connecting flight on the way back from my vacation. AirCanada gave me a voucher to stay at the DoubleTree as well as a meal voucher. I was a little hesitant but was really pleasantly surprised! The front desk staff was great, for a few extra bucks I upgraded my room a bit (needed more work space), and everything was very clean and nice (the bed was very comfortable!). I had also received a voucher for dinner at Harry's (right in the hotel) and the food was really quite good. Harry's was swamped due to all the folks with missed connections trying to eat at the same time, but the staff took it all in good spirits. In short, I would definitely consider this to be a viable option as far as hotels go in Toronto near the airport. However, there is one major and one minor factor that might prevent me from doing so. Major: needing to take the airport shuttle between the hotel and airport. The shuttle was full in the morning and some people had to wait for the next shuttle - this could cause an issue if you hadn't planned in advance for such a thing to happen. Minor: the airplanes were quite noisy even in the room - perhaps the window glass could be more soundproof? Tip*: Ask how far your room is from the elevator - some rooms are REALLY far away and a huge pain to walk to miles of hallways will alot of luggage. Tip*: The Blue Martini is excellent", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "1"}, "AuthorLocation": "New York", "Title": "“Repeat Guest but were highly disappointed!!!”", "Author": "Valibro", "ReviewID": "UR116117835", "Content": "We stayed here last year around the same time because the price was reasonable compared to what the hotels in downtown Toronto charged. Our stay last year was GREAT thats why we decided to stay here again even though its about 20 mins away from downtown. We checked in early and being a silver HHonors member we were given our room at 9 am which was excellent, however we were travelling with 2 young kids 4 and 5 and requested to have a refrigerator, extra pillows, water, juice delivered to the room...they NEVER came. Upon opening our door the room reeked of vomit and the rug was wet as though they tried to shampoo the scent out....we also had to walk through like 3 corridors just to get to the elevator...the pool was a hit with the kids being that it has a water slide also.....there's multiple restaurants and stores on site which is a plus but then we found out that we had to pay for parking which was 12.00 a day....We decided to check out the next day since we couldnt be moved to another room and the items we requested were never delivered...for repeat guest, we were truly disappointed especially being that Hilton goes above and beyond for its guest....I guest the Ritz Carlton no longer has competition!!", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Good hotel for a night's stay before/after flight”", "Author": "nadma", "ReviewID": "UR116058750", "Content": "I stayed at this hotel one night for connection flight. I have no complaints. The hotel has nice pool, nice terrace, nice buffet, nice lobby, nice coffe shop, nice rooms. Everything was very clean. The shuttle to/from airport was painless and on time. Service was very professional. Beds were comfortable. Bathroom a bit dated but I didn't care because it was functional and I was not staying for a long time. Nice touch to have strawberries dipped in chocolate and other sweet goodies. I will definetely stay there again for an overnight connection flight. I highly recommend for that purpose. Note that I got a decent price thru priceline.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "3", "Service": "1"}, "AuthorLocation": "Lima, Peru", "Title": "“Terrible Room”", "Author": "sacbe", "ReviewID": "UR115684500", "Content": "We have stayed many times at this hotel, but this was the worst. Wanted to take a bath, but when I ran the water it was brown. Called front desk for extra coffee, NO-ONE ever came, the air-conditioning was so loud, the fan was soooo dirty. Let the front desk know about these problems, but they could care less..maybe it is time to look for a new hotel.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Brampton, Canada", "Title": "“Checked in 5 hours late with little accomodations.”", "Author": "EKroeker_11", "ReviewID": "UR115496024", "Content": "My friend and I bought a certificate for a weekend away at a silent auction. We arrived at 4:30 planning to swim and get ready for a nice evening on the town. When we got there we were told that the hotel was booked to capacity and that they could check us into a smoking room right away but would have to wait 45 min until a non-smoking room was available. Being allergic to smoke we opted to wait in the bar until we were called. An hour and a half later we still had not been called. We went to the front desk to see if our room was ready and it was not. We were not told an estimated time so we asked what they could do for us since we were planning on going out for dinner. We were told they would pay for our parking pass. After some arguing, we did get them to agree to pay for our drinks at the bar and an appetizer. By the time we did get to our room it was 8'oclock. We were hungry, discruntled, and disappointed. We were not happy with the service we received, they didn't even seem apologetic that we waited 3 and a half hours to be checked in. When check-in is 3:00 we should not have had to wait until 8:00 that evening for an available room.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“loved it”", "Author": "ctmo", "ReviewID": "UR115373970", "Content": "We had a very comfortable 3 night stay here. The rooms were clean and beds were comfortable. The staff were friendly and helpful. The kids loved the pool, the only thing is I wish I had known of the height restriction of the pool slide when I asked if they had a pool upon registering. I had one disappointed little girl over this. She wasn't even allowed to go down the slide with a parent.", "Date": "July 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "delhi", "Title": "“Convenient”", "Author": "naveenyalla", "ReviewID": "UR115346508", "Content": "Considering it to be catering mainly to airport customers it is a good place. Service is ok. Check in was prompt, rooms were neat and clean. Room service good. cooked up a nice meal I had ordered late at night. Buffet was ok. I don't think hotels put too much thought in planning a buffet. The hotel has a swimming pool, a spa and multi cuisine restaurants. Good for a stopover.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Haslemere, Surrey", "Title": "“Lovely spacious room”", "Author": "MaiseyDaisey", "ReviewID": "UR115179670", "Content": "We booked this room the night before staying from our previous accommodation and so we didn't spend much time researching it. We had considered staying centrally in Toronto, but although the room rates were only a little more, the cost of parking (some quoting $23/Â£15 a night plus the obligatory taxes!) would have raised the cost of the stay to silly amounts of money for what you actually got. The hotel is on the main run into the airport and you can find several places to eat nearby - Tim Horton's, Swiss Charlet, Kelsey's, Perkins and one we wished we had found - Tucker's Marketplace on the road nearer the airport from the hotel. Check-in was effecient and polite and came with a warm cookie for each traveller. The room was on the top floor and was spacious with two large double beds, excellent TV and a lovely full length window - big enough for my husband and our older teenager son to spread our cases in! We were at the back side and had a view of the city in the distance (beautiful in the hazy sunshine) and the airport runway - which we also enjoyed watching the planes take off above us! May be some would find that ugly and noisey, but not us. Room came with slippers, dressing gowns, good coffee and water - all nice little perks and made up for lack of breakfast in rate. Clean, bright and modern - comfortable bed gave us a really good night's sleep. Check-out was noon, which enabled us to have a lie in before our night flight home. On site parking here was CAD$12/Â£8 +tax. Room cost CAD$135/Â£88, which considering we had paid $113/Â£74 for a very grotty Quality Inn in Orillia, we thought was excellent value.", "Date": "July 9, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "2.0", "Service": "2"}, "AuthorLocation": "", "Title": "“Awful, no interest in good service”", "Author": "NashTNtraveler", "ReviewID": "UR115177959", "Content": "We had to stay here due to a missed flight. The shuttle bus driver was pleasant, but the bus itself had no shock absorbers. Staff at the desk wasn't paying enough attention even to be described as being rude, zero warmth, answered basic questions like \"where's the restaurant?\" and \"what time do the shuttles run in the morning?\" with quick mutters. The hotel was virtually empty, but they put us at the far end of a long hallway rather than near the elevator. The room stank, a stale fried food and dirty clothes smell. One small window could be partially opened. All in all a bad experience, a bad introduction to Toronto. I'm assuming their business model depends on stranded passengers.", "Date": "July 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Guelph, Canada", "Title": "“Overbooked, bad staff and customer service”", "Author": "dncarolyn_73", "ReviewID": "UR115021722", "Content": "Showed up at check-in time and found out the hotel was overbooked. We came back at the time they suggested (two hours later) and the room still wasn't ready. By that time we had other commitments, so we couldn't check in until midnight. Staff were rude and generally unhelpful. I emailed Doubletree by Hilton after the stay and received no response. Terrible customer service! It felt like my staying there was an inconvenience.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Timmins, Canada", "Title": "“Staff makes this Hotel”", "Author": "tweets64", "ReviewID": "UR114851045", "Content": "Very accommodating. Mix up with the room but was fixed in a matter of minutes. Front staff awesome. Friendly. Kids loved the pool. Great restaurants on site. Rooms are clean. Older Hotel but good value for where you are. Very large Hotel. If you have small kids ask to stay closer to the elevator. Very long walk to some rooms, but again it is a BIG Hotel Definitely would stay again.", "Date": "June 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Service with a smile”", "Author": "DFK100", "ReviewID": "UR114814990", "Content": "This was the first time my wife and I stayed at this hotel we were there for a meeting from the time we checked in to the time we left we were very happy the room was clean and the bed was great i can not wait till our group meets there again in December", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Collingwood, Canada", "Title": "“Decent prices, nice rooms”", "Author": "StarfallDarling", "ReviewID": "UR114723937", "Content": "I stay here annually for a convention, and I have to say, the hotel is looking prettier this year, with its recent elevator upgrades! Housekeeping staff, as always, is amazingly sweet. Front desk staff could maybe take a few deep breaths and calm down. I found that they were a little bit short with me upon checking in, and while I realize that conventions create a large volume of people, there isn't any need to have that affect the way you interact with your guests. The rooms were clean, the beds were comfy, and above all, the location was excellent! It's worth noting, if you haven't clued in by the name, this is an AIRPORT hotel! That means you'll get planes flying over. I'm a heavy sleeper, so this didn't bother me. But light sleepers, I would encourage you to bring your ear plugs! Also, check out the Orchid Cafe. Great prices, and good food!", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Miami Beach, Florida", "Title": "“Great value”", "Author": "miamibeach99", "ReviewID": "UR111103373", "Content": "Excellent hotel. Comfortable, and clean. Staff was efficient and friendly. The hotel was a great value overall.", "Date": "June 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Bayonne, New Jersey", "Title": "“The Best Service”", "Author": "AmyLaurent", "ReviewID": "UR110858050", "Content": "I spent 2 nights here in May and the location was perfect for me. Very close to the airport with a free shuttle both ways. I hadnâ€™t stayed at a doubletree before so I donâ€™t have a point of comparison but I had a wonderful stay. There was something very â€˜nostalgicâ€™ about the hotel. Itâ€™s a large hotel with a number of restaurants and services. I only ate at the CafÃ© and the Japanese restaurant but my colleagues mentioned the Italian restaurant was quite good as well. When I arrived I was given a cookie that had just been baked and check-in was easy. The room itself needed updating but was clean and comfortable. On the bed was a pillow which said â€˜Sweet Dreamsâ€™ and thatâ€™s just what youâ€™ll have! One of the best sleeps Iâ€™ve had in a hotel. One of the best things about this place was the desk clerk named Carl. I had a number of issues (none of which were the hotelâ€™s fault) and he helped me with everything. I had forgotten my medication back home and Carl contacted my pharmacy and had them fax over my prescription to a Canadian pharmacy. He then arranged for a 4 day prescription to be filled and to have it delivered to the hotel! My luggage had also been lost by Delta (DELTA â€“ â€œDonâ€™t Expect Luggage To Arriveâ€�â€¦. A funny joke he shared with me). Since I was told my luggage would not arrive I was stressed about my clothing for the next day. He told me where I could get inexpensive temporary clothing and offered to set up a rental car. Iâ€™ve never received this kind of service at a hotel or otherwise. He was more like a genuine friend rather than a clerk. After all of this you can imagine I needed a drink and they have a great place called â€˜Harryâ€™s Barâ€™. Phil the bartender took great care of me and even gave me a double on the house. I think he saw the sorrow in my eyes! All in all, a great stay. I would say your money would be well spent just for the service standards of the hotel. Iâ€™m curious to explore more Doubletree hotels now to see if they all have this feel to them. Hope this was helpful, enjoy!", "Date": "June 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Windsor, Canada", "Title": "“Good Hotel for Meetings”", "Author": "nickyvenables", "ReviewID": "UR108638890", "Content": "We booked this hotel after many years traveling to other hotels in the Toronto Area. This hotel has a huge amount of meeting space and worked really well for us since we needed a few different size rooms. The bedrooms are comfortable, maybe needs a little updating, but very clean. The executive lounge was a nice perk since it was a bit quieter than being in the restaurant. Overall a very good and clean hotel. The staff were very nice and helpful when asked. Would choose this hotel again in the future.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "St. Catharines, Canada", "Title": "“Awsome place for a bridge tournament”", "Author": "gandalf974", "ReviewID": "UR106102090", "Content": "Everything was excellent and the housekeeper for our room was outstanding (Aleksandra).", "Date": "April 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Great Value”", "Author": "BBora", "ReviewID": "UR105239172", "Content": "Excellent value close to airport. All possible amenities at a very reasonable price. Professional staff, well managed. Pet friendly, will stay again.", "Date": "April 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sudbury, Canada", "Title": "“A welcoming, friendly, clean and comfortable experience!”", "Author": "Jennifer05031961", "ReviewID": "UR104547520", "Content": "Great value! Staff are very friendly and ensure that you are satified with your room. Kids love the pool after a long drive to the hotel on a Friday night. Safe and easy to leave the car behind and the shuttle service is on time at both ends of your travels. Staff are very helpful. Several staff went out of their way to assist mom and her kids when they returned from trip to discover a flat tire. We did not have CAA at the time, and the staff worked on a Sunday morning until the tire was fixed and we were on our way home. They made us feel welcome as we waited, and were extremely friendly.", "Date": "April 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Vancouver", "Title": "“Room fills the need”", "Author": "Vickie_Bernie", "ReviewID": "UR102541366", "Content": "I stay here a lot. They seem to always spell my name wrong and I spend more time trying to prove my reservation. Check in is smooth love the cookie. Rooms are in need of some TLC as per my photos. And I was on the executive floor! Shuttle service is always excellent.", "Date": "April 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Not Sure How This Hotel is in the Hilton Brand”", "Author": "Mike_the_Traveler74", "ReviewID": "UR102397170", "Content": "I travel often for business and I remain fairly loyal to the Hilton Honors program as I can get my points at many brands offered by Hilton. Generally speaking, every time I book a hotel under the Hilton Brand I know exactly what I'm getting.......not the case this time around. Now I like to consider myself fairly open minded, patient and down to earth but my stay here was awful. I started staying at Doubletrees wherever possible because they are hotels which usually have an upscale but comfortable environment (sometimes the full service Hilton's are a bit too sterile for me). There was absolutely nothing upscale or comfortable about this hotel. I arrived at the Toronto airport and I was picked up by the Hotel shuttle. The shuttle was on time, exactly where it said it would be and even though I didn't need it I was offered luggage assistance.......a great start! Upon arriving at the hotel I was incredibly disappointed. It was late afternoon and the first thing I saw while stepping off of the truck were the lobby windows, completely filthy.....hand prints, dust, dirt, everything you could think of. I'm not speaking of some build up in between cleanings, I'm speaking of windows which clearly hadn't been cleaned in months. As I entered the doors the first thing I saw to my left was a large powerbar/powercord with plugs in it for the lobby lamps...... also from the 80s or earlier? Awful brass lamps. Of course after these two things I noticed everything, dirty pink and green carpet everywhere and a truly eerie feeling.......absolutely nothing upscale at all. Keeping in mind this is all my first impression. I approached the desk, still with an open mind, and things got even worse. There was a dedicated line for Hilton Honors members so I made my way there. A really rude woman said 'You didn't see me waiting for you over there?' while pointing to a terminal a bit of the way down. She was full of attitude, rolled her eyes, didn't smile even once and even worse, focused mostly on her computer. As each hotel is different, usually the desk agent tells me my benefits as a Hilton member....I was told nothing at all except my membership was on file. I took my key, regretting being booked into the hotel, and made my way up to the executive floor (the 12th floor) to get to my room. I'm not sure how this was the 'executive' floor as it was musty, dirty, with old carpeting and hallways that resembled something out of a horror film. I opened the door to my room and for a BRIEF moment I was mildly calm. I thought 'ok this isn't so bad'......wrong again. Other than a flat screen television (with no option to order movies??????????) the room was terribly out-dated. Once again, dirty carpet, destroyed furniture, and old fixtures. My bathroom had peeling wallpaper, a dirty mirror and mold all over the grout.........and this is all to the naked eye! I called downstairs and told the front desk I was unhappy with my room and they told me 'Well sir, if you aren't happy on the executive floor that's our best'. I was exhausted from a long day at work without the energy to argue.....and with such disgust I simply let it go and quickly opened my laptop and booked the Hilton Garden Inn Toronto Airport (review to follow). I ordered something to eat because I truly thought, how can a burger and fries go wrong? WELL..............LET ME TELL YOU............Great burger! Perfect fries, well done just like I asked for....... and promptly delivered. When it comes to hotels it doesn't take much to keep me happy. All I need is a clean comfortable room and I don't even ask for the staff to be OVERLY friendly.......simply alert and helpful. This was hands down the worst Doubletree experience I've ever had and I will never........ever.......return to this hotel. On the plus side.....(yes there are a few)....... It's close to the airport. The food was great, the cookie I received when I arrived was exactly the same as every other Doubletree cookie I've had (perfect). The porter was funny and helpful and you could tell he would do anything for you. All in all.......I just don't think a good burger and a porter who smiles is what a hotel is all about.......", "Date": "April 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Erie, Pennsylvania", "Title": "“Fast & neat.”", "Author": "MikeP12", "ReviewID": "UR100557394", "Content": "Check in & check out were fast , guest services were always at the ready it seemed . housekeeping was fast & cheerful .", "Date": "March 17, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“A noisy 4 nights...”", "Author": "jfsabs", "ReviewID": "UR99006668", "Content": "I stayed at the Doubletree for 4 nights. I was attending a conference at the hotel so I figured it would be easy to stay at the hotel and not have to drive the 401 in traffic each morning. I got there the first night, and had a really rude bellboy take my luggage. The front desk gave me directions to the parking garage...and ended up telling me to go to the exit of the lot. I had to drive back and around and finally got parked (for $12/night). The bellboy proceeded to take my bags on the luggage cart, and was banging the cart around corners and hitting the houskeeping cart. Not appreciated! I got to my room on the 9th floor and it smelled smoky (even though I was on a nonsmoking floor). I called down to the lobby and switched rooms. The room itself was nice but sort of outdated. Nice big flatscreen tv, 2 queen beds and a nice view of the toronto congress centre (so bright at night). I went in the bathroom and found several long black hairs on the floor which I was very grossed out by (considering I have blonde hair so I know its not mine!). The concierge (Anthony I think) was very nice and helped me find a clip to close my curtains as there was a spot of light that kept shining in. Also gave me an extra cookie :) The planes are SO noisy and same with the traffic on Dixon road. I had a really tough time falling asleep...and as soon as I did, the planes would start again at 6:30 AM. You would think that a hotel by the airport would be a bit more soundproof. There is a nice fitness centre and a swimming pool. As I was going up the stairs to the slide, the steps were really grimey and dirty. I was regretting not wearing shoes on the steps! There are several restaurants in the hotel....also a bunch across the street (Tims, subway, milestones, kelseys) which was nice. There is free internet in your room (sometimes it was fast, sometimes it was slow). All in all, I would not stay here again unless I had to. I will take the 401 traffic and a quiet nights sleep over the hotel!", "Date": "March 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canada", "Title": "“Doubletree Is Always A Good Choice”", "Author": "NortherngirlCanada", "ReviewID": "UR92951037", "Content": "I stay at the Doubletree often for business. It is near the airport and far from downtown Toronto. I have never had a problem with check in. It is very standard and quite quick. They give you a warm chocolate chip cookie when you check in which is always a nice treat after a long flight. The hotel has several options for restaurants. The Orchid Cafe has a buffet and a sit down menu. There is also a small bar attached. The food is typical and hits the spot. Alfredo's is more upscale and has excellent Italian cuisine. Ginko is an excellent Japenese restaurant with entertaining show cooking. Grand Chinese is a newer restaurant and has excellent food. In addition there is always room service. Rooms are clean and have comfortable beds and plump pillows. There are several different room choices so there is something for everyone. The hotel has a pool and whirlpool and 2 waterslides. There is also a fitness room and hairdresser. There is a great little shop called Swansea with lots of bling. You can buy purses and jewelery and woman's clothing that is a little different and you might not see elsewhere. Overall, I would recommend this hotel if you want to be near the airport. There is no shopping or entertainment nearby but many choices for restaurants. Enjoy.", "Date": "January 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "USA", "Title": "“Doubletree - Hotel ok, Concierge not”", "Author": "TravellerforBusiness", "ReviewID": "UR92081095", "Content": "Stayed overnight on a Monday. Reception staff very slow but nice enough. HH free upgrade to large suite. Room was good, huge, a little outdated. Rotten pillows (for us) too padded. Too tired to ask for replace. Room had no fridge. Lots of spaces pre-built for bar fridge but all empty. Hotel amenity overload with large heated pool, 2 slides, hot spa, gym etc. Other guests in hot spa said they'd spent hours arranging for Technician to heat the hot spa. Very annoyed by Concierge guy (Kumar). Not sure whether he was Concierge or just a staff fellow standing in that area. Observed Kumar acting the fool over bell-hop carts. Many guests trying to unload cars and get out of loading zone in the dark during a snow-storm. No bell-hops. Kumar was loudly saying guests not allowed to self-load bell-hop carts. Err - and the other option was? Kumar provided us entirely false info re dining options. He advised the 3 onsite Restaurants and Room Service were all closed. We double-checked we'd understood him. He reconfirmed everything closed and said we'd need to take a cab to Toronto city for meals. Once settled in our room, we called Room Service. They were open. Lovely fast meal too. Not sure why Kumar thought everything was closed. Glad didn't taxi to Toronto... Note - if booked on an early flight (say before 7am) and plan to use Hotel Shuttle to airport, the shuttle was half-hourly and tardiness was not accepted. Worked for me! Yay! Latecomers - sit in the Foyer for half an hour whilst your shuttle races off without you - Don't be tardy for the party lol. Note - Customs/Immi/Check-In at Toronto to return to USA was nightmare - lengthy delays at 06:00. Perhaps time of the year was a factor. Nearly 2.5 hours required and many passengers missed flights. Got to be organised players :)", "Date": "January 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Despite age, pretty well-run hotel”", "Author": "irlundee", "ReviewID": "UR91114576", "Content": "Aged hotel, very clean, a throwback with large main floor lots of eateries and a large pool with slides. Rooms spacious and clean. Only down points - due to age, fresh air system is non-existent so your room will get stuffy and smelly, forced air heating then dries skin and throat. Breakfast buffet fine for a three star, good selection but of course nothing freshly made for you. Location is near airport if you want more action this is the wrong spot. Staff friendly. Good deal at $80 or lower incl. Breakfast, fair deal if you pay $95 if you are paying $120 + the. You will be disappointed - as usual all relative to what you pay.", "Date": "December 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“A Great Hotel for our Meetings”", "Author": "balfour1976", "ReviewID": "UR89340183", "Content": "We choose this hotel as it was close to the airport for our recent regional meetings. The hotel has a huge convention space and it is located all under the same roof. The hotel room was very nice, clean and actually spacious. We were on the 8th floor and our room had a large flat panel televison on the wall that was a nice change than the old clunker of a tv you usually see. The staff were very friendly in the hallways and the check in was quick...which is exactly what I like. I didn't eat in the restaurant since we had food in our meeting room but there was tons of options. The meeting room was very nice and the decor seems to be recently updated. Overall this hotel was a wonderful surprise and we will definately use it again.", "Date": "December 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Thunder Bay, Canada", "Title": "“Great Location + Great Hotel = Great Stay”", "Author": "belanger_mike99", "ReviewID": "UR88960440", "Content": "Choose this hotel as I was at a conference across the street. I simply choose because of location but I would definatly return next time I am in Toronto. The service was amazing and the bellman have a great attitude - always saying hello and really showing they care. The rooms met my needs and are not over the top. I had dinner in the Italian restaurant and I have to say it flavourful and delicious! There are tons of restaurants in and around the hotel - best of all there is a Tim Hortons across the street. This hotel was a pleasant surprise and I would definately return.", "Date": "December 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "2", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Mississauga, Canada", "Title": "“Great Stay Close to the Airport”", "Author": "Reggiebassman", "ReviewID": "UR88695546", "Content": "We booked this hotel the night before we flew to Jamaica (6am flight!!) and choose this hotel because it was close and the rate was the best we could find on Dixon. The hotel seems a bit older however you don't really notice. We were on the 7th floor and the room was actually spacious. Although I have stayed at other doubletrees which are typically newer, this hotel was great for us. The service was exceptional and we felt like we were at a 5 star hotel. There is tons of restaurants but we opted for just room service which was excellent and finally a hotel that severs hot food through room service. We will definitely stay here again.....", "Date": "November 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Timmins, Canada", "Title": "“Nice clean hotel with all the amenities right on site!”", "Author": "Didi_Corbeil", "ReviewID": "UR85377555", "Content": "We stayed at the DoubleTree for 2 nights while attending a conference recently held there. Our room was comfortable, clean and quiet. Plane noise was a minimum. As everyone states, the warm cookie was delightful. One thing we really appreciated was the lovely freshness of the air in our room. We slept comfortably on the plush beds and never heard a thing all night. The Sushi restaurant in the hotel is nice also. We made use of the Spa and found it to be a perfect ending to a long day. Thank you Jennifer at the Spa.!", "Date": "October 30, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Perkinsfield, Canada", "Title": "“What else could go wrong??”", "Author": "mdubeau", "ReviewID": "UR85324263", "Content": "My first room 3260 (old section) was very hot, musty, stale air, stinky, windows did not open. Turned down heat, but never noticed a difference even after a few hours...could not stay in that heat and smell. My friends first room near mine, noticed a layer of the door was missing because it had got caught in the loose screw in the door frame. She tightened the loose screw with her finger. Then the entire locking mechanism on the door frame fell down, being held at best by the lower screw! You could see that the screws had been reattached several times over the years. Maintenance came to repair it with his pocket screwdriver (similar to a screwdriver you would use to repair glasses!) He did come back with a better screw driver. We requested and were given different rooms 4x11. Much better rooms, did not stink, were not grungy, and were cooler - although we had been told we could stay in the same room for our second night, we to change rooms. The third rooms 2260 &2248 were better than the first and second, but still not what one would expect given the name, the price ($189.99) and the lobby area. There were renovations happening on the elevator area on the second floor, with equipment all over the place. Please excuse the renovations! our joke was, they better hurry and get up to the third floor!! When my friend went to wash her hands in one of the conference washrooms, the entire faucet moved, it was not attached to the marble counter top! When I went to adjust the shower head, the entire plumbing in the wall moved! not surprising. We were there for a tools and technology conference, and the internet was so slow that the presenters could not do a efficient job- things would not download for them (apparently there were too many people using it for 'personal' use) In the evening in our rooms it was extremely slow as well (similar to dial up) . Check out time is 1pm, and the cleaning staff was in my room already when I went to get my belongings at 12pm. The cleaning lady was very nice and said she would leave while I gathered my stuff, but I had prepared everything I only had to pick them up... She did ask me to make sure my card worked in the door.. not sure if it was to be sure it was my room?? Our billing was a bit funky too, have to check my credit card when it comes in... One bill, the two rooms were on the same bill, the other had two separate bills... Unfortunately we did not have a camera with us, otherwise we certainly would have taken some pictures to share!!!", "Date": "October 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vienna, Virginia", "Title": "“Service Well Done”", "Author": "voyager075", "ReviewID": "UR84209377", "Content": "What stood out for me was the consistent friendly, prompt and professional service I received, both as a guest and as a presenter at a training workshop my client set up here. Banquet staff were superb, AV guy great, lobby folks helpful, airport van guy friendly. There are a lot of restaurants in the area, catering to a range of pocketbooks. My room was well appointed with a comfortable sitting area and good lighting at the desk and bed. And, miracle of miracles, despite the property being directly under one of Pearson Airport's flight paths, the place was quiet. Only problem was I couldn't get the room temperature down enough for a good night's sleep.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Niagara Falls, NY", "Title": "“Nice room From Priceline.”", "Author": "Billzilla66", "ReviewID": "UR80824050", "Content": "I needed a place to stay overnight in Toronto, and I got this hotel room from Priceline for $65 a night. It's a nice room, even if the cleaning wasn't excellant (dust covered vents and crumbs near the windows). The beds were very cozy, and the hotel restaurant had a nice breakfast buffet (not free). I didn't get a chance to try out the pool or fitness centre, but the bar was nice and friendly. It's a bit of a distance from downtown Toronto (it takes about an hour by bus and subway), but it's still a nice hotel. I might go there again on my next excursion to Toronto.", "Date": "September 24, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Victoria", "Title": "“Horrible Stay - Unfriendly Staff - Drab and Worn Out, DIrty Rooms”", "Author": "MelodieH", "ReviewID": "UR80741724", "Content": "I stayed at the Double Tree by Hilton during a business trip and was extremely disappointed with many aspects of this hotel. Rather than write a very long and drawn out review, I will provide a point form synopsis of the issues (which is long enough on its own): ~Colleague used his credit card to secure the rooms: they placed a 200% hold on the card for the rooms. This is NOT a standard practice. When asked about this, staff was not only unfriendly, but hostile, defensive and combative. Caused colleague's credit card to be declined after that. Oh, and the hold stayed on the card for several days AFTER successful payment! ~Housekeeping did not arrive until 5:30PM and when she did finally arrive, asked me to leave my room so she could clean it! The Housekeeping Manager arrived at some point and proceeded to yell at the cleaning lady in the hallway for being late - even going so far as to swear at her - loudly. Extremely unprofessional. ~Alarm going off in stairwell at midnight - not once, but TWICE during my stay. ~Heater broken in room - first night spent trying to sleep with A/C stuck on: I was freezing! ~Sink in room was cracked due to something smashing it. It was there so long, the crack was black: AKA: MOLD! ~Woke up in the middle of the night scratching - found a BUG IN MY BED (needless to say, I could not sleep that night, even after having torn my bed apart to ensure there were no others. Hardly able to stay awake during business the next day.) ~Bugs flying around the room the next day. Took pictures and showed front desk where I was accused of bringing into the room myself via luggage! When I stood up for myself, front desk staff backtracked and said he meant other guests. Nice deflection - not. Then tried to say they were fruit flies from food in my room. I did NOT have food in my room and he forgot I took a picture of the bugs. Showed to him again to prove they were some little flying beetle-type bugs. I finally got a new room and was told the old room was being fumigated. (Yeah, right - by housekeeping... at 11pm... ) ~Moved into new room (much smaller than what was paid for) on a floor that smelled of stale cigarette smoke (even though I explained I am terribly allergic to smoke). Had a nasty headache and felt ill for two days after that. ~Shampoo in new room was a half empty bottle!! Ewww... used toiletries displayed as if new! DISGUSTING! ~Mold in the shower ~Dust so thick on the sprinkler head near the ceiling that a CHUNK of it fell on me as I walked by. ~Restaurant extremely overpriced and very small breakfast buffet selection. The only nice thing about my stay at the Double Tree was the warm cookie presented on arrival. The server in the wine bar was very nice as well.", "Date": "September 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Hilton Head", "Title": "“Don't let the cheap room price fool you”", "Author": "ImLanman", "ReviewID": "UR72493065", "Content": "Everything you have read in all of the reviews is accurate, with your enjoyment or disappointment of this hotel depending on your expecations. Expectiations met: Free shuttle from the airport (although I waited 40 minutes) Fast check-in (not friendly, but not rude desk staffing) Nicely equipped workout room and pool area Restaurant (Two Asian - open, One Italitan - closed) - I did not dine in one but heard positive reviews 1 LG LCD 32\" TV in every room - which is adequate based on the tiny room size Expectations NOT met: The room is smaller than a tiny typical room you would get in Tokyo! The room smells like an old book store The bathroom is so tiny you can barely do your business - literally WiFi is free in your room, but not in the hotel lobby or bar, so don't plan on being social Adding to the above, don't plan on taking a drink to your room - yep... not allowed -so you can work in your room (without a beer), or you can have a beer but not work Drink prices are high and drink pours are low - a fitting accompanyment to the barstaff The hotel lobby is outdated with the general mood being subdued (at best) General: Plane sounds are about typical of any airport hotel Beds are colonial posts with now average mattresses In summary, the hotel is accurately priced (due to the obvious age of the property), but the cost adders quickly add up and become frustrating. I would suggest staying at another more modern property with better and larger rooms with most costs included in the initial room price.", "Date": "July 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "calgary, canada", "Title": "“Very Disappointed. Hotel needs a major renovation.”", "Author": "alice1203", "ReviewID": "UR68379916", "Content": "I was shocked at the condition of this hotel, after booking it from Tripadvisor reviews and photos online from the hotels website. They have a very nice waterpark for kids (our daughter loved it), and the lobby is kind of nice, but it ends there. Three of five elevators aren't working, (\"closed for modernization\"), the hallways are dingy and yellow, so old and stale smelling that I was shocked walking down the hallway to our room. The room had updated beds, bedding, dressers and tv, but that's it. The room was old and so was the bathroom. We went to eat, and had a late evening snack in the lounge. The chairs are all stained and old, and the food was surprisingly poor. I was shocked that this could be a Hilton property. We have stayed in Doubletree's in the States and they have all been top notch. To tell you how much I didn't want to stay here again, on the way back from our trip (we overnighted for a caribbean holiday), I booked us into the Sheraton Conference Center and Hotel Airport location. I did this knowing that I had to give up my non-refundable room rate of $145, because we booked on hotels.ca. So I gave up that money and spent $175 to stay at the Sheraton. At the Sheraton, the hotel was lovely, the food was just superb and our room was great.", "Date": "June 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Akron, Ohio", "Title": "“Yikes - Believe the Bad Reviews”", "Author": "jooksing", "ReviewID": "UR64851131", "Content": "I have stayed at this hotel several times over the past few years. It is a tired old property. The good - Good restaurants, very good restaurants, free shuttle, good location near local convention center. The service was great The bad - My first room was awful. It smelled bad and had apparent water damage inside a wall and broken bathroom tile that was dangerous. Room vent was covered and choked with dust. It is a tired old property they should either retire or remodel.", "Date": "May 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London Ontario", "Title": "“Comfortable with everything you really need.”", "Author": "packingandunpacking", "ReviewID": "UR62480146", "Content": "As an airpot hotel, the Doubletree by Hilton likely has everything you need. Easy parking onsite for \"park & fly\", good restaurants onsite, a nice pool with waterslides and hot-tub for pre-trip relaxing, comfortable beds, soft pillows and an interesting ladies clothing and accessories shop for last minute trip needs. I stayed at this hotel for a conference and enjoyed all of the above features, but overall, this is a tired, old hotel. The room was a bit shabby. Walls, ceiling, trim and bathroom were showing wear. They were working on renovating the elevator interiors, so only three out of five elevators were working. This didn't cause a problem as there seemed to be very few guests, but on Sunday when we left, only one out of five elevators was working. Taking the stairs was not an option as we were checking out wiht luggage. The orchid restaurant serves a nice, standard breakfast buffet for $16. The lunch menu looked good. Directly across the street are Tim Horton's, Milestones, Harvey's, Kelsey's and the Toronto Congress Centre. If you are going to attend anything at the Congress Centre, this, or the nearby Radisson are the places to stay. Overall, a good hotel experience. Even with the airport just down the street, aircraft noise was minimal as the Doubletree is far enough away from Pearson that the planes are high in the sky by the time they are overhead.", "Date": "April 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leamington, Ontario", "Title": "“Great experience”", "Author": "GILLANDERS41", "ReviewID": "UR60823784", "Content": "We used this hotel as a stopover , going to Mexico for a week, with an early departure and parking on-site for the week. Everything was great, beds were heavenly, showers hot, nice lobby, front desk people were good, shuttle service ok, and on site parking perfect. Good price also. Sparkling clean also.", "Date": "April 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Ontario", "Title": "“Call for height restrictions on Water slide!!!!!!!!!!”", "Author": "Mom097", "ReviewID": "UR57515408", "Content": "Staff was rude. Obviously only a stopover hotel, very confused repeatedly that we weren't flying out. Call for height restrictions on Water slide!!!!!!!!!! Bed was comfy, room was small and outdated. Planes woke us up all night.", "Date": "March 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, ON", "Title": "“Lots to Love”", "Author": "snorkelspaz", "ReviewID": "UR55901714", "Content": "I have stayed at this hotel many times for both business and pleasure most recently on Feb 8th. Check-in is usually very quick and the warm cookie is a nice touch. The room is very comfortable with a soft duvet and comfortable mattress. The towels in the bath are quite plush and I enjoy the Neutrogena bath products they provide, especially the face-wash which is a welcome change from regular soap. Alfredos in the lobby is an excellent Italian restaurant and I enjoy going there on pretty much every visit. The risotto is quite good and they serve rolls, crackers and a beautiful olive spread while you wait for your dinner. I have used the pool and hot tub although I find it a bit too far from the rooms and I donâ€™t like having to walk through the lobby to get there or back especially if I am wet. They have a wonderful little shop in the lobby that sells ladies accessories. I have purchased many interesting items there and always look forward to seeing what might be new. As a business travellor, it is nice to have a shop like that to stop in and browse. I enjoy the convienience of the airport shuttle and parking at the hotel. Going to the airport is always easy. Coming back not so much. The return shuttle is always a really long wait. It is frustrating to watch other hotels come by 2 or 3 times while you wait for the Doubletree shuttle. That is my one issue with this hotel, otherwise I like it very much.", "Date": "February 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Barrie, Canada", "Title": "“Love the Cookies!”", "Author": "Milandralove", "ReviewID": "UR55551553", "Content": "We use the Double Tree by Hilton each year for our family vacation. They have a great stopover package that includes parking for up to 14 days. We book the basic room with two double beds as there are four of us (2 adults, 2 children). Check in has always been quick and they give you lovely warm chocolate chip cookies upon check in. The rooms are somewhat tight but they are clean and we only use it to sleep. The kids love the slide at the pool. The only drawback of the pool is that you have to walk through the lobby area and down a hallway past shops and conference rooms to get to the pool which can be ackward when you are in your bathing suits as a family and you are walking past shoppers and people attending conferences in suits. The last time we were there the lifeguard obviously had other things on her mind and didn't even face the pool. The slide is open only when the lifeguard is available which doesn't make sense a the lifeguard was in a room off to the side on her cell phone for most of the time we were down there. When she did come out she sat, wrapped up in towels at a table with her back to the pool. The pool itself is ok an there is a hot tub that is nice as well. The hotel also provides a shuttle to the airport and back to the hotel. For a stopover night it serves us well. We have never eaten at the restaurants so unfortunately I cannot comment on that. Overall I would give it a 3 1/2*", "Date": "February 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Nebraska", "Title": "“A tired property with a new name”", "Author": "Bookflyer", "ReviewID": "UR55462442", "Content": "I have stayed at this hotel many times several years ago when it was called simply the International Plaza Hotel. Other than the rebranding by Hilton to become a Doubletree, there have not been enough changes to the property. It is tired and dated. I came to this hotel for a convention. Its location by the airport and shuttle access make it attractive for the event planners. Check-in was efficient and uneventful. I arrived with a co-worker at about 7:30 pm. I was given a room on the 5th floor at the end of the hall, so it was fairly quiet. I did not hear planes overhead as some other people have commented. The elevators did not all work the entire time of my stay. When they did work they were a bit on the flaky side. The room was large as was the bath. The TV was the old school CRT type, not a flat screen. I thought Doubletree was supposed to be a higher end or specialty hotel to distinguish its brand from other Hilton properties. The free wireless Internet access was appreciated and worked well. The room contained a desk and chair, wingback chair, glass top table and king sized bed. The bath had a decent sized countertop so I could place my toiletries and have room to spare. The commode handle had to be held down for a full flush to occur. The shower worked well, although the bath faucet shot water all over the side of the tub instead of into it. The closet was a double sliding door type. Oddly enough the door to the bath was also a slider. Lighting in the room was a little dark, even with all the lights illuminated. A pet peeve of mine is when there is no light for the closet. Guess what, no light for the closet in this room. The thermostat did a terrible job of heating and cooling the room as it was either way too hot or way too cold. My room was set to broil when I first entered it. I used the fitness center and found it to be the high point of the hotel. If memory serves there were three ellipticals, four or five treadmills, a stationary bike, free weights, exercise balls and several benches. The ellipticals and treadmills were higher quality units with the screens for TV viewing or statistics. Although the hotel has three restaurants and a bar, I avoided the restaurants. If the food in the restaurants was as good as the limited menu in Harry's and priced the same it would not have been worth the expense. I walked across the street to Kelsey's and Millstone instead. Millstone is much better than Kelsey's. I did not make the trek to the Montana steakhouse on the other side of the viaduct. I had heard from other hotel guests that the Japanese restaurant in the hotel was very good. The attached convention center was convenient but very small, and in my estimation undersized for our group's needs. The layout inclued dual stairways and a very narrow escalator to reach the upper level, all of which should be remodeled to increase floor space. Actually I wish they would just tear down that portion and redo the convention center completely but I doubt that it is likely that would ever happen. The last feature I will mention in this review is that the hotel has a significant amount of space devoted to retail. It is almost like there should be a casino where the convention center is, as it reminds me of that type of layout. The only thing missing is a lot of smoke. Fortunately Ontario has a smoking law! It seems odd to say this, with all the amenities this location has to offer that I would be so indifferent to this property. I would only stay at this hotel if I had to. I would rather stay at another location nearby, and will again consider that in future events planned for this location. The key is that you are basically in the middle of nowhere, aside from the two restaurants I mentioned that are across the street. The hotel knows that you are unlikely to venture outside in February. If you don't have an event at this location, check other airport hotels.", "Date": "February 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "sudbury", "Title": "“An okay place to stay, but there are better close by”", "Author": "fullermel", "ReviewID": "UR52801599", "Content": "My husband and I and our two children stayed at this hotel for several hours on a layover coming home from Punta Cana. We arrived at 2 AM, and were greeting by courteous and friendly enough staff. The rooms are a little cramped, especially after a week of staying in a large resort. The bedding is very comfortable. The breakfast buffet is overpriced for what you get, but that is Toronto Hotels for you. Our waiter kinda disappeared during the last few minutes of our meal, so we had to scramble to make sure we didn't miss the shuttle to the airport. PS....the chocolate chip cookies are not only delicious, but the ingredients are wholesome.........nice touch.", "Date": "January 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Toronto", "Title": "“If you just want a bed for the night, this will do”", "Author": "DandDToronto", "ReviewID": "UR51175743", "Content": "My company has its annual dinner-dance here so my wife and I are regular, if infrequent, guests. This year we noticed some improvements in the dowdy, worn rooms, and the smell of paint in the corridors indicated that some refurbishment is going on. Alas the staff are still offhand and uncaring. Making a reservation was very trying. One gets transferred to a call centre in the southern USA where the receptionist had no information on the corporate rate that had been negotiated. Last year I complained about the indignity and reasonless requirement for ID at check-in and was pleased not to be asked for ID this year. Was I lucky or is somebody responding to complaints? The food at the dinner-dance was acceptable for a mass-catered event, but breakfast was poor: the food being quite bland and even tasteless; not to mention expensive. The parking lot continues to be a safety hazard with little attempt at snow clearing making it all too easy for pedestrians to slip. If your room faces the in the right direction (north east I think), the view of incoming planes is dramatic.", "Date": "December 13, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Oneonta, New York", "Title": "“We got what we paid for...or maybe less?”", "Author": "N_and_R", "ReviewID": "UR50350804", "Content": "My partner and I stayed at this DoubleTree property the night before our flight out of Pearson to our vacation. We did this since the hotel was offering a very attractive package including one night stay plus parking for the duration of our vacation. The package was definitely priced very attractively. The entire complex is rather large, with a lot of convention space attached to the main hotel building. The public areas of the property appeared to be relatively new and in excellent condition. There were two major problems we noticed within the first 30 minutes of our arrival. First, the people working the desk just seemed very unhappy and it was rather clear to us that they did not like working there. We live close to Toronto area, and we have stayed in a few Canadian hotels around here, I have never stayed in a property with this level of \"employee morale\" problem. This morale problem was even affecting the airport shuttle drivers. It was clear to us that at least one of the drivers we encountered was clearly unhappy about his predicament to be employed in that capacity. Also, it was unfortunate that the actual hotel part of the property was not the same vintage as the convention area. The rooms (on the executive floor) were rather small with lack of modern conveniences including the wall switch for lighting. The furnishings appeared to be from the late 70's/early 80's. The room was clean and tidy, but it showed the fact that everything in the room were very old. The mattress was not very comfortable to sleep on. Also, something in the room (maybe the heating unit?) was making this constant buzzing throughout the night. We did not very sleep well that night. We know this is just an airport hotel with a great package rate for parking, so we were not that disappointed with what we experienced. Obviously, the management of this property is not that interested in either happy customers or happy employees.", "Date": "November 30, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Miami", "Title": "“Mixed review”", "Author": "Jose1313", "ReviewID": "UR48321697", "Content": "I transferred over from the Hilton Toronto Airport hotel because the Double Tree offered some ammenties I was looking for, These included the indoor pool and gym. These both were excellent compared to the Hilton. Here I am comparing the two and I would have to rate the Hilton as a better choice for the business traveller. The staff at the DoubleTree were not as friendly and the restaurant was a huge dispappoint. For example, at the Hilton guests could get free take out coffee. The Double Tree charges $2.00 for the coffee. The selection of breakfast items was limited. The HIlton had better quality items such as fresh fruits. Anyway, I will probably not stay at the Double Tree again. I just feel that Hilton staff were so much nicer. Also, I could see that the Hilton was working on remodeling their gym and the room were nicer. Last comment on the DoubleTree. I have Gold Membership with Hilton and was not given an Executive level floor eventhough the Hotel was empty.", "Date": "November 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Mission, British Columbia", "Title": "“Pictures are deceiving, but staff and food AMAZING!”", "Author": "mum2noah1", "ReviewID": "UR45910486", "Content": "My husband and I had a nice little get away to Toronto. When we arrived to the hotel and checked into our room, I was quite upset. The photo's that we displayed on the hotel's website was NOTHING like the room we stayed in, it was VERY dated. We were only at the hotel to pretty much sleep, the bed's were not the most comfortable either. BUT the room and bathroom were VERY clean and house keeping were on top of everything. The pool was SO small, the picture on the web site showed that it was much bigger. The restraunts in the hotel are AMAZiNG. The breakfast buffet INCREDIBLE! Ginko's although a little pricey the food was authentic Japanese, nothing like what you get at your ordinary run of the mill Japanese reasturant. I'm part Japanese so I know what authentic Japanese food tastes like, and it was just like my grandmothers cooking. All in all, the Staff are very friendly, food is amazing and for the price you pay it's a good deal if you are there just to have a place to sleep.", "Date": "October 5, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Ottawa, Ontario", "Title": "“Although problems resolved by guest services, cannot recommend this hotel at this time.”", "Author": "dragonlady06", "ReviewID": "UR38793568", "Content": "On Aug. 8th, after a long day at Canadaâ€™s Wonderland, my family arrived at the Doubletree by Hilton, Toronto Airport, at approx. 8:15 p.m. We had stayed at this property many times before it was taken over by Hilton (hotel was previously called the International Plaza) and never had a bad experience, so we were expecting same. However, upon check-in, we were immediately told that there were no more double-bedded rooms left. We had an online prepaid reservation for a double-bedded room as well as an online confirmation from the hotel, so we were upset. The gentleman at the front desk, whom I believe was the hotel manager, did not apologize for having given away our room. In fact, he was rather abrupt with us and appeared to be attempting to get rid of us as quickly as possible. He had a heavy accent and was difficult to understand at times. He told us that there was a trade convention on that weekend, and everyone wanted a double-bedded room. He made it clear that we would have to take another room, but he would give us a free â€œupgradeâ€� to a larger room, unless of course, we did not want it (this was said in a belligerent tone of voice). Since our reservation was non-cancelable and non-refundable, it was getting late, and we were tired, we agreed to take the other room. What choice did we have? When we got to the elevators to make our way up to our room, other hotel guests told us not to stick any part of our bodies in-between the elevator doors because the doors were not equipped with sensors. On the way up to our floor, I had to get out of the elevator to allow the person behind me to get out, and the doors abruptly closed behind me. The person that was supposed to get off at that floor was not able to get out before the doors closed, and of course, I was not able to get back in. I was separated from my family until another elevator came along, and that took a while because of how busy the hotel was that evening. Anyway, after finally making it up to our floor, we discovered that our room was located way down the corridor at the farthest possible point away from the elevators. This annoyed us because there were no trolleys available to help us move our luggage to our room (and we had a lot of luggage). Apparently, persons associated with the trade convention were already using all of the hotelâ€™s available trolleys. When we finally arrived at our room and opened the door, we were very disappointed. The â€œupgradedâ€� room was only slightly larger than a standard room, and the lay-out was definitely not suitable for a family of four consisting of three adults and one child (our daughter is 21 yrs. old, and our son is 10 yrs. old). The room contained only a king size bed and a pull-out sofa bed. No one wanted to sleep on the sofa bed. In the end, my husband decided to share it with our son since he did not want the girls to be uncomfortable (very admirable!). Unfortunately, the springs were shot on the bed, making it very uncomfortable. Needless to say, he did not sleep well. He awoke several times throughout the night and finally gave up on sleeping altogether by 4:30 a.m. During our stay, we had several concerns besides the room type. The first pertained to the cleanliness of the room. The cushions on the sofa bed were lightly stained (perhaps from spilled soda pop), and when pulling out the sofa bed to sleep on, we discovered that no vacuuming had taken place under the sofa bed in a very long time. Also, we were expected to use the sheets that were already on the sofa bed, but since we could not ascertain how long it had been since someone had changed those sheets, we did not feel comfortable using them. Fortunately, a very kind gentleman that came to our room to make the bed decided that he was not happy with us using the current bedding either, and he left to get us some fresh bedding (thank goodness!). He was the nicest person that we dealt with during our stay at this hotel. On the morning of our departure, I wanted to make coffee, but there was only one disposable cup under the coffee maker (the coffee maker requires two cups since it makes two cups at a time), and that cup had a dead fruit fly in it. I contacted the front desk, and someone did come up to our room with two new cups right away. Another thing that we noticed was that the hotel was in need of some renovations. For example, the floor tiles in our bathroom were chipped. Also, we noticed that the floors in the corridors were not level (some areas were higher than others) which is a definite safety hazard. If one were not paying attention, one could easily trip and take a nasty fall. As for the carpets in the corridors, they looked fairly new, but they were buckling heavily, probably due to the unlevel flooring. As for the elevators, they are in need of repairs, especially if the sensors are not working. An additional concern for us was the service at this hotel. The gentleman who checked us in at the front desk was not very friendly. Also, he told us that someone would come to our room with extra bedding to make the sofa bed. No one appeared, so we called the front desk. After our phone call, an entire hour passed without anyone arriving at our room with the requested bedding. We called the front desk a second time, and finally, a gentleman arrived to make the bed. At this point, it was 10:00 p.m., and we were so tired that we just wanted to lie down. Finally, more of a disappointment than a concern was the fact that our room was not equipped with a mini refrigerator to store our drinks, nor was the bathroom equipped with an exhaust fan. Our room at the Doubletree in Niagara Falls (a wonderful property!) where we had just spent two nights had been equipped with both of these items, so we expected same at this Doubletree hotel. In the end, when we checked out from this hotel, we voiced many of our concerns to the young lady at the front desk, and although she was not unpleasant, she did not appear to care about our concerns either. She never apologized for the hotel and barely made eye contact with us. As for the unsuitable room that we were given, she told us that it is written in our online hotel confirmation that our preferences depend on hotel availability. To us, this completely defeats the entire purpose of making a reservation. If one cannot depend on the room type requested at the time one makes a reservation, what is the point in making a reservation at all? After returning home, I contacted guest services for the Doubletree hotel. The lady that I spoke with was very nice and a pleasure to deal with. She told me that visits at Doubletree hotels are 100% guaranteed, and she apologized profusely for our bad experience. I believe that she was sincere. In any event, she promised to contact the hotel directly to allow them an opportunity to deal with my complaints (and she did). She also told me that she wanted to do something to compensate us. Although my purpose in complaining was simply to bring about awareness rather than monetary gain, I thought that her offer of compensation was a nice gesture. She asked what I felt that my stay was worth (which I appreciated), and I told her that I would be happy with a 50% reduction. She thought that was fair, and she immediately credited my Visa. Had it not been for the exceptional service that I received from guest services, I would never have returned to this particular Doubletree property again. As things now stand, I will give it another try in the future, but I will give the hotel a little time to fix some of their problems before I returnâ€¦ As a final note in closing, I was told by this hotel that it is their goal to become the busiest convention centre hotel in Toronto. Although I believe that this goal is admirable, and I wish the hotel success in achieving it, I would strongly urge the hotel not to diminish the importance of families and single persons visiting the property because they are also an integral part of the hotelâ€™s businessâ€¦", "Date": "August 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Chicago", "Title": "“fine..cookies are a nice touch”", "Author": "travellingangie", "ReviewID": "UR37705987", "Content": "We had visits with relatives in Toronto and found the airport location no trouble...they gave us a free upgrade at check in and it had this great view of the flights making their arrivals. Some light sleepers may not like it but I enjoyed it. At checkin, they give you these hot, fresh cookies, which are nice. The only bummer is the parking. You have to use the hotel card to access the gated lot and it doesn't always work. It did not go one time for us and the fellow working there didn't seem to care until we engaged him for help. Good location with gas station and tim Horton's across the street.", "Date": "August 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "canada", "Title": "“pretty good”", "Author": "knittingwombat", "ReviewID": "UR37538655", "Content": "we stayed at this doubletree during an event at the conference center across the street, due to overbookings we were given the prime ministers suite at a very discount rate, which was a wonderful upgrade, and the view from the room could not be rivaled the hotel itself had plenty of amenities and friendly staff, plus its pet friendly which was an added bonus although i found some cleaning errors, and the did not inform us that our room did not include breakfast, so when we went to the front desk for the particular voucher that all rooms on our floor got, we were snubbed by a front desk person who was completely rude and impolite, i would have liked them to inform us about this confusion in the first place, but they did not.", "Date": "August 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Ottawa", "Title": "“Very nice hotel”", "Author": "Trexim", "ReviewID": "UR36697859", "Content": "Stayed one night August 1, 2009 at this hotel. Very nice hotel and excellent service. Got to the hotel around 8:30 pm and swam with the kids from 9:00-10:00 pm. The slides close at 10:00 pm though the pool remains open until 11:00 pm. They have towels at the pool area as well. Room was clean. Nice, spotless beds and pilows. Clean puffy towels. Just a bit noisy with the planes landing. Got a very good rate. Will return.", "Date": "August 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Oakville", "Title": "“A magical night, spent at a magical hotel...”", "Author": "focus_d", "ReviewID": "UR35171251", "Content": "My boyfriend and I celebrated our birthdays at the Doubletree by Hilton from July 16-18th. Upon entering the establishment we were warmly greeted by all available staff, which was a great way to start our stay. The hotel room was nicely furnished, very modern and clean. The bathroom decor was also very beautiful. I would like to compliment the Doubletree by Hilton for it's eminent services. All staff at the hotel are very welcoming and extend full cooperation and dedication. We could not have found a nicer venue and we will definately be back.", "Date": "July 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "boston", "Title": "“Nice Hotel”", "Author": "vacationplanner222", "ReviewID": "UR35049785", "Content": "The impression of this hotel is very nice, staff is very friendly. My two kids loved the pool with water slide. The room is very clean, bed is very comfortable but the size of the room is a little bit small. I have a problem finding this hotel using my GPS TOMTOM, it doesn't show Dixon Road, instead shows Dixon Street, they are not the same. I am happy for the stay because the staff waived the parking fee.", "Date": "July 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Pleasant Stay - No splash pad”", "Author": "canuckgrl06", "ReviewID": "UR35008858", "Content": "I booked the double tree for $111 for an overnight getway with my family. We have two small children and were looking forward to using the facilities. The rooms were fine, very nice beds, and everything was well set up and ready for our arrival. The cookies given at arrival were excellent and my kids loved them. The hotel is well equipped. The staff were lovely and accomodating to any concerns we had. The pool are was very nice, but we were disappointed that the splash pad is no longer available (although prominently displayed on the hotel website - it has apparently been permanently removed) and the waterslide is only open in the evenings when the lifeguard is on duty. This was a bit of a disappointment that should be rectified by the hotel management. We were offered a complimentary breakfast buffet when I asked about the splash pad, but were not able to take advantage of it.", "Date": "July 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Ontario", "Title": "“Great start to our family vacation!”", "Author": "FanOntario", "ReviewID": "UR33162578", "Content": "Everything from checking in, our room, pool area, breakfast buffet and airport shuttle was great. The entire staff were extremely helpful. We would not hesitate to stay at the hotel again.", "Date": "June 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "ontario", "Title": "“This hotel is a \"must stay\".”", "Author": "nik07", "ReviewID": "UR33095255", "Content": "My husband and family have stayed at this hotel on several occasions, the staff is courteous, friendly and very outgoing. Not only is it close to the airport for going away and parking privledges, it is a lovely spot for a little romantice get away without travelling too far, highly recommend it and will definitely be returning in the near future, the site is lovely and provides all ammenities.", "Date": "June 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Hamilton", "Title": "“Still a very good hotel.”", "Author": "merquisez", "ReviewID": "UR32296514", "Content": "We stay at this hotel every year. Never had a problem. This year we got upgraded which was nice. Not much to say. Always a pleasure.", "Date": "June 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Ontario", "Title": "“Fantastic Weekend Getaway”", "Author": "violaww", "ReviewID": "UR32001037", "Content": "We felt welcome as soon as we arrived! The staff was incredible from the get go. The room was very comfortable and felt cozy. Luckily we had great weather for walking, and the bellman directed us to the Distillery District - a must see. The first night we dined in the hotel's Japanese restaurant and it was excellent, almost as good as room service. Overall, this was a good choice.", "Date": "June 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Toronto", "Title": "“Great value and service”", "Author": "smileback", "ReviewID": "UR31659097", "Content": "I have held several seminars and conferences at the Doubletree by Hilton - Toronto Airport. On every occasion, I am greeted by extremely friendly staff who are fully committed to the success of all our events. The rooms are spacious and clean and the beds are super comfortable. The location is easily accessible by car (only steps from Hwy 401). A free shuttle is provided to and from Pearson International Airport for easy commute for travellers flying in and out of Toronto. For those arriving by car, there is plenty of parking at a reasonable rate. Naturally, being so close to the airport does mean that there is noise from airplanes flying closely overhead. This is not an issue for me because I actually enjoy seeing the airplanes close up; however, for others, this may be an issue. On site you will find a pool with water slide, a fabulous spa, hair salon, shops, four restaurants, and a bar. The conference facilities are fantastic, which can accommodate small or large groups. Overall, the Doubletree by Hilton - Toronto Airport is a superb choice for business or leisure. I believe there is exceptional value in staying at this property.", "Date": "June 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "golden, colorado", "Title": "“excellent”", "Author": "lucky281", "ReviewID": "UR31038875", "Content": "free airport shuttle, very friendly front desk and full service hotel", "Date": "May 28, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Toronto, Canada", "Title": "“Complete Disappointment”", "Author": "JamesII", "ReviewID": "UR30944282", "Content": "Our dealings with the front desk staff were the most prominently negative part of our recent two night stay at the Doubletree, Toronto. The staff were generally rude, dismissive and unhelpful virtually every time we had to speak with them. It started right from Check in when there was a complete lack of understanding of the upgrades we had booked, who was staying (even though the reservation was madeover the telephone not the website) and lasted right to the end when our bill was obviously wrong and it was apparent that the staff who we were told were the ones we should speak to about our bill had no idea what kind of room we were in. We had an issue every single time we needed to speak to the front desk staff (e.g. being told that we couldn't have 5 in a room when our reservation explicitely stated it was for 5). We were re-directed away from the lounge we paid to access obviously or apparently as there were insufficient staff to cover the volume of business (which should not have been a surprise to the hotel since they host the Anime North Convention the same time every year). The roll out couch was broken and uncomfortable for my sons. The tv was ancient and when we rented a movie, it came with a permanent set of static lines at the bottom. The elevators drove us mad. Two of them were out of service basically the whole time we were there meaning long waits (again this was during an annual convention) and indeed on check out day the elevators were so full that we walked down from the 10th floor and had to exit through the kitchen since the fire alarm was set on some of the doors exiting the stairwells. So, in all I would give this stay a very low ranking for service and satisfaction. I will not be staying at this hotel again.", "Date": "May 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Caledonia, Canada", "Title": "“Exceeded expectations!!”", "Author": "juslin", "ReviewID": "UR29666857", "Content": "Just returned from a 2 night stay at the doubletree. I was a little concerned from reading the negative reviews posted here but thought I'd try it anyway. We were in the area for a cheerleading competition and booked for a 2 night stay. Our room was on the 10th floor with 2 queen beds. Although the room is a bit on the small side, it was extremely clean and met our needs just fine. Beds were very comfortable. The bathroom was very spacious and clean. I can't recall if there was 4 or 6 elevators but they were not slow at all. Service within the entire hotel was great....everybody was polite and helpful. Breakfast buffet was $15...on the high side but selection made up for it. There is a Tim Hortons directly across the road. Left for dinner as there is many good restaurants in the area. With 3 teenage girls in the room I used the lounge often. Service was good but prices are again on the high side. I needed to remind myself that this is Toronto and priced reflected as such. The girls used the pool area and had lots of fun. I word of caution...there are many planes that fly directly overhead so keep that in mind. It didn't bother us or other guests that I talked to. I will return as I thought I received good value for my money. We paid $125/night. People need to remember you get what you pay for. If you want 5 star go ahead and pay the premium and go somewhere else. Our overall hotel rating was 4 star!", "Date": "May 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Glenview, IL", "Title": "“Nice facility but could use room upgrade”", "Author": "lillibac", "ReviewID": "UR27182216", "Content": "The building is very nice but the room left something to be desired. It was small and musty. Nice exercise room and pool area.", "Date": "March 31, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Toronto", "Title": "“Never, ever again.”", "Author": "easterbells", "ReviewID": "UR24981518", "Content": "This has got to be THE worst experience in hospitality....wait - any kind of service/product I have ever had to pay for or ever experience in my entire life. This hotel only needs one word to describe it, and that is MOLD. This dated, poorly constructed building seriously needs to be destroyed for the health of the people working within the building, and visitors as well. The room in which I stayed had a very large section of furry, thick mold growing down the wall and around the back of the toilet. When I brought the attention to Doubletree, the matter was completely ignored. The pictures that I took and sent along with my email were nauseating to look at, but they didn't deem to mind. They passed my issue from department to department, all the way up to corporate and back down to the hotel itself where it came to rest UNRESOLVED. I have read other people's reviews talking about mold growth, and musty smells throughout the building and I'm in complete awe that they could care less. They wouldn't even refund the stay on my credit card, but did a full refund to another colleague staying with us who complained of rattling pipes all night long. Apparently health and safety is of NO concern to the Hilton chain of hotels. Would I recommend this hotel to a friend? Not a chance!", "Date": "February 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montreal", "Title": "“A good hotel”", "Author": "45DegreesNorth", "ReviewID": "UR23929377", "Content": "This hotel is close to the airport and I would imagine is used heavily by those attending trade shows at the Toronto Congress Centre (that was my reason for choosing this location). The hotel did not disappoint. Check-in: Very efficient, with an added pleasantry of being given two warm cookies. Enjoy them right away, they are delicious warm. General: lots of elevators so never much of a wait. Room: I was on the 4th floor, which appeared to be a blessing; the majority of my fellow travellers were on the 10th floor, and some complained of some airplane noise (those facing the airport direction). I heard nothing. -Wonderful bed, topped with a little cushion with 'Sweet Dreams' embroidered on it. Light as a feather, but warm, duvet on the bed. Nice decor. My room had two double beds and a chair, plus desk. My colleague's room had one double bed and a pull out sofa, which creates more space in the room. --Bathroom has Neutrogena products. Ironing board, Iron, Hair dryer, Suitcase rest. Something I appreciated a lot - hands-free speaker on the phone - very useful when being put on hold. Nicest aspect of room: Free wireless connection!!!!!! I had just come back from Atlanta where I was at the Westin paying $14.95 US per day. Negatives:I arrived around 1:00pm - boy did I have trouble getting a hold of room service. I eventually reached them but it took a while, after a number of calls. -There are a few rougher details, like when I opened the closet to see a clumsily covered venting installation that can cut in and cause the closet door to move a little - I left mine open a crack so it would not make that noise. I guess if it really bothered me I would have complained. Restaurants: Lots of restarants - we ate mostly at the main resaturant, the Orchid (I think it is called). There is a also the more expensive Alfredos, and Japanese restaurant, and Harrys Bar. I found the buffet breakfast to be nice. Gift Shop: Well stocked, good hours. Amenities: You will find a spa, a very nice swimming pool with hot tub, and a water slide. Great for kids. Also a decent fitness room. I did not use any of this myself but maybe one day (I am going back on business this week). Other services: free printing apparently (I did not use it); a good business centre. I wanted to send a fax but I did not realize that I had to bring my credit card with me to enter into the fax machine - other hotels I could have it faxed for me and the charge would be added to my bill. Other: There is an efficient shuttle service from the airport (complimentary) Our group totaled about 20 people and I only heard positive things, we will definitely stay there again.", "Date": "January 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "GTA, Ontario", "Title": "“Great Hotel for Stopover”", "Author": "LastMango", "ReviewID": "UR23839331", "Content": "The Doubletree offers a great stopover package. Room plus 2 weeks parking and shuttle to/from airport. This is our favourite place to stay on a night before/after a trip. Rooms are large and clean; although bathrooms can be a bit dated. Hotel staff are always friendly and helpful -- as are the shuttle drivers. Several restaurants in the hotel and within walking distance. Our most recent stay was early January and it lived up to previous visits.", "Date": "January 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Boston", "Title": "“A health hazard”", "Author": "MarthaBoston", "ReviewID": "UR21547656", "Content": "I attended a conference that took place in the DoubleTree at the Tornoto airport and had I not been forced to stay, would have fled the first day. Upon first entering the lobby, there was an unpleasant smell. When getting off on the 4th floor, where my room was located, I saw a large sheet covering one wall. To our horror, when my colleague pulled back the sheet, the wall was covered in mold. It was disgusting, as was the odor in the elevator closest to the wall over the next few days. My shower curtain was also unclean, as were the hallways. Unfortunately, the hotel is in the middle of nowhere. It is not located near the airport terminals, it is a shuttle ride away. And a taxi ride from downtown Toronto one night cost $70. So I did not have any choice but to remain there. The only positive (and there were so many more negatives I won't mention) is the sushi in the Japanese restaurant. Go figure! I would avoid this hotel unless it is your only choice or until they have gone through a multi-milion dollar renovation to clean up the place. Better, yet, they should tear it down and start over again. It is a health hazard.", "Date": "November 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Saint Robert, Missouri", "Title": "“It was just fine to me..”", "Author": "Pulaskicountytourism", "ReviewID": "UR21084363", "Content": "Attended a conference there. All staff was friendly and helpful. Anthony the bellman helped with ideas of what to do and directions on how to get there. Conference ran well lots of meeting space. Never was to cold or to hot which says a lot for a conference. Food was good. Dined at the Chinese and Italian restaurants. Received great service and good food. My fav was the italian place. Yes you can see the planes numbers and logos as they fly by the window, but I really didn't notice that much noise. I actually enjoyed watching them. Would stay there again.", "Date": "October 21, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Montreal, Quebec", "Title": "“Not my first pick”", "Author": "realsimple999", "ReviewID": "UR20741229", "Content": "I stayed at the Doubletree for meetings. This is an older hotel that definitely needs a facelift. It is quite big and the rooms are clean and the beds are comfortable, even though in my case, my room was smelling like cigarette smoke even though they are not supposed to. You can easily get lost in the hotel since there are very little indications of where everything is from the elevators to the conference rooms. They give cookies at check-in which is quite thoughtful. I paid 179$ per night which is overpriced for what you get. I would stay here again but only if I had a better night rate.", "Date": "October 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "massachusetts", "Title": "“Medicore......”", "Author": "hmlax", "ReviewID": "UR20123127", "Content": "I have stayed at all the Toronto Airport hotels, Sheraton Gateway, Hilton, Westin and Four Points. I will say that this one was very well worn. The carpets were old, the decor was old. If you can get past that, then this hotel could work. This recent trip, this was the most reasonable, so I book it. Dinner was pretty good, and hotel room was spacious enough. If you need a reasonable hotel, then by all means book this one, please keep in mind the airport noise is pretty bad....", "Date": "September 16, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Hubbard Lake, Michigan", "Title": "“If You are staying for the nice pool don't bother!!!!!”", "Author": "whispersoftly13", "ReviewID": "UR17672402", "Content": "I was not impressed with this hotel at all. We picked this hotel because of the slides at the pool. Upon arrival at our room (Smoking) it smelled horriable and I am an avid smoker. We travel alot and did not expect this from this kind of hotel. Next was our trip to the pool. Were the max. capacity is 10 you are not reading this wrong this hotel has 12 floors and the pool can only handle \"10\" people. Next was the issue with the lifegaurds if there are not 2 the slides are closed and that doesn't take into effect that the 1 stays on the phone the whole time. It is very eye appealing when you arrive but I would not waste my time. I would rather stay in a motel 8!!!!", "Date": "July 8, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Brookline, MA", "Title": "“another great Doubletree experience”", "Author": "brookl", "ReviewID": "UR17237506", "Content": "I'm a huge Doubletree fan, and this hotel didn't disappoint either. The hotel is a couple miles away from the airport on a big highway. There is a free airport shuttle service provided about every half-hour. The parking is $10CAD per night for hotel guests; plenty of parking spaces available, and we never had problems finding space or getting in/out of the lot using the room card swipe. We got a room with a queen-size bed facing southeast. We could see the skyscrapers of downtown Toronto (along with CN Tower) way off in the distance. I don't think the hotel is directly underneath the main flight pathway, but there were small commuter-type planes flying overhead every now and then. Anyways, this happened only occasionally and never bothered us. The room was impeccably clean. The bed was heavenly with crisp clean linens, lots of fluffy pillows and mattress that felt just right. The bathroom was very clean as I've come to expect from every Doubletree. Great powerful shower. Overabundance of thick clean towels were supplied, as were nice Neutrogena toiletries. The guestroom was a bit on the small side, but still adequate and packed a couch, lounge chair and a work desk, in addition to the bed. The only real problem I had was that the free wireless Internet was very slow. I was very surprised by the large number of restaurants on premises. There were Italian/seafood, Japanese, Chinese, American, and a nice lobby bar as well. The Chinese restaurant (Grand Chinese Cuisine) had pricey, but excellent, dim sum. Grand Chinese didn't have as wide a range of offerings as places in HK or Vancouver, and it was quite a bit pricier here. But their shark fin dim sum soup, Shanghai steamed pork buns and shrimp rice noodles were just superb. I was hoping to use their indoor pool with two nice waterslides. But the slides were in operation only for a few hours each evening and there always seemed to be a bunch of kids every time I passed by the pool. So probably not the best place to go if you're looking to squeeze in lap swimming on a business trip.", "Date": "June 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edmonton, AB, Canada", "Title": "“Great Airport Hotel”", "Author": "EdmTraveller101", "ReviewID": "UR16710429", "Content": "Spent one night at the Doubletree Hotel in May 2008 and chose the hotel as am a Hilton's Honors member and needed a hotel close to the airport in order to catch an early international flight the following morning. Check in went smoothly with no errors and even though I arrived earlier (1:30pm) than check in, they had a room available for me as I had requested. Also provided their warm cookie on check in! The room itself had a queen sized bed, sitting area with a sofa and coffee table, a writing desk, and ample closet space if one chose to unpack clothes while staying. The morning I departed I ordered room service breakfast, which arrived on time (as ordered) and was very good. I didn't use any of the hotel's facilities (ie: the pool) so can't comment on those. There are a few restaurants within walking distance of the hotel, including a Tim Hortons, Subway, Japanese, and Kelsey's to name a few. The hotel itself offers a free shuttle to and from the airport for guests and was efficient in the provided schedule. Overall a great overnight stay and was in close proximity to the airport for those needing to travel to and from. If one was planning to visit metro Toronto, I would recommend staying closer into downtown, but if you had a vehicle, it wouldn't be a problem.", "Date": "June 5, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Austin, Texas", "Title": "“need a comfy bed ...”", "Author": "lighthouseboy", "ReviewID": "UR16658102", "Content": "Being a priceline junkie, I got this hotel for $48. It was ok. Comfy bed, free internet in the downtown business center. Near a little shopping/restaurant area so I walked over and ate at a 'Chili's' style restaurant to watch a hockey game and eat. There was a damp spot on the carpet but didn't notify the front desk. Airplane flying in don't bother me.", "Date": "June 4, 2008"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Kanata, ON", "Title": "“Not up to the Doubletree standard.”", "Author": "reclermo", "ReviewID": "UR12475158", "Content": "I am a big fan of Doubletree Hotels. I like their value to comfort level and the casual but classy nature of their properties. This particular Doubletree Hotel just does not live up to the same level of quality I have come to expect from the Doubletree name. I was only there for one night, and would have much preferred to stay at the Renaissance just down the street (where I usually stay). The whole property looks very dated and has a 1970's kind of feel to it. The room was a little musty, although the bed was comfortable but small. My impression after checking out was that this property should be closer to a 2 star than a 3 star based on my feeling. Just a note, excercise caution when going to the Perkins Restaurant down the street from the Doubletree for any late night meals. There are a lot of shady customers there after 11pm and we definately did not feel safe. If the hotel had been a Days Inn or a Comfort Inn, I would have thought it was decent, but I expect more from the Doubletree chain.", "Date": "January 9, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Toronto", "Title": "“If customer service matters to you, this is NOT the place to stay!”", "Author": "DancinPrincess", "ReviewID": "UR12281497", "Content": "I am NOT a picky person when it comes to hotel services.....I have stayed in all sorts and never had a problem, yet my experience on New Years Eve 2007 at the Doubletree International Plaza Hotel was my worst experience ever! We had booked a room for four guests for a one night stay from December 31st 2007until January 1st 2008. When we arrived at the hotel to check in we were told that on New Years Eve they have a strict policy of two guests per room, yet we had never been told this policy after our booking (approx. a month earlier) had been confirmed. The women serving us acted as if this problem was our fault and had a terrible attitude about the whole situation. She had said this was the only problem of this sort that they had that day....which I also over heard them telling another couple with the same problem a short while later. I would prefer they admit there was a mistake then try to cover it up. The women at the check in ensured us we would not be charged for the first booking......Well, we were......and the nightmare does not end there...... The hall in the hotel in which we were attending our New Years Eve party was extremely cold all evening (we had to wear our winter coats during dinner) and upon returning to our non smoking room we found it smelling EXTREMELY bad with smoke, which continued all night. There was no one smoking outside of our room so we figured it must be poor ventilation. I awoke feeling rather ill. Everything else was a regular hotel experience.....the cookies we received upon checking in were tasty.....if only their customer service and ventilation system could have been as pleasing as that chocolate chip cookie!", "Date": "January 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Houston", "Title": "“A Typical Airport Hotel”", "Author": "wgconrad", "ReviewID": "UR8265803", "Content": "Our family stayed at the Doubletree International Plaza during our trip to Toronto and Niagara Falls. The hotel was a typical experience for a hotel close to an airport. I would say the staff did their job, but they did not go out of their way to make me feel a guest. Our room accomodations were average; the rooms are small for the price. We did not eat in the hotel restaurant, so no opinion can be given for it. Overall, we would probably not stay here on a future trip.", "Date": "July 31, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Wisconsin", "Title": "“Terrible experience at this hotel”", "Author": "cq1996", "ReviewID": "UR8051816", "Content": "We booked our stay at this hotel through Priceline--on June26 to 28 for two nights. We reserved the room a week ahead for no-smoke because we traveled with a young child. However, at the time we checked in, we were bumped to a smoke room. I asked for the reason, the managers said it was hotel's policy and they did not have no-smoke room. However, I saw several people checked in with no-smoke rooms during the conversation with the managers. The managers seemed NOT care about the harzard of smoking to young children and adults. Their atitudes were terrible. Will never stay there again. Kane from Wisconsin", "Date": "July 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Detroit", "Title": "“Excellent experience”", "Author": "DiamondVacation", "ReviewID": "UR5767318", "Content": "We were confused about our trip stay after reading all the reviews. After our stay, we must say that this was one of the best stay ever in Toronto. Everyone in the hotel is nice and the waterpark is great. Fitness room are excellent for those who care. Waterpark with indoor slides was awesome and evryone had a blast in the hot tub too. Parking was $10 nightly, but we did not mind paying it for the experience. Someother traveller had something stolen from his car in the previous review. Though the place didnot look such, we always clear the car with anything valuable in sight, no matter where we stay. So Thumbs up for Doubletree. Thank you very much.", "Date": "September 4, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Lindsay, Canada", "Title": "“Decent Price But Not For a Swamp”", "Author": "a_farmer_in_Lindsay", "ReviewID": "UR5702146", "Content": "My wife and I always book an airport hotel if we have an early flight the next day and always take advantage of their parking facilities (normally, up to 2 weeks at no/little additional charge). This was the case with the Doubletree, which we were staying in for the first time. I had been to this hotel several times in the past for conferences and thought that it looked reasonable enough to stay in. So I booked a King bed in a corner suite for our before-flight night. No problems with check-in, check-out or parking. But the entrance hall/carpet in our room was totally soaked with some fluid, which I assume was water since a storm had just passed through the area. The rest of the carpetting had a few rolls in it and we found some belongings from the previous occupant hanging on the back of the bathroom door (we wore shoes to get to the bathroom, to get across the soaked carpet). Normally, we would have notified the front desk and insist on being moved but it was 11:00 PM and we had to catch a shuttle at 6:00 AM so we just went to bed. Unfortunately, our room had a connecting door to the next room and I had to listen to our neighbour's TV for a few hours before drifting off - not the best night's sleep I've had. I can only assume from previous reviews and reccomendations from friends that our experience was an anomaly rather than the norm. Although the hotel room interiors are a bit dated, we did notice that airline flight crews were staying at the hotel and I assume that they would not normally stay in substandard rooms. However, our experience was enough to put us off the Doubletree - we'll stay at another airport hotel next time.", "Date": "August 23, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Ontario", "Title": "“Horrible Management!!!”", "Author": "kkily", "ReviewID": "UR5639280", "Content": "I had booked a room for an overnight stay at the hotel for a convention. When I made the reservation, I had put a request in for a late checkout. When I got to the hotel, they told me they would charge me extra up to a particular time. I said that was okay and it was agreed upon. I even called down to the front desk before I turned in to double check the time and price so wouldn't have to worry about it the next day because I would be very stressed out upon checking out. The hotel room itself wasn't the greatest, I've paid less for much better rooms before. The bath tub struggled to drain and the little ledge to hold the soap was about to fall off. When it came to check out time, I looked at my bill and I was overcharged. I then had to speak to the onsite manager and he gave several excuses which had no validity whatsoever, I debunked them all and he wouldn't listen to reason from myself or his employee. He was extremely rude, when I was trying to get him to refund what he overcharged, he just walked away from me. He said he could do nothing about it but he was simply lying. He could do something, he didn't want to. Completely unprofessional. Even though there is a phrase that the service industry goes by, the customer is never wrong, in this case, I was 100% right. This manager exhibited such unprofessional behaviour, even towards his own colleagues such as raising his voice and asking meaningless questions which drew some attention from those around. I was appalled by his actions, never did I see a smile from him. He ruined my stay there. I'm appalled he is a manager. Never in my life have I encountered someone with such a title. Truly misplaced power. BUT there were some very friendly staff who made the stay enjoyable, and they were some of the nicest people I've ever met. It's too bad this hotel isn't better managed.", "Date": "August 21, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Toronto", "Title": "“Hidden gem for budget-conscious business traveler”", "Author": "h0tmail", "ReviewID": "UR5476891", "Content": "I've been to this hotel for conferences but this was the 1st time staying there. Room had good amenities and was clean and neat. The breakfast and lunch buffets are very cheap (around $15) and the food is fine. Free wireless internet in hotel. I called for a shuttle while at the airport and it arrived in under 10 minutes. It is also on a major public bus route. The best part was the price, around $120 on short notice - for a hotel this close to the airport it is fantastic. Do not exepct 5 star service if you want that be prepared to pay $200-300 per night near the airport, but I did not have any problems. I rate this hotel at a solid 3 and 1/4 stars.", "Date": "July 17, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "1", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Old and Tired hotel, better off staying elsewhere.”", "Author": "muppetx", "ReviewID": "UR5068185", "Content": "The international plaza is definately showing its signs of age. While the lobby and such look nice, the hallways and rooms themselves are a little dated. The halls have a very unfriendly odour and the room we had was small and not very well made. The bed had a feather duvet on it but no duvet cover, which defeats the purpose as you can't sleep with a duvet that has no cover on (its itchy and unsanitary). The bathroom light had blown out, and we called to get someone to replace the bulb. They never showed up, and had to call another 3 times before someone came...but they didnt come with a light bulb.... We gave up and went to bed, we had to deal with no lights in the bathroom for our entire stay. At checkout I complained about having so much difficulty in just getting a light bulb replaced and the girl at the desk told me it was my fault for not simply coming to the front desk to get one! Unbelievable. Our experience was definately not worth the price of the room, try the holiday inn airport or radisson if you need an airport hotel.", "Date": "May 14, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Cincinnati", "Title": "“Always dependable and comfortable”", "Author": "CincyOHTraveler", "ReviewID": "UR5026390", "Content": "I have stayed at this hotel many times in the last 6 months. My stays have been very comfortable, and the staff has been professional and pleasant. There are multiple restaurants in the complex, as well as a large pool with long slide, and separate hot tub. The fitness center has weight lifting equipment and free weights in addition to the multiple pieces of cardio. On business I seldom find a better deal than this at a place as nice.", "Date": "May 1, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "3"}, "AuthorLocation": "Sarnia", "Title": "“Not sports team friendly”", "Author": "A TripAdvisor Member", "ReviewID": "UR4956636", "Content": "I had booked for 2 separate hockey teams for the provincial championships. I know this particular hotel is very strict with security, so I made arrangements ahead of time with a person in charge of booking sports teams.What I needed was somewhere for the adults to go when the kids had to be in bed for curfew. I knew they didn't provide free hospitality rooms, so I inquired about paying for a conference room or something comparable. The person I talked with was very helpful, and offered me a large suite, which he said would fit 30 people. He also said since I had got 2 teams from our area to book with them, he would give it to me at half price.I called to confirm the week before, he said it was all set. He did inform me that at 11 o'clock the radio had to be off and the noise level had to be down. This is totally reasonable. Well I collected money from all the parents from both teams to cover the cost. Thursday night we stayed in the room until around 1:30, then turned in. I also went to the front desk and requested blue boxes and large garbage bags, so that we could try to keep things clean ourselves. Well the second evening was quite a different story. Security showed up and the suite and 8 o'clock and said it was quit time now. When I questioned him on it and said I was told 11, he knew I was right and left. He then returned at 11 and said they had had noise complaints. When I told him we would keep it down, I was informed, that he had a contract that said the room had to be vacated at 11, and that only 2 people were allowed in the suite. First of all, I don't know any hotel that says a family of 4 cannot stay in suite. When I asked to see the contract he showed me, it stated 11 quit time only. He said the person who rented the room to me shouldn't have and he wasn't in until Monday, so we were to leave or he was calling the police. I had to ask all these parents that had chipped in money to now leave. The wonderful security gaurd in the meantime called the police. They came and were very understanding. I told them of the numerous lies this man tried to pull over on me. Of course they could not do anything, as it was the hotels responsibility. When I asked for a manager, I was told they never had one on duty. Hard to believe a hotel doesn't always have a manager on. We had also ordered pizza from the hotel. I was quoted a price for 22 pizzas. I collected the money from the parents, and waited. I was called back by this same security person to say the price was changed, and it was $60 more. I said, I was already quoted and prices and had collected for it. I said for the large amount of the order, we should have been getting a better deal anyway. They were charging us approxiametely $27 per pizza. He said he would send us less pizza then. When I told him to cancel the order, all of a sudden the price was back to the original. We waited for 2 hours. Then we never did get to finish them because we were kicked out of the suite and the key changed. I tried to take this up with the manager the following day, but the customer is always wrong was basically her moto. She informed me we would have to wait until Monday, when we were back home to get any answers. As you can guess, I called today, and nobody was available. Basically what I am writing this for, is to inform any sports groups to avoid this very un-sports friendly hotel. This was my second and last time ever booking here. Very unsatisfactory response from management.", "Date": "April 10, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Rooms": "4", "Value": "3"}, "AuthorLocation": "Nashua, NH", "Title": "“All in all, a nice hotel”", "Author": "BeachBabyNH", "ReviewID": "UR4582669", "Content": "My husband and I just spent a long weekend at the Doubletree while he competed in the Canadian Airpistol Grand Prix being held there. The bed was comfortable, the bedding was clean, and there were extra pillows. Our room, which included a little sitting area, was nice and clean, and quiet enough for us. The hotel is by the airport so if the sound of jets taking off or landing bothers you, you may want to stay somewhere else, though it was less noisy late at night than in the daytime or early evening. The hotel also charges $10 a day to park there, which we (and our friends, also staying there) felt should have been free with the room. We and our friends had drinks in Harry's Bar the first night but not again, as the drinks were very pricey. We had the buffet breakfast every morning, for $13.95. A regular breakfast a la cart, ends up costing more than that, which of course all but guarantees that most people will go for the buffet, even people like me who don't tend to eat a big breakfast. We did not eat lunches or dinners at the hotel, the prices were more than we wanted to pay. We did have excellent meals at several different restaurants in the area. My only real disappointment was that on the hotel's website and also in the lobby, it tells you that there is free wireless high speed internet access in your room. Because of that and thinking that it would be easy, I brought my laptop computer (with my wifi card) but even after jumping through hoops and much frustration we were still never able to get connected. There is an indoor pool and hot tub which we did not use but our friends did and they found the pool to be pleasantly warm and the hot tub nice. All in all, we had a comfortable stay and would probably stay in this hotel again.", "Date": "March 4, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Ontario", "Title": "“Nothing wrong with this place”", "Author": "Mr.Babies", "ReviewID": "UR3898043", "Content": "Clean and comfortable, we used this place for a park and fly, my kids would have loved the pool and water slides. Dont see why anyone would complain about this place its not tops but very nice all the same.", "Date": "September 12, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Elmhurst, New York", "Title": "“Decent Hotel”", "Author": "NY11373", "ReviewID": "UR3638025", "Content": "Got this hotel through Priceline at a decent rate. I arrived at 12:30 PM and was quickly checked in and given a chocolate chip cookie. There is an $8.00 daily charge for parking. The room was well maintained, although the carpet needs to be replaced as it had a couple of stains and is beginning to wear. Other then that everything was clean. There is a switch at the door that turns off the TV. I had turned it off thinking it was a light. I thought the TV was broken. A call to the front desk quickly brought a service person up to fix the problem. To sum it up, this is a good hotel if you need to stay by the airport. They have a free shuttle to/from the airport. The only thing that irritated me a little are the $3.95 bottles of water, saying if you drink it, they will charge you. An employee comes to my room to \"check the water inventory\", but it seems like all upscale hotels in Toronto are doing this.", "Date": "July 5, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "London UK", "Title": "“Good value but a bit out of town”", "Author": "Bexster", "ReviewID": "UR3634193", "Content": "We stayed here for 5 nights this June. I could not fault the service we were given (ask for the free cookies at checkin!) or the attitude of the staff. Hotel was quiet at this time. There is a regular bus service outside the hotel to Lawrence West subway which then connects you with the city centre - approx overall journey time 75mins, cost about $4.50 each way. If, as we were doing, you plan to go into town each day this is a bit labourious, but very easy and runs until the early hours. Taxi is about $35 each way. The restaurants opposite the hotel offer good family value - style of TGI Friday and there is plenty to choose from. The ones in the hotel were in my opinion overpriced and a bit pretentious. Leisure facilities are good but note that they are unmanned so you will need to supervise children. Did not notice the plane noise when inside, only when waiting for the bus!", "Date": "July 4, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London, England", "Title": "“Perfect”", "Author": "A TripAdvisor Member", "ReviewID": "UR3544968", "Content": "The perfect choice for downtown Toronto. Breakfast, High Speed Internet and great service included. Staff outstanding. Rooms were comfortable, quiet and cool. Great value for money.", "Date": "June 12, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Rochester, New York", "Title": "“Very Nice Stopover Experience”", "Author": "Bill_NY", "ReviewID": "UR3414111", "Content": "I stayed at the Doubletree on the night before departing for a Carribean vacation. They offer a stopover rate that includes onsite parking and airport shuttle service. Although I paid only the standard rate, I was provided with a room on the excutive level. The room was nicely appointed... the bed had a velvety beadspread, down (or down alternative) blanket, and abundant pillows. The bathroom had marble tiling and high-quality toiletries. A hair dryer, iron, and digital room safe were all provided. The Doubletree is within walking distance of Tim Hortons and Swiss Chalet. Upon returning from dinner, I was surprised to find a maid was turning down the bed and leaving me chocolates! The hotel has a nice pool and fitness area towards the back of the building. The first airport shuttle departs the hotel at 3:55 AM; if you plan on taking it, get down to the lobby early... it's a surprisingly popular shuttle... they needed to request a second one on account of the crowd... since I was on the first shuttle, I'm not sure how soon the second one arrived. Upon returning from my vacation, I waited a mere ten minutes or the shuttle back to the hotel and found my car exactly as I had left it. I will definately stay at the Doubletree the next time I need a stopover hotel.", "Date": "April 25, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Nice and convenient”", "Author": "singflysmith", "ReviewID": "UR3314461", "Content": "We spent a night at the hotel during a trip from Whistler to Washington DC. The staff were uniformly friendly, my kids liked the cookies at checkin, and the buffet breakfast included in the room rate was really good. Our only problem was with some noisy people on the floor above us at 4:30 a.m., but about 10 seconds after I called the desk to complain, the noise stopped.", "Date": "March 30, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "ONTARIO", "Title": "“Bad experience at the Doubletree!”", "Author": "CRAFTY CRUISER", "ReviewID": "UR3020981", "Content": "Stayed at the Doubletree in November 2004. Have stayed many times before. We like the price, the pool, and the hot tubs. The hotel and staff are very nice. The problem we had was that we left our vehicle in their parking lot(Park and Fly Package) and when we returned from our vacation found that the window had been smashed out and items had been stolen. This has never happened to us there before and we are now a little leary of staying again. This is a gated and supposedly secure parking lot. Not sure if we will stay here again even though we love the hotel itself.", "Date": "January 20, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "st. catharines, on", "Title": "“Great cookies”", "Author": "celicagts7", "ReviewID": "UR2831055", "Content": "Great hotel, Nice pool, waterslids and great hottubs have stayed there twice, we got free parking for two weeks and a room rate of $99 very reasonable considering some people on our flight paid more just to park there car. Very clean rooms, recently remodeld compfortable beds, not anything more to ask for, great free cookies when you check in and also a great buffet breakfast. This is the one to pick.", "Date": "November 17, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "brantford ontario", "Title": "“ohh were lovin it”", "Author": "A TripAdvisor Member", "ReviewID": "UR2695601", "Content": "the international is the *bestest hotel ever. Frist when we got in the staff greated us with a warm smile and a bid warm cookie. we went up to are room and there was a bid window where every min. an airplane flew by. Its not nosey. there is a huge pool with two giant water slides. YOUR KIDS ILLLOVEIT. There is a hot tub and sprinklers. We have been here three time and this nov. is going to be are fourth time. Let me tell you that if there is not a shuttle going out at your time just talk to the front desk person. THE COOKIES ARE HERE LA LA LA GO TO INTERNATIONAL", "Date": "October 11, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Amherstburg, Ontario", "Title": "“International the only way”", "Author": "A TripAdvisor Member", "ReviewID": "UR1851336", "Content": "Well, every year we come to Toronto for our wonderful Wonderland trip. Each year we keep coming back to The International. It is clean, reasonable, quiet, and their pool is awesome! Conveniently located to restaurants and shopping. Our family just loves this hotel and we would recommend it to anyone, whether a family trip or business.", "Date": "May 1, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Houston, Texas", "Title": "“Don't even think about it”", "Author": "A TripAdvisor Member", "ReviewID": "UR1645989", "Content": "I would not recommend this hotel to anyone. I had a terrible experience once to many. Everything at the hotel was glamorous, except for their customer service. When I arrived last year, I was encountered with the worst, most unfriendly person ever. I still can't believe he is employed there, and to make matters worse, he is a Front Desk Supervisor. He told me his name was Michael, and he was very rude. He did not approch me in a good manner on one of the days I was trying to take a look inside a banquet hall room on the first floor. He was probably having a misserable day, and took his frustration on me. He asked me what I was doing, and quickly escorted me on my way. He is not proffessional and needs re-training. I know that I may not have been allowed to do something like that, but I was just curious. Well, I don't want him to loose his job, but I hope nobody else experiences what I went through on my vacation.", "Date": "February 11, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Jackson, MI", "Title": "“Beyond Expectations”", "Author": "A TripAdvisor Member", "ReviewID": "UR1188814", "Content": "My friends and I made reservations here for the Rolling Stones Concert. I came here without having checked the place out, and when my friends informed me of the daily rate, I figured that it was just your average hotel, and nothing more. I could not have been more wrong. The staff there was extremely helpful and courteous, and they clearly went out of their way to make my stay there very memorable. Five stars does not do justice to the high level of service that I received here. I am recommending this hotel to everyone without reservation.", "Date": "August 1, 2003"}], "HotelInfo": {"Name": "DoubleTree by Hilton Toronto Airport", "HotelURL": "/ShowUserReviews-g155019-d183783-Reviews-DoubleTree_by_Hilton_Toronto_Airport-Toronto_Ontario.html", "Price": "$105 - $204*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">655 Dixon Road</span> | <span class=\"extended-address\">Rexdale</span>, <span class=\"locality\"><span property=\"v:locality\">Toronto</span>, <span property=\"v:region\">Ontario</span> <span property=\"v:postal-code\">M9W 1J3</span></span>, <span class=\"country-name\" property=\"v:country-name\">Canada</span> </span> </span> </address>", "HotelID": "183783", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/2d/21/2d21b93da6392bc6dab0091f4d4716137large.jpg"}}