{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "ontario", "Title": "“good airport hotel”", "Author": "margaret0077", "ReviewID": "UR126218498", "Content": "we stayed at this hotel before and after our trip to Australia - the rooms are very inviting and clean upon entrance and good value for the money ($108 through our travel agent) beds are comfortable but the we found the room hot - no air conditioning available till end of May we were told but you good open the window for air which made it noisy with overhead planes since you are in the flight path - bathrooms are a little dated compared to the rest of the room.Wi-fi too expensive in the room ($14.95) but free in the lobby - restaurant breakfast buffet was good although a bit pricey - we were able to negotiate a very good parking rate of $100 to leave our vehicle in the parking lot for 6 weeks while away which was great - lovely staff very very friendly - would stay again.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Ontario Canada", "Title": "“Average Hotel”", "Author": "RobGS", "ReviewID": "UR125931839", "Content": "This is an average hotel (I assume it has a three star rating), the rooms are simple and a bit dated. The reason I gave it a two star rating is my room was at the end of the hotel and if you did not get into the shower early enough be prepared for no cold water.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "San Francisco", "Title": "“Nice airport hotel”", "Author": "Qflyer", "ReviewID": "UR125732925", "Content": "Spent 1 short night as I was 'transiting' through Toronto. Nice hotel with friendly staff, and the shuttle to the airport is also convenient. Had a decent burger from room service which came super fast. I didn't get a the chance to visit the concierge lounge. I would stay again if I need to take an early flight from YYZ.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Warrington, United Kingdom", "Title": "“Great Hotel”", "Author": "iKirsty", "ReviewID": "UR125655083", "Content": "I stayed here as I was delayed and missed my connecting flight to Winnipeg, it is within walking distance to the airport, staff very friendly and accomodating, rooms lovely and clean", "Date": "March 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "vancouver, bc", "Title": "“Great place to stay before you catch a flight”", "Author": "piscesrmt", "ReviewID": "UR125109881", "Content": "This hotel is a great place to stay before a flight. Stayed here in June 2011 before a flight to Vancouver. Thought it might be loud, but not at all. Close to Terminal 3, easy access to the airport. Rooms are a nice size and very modern and comfortable. Everything is nice and clean and the staff were very helpful and professional. Would definitely stay here again.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Trinidad", "Title": "“Great layover hotel”", "Author": "Bluebatt", "ReviewID": "UR124786635", "Content": "We stayed here twice, both ways on a layover on our way to Vancouver and back home. Good friendly service, great clean quiet room. Heavenly bed especially after our long trip. Little pricey but worth it for a layover. Easy access to food area in Airport.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Location”", "Author": "TrentP1", "ReviewID": "UR123927990", "Content": "This is a great place if you have a layover. When you factor can costs and so forth, it's a good place for the location. As for restaurants in the area, you would have to cab it in order to get non airport food. The restaurant in the hotel is good, but pricey. For the rooms, the size is nice and quiet even though you are close to the runways.", "Date": "January 31, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Whistler, Canada", "Title": "“Could be great”", "Author": "GMIan", "ReviewID": "UR123875536", "Content": "I was pleased with the overall value of the hotel but feel as though from my first experience that if the front line staff had more 'wow' to them I would not be paying such an aggressive rate for this hotel. The rooms are nice however you can tell that they have done surface renovations (as opposed to full renovations) in order to bring up to Sheraton standards. Bed and bedding was second none! Very comfy and wish I knew where to buy those pillows. Thank-you.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ottawa, Ontario", "Title": "“Great stay for one week on business”", "Author": "mbellny", "ReviewID": "UR123512477", "Content": "Stayed here for 1 week in January on business. Close to airport and highway 401. Room was clean, shower water was hot and beds were comfortable. I ate at the attached restaurant - Olio - every night for dinner and the food was excellent although a little pricey (e.g. $18 for chicken Caesar salad). Service was friendly. Internet is available in the room at a cost but is free at the business centre in the lobby. The hotel also has a nice gym facility and indoor pool. Parking is an extra $15/day at this hotel. Only drawbacks were: no free continental breakfast, charge for parking (but standard for Toronto) and no fridge in the room. Overall a great stay. I would recommend this hotel for business or if needing a place to stay near airport. Not recommended for sightseeing in Toronto as it is too far from downtown.", "Date": "January 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Lodz, Poland", "Title": "“good sleep conditions”", "Author": "greatboy", "ReviewID": "UR123398524", "Content": "I stayed at this hotel for one night when I got stuck at YYZ airport because of the delayed flight. The room wasn't very spacious, however it looked very clean. Beds were very comfortable which was a huge advantage after spending so much time on the way to Canada. Staff was quite friendly and understanding, they let me make a phone call using their phone at the reception desk. Prices at the hotel's restaurant were quite high though. Overally it was a good experience.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“common areas nice - old bathrooms, no wifi, no in room safe, no minibar/fridge”", "Author": "seekay03", "ReviewID": "UR123305938", "Content": "Having just returned from an 8 night stay at this property, i was quite underwhelmed especially as an SPG Platinum guest. Since the hotel was converted 2 years ago from a Renaissance to a Sheraton, the common areas have received a great facelift and are very nice by Sheraton standard. The room is OK with a new carpet and updated furniture but the bathrooms are terrible having received no more than a coat of paint AT BEST. There is rust through the grout lines in the shower, layers of paint on an old door, archaic faucets and counter space, hair stuck to the ceiling etc... I had a big issue with no in room WIFI in 2012, no in room safe and no minibar/fridge. Regardless of whether or not the hotel is privately owned and only operating as a Sheraton, should there not be some sort of \"standard\" that all hotels under the banner must follow? I felt that I was terribly inconvenienced by the above. There is a pool at the hotel with enough of a chlorine smell to not go inside. My associate took the risk and had to wash his eyes after getting out with the emergency wash to alleviate the burning and dryness. Bottom line, the hotel is acceptable, but don't expect anything special near the airport. The company that owns this property also owns the Westin Bristol Place across the street, with the same lobby rebranding they did at this Sheraton but there from the previous Wyndham. Same old rooms, same story, different address.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "NY", "Title": "“Overrated by Starwoods but a solid place to stay”", "Author": "Michdude", "ReviewID": "UR123236686", "Content": "Here's the deal on this one: It's nice enough but not sparkling. The room was clean but not perfect and I don't mean minor stains or dings because I don't care about those. I mean the empty water bottle on the floor behind the chair that wasn't removed by the housekeeper when she cleaned the room and some other things of that nature. But that's hardly the full picture. The beds were comfy, the room was slightly smaller than some others, but it's a more than adequate place to stay. The front desk gal was a delight. Can't recall her name but when I asked to be upgraded she apologized but they were out of those rooms but she immediately comped my internet. I asked to have the room de-feathered and housekeeping was there within five minutes and did it with a smile. Fitness center is very nice - not the best I've ever seen, but all around very well outfitted and user-friendly. Didn't swim in the pool, but it is positively first rate. Heard some planes, but didn't keep me up at night. One thing to keep in mind is that for me it would have made more sense to stay at the airport Sheraton which is right across the street from the terminal and above the rental cars because that way I could have taken my car in the morning and saved on the $12.95 parking fee at this Sheraton which is only a few minutes away. Minor quibble, but I would have loved to know about it. All in all, I'd do it again and look forward.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Peterborough, Canada", "Title": "“Great hotel - pre flight”", "Author": "PtboCan", "ReviewID": "UR123114413", "Content": "stayed here one night before a flight with family - including a 1 year old. The room was very clean, good quality linens, comfortable beds and no noisy heat/airconditioning. The vent flaps to let in fresh air was great. The lobby, restaurant, sitting area with neat fireplace were very nice and front desk staff were absolutely great. I highly reccommend this hotel and will stay here again.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "South Pole", "Title": "“Higher Calibre Hotel”", "Author": "BelgianBrew", "ReviewID": "UR122881010", "Content": "I stayed two nights in December while on a business trip. The front desk staff was friendly and professional throughout the visit. The king room was very clean and spacious, and had unique flap-vents which allowed fresh air but not a lot of noise into the room. The bathroom was well appointed with quality shower and supplies, albeit a bit small, but that didn't bother me at all. The restaurant/lounge served quality food and a good selection of draught beer. The servers were polite and attentive. The fitness facility was better than average with plenty of equipment and the pool was very large. The only negatives were the high cost of in-room internet (which I refused to use for that reason...enough with hotels charging for mediocre wireless service!) and the $15 daily parking rate which I know is common at airport hotels, but still unreasonable. There are a number of chain-type restaurants across the street from the hotel, as well. I would recommend this hotel and stay there again.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Perfect for a stop over”", "Author": "restless2travel", "ReviewID": "UR122788193", "Content": "Stayed here for a stop over, was very happy with everything. Rooms were comfortable, clean and bed was good. The fitness center was, a little out-dated. The pool was nice and very clean. It was Christmas eve so restaurants were very limited however the restaurant at the Hotel was excellent and our group of (4) was very impressed.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ontario", "Title": "“Great Location for Conference, Great Room Service”", "Author": "freezing1", "ReviewID": "UR122148550", "Content": "This hotel is in a great location when conference attendees are flying in from other locations. The hotel is clean and friendly. My room (King) was spacious and had all necessary amenities. Odd that wireless was not available in the rooms (only in the lobby), though, so if you want internet, you have to cable it. The newspaper placed outside your door in the morning isn't complimentary, either, even if you didn't ask for it. Don't read it if you don't wish to pay for it. I had room service at this hotel, and I have to say, it was one of the best room service meals I have had (NY strip steak). I would stay here again.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kingston, Canada", "Title": "“Friendly service and a green policy”", "Author": "MIck7171", "ReviewID": "UR121794742", "Content": "If you dislike the artificial fragrance that many hotels use throughout or have allergies, I believe this place will be a pleasant and comfortable change as they have a green policy. The service was very good, the staff friendly and as someone with allergies, they were understanding and very helpful. The food in the restaurant was also excellent.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“The food is great in the Olio restaurant, especially the crab cakes.”", "Author": "Sandhu111", "ReviewID": "UR121682623", "Content": "The staff was awesome, great location and clean room. It is only 5 mins to the airport and the hotel has its shuttle to & from the airport. Definitely, will go back.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Very nice hotel, some heating issues in meeting room, otherwise rooms, service and food all great.”", "Author": "Pdorgan", "ReviewID": "UR121536864", "Content": "Stayed in the Hotel for off site meeting. this is the third time service rooms etc all excellent. This visit marred a little as heating in the meeting room seemed to be defective, handled fairly well.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Halifax, Canada", "Title": "“Nice, convenient, decent price.”", "Author": "Mandyparsons", "ReviewID": "UR121098636", "Content": "We booked with this hotel through Hotwire.com (for $95/night tax inc.). Very clean, very friendly greeting at the front desk. We had a standard King room. Bathroom was nice with faux marble countertop. Coffee and tea provided in the room. No bar fridge or safe that I could see. The temperature in the room was difficult to control. We found it too hot so we turned the thermostat down and turned on the fans. Instead of blowing cold air it blew super hot air and then we had to open the \"vents\" on the windows. Unfortunately that meant REALLY hearing the planes coming in every 5-10 minutes to Pearson airport until approx. 1am. I guess there isn't really much they can do with the noise, being close to the airport and all. But the thermostat working properly would have made the stay more bearable. We were only here overnight so we didn't get a chance to see or try any amenities. We did take the complimentary shuttle in the morning to the airport that runs every 1/2 hour. Go early! since this bus makes 2 other stops before going to the airport (20-25min trip).", "Date": "November 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Haute Aboujagane, Canada", "Title": "“All around excellent stay”", "Author": "boisverf", "ReviewID": "UR120888092", "Content": "Had to stay at this location for a three day business meeting. Staff was more than awesome, everybody very helpful. The hotel is very clean and the rooms are very comfortable. Location is great although the name can be a little confusing, it is not located at the airport itself, it is a 10 minutes taxi ride from it. Great restaurants nearby and the installations for conference and meetings are just great. Only negative is internet access, there is no In room access included in the price, an extra 14$ a night is pretty expensive. During the day, the fee was 150$ for internet access in one of our meeting room. I can understand the charge in the conference center, but for the rates you have to pay for a room, it should definitely be included. This is the only reason this hotel doesn't get 5 stars from me. Aside from that, the pool is very nice and the fitness center is very well equipped. I will be staying there agiain next January, hopefully they have figured out the Internet issue as I will be there for business again, this time for 5 days.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Cool window vents...literally...”", "Author": "Anthony015", "ReviewID": "UR120724908", "Content": "My first stay at this property. Elegant lobby, clean, spacious and comfortable rooms. Very comfortable beds and pillows. I like to keep a window slightly open for fresh air and was initially disappointed when I drew the curtain and saw that the floor to ceiling windows could not be opened. That's when I noticed two loovers that can be opened for air circulation, which they did more effectively than any partially open window I've ever had. Fitness center was somewhat small but clean and functional. I prefer the city to the suburbs but I think this will be my hotel of choice when staying in Toronto Airport area.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Burlington, Canada", "Title": "“RFL Summit”", "Author": "Farrah C", "ReviewID": "UR120660114", "Content": "This is a very nice hotel. I just spent the weekend here to attend a Summit. The food was great all weekend!! The staff were great. Check in/out was very pleasant. The room was clean and the King size bed to myself was very comfortable.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "waterloo", "Title": "“Good hotel for conferences/conventions”", "Author": "edulinx", "ReviewID": "UR120466971", "Content": "Good place for a conference. Good restaurant on premises and several casual dining options in vicinity. Only complaints are extra fees for parking and hi speed.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Perfect for weary travellers”", "Author": "bhaforever", "ReviewID": "UR120387036", "Content": "I've stayed here a few times now and the rooms are always very clean and the beds are super comfy. If you're a weary traveller and need a place to stay near Toronto airport, its a great choice. The only downside is that in my opinion, its noisier than some of the other local hotels. It's not insanely loud but it can be distracting if you're a light sleeper.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southern Ontario", "Title": "“Did not have to stay but SO glad we did. Just what we needed.”", "Author": "travel_guru_r_us", "ReviewID": "UR120377015", "Content": "We stayed for a weekend (three nights) in October 2011 to attend a convention and the hotel was just what we asked for. We live about 30 to 45 minutes from the hotel and were on the fence about either commuting three days or staying at the hotel and we are so glad we stayed at the hotel. The rooms were clean, the staff helpful, easy access to internet all over hotel, food on the premises or just a quick walk across the street (Boston Pizza and Tucker's Market and others.) The rooms were very affordable and we had to pay for parking, but we were able to get a great rate through the convention of $7.50 per day, which was a steal and alot cheaper than the hotels posted rates (I think $20 per day). When we checked in early, our room was available and there was no line up at the checkin desk. Later on during the, peak checkin time (around 4pm), the line up was very long. We were worried, that being so close to the airport, that we might hear planes flying all hours of the night, but when in the hotel we did not hear one plane. Also being near to the highway, we could not hear any type of street traffic. This was fantastic and provided us with a nice quiet restful sleep.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great hotel for layover or longer.”", "Author": "1t1m3", "ReviewID": "UR120375332", "Content": "The staff here are fabulous! They go out of their way to make you feel at home on your first visit and every stay thereafter.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Best Hotel for Business Travelers - Hands Down!”", "Author": "CMF_001", "ReviewID": "UR120282755", "Content": "I have been staying at this property every Monday-Thursday for over a year and couldn't be happier. I would highly recommend this hotel to any business traveler who is working near the airport - it's very conveniently located and provides easy access to several major highways. The staff is outstanding (Aneesa at the front desk takes excellent care of regulars!), the gym is equipped with everything you need for a great workout, and the food at Olio (the hotel restaurant) is so delicious. This is truly my my home away from home! :)", "Date": "November 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“good stay overall”", "Author": "Panos A", "ReviewID": "UR120207498", "Content": "I enjoy the buffet breakfast when I am here The club lounge is often closed on weekends so snacks are limited but they make up for it with a breakfast voucher The dinner at the hotel was nice last night.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Home Away from Home”", "Author": "Montrealia", "ReviewID": "UR120121403", "Content": "Great choice for frequent business flyers. Clean and tidy amenities (room, lounge, gym, pool and restaurant). The friendly staff really set it apart from other hotels. Everyone, literally everyone, including the hotel general manager, front desk, lounge staff, cleaners, restaurant servers, chiefs, make a real effort to know you personally. Most of them also know when to leave you alone if you are not in a mode to talk. :>) I have been staying in the hotel regularly for the last year or so. It is a true home away from home.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Excellent service, food and location”", "Author": "sn7", "ReviewID": "UR120094371", "Content": "One of the best airport hotels. Staff treat you as real guests and value your business. Service is excellent and food remarkably good. Rooms spacious and clean. Decent gym. good conference facilities. Easy access location.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "vancouver, BC", "Title": "“Hotwire jackpot!”", "Author": "azarbrook", "ReviewID": "UR120086524", "Content": "My husband and I had a overnight stopover in Toronto so we hotwired it and I was initially disappointed thinking it would be a run down old Sheraton. This is a beautiful modern clean hotel with a wonderful lobby restaurant Olio. The staff were wonderful at check-in. We asked for a later check-out because we had plans in the morning and wanted to be able to pack up later. They gave us 2pm check-out! Nice clean bathroom and shower/tub. Bed was perfect and big and comfy - great sleep. Parking is $15 I think. Would definitely stay here again!! Paid $83 on a Sunday night.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great Service, Great Sleep...”", "Author": "Outrun", "ReviewID": "UR120044256", "Content": "I felt great checking in here - the staff made me feel quite welcome. I'm used to staying at the Gateway, the Sheraton right at the airport. But it seems clear here they want to draw people to this location, too. Though planes seem to fly by very closely (it IS by the airport after all!) I was able to sleep well without being disturbed by aircraft noise. The menu in the restaurant is excellent for a hotel restaurant. Though there are plenty of chain restaurants around, I checked out the hotel restaurant, Olio, and wasn't disappointed.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Service is amazing, comfortable beds!”", "Author": "Wai Ming L", "ReviewID": "UR120042703", "Content": "I've been staying here for the past month every week from Mon-Thu. Staff is always friendly and accomodating. Aneesa and Orlando especially takes really good care of our group.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Halifax, Canada", "Title": "“Nice hotel, scary location”", "Author": "LesleyFromCanada", "ReviewID": "UR119877826", "Content": "I attended a convention at this hotel and stayed there for 4 days. The convention facilities are very good; the hotel had tables filled with water laid out at strategic places for everyone to use, and the main hall was very large & accommodated a lot of people. Also, all the rooms used by the convention were all on the same floor, which made things very efficient and easy to find. The hotel is very close to the airport, which is a good thing for those who are only staying one night and maybe need to catch an early flight... but it's also a bad thing. It's a bad thing because the hotel is in the flight path of all incoming planes to Toronto Airport, meaning that every single minute all day, HUGE airplanes pass really close over the hotel. If you have a room facing the direction of the planes like I did, this can be unnerving; I was worried I was going to die, lol. I do have to say though, that the insulation and sound-proofing is very good. I was on the 7th floor and I wasn't bothered by plane noise or traffic noise all night. The beds and pillows were really comfortable, and the rooms were cleaned very well. I found the food in the restaurant to be over-priced though ($17.00 for a burger and fries? Really??) and while there is a couple fast-food and sit-down restaurants close-by, the hotel is kind of off the beaten track as far as entertainment goes. It takes 30 minutes by bus to travel to the heart of downtown Toronto.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Amazing Staff, Great Rooms and Perfect Beds!”", "Author": "arifiano", "ReviewID": "UR119808296", "Content": "I have been staying at this hotel for the last 18 months and I have to say that I would go nowhere else. It is home away from home! The staff is amazing and will go out of their way to correct a situation or make a difference in your stay! I have stayed at many of the Starwood properties in the area and I would go no where anymore. I am at home at this hotel. The restaurant has good food and the bar has a great ambiance. AND BEST OF ALL YOU HAVE TO TRY THE BREAKFAST! Nice size indoor pool and descent Hotel gym! Highly recommend this hotel!", "Date": "October 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Stratford, Canada", "Title": "“Good room, lousy internet”", "Author": "notbornyesterday", "ReviewID": "UR119405414", "Content": "The decor, convenience and cleanliness of this hotel is industry-standard. The staff seem friendly, and the room is large enough, with good amenities. However, since I stayed for business reasons, I needed the internet, which is extra in the room. Downstairs I go to the lobby. I have three accounts to check, all on the same (Canadian) domain. No problem with the first two. Account three is blocked because their filter says it is an \"adult\" domain. Whatttt?? Try every which-way to get in, but always blocked. And did I mention that the online usage is timed to expire in 45 minutes?? So, back to the room to try with the (provided) ethernet cable. Guess what? It doesn't work either, but not for the same reason. The cable is frayed beyond usefulness, so I can't get to my emails, which I need for the next day. Not coming back, not when they charge for it, and it doesn't work. And by the way, the desk clerk did not ask if my stay was pleasant. She said almost nothing on check-out. If she had asked, I would have told her.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Cannot beat service like this”", "Author": "Christopher D", "ReviewID": "UR119252847", "Content": "Aside from the great decor and room size, the staff is what really sets this hotel apart. For desk service, everyone is great - you're best off getting to know Aneesa though. She is the epitome of going 'above and beyond'. Her bubbly attitude and willingness to do whatever it takes to make your stay as easy as possible makes staying at this hotel feel like home. And if you're lucky enough to have lounge access, Orlando (in the mornings) and Val (in the evenings) could not be friendlier people to see everyday. I'm barely through the door before Orlando has an OJ sitting on my table for me and Val is always concerned that I haven't gotten enough to eat. Overall, this hotel is great - but really, it's the staff that sets it apart", "Date": "October 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver Island", "Title": "“Great Hotel Right at the airport.”", "Author": "SurfTofino", "ReviewID": "UR119227874", "Content": "If you are looking for a nice hotel at the airport in Toronto this is your place. Conected via overhead walkway to terminal 3 it is as close as your going to get. Perfect for bushiness travelers on an overnight in Toronto. Little more expensive but it all about location. The beds here are incredible they have almost made me late for my flight on several occasions.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, British Columbia, Canada", "Title": "“Best Hotel On the Airport Strip”", "Author": "IanR08", "ReviewID": "UR119197814", "Content": "I have been travelling to Toronto on business for over 25 years and have stayed at almost every hotel on the Toronto airport strip and by far had my best experience just last week at the Sheraton Toronto Airport hotel. This was my first time staying at this property and this will become my airport hotel from now on. Rooms are well appointed and bed is so comfortable. Restaurant and bar service was extremely good and the food was excellent. What seperates this hotel from the others is that the staff are motivated to make your stay enjoyable and memorable. I will definietly be back. IR, Vancouver, BC", "Date": "October 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Good overnight stay”", "Author": "nadma", "ReviewID": "UR118585396", "Content": "I stayed at this hotel last night for one night for a flight connection. The shuttle to/from the airport was a breeze. The front desk staff were nice and helpful even at the wee hours of my arrival. The in-room breakfast was good and served on time. The room was clean and large. Very quiet. I did not have time to check out the facilities of the hotel so cannot comment on those. The overall look of the hotel is clean, up to date and pleasing to the eye. I recommend this hotel. I got a decent price with hotwire and at that price, it is excellent value for your money. But I think this hotel is worth paying full price too.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“great hotel”", "Author": "ilikewomen", "ReviewID": "UR118414582", "Content": "this hotel was clean, it is well insulated so you cannot hear the planes, the service was great, and the breakfast is decent. the hotel really is excellent, everything is tip-top. staff was friendly and helpful. there are also tons of restaurants near by - good ones - and the airport is close by as well. definitely recommend this hotel and if you have a little extra money upgrade to top floor with lounge for unlimited snacks, beverages, and a nice view of runway. you can look at the planes take off and land right in front of you without hearing them.", "Date": "September 21, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "5", "Service": "3", "Rooms": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Nice Hotel”", "Author": "ChasmeBadur", "ReviewID": "UR118322329", "Content": "My stay at this hotel was wonderful I had a room on top floor with a nice view. I stayed here for 1 night the room was clean with a nice decor. The parking is tricky you need to park at airport parking ( Long term ) and then take take a train to the hotel terminal short ride my kid loved it. A good experience overall.", "Date": "September 19, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Toronto, Canada", "Title": "“You can do better! - Service needs improvements”", "Author": "McBerr", "ReviewID": "UR118280346", "Content": "Had a conference here. On the day of checkout, the conference didn't end until late afternoon, when asked for late checkout, the front desk girl talked to me as if I was inconveniencing her terribly. \"Well....the best we can do is 12\" since when 12 became late checkout?? I consider myself a regular traveller and 12 is definitely no late checkout despite where you go. She was going to charge me 50 dollars for extra 3 hrs!! Consider how much the company pays for the weekend of conference and all the rooms, this is what the hotel should accommodate minimally! There are plenty of hotels in the Toronto airport area, and this one is definitely not in the top 10!! If you get a really, I mean REALLY good deal, then stay here. Otherwise, consider the others, you will probably get more for your money and better overall service!", "Date": "September 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "2", "Service": "4"}, "AuthorLocation": "jonlking", "Title": "“Relaxing and Convenient”", "Author": "jonlking", "ReviewID": "UR117847964", "Content": "We had an early departure out of YYZ and did not want the hassel of communting out of downtown Toronto. I chose to stay at the Sheraton at YYZ airport. I was amazed when we entered the lobby of the hotel. We were pleased to see an upscale and contemporary lobby unlike the ususal dreary, worn and dated airport hotel venues. There was a real (not airport cusine) restaurant and bar area. The food and service was good. The rooms were quiet and comforatable with up to date furnishings and all the amenities that we desired for a hotel of this type. Thanks to Sheraton for a comfortable place to relax and regenerate before a long trip home.", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Ontario", "Title": "“Decent stay, good value”", "Author": "kimmOntario", "ReviewID": "UR117834085", "Content": "Stayed here one night to pick up people from Pearson airport. Room was clean, reception was friendly and efficient. When in the room, you could hear the planes in the background as they flew overhead, but that's to be expected from an airport hotel. Minor annoyance - the closet in the room didn't open properly and it was a real struggle to get the luggage rack and ironing board out of the closet. Would stay here again, particularly if I got the $89 rate (seemed to be a last minute deal). Parking is an additional $15 per night. There are several restaurants just across the street - Boston Pizza, Jack Astor's and Montana's, with several more a couple of blocks away. Airport is very close (no need to get back on the highway) and the hotel airport shuttle runs every half hour. Although wireless in the room is an extra cost, we used the free internet available on the many computers in the lobby area.", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Ottawa", "Title": "“Visiting our Granddaughter”", "Author": "WenGeo", "ReviewID": "UR117728112", "Content": "We just spent three nights at this wonderful Toronto Hotel. Our room was clean, spacious and quiet. The bed is comfortable and you won't hear the planes while your trying to get a good nights rest. The gym facility and pool are great and the staff at this hotel are professional, friendly and helpful. We will definately stay here again. We stayed on the 6th floor and Monica, the housekeeping lady does an excellent job. Joseph at the front desk was wonderful. The hotel has several computers in the lobby area for guest use.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Cincinnati, OH", "Title": "“Would stay here again; great location.”", "Author": "jaymdennis", "ReviewID": "UR117557056", "Content": "This is a perfect location. The pool was very nice and so was the fitness center. We would definitely stay here again. Rooms were clean and getting extra items was no hassle at all.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“we had a great stay and plan to go back!”", "Author": "maria i", "ReviewID": "UR117490176", "Content": "the hotel staff were extreemely accomodating and friendly. we had great service always with a smile! the rooms were very comfortable and clean. we were able to get a fridge in our room, which was a nice treat!", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Will return”", "Author": "Montreal_native", "ReviewID": "UR117125837", "Content": "The hotel could easily be at a downtown location. Its not your typical airport hotel with nothing to do. We stayed at this hotel since it was one of the closes SPG hotel to Canada's Wonderland. As usual for Sheraton hotels the room was very clean, quite large, and very comfortable. We got a 6th floor room facing the parking which being at the airport didn't have that great a view. (Not that I was expecting one). Next time I'll make sure to ask for an airport side view though since it probably as more interesting thing to see. The hotel has a great pool and gym which we unfortunately did not get to use. There was also a nice courtyard type area next to the lobby with beautiful water feature. Very relaxing to look at. The hotel is very convenient and easily access via highways 401 and 400 which made the drive to Wonderland a breeze. The only complaint I have is that the parking was 15$ per day. Even though the parking fee I would still stay here considering most hotel now charge parking anyways.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Saint Thomas, Canada", "Title": "“Great....”", "Author": "Aprylmm", "ReviewID": "UR116875427", "Content": "Great gateway hotel, just a few minutes shuttle ride from terminals. Very nice to have another Starwood hotel on TO airport property, this one is out of the hustle n bustle of the terminals. Just loved it, also great friendly staff. Great indoor solarium style pool, amazing swimming and watching planes go over.", "Date": "August 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Close to the airport.”", "Author": "CdnJetdoc", "ReviewID": "UR116540143", "Content": "Stay at this hotel regular for business. Staff friendly and helpful. It is a older hotel and shows it in spots. No wireless Internet in the rooms.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Home away from home”", "Author": "gereme", "ReviewID": "UR116313412", "Content": "At Sheraton Toronto Airport Hotel my friends and I were treated royally. The staff is very courteous and everyone treated us with respect. I enjoyed my stay tremendously and I am looking forward to return as soon as possible. After a long tiresome journey it felt real good to fall asleep on a bed that felt like it was my very own. In terms of comfort and relaxation my friends and I loved the bed, the cuddly pillows, and our exhausting pillow fights. We loved being at the Sheraton and promised each other that we will be back sometime soon.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Ontario", "Title": "“I love this place!!”", "Author": "Erika74_9", "ReviewID": "UR116267608", "Content": "Hotel is centrally located, and the rooms are spacious and clean. Beds are comfortable, the bedding is delightful, and the hotel itself offers a lot of amenities. Underground parking is extra; but this is down-town Toronto - to be expected. You are within quick walking distance of so much! I love staying here, and would go back in a heart-beat!", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Montreal, Canada", "Title": "“Not what I expected”", "Author": "birikht", "ReviewID": "UR116029872", "Content": "I had a lot better experience at Travelodge! Theaff don't make you feel welcomed. There were stains on the curtain in the room. The bathroom did not meet the standards of a four-star hotel (rusts and cracks at the bottom of the door, nothing extra to what I had seen at Travelodge). A very average hotel, over-rated.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Hamilton, Canada", "Title": "“Great customer service plus”", "Author": "lucillemacdonald", "ReviewID": "UR115985495", "Content": "I would like to highly recommend this hotel. I commend the staff at the hotel. They were friendly from the minute I entered the hotel right up the room and room service. Jason greeted me at the door, took my luggage and waited to take my luggage upstairs, then parked my car. There were two individuals on the front desk and a gentleman opened up to check me in quickly so that I did not have to wait. His name started with a J (unfortunately I did not get his full name). I held a last minute meeting for 10 in the restaurant, the front desk clerks assisted me greatly, and accomodated my needs for an area of the restaurant that was somewhat secluded so we could discuss some issues of a sensitive nature. The food was wonderful and our server was attentive to all the guests. Then prior to checking out, the maid on the floor was also very friendly asking me if my stay was good or if I needed anything. When I checked out in the lobby, the girls were bubbly and started my day off with a smile on my face. Thanks again, I will not hesitate to stay at your hotel again. Please thank your staff for me, I really was impressed.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Midland, Michigan", "Title": "“Average chain hotel”", "Author": "planetraincar", "ReviewID": "UR115938335", "Content": "While in Toronto for business, I stayed at the Sheraton Toronto Airport Hotel because I had my car and didn't want to pay the ridiculous parking charges that come with downtown hotels. I didn't mind driving 20 minutes for my meetings, so I thought this would be a great choice. I paid $77 on Priceline, which is frankly about right for the value provided by the hotel. This is a dull, boring chain hotel. Most importantly, it's not a four-star property. While very clean, the hotel is showing its age, as others have said. There's no wireless internet in the guest rooms and the wired internet is terribly expensive ($15). The hotel, however, does have several computer terminals just off from the lobby. While these are new computers, I found the internet access to be very slow. I tried using my BlackBerry smartphone to connect to the complimentary lobby wireless internet, however, the connection had issues the day I was there. Additionally, the hotel charges $15 for parking, which is ridiculous. I could understand if this was for guests who wanted to leave their car at the hotel while they flew out of nearby Pearson, but not in my situation -- especially when there was no shortage of parking spots. The room itself was comfortable and clean. It had a large, flat-screen television with a plethora of channel offerings. The decor was bland and what one would expect from a chain hotel. The staff were friendly, but they were overworked for a four-star property. There was never more than one person on duty at the front desk -- and there was always a line of a couple waiting guests. There wasn't a concierge. There wasn't a bellman or valet parking attendant. The restaurant was an overpriced cafe, though the pool and fitness center were nice. All in all, if you can get a good deal on Priceline, consider this hotel, but don't expect a true four-star experience.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "2.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Denwood", "Title": "“OLD ROOMS EXPENSIVE”", "Author": "ramsayj01", "ReviewID": "UR115918584", "Content": "Although the hotel is only a quick trip from the airport, it is not worth the benifit of not having to take a hotel shuttle to stay here. It was expensive and the extra expense is not worth the convenince of location. The room was old and dirty, I have stayed more than once so could not put it to just that room. Staff not very friendly, nor helpful. I enjoyed the Marriott hotel that was a short shuttle ride away. Also nicer to have some resturants within walking distance to go to.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "BALMERTOWN, ONTARIO", "Title": "“If we fly out of Pearson we will stay here!”", "Author": "NEMA17", "ReviewID": "UR115800869", "Content": "The hotel is very close to the airport and very easy to get to. We went to the Sheraton that is part of the airport and it was difficult to get to and very busy. Service was wonderful, very helpful and knowledgeable staff here. Parking was outdoors but very nice, clean and seemed a very safe place to leave your car. We stayed on the club floor and the rooms were beautiful and large, and the sheets were very very soft. The breakfast on the club floor had a large variety and was very fresh. We went to the pool and hot tub at night, not busy and the water was a good temperature. Pool is not really designed for small children, the water starts about 3' deep and goes to about 9' deep. The water and the floors were both very clean and not slimy to walk on. I believe there is a shuttle that goes to the airport and select places around town. There are some restaurants (Montana's) right across the street. One thing we would have liked to have was wireless internet. There was internet but it was cable only. Overall we loved the hotel and would absolutely stay here again if we were flying out of the airport.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "2.0", "Value": "2", "Service": "4"}, "AuthorLocation": "british columbia", "Title": "“Four star rating? I don't think so.”", "Author": "ikelmay", "ReviewID": "UR115600139", "Content": "This really is an instance where the camera may not exactly lie, but it is somewhat economical with the truth. The website photos and images are very well crafted, but not 100% accurate. We stayed overnight and needed an airport hotel - I was looking for an upscale experience, but this wasn't it. First exterior impressions were that the hotel exterior looked somewhat dated. The staff are very pleasant and professional, but it doesn't disguise the fact that this hotel is starting to show its age and is in need of a makeover. The room was decidedly tired and felt shabby, although the bed was itself was comfortable. It was adequate, and that is not a description that should be applied to a hotel with supposedly four stars.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“great staff”", "Author": "tunahoagie1", "ReviewID": "UR115480095", "Content": "three of us got there after nasty traffic on the QEW so we were tired. Front desk agent (Jodi-Ann) was friendly, efficient, professional,and courteous. Got done in no time with our request for two adjacent rooms. She recommended a Chinese restaurant down the road which was just what we needed. During the stay, the bartender (Giselle), Ian (bellman), and manager (Katie) were great. Tried to access email from their public compuer but kept getting blocked by the software. Katie said go to the room and get wifi on my laptop and she'll waive the charge. That was very accomodating. Since we were traveling in the heat of the day, we brought a cooler but the room had no fridge. No problem. They took our ice packs and froze them for us and we got them on c/o. Let's not forget our server at Olio - whose name I did not get because he was just flitting around us so quickly. We opted for the buffet but he remembered our juice order from the previous morning. That was amazing and a very pleasant surprise. Also, the cook at the buffet made perfect (for me anyway) soft and runny scrambled eggs - even though they had a bunch pre-cooked. Wished more places were so customer-friendly.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Sault Ste. Marie, Canada", "Title": "“Not impressed, wouldnt stay there again”", "Author": "DawnaK10", "ReviewID": "UR115032785", "Content": "First room we were put in had a stained toilet and tub ... yuck!! Moved rooms, new room was nice however bathroom was so small and no fan, air conditioning didnt work very well and no plug ins available to blow dry hair etc outside of bathroom. Charging $12 a night for internet that is free to the hotel ... Not impressed especially for a Sheraton! Wouldnt stay here again...", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Convienent location for our visit”", "Author": "eschulz3", "ReviewID": "UR114680518", "Content": "We stayed here for a conference on sight. There's easy access to the TTC in order to get downtown (albeit takes 30-45 minutes). The staff was very friendly and accommodating, and the room was modern and clean. The bed was EXTREMELY comfortable. The free computer center in the lobby was nice, but I agree with other reviewers that they need to upgrade to free wifi in all the rooms.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "2", "Service": "5"}, "AuthorLocation": "Combermere, Canada", "Title": "“Mixed feelings”", "Author": "kentwaddington", "ReviewID": "UR114332769", "Content": "My hotel room on the fourth floor was modern, spacious and very clean. I was in the room right next to the elevators and I never once heard the elevators. I like not having to walk too far to get to the elevators. Bathroom was clean, well lit and very well appointed. Plenty of parking at $15/day. Staff was very friendly and accommodating providing a late check-out of 5:00 pm which I really appreciated. What really burned my cookies was the $5.95 charge for a freaking litre of bottled water. Who in their right mind wants to pay $5.95 for bottled water? Sorry guys but this slap in the head set the tone for my stay. I did find the $175 per night a little much.", "Date": "June 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Calgary", "Title": "“This hotel always exceeds my expectations”", "Author": "Western_Road_Warrier", "ReviewID": "UR112007615", "Content": "I have now stayed at this property 4 times in the past three months. The staff already recognizes me when I arrive, makes sure that my room and service meet my expectations and have immediately rectified any problem that I encountered. The bar is above average and the menu is interesting and reasonably priced.", "Date": "June 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Among airport hotels, this place is very good”", "Author": "Doug0nTheRoad", "ReviewID": "UR111145377", "Content": "I'm not usually a fan of airport hotels and tend to avoid them unless I really need that airport convenience. So, I suppose I rate them differently than downtown hotels from which I expect much more. That being said, within that class of \"airport hotels,\" this Sheraton in Toronto (there are two Sheratons by the Toronto airport -- one, the Gateway, is attached to a terminal, the other is this one and it is about a 5-10 minute cab ride. Great staff, clean modern decor, fun bar and if you want a decent meal, there are some reliable restaurants in the area -- like the Lone Star which serves up some fantastic fajitas. the view I had looked out over a fountain and a golf course -- I was NOT expecting to see anything attractive outside and was very pleasantly surprised. The only annoyance was that they still don't offer WiFi in the rooms. If you're using a laptopm that's a pain, but if you are using a smartphone or something like an iPod Touch, it's a bit more of a problem and I hope they rectify that. Among Toronto's airport hotels, this is now my preferred option.", "Date": "June 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Excellent Hotel For Business Traveller”", "Author": "DanoPS", "ReviewID": "UR110849253", "Content": "Have stayed and continue to stay at this hotel for business travel in the Toronto airport area. Very convieniant location to airport with frequent shuttle service. Good gym and pool for recreational purposes. On site restraunt is very good but a wide variety of restraunts are also available in near walking distances. Staff is very helpful and accomodating. Definately my prefered SPG hotel in the airport area.", "Date": "May 31, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Toronto", "Title": "“Very nice Sheraton hotel”", "Author": "goonybones", "ReviewID": "UR110753521", "Content": "Sheraton always offers a great hotel, I've never been dissappointed with them, no matter where I am in the world. This hotel was incredible service, and was extremely clean both in the rooms and throught the rest of the hotel.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Palm Desert, California", "Title": "“Nice Hotel... not quite 4 stars.”", "Author": "Bassman10", "ReviewID": "UR108384127", "Content": "Nice Hotel located conveniently close to the Toronto Pearson Airport. Easy access to downtown.", "Date": "May 15, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sault Ste. Marie, Ontario Canada", "Title": "“Don't get this location confused with the Pearson Onsite Hotel”", "Author": "Northerntraveller10", "ReviewID": "UR105157099", "Content": "Once we found this location after some confusion that it was not the onsite hotel, despite being called the airport hotel whos chain also has an onsite hotel, it was ok. Hard to get something to eat if arriving later in the evening. Service at the front desk was slow, especially since neither hotel could not seem to find our reservation once they did answer the phone, and did not really care. Finally upon taking a chance and going over to the offsite location, they suddenly found us in the system after a lot of time wasted. The hotel is ok, but off the beaten path. There are shuttles, but it is off aways. The rooms were good but overpriced in my opinion. You could do better elsewhere.", "Date": "April 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Pa", "Title": "“Great location-horrible room temperature”", "Author": "phillyphlyer40", "ReviewID": "UR105006799", "Content": "Had a recent stay at this former Renaissance/current Sheraton. Check-in was smooth and was upgraded to a junior suite as a Platinum member. Front desk agent was nice and welcoming. Club lounge offerings were a little sparse-much worse then when it was a Renaissance! The real issues were in the room.... This hotel has a system that allows only A/C OR heat to be turned on. Not both. Not at the same time! When I checked in it was 80degrees outside. My room thermostat said 84!!!! I called the front desk and asked for a manager. This is when she told me that it was only heat OR a/c, and that due to the fact that the next weekend (a full 6 days away) the temperatures were only going to be 40 degrees, the hotel would not take the time to switch the operation from heat to a/c as it was too costly! I requested to check out-but was told I would have to pay for the night. I then asked for a fan, and was told after her staff went to Walmart and if they had any fans, she would send one up to my room. IF they had one!!! I did request to speak to the GM, and was told that \"he does not need to be bothered by this issue-it is just the way the hotel is set up!\" Well-I went to my dinner meeting, and returned to my room to find a fan, and the thermostat still reading 82 at 1030PM. Sleep was not to be had that night. The next night I check out and was able to find a room at the Marriott that DID have a/c (and heat at the same time). I did talk to the GM and he assured me he would take care of the issues and was in fact going to turn the a/c on that day. For me-who travels 200+ nights a year it was too late.", "Date": "April 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Edmonton, Canada", "Title": "“It all works”", "Author": "2Travelersweare", "ReviewID": "UR104852265", "Content": "This is a copy of the email I sent the Hotel: Your front desk staff were awesome, i had to check in two separate times last week and each time your staff went beyond the usual to accommodate my request. Your wait staff in Olio were terrific on the evening I ate there. Attentive and cheerful. The food was also excellent, so good job by your Chef. Both rooms were clean and comfortable, I was disappointed that you still charge for internet service and would think it should be included in room rates now. Your fitness room was clean and equipment in good condition and all working. Plenty of towels and headphones. Job well done by your staff keeping this room up to par, it was full each time I visited so it does get used. Your meeting rooms were good, we were in Halliburton two days and it worked out very well for the number of attendees (10) we had. The food service was very good and the room temperature easy to control. Our last day in the Muskoka II room was however not as good. The temperature was up and down and attempts by your staff to fix were not successful. Service again was very good and the food excellent. Overall your hotel was very comfortable, your staff very attentive and professional, very clean in all areas and well kept. Job well done by Management to have such consistency thru out all these areas. We defiantly will see you again soon.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dubai", "Title": "“Good value - short distance from the airport”", "Author": "Roadwarrior1000", "ReviewID": "UR103238031", "Content": "I used to stay at the Marriott Toronto Airport, but their rates have gone up,the management has changed and a colleague told me the standards had gone down. So I tried the Sheraton Toronto Airport. What I found was friendly staff, a nice clean room and a decent breakfast in the morning. Whilst it is quite near the flight path of one of the runways, I was not disturbed by jet noise. My corporate rate was excellent so I considered it good value.", "Date": "April 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Halifax, Canada", "Title": "“Friendly Service & comfortable Rooms”", "Author": "Denise_Bradbury", "ReviewID": "UR99443235", "Content": "Our stay was fabulous and what really made it was the friendly and very efficient service we received from Orlando in the club level lounge. I was traveling with my friend and her two girls, aged 6 & 9, and he was so helpful, treating them like special guests during breakfast - they loved it. Everyone that we were in contact with, the front desk staff, director of sales & and restaurant associates, helped make the stay a success. The pool was great to have for the kids.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "toronto", "Title": "“CLEAN SOLID MODERN HOTEL. ( 4 out of 5 stars) though they gouge for parking and internet+glide path”", "Author": "quickread", "ReviewID": "UR97543306", "Content": "Hello, I stayed at the Sheraton hotel near Pearson Airport during New Year's Eve. In fact I have stayed AT BOTH Sheraton hotels near Toronto/Pearson airport from time to time and I prefer this one (located on 801 Dixon road in Toronto Ontario). The reason being its more modern and fresh/clean as opposed to the OTHER Sheraton (which is inside the terminal). The overall reasons why I prefer the Sheraton location on 801 Dixon road are the following PROS: Beautiful hotel Modern (<10 years old) construction Well appointed rooms/ lobby appointments. Free shuttle to Pearson terminal main floor has computer to surf web. (with some packages) Free slightly better than continental -continental breakfast. Free papers. CONS: Bathrooms although clean, and reasonable need slight modernization (we are in 2011). -No WIFI (although do have ethernet in room). -Ethernet in room costs 15/day -Parking cost 15/day -(this one stings me a bit- you are in a lot outside the airport, there is not reason to be charging anything at all-let alone 15). They need to seriously do something about that. - You are in the landing glide path of the runway, IE every so often a very scary zooming sound comes overhead to give you an example.... the landing gears can nearly touch the roof of the airport. -All in all still a very good stay would definitely come here again as any positive outweighs any negative.", "Date": "February 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "West Kelowna, Canada", "Title": "“Good place as an overnight transit stay.”", "Author": "letterdude", "ReviewID": "UR96998442", "Content": "We only had one night in this hotel, having an early flight out, in the morning. While I had hoped that it was a little closer to the airport, it wasn't a long shuttle ride. Check-in was pleasant and efficient. No time to check out pools, except to say it looked quite nice. The room was comfortable and clean. Nice bathroom and the bed was very good. Wifi was slow. Not much to look at, in the area. I noticed a couple of restaurants. The lounge bar was good. What can I say? It was pretty good for passing through!", "Date": "February 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“We book all our meetings here”", "Author": "poorlittlepostdoc", "ReviewID": "UR92800358", "Content": "As someone who is with a company that books a lot of meetings for groups of 10-50, I have had some very irritating experiences with conference bookings and hotel accommodations. I have never had any problems with the Sheraton Toronto Airport after 6 meetings there and in fact have requested that all my future meetings are held there when possible. The staff are friendly and efficient, the rooms are nice, there's free internet in the lobby and restaurant, their AV services are on-site, and the beds are so comfortable.", "Date": "January 13, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Clute, Texas", "Title": "“Not up to Sheraton standards”", "Author": "RogerG1960", "ReviewID": "UR91527456", "Content": "We were very disappointed with this hotel. We visited on December 26, 2010, a busy time for travel with families. Unbelievably, the pool was closed for painting; could this have been delayed a week or so to January? Also, we had to pay for internet and parking! The restaurant closed early on Dec. 26, so we had nothing to eat. Terrible service and poor value. We will not be back.", "Date": "January 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ottawa,On", "Title": "“Always a pleasure to stay at Sheraton”", "Author": "flyguy35", "ReviewID": "UR89964589", "Content": "My wife and I stayed here while en route to Las Vegas. Upon arriving, the front desk staff made us feel very welcomed. It was a busy night here as it seems there were a number of holiday parties taking place. There was no issue with noise at all. As we had a very early flight, we asked about getting a taxi to the airport but they assured us that the shuttle would get us there in plenty of time. True to their word, the shuttle was on time and got us to the terminal on time. Though our stay was very short, we would stay here again.", "Date": "December 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“This place rocks for the frequent biz traveller”", "Author": "Traveler-X99", "ReviewID": "UR89643689", "Content": "I stay here regularly when travelling to Toronto and working in the west end. There are 5 things that make this place stand out amongst the competition: 1. Location is great if you want to be near the airport 2. It's Starwood, world's best rewards program 3. Food at the hotel restaurant is far above your typical hotel restaurant quality. I'd eat there if it were a standalone restaurant 4. Staff are amazing! Orlando in the lounge with a smile every morning (and the wonderful lady who works in the evening whose name escapes me). Aneesha, Jodi-Ann, Saima and the rest of the front desk crew do everything they are allowed (and sometimes more) to make the frequent traveler feel at home. 5. Huge pool and solarium. Wonderful place to chill out.", "Date": "December 12, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Ottawa", "Title": "“Outstanding Customer Service”", "Author": "LynOttawa", "ReviewID": "UR85005867", "Content": "The superiority of customer service that is the culture of this hotel was evident shortly after arrival. After checking into my room and while waiting for the elevator, a maintenance man engaged me in delightful conversation, welcoming me to the hotel and requesting that if there was anything I needed to be sure and let them know. The courtesy provided to my husband by the reception staff when calling in to speak with me was so evident, he actually commented on this to me when I answered. The hotel is at the airport so of course the noise of airplanes will be evident. Ear plugs take care of that easily. The room was comfortable and all food provided during my conference was excellent. Thank you for a wonderful stay!", "Date": "October 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rome, Georgia", "Title": "“Amazing Service - Set the Standard for Above and Beyond”", "Author": "Wendyinrome", "ReviewID": "UR83547657", "Content": "Called to confirm reservation before plane flight, hours later I called to request shuttle, and Aneesa remembered me! Very helpful with a technical problem at check-in going out of her way to make me comfortable. Later when I was trying to navigate transportation to a business meeting, Ahmed took great care to make sure I knew the safest options. The kind of chivalry that makes a man look out for the safety of a woman traveling alone in an unfamiliar town should never die! Aneesa and Ahmed are shiny examples, but the entire staff seemed happy to be of service handling any questions with a smile and helpfulness that is too often lacking. This outstanding customer service compliments the lovely facility. The bed was so comfortable, and I am a big fan of fluffy pillows - lots of them. Job well done!!!", "Date": "October 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ottawa, Ontario", "Title": "“Solid Sheraton”", "Author": "sens1992", "ReviewID": "UR83030075", "Content": "This is a fantastic property. Service at check-in was prompt and friendly. The hotel is close to the airport, almost off the 401 and next to TTC route 58 which makes convenient for trips to downtown Toronto. The room was large and had great furniture. It was very clean and very comfortable. We ordered room service and the food was great (so was service). This hotel has a huge pool, one of the biggest I have seen for a hotel!!! This is a place where you can expect great value at a great price. I highly recommend the Sheraton Toronto Airport Hotel & Conference Centre. We will be back for sure!", "Date": "October 11, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "", "Title": "“Won't Be back”", "Author": "edinbc", "ReviewID": "UR81508074", "Content": "My reservation said \"Sheraton Toronto Airport Hotel\" so we arrived at the Sheraton IN the airport (terminal 3) to be told no reservation existed. Were we sure our reservation was at the Sheraton Gateway? Sheraton \"Gateway\"? Also, be aware that according to the front desk at the hotel, Sheraton reservations are not linked so they cannot check on a reservation number. The airport hotel is \"across the street\". So, across the street we go to the Sheraton \"Airport\" according to the sign in front. In come the bags, but alas no reservation here either. Oh, we want the Sheraton \"Toronto Airport\" not 4 Points Sheraton Toronto Airport! So bags back in car and now to the furthest Sheraton from the airport which is the Sheraton Toronto Airport. This is an older building and while the lobby appears to have been updated not much else is. The \"Manager\" who checked us in couldn't get his computer to work through 2 reboots (not an uncommon problem). The room was clean but certainly not 4 star material. Adequate would best describe it. And the planes were taking off over us until late that night. Bathroom is small and dated although the water preesure was good. In the evening we requested that we be able to leave our bags at the Sheraton in the aiport for the following day as we had a late afternoon flight. My wife waited at the front deak while they tried to contact the other property for permission. After about 30 mins they said they would contact our room with the outcome. At 10:00 pm my wife went back down and the bellman - grudgingly - called the Gateway again to gain permission. Overall, there are a lot better places to stay around the airport, at the same price, that truly are 4 star.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ottawa", "Title": "“very nice hotel”", "Author": "supermariuzzo", "ReviewID": "UR77738435", "Content": "everything was perfect, except the surprise of the parking, they charge you 15$ a night and you are not even close to downtown....i found this ridiculous....because it was one of the reason why we booked this hotel....otherwise the pool was very big and nice spa too.....service excellent....you allowed of free wifi in he lobby but not in your room....another stupid thing!!!! overall....clean and good service", "Date": "August 31, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "san jose, ca", "Title": "“Front desk staff did not do justice to the Sheraton Brand”", "Author": "thebee007", "ReviewID": "UR75541618", "Content": "The hotel (and room) ambience is very representative of Sheraton. The convenience to get their from the airport is A+. However, the front desk staff, though quite professional, were quite cold and bordering on rude. There were no water bottles in our room. When we called, we were told to get some from a vending machine downstairs. We had traveled in from US and had not converrted to Canadian $ just yet. We had to stand back in the long check-in-line just to get a few coins to operate the vending machine. LOUSY CUSTOMER SERVICE. Did not live up to the Sheraton brand name.", "Date": "August 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "1"}, "AuthorLocation": "UK", "Title": "“hotel is good quality - the flight path is noisy”", "Author": "TRAXUK", "ReviewID": "UR71105270", "Content": "when the planes start taking off about 5:30 to 6am that is the end of your nights sleep! it is literally at the end of the runway and I think all planes fly over it when landing or taking off. The hotel is good - not the best, the staff are very helpful though.", "Date": "July 16, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Vancouver Island, Canada", "Title": "“Service Lacking”", "Author": "hotel_goddess0", "ReviewID": "UR70381653", "Content": "This hotel was ok, however it could have been great if the service was on. I asked for assistance with accessing the internet and you would have thought I asked someone to teach me how to fly a Boeing 747! When our room was made up, no towels were replenished and the maids were stingy with restocking room and bathroom amenities. Don't waste your time, stay downtown and take the time to make the extra commute.", "Date": "July 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Comfortable and Accomodating”", "Author": "trip123067", "ReviewID": "UR68590662", "Content": "Great place to stay, rooms are comfortable and spacious, nice decor. Large lobby area with lots of marble. Restaurant and lounge are very classy and relaxing. The exercise room is ample with good selection of cardio machines and free weights. Really cool large round swimming pool with hot tub. Staff are very helpful and friendly, Sales Manager went out of her way to assist us with some important arrangements. Would definitely return when back in town.", "Date": "June 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent Service”", "Author": "csawkins", "ReviewID": "UR67787725", "Content": "As a business traveler I stay in many hotels. What is so different for me about this Sheraton is the Staff. Everyone is so happy, helpful and nothing is ever to much to do for you. One of the staff after hearing about my cat at home being lost asked every day if she was back and then brought me some cat food to take home. The level of service is excellent, from the check in staff to the maids who clean the rooms. The food from room service is good and always arrives quickly and hot. The bedrooms are clean and bright and look to have been updated in the last year. The internet service is fast and always works. To be honnest I cannot say a bad word about the hotel, the staff or the service.", "Date": "June 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Hamilton,On", "Title": "“Clean, courteous and no frills”", "Author": "elcycad", "ReviewID": "UR67732621", "Content": "Stayed with my family due to a model graduation. Rooms were compact, clean. Service was efficient, courteous and one of the staff members even took me on a tour of the rooms where the events were to take place the next day. The front desk was efficient in sending us extra towels and complimentary toothpaste. My only drawbacks were parking at $15.00, no free Wi-Fi and there was no fridge or microwave in the room.", "Date": "June 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "here", "Title": "“Nice, and don't confuse it with the Sheraton GATEWAY..IN THE AIRPORT!”", "Author": "SuNnFun_9", "ReviewID": "UR67631606", "Content": "Some people here are confusing the Sheraton Toronto Airport Hotel with the Sheraton GATEWAY Toronto which is actually LOCATED LITERALLY IN THE AIRPORT. Totally different place, get it straight. The Sheraton Toronto Airport Hotel & Conference Centre is NOT IN the airport, it's about 3 miles from the airport, with a nice free shuttle.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Had a great time here.”", "Author": "JeeX0X0", "ReviewID": "UR66468158", "Content": "I stayed at this hotel for a singing/acting/modeling convention and the people at the front desk were amazing! The minute I told them I didn't like elevators, they offered a room on the first floor. The hotel in all is very clean the only thing was I felt the bathrooms were a bit less clean. The corridors and lobby are great and very presentable. The only thing that may be a problem is that each time a plane passes... sometimes it's every half hour, sometimes it's every two minutes... you hear it loud and clear since the airport is right next to the hotel. I didn't mind this I actually miss that sound now! All in all I really enjoyed my stay in this hotel!", "Date": "June 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Service Par Excellence”", "Author": "frequenttvlrChicago", "ReviewID": "UR65844055", "Content": "I travel so often for work that sometimes I take for granted the hotels I'm at and treat them all the same....today, I chose to stop! Every check-in and every bed looks the same to me when you travel so much and I've never stopped to check out but on this day, I did. My morning wasn't going so well and I guess it showed all over my face. I forgot the copy of my bill in my room so it prompted me to stop by the desk to get another one. I was greeted by the agent, asked how my stay was and I simply said fine. Beside the agent stood her manager who probably read the distraught look on my face and asked me if everything was ok and if there was anything I needed. My morning was so bad that I couldn't find a $5 bill to buy a coffee....I didn't even tell her that but she may have seen me turn and look at the bar....she smiled and said to me....\"can I buy you a coffee to start off your day?\"....how did she know? she took me over to the bar and got me the biggest cup there was with exactly what I wanted then walked me back to the door and said \"I hope the rest of your day goes well....\" and guess what....it did! It's little touches like these that made me think about that day that make this hotel and its staff so special....they are amazing and you should experience it...first hand!....I will certainly go back!", "Date": "May 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Making my travel challenges seem non existant”", "Author": "jumbo145", "ReviewID": "UR64539165", "Content": "A big \"great job done\" by the entire staff at this hotel, special callouts for Anecsa, Marco, Val and Orlando. This team makes you feel welcome and they do everything they can to be sure your stay is enjoyable--", "Date": "May 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Incredible, caring staff and clean hotel”", "Author": "stevenkUsa", "ReviewID": "UR60249948", "Content": "a wonderful team of people. they went out of there way to make a pleasent experinece", "Date": "April 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kitchener,ON", "Title": "“Great Stay, surprisingly quiet...being near the airport”", "Author": "gregnkw", "ReviewID": "UR59424117", "Content": "Great location to my meetings, very quiet considering it's near Pearson and a runway!! Great room, well laid out, comfy beds. I'd stay again ! Only downfall, the TV was old and the colour was gone. Thankfully I had my laptop and broght movies. Ton's of nearby food places too !", "Date": "March 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Saskatchewan", "Title": "“Good choice near Toronto airport”", "Author": "voyageur08", "ReviewID": "UR53173539", "Content": "I have stayed here a couple of times and my most recent stay, overnighting between flights, was fine. The staff is friendly and efficient and my room was a good size, attractive and quiet. Good beds and nice linens with all the Sheraton amenities you'd expect and some nice touches like clock radios with ipod ports. My only complaint is that I was told the airport shuttle ran every 25 minutes. I was there 10 minutes before the time it was supposed to arrive and ended up standing in the cold for almost 40 minutes before the van finally came.", "Date": "January 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "York, United Kingdom", "Title": "“Very convenient and nice large rooms”", "Author": "neilyork", "ReviewID": "UR48133506", "Content": "My friend and I travelled to Toronto on a city break in October 2009 and decided to stay here for the first night upon arrival as our flight landed late. We paid $200 CAD for a twin room and I can honestly say it was the biggest twin I have ever stayed in with two very large double beds and nicely fitted out too. We used the automated system to check in which worked first time. We didn't use any of the hotel facilities as we had eaten on the plane and it was late when we arrived. The only thing that lets this hotel down (in my opinion) is the fees for Internet usage. Some hotels offer it free these days - why can't they all do this? Overall though, a nice hotel and one that I would definitely return to.", "Date": "October 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "St. Petersburg, FL, USA", "Title": "“2nd best customer service ever in 20 plus years of travelling”", "Author": "fl2006", "ReviewID": "UR39802853", "Content": "As previously stated- recently converted from a Renaissance. I arrived late one evening and the doorman read my name off the luggage tag and called the front desk. Approaching the front desk I was greeted by name, told I had been upgraded and that the concierge lounge was still open, but they would call up and make sure that there was food for me. Orlando in the Concierge lounge greeted me by name and on learning that I liked hard boiled eggs for breakfast, offered to special order them for me (complimentary). I had my hands full with 2 plates of (free) food to take back to the room and he offered to carry them for me. Food was excellent - usual hors doeuvres, but much better selection and higher quality than most hotels. I hope that this is maintained The next day I had some requests re dry cleaning which were promptly accomadated and the Front Office Manager offered to store some items for me over the holiday weekend - I had canceled a reservation at the Sheraton in airport hotel and am returning next week. Room quality/ bed were fine - what makes this hotel different is the staff. The only facility that I used was the Gym - only 1 elliptical (High end Lifestyle 95xi) and no exercise ball - otherwise basic but fine. Shuttle to the airport was on time and 5-10 mins depending on terminal. Interestingly this property is slightly more expensive than the in-airport Sheraton where I have stayed 15+ times, and would have stayed again but they have significantly cut back on the concierge lounge.", "Date": "September 4, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Ontario", "Title": "“Arrogance & Short Fused !!!!”", "Author": "clatteria", "ReviewID": "UR32930792", "Content": "Just a quick note to warn you off the staff here and the way these people treat clients and CHILDREN !!! We were there for a hockey tournament this weekend and we were standing in the hall way having a few drinks, and being very respectable and considerate to others who were on the floor. One of the suit guys and be warned this guy has no mannerism or class whatsoever..his name KELBI ....kept coming upstairs accusing us that we were making noise....we ordered food and it supposedly smelled..having siad that I don't know how pizza could smell bad as well as the wings, but anyhow like I said we were very respectfull and this guy (KELBI) was on a power trip. We have stayed in many hotels with our hockey team and never had any issue whatsoever, so I don't know why KELBI and his staff were so arrogant towards us. I told him I would be writing a review and he said go right ahead just to show you his arrogance. So I am going through with it. People beware, this is not a good place if you are travelling with small children,a s they do not seem to like kids at this location. You don't have to take my word for it, so go ahead and see for yourselves. Thank you for reading.", "Date": "June 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Canada", "Title": "“Good Place to Stay - Excellent Service”", "Author": "CanadaTraveller44", "ReviewID": "UR32149311", "Content": "My client books an annual Executive Retreat and it's been held here for the past two years. Nice hotel - the banquet staff can't do enough for you and the Supervisors check in at least once a day. We actually asked them to reconfigure the room on short notice and they had staff there in minutes to do it.. no questions asked. The hotel rooms are nice and clean and there is a good lounge in the lobby. My only suggestion for improvement is around the restaurant. It is an award winning restaurant and the food is tremendous, but fancy and heavy. It would be good if they had some simpler menu items for lunch or a light dinner. Having said that I had steak one night and an amazing lobster pasta the next. There is also a handful of restaurants within walking distance, but not always possible when you are in meetings all day. Other than that very small suggestion, I think they are doing a great job!", "Date": "June 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Caguas, Puerto Rico", "Title": "“OMG!!!”", "Author": "inalu2", "ReviewID": "UR28828787", "Content": "Super modern hotel. Rooms are cozy, modern and clean. We stay in room 748 and the view was awesome. The newspaper are complimentary every morning. Good location and close to airport.", "Date": "April 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Clean, Comfortable, Felt like home:)”", "Author": "lilTinyTraveler", "ReviewID": "UR26061189", "Content": "I recently stayed at the renaissance for a sporting event. To tell you the truth i actually cant remember how the service was so i guess that means it was alright. I do however remember how beautiful the rooms were. The beds were very comfy and the room just felt so relaxing and warm. I had a friend drive me to local restaurants and a near by shopping center. The location was great, close to where i needed to be and just off of the highway! I will stay here again next year!", "Date": "March 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, NSW", "Title": "“Very convenient to YYZ”", "Author": "housekeeping30", "ReviewID": "UR19253076", "Content": "Stayed recently before a morning flight. Stayed on the club level and room was nice with great king bed and good size bathroom and amenities. There was a good selction of pay per view movies if you wanted. Very close to YYZ terminals with fairly regualr shuttle service. I stayed on the weekend so the lounge was closed however at check in offered vouchers for evening canapes and breakfast at the main hotel restaurant. I took breakfast which was a good selection (not great) of items. As others have mentioned planes very close but no noise was heard in the rooms. The pool looked nice but was closed on my stay. Staff I encountered all very pleasant. The only real drawback was staying guests had to pay $15 per night to park, this is pretty tacky I think. I had a car rental so ended up returning the car a night early to airport and getting the shuttle back and again the shuttle to the airport the following morning-this takes away from a excellent stay.", "Date": "August 22, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Toronto", "Title": "“I missed the Marriott Revive bedding”", "Author": "MunnyMan", "ReviewID": "UR19087628", "Content": "As we arrived to check in, we hadnâ€™t realized the Renaissance was right under the airport flight path. Planes were so close we could almost count the bolts. Surprisingly, inside we couldnâ€™t hear the planes landing about 1 a minute â€¦ even in the room, the only sound we heard was when the planes landed and reversed their engines to brake. But even that wasnâ€™t loud enough to cause you any loss of sleep or make you turn up the TV. It was quite amazing how soundproof it was compared to outside when we took our pooch for a walk (yes, the Renaissance is pet-friendly and thatâ€™s why we chose it). The dog shook like it was a thunderstorm outside but didnâ€™t hear it inside at all. There are grassy areas to walk your best friends. The room was a nice size, but I couldnâ€™t get the â€˜motel feelâ€™ out of my mind. It was a little underfurnished and could have used another sitting chair or loveseat (sofabed). The desk chair was broken (caster) and fabric worn. TV movies were $14 -- but an old CRT TV. The lobby and sitting areas were very nice and not like youâ€™d find in a motel. We got a special weekend room rate of $118 that included the $15 for parking, breakfast (buffet) for two, and a $100 bonus bucks Marriott certificate to be used on a 2 night stay at another Marriott. Seemed like a good deal to me. We had room service for dinner and ordered a 8oz hamburger that was just OK, a 10oz NY steak that was OK, and kidâ€™s spaghetti for the dog who loved it. Was a little put off that the little mustard jar supplied had been half used, and made me feel uncomfortable about the cleanliness of the room service. The king bed was not a Revive bed that Marriott has made famous. It was very hard and had no featherbed topping to soften it. The 3 pillows were not feathers and also very hard. Also discovered in the morning that the drapes were not room darkening â€“ we were up earlier than expected for a Sunday. The bathroom was perhaps the smallest Iâ€™ve ever seen â€“ smaller than European hotelsâ€¦it had a tiny tub with shower, not separates. While it was a good deal financially, because of the opened and used mustard jar with room service and not having Revive bedding, weâ€™ll go to the nearby Marriott full service hotel down the street next time.", "Date": "August 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Frederick, Maryland", "Title": "“Close to the airport . . too close.”", "Author": "gburg2000", "ReviewID": "UR18022551", "Content": "This is a standard Renaissance hotel, with the quality you would come to expect from the name and brand. The one disconcerting element is that planes on approach to the airport fly about twenty feet over the roof of the hotel. It's not really all that noisy inside, just odd.", "Date": "July 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Ottawa, Ontario", "Title": "“Solid, Clean, Oustanding”", "Author": "sens1992", "ReviewID": "UR17836714", "Content": "Stayed for one night. Property is very clean and modern. Very nice lobby with clean hallways and clean rooms. The furniture is also very nice. Ordered room service twice and food was good and delivery was fast. The pool is huge and under a glass dome which makes it unique. I really enjoyed it. I defenetly will return to that hotel.", "Date": "July 13, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Seattle, Washington", "Title": "“Solid value”", "Author": "CaptainBristol", "ReviewID": "UR14091557", "Content": "We stayed here one night only and thought the place was a good value. I bid $57 (US) for the room on Priceline. With taxes and fees the price came to $72.50. We arrived at 10:30 p.m. and were hungry. Fortunately, the bar was still serving food (they do do until 11). Our late night snack of delicious soup with a combined side of hummus and baba ganoush was a real treat. The house Chilean cabernet sauvignon was quite tasty, too. I understand from other travelers the main meals at the restaurant are real standouts. We had a delicious breakfast the next morning before checking out. Our room was spacious but I thought the mattress was acceptable, but not very good. In-room coffee making setup had upscale coffee but then ruined the effect with Coffee Mate instead of real dairy product. Yuck! Bath amenities were good, though. We liked the lemongrass scents. The neighborhood was typical airport soullessness: cars, parking lots, pavement, chain restaurants and other chain hotels. In sum I think this place was a solid three star establishment with a fine restaurant in the mix. I wouldn't call it a four star hotel, though.", "Date": "March 6, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Kanata, ON", "Title": "“An outstanding airport hotel.”", "Author": "reclermo", "ReviewID": "UR12474817", "Content": "I really enjoyed my extended stay at the Renaissance Toronto Airport hotel. I reserved three rooms for multiple days and had a chance to check out all the different rooms. Each was consistent, very clean and very modern. Check in was friendly and we had no problems finding the hotel. I assume there is a shuttle service to the airport; however, we ended up driving and parking in the hotel's outdoor lot. With respect to parking, the Renaissance charges far too much to park in this area of the city. They are charging downtown Toronto rates in the suburbs which I find outrageous. I have no problem paying high rates in a central location but an airport hotel should have rates of $12 (or less) per day. Everything else about the hotel was great, and we were able to use the hotel's closeness to the 427 and 401 highways to visit tourist sites in Toronto during our stay. The drive to downtown Toronto takes about 20 minutes depending on the traffic. There is a restaurant and bar in the hotel but we only used the bar in the evening. The hotel bar is very nice with a modern design thoughout. Usually airport hotel bars are a real drag, but we had a great time! There is also an Outback Steakhouse and Montana's restaurant on either side of the hotel, so you should have no problem finding a good place to grab some food. I would recommend a stay at the Renaissance and would stay again in the future.", "Date": "January 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Great hotel”", "Author": "ABtraveller", "ReviewID": "UR12167234", "Content": "Stayed one night at this hotel which was a Hotwire 4star booking. Very impressed. Entrance and lobby - modern and spacious - are an indication of the entire hotel. Staff are welcoming and helpful. Room is spacious - except for the bathroom and closet. However, the bathroom has been renovated; they've made the most of it. My king bed room was not overwhelmed by the bed; there were 2 upholstered chairs - one with ottoman. Nice size desk. New windows that have a slot for fresh air. Everything about the room seemed new and upbeat, including the comforter and carpet. Planes fly directly overhead. However, the noise wasn't that bad. Certainly wasn't disruptive. I should have put my don't disturb sign out - I had a houskeeping knock at 8am. The 24 hour fitness room has all new equipment. The pool is open 6am-11pm. It has a glass dome, and is mostly deeper water. There was a whirlpool out of service. The nice thing - everything is clean and freshly painted. Business centre has 2 PC's and another spot to plug in your laptop. All free - and you can even use the printer. The is a convenience/gift shop onsite. I found the hotel a nice change from the Sheraton Gateway - which seems lifeless in comparison. Free airport shuttle runs every 30 mins. Olio Mediterrean Grill is onsite. On the sides of the hotel are Outback Steakhouse and Montana's Cookhouse. Across and over are Boston Pizza, Tuckers Marketplace (buffet; I will not return) and Tona Roma's. Two more restaurants are under construction, including a Jack Astor Bar & Grill. If you walk for about 15 minutes east (on the Hwy 27 Dixon Rd overpass), you'll be at Tim Horton's, Swiss Chalet, Milestones, Harvey's, and a convenience store. Those are all across from the Doubletree International Plaza Hotel.", "Date": "December 31, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Excellent service and comfortable rooms”", "Author": "bitride", "ReviewID": "UR11983782", "Content": "Booked through Hotwire, this was very good value. Stayed 3 nights on this trip. Would stay there again. The lobby and check-in staff were both nice. Elevators are quick. The room was nice overall and clean. The windows were large and had slots that could be opened for fresh air if desired. The closet could use improvement, it's small and the door not easy to open, but I didn't really need it, the hutch drawers were enough. The desk was a good height and size, and the high speed internet was good. Two comfortable chairs provided a place to sit down. The format of having the TV face the bed is awkward, even with the sliding/angling TV mount. There's a nice restaurant on-site for meals, but there's also lots of chain restaurants within a kilometer or two for variety and ease on the wallet. Parking was $14 per day, but at least there's no in-out restrictions. The staff were all polite, and go above and beyond if there's any problems. There was some plane noise as one of the runways has them coming directly overhead for landing, but I found it easily ignored, and not noticeable at night.", "Date": "December 27, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "ann arbor, mi", "Title": "“Enjoyed it”", "Author": "michiganonthego", "ReviewID": "UR11077905", "Content": "Stayed at this hotel for one night last weekend. The hotel is extremely clean, very new, the staff were great, and there were great amenities in the hotel. The downsides - you can hear a fair amount of airplace noise (from airplanes flying overhead) even while you're in your room, and the bathroom was pretty small. The closet is also very small. Other than that, this was a great place to stay. It's very accessible from the 401.", "Date": "November 26, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kitchener, Canada", "Title": "“Great Airport Hotel!”", "Author": "jayneoliz", "ReviewID": "UR10513574", "Content": "If you want to see the city, it costs more but is worth it to stay downtown. If you're looking for an airport hotel, this is a good choice. Everything about this hotel was pleasent, comfortable and gracious. The restaurant was unusually good, the decor was updated, the beds were very comfortable and the bathroom ammenities were lovely. The only thing I could say that would come close to being a complaint is that the bathroom itself could have been more interestingly decorated. The free shuttle to the airport and park-n-fly rate were very convenient and cost-effective.", "Date": "November 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“Great stay”", "Author": "savystayer", "ReviewID": "UR10022743", "Content": "My first time in an airport hotel and i was suprised. Very spacious rooms, great facilities ( including a laundry room - much cheaper than hotel service laundry ! ) Very close to airport in decent area.", "Date": "September 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Virginia", "Title": "“Excellent Airport Stay”", "Author": "goffsteve", "ReviewID": "UR8511008", "Content": "If you're going to spend time in Toronto, you're going to want to stay downtown. But if you have to stay near the airport, this is a great choice. Five-minute shuttle ride to and from the terminal, excellent restaurant, nice modern rooms, friendly staff, easy parking, adequate restaurants nearby, indoor pool, conference center. For an airport hotel, this place stands out. I stayed for $105 (US) on a weekend.", "Date": "August 26, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Edmonton, Alberta", "Title": "“Best bet airport hotel”", "Author": "PogoJ", "ReviewID": "UR8224187", "Content": "I stayed at this hotel in both June and July 2007. It is a great all 'round hotel if you need to be near the Toronto Intl Airport. Good rooms and common areas, excellent meeting/conference facilities, terrific food and a very modern menu, excellent food services for meetings, and generally great staff. The Sheraton is best if you want to be really close to the Airport -- it's just a short ride on the monorial from Terminal 1 and connected to Terminal 3 -- but if you don't need to be that close, the Renaissance is your best alternative.", "Date": "July 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Halton Hills, Canada", "Title": "“Great hotel, location”", "Author": "thenay84", "ReviewID": "UR7270988", "Content": "This hotel is one of my favourites, and is in a good location as well. The only downfall to this hotel is the $14CAD parking fee per night, however this is expected considering it's near the airport. The noise from the planes flying above you will hardly notice if at all. The pool is great too, and is deep unlike many pools at hotels. I believe it was 8-9ft deep! The gym was nice, not too big however but was clean and had new machines to work out with.", "Date": "April 2, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Belgium", "Title": "“Good, but nothing more”", "Author": "A-Postel", "ReviewID": "UR7269622", "Content": "I frequently travel to Toronto and this was my first time in the Renaissance. It's a good hotel, but I will go with Sheraton again, despite the price difference, because off the different and more vivant ambiance there. Service is ok, room big enough. Couldn't always get into business lounge though, despite the fact that I booked a room on the club level.", "Date": "April 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "uk", "Title": "“Absolutely the Best Airport Hotel”", "Author": "mentaltraveller", "ReviewID": "UR6831843", "Content": "Stayed here in January and February, and have now booked three more stays later this year. I'm so glad I stopped staying at the Sheraton! The Renaissance is welcoming, well organized, friendly, helpful--and the food--buffet breakfast and tapas in the restaurant--is superb! Fresh, original, healthy, hot, delicious. The decor is relaxing and intriguing. The rooms are large, clean, well appointed--and restful. I was concerned about the hotel shuttle--whether that extra trip from the airport would be just too much after a long flight and with tons of luggage (5 suitcases)--but it is great. Easy enough. To date, hotel shuttle is very reliable and very regular. It is no extra burden than having to take the sky train or inner aiport terminal shuttle to the Sheraton Gateway in Terminal 3. And you get a much better experience when you arrive at the Renaissance--excellent and prompt check-in staff. And valets on check out actually know something about luggage and transport! No struggle or drama. A great Toronto hotel, not just a great airport hotel.", "Date": "February 23, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Ottawa", "Title": "“Wonderfull hotel!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5424006", "Content": "We were there for 3 nights and absolutely loved it! The staffs were very friendly and helpfull. This hotel has a modern decor, nice and bright. The room is quite roomy, lot of storage space. Our room and all public area were very well kept. We at first were concern with the air trafic but once you're in the room, it's not very noticeable. The only problem we had were coffe supplies were not replenish daily. We also asked for some extra bath towers but never get them. For that I give it a 4 instead of a 5 star rating. Will definitelly stay there again if we come to Toronto.", "Date": "July 4, 2006"}], "HotelInfo": {"Name": "Sheraton Toronto Airport Hotel & Conference Centre", "HotelURL": "/ShowUserReviews-g155019-d184506-Reviews-Sheraton_Toronto_Airport_Hotel_Conference_Centre-Toronto_Ontario.html", "Price": "$144 - $246*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">801 Dixon Road</span>, <span class=\"locality\"><span property=\"v:locality\">Toronto</span>, <span property=\"v:region\">Ontario</span> <span property=\"v:postal-code\">M9W 1J5</span></span>, <span class=\"country-name\" property=\"v:country-name\">Canada</span> (Formerly Renaissance)</span> </span> </address>", "HotelID": "184506", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/5b/a2/35/sheraton-toronto-airport.jpg"}}