{"Reviews": [{"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Bellevue, Washington", "Title": "“This hotel sucks.”", "Author": "Eric2820", "ReviewID": "UR114629327", "Content": "This is the last time I will stay at this hotel. Smoking room.. The chair in the room is filthy. The hall way smells. The room smells. The service is poor. This hotel cater to local Mexicans more.. If you like the smells.. this is for you then.", "Date": "June 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Back to basics...”", "Author": "062211d", "ReviewID": "UR96129122", "Content": "We stayed at this hotel for only a few nights after arriving in Mexico City. The atmosphere is very friendly and the staff is helpful. The rooms are quite large, with all basic requirements. There is no mini safe, but then again it is not an area were many people walk around and the escalators require a key card to access the floors. The bed was ok though nothing special. The inside decoration of the rooms had no frills and the windows very extremely dirty from the outside. The restaurant was good, with a variety of foods, which were always cooked on the day (as far as we could tell). The television is always on there, and always on maximum volume. Be prepared to bring earplugs to eat there. The breakfast was also very good, with a large number of choices. Only that on bank holidays, the buffet is closed. We can recommend a fantastic Argentinean steak house down the road, about 5-10mins walk. Just leave the hotel and turn right, follow the road. It is about the only posh place around in the midst of all the small work shops. Amazing meat! Anyways, I also like about this hotel that there were some attention to detail: the business centre has free coffee, water, and cookies available. Well, this is not a five star hotel, and I wouldn't know what stars to give to this hotel. One star is being generous. However, it is not a bad place to be. You are undisturbed, it is fairly quiet, and has easy access from and to the airport. Most guests are business travelers or are staying at the hotel with their mistresses. All in all, it was a positive experience staying there!", "Date": "February 10, 2011"}], "HotelInfo": {"Name": "Fiesta Inn Naucalpan", "HotelURL": "/ShowUserReviews-g150800-d185397-Reviews-Fiesta_Inn_Naucalpan-Mexico_City_Central_Mexico_and_Gulf_Coast.html", "Price": "$86 - $110*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Periferico Norte Esq. con Gustavo Baz</span> | <span class=\"extended-address\">Industrial Alce Blanco</span>, <span class=\"locality\"><span property=\"v:locality\">Mexico City</span> <span property=\"v:postal-code\">53370</span></span>, <span class=\"country-name\" property=\"v:country-name\">Mexico</span> </span> </span> </address>", "HotelID": "185397", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/80/26/8026fee91b8ab29a534469f8c0def22d8large.jpg"}}