{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vancouver Island, Canada", "Title": "“The Rosedale could be rosier”", "Author": "natshats", "ReviewID": "UR128307960", "Content": "This hotel offers great front desk help and always offers a fresh and delicious continental breakfast. The rooms are however getting old: the beds are short and hard and need better sheets and blankets. The rooms are very clean but the bathrooms quite tight and at times short of water pressure. Although not a 5 rating, our family always chooses the Rosedale because of the convenience to places including restaurants and shopping. One can choose to cook because each suite is carefully contained with cooking essentials including an oven. It doesn't include pots and pans but hey, you are on a holiday! Each day fresh towels and kitchen towels are replaced and light cleaning is performed. You really can't beat the Rosedale when staying downtown Vancouver.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Banff, Canada", "Title": "“Like a mini home abroad.”", "Author": "Wynona L", "ReviewID": "UR127489623", "Content": "The hotel is centrally located in Downtown Vancouver so public transport, tourist attractions, ATMs, and restaurants all within walking distance. This is also useful if you're embarking on a day tour, as bus drivers/ tour directors can easily find the hotel to pick you up or drop you off. Upon arriving, we were greeting by a smiling bellman who led us past the concierge to reception. If you need anything, from a map of Vancouver to hockey tickets, the concierge is the person to see. With their can-do attitude, and efficient service, it's like having a tourist information centre right there in the hotel. There are also public computers with internet access (which can be purchased from reception), and various tourist information brochures available. Checking in at reception was quick and easy, and we were soon in the elevator on the way to our room. Our room was clean and tidy, and had all be basic amenities to make it feel as if we had our own apartment. There was a kitchenette complete with basic cutlery and crockery, a phone and TV in both the living room and bedroom, and separate air conditioning units for both these rooms. Housekeeping is quick, efficient, and unobtrusive; our room was cleaned in the time it took us to have breakfast (which is also included in the price of the stay). There is also a pub called Rosie's on Robson which provides room service to the hotel until 10pm. For the cost of an average pub meal, you get filling, good tasting food in the comfort of your hotel room. Once again, the staff is friendly, and all transactions are smooth.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Everett", "Title": "“Great 3-Day Birthday Celebration!”", "Author": "AbiznessDigital_16", "ReviewID": "UR127214059", "Content": "My husband & I are timeshare owners with VI and they own several units in this building. We choose it initially because of the location - within 4 hours of our home. After considering the cost of gas & parking, we decided to take Amtrak. (There are multiple departures from the Seattle-area.) We caught the Sky Train one stop and then it was an 8 minute walk to Robson & Hamilton. Our room was on the 15th floor & we had a grand view of the city. Much of what we did was walking distance - taking the ferry to Granville Island, walking to/from Stanley park, Gas Town, eating, Sky Train, etc. Staff were helpful suggesting several places to eat. Rooms were clean & utilitarian (ours had a kitchenette & small dining area). There was a bit of street noise but nothing atrocious. We even used the Steam & Dry Sauna every day of our stay. We'll definitely be coming back again!", "Date": "April 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver Island, Canada", "Title": "“On my #1 list to stay with when in Vancouver”", "Author": "pajim20", "ReviewID": "UR127128959", "Content": "Been coming to this hotel for years and yes had 1 issue in the many years we have stayed here..But Managment looked after it right away .We stay at Rosedale on Robson ..for several reasons; Close to Rogers,B.C. Place and uptown.. Front Desk is great helpfull and has all the answers Rooms great big and views in every room...(never stayed close to the top but view must Be great) where do you get a room w kitchen and lounge room w hide abed @ Rosedale on Robson The pud was great food excellant and price where really good all and all everything was great. a slight wait for elevators but hey Canucks game full hotel hey Just gave me a moment to talk to other guest about the game We did not get to go for a swim so we can not rate the pool area. But I would like to say I have been a employee in the hotel motel industry for 27 years and Jim my hats off to the front desk staff and you .. very impressed.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Don't waste your money!”", "Author": "VanIsleReview", "ReviewID": "UR126810226", "Content": "This hotel looks nice on line, but don't be fooled. It is dated and dirty. The Staff even said that other guests had issues with the stained carpets, dirty dishes, general uncleanliness and dated decor. This hotel is an embarrassment to Avia West. It is shocking that they are affiliated with such a disgusting hotel. We would never stay here again.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "sydney", "Title": "“excellent location”", "Author": "microdotty", "ReviewID": "UR126806262", "Content": "This hotel is in central Vancouver, we had two queen beds, with plenty of room for luggage and to spread out. The bathroom we well appointed and clean. We had a lounge room with a kitchen. The staff were excellent with a information section downstairs. There was a supermarket on the corner, McDonalds, pharmacy, coffe place and take away and eat in restaurants close by. A restaurant in the hotel had a great menu. It also has laundry machine and dryers every second floor. We stayed here twice and recommend to everyone.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Good hotel for down town Vancouver”", "Author": "Carlystar", "ReviewID": "UR126081393", "Content": "Good hotel in down town Vancouver. The room we stayed in was a 2 bedroom with lounge area and kitchen which included a coffee machine. The room was very clean and the hotel had a bar down stairs with breakfast and drinks till late, which provided free wifi for use. The bed was a bit hard for my liking. The hotel was in a great location to go to the Canucks game as the stadium was within walking distance. It was also close to Granville st and shops along robson avenue but not right in the middle to get the noise..", "Date": "March 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Perth", "Title": "“Enjoyable stay. Great for business as I was or pleasure.”", "Author": "KarlosPerth", "ReviewID": "UR126004962", "Content": "Great value. Great room and good location. Will stay again", "Date": "March 12, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Bristol", "Title": "“Spacious and comfortable”", "Author": "Matthew44", "ReviewID": "UR125739291", "Content": "Excellent location within easy walking distance of the centre of the city. We had a good studio here with plenty of space, two TVs, fridge & cooking facilities. Good heating, and we can open the window for fresh air (I'm not a fan of air-conditioning!) Very comfortable.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“Price, size, location trumps decor”", "Author": "valu8or", "ReviewID": "UR125484199", "Content": "Chose this hotel for proximity to BC Place and convention rate. Plain living room, doll sized kitchen, rather plain bathroom and spacious bedroom. Dollar for dollar it's a good deal if you value space and an almost condo style accommodation on Robson Street in the heart of downtown Vancouver close to everything Included continental style breakfast.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Kamloops, Canada", "Title": "“Misleading reviews”", "Author": "jessica P", "ReviewID": "UR125472751", "Content": "I read all the reviews on here and thought it looked like a nice place to stay, so I booked us for all 9 nights we were in Vancouver. They gave us a discounted rate for staying so long (I think it was corporate rate) but I realized that didn't include wifi so I called and they comped the internet since we'd be staying so long. When we arrived we were told that only one device was covered for wifi and it would be an additional $15/day per device. My boyfriend does this (networks) for work, and that's the whole reason for the visit. Since I'm staying with him I need to entertain myself while he's at work and I use the internet for that. So we need at least 2 devices, and that's before our tablets and 3rd laptop. We got to the room and the internet was shotty, we had to keep putting in the password. If they are charging $15/day/device, you'd think they'd be able to afford the best of the best, highest speed internet. But after the first day, we discovered this was absolutely not the case when the internet went out. We couldn't log on at all, and when we called the desk they said \"maybe it will be fixed tomorrow\",, tomorrow came and it was \"maybe tonight\" but the bf had some coworkers coming in to join him & stay in the same hotel. We all cancelled our reservations and went to Georgian Court (which was great). They were allowing guests to use wired internet at their single kiosk for 15 minutes at a time but the line was full of angry guests...it was not pleasant waiting in line to find a new hotel. That's not all, the kitchens are from the 50's- completely metal and grimy. Our fridge wasn't working so we had to ask someone to come show us how to turn it on. Being so old it was hard to figure out the little plug in the back controls the temperature. The beds were hard, but I don't mind that usually. These were bad though. The carpets were gross & grimy and the bathroom was too small for 2 people. There were no full length mirrors and the lighting was bad. The breakfast was decent at least. Fruit, muffins coffee & tea-continental breakfast. But the exercise room was pitiful. I thought it was a storage room when we arrived, but when I went to use it, yikes. It is on the ground level, with window walls looking out to the driveway where people and taxis come & go. There were a couple of outdated machines, one was unplugged and \"out of service\" sign was on it. There were white stains on the curtains (I can only imagine) and what looked like vomit stains on the carpet. This would be an ok place to stay (for less money) if you were going to a game or just wanted to party and were leaving the next day. And didn't have to shower. The shower curtains are really cheap and suck in while you shower, so you have to push them out or put weights on them. This results in a flood every time you shower and there isn't enough space in the bathroom to hold all the towels you will need to use to mop up. It feels like everything in this hotel came from a garage sale. There wasn't even any stuffing left in the couch. It's gross, I would never stay here again unless it was free. Even then only maybe. At least the staff was friendly and accommodating. I almost feel bad leaving such a bad review. The owner should stop being stingy with the money you charge people and splurge on quality furniture, flooring, internet, etc. Stop buying from old estate sales.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Nanaimo, Canada", "Title": "“Very bad customer service”", "Author": "Leanne D", "ReviewID": "UR125265627", "Content": "Very shocked at how they treated us. They disregarded the fact that we are paying customers wanting to stay at their hotel and instead treated us very horrible. It is a very dissappointing hotel and I would never recommed it to anyone! I am surprised they stay in buisness with the way they treat their customers.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Winnipeg, Manitoba", "Title": "“Nice Surprise”", "Author": "timbo", "ReviewID": "UR125202440", "Content": "I spent one night q the Rosedale on Wednesday 22 February. Nice surprise. Hotel is well located in downtown Vancouver. Suite was very clean and the bed was very comfortable. Check in and out was quick and courteous. Concierge allowed me to use his computer when the business computer was not functioning properly. My one night stay was great and I would stay again if back in Vancouver. Lots of restaurants in the area including Rosie's in the hotel.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "BC", "Title": "“Not Bad”", "Author": "tedcBc", "ReviewID": "UR124987767", "Content": "We arrived on a Wednesday and stayed two nights. We had a one bedroom suite for my son and I and were in town to watch the hockey game. Perfect spot to stay with easy walking distance to restaurants and to either of the stadiums (BC Place or GM Place). The parking was easy to get into and out of and the room was adequate for our needs. We were on the 10th floor so it was fairly quiet and folks at the desk were polite and helpful. It isn't a high end place but there wasn't anything that would stop me from using this place again.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kamloops, BC", "Title": "“Loved the hotel, great location”", "Author": "DodieKamloops_BC", "ReviewID": "UR124887554", "Content": "We went to Vancouver for a hockey game and stayed at the Rosedale on Robson because of the location to Rogers Arena. The decor was upscale, beds very comfortable. We had lunch and breakfast in the restaurant food and service were excellent. I would recommend this property for traveling for business or pleasure to stay there.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Tired. My partner said there were 'critters' (mice) in the walls and ceilings.”", "Author": "jamesmorton", "ReviewID": "UR124761239", "Content": "Not terrible but there are nicer places for the same price so why stay here? The rooms are small and tired. Seemed clean enough to me but maybe there are mice in the walls -- I heard something but am not sure what. Anyway, try elsewhere first.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Puyallup, Washington", "Title": "“Small but nice updated room -- VI Owner Review”", "Author": "CheerMom602", "ReviewID": "UR124687566", "Content": "I booked a girls weekend trip courtesy of VI’s bonus time for last weekend. I was a little leery after looking at some the pics on this site but our room (#809) was really nice and appeared to have been recreantly fully updated. I knew VI had redone the kitchen areas but I didn’t know what to expect regarding the rest of the unit. I was very pleasantly surprised to find that everything had fresh updated look to it. The living room/kitchen area in the two bedroom suite was definitely smaller than at other VI resorts I’ve been to (only about a fourth of the usual amount of space, if that) and with only 1 bathroom, 1 living room chair, a couch that sits 3 and a table that seats 2 in my opinion it’d be WAY too small for a party of 6 but for a party of 4 it was comfortable. The TV in the front room had horrible reception, very snowy. I reported it to VI so hopefully they’ll get that fixed. The TV in the 2nd bedroom was fine and we never tested out the other one so I don’t know what it was like. I found the beds to be firm as well but the linens seemed fine to me. The check in and out process was very quick and easy. They do a temporary security charge of $100 when you check in. It’s $5 a day for internet and $16 a day for in & out parking -VERY TIGHT spaces and was a little challenging trying to find a space our 2nd night and the tax amount was around $13 for the two nights added together. We spent Saturday walking in a huge circle around Vancouver. We checked in with the concierge and let us know the safer areas vs the maybe not so safe areas. We had a huge brownie desert in the hotel restaurant the night we arrived (big enough for at least 3 to share) and breakfast there the next day, both good experiences. One thing we noticed about Canada vs. the US was how much more expensive everything was. A $3 bottle of wine down here goes for around $13 up there just to give you an idea. Also if you use US cash in stores they exchange it at 95 cents to the dollar compared to 99 cents to the dollar at the banks and most credit card companies charge an international exchange fee except for Capital One. There’s a 7-11 right across the street and tons of Starbucks around. All alcohol (even beer and wine) is only available in liquor stores. All and all it was a great little get away spot, I’ll definitely go back again at some point.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Handy location”", "Author": "wetravellots101", "ReviewID": "UR124550376", "Content": "We like this hotel. Have stayed there a couple of times and it is an easy walk uptown or down to Yaletown for some good restaurants. The higher floors have very good views and the bar downstairs is great for a beer and an easy meal.", "Date": "February 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "vancouver, bc", "Title": "“not too shabby”", "Author": "bungadoo", "ReviewID": "UR123136294", "Content": "Many people have mentioned location and its true, its an awesome spot for walking around downtown.Its also in a good neighbourhood. The rooms werent bad. i liked the size and the fact that my kids could sit in the bedroom and watch cartoons and we could sit in the small living area and watch tv as well. The decor was little bit older, but I didnt think it was dingy or icky in anyway, its just not a fancy, modern place.My only minor complaint is that the bed really wasnt too comfortable and the bedding was just regular (nothing fancy) The pool was great. The staff were friendly, check in was a breeze. Besides the location, the second best part of this hotel is the cost of parking, VERY resonable for Vancouver (16 or 17 bucks a night) Ive paid as much as $45 a night at other Vancouver hotels!", "Date": "January 15, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Perhaps not”", "Author": "tsbright", "ReviewID": "UR123127689", "Content": "We had two stays here that were pre-paid well in advance. The first was an overnighter in a one bedroom \"deluxe\" suite. We found the living area to be a bit dark and dingy even with all of the lights on. After putting our bags in the bedroom and settling in a bit, we were surprised to find that the living area had not been cleaned after the previous occupants. The carpet had not been vacuumed and there was food, sticky thick caramel I think, smeared on two of the walls and dribbled across the carpet. These were not light unnoticable marks either; one was about 4cm wide, 20cm long and 3mm deep. Yuk. We pointed it out to the staff member who brought up the extra towels for our family (we had to call for this as there were 3 towels supplied for a party of 4). He just shrugged and said \"New Years Eve, we haven't had time to repaint\". There was also a wall size mirror that was broken and repaired with sticky tape. Our second stay was 4 nights in a 2 bedroom suite. I'm happy to say that the room was clean this time. The kitchenette however, was poorly equipped and made it difficult to cook anything e.g. one small pot and a small frying pan were the only cooking tools supplied in our unit that was designed to sleep up to 6 people. The fridge was small with no temperature control. Disappointingly there was no table to sit at to eat either. We made one meal and decided to eat out on the remaining nights. As others have pointed out, the location is good, with plenty of eating and shopping venues close by. But I think that if we ever go back to Vancouver, we would look at alternative accommodation. This hotel was not very good value when compared with the other self contained properties we had stayed in in other locations-even New York.", "Date": "January 15, 2012"}, {"Ratings": {"Sleep Quality": "1", "Overall": "3.0", "Value": "3", "Service": "3", "Location": "4"}, "AuthorLocation": "NYC", "Title": "“Location”", "Author": "ShopperNYC", "ReviewID": "UR122743821", "Content": "As others have said, the location is great. Walkable to Yaletown, Chinatown, Gastown, etc. The rooms are probably larger than the average hotel room because of the separate living room area, but there was a general dinginess to the place that just made it kind of... icky. The beds had those old fashioned bed spreads that probably haven't been washed since the 70s, there were no dust ruffles on the beds so the box springs were exposed, which was weird, and everything was just dated and did not feel modern and clean. The beds were horribly uncomfortable, and that is not usually something I notice, but I felt like I was sleeping on a rock. I only stayed for one night so I tolerated it, but had my trip been longer, I would have been very unhappy. I did the continental breakfast which was ok, but nothing special: a small assortment of breads and muffins, yogurt, fruit, only 3 cereals, and coffee, juice, tea, etc. Again, for one night, it was tolerable but if I go back to Vancouver I think I'll look to stay elsewhere. FYI - Parking was an additional $13/day.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Upper Hutt, New Zealand", "Title": "“Superb Location”", "Author": "Lewy_12", "ReviewID": "UR122736015", "Content": "We stayed five nights in total, four at the beginning of our holiday then overnight two weeks later. Great location within walking distance of BC Place and Rogers Arena with Queen Elizabeth Theatre a stone's throw away. Also close to bus and train routes and not far from Gastown and Downtown generally. 7 Eleven acorss the road and Subway around the corner with a small drug store just beyond that and not too far from London Drugs so everything you need is close by. We had a one bedroom queen room and while the bathroom was on the small side, both the lounge and bedroom areas were ample. Didn't use the kitchenette to cook with but it was ideal for breakfast particularly with supplies close at hand from nearby shops. The laundry was very convenient and the indoor pool was a good size and temperature. We had an evening meal at Rosie's which was good and reasonably priced. Staff were friendly and helpful. Would stay there again if we were lucky enough to go back to Vancouver.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver Island, Canada", "Title": "“Rosedale Rocks!”", "Author": "Linda1414", "ReviewID": "UR122692064", "Content": "We have been twice in the last three months...and before that as well. Excellent service, great restaurant/pub attached with great atmosphere. The suite we had was great, very comfortable and clean. We will be back!", "Date": "January 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Salt Spring Island, Canada", "Title": "“Great location”", "Author": "SaltSpringCurt", "ReviewID": "UR122605804", "Content": "Location, location,location. Walk to: Vancouver's two major sports arenas, Yaletown for hip restaurants, Robson shopping, Vancouver's unique library, Vancouver Art Museum, Gastown and hope a inner harbour ferry to Granville Island. We also had our skis for Vancouver's three city ski areas. Our home was part of VI timeshare. Just the right space and great view. There is a pool and spa, free morning newspapers and restaurant on site.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Good location”", "Author": "xmasphenatic", "ReviewID": "UR122096045", "Content": "We had 2 short stays here before and after a trip to Whistler. Our room was comfy and had everything we needed. Bed was a bit firm. No in room safe but we were able to have a safety deposit box at reception. Location was good, we were able to walk everywhere. There was a grocery shop over the road and a restaurant attached to the hotel. We weren't happy with the concierge when we booked a bus to Whistler only to find there had been a problem with the booking and it hadn't been made, we were told a message had been left for us but we hadn't received it. The concierge on the next shift sorted it and got us on a bus at the last minute. We would stay again for a short stay.", "Date": "December 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wales", "Title": "“Good hotel”", "Author": "unknownis", "ReviewID": "UR121697833", "Content": "Stayed here with wife and young infant son about three years ago. Caught a lift from the airport with some friends. Large room, nice view. Breakfast was very nice, so was the pool. Staff were very friendly - they helped me fit a car seat into a hired car, sonething which would have taken me forever...and gave me directions, very helpful. had food in the resteraunt, but pricy but was OK. Would stay again.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Coquitlam, BC", "Title": "“Not bad at all!”", "Author": "Tina8", "ReviewID": "UR121644339", "Content": "We stayed for one night only while we were in town for the Sting concert. The hotel was great, the lobby, restaurant, room and yes hallways, were all very nice and clean. The bed and pillows were good and the room itself (room 1412) had a nice view of the library... Two flat screen tvs, a small kitchenette and a sitting room, nice size bedroom with queen bed. You can walk to everything, the Queen Elizabeth Theatre, shops on Granville and Robson, BC Place.... Would definitely stay again.... Front desk staff were very friendly and helpful!", "Date": "December 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Alberta", "Title": "“Old Rooms”", "Author": "pirlie", "ReviewID": "UR121161132", "Content": "When we drove up to this hotel the outside and lobby was very nice. As soon as we went to the room we were very dissapointed!! The room was very old, outdated. The bedding was old, I didn't even want to sit on it! The beds are not comfy. The bathroom is small. For the price we paid I would not go back! They need a major update done to the rooms here.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Fine quality and convenient location.”", "Author": "fastL", "ReviewID": "UR120565374", "Content": "Stayed here for7 nights and must say the room and staff were ideal. Helpful in every way. The room was well equipped and large with great views. And being next to the laundry room was very handy. With on site parking this was an ideal hotel, but was also near the Train and bus routes which made getting to the numerous attractions much easier. The staff on the floors were efficient and tidy and the concierge and reception staff could not have been more helpful. We really enjoyed our trip and would certainly use the Rosedale on Robson again.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "England", "Title": "“Good location, helpful staff.”", "Author": "fishstorm", "ReviewID": "UR119965242", "Content": "Stayed 3 nights in September 11. Arrived 4.5 hours before check in time and was allowed straight into room, always a bonus. It was more a suite than a room, with a lounge area and a small kitchenette, we only made use of the fridge but it was very welcome. The bed was enormous and we both slept wonderfully well. The staff arranged our bus/ferry to Victoria and back with only 20 minutes notice and it worked just fine. The hotel isn't the prettiest but who goes to Vancouver to stay in the hotel, for what you pay, you get a lot.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kent", "Title": "“Great”", "Author": "Rillabub", "ReviewID": "UR119890348", "Content": "This hotel has everything you could need. The bedroom was nice and the little lounge/kitchen was great to have. The staff were helpful and it is in a good location. We used the laundry twice, good to get everything clean before you move on as we were away for 4 weeks. The only thing that we did not like was the price in the restaurant Rosie's. The service charge was a bit much. The food was ok but over priced. All in all it was good for us and we would stay there again.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sydney", "Title": "“Definitely for families”", "Author": "iwaswayoff", "ReviewID": "UR119847974", "Content": "The only bad thing I can really say about this hotel (and it may be a matter of opinion), is that the bed seemed really hard. It is very nice to have a separate room for watching TV. There is also a small kitchen. The kid can stay on the sofa bed while you take the room. The lobby is quite big and nice and the staff very friendly and helpful. The hotel bar seems to be a sports bar of sorts with $15 dinner specials. Ask for wifi through reception, it was only $5 a night. $10 if you just went online and signed up.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Just fine!”", "Author": "saladi", "ReviewID": "UR119694929", "Content": "Our stay here was just fine although the decor is a bit dated, the bed is not as large as at other hotels, and the rooms are fairly small. But we were out and about all day and just wanted somewhere to lay our heads at night after a quick snack so this filled the bill nicely. The separate sitting room felt a bit more like home and it was nice not to have to sit on the bed as with one-room accommodation. The kitchenette was adequately equipped for a heat-up meal and a coffee, although the dishes were not washed in the morning - it seems we are supposed to wash them ourselves which is not quite what I expect from a hotel, but that's a minor point. There was a daily charge of $5 for Wifi but we were only charged for 1 day after our 2-night stay, perhaps to make up for all the problems we had with the telephone - couldn't ring internationally or to a 1800 number, despite visiting reception and being told the phone was fine. Overall however, our stay was pleasant, the location is excellent and we would stay here again.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Lots of room!!”", "Author": "Vicki S", "ReviewID": "UR119093443", "Content": "We were very, very comfortable at the Rosedale on Robson. A large lounge area & kitchenette make travelling with the family so much nicer. The staff were very friendly and helpful to us. The hotel is situated well, with most attractions like Canada Place & Gastown a very easy walk. We really enjoyed our time in Vancouver and would recommend this Hotel to anyone.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Time to renovate or at least clean the carpet!”", "Author": "GS3109", "ReviewID": "UR119088658", "Content": "I've seen so dirty carpet only once in my life - it was in the middle of nowhere in 1-star motel (had to stop there because of the road conditions). Starting from hallways and continuing to the room - greasy, spotty 80-s carpet which was never washed. I've made a reservation on hotel's website for a \"deluxe\" queen bedroom two weeks before our weekend in Vancouver, but the only one that was available was 2 double beds (giving my hubby's complexion, we had to sleep separately because of that). Kids enjoyed their sofa bed, although an adult would be uncomfortable, since you can feel springs by gently pressing on the top of the mattress. Beds are motel quality with very uncomfy waffle blankets, dated as well as early 80-s. (If this is a deluxe room, how uncomfy are standard rooms then?). Beds linens are, although, clean and white; we had extra pillows for all 4 of us and stuff brought us couple more. It looks like their re-painted our room a few months ago, but, gosh, change the carpets! They are scary looking.... We also had a very strange heater/cooler/fan in our room - it seems to sense changes in milli-degree, since if it is set on 70, it will turn itself on and off every few seconds. Giving the noise this monster makes, it is hard to fall asleep if it is not completely shut down. We had to turn it off for the night - thankfully it is fall outside and window could be open to ventilate the room. Kitchenette is also 80-s, kind of a military condo style (steel doors, stainless steel, everything compact and build in like on the submarine) , but has bigger than usual refrigerator and all the dishes and silverware. It is spotless clean and working just fine. There is also an electric kettle and a teapot for those tea lovers besides usual coffeemaker. We also had unexpected surprise with hotel's pet policy - although it is advertized on their website as pet friendly and no conditions are mentioned, there is a 15 dollars/day fee, plus, they will not service your room if pet is present. There is not a word about that in both hotel’s guest service book as well as on their website. If you will look at expedia - it is listed there, but you had to dig for that info and, obviously, we were unprepared for that charge. As a result - no cleaning service and 30$ extra charge... Hotel location is convenient for the city visitors - both trolley and big bus tours have stop just around the corner, plus downtown Vancouver is not so huge to walk around and hotel is in the safe part of it. It is a quite noisy at evening due to he proximity to the stadiums and multiple public bars/restaurants around, so be prepared to either not open windows at night or use earplugs. On the good side there is a small, but clean pool, steam room, sauna and Jacuzzi on the first floor of the hotel. Water in the pool is comfortably warm, Jacuzzi is a little bit deeper than usual - water is just below my chin if I will sit there and I am taller than average person. The only strange, but apparently effective (and maybe \"green\"?) thing in this pool that cracks in the glass wall and gaps between doors and frames are patched with clear packaging tape. This original repair trick makes pool air warm and you do not feel draughts of cold outside air. Overall, I do not think our family will stay in this hotel again unless some major renovation will take place. There are plenty of other hotels around in a similar price range for us to try. As I see from other reviews, some rooms in this hotel were given a facelifts already. Hopefully, this tendency will be continued.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Richland, Washington", "Title": "“A very nice hotel in a great location!”", "Author": "billr70079", "ReviewID": "UR119017367", "Content": "We stayed for 6 nights in October 2011. What a great location in the heart of Vancouver! Our room was a one bedroom suite with a small kitchen area. The room was very clean. Our check-in service was as good as anyplace I've been with no drama or surprises. We had to call maintenance twice for a couple of minor issues and they fixed them immediately. The views of the city are wonderful. We will stay here again on our next trip to Vancouver.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Devon", "Title": "“A Fantastic hotel”", "Author": "50552", "ReviewID": "UR118580377", "Content": "Just come back to UK after after spending 3 fantastic weeks in the Rosedale. Staff could not do enough for you, a big thank you to everyone for making us feel so important. We had a wonderful room on the 20th floor, so the views from the floor to ceiling windows were to die for. This was our second trip to the city of Vancouver, no doubt we will be returning in a few years and I know what hotel we will be choosing. Thank you all again and our apologies for setting off the smoke alarm on our first morning after burning the toast ! ! ! Pete & Sue Chapman Devon UK", "Date": "September 25, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Adelaide", "Title": "“Spacious accommodation and great location”", "Author": "RachelAdelaide", "ReviewID": "UR118313626", "Content": "Stayed there for 4 nights in September 2011 with my 2 adult daughters. The apartment was very spacious and the sofabed more than adequate. The beds were very comfortable also. We did not experience any slowness of the lifts and the internet, even though it was a bit slow, was only $5/24hrs. Worth having in the room for the iPad. Great location to walk downtown and to get to Skytrain. Also IGA by front door and great supermarket 1 block away with nearby pharmacy also. Huge choice of eateries in Robson Street a definite advantage, although the onsite restaurant was really good. Reception staff were extremely helpful with requests, even organising a fast luggage repair for us. Definitely a great place to stay if you are needing more space.", "Date": "September 19, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Will definately be back!”", "Author": "Lisa G", "ReviewID": "UR118259221", "Content": "We stayed at the Rosedale on Robson in March 2011 and thoroughly enjoyed our visit. The hotel was lovely, our appartment had a fantastic view and the service was brilliant from the reception staff. Being our first stop on a 2 month trip through Canada meant we had a lot of questions, and the wonderful reception staff were always happy to help...no matter what time of the day or night. We loved the location, right in the middle of the city, everything you needed nearby and only a 10 minute walk to Rogers Stadium (highly recommend going to see an Ice Hockey game there) and a beautiful 45 minute walk down the waterfront to Stanley Park (with plenty of lovely places to stop for lunch on the way). We loved our stay in the beautiful city of Vancouver and will definately be back....we would not consider staying anywhere else but the Rosedale on Robson - great value for money.", "Date": "September 18, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Good hotel, great central location, would recommend.”", "Author": "M00123", "ReviewID": "UR118214674", "Content": "Nice accommodation and located in walking distance to the harbour, IGA grocery store, pharmacy/chemist, restaurants, McDonalds etc. Kitchen was useful to have, as was access to the laundry facilties (located on the odd floors and $1.25 per load of washing - to either wash or dry). The only minor downsides were that we had to pay for Internet access, and that the lifts seemed quite slow. Would certainly recommend this hotel to others.", "Date": "September 16, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Cheshire, UK", "Title": "“I would stay here again”", "Author": "DollyDimpel", "ReviewID": "UR118128626", "Content": "I stayed in this hotel with a friend for 2 nights and didnt have any complaints about it. For the price (and Vancouver is expensive) I felt this was a good deal. Everything was clean and functional and adequate for a couple of days. We were only really sleeping here so didnt spend much time in the room as sightseeing was more important. The beds were really comfy and the room was quiet despite being on a lower floor. We didnt use the pool but it appeared to be clean. All the staff were friendly and helpful and we enjoyed a few drinks in Rosies (the bar attached to the hotel). There seemed to be quite a few dogs in this hotel but no signs of doggy smells or hairs..(now that would be cause for complaint!). Overall a good hotel and I would stay here again.", "Date": "September 14, 2011"}, {"Ratings": {"Location": "4", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Sechelt, Canada", "Title": "“Not worth the money!”", "Author": "bellakash", "ReviewID": "UR118088464", "Content": "I just stayed at the Rosedale on Sat. night with my daughters for the Taylor Swift concert. It was a last minute thing and the Rosedale was the only hotel that had a room available. I've stayed in other downtown Vancouver hotels on Robson and the Rosedale is not worth what it charges compared to the others. The room is dated, dark and we had to use the bedding from the dresser. I pulled out the pillows and they had long dark hairs on them! Also room service dishes left in the hall from our neighbors were there for 24 hours. Upon arriving and leaving I noticed that the lovely large glass doors and windows were FULL of smudges and fingerprints that looked as if they had been there for a month. Great location Rosedale and polite staff but please update and pay attention to those little details!", "Date": "September 13, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Smithers, Canada", "Title": "“we had all the amenities we needed , a suite hotel , very comfy, close to downtown and Robson Street, rogers arena, skyt”", "Author": "jasmine499148", "ReviewID": "UR118040368", "Content": "Great location , rosies resteraunt awesome food and service.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Vancouver Island, Canada", "Title": "“Very disappointed!”", "Author": "mastersbaby", "ReviewID": "UR118005982", "Content": "I booked at the Rosedale to take my daughter & her friend to see the Taylor Swift concert and with the hotel's close proximity to GM Place I thought we'd be happy with our choice. Boy was I sadly disappointed. Our room (on the 4th floor) was dark, dingy, outdated & overpriced for what we got. The living room area had no windows so it was very dark, the chairs & couch were uncomfortable, the TV was small and outdated, the bathroom was small, dark & had no counter space, we didn't have enough towels for three people & had to call housekeeping for two more bath towels! The in-room amenities were sorely lacking. My daughter & her friend burst out laughing when they say the Ninetendo 64 game console in the room as they had no idea what it even was the gaming system was so outdated! The kitchenette was very tacky & outdated. Our beds were small and the bedding was comparable to that of a Super 8 Motel...lackluster & uncomfortable, again with a small old TV in our room. We found the stairwell to the parking area smelled bad and the elevators were very slow. The service was terrible and Rosie's was terrible and we walked out after waiting for 30 minutes without even so much as a drink being brought to our table. Finally the Wifi service was terrible... For a $200+/night room, I would have expected so much more.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Fort St. John, Canada", "Title": "“Would stay again!”", "Author": "JazzFSJ", "ReviewID": "UR117546381", "Content": "We stayed at the Rosedale on Robson as we wanted a hotel in the downtown area where my daughter and her husband could stay with us to save some money. The hotel is a suite hotel and our room had a bedroom, sofa bed and kitchenette. The matress on the sofa bed and bed weren't that comfortable, but the room was great and the view from the 10th floor window was awesome. The hotel is conveniently located and we walked to the granville island boat and to the skytrain stations easily. Would recommend for anyone wanting to stay in the downtown area. There is an IGA, McDonalds and 7 11 nearby to pick up food for breakfast if you want to eat in the room.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Lake Louise, Canada", "Title": "“We are happy and would return”", "Author": "Mike H", "ReviewID": "UR117470501", "Content": "We checked into a deluxe suite which consisted of a sitting area and a bedroom with two queen beds. The place was clean, fully kitted kitchen, and clean modern bathroom. Staff were professional and helpful. The only down point is the charge for internet on a daily basis. When hotels in remote Canada are prepred to provide free internet, its a little harsh to charge for this service.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Kelowna, Canada", "Title": "“Needs work”", "Author": "AmaWW", "ReviewID": "UR117382704", "Content": "My husband and I stayed there in September 2010 due to a gift certificate. There are good and bad from this hotel. The positives, the location of the hotel is right downtown on Robson. Close to all the shopping, restaurants, and arena. The swimming pool is a decent size and the sauna was nice after a long day. The guys at concierge were excellent in providing information. The suites have a mini kitchen with a stove, oven, and fridge. The downside, the hotel is in need of some updating. The suite we were assigned was one that we had to go through 2 doors to get into which was a little difficult to get into with large luggage. When we got into the room we turned on the light switch to find we had no power. I called the front desk where they informed me that I would have to flip the light switch outside of my suite in order to get power inside the suite. The suite is small, and is in need of some redecorating. The kitchenette was right outside our small bathroom. The bedroom was a decent size and had large windows. At the time the hotel did not have any king size beds. The living room had a sofa, a desk and an old box TV. It has the basics. We tried to check out before 10 AM, but the elevators took a long time. When the elevator did arrive onto our floor there were too many people inside. The couple waiting by the elevator before us commented that they had waited for 15 minutes. After a while we decided to take the stairs with our luggage. The hotel being an older building has narrow stairwell and when you reached the second floor, one side of it had banquet equipment along it. My husband and I were happy that we stayed on a gift certificate to experience the hotel. We don’t think we will be returning to this hotel.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Dorset, UK", "Title": "“Disappointed”", "Author": "DrPlmr", "ReviewID": "UR117206185", "Content": "Stayed at this hotel as a RCI exchange,and was very disappointed. The location is reasonably good for access to downtown. There are many diverse food outlets nearby for less formal eating. \"Rosies\" the on site restaurant tries to be a British pub, but fails. I do not like service charges preloaded on my food bill ! The living accommodation was dark with hardly any natural light, the bedroom at the front had a full wall of glass,so plenty of light!! The floor of the kichenette was in a very poor state,and I was able to cut my foot on badly maintained floorboards. There was no housekeeping all week, we had to take garbage down in the lift from the 15th.floor, (nice for other guests). There was no change of towels all week, despite being promised a new set by the reception desk staff.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Vancouver BC", "Title": "“Made our wedding day even better!”", "Author": "49Charlie", "ReviewID": "UR117151823", "Content": "We checked in for 2 days Aug 20, 21 2011 for our wedding and had the perfect hotel experience. It was very tough to find reasonably priced rooms for block booking downtown. We actually started with the Georgian Court but when we talked to the Rosedale they were $60.00 cheaper! That's huge when your asking friends to spend money to come attend your wedding. We booked with the Rosedale right away. They even honoured our block pricing with late comers. The hotel was exactly what we needed, clean, professional, well managed and very friendly. The connected pub is excellent as well. We discovered an extra treat on check in when we found out they had put us in a honeymoon suite on the top floor - wine and a HUGE fruit basket! Super nice of them as we weren't expecting anything. The suite had a HUGE balcony on the roof with an amazing view. The suite was perfect - nothing wrong or broken, great coffee maker (huge for me as that's the first time I've ever enjoyed a morning coffee in a any hotel room). Many thanks to Jody Spackman from the Rosedale for taking awesome care of us!!! THANK YOU!!", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Geelong, Australia", "Title": "“GOOD CHOICE”", "Author": "Coutas", "ReviewID": "UR116638666", "Content": "We booked this Hotel with Hotels.com after comments in Trip adviser Reviews. We booked for two nights following a cruise on the Diamond Princess starting In Beijing.The hotel was perfect for our needs and within easy walking distance to the Main shopping area,Hop on hop off bus and the Ferry terminal (for Grouse Mountain) Our room was spacious and very clean with comfortable bed. The staff were friendly and the adjoining restaurant was very good value for food and drinks. Would definately stay there again.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Orange, California", "Title": "“Excellent location and walkable to Stanley Park”", "Author": "MasonsDad", "ReviewID": "UR116548307", "Content": "Given the typical prices in Vancouver, this hotel is an excellent value. It is in a great part of town....close to Stanley Park, great restaurants and shops and all of the room are suites (including stove, appliances, fridge, etc.). There is a swimming pool, sauna, jacuzzi, steam room and work out room. The room was very clean and we got a 2 bedroom suite for $147USD per night. I would definitely stay here again.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "solihull", "Title": "“Not too bad”", "Author": "gooseSolihull", "ReviewID": "UR116479599", "Content": "Noisy air con rooms at front can be very disturbing with the sreet noise. resturant managed by another company food not good expensive.carparking is expensive. Staff not very positive. at front desk.In need of a refit looking tired the rooms are fresh painted in white look clean.Rates are high. Good location.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Green Bay", "Title": "“Exceeded our expectations”", "Author": "natureluvr62", "ReviewID": "UR116313397", "Content": "This was our first trip to Vancouver, visiting family that lives there. My husband and I brought our two teens, 19 and 16. We booked the Rosedale on Robson because we had seen reviews that it was a good choice for families with children. We decided to book the family suite. Even though the living/kitchen area is a little small, I would highly recommend this for families. The windows are in the bedrooms so it felt a little dark and claustrophibic in the living area, but we didn't stay in the room that much so it wasn't a problem. We took advantage of the continental breakfast each day as Vancouver is quite expensive and there was something for everyone. The location was perfect, not right in the thick of the downtown but within walking distance to almost everything. The only disappointment was the hot tub and steam room were out of order for a good part of our week. The hotel was kind enough to give us a small credit for the days the hot tub was out of order, which we really appreciated. The pool is rather small but refreshing after a long day of running around. The staff and housekeeping were amazing, friendly and helpful. We would definitely stay here again!", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Nelson, Canada", "Title": "“Great location”", "Author": "k3k10", "ReviewID": "UR116173380", "Content": "Hotel was clean and in a great location. We got to enjoy Granville Street and were only blocks away from the Commodore where we were seeing a concert. I would definently come back again!", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Great Hotel. Will always come back here.”", "Author": "Maxar", "ReviewID": "UR116173342", "Content": "Great hotel location. Lots of food and attractions close by.", "Date": "August 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Victoria, Canada", "Title": "“Nice place close to BC place”", "Author": "Bosley2705", "ReviewID": "UR115998390", "Content": "Stayed in a one bedroom. Positive: Clean, quiet, close to BC place and Rogers arena. Good bed. Negative: small bathroom, too much furniture in room, 2 km away from shopping and restaurant area of downtown Vancouver.", "Date": "July 29, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "victoria", "Title": "“not impressed”", "Author": "loveydove", "ReviewID": "UR115989912", "Content": "my husband and I stayed at the Robson with our children. My husband just arrived from san fransico and had given me a beautiful banner of a buddha and a beautiful phrase on it.. i hung it over the door to the bedroom and left it there by mistake.. i emailed the hotel numberous times and never got a reply back. We left a huge tip for the maid and requested NO cleanup during our stay and made sure the room was nice and neat when we left.. i was dissapointed not receiving even ONE email indicating anything on my banner.. will not go back. :(", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Lithgow NSW Australia", "Title": "“Good Location”", "Author": "davetoni", "ReviewID": "UR115937195", "Content": "A little dated but clean,kitchenette and separate lounge area", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Vancouver, BC, Canada", "Title": "“A local BC guy staying in a Vancouver Hotel”", "Author": "GoWithoutBorders", "ReviewID": "UR115704259", "Content": "First things first.....I used to live in an apartment complex literally right across from the Rosedale on Robson. I now live in Coquitlam. Every time my family from Sydney, Australia would visit, they would stay at this hotel. They would love it. My entire family including nephews came to visit me early July and they all decided to stay in the Rosedale. They had the opportunity to stay in our home in Coquitlam though wanted to be in the centre of all the action in downtown Vancouver. I ended up staying in the Rosedale for a few nights the very first time myself for a few days with my family. The suites were very big with full kitchen appliances: cooker, microwave, sink, cooking pans, utensils and much more. This could all be closed off from the bedroom area which was still fairly big. The kitchen area had ample sitting. In general, the suites very big and nice and quite. Underground parking was only $11 a day which is very good for downtown Vancouver. The maids were always polite and cleaned the rooms very well each day. There is an indoor swimming pool and my nephews loved it. Next to this was a hot tub. Before taxes the room was about $175 a night which is excellent for downtown Vancouver. This came with comlimentary, continental breakfast served each day until 9.30am. My family have stayed at the Rosedale several times now and really enjoy coming back here every time they come to see me. I give it a definite thumbs up in every respect.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Excellent Location”", "Author": "gorilla60", "ReviewID": "UR115237059", "Content": "We had a great stay here,centrally located in the heart of the city..Short walk to great shops and all the sights. Great clean comfy room with excellen kitchen facilities.Friendly,approachable knowledgable staff.Rosies restaurant downstairs great value for money and great food.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent value for money”", "Author": "bilko1950", "ReviewID": "UR114696252", "Content": "Great location. Staff were very good and friendly. Room was clean, spacious and light.", "Date": "June 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great location!”", "Author": "CoffsAbroad", "ReviewID": "UR114689802", "Content": "My husband and I stayed during March 2011. We both thoroughly enjoyed staying at Rosedale's, mostly because of the location. Never having been in Vancouver before my husband and I would set out walking a different direction each day and by the end of the week we had literally walked all over town. The hotel is in prime position to access both Gastown and Yaletown, not to mention Robson street itself is the main shopping hub of Vancouver. It's within walking distance to the stadium if you feel like catching a hockey game, the hotel even offers hockey/hotel packages. Walk just up the street and bus no. 19 will take you directly to Stanley Park. The restaurant that is attached can get quite busy with an 'after work's crowd but this dies down after dinner time. The restaurant mainly features burgers, as like anywhere some waiters are better than others. Overall the food is OK, or there are numerous eateries on Robson Street, including MacDonalds across the road. The rooms was larger than we expected, great views (especially at night) and the room and hotel was always extremely clean.", "Date": "June 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Melbourne", "Title": "“Go Canucks and Vancouver! Oh and the Robson!”", "Author": "phantom_girl00000", "ReviewID": "UR112508358", "Content": "Stayed here from June 5th 2011 to June 7th 2011. Was pleasantly surprised with the hotel. Comfortable spacious rooms, clean and comfortable beds. When we checked in the staff were kind enough to give us a balcony which looked directly at Grouse mountain and the lights on the mountain at night! While we were there the Canucks were playing in the NHL finals series and people were everywhere when the game was on! The city did an amazing job to block off streets and allow people to watch the game outside. Overall an excellent hotel especially for the price, would definately stay there again! Location on Robson street is excellent with a 10-15 minute stroll to the main areas and heaps of food nearby in Yaletown.", "Date": "June 9, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Very average. Did not want to spend too long in the room.”", "Author": "Lw2309", "ReviewID": "UR112498071", "Content": "The Rosedale on Robson hotel was very average. We stayed for two nights and were located on the 8th floor which was old fashioned and in need of a revamp. The TVs were old and showed a fuzzy picture, the Nintendo console was old and not free, the wifi was not free and their business centre consisted of one computer in the lobby. Who charges for wifi these days?!!", "Date": "June 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Gloucester, United Kingdom", "Title": "“Great location, nice hotel if slightly dated”", "Author": "KINGKONG3", "ReviewID": "UR109525173", "Content": "Had a great stay here for a couple of nights in May. The hotel is good for both downtown and yaletown areas. It's also a short walk to Davie street or to catch an aquabus to Granville island. The suites were clean, a good size, and we had a good nights sleep as well. The rooms do look a little dated, especially the kitchen area - but it's not much of a problem and the hotel was good value so no big deal. I would stay here again for the location, but have stayed in a better Vancouver hotel for the same money. NOTE: No reflection on the hotel, but we did get given a counterfeit note in the restaurant on our first day (didn't notice until later) - a good reminder for tourists to always check your change (our $10 note was missing the sliver strip down the side)", "Date": "May 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Kamloops, BC", "Title": "“Time for some updating”", "Author": "Doug_Heffernan", "ReviewID": "UR107810515", "Content": "Wow this hotel needs some updating. Decent location with free parking. Had two double suite with pull out couch in separate room. Tvs are tiny and from the 1980s. Beds not very comfortable.", "Date": "May 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edmonton", "Title": "“Great Hotel in a Great Location”", "Author": "traveldad11", "ReviewID": "UR107593393", "Content": "Stayed there to run in the bmo 1/2 Marathon. Read a few mixed reviews upon booking but figured at worst, the location was worth it. More than pleasantly surprised!! Our 16th floor bay window room overlooked the city/mountains, the beds were super comfortable , the little kitchen (with Kuerig coffee maker-very nice touch) was a bonus, and the proximity to everything was great. Our housekeeping staff were some of the friendliest I have encountered and the concierge(?) gave me some great tips on how to get cheap tickets for the hockey game which was just an added bonus. If management is trying to make a change for the better here, I would say they are doing a heck of a good job. Are the rooms a bit dated yes, but it is an established hotel and for the price, I was very impressed. I will, if the price remains close to the same, make this my first choice when back in Vancouver. By the way, great restaurant downstairs with good beer on tap.", "Date": "May 9, 2011"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Ottawa, Canada", "Title": "“At least there were no cockroaches”", "Author": "Wordfiend", "ReviewID": "UR107169492", "Content": "Baded on several interactions with staff, the culture of this hotel was definitely NOT customer-centric. These included telling me to get off the elevator as it would not stop at the lobby on the way to the basement (to return dirty dishes to the kitchen), telling me to go to the front desk and get a special green slip in order to charge room service to my room. WTF? (I was sick with a very bad cold and had changed into my jammies.) Room was bare bones. Bed was hard. Bathroom was ridiculously tiny.", "Date": "May 6, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Vancouver Island, Canada", "Title": "“Favorite Hotel for years Now it is not..”", "Author": "pajim20", "ReviewID": "UR105210755", "Content": "Family been stayin here for years and other family members,Been in hotel field for 28 years..Well came over to watch Rod Stewart and got the room and went to the room and dropped hand bags off and went shopping went back to room and went for fast dip in pool and hot tub..tub not even @ 94 degrees like takin a bath,,Chlorine over max ,so went for a swim..cold not any where near 84 degress maybe 65 degrees so went back to room and noticed the oven on...went to switch off switch shaft broken (oven on broil) So removed fuses and went to front desk to report issue..Not much done..from staff.Gee just save the building from fire your welcome.So went to concert and came back @ 11:30 pm and went to lay in bed and turned TV on red screen then picture then red ..screen....well next morning not much sleep beds hard as sleepin on floor..went to have a mornin shower tub had ants in bathroom...that is not all went to check out and they charged me a $1.25 for a 1-800 number..do not get me wrong I am a maintenance man for hotels for 28 years and hold a swimming pool cert. will I stay here again I do not think so...a shame cause I like the hotel and location..", "Date": "April 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "vernon", "Title": "“excellent location”", "Author": "sweetvernon", "ReviewID": "UR102781396", "Content": "We stayed at this hotel to see the vancouver canucks game.It is in a excellent location,it only took us about a 5 minute walk to get to Rogers arena.Robson street is right there and gas town is also a 15 min walk.Our room was dated and tired needs refreshening for sure.The size of the room was great,really nice to put our son to bed and we could watch T.V in the living area.The beds were small for 2 adults and hard.Free continental breakfast ,great coffee.I do have 2 things that I was not happy with.The hot tub was colder than my bath water,I asked three times if they could please turn up the temp. A couple of other ladies asked as well.They never did bother to turn it up, one staff member told me it was at regulation temp.All I know, is that was the coolest hot tub I`ve ever been in,so I was dissapointed because that is something I look forward to.Plus the elevator was sooo slow,we stood waiting 5-8 min,we always ended up taking the stairs.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vancouver Island, Canada", "Title": "“Adequate”", "Author": "occy2", "ReviewID": "UR101026097", "Content": "We spent 4 nights at the Rosedale on Robson, on the 13th floor, in a 2 bedroom suite, which included a galley kitchen and sitting area. We found the location was excellent for sightseeing and we enjoyed the view of the city from the floor to ceiling windows. Unfortunately we found the \"living\" area very dark (40 watt bulbs) and extremely claustrophobic and in dire need of refurbishment. If we had been there for just a nite or two, we probably wldn't have noticed it so much but for a longer stay it was definitely noticable.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Quesnel,Canada", "Title": "“rooms”", "Author": "deb1958_309", "ReviewID": "UR100372735", "Content": "Hi we just got back from taking parents to a Canuck game and stayed at rosedale pkg hockey tickets and rooms,it was great the rooms where so big and nice they could up grade there tvs,but overall very clean and nice.The only complaint that I have is that the restaurant we stopped to havea drink and our limes we so old and dried out and went to bartender and asked for 2 more and he told me he wasnt on for another 15 mins and walked away with a att like that he wont be working for long,so I told our waitress and she was so sorry and she said the drinks where on them that was very nice.other then that I would recemmend the hotel to anyone.", "Date": "March 16, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "San Francisco, CA", "Title": "“Depressing rooms; though good location and value”", "Author": "SF_intrepidwanderer", "ReviewID": "UR97367371", "Content": "My first impression up seeing our room...I wish I'd booked through airbnb or vrbo. I was looking for a somewhat larger space (with a separate sleeping area from the main room) and Rosedale on Robson seemed to fit the bill at a reasonable price. However, upon seeing my dark, dingy room filled with old furniture and a sagging mattress, I wish I'd booked a condo rental instead. It's particularly disappointing because given the location of the hotel and its generally \"good bones\", it seems even a small investment to spiff up the hotel could make a huge difference. Pros: + Location: a few blocks from the Skytrain, about a 5-10 minute walk to Yaletown water front and in the midst of downtown. Very convenient. + Reasonable rates (about $130 a night, not including taxes) + Large rooms with kitchenettes and ample fridges Cons: - Dated, dingy rooms: Looks like the hotel hasn't been remodeled for 15-20 years. Furniture is dated and chipped and randomly placed (mismatched furniture suggests it wasn't designed for this space). A traveling companion described the \"atmosphere\" as \"depressing single occupancy hotel\". It was hard to relax in the room and we found ourselves wandering around and hanging out at coffee shops instead. - No wifi (let's just say the hotel guide still has instructions on how to use dial up internet service...enough said). - Lack of light: Perhaps a room on a higher floor have better light, but our suite only had 1 window (in the bedroom) which didn't let in much light. The living room area was perpetually gloomy and dark, even with all the lights on. - Dingy: There were weird stains on the door between the living and bedroom area and our bedspread was pretty dusty, otherwise clean given the age of the hotel. - Uncomfortable mattress: Mattress was pretty uncomfortable (saggy and could feel the springs); sofa bed was even worse. - Lack of blankets: Even though it was the middle of winter (Feb) the only blanket in our room was 1 thin cotton coverlet, which left us freezing. We asked for another blanket the next night and received a second thin coverlet (not ideal, but at least bearable). - Lack of security: The garage is open for general public parking and the garage elevators go straight up to hotel room levels, without keycard security anywhere. Having rented holiday apartments in nearby Yaletown in the past and having seen what you can get for about $125-150 per night (a well-furnished, full-size apartment), I would recommend going that route versus the Rosedale...I certainly wish I had.", "Date": "February 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wollongong, Australia", "Title": "“Good for Transit”", "Author": "Itchyfeet02", "ReviewID": "UR95136835", "Content": "This was a transit stop on our way into Europe. Arrived early so room was not ready. Left our luggage and walked into town but nothing was open yet. When we got to our room it seemed a little dated and very dark even with all lights on. Aircon (heater) was very noisy during the night so we slept with it off. The room seemed to maintain a comfortable temperature anyway. Restaurant was not too bad although we did not eat there every day. The biggest advantage of this hotel is its proximity to everything - shopping, restaurants and public transport ( Vancouver has a very good public transport system - $9CAD day pass for unlimitted travel on public buses (including the sea bus) and rail network). Overall this hotel is comfortable and good value for money.", "Date": "February 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“Very clean, great location, very good value for money”", "Author": "MRBAus", "ReviewID": "UR90131874", "Content": "Coming from Australia we didnt know what to expect but we were impressed for the price; we had a suite, bedroom with kitchenette and living room.The bedroom was very spacious. We were upgraded and stayed on the 16th floor. The downfall would have to be the lack of gym(only couple of treadmills) but it does have a pool. THe continental breakfast is pretty average however it is Free and has all the basics. Also xompared to other parts of the worls $25 for 7day net connection was great!", "Date": "December 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great place to stay loved the city”", "Author": "Kenlie", "ReviewID": "UR89985162", "Content": "We spent 3 days in Vancouver after cruising Alaska and before heading off on the Rocky Mountaineer to Jasper. We wanted to stay at a hotel that was reasonably close to all tourists attractions, having never visited Vancouver before. We like walking and we walked to explore as many areas as we could in 3 days, a couple of blocks from the waterfront, also not too far from the water taxis that took you over to the Granville Island markets. We caught a water taxi over to catch the bus in West Vancouver to go to the Capilano suspension bridge and Grouse mountain. The hotel room suited us perfectly, very clean small kitchenette and lounge area, very quiet. We met friends at and dined at Rosies Restaurant which is on site, excellent meal and great value and atmosphere", "Date": "December 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Canberra Australia", "Title": "“Good base for a Vancouver stopover”", "Author": "Volkera", "ReviewID": "UR87331437", "Content": "This was a good medium range hotel that is well located within most of Vancouver's sights. Rooms are getting a bit tired but are spacious and there is plenty of space to spread out. The eating options within the hotel are reasonably priced and there are many eating places within a short walk. Disappointed with the fairly costly wifi connection, given that most other hotels in North America now offer free wifi.", "Date": "November 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Northumberland, UK", "Title": "“Clean, comfortable, everything you need is provided”", "Author": "RosNorthumberland", "ReviewID": "UR87274897", "Content": "We stayed here for a week while we were visiting our daughter who is working in Vancouver. We had a free upgrade: our suite comprised bedroom with 2 queen-sized beds, bathroom with shower over bath, cleverly designed kitchenette and spacious sitting room. An extra bed was provided so our daughter could stay with us at no extra cost, with all linen included. Virtually everything had been thought of to make the stay comfortable - e.g. the kitchenette included toaster and coffee maker and even washing up liquid and cloths, as well as cooker, large fridge and microwave. The room was serviced to a high standard every day. There are washing machines for those who need them, and you can even borrow an umbrella from the hotel at no charge. The staff were all polite and helpful", "Date": "November 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Arbroath, United Kingdom", "Title": "“Good hotel ,helpful staff”", "Author": "Geraldine42", "ReviewID": "UR87026007", "Content": "Arrived here directly from airport ,tired and in need of freshening up.Were told on arrival we had been given a complimentary upgrade.Suite was very spacious and clean.Reception staff were very helpful about travel tips and generally very pleasant.Hotel is well situated for walking or public transport around the city.Rosies restaurant was good food at reasonable prices.We had a very pleasant four days there and I would recommend it to anyone traveling to Vancouver.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mackay, Australia", "Title": "“Good, as long as you like a very firm mattress”", "Author": "DebbieB2010", "ReviewID": "UR86098634", "Content": "Room was roomy. It had a kitchenette that was most handy to cut down eating out expenses. Beds were a little hard, and shower was an economising one, that was very hard on the skin. However it was in a great location, staff were friendly and Rosie's Restaurant that was attached was excellent as was their food room service. The cleaner did forget on more than one occasion that there were 3 in the room, so 3 towels were required, but an extra towel was always promptly delivered when we queried it.", "Date": "November 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kosice, Slovakia", "Title": "“Good Location :- However Poor Quality Hotel”", "Author": "Interspec", "ReviewID": "UR85225885", "Content": "Initially arrived in late afternoon to find room was not ready additional 2 hour wait, staff proved reasonability helpful. One we gained access to room old smelly food from prior stay left in refrigerator. Room was very cold and temperature control was not functional. Towel rack in bathroom was a dangerous height and caused eye injury, this should be noted that if you taller this hotel is not for you. General cleanliness of bathroom was ok however there were spots of mould on lower levers of tiles, more care should be taken on cleaning and disinfection. Lots of dust and dirt behind cabinets and TVs. Business amenities were very poor internet was charged at an alarming $15 per day and proved to be very slow and useless. Pool and gym facilities were limited, Pool did contain a lot of suspended solids should be checked. Restaurant was very good and staff very friendly and polite. Overall location was good but Westin is just around the corner and similar priced I would recommend this as an option.", "Date": "October 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh", "Title": "“Ideal Location”", "Author": "jimibob", "ReviewID": "UR84555594", "Content": "This hotel was our stopping off point for 2 nights before joining an Alaska cruise, I'd looked on Trip Advisor prior to our trip to check other reviews of this hotel and found them to be very mixed; so much so that I had pretty mixed feelings about our stay there. However, I'm bound to say it would be hard to find any serious criticism of the Rosedale. Reception was spacious, the hotel bar and restaurant welcoming and our suite was extremely well appointed and comfortable. My wife was a bit intimidated by the floor to ceiling window on the 18th floor, but the view was well worth it. So far as location was concerned, ideal for Yaletown, a short walk to Gastown or the Granville Island ferries, and all of Robson Street to explore. I'd happily stay there again, especially as Vancouver is my favourite city.", "Date": "October 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sechelt, BC", "Title": "“Great value for a Great Location”", "Author": "thecoastcouple", "ReviewID": "UR83879259", "Content": "The location was wonderful. The value can't be beat. The decoration and furniture are a little dated. I have stayed in several suite hotels in Vancouver and this definitely is the best deal. There are nicer suite hotels but they are much more expensive. One of very few hotels that over 2 twin beds in the second bedroom in the 2 bedroom suites.", "Date": "October 17, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Madeira Park", "Title": "“Great location, love the room size but a couple of problems...”", "Author": "madeiramom", "ReviewID": "UR83494668", "Content": "I've stayed at this hotel a couple of times in the past year. We chose it because they offer suites with separate bedrooms and we travel with a teen and a toddler so we can put the toddler to bed and still stay up and watch a bit of TV and chat. I love the downtown location, so convenient for walking to the shops and restaurants. The rooms are usually well appointed and suit our needs. The probems we've had on two different trips: The restaurant is terrible! (not sure if it's actually part of the hotel...you can charge your meals to the room so I suppose so) The service is just about the worst I've experienced in a LONG time and the staff is rude and inefficient. They take forever to seat you, ignoring that you're standing by the door, take forever to get to take your order, though the place is next to empty and then bring the wrong meals after a ridiculously long wait! We won't be returning to the restaurant, EVER! The first time we visited, the room keys didn't work, I had to keep going back to the front desk to get them to \"rekey\" it and each time it didn't work. I made about 4-5 trips up and down the elevator while my family waited in the hall...it would have been nice if they'd sent someone up to help. Parking...make SURE you don't pay in the parkade before registering! It's very deceiving as it makes it look like you should pay and then register but it'll cost you 3 times the price to do it this way. I complained to the desk staff about it but they brushed me off.", "Date": "October 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Great Value for Money! Better than expected!”", "Author": "BonVoyageAKL", "ReviewID": "UR81546695", "Content": "I travelled to Vancouver escorting a group joining a cruise in Vancouver. We chose Rosedale on Robson as it had a good reputation, good location and good rates. I checked out two days later totally satisfied with my stay and our choice. The group members all agreed. The rooms are much larger than standard hotel rooms and while not flash the extra space and convenience of the kitchenette and lounge area is a bonus. While the reception area is small the restaurant/bar is good value and service excellent. Bellhop/Tour desk staff were extra good! It is in a good location, a but quieter but still walking distance to shopping and with a number of small restuarants and eateries. Two conveniences stores within 100m is a handy. For the money this is one of the best value hotels we use anywhere in the world. Gerard Murphy Bon Voyage Cruises & Travel, Auckland, NZ", "Date": "September 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Cumbria", "Title": "“A good comfortable, centrally placed hotel with friendly staff”", "Author": "Molly046", "ReviewID": "UR81353164", "Content": "The Rosedale was a good choice for the final two nights of our B C holiday. It was well placed for Downtown although if we were to go to Vancouver again, we would probably chose a hotel closer to the sea. We had a good street map of Vancouver (a must) and found it easily. The hotel staff were helpful and we were able to take our bags to our room before driving to Canada Place to drop off the hire car. If you book with National/Alamo it isn't easy to either locate the drop off point which is in the underground car park adjacent to Canada Place, not even the local taxi driver we asked knew where it was. Once in the car park, the signs disappear and it takes a while to locate the right area. It took us a good 30 minutes to walk back to the Hotel, take a look at the library building on the way back, it's amazing. Although we had booked a double room, we were upgraded to a suite on the 16th floor so had a brilliant view of the City. There was a well equipped kitchen, big bedroom, small lounge area and 'neat' bathroom, all very clean. We found it quieter to keep the bedroom window closed and the lounge window open for ventilation. For those that like it, the air contioning was very efficient. Meals could be obtained in 'Rosies' resturant next to the lobby and although we didn't eat here plenty of people did and, when we called in for a drink one night, the food looked good and the staff were friendly. By walking four blocks we were able to get the number 19 bus to Stanley Park. It cost $2.50 and you could return on this ticket within 90 minutes. The Sky Train is four blocks in the other direction, downhill, an easy 15 minute walk and it cost $3.75 to get to the Airport, we were quoted $35.00 for a taxi.", "Date": "September 28, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "victoria", "Title": "“not what i expected”", "Author": "frippy1", "ReviewID": "UR81220797", "Content": "we booked the rosedale through expedia and expected what was advertised. we got there to find a useless 'guest service supervisor' and a room completely different from everything on the website. no flat screen TV's, no comfy couch and not even propper bedding. we found ourselves tangled up each night in the top sheets they like to use over the matress and a non-warm sythetic funny blanket. only after asking twice did we get a decent comforter. maybe they only do this to expedia clients, but i wont be staying there again.", "Date": "September 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Clean, friendly, well located”", "Author": "Firebird5", "ReviewID": "UR79510923", "Content": "Having never previously been to Canada let alone Vancouver, my wife and I booked our hotels and RV hire from the UK via Canadian Affair. This was their recommended hotel for Vancouver for our budget and, all in all, we were really pleased with it as a place in which to wind down for three days following our two-and-a-half-week tour of Alberta and BC. Arriving at the hotel by taxi in the early afternoon having returned our RV to the depot in the morning, we were greeted by friendly staff both in the lobby and at the front desk. Certainly, I was more than grateful to have a porter bring all our luggage up to our room - travelling with children is never a light affair! I would particularly complement Julie on the front desk for her manner with our kids and for the excellent advice on buses, ferries, attractions, etc. The room was much larger than we'd expected, even for a suite, with a spacious sitting area (two armchairs, couch, coffee table, TV with games console) and a comfortable bedroom with two double beds (and another TV). Separating these was a perfectly adequate galley kitchen (fridge with icebox, hob, oven, microwave, etc.) and a large bathroom. OK, the decor was a little dated, but the room was clean and perfect for our needs as we intended to spend as much of the final few days of our holiday as possible exploring the city. We did have a minor problem one morning when water came through the bathroom extractor vent from the room above, but this was dealt with by the maintenance staff quickly, politely and efficiently. The hotel is located very locally for such attractions as the Telus World of Science, the sports stadia and the False Creek ferries (which will take you to Granville Island, Kitsilano Beach, the Aquatic Centre and the Maritime Museum). However, it is a several block walk to the bus stop to get to Stanley Park. That said, for those who don't mind walking, the return walk along Robson Street past one of the most eclectic mixes of restaurants from around the world I've ever seen is quite worthwhile. There is a minibus service to the international airport which runs twice each morning. I don't think this is run by the hotel, but if you do need to get to the airport with a lot of luggage, then this is probably the best way to do so - it's quicker than public transport and much cheaper than a taxi. Despite the prices advertised in the lobby suggesting it would cost around C$40 for the four of us, the driver (who threw in a brief history lesson and guided tour en route) only accepted C$20 from us - bargain! All in all, I would have no hesitation recommending this hotel to anyone, but perhaps it is best suited to those travelling on a bit of a budget not looking for too much luxury.", "Date": "September 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Very Central - Very Comfortable”", "Author": "davmar70", "ReviewID": "UR77893264", "Content": "We stayed 9 days here making it our home-away-from-home after the Alaska Cruise and beofre Rockies Train trip. So handy to everything, shop on site is ideal and 711 & IGA around the corner. Housemaid was lovely, staff great, we were so comfortable would love to return.", "Date": "September 1, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Brisbane, Australia", "Title": "“OK hotel but will be staying somewhere else next time”", "Author": "cupcakena", "ReviewID": "UR77286672", "Content": "Average room but lovely staff. There were 3 of us staying in a one bedroom suite although I wouldn't really call it a suite and it would have been too small if we had stayed for any longer than 2 nights. The beds were comfortable but the pull out sofa was terrible. Location was brilliant but the room was a little dirty and the lifts were atrocious (normally I wouldn't even mention this on a review as I've never based my decision on the lift but this was ridiculous - try and get a room on a high floor or you'll be waiting a long time to get down in the mornings)", "Date": "August 29, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Great value - excellent location”", "Author": "weasle2", "ReviewID": "UR77013101", "Content": "Had read some bad reviews about this hotel but decided to go with it because of its location and just hoped that someone had written the review when they were in a bad mood! It turned out that the hotel stay was great - staff were very friendly, accomodation was clean and well equipped. We had 2 one night stays - one before the cruise and one after - and like one of the other reviews on the second stay we were upgraded to a suite on the 20th floor! I would stay at this hotel again and would definitely recommend this hotel to a friend.", "Date": "August 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane in Sunny Queensland", "Title": "“Stayed there on a personal recommodation and thrilled I did”", "Author": "Bobbiee", "ReviewID": "UR76249095", "Content": "We stayed at the Robson for 2 one night stop-overs and found the apartment fabulous. They have a separate bedroom with two large beds, lounge, kitchen and bathroom. On our second visit we were upgraded to a 2 bedroom suite - even better! The beds are super comfortable and every 2nd floor has a laundry to catch up with your washing. The kitchen has all you need to cater for yourself if you're staying awhile and sick of restaurant food. I ordered a meal from the restaurant downstairs and picked it up myself to have in our suite - the meals in the restaurant are huge; enough for 2 folk actually! There is a mini 711 type store across the corner. I don't think the internet was free so I used the Public Libary opposite which is free for an hour. Would definately recommend the Rosedale on Robson (which is actually in Hamilton St)", "Date": "August 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Great Value”", "Author": "mumof2_10", "ReviewID": "UR75672164", "Content": "I was a little unsure of this hotel as I had read some not so good reviews but crossed our fingers and went with it. What a great place! very friendly staff we arrived at 11:00 a.m. and our room was ready, it was clean and had enough space for 4 of us 2 beds in one room and a sofa bed in the sitting room the kitchen space was really all you need, unless your cooking a big meal. but for us worked great. Rosies was a good place to eat and a big thanks for storing our fish in your frezzer! the pool was a treat not many hotels with pools in Vancouver. We walked to most place the trolly tour stops across the street 3 blocks to sky train. the guest service desk sell tickets for almost everything! we will stay here again. Dont expect the westin on your beer budget!!", "Date": "August 17, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Warwickshire, UK", "Title": "“Adequate, not exciting”", "Author": "GillG_10", "ReviewID": "UR75327288", "Content": "On the fringe of the shopping area & attractions, walkable to Yaletowtn, Gastown & shopping. We had 2 bed suite, very gloomy and rooms on the tired side with very noisy air conditioning. Restaurant at hotel not brilliant, but there is a free continental breakfast, which they keep very quiet about, in one of the meeting rooms. OK if you're not spending time in the hotel.", "Date": "August 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lichfield", "Title": "“Good but basic”", "Author": "Neil61a", "ReviewID": "UR74092153", "Content": "The staff are friendly and helpful. The hotel furnishings are a little dated and the sauna didn't work. Internet charges are C$10 per day ...rip off. It is well placed for the Yaletown area and close enough to the Robson shop area...albeit the library area opposite the hotel is populated by down and outs in the evening. There is a nearby Budget car rental site which is useful", "Date": "August 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“A pleasure to stay at this hotel”", "Author": "kellybruce1", "ReviewID": "UR73903901", "Content": "We stayed at the Rosedale on Robson Street on three separate occasions during our Canadian trip for 26 nights. The check in was fast and easy and because we arrived early we could check in to our room straight away. The rooms were clean and exactly what we wanted with a good size gallery kitchen, nice size bathroom and everything was spotless. We could not complain about the housekeeping staff as they were fabulous and every staff member went out of their way to help us in anyway. I would recommend this hotel for any travellers who want a suite with a kitchen so they can make their own meals, especially at breakfast. The location of the hotel was perfect for us as we either walked everywhere or caught public transport.", "Date": "August 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Essex", "Title": "“Brilliant stay in Vancouver”", "Author": "EssexTripster", "ReviewID": "UR72723186", "Content": "Checked in and found the reception staff very helpful and were very pleased to hear we had been offered a free upgrade on our room. The room we were given was very large and spacious and the kitchen in the room was well equipped. The hotel had a good location with only a few minutes walk to the restaurant and shopping district and a short walk to the waterfront. Although the hotel was busy, we were never disturbed by noise and got a good nights sleep. We were very pleased with our stay at Rosedale.", "Date": "July 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Liverpool", "Title": "“Vancouver 2010”", "Author": "ThomoLiverpool", "ReviewID": "UR71609124", "Content": "I booked the Rosedale for 5 nights ahead of a two week stay with my family in Langley. The Rosedale is situated at the lower end of Robson, opposite the library. We found the location excellent, away form the hustle and bustle, but with acces to plenty of Food and drink bars. and located within easy walking distance to any attraction in downtown Vancouver. The hotel provided us with a Suite, kitchen/living area and large bedroom. Conditions were very good, view was perfect, all hotel people treated us well, and gave us an excellent service. For us it was the idea hotel, location and gave us time to relax before we met up with the family for the next two weeks.", "Date": "July 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Good central location”", "Author": "Ozgypsay", "ReviewID": "UR70918495", "Content": "This hotel met our needs; central yet still quiet location in Vancouver, spacious room, good housekeeping, and reasonable rate. Slightly annoying that we had to pay extra for Wifi and it was a terrible connection. Think we're getting our money back on that. No frills, but did the job nicely.", "Date": "July 14, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Nanaimo, Canada", "Title": "“Sofa bed great, Room okay, but ...”", "Author": "BuccaneerDave", "ReviewID": "UR70831193", "Content": "My impression and experience at the Rosedale almost mirrors sengi's review of July 12th. This was our second stay and the room is okay but needs a really good cleaning. On the surface everything was presentable but once you started looking closely it was in need of really thorough scrub. I slept on the sofa bed and was seriously not looking forward to it however surprisingly the bed was very comfortable (head at the foot end though) and I managed a fairly good sleep on it. The location is excellent especially if you are attending any events at the Garage or BC Place. All in all it's not a bad property and certainly worthy of consideration but only if the price is right!", "Date": "July 13, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Airdrie, Canada", "Title": "“Won't be back to stay here anytime soon...”", "Author": "INF0_4_u", "ReviewID": "UR69790880", "Content": "Unfortunately our stay at the Rosedale in June 2010 was a huge disapointment. We expected it to be much better than it was. Especially because of the cost. They are an affiliate of a timeshare company in which we frequently use and they are supposed to have upgrade suites, so that was our reason for choosing the Rosedale. We requested a suite for 4 adults & they gave us what they told me was \"the most updated 2 Br. Superior Suite\" they have. The room decor was by far the most dated of any hotel I have stayed in the last 15 years. All the larger appliances were loud & old, the tv was small & out of date. We felt like we were staying in a dingy hotel on the wrong side of the tracks, rather than a nice suite in downtown Vancouver. We also found \"Rosies\", the pub downstairs to be a disapointment as well. They charge for internet service & as well as a nightly fee to park. The location of the hotel was good but for the price we defintely felt ripped off.", "Date": "July 5, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Location": "5", "Service": "4"}, "AuthorLocation": "new zealand", "Title": "“location awesome”", "Author": "poppynz", "ReviewID": "UR69452684", "Content": "This suited our family of four perfectly. Comfortable (although bed on the firm side), with an awesome kitchenette. The huge floor to ceiling windows were just lovely to be able to see whats happening on the outside and let the natural light in. We were able to walk almost everywhere from here. First day we strolled down to hire bikes and biked the seawall and stanley park, hop-on hop-off bus just a 2 minute walk, library opposite, food places just surrounding the hotel. The pool and spa are clean and inviting with glass walls around the spa. We hired a rental car from budget - just a 2 minute walk away. Walked to Canada place to catch the float plane, walking to downtown shops and Canada Parade. All so convenient but without the noise.", "Date": "July 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Wisconsin", "Title": "“Nice place, great staff, convenient...”", "Author": "GBCheesehead", "ReviewID": "UR67896522", "Content": "Nice place, great staff, convenient location.", "Date": "June 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Northern Ireland", "Title": "“Great hotel, great location”", "Author": "tinkerbell1000", "ReviewID": "UR67574589", "Content": "I've stayed in the Rosedale on Robson four times now and haven't yet been disappointed. We booked with Canadian Affair each time and got brilliant deals. My most recent stay was with four other adults. We'd booked a double and a triple suite, knowing that the sofa in the living room could be converted into a double bed in the triple suite. When checking in we were informed that the triple room had been upgraded to a two bedroom suite, which was fantastic for the three sharing that suite. The decor is slightly dated, but everything is clean and tidy. Each suite comes with a living room, with tv, desk and phone. The kichen is fully equipped with a cooker, microwave, kettle, toaster and coffee maker, right down to oven gloves and washing up liquid. Very handy having the option to cook your own meals. There's a wide range of toiletries provided in the bathroom. During our last stay our bedroom had one large double bed (on a previous stay we had two doubles), a tv, desk and phone. There's also a small built-in wardrobe. The air con / heating system is easy to control. The hotel has a small indoor pool which I've never actually used, despite my good intentions! There's a lovely roof garden for chilling out in, and the hotel bar / restaurant, Rosie's, is great for breakfast, lunch and dinner. We ate breakfast there most mornings, which cost about $25 for two for two cooked breakfasts, fruit juice and coffee. The hotel is very handy to Downtown Vancouver. The shops, bars and restaurants are a short walk away. The new Canada Line Skytrain stations of 'City Centre' and 'Yaletown' are reasonably close to the hotel. We even walked, with all our luggage, to Canada Place to board our cruiseship, and also took a leisurely strole to Stanley Park. Fully intend to return to Vancouver again and can't imagine staying anywhere else.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“Well Priced, Good Service, Great Location.”", "Author": "Calvan88", "ReviewID": "UR67050215", "Content": "My wife & I stayed 4 nights at the Rosedale on Robson after completing a Sydney to Vancouver cruise. As we got off the ship at 9.00AM and were in the hotel lobby by 9.15AM, we were just expecting to drop our bags and go off until check in time, however, they checked us in straight away, no waiting around. The room(s) were large, clean with a small galley kitchen, perfect for making breakfast. Each odd numbered floor had a small guest laundry with one washer and dryer and you can buy the soap powder from Reception for a $1 a box. Hotel location is just a few blocks from the central shopping in Robson street. There is an IGA Supermarket with good pastry, breads and deli selection and a liquor store about 250 metres in Robson. Also, the area is well catered with small restaurants and take away food shops. There is also a reasonably priced Irish restaurant & pub with a good menu inside the hotel, which is great if you get back from a hard days sightseeing. Finally, although the check out time was extended to 12 noon (complimentary), they extended it again to 6PM if we paid another $80.00 which I thought was a great offer as our flight didn't leave until 8.30PM. Having stayed at the Pacific Pallisades on our previous trip, I thought the Rosedale was a great find and would stay there again without hesitation.", "Date": "June 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Nice Stay”", "Author": "ruby1026", "ReviewID": "UR65499596", "Content": "Good value for a spacious room and had a nice stay, will return", "Date": "May 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "chapel", "Title": "“the very best”", "Author": "heathchapel", "ReviewID": "UR65475403", "Content": "Our family of 6 using 3 rooms with ages of 70plus 2 /30 and 2/50s all agreed this hotel had it all rooms great facilities great . The people on the reception very helpful would go back again. The Rosies at the hotel we found very expensive for food / drinks also the bar shut dead on 23-00hrs.Try Earls in downtown for a good meal at a good price", "Date": "May 27, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "surrey", "Title": "“Comfortable Hotel and perfectly Situated for Everything”", "Author": "SurreyCherry", "ReviewID": "UR64743757", "Content": "My husband and I stayed here last week before and after a 5 day Alaskan cruise. We found it very central for visiting all the tourstist sites and restaurants and shops and very comfortable. Having the small well equiped galley kitchen was a bonus so that we could make coffee in the early hours, and we were very happy to return there for another night before our flight home. The staff were helpful - even finding us a room at 8.30 a.m.as one was available although the official time is 3p.m. We ate our breakfasts in Rosie's restaurant connected to the hotel but enjoyed exploring the many restaurants in theYaletown area close by. Try the new Skytrain, installed for the Winter Olympics, from the airport to central Vancouver. Cheap and very efficient.", "Date": "May 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Wilmington, Delaware", "Title": "“Small rooms, but great location\"”", "Author": "kwitty", "ReviewID": "UR63686868", "Content": "We just had a short stayover in Vancouver, and wanted to see the sites..so Rosedale fit that description....we weren't looking for luxury or service... Small rooms, clean and neat..that's all you can say...easy walk to Yaletown, catch the ferries to Granville...or do the sites...", "Date": "May 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Nanaimo, Canada", "Title": "“unhelpful staff, dirty, dated, overpriced”", "Author": "runningm0m", "ReviewID": "UR63234291", "Content": "I'm not really fussy about hotels and have stayed in several which have not had great reviews and been ok with them but this one was so bad I had to write something. I stayed here with friends for the BMO marathon. One of our group had stayed before and warned against it but we had friends in another suite so we stayed here to be with them. We paid for a room with breakfast but discovered breakfast started too late for us. When we politely pointed this out and asked if there was anything they could do for us instead, we were met with blank stares and a shrug of the shoulders. We called up to our friend's suite 8 floors directly above us and received a $1.25 + tax charge because their suite was a timeshare and was not part of the hotel. We had no warning of this when we went through the operator however and the staff would not remove the charge even as a gesture of good will. Our room was dark and was not helped out by the dark and dated furniture. There was visible dust everywhere. The bathroom even had hair in the corners and stains on the walls near the toilet - yuck! There were 3 of us in our room, for which we were charged an extra $25 but we had only enough towels and cups for 2. I even had to call down for a blanket for the sofa bed because we only had one, which was almost as thin as a sheet. The sofa bed itself was so old and worn that I could feel the frame through the thin mattress. I'm under 130 lbs so it couldn't be my weight. When we left, one of the elevators was out of service and we ended up walking down five floors with our luggage. Our night here was over $300. If you're going to spend that much to stay in Vancouver, don't spend it here!", "Date": "May 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Victoria BC", "Title": "“I will never stay here again!”", "Author": "ilovemauibigtime", "ReviewID": "UR62438991", "Content": "I am not a picky person, I very rarely complain, but I feel that I was completely shafted by this hotel! I have stayed at many hotels with a so/so rating, and some with amazing ratings. This one, for over $200/night I was shocked!!! On the hotels actual website, they show pictures of fancy bedding, nice floors, comfortable beds etc, but what I got was completely the opposite. It was old furniture, old beds, hard as rock mattresses, terrible lighting. So, I called and asked if we could move to a different room. The person I spoke to was extremely rude saying there was nothing he could do for me and the rooms that are advertised on their website are on floors 20 and up! I was shocked that he wouldn't even take the time and say, \"Let me see what I can do and I'll call you back...\" It was an absolute \"NO, Nothing I can do about it\" attitude which blew me away. I will be taking my $200/night and spending it at the Sheraton Wall Centre where we are treated with respect! Oh...and they charge you for internet!!!", "Date": "April 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "B.C.", "Title": "“Great Stay!”", "Author": "iminlovewithmexico", "ReviewID": "UR61240848", "Content": "Choose this hotel because of its location, hockey ticket packages and a recommendation from family. Staff was friendly and the Rosedale has a great central location. Would stay again in a heart beat! One thing about ordering to your room though is make sure you read the fine print - they add a 15% gratuity on to the price of the food so make sure you don't tip unless you want them to have more then 15%.", "Date": "April 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Central Coast", "Title": "“The Rosedale on Robson Hotel was elegant and classy.”", "Author": "kerrieluv", "ReviewID": "UR58574311", "Content": "We stayed for 5 nights at the Rosdale on Robson Hotel and found it clean and comfortable and the staff were very friendly and helpful to us regarding tours, etc. and getting around the city. We had lovely views of the city and were near lots of attractions and transport.", "Date": "March 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Lancashire UK", "Title": "“Wifi doesnt work in most rooms/areas of hotel, very noisy, double glazing awful!”", "Author": "maritza_gee", "ReviewID": "UR56950578", "Content": "The wifi only really worked in reception, and in corridors near the lifts, and because the hotel have an external contractor to provide it, they weren't very helpful when i complained, on numerous occasions. The hotel room overlooked the street, and the double glazing didn't work, so i ended up sleeping on the sofa as this was in the other room; Again, as they were full they didn't really care, even admitting that all the rooms are noisy anyway. Its a cheap, budget hotel, not geared up for businesses.", "Date": "February 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Christchurch", "Title": "“Good location”", "Author": "AliKatChristchurch", "ReviewID": "UR53991152", "Content": "We stayed at the hotel on two seperate occasions during our holiday and both times the staff were very helpful and friendly. The rooms are clean and tidy and it was good to have the kitchen as we had breakfast in our room before heading out for the day. It was also really handy to have laundry facilities available.", "Date": "January 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Hertfordshire", "Title": "“Good value and location”", "Author": "CTSO", "ReviewID": "UR51618024", "Content": "We had a one bedroom suite that had all one could want. Freshly decorated and new carpets. This hotel is great value for its location.", "Date": "December 21, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Wevelgem, Belgium", "Title": "“Very satisfied!”", "Author": "Pankotor", "ReviewID": "UR49691546", "Content": "Great hotel. Very good location, friendly staff, good restaurant. Would go there again in a heartbeat!", "Date": "November 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "2"}, "AuthorLocation": "British Columbia", "Title": "“Great spot for extended stay.”", "Author": "Soonie68", "ReviewID": "UR48376979", "Content": "This hotel is a great spot for extended stays. It is an all suite hotel and in my room, I had an oven, microwave, fridge and stove top. Perfect for the traveller who wants to save money on dining out. It is in a great location on Robson Street close to theatres and sporting events. It is a bit tired and could use some updating, plus the bed was not the most comfortable, but for the price and location, this is a great spot.", "Date": "November 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Kamloops, Canada", "Title": "“Location best thing about the Rosedale”", "Author": "cynlouhoo", "ReviewID": "UR48142237", "Content": "This was our 3rd time staying at the Rosedale. The first time we were in a standard suite and we quickly determined we'd never do that again! The second time we spent more money ($30 I think) to stay in a Superior Queen suite, which was definately better.....this time we also opted for the Superior Queen, but we were a little more critical. In a nutshell, I think for the increase in price they should offer up better beds...the beds are old and uncomfortable (and squeeky) and are exactly the same as the standard room beds. The livingroom furniture is uncomfortable and ugly and the TVs are old and very small. There is only one ice machine on the 2nd floor....we were on the 20th floor....they do have ice cube trays in your freezer, but the ice had a disgusting flavour, probably from the ice tray soaking up various food smells from all the previous guests (ewww). The towels in our room were ugly mismatched brown things and not very large....and only a set of 2 (we probably could have requested extras). The bathroom is tight and needs updating. I had forgotten how the shower curtain blows in at you and that there isn't a nice curved shower rod. Also, you'd think they'd give you at least one housecoat in an \"upgraded\" room. In a nutshell, the view will be better in a superior room, but not much else.....and, if you are there for a concert you will not be hanging in your room looking out the window all day. Oh yeah, the continental breakfast ended at 9:30am the day we were there.....the morning after a concert is not the time to have to rush for breakfast! Building is not terribly secure either....don't have to use your room key to get from parking area or in the elevator. If what you want is great proximity to GM Place or BC Place at a relatively decent price, then you'll probably be happy here. If you are fairly picky (like I am), then for sure spend the $$ for the superior suite, but be prepared for it not to be \"superior\".", "Date": "October 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Middlesex, UK", "Title": "“Great central location...”", "Author": "EmmaDurnford", "ReviewID": "UR47628464", "Content": "We stayed for 4-nights at the Rosedale on Robson from the 22-26 August 2009. This was the beginning of a month long independent tour of BC and Alberta - mostly staying in small B&Bs - and we were not disappointed with our first accommodation, the first of two hotels out of the total of nine places we stayed. I was a bit concerned prior to our arrival by other TA reviews regarding the refurbishment (or lack of) of the rooms but my concern was unfounded. We were allocated room 508 - a refurbished suite for two. The whole of the 5th floor appears to have been refurbished. The space was brilliant with a separate bedroom with kingsize bed (spare pillows and blankets in drawers). There was a galley kitchenette (fridge/hot plates and sink) with tea, coffee and milk which was very useful for a 'cuppa' in the morning. The bathroom was very clean with good toiletries, towels and flannels. There was a living area with writing desk and TV and a second TV in the bedroom. The rooms were serviced every day. The hotel entrance is actually located just off of Robson Street and I was expecting some noise as it is in the heart of Vancouver (there is also a firestation a few doors down). However it was fairly quiet, especially as the rooms are double glazed. As I am married to a fresh air addict the window was opened a little each night and despite being a light sleeper I had no problem, although some people might want earplugs to be on the safe side. The location is perfect for accessing Robson Street for shops (30 seconds!), Gastown (10-minutes walk) and Canada Place (15-minutes walk). There is a cash-point for Visa and Mastercards situated in the 7-11 on the corner of the street which is safe and has no charge for Nationwide Visa holders. There is a pool and jacuzzi along with some running machines etc. on the gound floor (to the left of the reception) which we did not use but looked clean etc. Breakfast is not included but Rosies is situated in the hotel and is good value. Our recommendation however is to have breakfast in 'Cafe Vancouver' a turkish cafe situated on the opposite side of the road next to the firestation. The coffee is superb and they have free WiFi access. We ended up there each morning having cinnamon muffins and pastries whilst catching up with emails. In fact that is the only downside of the hotel - is a lack of free internet access. The only way to access the internet was to register with an external company and pay by the minute. In this day and age I expect all big hotels to have internet capacity. However this is a small down-side and I would thoroughly recommend this hotel to all.", "Date": "October 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Reno, NV", "Title": "“One draw back”", "Author": "TravellingMan37", "ReviewID": "UR46388516", "Content": "I stayed at the Rosedale for 5 nights in Oct. The hotel is nicely located for visiting Vanc. The customer service A++ and the rate was good considering $99 night booked through expedia. Major drawback for me was the bed. It was extremely hard felt like I was sleeping on the floor. Asked for room change to see if bed was softer elsewhere. It wasn't got another hard bed. I stayed on the 9th floor #913 this side of the building is much more quiet than the #907 that I was switched to hoping for a softer bed. Overall I would highly recommend this hotel. A couple of things to add would be try to get up as high as you can due to the street noise and if the hard bed is an issue take the mattress from the sofa sleeper bed and put on top of your bed.", "Date": "October 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Copenhagen", "Title": "“This is a 3-star hotel -no more !”", "Author": "Pudsig", "ReviewID": "UR43404612", "Content": "This is an average hotel with an excellent location. Appears to be worn down and maintenance is apparently not a priority. The restaurant Rosies (read pub...) has too high prices compared to the standard. But rooms are nice and clean but with very noisy aircon.. The roof-garden (on 2nd. floor) is certainly not very charming - but of good use as a small refuge for smokers - which is a positive thing.", "Date": "September 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bournemouth", "Title": "“Excellant Hotel, except for the HARD beds!”", "Author": "hughcr", "ReviewID": "UR43371375", "Content": "The only bad thing I can say about the Rosedale is that the beds are HARD! - Firm does not come into it. Saying that, everything else was excellent. The staff were helpful and friendly (well, except for the young lady on Sunday the 20th, in the morning - she needs a personality transplant!) The rooms were kept clean, with a great nod to being green, the location could not be bettered, and Rosies Bar gave good food and great service, quite reasonably.", "Date": "September 21, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Florida", "Title": "“Location, Location, Location”", "Author": "alanaher", "ReviewID": "UR42196900", "Content": "Obviously, good location, just off Robson Street on Hamilton. Rooms are dated and studio is small. Carpets need to be replaced with tile, so that when cooking in close quarters of mini-kitchen, food stains can be easily cleaned up instead of staining carpet that has been there for far too long. Concierge helpful. Close to trendy Yaletown and old-town Gastown. Hop-on, Hop-off bus pick-up just across street by library - good for viewing city and finding out where everyting is though some buses need some shocks and brakes. Budget Car Rental just up the street from library. Rosedale high-end shopping district in walking distance. Decent pool and hot tub. Rosie's restaurant on grounds seemed pricey for breakfast. McDonald's just across Robson street good for take-out breakfast; a bit seedy to eat in. Enjoyed Milestones in Yaletown for drinks and dinner. Casino behind football stadium - not big, but lots of slots.", "Date": "September 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“A good hotel depending on your room...”", "Author": "darnley2005", "ReviewID": "UR41443552", "Content": "I have read the other reviews on trip advisor and have noted the comments regarding the staff at the hotel. I'd like to start by saying how great they were from the front desk staff to the woman that cleaned the room. Always helpful and friendly I felt that they went out of their way to make sure I had a good stay. The rooms however, are something different. The reviews here clearly reflect what rooms you are assigned at check in. My first room had a terrible smell of smoke. I was therefore moved to another on the second floor. The second room was right above the bar and quite noisy. As it was match day this may have contributed to this. I was therefore moved to another room on the fourth floor. It was much quieter and a much nicer room which had more of an apartment feel. Both rooms on the second floor had no window for the lounge and felt slightly pokey. My room on the fourth floor had windows in both the bedroom and the lounge and felt much more spacious. Something definitely worth considering a request for at check in. In short a great hotel when you get the right room but get the wrong room and its awful. However, should you need to move rooms the staff couldn' be more helpful - so don't be afraid to ask... The staff at this hotel are their greatest asset - as a business traveller I stay in a lot of hotels and the staff here are amongst the best.", "Date": "September 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Wales", "Title": "“Great price for centrally located hotel.”", "Author": "Kirstied82", "ReviewID": "UR40738514", "Content": "The room was a lovely size, with a kitchen/living area seperate to the bedroom,which was very handy with four girls travelling a great bonus. Laundry facilites are excellant, pool was really nice to have a swim. The staff could not do enough for us. highly recommened.", "Date": "September 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Portland, OR", "Title": "“Great Location, Comfortable Room, Friendly/Helpful Staff”", "Author": "pdxian", "ReviewID": "UR40212247", "Content": "This is a great hotel. It is right in the middle of everything in downtown Vancouver. It was a great \"home base\" from which to go sightseeing during the day, and then to come home to get ready to experience the night life in the evening. Very close to the art gallery, shopping, bars/clubs, and restaurants. The room I stayed in was very comfortable with separate living and bed rooms and a kitchenette in between. The views were spectacular (I was on the 17th floor). During my 3 day stay, I always felt \"at home\" when coming back to the room after a long day. The staff was very friendly and helpful. They were able to help me plan my sightseeing around town both with transportation and tips on where to go and where not to. Overall, this hotel helped to make my first trip to Vancouver a great one. I recommend this hotel to anyone looking to be in the heart of it all, who still wants the comforts of home!", "Date": "September 8, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "ny", "Title": "“Disgusting”", "Author": "vacationer048", "ReviewID": "UR38547827", "Content": "Disgusting I just returned from 7 days at the Rosedale via PTP Destinations. The room ( a suite) looked NOTHING like the pictures. It was dirty and dingy. The bathroom was moldy and filthy. I had to have them change the moldy shower curtain. The floor's veneer was peeling and they put down area rugs to cover it up which looked like they needed a good cleaning. The coffee pot had grinds in it from past occupants. The garbage cans were yucky. When I complained I was told that this is the only room available through PTP Destinations and that they put certain rooms aside for them. Probably the ones they don't want to clean or upgrade. When I spoke with a PTP representative, which is located aross the street from the Rosedale, the person, Cheryl Arnold, (she told me that she's the manager, although her business card states \"Director\") was so disinterested in my concerns and basically said too bad we are not going to locate a clean room for you at the Rosedale. Her response was also that there are \"very few timeshares in Vancouver\", so make do.She was so bored with my complaints about the room that I felt like I was keeping her up. DO NOT STAY AT the Rosedale and DO NOt go through PTP Destinations!! .", "Date": "August 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Washington", "Title": "“Worst hotel experience EVER!”", "Author": "rockyandholly", "ReviewID": "UR37625667", "Content": "Where do I begin? My family went to Vancouver for a Holiday and we were expecting a decent/nice hotel, friendly staff, and a good stay...but we were very wrong. First off, the hallways reeked of fresh paint while we were walking to our room, but the paint still looked old and dull. The rooms are full of cluttered out-dated furniture, a kitchenette that would be suitable for a 70s mobile home, uncomfortable beds, gross shower curtains, and not to mention the annoying heaters that come on every 5 min and make rattle noises that keep you up all night long. To make it worse, at 8am on our day of check-out, housekeeping was knocking on our door asking when were leaving so they could clean the room. 8am in the morning? Come on! The staff are dishonest and have no clue what good customer service is, since after we left our credit card was charged hundreds of dollars more after we fully paid for our room. We got the money back after a long battle, but it sure ruined the rest of our Holiday. We only spent one night at this hotel, and one night was enough to assume that this hotel has no class and doesn't deserve anyone's business.", "Date": "August 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Columbia, s.c.", "Title": "“Are You Kidding Me?”", "Author": "adzonni", "ReviewID": "UR36987392", "Content": "Seedy and seamy. Location is funked. Ready for this? : it's caught in a 1991 time warp. Breakfast roon has 1970s style conference chairs massive stains on the yuckie carpet there decaf coffee was packets nothing good for breakfast beds pretty hard like a 1995 HoJo AC uni t? sofa bed blocked bathroom access when pulled out kitchenette looks like something out of a bad 1980's movie vending machines funked adjoining restaurant is dark and hmmmm.... one bathroon for 5 people in a suite first time ever for that WHY DO PEOPLE LIKE THIS PLACE??? Plus the skinny on Robson Ave was that it's a real great world class street Get ready for the opposite ! also you pay for wireless at the hotel COME ON!", "Date": "August 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "calgary", "Title": "“Decent”", "Author": "sharknes", "ReviewID": "UR36948638", "Content": "This place is a great location and decent value. No real thrills but the staff is friendly and close to everything", "Date": "August 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Seattle", "Title": "“Good Location - Shabby Interior”", "Author": "Biztravler", "ReviewID": "UR36807780", "Content": "Location is great, service was excellent, however the interior is sadly dated and in need of a refresh. The first room I was booked in smelled strongly of smoke, so if you are sensitive be sure to request a room on a floor that has always been non-smoking. Kitchette may be useful to families, not particularly useful for a business traveler. For the money, there are better options in Vancouver.", "Date": "August 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Las Vegas", "Title": "“excellent location”", "Author": "sauquoitr", "ReviewID": "UR34761185", "Content": "Clean, comfortable unit with an excelent location--near lots of sights to see. Parking is on a fee basis", "Date": "July 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Home away from home”", "Author": "SAGreat09", "ReviewID": "UR34290221", "Content": "This is a hotel that understands overseas tourists - and I'm sure locals as well! We stayed here three times during our 4 week stay in Canada. Arriving via Japan early in the morning and were welcomed and given our room key. We returned twice. The rooms are more than adequate and we loved Rosies where we joined the locals in their support for the Canuks. We would return there any time.", "Date": "July 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Melbourne, Down Under", "Title": "“Great 8-night stay”", "Author": "mmont69", "ReviewID": "UR33855508", "Content": "This review after an 8-night stay should have more value than after a one-nighter or weekend. Suite: comfortable and roomy, big wall-to-wall and floor-to-ceiling windows gave huge spacious feel when drapes pulled back. Living room with one of the two TV's in the suite was handy when the wife didn't share my interest in the NBA and Stanley Cup finals. The door to the bedroom could be closed so as not to disturb madame's viewing of her chosen channel. Galley kitchen (kitchenette) was sufficient for our self-catering evenings-in. Huge fridge. All staff most helpful, cheerful and courteous - from chambermaid, dining room to front desk. Services made use of included the laundry and safety deposit box. Breakfast - continental, part of the package - basic but sufficient. As far as we were concerned, the most significant event of our stay occurred at breakfast one morning when a lady stopped by our table and introduced herself as a director of the hotel. Not only did she show a keen personal interest in ourselves, but she was interested to hear our answers to many questions she asked us about \"her\" hotel and obviously placed a good deal of value on them. We were not only impressed by the fact that this extremely busy lady spent some of her precious time in making herself known to us, and paying us the respect of valuing our answers to her questions. As if the first encounter wasn't enough, later in our stay she stopped by at breakfast once more and chatted and asked more questions, keen to know if and how our opinions had altered since our previous talk. Very impressive indeed. Onlt 3 stars given for Location, since for my 75-year-old legs the hotel is located a couple of blocks too far from the main CBD, though obviously it must be fine for the theatre and stadium. All in all, a most satisfactory stay.", "Date": "July 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Brisbane", "Title": "“The Safe, Friendly, Comfortable, Convenient Spot To Rest”", "Author": "Tourmite", "ReviewID": "UR32254769", "Content": "For the past 9 years I have been the Queensland Leader of Groups to Canada/Alaska. Rosedale on Robson, Vancouver, British Columbia is our first port of call after arriving into the Airport after a long flight from Australia. This hotel is so safe, friendly, comfortable and convenient. We stay here 5 nights out of 23 during our tour and I cannot genuinely speak highly enough of the service given by all facets of the hotel staff to all my travellers. Catherine I Gear, Managing Director, Cross Country Tours, Brisbane, Australia www.crosscountrytours.com.au", "Date": "June 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Queensland, Australia", "Title": "“Always a good place to stay..”", "Author": "Ann C", "ReviewID": "UR31533716", "Content": "This is our second stay here, first was about 7 years ago and this time I think if anything the hotel was better than ever. It's an all suite hotel which gives just that extra space to move around, having a small kitchenette is really handy after a day out sightseeing and for breakfast too. There was a great grocery store, called Market Place not that far away for provisions. Not that far from Canada Place for cruise ship departures and all other shops etc within easy distance. Stanley Park was quite a way away but we still walked there.", "Date": "June 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "British Columbia", "Title": "“Fun Girls Weekend”", "Author": "ChelseyWol", "ReviewID": "UR30767691", "Content": "Four of us (Two adults, one teenage and one 6 month old) traveled to Vancouver for my best friend Birthday to watch a Canuks game in March. We chose to stay here because it's close to Robson, and close to GM Place. We had a room that had a living/kitchen area with a Hide-A Bed, and then a \"master\" bedroom with a King sized bed. This was perfect for us! There was a roof top balcony off the master bedroom. It was rainy the entire time we were there, so we didn't get to use the garden area, but it was really pretty to look out on. We REALLY enjoyed our stay! The cleaning ladies were great! They saw that it was a room full of women when we passed in the hall our first morning there, and they immediately, without being asked, left extra shampoos, soaps, and towels. The restaurant downstairs was very nice, the staff was friendly, and it was easy to get a cab when needed. Because of the great location, we mainly walked as we were pretty close to everything. We are already planning next years trip, and can't wait to stay here again!", "Date": "May 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Perth Western Australia", "Title": "“Great Hotel”", "Author": "Cel79", "ReviewID": "UR30485333", "Content": "We stayed here for 1 night before our cruise in the 2 bedroom suite & then again in the same suite for 1 night after the cruise, I have no complaints what so ever. They let us check in at 9.00am which was fantastic, the restaurant Rosie's next door was great, they also have a indoor pool/hot tub as well as a gym. The rooms were very clean & spacious, the staff were polite & helpful. Would definetly reccomend!", "Date": "May 21, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Dubai", "Title": "“Great location but staff attitude really lets it down”", "Author": "AlLeGrand", "ReviewID": "UR29686542", "Content": "Four families travelled together to attend a wedding. Arrived near midnight after a long, delayed flight from London and check-in staff could not have been more unhelpful if they tried. No assistance with bags, no directions to elevators, floors, amenities etc. Questions were either ignored or met with mumbled replies. \"Suites\" were not small, they were tiny, particularly the bathroom which is definitely not for the claustrophobic! The complimentary breakfast was a joke and unless you were up very early, the muffins ran out very quickly. On the plus side, the rooms were clean and kept so throughout our 12-day stay. The bar & restaurant staff beat their front-of-house counterparts hands down being both friendly and efficient. Breakfast in the restaurant was excellent and reasonably good value. The hotel is conveniently located with plenty of shops, bars and resataurants and the football stadium all within easy walking distance. In fact, we walked just about everywhere we went due to a) the ease of navigation, b) the fantastic weather and, c) the guilt of over-indulgence making us want to take some exercise. Gastown, Chinatown, Stanley Park and many other areas of interest were all within an easy 20-30 minute stroll and when required, taxis were easy to find. Overall, it was probably worth the money for the location but the overall experience was definitely spoiled by the surly staff. Vancouver, on the contrary, is by far the best city I have ever visited.", "Date": "May 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "uk", "Title": "“An positive experience all round.”", "Author": "docajenk", "ReviewID": "UR25866505", "Content": "Having read some of the reviews on this accommodation we were a little concerned that it might be out dated and basic. On arrival we were pleasantly surprised. We were allocated a refurbished one bedroom suite (room 301). All the furnishings were tasteful and looked new. The lounge / kitchenette are compact, but had a very homely feel, the bedroom was a good size and had a rooftop garden which was very pleasant. The suite was very clean and well equipped. The pool / hot tub / steam room / sauna were all in working order and we enjoyed using them each day. If you are on a timeshare exchange / owner then you are able to have free DVD rental / games / books / internet access. The location of the hotel is perfect, just on the outskirts of Yaletown and walkable to all the sights in Vancouver as well as having lots of trendy bars / restuarants within 5-10 min walk. The staff were all very friendly and helpful. My only advice is make sure you request a refurbished room as the others are dated and in need of attention.", "Date": "March 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Salmon Arm", "Title": "“Very Good Overall”", "Author": "DougHeather", "ReviewID": "UR25227886", "Content": "Stayed for one night on business Feb 24 so i didn't have a great opportunity to see all the amenities of the hotel. Room was very nice, upgraded to a suite which I appreciated. The room was spotless and well appointed with a great TV in the living space and a smaller TV in the bedroom. The bathroom was small and a bit dated but the shower was great with lots of pressure and heat. The King bed was a little firm for me but that is personal taste. Lobby was good, staff were helpful and the attached pub had a great atmosphere. The only real downside was the continental breakfast which was quite possibly the lamest I have ever experienced. If all you want is toast or a Danish or a bowl of cereal then it will work, but the area is small and right beside the convention halls which made for some serious overcrowding. the location of the hotel is good with fairly close access to everything downtown. All in all well worth the money and a good place to stay.", "Date": "February 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“Spacious, clean and comfortable”", "Author": "worldofviolets", "ReviewID": "UR24976280", "Content": "Stayed at the Rosedale on Robson for 8 nights in January 2009 with a friend. Room was very clean and spacious and the beds were huge and comfortable. There is the option of having your sheets changed daily if you wish. The aircon unit was a bit loud but didn't cause me any problems sleeping. I couldn't get the wifi signal in my room but the wifi in the lobby was free. The pool was small and the steam room looked dirty and old, but the sauna was excellent as was the hot tub. The washers and dryers are on every second floor and I had to look on 5 different floors before I found a laundry room where both of them worked. The shampoo and moisturiser provided in the bathroom was good quality, which surprised me! Although the apartment has a kitchen, we didn't use it other than to make tea in the morning but it was useful to have a fridge for milk. The staff at the front desk were always very helpful when I had questions about transport.", "Date": "February 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Moray", "Title": "“I just loved this hotel”", "Author": "MorayTraveljunkie", "ReviewID": "UR23894871", "Content": "Coming off the flight from Toronto we were surprised to find that the Rosedale is no longer on the list for the shuttle from the airport. We had booked and paid for the transfer in January and sometime after that the hotel had been removed. Since we had paid for the transfer it was cheaper to take the shuttle to the nearest hotel and get a taxi from there, which we did. The driver pointed us in the direction of the hotel and, being stiff from the journey, we decided to walk. After walking for some ten minutes, with two suitcases and hand baggage each, we decided we had had enough exercise and hailed a taxi. It turned out we were walking in the wrong direction! On arriving at the hotel a porter was waiting for a taxi and having comandeered ours asked if we wanted assistance in with our bags. We accepted gratefully and he walked off without the bags! Perhaps our Scottish accents confused him. After that everything went smoothly and we had a lovely stay for six nights in this, the third hotel of our Canadian trip. Registration in the small, basic, reception area was speedy and our suite on the fifth floor almost opposite the lift. There were 2 lifts, both in good working order and we never had to wait more than a minute for a lift. The suite itself was a little shabby but spotlessly clean and very comfortable. The lounge area that you entered from the corridor had no outside window but the lighting was adequate and one whole wall was mirror giving an even more spacious feel. The seating was comfortable and the television was there along with extra storage. We also found the most comprehensive hotel guide of all the hotels we have stayed in. The TV channels were listed, all the hotel amenities of which there were plenty, and advice on where the nearest convenience store and churches were. I can't now remember what all was in that guide but I do remember being most impressed at the time. A little galley kitchen led through to the bedroom area which had two huge beds. I was starting to get used to the size of the beds in Canada which all seem enormous to me. Lots of storage in the bedroom and a wardrobe for hanging clothes contained an iron and board. The kitchen had everything I needed and was equiped with washing up liquid and some basic tea, coffee and sugar. The little convenience store at the hotel entrance supplied all my needs for the week and the prices seemed quite reasonable to me. The bathroom/shower area was bright and spotlessly clean and there was a washing machine and drier on every second floor. I used both to freshen up my wardrobe for the next leg of our trip. Downstairs, off the reception area, is Rosie's restaurant. The food was good, the service cheerful, friendly and efficient and the prices reasonable and we ate there several times. The swimming pool looked enticing but I was always so busy either writing up my journal or planning/looking out the itinerary for the next day that I didn't get round to using it. We did chat to one family who shared the lift with us on their return from a swim and they said the water was quite cool but the pool area lovely and warm. I frequently do this, pick a hotel because of its pool then don't take the time to go for a swim! I loved this hotel. I felt very comfortable here and would go back. The only drawback was the 10 minute walk to the Chinese area or the 20 minutes it took to walk to the harbour area but this was hardly a drawback as we needed the exercise and we didn't even bother to investigate public transport or take a taxi which was not expensive. I loved Vancouver. We travelled on the Sky Train, a Float Plane, and the harbour ferry which was so well organised (enter one side, exit the other, waiting times never more than half an hour and displayed on a board in the waiting lounge) We were advised to get an all day transport pass for $8 and this was well worth it. We took a circular trip on the Sky train to see the suburbs, transferred directly to the harbour ferry where there were buses waiting for the ferry at the other side to take you to places like the Capilano Suspension Bridge and Grouse Mountain. All this and the return trip for $8. Well worth it! A super week in lovely comfortable accomodation!", "Date": "January 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Whitford, Auckland", "Title": "“Overnight stay after long Flight.”", "Author": "Cheezel", "ReviewID": "UR21953366", "Content": "We overnight stayed at this hotel after a long flight. It was well located and comfortable for our purposes. Would recommend it for convenience of location and proximity to attractions.", "Date": "November 17, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Wide Open Future", "Title": "“A Good Place to Stay in Yaletown”", "Author": "Three60", "ReviewID": "UR21849698", "Content": "We stayed for a week at the Rosedale. It is well located to take advantage of all of the attractions in downtown Vancouver and puts you on the edge of all the great food and lifestyle in Yaletown. We took in a Canucks game (tickets on game day from the conceirge) and the Ballet (theatre two blocks north). We had an upper floor suite which was clean, modestly appointed, comfortable. This isn't a hotel to be pampered in, but one that offers a comfortable stay at a good price. It is suprisingly dated for being a fairly new property. We used the pool everyday and appreciated how clean it was. Unfortunately, the hot tub was out of service for three of the six days that we were there. When everyone was checking out on Sunday morning, the elevator service took forever. Breakfast was a bonus. It had all of the basics (toast, danish, fruit, yogurt, cereal, juice, coffee). Nothing fancy but a solid start to the day.", "Date": "November 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "sydney", "Title": "“convenient”", "Author": "stpoint", "ReviewID": "UR21461626", "Content": "We stayed on the 8th floor in a timeshare unit and were pleasantly surprised. We had a main bedroom with galley kitchen, bathroom and sitting room. The unit is small but was very suitable for the three of us, anymore would have been crowded. The staff were excellent. Rosies bar was ok for food. The vancouver area is a construction site at the moment. The hotel was central for everything and we would stay here again. it is a 3 star motel, so if you dont expect the ritz you wont be disappointed.", "Date": "November 1, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "UK", "Title": "“Rosedale on robson”", "Author": "Waynebt", "ReviewID": "UR20967429", "Content": "An excellent hotel. The room had a sitting area with an internal door shutting off the bedroom with two large beds. Great if you have kids. The aircon system was the best of six hotels we stayed in including two Delta chain hotels. Highly recommended", "Date": "October 17, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Perth,Australia", "Title": "“Rosedale Bouquet”", "Author": "dObbie0", "ReviewID": "UR20232274", "Content": "We stayed at the Rosedale on three separate occasions during our recent Alaskan/Canadian trip. We found it comfortable and within walking distance of all public transport, and yes the breakfast arrangements are a disaster! However, the shops are close and we found we didn't need to use the Rosedale eating areas. Also each room has a kettle as well as those silly coffee makers, which we certainly didn't find in other hotels. The best experience though were the upgrades we received each time we booked in. By booking three we had a large,fantastic apartment. We would definitely stay there again, if only to see what sort of upgrade we'd get next time!", "Date": "September 20, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NJ", "Title": "“Perfect Location”", "Author": "PADIsandybottom", "ReviewID": "UR19965203", "Content": "Stayed at the Aviawest timeshare portion of the Rosedale on Robeson August 23-30, 2008. Hotel room consisted of a sitting area, galley kitchen, bathroom and bedroom. Bedroom was a corner unit with views of Grouse Mountain to the north and Granville Island to the south. Unit was clean throughout and perfect size for family of four (although the kids had to decide whether they would sleep together in the pull out bed or separately on the floor). The pool is small and not worth the time. On the second floor, the hotel has a free continental breakfast with delicious pastries and great coffee and fruit smooties. Kitchen was stocked for cooking meals and all utensils and dishes/pots/pans were in good condition. The property is well maintained, and Rosie's restaurant (located on the ground floor) has good food and good local beers. The hotel is perfectly located to get to Stanley Park and the Sea to Sky Highway, or south to Tswassen for the ferry to Victoria. Best part was the ability to walk to Yaletown (Yaletown brewery is awesome, as is PHAT deli--you must have the montreal steak there (wash it down with a Dead Frog Ale) and their breakfast is absolutely fantastic).", "Date": "September 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "sheffield", "Title": "“great location for seeing vancouver”", "Author": "gerrydw", "ReviewID": "UR19885316", "Content": "stayed here in may 08. for my wife, myself and our 3 yearold son this hotel could'nt have worked out any better. the staff were excellent, helping in any way possible. the resturant (rosies) is definatly worth a visit or 3 in our case. really for the money it is fantastic value. we are going back to vancouver in october, and yes we are staying at the rosedale. many other hotels could learn a thing or two from the rosedale. thanks and look forward to going back.", "Date": "September 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Northumberland, England", "Title": "“Good Location”", "Author": "bedlingtonsharks", "ReviewID": "UR19750269", "Content": "We stayed here 20th to 23rd August at the beginning of our Canadian adventure. Firstly, the price charged for the room was very reasonable and considered good value for money. My wife and I and our two kids stayed on the 9th Floor. Whilst construction work was going on around in preparation for the Winter Olympics, we never heard any - although every time the Fire Department are called out to an emergency, we were awaken by the sirens as the Fire Station is only 100 metres away. Don't let this put you off though. The rooms size was good although the layout could be better - the 'living' area and 'sleeping' rooms should be reversed so that you're not sleeping next to the windows. The beds were poor quality and creaked every time we moved. The room was serviced daily and to a good standard. The front desk staff were fine and the concierge even arranged tickets to our first ever Football Game - the BC Lions v Calgary Stampeders. The stadium is within a 'stones-throw' of the Rosedale and it was a great experience well worth the money. One other negative and perhaps one that the hotel management should seriously consider. We were charged (as were the other guests) $11 plus tax per night for underground parking. For this, I'd expect some form of security for the money yet this was not apparent and indeed the vehicle parked overnight next to our hire car was targetted by thieves for their Satellite Navigation System. Do not leave anything in the vehicle of any value! Overall though, would stay there again.", "Date": "September 4, 2008"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Rooms": "4", "Service": "4"}, "AuthorLocation": "London", "Title": "“Very happy with the rosedale”", "Author": "Mar60", "ReviewID": "UR19479865", "Content": "Stayed at the Rosedale 02/08/08 to 09/08/08. Had a very pleasent time. Lovely suite and plenty of room for 2 adults and 3 children. Staff very friendly and helpful. Toy chest at reception very popular with my children. Pool well appreciated after long days out sightseeing (However the bottom is extemely rough for some reason and my niece cut her feet several times)?? The cleaning staff did a lovely job tidying up for us everyday and as a busy full time working mum, I really appreciated this break from housework!!!. I never managed to find the washing machines though?? Good location and withing easy walking distance of all transport facilities. Highly recommend for families and we would definitely stay there again.", "Date": "August 28, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Good Value for Money”", "Author": "Olraku", "ReviewID": "UR19352021", "Content": "The hotel has a great location, literally 15 min. walking to waterfront (Seabus terminal). There is a lot of construction going on in the area, but we have not heard any noise from the construction site in our room. We stayed 3 people in the room, which had 2 queen beds and a pull-out couch, which turned out to be a really comfortable to sleep on, 2 TVs, ok size bathroom. Furniture etc. seemed to be new. Breakfeast is complimentary and given that couple of muffins, tea and coffee I consider adequate. The staff was ok apart from the fact that when our business partners called us from overseas, they were informed we already checked-out which was not the case. Also, be aware that when you check out and want to leave you bag with a consierge, you will have to pay 1 CAD, this I consider extremely cheap on the hotel's part, but oh well... Given the great rate we received from Orbitz, I still rate this hotel above averge and would definitely stay there again and recommend it.", "Date": "August 25, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "UK", "Title": "“Due to building work not a good location...............”", "Author": "julie053Uk", "ReviewID": "UR19204669", "Content": "My husdand and I have just returned from a tour of Canada and we spent the last 4 nights at this hotel. Our room was super as all the rooms are suites and ours had recently had new carpets etc. Hovever its location currently leaves a lot to be desired., Due to Vancouver holding the winter olympics in 2010 there is an awful lot of building work to be finished and this hotel is right in the middle of it. The surrounding streets are incredibly dirty and there is rubbish everywhere. Also there were a lot of homeless men rummaging through rubbish and asking for money! We definitely had to think carefully about where we were walking! Also some of the surrounding shops and cafes are quite 'tacky'.The indoor pool is only a small 'lap pool' and some of the staff were quite abrupt. If you can afford it stay at the Westin Bayshore - it has a superb location and I wished we had paid just that little bit extra!", "Date": "August 21, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Mirepoix", "Title": "“nice hotel but ...”", "Author": "marsupilami", "ReviewID": "UR19191342", "Content": "I would not recommend this hotel though its location is great for shopping and other activities downtown. We did not appreciate the presence of cockroaches in our hotel suite.", "Date": "August 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Braselton, Georgia", "Title": "“Very pleased with the rosedale”", "Author": "Autumn23", "ReviewID": "UR18876171", "Content": "We were looking for a reasonably priced hotel in downtown Vancouver to stay at prior to our cruise ship departure. This hotel is in a very nice area of downtown. It was within walking distance of pretty much everything. Vancouver does have some seedy areas, but we felt very comfortable here. Hotel was very clean and is in the process of updating their decor. Would highly recommend a stay here.", "Date": "August 12, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Nanaimo, Canada", "Title": "“Good Value”", "Author": "froggnik", "ReviewID": "UR18726268", "Content": "Good overall value for Vancouver. Dog friendly without smelling like it. Small kitchenette and living room area, secure parking. Close to BC Place and shopping.", "Date": "August 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nottingham", "Title": "“Good city base”", "Author": "Fay99", "ReviewID": "UR18400754", "Content": "Stayed at the Rosedale before and after an Alaska cruise, six days in all. It had everything you could want for a city based stay and the staff were really friendly and helpful. We stayed in a 13th floor room initially which certainly would have given vertigo sufferers a problem with the floor to ceiling window. We loved the city views though. We loved Vancouver and the Rosedale was a great place to stay.", "Date": "July 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ontario,Canada", "Title": "“Great location only”", "Author": "BBAB", "ReviewID": "UR17698175", "Content": "My husband and I stayed at the Rosedale on Robson from June 4-8, 2008. The hotel is average. The staff were really friendly and helpful. The lobby was dreary and old. Repairs were being done in front of the elevators- a real eye sore. We never found the elevators to be slow, just really old looking. The hallways are old looking and musty smelling. Our room was ok. It had astrange double door . when you opened the first door , there you saw your room and someone else's. Strange. The room was again, outdated but fairly clean. The view was very nice. Looking out you could see lots of beautiful terrances with flowers. Out of our window side we could see and HEAR fire engines every night. We think theres a fire station across the street from the hotel. The best thing about this hotel is the location. You just can't beat it. Walking distance to all areas, attractions and resturants in the city. Beware there is a high number of homeless and /or drug addicted persons. The cab driver told us this is a really safe city and that you could walk anywhere at night. Don't believe it! I'm from Toronto and downtown Vancouver is bad, worse than Toronto. In spite of some negatives ,the price was right and the location awesome- we would stay at the robson again. oh and there is a 7 eleven across the street and a Starbucks on every corner, we liked that!", "Date": "July 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "BARNSLEY ENGLAND", "Title": "“Nice hotel, great location.”", "Author": "BANDW", "ReviewID": "UR17114552", "Content": "We stayed for 5 nights at the end of a 20 day trip across the Rockies. The hotel was great, nice rooms - good location", "Date": "June 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Queensland", "Title": "“Great location”", "Author": "OutbackAussie", "ReviewID": "UR17009030", "Content": "Stayed 3 days prior to our cruise. The hotel was excellent location and close to the library, where there was a bus stop for the Hop on Hop off tours.The bar & restaurant at the Rosedale was excellent ,we dined there for every meal. Excellent meals & very reasonably priced. Within walking distance to the shops on Robson St. Small taxi fare to cruise terminal.", "Date": "June 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "yorkshire", "Title": "“canadian holiday 2008”", "Author": "cath_and_rob", "ReviewID": "UR16946329", "Content": "suite with kitchenette area, clean with everything you could need. we were on the 18th floor and near a vent shaft, this caused a humming noise all night that irritated my partner but not myself. parking available at $11 per night. staff not the friendliest we had encountered but the hotel itself is worth a stay. excellent value food at Rosies rest. attached to hotel.", "Date": "June 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Newton Abbot", "Title": "“Our second visit to the Rosedale”", "Author": "Whale-Watchers", "ReviewID": "UR16938822", "Content": "We love Vancouver and returned to the Rosedale for the second time. We were welcomed with an upgrade and had surprise views of snow-capped peaks through high-rise blocks. Reception staff were warm and efficient, going out of the way to provide maps and information. Our suite had everything we needed and the complimentary hot drinks, muffins and pastries each morning were a scrummy bonus. We stayed five nights and easily filled our days, taking public transport to Grouse Mountain, Granville Island and walking the fabulous Stanley Park. All in all, a wonderful stay.", "Date": "June 15, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Mijasab", "Title": "“A nice stay in an older hotel.”", "Author": "Mijasab", "ReviewID": "UR16480691", "Content": "We stayed at this hotel for 8 nights. We found the staff to be pleasant and helpful. The lifts were very slow. It is an older hotel with comfortable but older furnishings. At the time we were staying there they were painting the lobby area. It is a great location being in walking distance to Gastown, Yaletown, ferry to Granville Is., Subway and Robson Street shops. The two bedroom suites were a good size for us (4 adults and 2 children). The kitchen facility was average but we seemed to be able to use it on a regular basis. We were able to cook every night using the oven, cooktop and microwave. My parents car was broken into the night before we were leaving. It was parked in the basement carpark of the hotel. There was no gate into the carpark. The hotel gave them free carparking for the their two week stay. There is a firestation across the road from the hotel therefore expect a bit of noise on weekend stays. The hotel facilities were good. There is a pool, spa and gym available. Also laundry facilities on every second floor ($1.25 per dryer and washer). Rosies Restaurant downstairs was very nice. The margaritas very nice also.", "Date": "May 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "close to london", "Title": "“great hotel in a good location”", "Author": "noddyandbigears", "ReviewID": "UR16392958", "Content": "We enjoyed our stay in the rosedale with its spacious suites. The location was good and it was easy to walk to many attractions. The laundery facilities were on every other floor which meant they were easy to use and the buffet breakfast good. The only downside was that when we used the pool the water was quite cool.", "Date": "May 25, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Vancouver Island, Canada", "Title": "“The worst experience I've had in a Vancouver hotel”", "Author": "vancouverislander", "ReviewID": "UR14721349", "Content": "Stayed in a 2 bedroom suite for one night to attend a Springsteen concert. Booked 3 months ahead, requested an early check in as one person in a wheelchair who needed a rest break before concert. Arrived 30 minutes ahead of check in, room was not ready. No parking for a van-(didn't fit in underground.) Desk clerk was not friendly, told us to speak to valet about parking, valet directed me on map to a parking lot 4 blocks away. 1 hr later, after hoofing it to park a disabled person's wheels, our room was ready. Upon entry, it reeked of cleaner, wonder what it was covering up? Website shows a spacious layout, WRONG!, actually 1/2 the size, very dated furniture, nothing matched, dark and dingy. At bedtime, the beds were the worst ever slept on- very old mattresses, saggy, no springs, like cardboard covered cement. When attempting to exit hotel lobby for concert, a workman had his ladder set up on the disabled person ramp. When politely asked to move, he was very surly. Nice touch ! Use elevator at your peril. Long wait and for us it broke down, stopped between floors and had to use emergency phone to get door open. Staff on check out were nicer but too late, I will never ever darken the door of this cheap overrated dump again.", "Date": "April 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "sydney", "Title": "“a good choice”", "Author": "lozzdog", "ReviewID": "UR13779802", "Content": "We had a great 5 days here in a two bedroom apartment. We are a family of 5 so we neede to utilise the sofa bed. The apartment was very clean and comfortable - extremely well located. Complimentary Coffee & Pastries/muffins available on 2nd floor meant we did not have to organise breakfast. Although it was a little cramped it certainly beat having 2 hotel rooms - cheaper too. We would definitely stay here again", "Date": "February 23, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Aussie", "Title": "“Great Location”", "Author": "Bertie748", "ReviewID": "UR13418748", "Content": "We stayed at this Hotel with our 2 grown daughters and thought it was a good clean suite. There are 2 seperate bedrooms one with a queen bed, the other with 2 singles. There is a small lounge area with t.v couch etc and a kitchenette. The bathroom is of a standard size but clean. The location of this hotel is great, within walking distance to most tourist sites. The restaurant downstairs offers good breakfast and other meals at a reasonable price", "Date": "February 10, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "uk", "Title": "“little bit out of it”", "Author": "TinaF", "ReviewID": "UR12490072", "Content": "We stayed her for 3 nights at the end of our honeymoon in August. I found the hotel a little bit out of it by that I mean it was a good 15-20 mins walk to everything which was hard when it was hot and we had a 7 year old with us. I also found Vancouver at night very frightening with pan handlers everywhere. Fantastic in the day. Stanley park and the Aquarium are definatly worth a visit. We ate in gas town the first night at the old spagetti factory after having a great meal at the one in Banff. Well it was not at all like that, very disapointing. The second night we got a take away from China Town and it was fantastic. We ate it in our room which had a kitchenette and lounge area. The 3rd night we ate in Earls after eating in the one in Whistler. This was good. The hotel its self is a little dated and the lifts are a nightmare 1 was not working and they seem to stop on every floor. There is a lot of construction in Vancouver and all we could see from our hotel room was cranes. Quite a dark room in the lounge but the bedroom was ok. I would look for a differnent hotel if going back to vancouver. I can highly recommend grouse mountain and the capalano suspension bridge. Great day out.", "Date": "January 10, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "North of 49", "Title": "“Good Again”", "Author": "GLGB", "ReviewID": "UR12381041", "Content": "We spent one night at the Rosedale while in Vancouver to take in a Canucks game. We had stayed at this hotel a couple of years ago so we knew what to expect and were not dissappointed. Our room was on the 18th floor with a great view of the downtown are. Our room was lots big enough, clean and quiet.The small kitchen area was good for the late night pizza after the game, and the front sitting area buffers any hall noise from the bedroom area. It is an easy 5-10 min walk from GM Place and handy to Robson Street shopping if you are so inclined. Taxi to the bus depot ran us about $7.00 for our departure to Vanc. Island. Our only complaint, albeit minor was the slow elevators in the hotel. For the price, we will definately be back here.", "Date": "January 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chester UK", "Title": "“Pleasantly suprised”", "Author": "fairweatherfriend", "ReviewID": "UR10843904", "Content": "We stayed here for 2 nights before going to Victoria and 2 nights on the way back and we were really pleased with our rooms. It was clean, warm. comfy and spacious. We had fantastic views across the city and the staff were really helpful. We were able to leave some of our luggage as we were returning and didn't want to take it all to Victoria on the coach and boat. We also left luggage at the hotel on our last day before returning back to the UK and the staff booked our taxi for us so it gave us the day to see more of Vancouver. Have to say that the hotels website does not do it justice and that we were aprehensive but would definetley book again.", "Date": "November 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“Great Stay”", "Author": "Buddy74", "ReviewID": "UR10057269", "Content": "Stayed at Rosedale on Robson in May 2006 for a week while holidaying around Canada. We found the rooms to be well equiped with seperate bedroom, lounge area and kitchen facilities. It was also helpful having laundry facilities available on every other floor. Staff were friendly and the hotel well priced for what we received. Located in a good part of the City and only short walk to Chinatown and historical Gastown. Would definately stay at Rosedale on Robson again.", "Date": "October 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wales, UK", "Title": "“apartment style for motel room price”", "Author": "jel79", "ReviewID": "UR10044799", "Content": "why stay in a small motel room when you can get a 1 bedroom suite for the same price? On trendy Robson st, a short walk to anywhere. very clean, spacious and extremely quiet. We were in a room directly opposite the lifts and barely heard a sound. Room is equipped with cooking facilities so we ate in after wandering around the markets and buying fresh local produce! the motel provides muffins and tea/coffee in the morning, but anything more you need to buy - but you dont really need to! Bed was heaven at the end of a busy day - so comfortable and spacious! We now look for suites instead of motel rooms after being spoilt here!", "Date": "October 5, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“More than I expected”", "Author": "exdancer", "ReviewID": "UR10033406", "Content": "I was so worried about the rooms after reading some bad reviews, but it just goes to show that some people are picker than I am. We had 2 suites one for us and the other for the other couple we invited to join us. We booked our rooms with RCI not with the hotel. The hotel does not check you in the Aviawest office checks you in - which is adjacent to the hotel. The Aviawest staff are very friendly and helpful. Leonard made some recommendations for dinner and other activities. The rooms were very clean, there are enough towels for 3 days (there is no maid service with RCI) although if you needed more towels just dial zero - the phone rings at the Aviawest office and they will bring towels immediately. The windows are great - they are floor to ceiling. There were some reviews that complained about the size of the kitchen (why on earth do you need a full size kitchen) the galley kitchen is plenty. It had a stove, mirco wave, refrigerator, nice coffee maker, all the utensils you MIGHT need. There are so many fabulous restaurants in Vancouver why would you want to cook anything? Downstairs there is Rosies which offers a good breakfast plus there is a Starbucks on every corner. The Rosedale is a perfect location and everything is in walking distance..Yaletown, Gastown, Granville street and good shopping. We drove to Whistlers - it snowed, it was beautiful. We took the harbour cruise, Capilano suspension bridge and the tree top adventure was the highlight for us. Anyway take a look at the photos I took it they say it all - the rooms and the sights.", "Date": "October 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“A great stay”", "Author": "Beachie84", "ReviewID": "UR8611336", "Content": "Stayed for 2 nights before heading up to Whistler. Staff were very helpful and friendly, location was great, room was quite basic but clean, comfortable and catered to our needs. Restaurant was lovely and 'homely'. Would definately stay again.", "Date": "September 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, England", "Title": "“Comfortable suite, good location”", "Author": "kdtc", "ReviewID": "UR8434683", "Content": "My 2 friends and I (all singletons) stayed in the Rosedale on Robson for one week. The hotel staff were very friendly, the Airport had a paid direct transfer bus which was very convenient. Door staff were very helpful if stuck on directions. The hotel had laundry facilities on every other floor and were cheap to use, although for a week stay I would buy own detergents. I found laundry facilities to be very useful, when I moved onto another suite hotel I missed this very much. The hotel is in a very good location, 5-10minutes walk to Chinatown and 10-15minutes to Gastown. Yaletown is 5mins walk down the road and the Cinema and IGA Marketplace is 10mins in another direction. Granville Island was easy to get to as well with the boats 5mins walk from Yaletown. Robson street is full of shops and popular brands with a couple of shopping malls in close vicinity. It takes about 20mins to walk from the hotel to the end of the shopping end of Robson Street. Stanley Park is a very short Bus trip away. Rosie's Restaurant and Bar had very friendly staff (In fact all staff members in shops in Vancouver are friendly!!) the food was also good but Rosie's tends to be full of tourists naturally as it is attached to the hotel. My friends loved the Swimming Pool, Jacuzzi and Sports centre and were regulars everyday, sometimes twice a day! The suite was very clean, there were two tv's, one in living area and one in bedroom. There was no noise and the A/C was controlled by ourselves which was very good. Windows also opened which I appreciated (even from the 12th Floor!). Bathroom was also very good, bright, high pressure shower, rails and door hooks. Kitchenette area had a microwave, very large fridge and crockery, cutlery and tea towels. Electric cooker was very useful for cooking own lunches, dinner or snacks. The maid service was also very good. One negative - not enough hangers in the wardrobe! As there were 3 of us in a room, I did not find it crowded as there were two double beds and the sofabed in living area turned into another bedroom at night. I had a great stay in Rosedale and would go there again. Places to visit: Must do a bicycle ride in Stanley Park. Must do Whistler. Grouse Mountain - very disappointed, can take it or leave it. Capilano Bridge was better than expected even with the high entrance cost. Dim Sum in Chinatown was great and very cheap. Chinatown was like little Hong Kong stuffed into a few streets. Note: There is a particularly dodgy part of town on the edge of Chinatown. As a group of 6 people from east London, we still felt rather uncomfortable. East Hastings Street on the North-east side was most definitely an eye opener! Don't even think about it at night!", "Date": "August 16, 2007"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Reno, Nevada", "Title": "“Met Our Needs”", "Author": "Fonzmambo", "ReviewID": "UR8277820", "Content": "I stayed here with my husband and two young children in the Aviawest (timeshare) portion of the hotel for 5 nights in July. Our room was a one bedroom suite which had a main bedroom housing a king bed, one chair, a small dresser, a small desk, a TV, and a very small closet. A small hallway with a minikitchen (stove, small fridge, microwave, cabinets) separated the bedroom from the living room. The living room had a pullout double couch (NOT comfortable for an adult, but my five year old slept on it no problem), a couple of lamps, small desk, small dresser, and a TV. The bathroom was small, but clean, and had a shower/tub. My only concerns with the room were 1) very poor water pressure in the shower, 2) limited number of towels and they were small and flimsy, 3) room was a little worn out, with worn carpeting and looked like it hadn't been updated for a while, 4) our room faced a large construction site where building began at 6 a.m.! This made for very early wake-ups every day... We spent a lot of time in the hotel pool, which is indoors. It is small, but big enough to play around in. There is also a hot tub, a steam sauna, and a dry sauna in the pool area. The exercise room is right next to the pool and is very small, especially for a hotel of this size: there are two treadmills, a broken exercise bike, a recumbant exercise bike, and a stairstepper. The hotel itself is right smack in the middle of downtown, and we walked anywhere and everywhere we needed to go, including Stanley Park, Granville Island, Gastown, and all around the downtown area. We are very active in general, however, so people with limited walking ability or poor tolerance may not do as well. There are tons of restaurant options nearby, including a cafe/bar in the hotel itself. There is also a small store right next door to the hotel which offers a limited number of groceries and personal care items. Public transportation is abundant and easy to access from the hotel. I found the Aviawest office as well as the hotel front desk to be very helpful with information on local sightseeing and directions. One item of note for those who stay in the timeshare portion of the hotel is that housekeeping does not tend to your room if you stay less than 7 days. Consequently, we accumulated a ton of trash (which my husband would slyly dump into the housekeepers trash bag when she was servicing the room next door) and we had to keep reusing our flimsy little towels for both pool and showering use. BUT...these were minor issues and we had such a lovely time in Vancouver that we could easily overlook these setbacks.", "Date": "August 2, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Epsom, United Kingdom", "Title": "“Happy Birthday to me !!”", "Author": "Paul_Carter", "ReviewID": "UR8085717", "Content": "My partner treated me to six nights here for my 50th birthday - the highlight being a whale watching trip on the actual day. I hadn't stayed in this style of accommodation before (suites) but was impressed by the amount of space in our room with separate lounge area. Even had two TV's although didn't switch either of them on ! Whilst we didn't use the cooking facilities the kitchenette was useful for making ourselves breakfast and drinks and the fridge kept us supplied with ice for our early evening cocktails before hitting the bars and restaurants. Enjoyed undisturbed use of the swimming pool, sauna, steam room and jacuzzi (only saw two other people in there during our stay). Ideally would have preferred a room higher up but even then I don't think the views would have been that great due to location, proximity of other blocks and the amount of construction going on locally. Very easy and cheap to get to by public transport from airport (bus 424 and change to 98-B line (get off at Seymour & Smithe stop 3.25 CAD). Good location - an easy stroll along Robson to the bars on Granville Street. Only a couple of blocks away from loads of bars in Yaletown (Yaletown Brewing Company at 1111 Mainland Street a favourite especially for their cheap Sunday beer promotions !!). Irish Heather in Gastown and Carderos and Mill Marine on Waterfront regularly frequented during our stay too. Food highlights - \"Legendary Noodles\" at 1074 Denman Street and The Sequoia Grill in Stanley Park where I celebrated my 50th where we had the best table in the restaurant, watching the sunset over English Bay with one of the best meals I have ever had anywhere in the World. Rosies downstairs OK for good filling fodder. Not so lucky with an Indian meal - unfortunately mistook the \"Flavours of India\" for the \"Taste of India\" (apparently recommended) a few doors further on along Robson.Quite simply the most bland virtually inedible curry I have ever had. Biggest disappointment was Grouse Mountain. Very expensive for what it was. Lumberjack show a bit of fun and birds of prey display quite interesting but bears seemed to spend most of their time hiding and advertised wolf enclosure didn't appear to exist along with non-operating chair lift. Vancouver is a great city (second visit) but you will soon see why it is so green. One of the locals jokes is \"What do you get after two days of rain ?\" \"Monday\".", "Date": "July 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hervey Bay, Australia", "Title": "“You can't believe all you read”", "Author": "denkath", "ReviewID": "UR8052915", "Content": "Before leaving Australia, after reading some of the reviews I hadn't slept for weeks worrying about this establishment as we were coming back to here after our Evergreen Tour for 2 days as well as before and during the Tour. Well, I could not believe the rooms and suites we had. EXCELLENT everyone of them. Staff very helpful and shopping right at the door for those little things as well as good shopping just a few blocks away. So for us, we could not say anything negative about the place or it's proximity to all that a tourist would need in Vancouver. Rosie's was a nice place to eat with good portions. All in all the Rosedale and Vancouver was tops on our tour .", "Date": "July 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Cheshire,", "Title": "“We liked it”", "Author": "Wilmott", "ReviewID": "UR7714075", "Content": "The hotel is just outside the popular hotel belt but convenient to a Skytrain station. All the rooms are spacious with a separate sitting room and with a kitchenette and bathroom . There is a large construction site across the hotel but did not disturb us at floor 13. We enjoyed our stay.", "Date": "May 29, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "brisbane", "Title": "“Good place to stay.”", "Author": "navaro", "ReviewID": "UR7706760", "Content": "Have just returned from Canada tour with 2 nights before and 2 nights afterwards at this hotel. Reception staff friendly and helpful, and able to store luggage for the day if needed. Roomy foyer and good central location. Room had basic cooking facilities, including hot plates and fridge. Room service also available, and 727 store directly across road. Also Macdonalds, and good internet cafe open late and quite cheap. We really liked the hotel restaurant, and the bar - Rosie's. Food was well priced, good large serves. We ate there four times! Got very busy on Hockey nights as Stadium close by but atmosphere friendly and beer good. Would stay at this hotel again, especially if you like being able to use your own kitchen facilities even just occasionally.", "Date": "May 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "St. Petersburg, FL", "Title": "“Great Options”", "Author": "wanderer1703", "ReviewID": "UR7539552", "Content": "As an RCI member I exchanged my timeshare week for this property. The staff were great-very helpful with all kinds of information. The location was prime-close to theaters, sports arenas and famous Robson Street shopping and dining. The 2 bedroom suite was cozy to be sure, and even though they say it sleeps 6 that would really be pushing it. Even with 4 people you would need to be very tidy in the common areas in order to function. But the minikitchen had everything you could need for preparing basic meals and snacks, but with the close proximity of some affordable restaurants-there was no need. One problem was the bathroom-lack of towel bars to hang wet towels could be a problem if more than 2 people are staying in the room. Would definitely return!", "Date": "May 2, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "West Kelowna, Canada", "Title": "“Great stay if you know a couple of things...”", "Author": "letterdude", "ReviewID": "UR7266209", "Content": "We stayed at the Rosedale, recently, as part of a concert package deal (Eric Clapton!). These kind of event/accommodation packages are this hotel's specialty. Owing to the proximity to downtown Vancouver, and most of the city's major venues, it's a good bet for seeing the sights. Unlike some of the previous reviews, we found our room to be quite enjoyable. Maybe not a 5-star, but a high 3-star anyway. We weren't in town for the hotel, in any event! The service was excellent. Housekeeping was very prompt in bringing extra bath towels and did a great job on taking care of our room. Check-in was easy due to our decision to arrive a day before the concert. As noted, because the hotel offers these packages, event days will see lines for reception, elevators and tables in the pub/restaurant (Rosie's). Factor that into your schedule and make appropriate plans. We booked into a corner room on the 17th floor. While the room was quiet, the height helps by being away from street noises and the view of downtown Vancouver was pretty cool. The pool is, basically, a lap pool with a bit of a wider portion at one end for splashing with the kids. There is a small exercise room with standard hotel equipment. For some reason, I didn't end up using it, after the concert! While the room was a little dated, staff were in the process of renovating, on a room-by-room basis. Even with that, the fact that we had a separate living room made it enjoyable when we had friends visit. The corner room meant that we had large windows in both the living room and bedroom. Overall, this was a very nice experience.", "Date": "April 1, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Winnipeg", "Title": "“Unfair”", "Author": "tdbr1", "ReviewID": "UR6693407", "Content": "There are a couple of reviews before me that I found very unfair. I am an RCI member and as such realize that the Hotel and the RCI are two seperate entities. RCI as our time share company owns suites in the Hotel which are operated from a seperate desk, the hotel has no control over our suites. So it is not fair to judge the hotel itself if we are not happy with RCI service. I have always found the Rosedale to be a very comfortable and pleasant Hotel to stay at, even before buying my time share with RCI. Yes the suites are a bit small but lets face it when your visiting how much time are you really spending in the rooms? For the people who complained about getting two suites rather than one, as I have had the same thing happen before, did you check with your travel agent to make sure they had booked what you wanted or just blamed the hotel because they are the ones who gave you what the agent had booked. So to close I would say that you can not always blame the hotel for a bad experience. Remember Rosedale and RCI two different companies and just because you have had a bad day it is not always the hotels fault.", "Date": "January 25, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Sydney", "Title": "“Below par”", "Author": "cottonandwool", "ReviewID": "UR6617146", "Content": "Advertised as a family hotel, the rooms are smallish for 'suites'. No windows in loungeroom making it dingy and claustrophobic. Kitchenette is OK for making cereal but not much more. Forget the muffins provided in the 2nd floor lounge. They were hard, dry and tasteless. Bathroom very small. On site restaurant was closed on New Years night from 9pm and No room service available even though guests were still arriving off international flights and hungry. Didn't see staff smile once. Booked a 2 bedrrom suite as travelling with kids and was instead given 2 x 1 bedooms with no interconnecting door even though booked 6 months in advance. This meant 1 parent in each room. Had already booked and paid to go back 10 days later for an overnight and asked that they make sure we get the 2 bedroom suite as requested. Yet again put us in 2 x 1 bedrooms. Too many negatives, not enough positives, Would never darken their doorstep again.", "Date": "January 18, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Brisbane", "Title": "“Disappointing”", "Author": "summitsw", "ReviewID": "UR6588241", "Content": "We'd stayed here before when we took a trip in 98, but were disappointed this time. Arrived at 5pm after 24 hours of travel from Australia and were given our room, got a corner one bedroom suite which was a little cramped, had to move the furniture to pull out the sofa bed. All of us wanted a shower of-course, but it didn't work properly, water came out of the bath spout as well. Rang down to front desk (Doug, not terribly helpful!) and were told someone would come up to fix it, we also asked for extra towels, shampoo etc since there were three of us. After half an hour rang back down since no-one had come up. Housekeeping finally arrived then the maintenance guy, he couldn't fix the shower but said it would be fixed the next day (no offer to move us). We made do as we were very tired and just wanted food and bed. Went downstairs after showers only to find that Rosie's was closed for a Xmas party so we went up to the MacDonalds just up on the corner (also a Subway around the corner and a 7/11 across the street. The hotel has their own grocery store as well). The next day when we got back from sightseeing the shower STILL didn't work. Different person working the front desk, this woman was actually helpful so she offered to move us. We got a room on the same floor, much nicer as it wasn't a corner room so there was more space. You still had to move furniture to get the bed to come out though. The kitchenette is good for using the fridge, and if you want cereal for breakfast, but in a room that obviously sleeps more than two, there's only two place settings and a frypan, and a couple of bits of cutlery. Had to scrub the frypan before using it (also washed cutlery since I wasn't sure it was clean) so I wouldn't recommend cooking here, we only attempted it once. The rooms were cleaned daily, but they only provide shampoo (no conditioner) and some lotion, and it's all in little sachets, which aren't very big. Internet charge was ridiculous so we used the little internet place right next door, their rates were much better. Overall I was very disappointed, and would not stay here again, I don't know if they've changed management since we stayed last, but the service was much better the last time. Find some place else.", "Date": "January 13, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "VA", "Title": "“What a disappointment!”", "Author": "Momma_K_in_VA", "ReviewID": "UR6343243", "Content": "We booked thru RCI for mid-August. Vancouver is wonderful but the hotel was a major disappointment. The RCI staff was not helpful when I could not immediately locate my reservation number. Rather than call RCI, the clerk sent me to another timeshare’s office insisting I was not with RCI (16 yr. member). When we finally got to our tiny suite (our bigger suite was given to a person with similar name) we found the A/C didn’t work properly and the room, which received full sun all day, was hot even at 3 a.m. RCI had no fans to lend us & its staff was unable to get the unit to work correctly. We had to leave the door open most of the night to get some ventilation. No other units were available so we had to stick it out. As for the suite – the bedroom was ample but the living room/kitchen was very small & didn’t accommodate the furniture. In order to open the sofa bed, we had to stack the chairs on the table & move some to the bedroom. The linens & blankets did not appear to be clean – disgusting! The hotel was within walking distance of several first-rate restaurants.", "Date": "December 7, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "3.0", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Reading, England", "Title": "“Nice but dim”", "Author": "gauly", "ReviewID": "UR6017947", "Content": "Overall this hotel was OK and the price was one of the cheapest we could find in Vancouver for two seperate rooms (so that we didn't have to share with our two small children). The location was excellent. We had a great view of the Vancouver Public Library across the road and could even see a little bit of the mountains in the distance. It was in easy walking distance from the main downtown area and we walked up to Stanley Park from here (though that is a couple of kilometres away). The pool was clean but cold and there was also a hot tub. There was also a free breakfast but personally I'm not that keen on muffins which was all there was on offer. The hotel restaurant was reasonable. The staff at the front desk were friendly and helpful. The rooms were clean and there were two tellys (one in the living area and one in the bedroom). Now for the minus points. My main complaint would be that the living area had no windows (they were in the bedroom) so the whole suite was rather dim. The suite was also rather small. We booked a Family King which said on expedia that it slept up to 6 if you requested the bunk beds. We didn't request bunk beds, but I thought we would get some extra space. Instead we got a king sized bed in the bedroom, a sofa bed in the lounge and definitely no room for more beds than that. The kitchenette was a waste of space since the only stuff provided was cuttlery and two bowls so you couldn't cook there. The charge for wireless internet was extortionate so we went without. I might stay here again if I could get a special offer price like we did this time, but at full price I would try somewhere else.", "Date": "October 27, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Looks better on paper”", "Author": "poppyfield123", "ReviewID": "UR5964832", "Content": "We (3 friends and I) chose to stay at the Rosedale because we wanted to all share one place to cut down on costs (rather than 2 twin hotel rooms) but still having loads of space and good service. We chose a 2-bedroom suite. The concierge and reception staff were all excellent - very helpful and friendly. The suite was a decent size for 4 people and was very clean but the bedrooms had all the windows so the living area had no natural light apart from the little bit that came through if the bedroom doors were left open. This was fine for us because we were out early and back late but if you needed to be in the suite for any longer it would probably get very depressing. Another problem was with the sofa-bed. We'd chosen the 2-bedroom specifically because it had 4 separate beds (including the sofa-bed in the living area) but none of us could sleep on the sofa-bed because of the awful noise the fridge made only a couple of feet from the bed so 2 of us ended up sharing a bed in the double room. Rosedale really need to spend a night on that sofa then rethink they're 'sleeps 6' statement about the 2-bedroom. I don't think there would be enough room for 6 people in there anyway - there was room for 4 but only just. Another thing as that, although this may sound like the perfect place for a family of four with the double and twin rooms, I wouldn't recommend the restaurant if you have kids with you. One of us was under 19 at the time and looked it. The law is the law so we were expecting to be put as far away from the bar as possible but thought it would be fine as it's meant to be a 'family restaurant'. Well they obviously don't mean families with children! We were put in the furthest corner away from all other human contact and right next to the kitchens where we couldn't even see the light of day never mind the bar. Then the wait-staff proceed to treat us like some sort of a disease. To add insult to injury the food turned out to not only be over-priced but awful. I haven't had that bad a burger in a long time and I sometimes go to Burger King (no offense to Burger King but when you've only paid £1.99 for it you don't expect it to be gourmet). It wasn't located in a BAD area as bad areas of cities go but we (4 young women) didn't feel comfortable walking back at night the last few blocks after you get out of the busy area of Robson Street (east of Granville Street-ish). The kitchenette was also very definitely an 'ette'. If you just need it for breakfast like we did then it's fine but not for any bigger meals. The hotel was clean and fine for a couple of nights stay if you're travelling with a guy but I wouldn't recommend it for single or female-only travellers or if you're looking for self-catering. The best thing about this hotel are they're reception and concierge staff - some of the best there are! Overall this hotel may look like the best of all worlds but don't be fooled.", "Date": "October 17, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“Loved it”", "Author": "dkels", "ReviewID": "UR5954413", "Content": "Myself and my husband stayed at the Rosedale on Robson for our honeymoon in August. Fell in love with Vancouver straight away and the hotel was perfectly situated for getting around on foot. Only a short walk to the harbour, the beaches and Robson street (for great shopping). Stanley Park is also within walking distance although sometimes we preferred to take taxis which are always waiting outside the hotel and relatively cheap. The hotel itself was perfect- the room was very clean and airy, with all the facilities we needed. The televisions and latest hotel movies were great for getting over jet lag. The staff were very friendly and helpful, with housekeeping every day- they even washed up our cutlery which was unexpected! The spa and sauna and steam room was perfect for relaxing the legs after a day of walking. The only slight disappointment was the swimming pool which was a little small. The thing we miss the most is Rosie's Diner. We loved this place as all the staff were so friendly and really made us feel at home. The food was great and reasonably priced. We are already planning a return visit for next summer as we enjoyed it so much. Would definately recommend it for other couples.", "Date": "October 14, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "vancouver", "Title": "“Theft in the room!”", "Author": "mmmyyy", "ReviewID": "UR5830575", "Content": "I stayed at this hotel from 10th to 13th september. my mother came to see me from Japan, so I chose this hotel because I thought it must be a good hotel for her to make good memory. but at the second day, we noticed our stuffs in our bags were stoled by somebody after coming back to the room...I talked to the hotel staff, but what they said is they could not find the truth. the persons who entered the room are us and the house keeper,so I doubt that the house keeper did something in our room when we were out. but they told us that she's been working for 10 years and very reliable. I of couse dont know her and believe that. what they did for us at the end is giving us back a little amount of money with which I cannot buy some replacements for our loss. I never use this hotel and never recommend to stay there to my friends. maybe they might think we cannot complain so much because we cannot speak English fluently. that 's mean....do you think that is a nice attitude for the customers as the hotel in the popular city, vancouver?", "Date": "September 24, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cwmbran, South Wales, UK", "Title": "“Suite success”", "Author": "Strongmans", "ReviewID": "UR5765348", "Content": "Returned home yesterday having spent 12 nights @ Rosedale. The suite was ideal for us as the separate bedroom and living room, although not huge, gave us enough breathing space. Our children were able to watch tv in the bedroom whilst we chilled out in the living room. You may have to ask housekeeping for additional towels and cutlery etc if there are 4 of you but in fairness they were provided very quickly. The suite was clean and as we aked for non smoking it smelled fresh and airy at all times. Rosie's diner downstairs is very convenient and good value for both breakfast and evening meals . The pool is slightly small, but with the spa pool and 2 saunas made a relaxing end to each day. One tip is to buy books of 10 bus tickets at 7/11 shop opposite as the tickets are easier than paying every time you use a bus. The no 15 service that stops at the Library opposite gets you into downtown quickly with links to other destinations (e.g Stanley Park -no 19). The free coffee/muffins was handy, but it'll take a while for us to be able to look at a muffin again!! The staff were friendly and helpful. Would stay here again which is the best testimony we can give.", "Date": "September 3, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Colchester", "Title": "“Good location”", "Author": "might", "ReviewID": "UR5621194", "Content": "Stayed here with my wife and child and apart from the speed of the lifts making me feel sick we all really enjoyed our stay. Didn't have much to bother the staff for and everything seemed clean and comfortable. I'd stay there again. Good value", "Date": "August 18, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "southampton", "Title": "“Good Value Hotel”", "Author": "43iiainbw", "ReviewID": "UR5592099", "Content": "We stayed at the Rosedale at the end of July. The hotel is well positioned and the suites are good for families. The pool is on the small size for a hotel of this size. Saying that if we were to go back to Vancouver we would stay here again.", "Date": "August 9, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Dumfries, Scotland", "Title": "“Good value in Vancouver”", "Author": "Travelling-Scots", "ReviewID": "UR5562721", "Content": "Excellent suite hotel at the end of downtown Robson Street. The location was perfect as bars and restaurants were thinning out here so there wasn't the noise and traffic issue on the main part of the street. The kitchen had a full size cooker, microwave and fridge, sofa and armchair. The bedroom was large and nicely decorated. The reception staff were very pleasant. The onsite restaurant Rosie's was very good and reasonably priced which was a pleasant surprise as these are usually overpriced and mediocre. Although at the opposite end from Stanley Park, the hotel is only a few minutes walk from transport to all points of interest.", "Date": "August 6, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "3", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Underqualified staff at the Rosedale”", "Author": "fiveinthefamily", "ReviewID": "UR5436594", "Content": "Our family of five stayed for one night Canada Day. The room was not ready at check in. They were very late in getting it ready and had a \"too bad, so sad\" attitude about it. When we finally got to the room, the carpets were not vacumed. Once again, no apologies when I phoned down to get that straightened out. The attitude of the people that work there needs improvement. Otherwise, the suites are small and just OK. Even though they accommodate a family well, I won't be back.", "Date": "July 7, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Coventry, UK", "Title": "“Great value”", "Author": "tomnvivi", "ReviewID": "UR5435164", "Content": "Room was dated but clean - 2 King sized beds, separate kitchenette and lounge - 2 TV's playstation etc., Staff were very helpful. Excellent location on Robson. Don't put your alarm clock on for the complimentary muffins and coffee! Get the ferry over to Granville Island its worth it. Take a trip on the Panoramic Sea Plane - fantastic views.", "Date": "July 7, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Melbourne", "Title": "“Ab Fab!”", "Author": "kelad", "ReviewID": "UR5380552", "Content": "Whats not to love, My partner and I stayed at the Rosedale from April 19th-22nd. Location, Location, Location, just a few minutes walk into the main shopping area and to the local market \"Urbane Fair\" which had fantastic local food! The king size bed was very comfy and the separate lounge room was a bonus. Cable tv in both bedroom and lounge. Having a small kichen was ideal enabling us to eat in for a change. As mentioned by a previous reviewer the dishes were not done by housekeeping, but we felt that was a minor issue. We did not even need to go out for breakfast, as there were complimentary scones and muffins in the recreation area. The laundry was a saviour as we had been travelling for a few weeks Close to transport, both train and bus, but we hired a car to go to Grouse mountain and Capilano suspension bridge. (Check the reverse side of your ticket if going to both as there is a discount coupon for entry) Would recommend this hotel to friends great value for money!", "Date": "June 25, 2006"}], "HotelInfo": {"Name": "Rosedale on Robson", "HotelURL": "/ShowUserReviews-g154943-d185458-Reviews-Rosedale_on_Robson-Vancouver_British_Columbia.html", "Price": "$135 - $283*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">838 Hamilton St.</span>, <span class=\"locality\"><span property=\"v:locality\">Vancouver</span>, <span property=\"v:region\">British Columbia</span> <span property=\"v:postal-code\">V6B 6A2</span></span>, <span class=\"country-name\" property=\"v:country-name\">Canada</span> </span></span></address>", "HotelID": "185458", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/28/f9/28f91f0647b86f69f098404ebee106ff1large.jpg"}}