{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Best Deal in Downtown Vancouver”", "Author": "BostonEsan", "ReviewID": "UR127933723", "Content": "I luckily stumbled on this property through a last minute booking on TripAdvisor. I was flying in at 1am and I was looking for a clean, centrally located and affordable place to stay in Vancouver. Since this property did not have many reviews it was difficult for me to find it at number 50 in Vancouver. I hope this review will help bump up their ranking in Vancouver and give them some more exposure. They definitely deserve some more attention. If you are looking for a no frills, clean, centrally located and affordable place to stay with great service look no further. Nothing else in the city can compare. Thank you for a great nights sleep Kingston Hotel Bed and Breakfast!", "Date": "April 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chilliwack, Canada", "Title": "“Nice Little Boutique Hotel”", "Author": "kershal", "ReviewID": "UR124768253", "Content": "We stayed at the Kingston Hotel 16 February. It was lovely, quiet, and the staff were very pleasant. It was aso a great deal and I can't figure why it wasn't chock-a-block full of people :) My only negative - and then it didn't turn out to be a problem - was that the bed was a little small. Enjoy!!", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Berkeley, California", "Title": "“clean, comfortable, convenient”", "Author": "Berkeley19", "ReviewID": "UR122744190", "Content": "I stayed here for 3 nights in a small single room. No frills, but very clean and comfortable. The bathrooms and showers were down the hall but I never had a problem finding a free one. They were all clean and well-equipped. I also had a sink in my room. The desk staff were friendly and helpful. The breakfast room was also pleasant with plenty of tables and the breakfast guy was very nice. There's a little noise from the restaurant out back if your room is facing that direction (as mine was) but it quiets down early enough. This hotel is also walking distance to just about everywhere. I was quite satisfied and it was good value.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Colts Neck, New Jersey", "Title": "“very comfortable and friendly boutique hotel”", "Author": "retired888", "ReviewID": "UR119077987", "Content": "I stayed at the Kingston Hotel, Vancouver, for three nights total that were divided around a conference which I attended in Whistler. Every employee of the hotel that I encountered was friendly and extremely helpful. As others have written, it does have a European boutique hotel feel, perhaps due to its size, decor, and design. Breakfast is quite simple as others have mentioned as well, but considering the highly reasonable nightly charge, it was, to me, expected. Convenience is a definite plus for this location. I flew from the East Coast of the US to Vancouver airport, and found the Skytrain straight forward and a convenient one half hour ride to downtown Vancouver. This hotel is a mere two short blocks from the downtown Vancouver train stop. What's more, when I traveled on to Whistler, the Pacific Coach bus stop was only about a fifteen minute easy walk away. The free included wi-fi was a plus which I used frequently, and there is also a free guest computer available as well. Personally, I had problems with the wi-fi connection on one night, but did not find it overly inconvenient to take my laptop computer to the breakfast room to continue my internet use on that particular evening. On the corner from the hotel is a supermarket, and there is a wide range of inexpensive eateries within a two block radius. The area is very safe also. Perhaps the only potential disadvantage for some may be the shared shower and bathroom. I did not find this to be a problem at all. During my entire stay the hotel was clean and neat. The shared shower and bath facilities were more than adequate, and are located on each floor of the hotel. They, too were kept clean and tidy. I do not hesitate to recommend this hotel to anyone planning a visit to Vancouver. I would definitely return again if the occasion arises (and hope it does).", "Date": "October 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Excellent location, spotlessly clean, simple!”", "Author": "RicardoMartinez", "ReviewID": "UR119014243", "Content": "I was in a bit of a bind and needed a hotel for one night on a trip to Vancouver recenty. A local friend suggested this hotel, though did say, 'I hope you don't mind the bathroom being over the hallway'. It sounded a bit suspect, but I needed a room for the night, was on a bit of a budget and so I booked the room. What a surprise. On arrival I was impressed with the homely feel of the hotel. Very helpful and friendly reception staff. Up to my room on the second floor. Small, but completely adequate. Wash basin in the room, writing desk, comfy bed (king sized single bed? - smaller than a double). The bathroom and shower was literally across the hallway - and as other reviewers have said, don't be too put off by this. The bathrooms are very well maintained, and very clean. The whole property is spotless. A basic breakfast is included - toast, juice and coffee or cream cheese bagel, served in the small dining area adjacent to the reception. Very clean and comfy and well managed by attentive staff person. If you feel the need for a more substantial breakfast, you'll need to go for a wander. There is a pub and bar right next to this hotel, and I was a bit worried about the noise. I actually ate dinner in there and had a few beers and watched some rugby. Lively, friendly place. I commented about the possible noise when I came back to the hotel, and the reception guy said, 'if it's too loud let me know and I'll go and tell them to turn the music down'.He didn't need to, it wasn't an issue at all. You could walk up to the Granville Street train stop for the Canada Line and have easy access to and from the airport. Honestly, if you are on a bit of a budget and not fussed about the bathroom thing, and want to be located right in the middle of town, this would be a great pick.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dugald", "Title": "“Manitoba cruiser”", "Author": "Bob S", "ReviewID": "UR118911145", "Content": "My wife and I just returned from a cruise to Alaska and spent a couple of days before and after the cruise at the Kingston Hotel Bed and Breakfast in Vancouver. The hotel is right in downtown Vancouver and only an $8.00 cab ride from the hotel to the cruise port. The hotel has a European feel. The stay at the hotel includes a continental breakfast. This hotel is one of the cleanest we have ever stayed in. The staff is friendly and knowledgeable about shopping and attractions in the area. Granville Market is about a 20 minute walk from the hotel. Next door to the hotel is the Kingston pub. The food there was very good and reasonably priced. We met people of all ages from around the world staying at this hotel.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Wimberley", "Title": "“Great location”", "Author": "Bozenaclay", "ReviewID": "UR118041289", "Content": "We have stayed in Kingston before and liked it. Good central location in downtown now you can take skyline ( fast metro) from airport and be in the hotel in 30 min. Don't get discouraged by shared bathrooms, they are very clean and close to rooms so no problem. The only thing I wished they have A/C. It was quite warm at night.", "Date": "September 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Quaint little historic hotel”", "Author": "Girgazim", "ReviewID": "UR117287579", "Content": "Very clean but small rooms shared bathrooms and laundry room", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "California", "Title": "“Great location, good value”", "Author": "hartski", "ReviewID": "UR116534009", "Content": "We were quite surprised at the cost of Vancouver hotels. Luckily found this place through TripAdvisor (and maybe Frommer's too). Great location with cheap eats right around the corner. Can walk to everything. Breakfast was continental with toast or bagel and coffee/tea and juice. Fine to get your started but don't expect much more. The rooms were just fine, nothing fancy, but clean and just fine (no TV but there is one in the lobby). Shared baths/showers were plentiful, and sparkling clean. We liked it enough to extend our stay but had to move to a smaller room. We started with a queen bed/shared bath and switched to a 3/4 bed shared bath. The only problem is that that the bed is up against the wall. But we were aware of that and considering the only other choice was a large room with 2 beds and a bath for much more money we were fine in the bed against the wall for only 2 more nights. All in all, it's a good spot, well run, helpful front desk. Unless you plan to spend a lot of time in the room, I'd say it's a fine place to sleep, shower and get a small breakfast.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Albuquerque, New Mexico", "Title": "“Great location at a great price”", "Author": "kghedin", "ReviewID": "UR116429891", "Content": "We stayed at the Kingston during a 5 night stay in Vancouver and we were more than happy with the accommodations. Yes, some rooms are small and without showers, but are you there for the room or for visiting Vancouver? The shared showers were no problem as there are more than 1 to a floor and we never had to wait for one. Bathrobes and slippers were also provided. Some rooms overlooked the Kingston Bar and Grill patio, which can be loud, but only during the evening. An unexpected bonus was the coin operated laundry room with one washer and two dryers. Walking distance to anything you'd want to see in downtown Vancouver. Wireless available in rooms. Staff was very, very friendly!", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "UK", "Title": "“Basic budget accommodation in good location”", "Author": "biker77", "ReviewID": "UR116381683", "Content": "Friendly and helpful staff, small room, a bit stuffy (although there was an electric fan in the room). Shared bathrooms (quite a few of these did not have a hand basin which I think is a bit strange). Very handy for downtown Vancouver and 'Gastown', easy walk to the seafront. Basic but nice breakfast (Juice, coffee, toast or bagel).", "Date": "August 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Taveuni Island, Fiji", "Title": "“What a value!”", "Author": "DigitalSailor", "ReviewID": "UR116236939", "Content": "After Staying at a hostel we booked a budget room here for about the same price. Wow, what a difference. For about the same price as our Victoria hostel we had a lovely room complete with slippers, bathrobes and breakfast. The breakfast was basic but a bonus. A sauna, as well as the shower down the hall made this place a true gem. Loved it!", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Oakland, California", "Title": "“charming and economical”", "Author": "susengland", "ReviewID": "UR116189767", "Content": "I had a pleasant stay at this modest Hotel. Very clean, well managed and convenient to downtown. There was no problen with \"bathroom down the hall\".", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good value in central location”", "Author": "cmds1982", "ReviewID": "UR116172604", "Content": "This is a fairly dated hotel in need of some tarting up, but it's really good value and in an excellent location. Wasn't blown away by the service, but staff are friendly and helpful enough.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Munich", "Title": "“Great value for money...friendly, convenient, centrally located”", "Author": "Ellagri", "ReviewID": "UR115965710", "Content": "I stayed only one night as a single traveller in one of their basic rooms with shared bathroom. the room was small but clean, the bathroom as well. But what made me appreciate this place even more is the outstanding service and friendly front desk staff. It proves that accommodation doesn't have to cost much to make you feel at ease. The morning breakfast was basic too, but so nicely presented and served (the staff member toasted and buttered the bagel for me...). Also the B&B is located right in downtown Vancouver.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Florida", "Title": "“VALUE FOR MONEY IN A GOOD LOCATION”", "Author": "oldtravellerFlorida", "ReviewID": "UR115957897", "Content": "Stayed 4 nights. Had two connecting rooms so ample space for a couple. The room with wash hand basin would have been rather on the small side. Rooms were clean and breakfast was adequate comprising of of toast, bagels, orange juice and coffee. Free internet access in room. The subway was was about 3 min walk away and cruise terminal was about a 15 minutes. Many shops and restaurants in the area. The cost represented good value for Vancouver.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Bath", "Title": "“Excellent value for money”", "Author": "barbara_mountjoy", "ReviewID": "UR115618648", "Content": "Very reasonable rates and near the Downtown sights. Continental breakfast ok but toast every day gets boring so they've introduced bagels. Some of the rooms are now being upgraded. Mine wasn't ensuite but the bathroom was opposite my room. There's a computer which is free to use to check Face Book messages and e-mails and look up places to visit. There's a Bistro next door which is good for drinks, but there was a cabaret and with no double glazing it was noisy. However they stopped at 9pm, but not good when you're jetlagged! A fan was provided as there's no aircon. For a reasonably priced Downtown place to stay it's worth putting up with these little gripes!", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Great value, good location, free wi-fi”", "Author": "zenzen1984", "ReviewID": "UR115432365", "Content": "My husband and I stayed here for one night in June, and found it to be a fairly good hotel (in my opinion, \"good\" comes between \"average\" and \"very good\" as in the ratings available on TA). It was a great price, and came with a free breakfast (simple but satisfactory). We were here for the second play-off, so it was pretty noisy, but that's not a fault of the hotel. It was clean, and the rooms were small but satisfactory. No problem with the shared bathroom. Good to have free wi-fi too. Fine for the one night stay that we were here.", "Date": "July 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sydney", "Title": "“Great”", "Author": "Sydneycan", "ReviewID": "UR115264929", "Content": "Just spent 3 nights here and found the place to be excellent, it's only a 10 minute walk to Gastown and 15 minutes to Canada Place. Yes, the rooms are a little small but we were not there to hang out in the room. The next time I would request a room towards the rear of the hotel because there was a bit of road noise. The breakfast was adequate and the whole hotel is exceptionally clean. Overall I would stay here again and would recommend it to others", "Date": "July 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Will not stay here again.”", "Author": "uNKoiL451", "ReviewID": "UR114984806", "Content": "Small rooms with funky smell, bad beds, poor sound proofing, 1 shower for 15 rooms, cheap breakfast (your choice of bagel or toast)... Not worth 96$ a night. Good location thought.", "Date": "July 3, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Oxfordshire", "Title": "“Best value place in the city!”", "Author": "P_H003", "ReviewID": "UR111653070", "Content": "We stayed here for two nights on a trip to a friend's wedding. Initially I was concerned about the shared bathroom element but these were very clean and well maintained. The room was very comfortable and quiet and the staff were very chirpy and helpful. The room was very clean overall but could have done with a quick wipe over and the eviction of the shared slippers that looked like they had been there since the year 0. Breakfast is included and whilst not massive is more than enough for most. All the staff we met seemed very jolly.....worth a look.", "Date": "June 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Copan, Honduras", "Title": "“Excellent value”", "Author": "wix", "ReviewID": "UR111134959", "Content": "Stayed one night in a single room, with shared bathroom down the hall. (The room did have a sink.) Clean, tidy, quiet, nicely furnished, a great location and at $75 a bargain. Shared bathroom was clean and there was no wait for shower. Robes and slippers were in the room if you wanted to use them. Free Internet, and a computer available in a sitting area. Staff were friendly, lobby was nice and free breakfast — toast, bagels, coffee, tea, range juice — was good and served in a pleasant room with windows on the street. No TV; a little flat screen would be nice. But overall, best value I've found in Vancouver.", "Date": "June 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“A perfect location in a friendly, clean hotel”", "Author": "R0ssD", "ReviewID": "UR83084889", "Content": "My wife & I stayed 3 nights in this well located, downtown hotel. We chose a room with ensuite facilities. We rate it highly, being perfectly located to many tourist localities. We found the room relatively small but clean and regularly serviced. The reception staff were friendly and well informed. We also liked the continental breakfast included in the tarriff. A great stay.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Auckland", "Title": "“Great location, clean and tidy but no air-con”", "Author": "Grizzlykiwi", "ReviewID": "UR81753814", "Content": "Great central city location, within walking distance of many activities and things to do, clean and tidy but we stayed in August when it was quite hot and there was no air-con in rour oom - which didn't make for good sleep. There was also a lot of noise from the building next door from about 5-6am. Apart from that, a good stay.", "Date": "October 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Victoria, BC, Canada", "Title": "“Great value in a nicely refurbished centrally located hotel”", "Author": "Sunnymeader", "ReviewID": "UR78155979", "Content": "Spent a night at this downtown boutique (but budget) hotel. Friendly and helpful staff, comfortable and clean room. Simple but adequate continental breakfast. No hotel parking, but available nearby at $20+ per night.", "Date": "September 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "St. John's, Canada", "Title": "“Unbeatable price for family owned hotel with great location and service”", "Author": "spencerBrown", "ReviewID": "UR73788043", "Content": "I stayed at the Kingston for 10 nights while I worked at a downtown hospital. The price was originally what attracted me to this hotel. $75 per night is unbeatable in this location. For this price I was expecting a pretty run down hotel and as I approached, the somewhat ghetto hotel sign lived up to expectation. However, I was much more optimistic as soon I got to the front desk. The staff was really friendly (Fred and his son own and run the hotel and it has been in their family since it opened a hundred years ago) and the lobby/breakfast area was really clean and nicely decorated. The room was small for sure (maybe a bit cramped for a couple if you plan on spending much time in the room) but I found that there was plenty of space for me even though I was spending a fair amount of time in the room studying (good free wireless internet). Also the bed and pillows really soft and clean and the room was quiet so sleep was good except on really hot nights (no A/C, just a small fan). The fact that there is no toilet/shower in the room (some more expensive rooms have these in them) was definitely a bit daunting at first. In the end though, it wasn't as issue at all. There are a couple shower/toilet areas on each floor and I never had to wait. Plus there was a sink in the room for shaving etc. Continental breakfast is a bit of an overstatement. A bagel/toast plus drinks (coffe/tea/OJ) and some fruit slices are a bit thin - as much coffee as you want mind you - i could have used some protein but maybe that is no longer \"continental,\" who knows. However, eating healthy during my stay was not an issue at all. There is an IGA marketplace less than hundred meters from the hotel which essentially functioned as my kitchen. The best feature of the marketplace was the self serve salad and fruit bar. Plus the hotel is minutes from literally hundreds of restaurants so variety is not an issue. And if you are intersted in night life, all the clubs are just a stumble away. Overall, I really enjoyed my stay at the kingston. It is inexpensive, clean, quiet, and family owned so the customer service is guaranteed to be good. Really, an unbeatable value in downtown Vancouver.", "Date": "August 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Zeist", "Title": "“Perfect Value for Money, excellent downtown location”", "Author": "No13", "ReviewID": "UR64067849", "Content": "Kind and helpful people. Real Bed & Breakfast: very simple breakfast, however plenty of other breakfast opportunities just around the corner. Good beds. Perfectly located in downtown Vancouver.", "Date": "May 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vernon, British Columbia, Canada", "Title": "“That's all it is...A \"Bed\" and \"Breakfast\"...what more can you want for the price”", "Author": "sunnycorona", "ReviewID": "UR55915846", "Content": "My husband and I stayed here last night, the opening night of the Olympic ceremonies. What a prefect location! We were in walking distance to everything. As far as the Hotel goes, yes the room is small (very small), and yes you have to share a bathroom. But what do you expect for a inexpensive room downtown Vancouver? The place was clean, the bed was ok, the front desk people were nice and the lady in the \"breakfast\" room was very sweet. They serve you toast or bagel with oranges and coffee and fresh squeezed orange juice, included in your low price. If you want luxury, stay somewhere else, if you want a bed and breakfast in a great location, then stay at the Kingston. Oh, and by the way, the pub next door, The Kingston Pub, is superb. The food is great, and so is the ambiance and the staff. Two thumbs up!", "Date": "February 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Beijing", "Title": "“Spotlessly clean bang in middle of town.”", "Author": "HinBeijing", "ReviewID": "UR51511395", "Content": "OK, so I travel a lot round the world, usually staying in 5 star hotels for business. This stay was enroute for holidays, and my priorities were totally met in this place. It was spotlessly clean in the rooms and bathroom. I can live with the rest. Yes, it's a communal bathroom and shower for me, but I don't mind that (don't be so nesh - you want your own bathroom then you pay for it). The room were small to medium sized, no problem. Mine looked out onto a car park, but hey, it's downtown Vancouver not Lake Louise so thats OK. I don't understand how people can expect a 'view' from a place they sleep in. It was Friday night hockey night and the bar next door was was full, but I didn't hear any noise. The rooms and Hotel has a cool heritage feel to it, including the original sinks and cupboards in the rooms, but everything else looks new. I think it was renovated recently. It's location is amazing - right downtown. I was talking to the young guy here and him and his Dad still run the place, which his great grandfather built. Can't say they're not invested in here then. The Continental breakfast is a bit skinny, I admit, but it filled me without being too much, so good service and friendly staff. If you are after more food, them Marketplace IGA supermarket is on the corner of the block, about 50m away. Free wireless didn't quite reach my room at the back of the Hotel on the top floor, but fast otherwise. For $75 I think this is great. The communal bathroom means it will never be the Hilton, but I have stayed in other Motels in downtown Van for $80 a night which were very average, and this place is much better - clean, bright and friendly. Inexpensive Hotel or luxury Hostel, choose whatever label you want but I will make this my place to come stay when I am downtown, and pocket the other $$$ I saved on a more expensive place.", "Date": "December 19, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "london", "Title": "“Watch out - there's a noisy bar nearby”", "Author": "jan30London", "ReviewID": "UR46369682", "Content": "What the hotel website fails to tell you is that most rooms face onto a noisy bar. So you are not going to get much peace and quiet here. I can't remember our room number, but it faced directly onto the bar. Luckily, the noise had died down by the time I wanted to sleep. The hotel is a bit basic, nothing special. For a much better hotel that's not that much more expensive, I would recommend Blue Horizon.", "Date": "October 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "St. Petersburg florida", "Title": "“Not what I expected but it was great. I'd return again.”", "Author": "anmagi", "ReviewID": "UR43361499", "Content": "As a solo traveler, I like to spot a bargain. The Kington Hotel Bed & Breakfast fit the bill. The staff ws friendly and I liked the layout of the place. I found my room to be very tiny. But I did not pay much for it, and I was there to see Vancouver not the room I slept in. I am used to share bathrooms. It was fine. The walls are a little thin I'm afraid, as I took afternoon nap, the couple in the next room checking in and must have been separated for while. I took it in good humor. The breakfast was not much, but it was something to fill my stomache until dinner.", "Date": "September 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Victoria BC", "Title": "“Spotlessly clean Character hotel is excellent value in a great location!”", "Author": "buffet46", "ReviewID": "UR38757602", "Content": "Love this place for it's cleanliness, good prices, central location & character. I have no problem with sharing bathrm down the hall; sink in the room is perfect for my needs. Spotlessly clean both times I stayed here: 3 nites & one nite 3 wks later. Central location: perfect for walking, easy connection to buses & subway/skytrain. Love the character of the place & smartly updated. Friendly staff. Prices are excellent considering the location & amenities. Computer available to use made things easier for me!", "Date": "August 25, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Edinburgh", "Title": "“More like a Hostel than a Hotel”", "Author": "thenewblackisgreen", "ReviewID": "UR33857177", "Content": "In all honesty, I find it hard to believe this place is regarded as a hotel. Myself and my partner arrived for a weeks stay in June 2007 and received a less than friendly welcome. The room that we were paying a small fortune for was barely more than a cupboard which looked out on to a multi-storey car park. Not only did we have the noise from other rooms (the walls were so thin) but we had the noise from the car park. To make it even worse we could hear other people in their bathroom through our air vent in the toilet! The \"Continental\" breakfast is an absolute joke - two slices of toast and half an orange! The same for a whole week! And only 6 tables so most mornings you would have to foregt breakfast. On our departure in the early hours of the morning we asked the hotel to book a taxi which they forgot to do and we had to do ourselves. There was no apology, in fact the person on the night shift appeared to be very annoyed that we'd woken him up!! If this was advertised as a hostel at a third of the price I would have been more satisfied but for our only stay in the beautiful city of Vancouver, this 'Hotel' was a real let down. Don't go!", "Date": "July 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Vancouver Island, BC", "Title": "“A Gem in the heart of Downtown”", "Author": "M-Sheep", "ReviewID": "UR27001686", "Content": "My husband and I stayed at the Kingston Hotel on Richards St. in the heart of downtown Vancouver, when we came over from Vancouver Island to see a show at the Center for the Performing Arts. We honestly couldn't have been happier! The front desk staff was FABULOUS. I have hardly gotten that kind of service in all my years of travel. The rooms were very clean (i'm a stickler for cleanliness!) and the location is about as good as can be desired. It is a block or two to pretty much everything you could want in downtown: Granville and Robson, BC Place, the Center for the Performing Arts, libraries, museums, specialty shops, and Pacific Center Mall. The continental breakfast in the morning was a beautiful touch and the beds and pillows were really nice. It was a nice, quiet hotel close to everything you need and EXTREMELY affordable. We will definitely stay there again and tell all of our friends and family about it!", "Date": "March 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "New Zealand", "Title": "“which continent?”", "Author": "elfnz", "ReviewID": "UR22346863", "Content": "Basic, no-frills accommodation, close to Vancouver downtown. Not sure what technically constitutes a 'continental breakfast' but the 2 pieces of toast and 1/4 of an orange seemed a bit cheap!", "Date": "December 1, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "venice", "Title": "“Carpet smells someone's vommitted”", "Author": "venice_8", "ReviewID": "UR22328335", "Content": "I stayed 2 nights. I opened the window widely to get some fresh air into the room. But nothing can be done. The room smells awful, coming from the carpet as if someone vommitted on it. It's good thing I came to visit in Sept. wherein I can open the window and get some cool air but even then It was still awful. I brought a small hand towel and cover my face when I slept at night. Pls DO NOT STAY IN THIS B&B, go somewhere else even you have to pay a little extra.", "Date": "November 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Louisville, Kentucky", "Title": "“Convenience, Class and Cleanliness!”", "Author": "roadtripphene", "ReviewID": "UR21391453", "Content": "Since Vancouver seems to tend toward the expensive side when it comes to hotels, I was a little nervous about staying at The Kingston, with its $65 per night rate. But after spending two nights at their establishment, I can easily say this: go. You will not be disappointed. The Kingston is something of an urban oasis. It is located in a highly busy location, with close access to shopping, bars, restaurants and sports arenas. But if you arrive at the hotel on a weekend night like I did, you'll be amazed to find that the loudness of the city somehow disappears when you walk through the doors of this charming hotel. Because the Kingston is a family establishment, it pays more attention to detail than other hotels in its price range. Don't be fooled by the old 60s hotel sign nearby and the fact that it was built in 1910; the Kingston has been well-preserved. Although the hotel wont win any fashion awards, I appreciated the fact that my single room's carpet was not worn, the windows were not cracked, the ceiling was as spotless as the floor. The cleanliness continued to the bathroom, where it seriously appeared as though someone came around every five minutes to scrub the entire room. This might not sound impressive, but this is a SHARED bath that I'm referring to. The staff was professional, polite and accommodating. Each morning, I came downstairs to the small dining room and a staff member gave me coffee and prepared my toast. This is a nice touch, considering so many places offering a continental breakfast require you to \"grab and go\". They had a nice part of the room partitioned off by a rock fireplace, where I went to eat my meal and watch the news. A NOTE to the budget-minded: Kingston recommends parking at the Westin, just around the corner for $18 per day. Although the Easy Park just before the hotel isn't as secure, the charge is only $6 per day. Between convenience, cost and a touch of class, I recommend the Kingston and will visit again when I return to Vancouver.", "Date": "October 30, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Location, Location, Location”", "Author": "Lisbon73", "ReviewID": "UR21186428", "Content": "Great little find (via Trip Advisor of course). Stayed for three nights in a double room with bathroom. Rooms perhaps a little on the small side but cosy and clean nonetheless. The winning factors here are the location - central to shopping, bars, restaurants and other attractions and the reasonable cost. Book early. Car Parking is available at the Westin underground park one block over from the hotel. The on site laundary room and free internet were also a nice added bonus. Thoroughly recommended", "Date": "October 24, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Largo, Florida", "Title": "“Well located, clean, simple and affordable”", "Author": "Katkrazy", "ReviewID": "UR20884018", "Content": "I found this hotel on TA, among others, and narrowed my list to 3. The other 2 filled up or did not have the room I wanted available. This was a stroke of luck. This hotel is centrally located just a few block off Robson St.- where it all happens- and close to many things like restaurants and shopping. We could walk almost anywhere, even to Canada Place where we caught our cruise. (FYI we travel light!) We had a nice, albeit small room on the Richards St. side. I would avoid a room near the bar next door. It's a very nice bar where we enjoyed the local honey lager (it's associated w/ the hotel) but it has a big outside patio that is quite popular with the locals for birthday parties and things. It might be a bit noisy. Some rooms have bath/shower down the hall and while we had a room w/bath I peeked in to check them out for future reference and found them large and clean. There's one guest computer, ice and snack machines, and a skimpy continental breakfast that includes toast, coffee/tea, orange juice and 2 orange slices, and no other offerings like an apple or bagel... it could have been better. Overall for the price in a big city well worth it.", "Date": "October 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Brilliant hotel in a central location. Perfect”", "Author": "jess22", "ReviewID": "UR19913925", "Content": "We looked on Trip Advisor and found the Kingston, right in the middle of downtown Vancouver and perfect for walking anywhere in the city. For the very reasonable prices (75 CND for 2 pn) our expectations were low but we only needed a place to sleep for 5 nights. However, this hotel far exceeded our expectations. The rooms were small and we opted for a shared bathroom which was absolutely no problem as we never had to wait to use it and the facilities were always spotless. The room had its own sink. The price includes a very agreeable, basic continental breakfast with plenty of tea/coffee, free use of sauna and INTERNET. The staff were very friendly and helpful, nothing too much trouble, even storing our rental bikes for us. The restaurant next door was super, lovely decor with an extensive reasonably priced menu. Thank you Kingston, we will be back.", "Date": "September 9, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Durham, United Kingdom", "Title": "“Good base in excellent location”", "Author": "DelorusP", "ReviewID": "UR18912240", "Content": "We stayed at the Kingston for 3 nights in July. We arrived and checked in with no problems and the chap on the reception desk was very pleasant. Our room was on the small side but we didn't expect anything more for the price. We did have a sink in our room which was a plus as we had opted for the cheaper room without a private bathroom. Breakfast was OK although I think they could have offered something more than just buttered toast. One down side was that there was a lot of noise from outside but then we were in the city centre so this is expected and we just put our earplugs in. On the plus side, the pub next door served great food for very good prices.", "Date": "August 13, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Oregon", "Title": "“dirty sheets”", "Author": "pdxjimOregon", "ReviewID": "UR18631449", "Content": "I booked a room here for two nights last weekend. Got to the hotel around 7pm and found the bedsheets to be dirty, i.e. didn't smell clean, had a few hairs, and a little grittiness. Obviously they'd been slept in. I've stayed here a few times before so this was quite a surprise. I have no tolerance for dirty sheets. I asked the front desk clerk if he could change them. He made an attempt to find replacements but he claimed that there were no more clean sheets in the building. Later that night I asked the over-night desk clerk for replacement sheets. He became indignant and told me that the sheets on my bed were \"obviously clean\"! I spent the night elsewhere and in the morning I checked out and asked for a refund on my 2nd night. The manager told me that the housekeeper had already been in the room that morning and had pronounced the sheets to be \"clean\" but he offered a 10% discount because of a cigarette burn in one sheet!!! He then offered to refund my 2nd night, but only if he was able to sell the room to someone else, which he eventually was able to do. None of the staff of this hotel were interested in making the customer, me, happy. I'll never stay here again.", "Date": "August 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“A cheap, safe and clean room at a convenient location is all we need”", "Author": "Jer_Fen", "ReviewID": "UR18518840", "Content": "My husband and I stayed at the Kingston Hotel 3 nights in July. We paid $85 per night for a small double room with no private bathroom. We are the kind of travellers who spent whole day sight-seeing and exploring from 9AM ~ 9PM. We do not need huge bedroom or facilities (e.g. gym, swimming pool) in a hotel. I did lots of research on trip advisor, and eventually chose Kingston Hotel as it fits all the criteria: cheap, safe, clean and convenient. It is situated right at the city center - within walking distant to Stanley park, Canada Place, Granville Island, Gastown, Robson Street shopping district and transit system. You can take a bus to airport at a stop less than 3 mins walk. When we arrived at the hotel, we just love it. Absolutely exceeded our expectation. It has an old English charm, the decor was warm and cosy and front desk personnel was courteous. Although small, the room was clean. We did not have problem using shared bathroom. They were never dirty or smelly. And they were always available (Maybe because we used to shower late after 9PM). There is a sauna room, but a pity that it wasn't working when we were there. And we think it is really considerate of them to provide a shared computer on 2nd floor with free internet connection. There are free breakfast in the morning. Butter toast, orange juice and coffee/tea. Not great but good enough. I read with surprise that there are someone complaining about it. What do you expect with that kind of room rate you are paying? A buffet breakfast with egg, bacon, sausage, pancake and fruits is simply unrealistic. If we travel to Vancouver again, we will definately stay at Kingston Hotel. J&F", "Date": "August 1, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sweden", "Title": "“Central location - good value”", "Author": "cross-check", "ReviewID": "UR17652410", "Content": "If you can live without private bath and handle a small room this is just right. Room is clean, and the price is hard to critizise. They offer all kinds of rooms at different rates, but the absolute cheapest deal is the above, no bath, single room. Location is excellent and resonable parking around the corner. A small complimentary toast breakfast is included. Free wireless internet that didn't really work when I was there. Free internet computer down the hall. Nice building, English charm. If you're not spending time in your room and want to be downtown at affordable prices this is perfect.", "Date": "July 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver", "Title": "“A Little Gem of a B & B Hotel In Vancouver”", "Author": "kdschadt", "ReviewID": "UR15552617", "Content": "The Kingston Hotel is a little gem of a B & B Hotel in Vancouver. The Kingston is a family owned and operated B & B Hotel, located in the very heart of Vancouver.The personal touch is felt upon arrival, and can be observed in the many details throughout this fine little gem. Safe, clean and comfortable - it is the home-away-from- home. Cozy little rooms, in oak and brass, with or without a bathroom, that guarantee a great night's sleep, and a sauna room if you really need to relax after a long trip... Awake to the smell of freshly buttered wholewheat toast, juice and coffee in the breakfast room, with a delightful company of travellers from all around the world, or finish a second cup of coffee catching up on the latest from The BBC World, CNN or the local Vancouver papers.... The Kingston has a complimentary computer hooked up to The Internet on the second floor, just off from a cozy reading room c/w a writing desk and grandfather clock... There is also a laundry room on the same floor, with a suggested itinerary for the neophyte to Vancouver, and a modest library for the foot-weary traveller.... Around the corner you can find the Vancouver Public Library, The Queen Elizabeth Theatre, The Playhouse Theatre, The Orpheum Theatre, The Vancouver Art Gallery,and a short bus ride to Stanley Park - an evergreen forest in the centre of the city, where one may walk, jog or simply enjoy the coastal mountains on a nice day. Immediately adjacent to The Kingston Hotel is a little gem of a pub c/w fireplaces, pool tables, sidewalk tables and loaded with atmosphere - it's popular and always busy - a great place to have a short drink, snack or something more substantial at the end of your day. And just around the corner The White Spot - a Vancouver institution, where one may enjoy a healthy lunch or dinner, in a warm and friendly atmosphere. You will want to return to this popular restaurant... There are several cinemas around the corner on theatre row, The Vancouver Public Library - inspired by The Colosseum in Rome, a major bookstore, department store, mall and many of Vancouver's finest restaurants... The Kingston is that rarity in today's world - a small, family owned and run B & B, in the heart of a modern N.A. city, rightly famed for its superb mountain scenery, c/w beaches and The Bard on the Beach and fireworks, on a summer's day. You will want to stay on at The Kingston until Whistler or Banff lure you away... As a man who thinks himself fairly well-travelled I can highly recommend this little gem of a hotel for old and young alike.", "Date": "May 1, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Montreal", "Title": "“EXCELLENT Value!! Highly recommended!”", "Author": "pathMontreal", "ReviewID": "UR15127482", "Content": "What luck to find a hotel run by people who have not forgotten they are in the hospitality business. I stay in lots of hotels in Canada and the U.S. and often feel ripped off, -- but not at the Kingston Bed & Breakfast Hotel. Anyone travelling to Vancouver who is offended by the outrageously high rates and poor service of national chains should stay at the Kingston instead. It's quaint, quiet and VERY easy on your wallet. And the location puts you right within walking distance of Yaletwown, Downown and Stanley park.", "Date": "April 18, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "London", "Title": "“Nightmare!!!!”", "Author": "Thom1238", "ReviewID": "UR10946438", "Content": "I would never go back!!!! We booked at Hotel Vancouver for 8 nights last September only our plans changed so I emailed to change the reservation to one night instead of eight. Apparently they didnt get my email so not only did they cancel our entire reservation, they charged us a cancellation fee. When we arrived for the 1 night luckily they had one of the cheaper rooms for us to stay in but to this day have refused to refund the cancellation fee - even when I sent them the email I sent changing the reservation. Their email address obviously had some kind of fault but I was charged $160 USD!!!!!!!! As for the stay itself, the decor was dated, the breakfast was meagre in the extreme. I would recommend staying in a short stay rented apartment as it is MUCH better and cheaper too. Beware!", "Date": "November 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Vancouver via Toronto", "Title": "“Great Staff, Great Hotel, Simple Concept - Reasonable Rates!”", "Author": "playsthething", "ReviewID": "UR8453445", "Content": "I've just stayed twice (4 nights & 2 nights) at the Kingston (Hotel, Bed and Breakfast) in conveniently located in Downtown Vancouver, and should I ever need to again this is where I'll stay! The Kingston is basic - clean rooms, some with private baths some with shared toilets/showers. I had the latter (due to the lateness of my booking the first time I needed to change rooms the first time for the last night - painless) so I've been in 3 rooms - double bed, 3/4 bed, single. All were comfortable, clean and quiet. I never had to wait to use the showers/toilets and made use of them at varous times of day. Continental Style Breakfast (included) is Coffee/Tea, Orange juice, Buttered toast w/ jams & peanut butter, and Orange wedges. If you want more there are plenty of restaurants nearby. It's served in a small \"breakfast bar\". If it's busy share a table and meet someone new! Every day I was there it was served by Jeanine, who is sunny, friendly and cheerful even if she's been there all night! She's a gem!!! Sean and Nicholas are two desk Clerks worth noting, friendly , knowlegable, a pleasure. There's a computer w/internet for guest's use, I never waited more than 10 minutes and usually it was free. (I gather there are also coin washers available but I didn't need/use them.) Note: no guests allowed after 11pm(keeps things quiet), nice mix of ages etc in Hotel guests (4 of 6 mornings I had nice chats with some of them) If you want a place to sleep comfortably, that's clean and well run but inexpensive the KINGSTON is a great choice that I recommend without any reservations (but I recommend YOU have reservations as it tends to book up!)", "Date": "August 19, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Macae, RJ", "Title": "“Disappointing”", "Author": "Summery1", "ReviewID": "UR8407908", "Content": "Very disappointed with this hotel. It was advertised as a Bed & Breakfast, however \"breakfast\" turned out to be orange juice, toast and slices of orange. Every day. The computer was \"out of order\" the entire time. The wireless was not working most of the time I was staying there. At some point it was partly fixed and worked in one common-room of the hotel. It never worked in my room. All of the snack machines were out of order. The number of bathrooms and showers was very minimal. The hand-soap containers were empty. There is no air-conditioning, just a small plug-in fan, and the rooms were very hot. There was no atmosphere, the staff were not very friendly. I paid $55 for the cheapest room (before tax) and wish I'd gone to a hostel instead.", "Date": "August 13, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "vancouver", "Title": "“Best deal in town, nothing beats this!!!”", "Author": "kyz", "ReviewID": "UR8374414", "Content": "I have been staying at this hotel almost every month for a week and it is my home away from home. The staff is friendly and kind. For a traveler on a budget this is THE absolute best deal in Vancouver, and you are RIGHT downtown in the center of the action - just off Robson and Granville. The rooms are small but as an older building it really has a style you don't see in many hotels. There is a common area where they serve breakfast and you can gather there to watch tv and meet other visitors, it is a real community type of feel.. and there's a great little pub attached where you can go and watch the game. It is also incredible quiet there which is surprising since it is right downtown. I absolutely recommend this place, you will not get a better deal in town that is a guarantee.", "Date": "August 8, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Washtington, DC", "Title": "“An adequate European-style low budget stay”", "Author": "ashlibrooks", "ReviewID": "UR8062330", "Content": "My husband and I stayed at the Kingston for three nights recently. We found it to be adequate and pretty typical of low-budget accomadations (pensions) I have stayed in in Europe. If you're looking for an \"American experience\" this is not the place for you. The Kingston rooms are small and old, although clean and newly enough remodeled. The bathrooms are clean, but the third floor single bathroom has no lock, which I found strange. I think the bathrooms must be cleaned several times a day as they never seemed dirty to me, given the number of people staying at the hotel. The shampoo, soap is not fancy, but again--adequate for what you need. The location is good enough, but not great--it's on a side street, not the main streets. It's an easy walk to the main areas, so again this was fine and since we had a car it made finding parking very easy. We were always able to park outside the hotel. As for the breakfast--as previous reviewers noted again--this is a SIMPLE breakfast. It reminded me of places I've stayed in Germany. You get literally two pieces of toast--butter, jelly, peanut butter, honey. You get two slices of orange and a choice of tea, fresh OJ, and/or coffee. You are served this food, which also made me laugh (I was thinking--if you saved the money you're paying someone to toast bread, you could serve eggs). The breakfast room is really cute and must have been recently remodeled. It has a flat screen TV that you can watch any time of the day. I think the best part about the hotel was the clientele--lots of young to middle-aged travelers from all over the world. It made for nice morning conversations. Also, the staff were helpful and friendly. The computer didn't work so don't count on checking emails while you're there!! We'd stay again.", "Date": "July 5, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Nanaimo", "Title": "“Last Resort”", "Author": "clcnanaimo", "ReviewID": "UR7975469", "Content": "I have stayed in various places in Vancouver and this was the worst experience I have ever had. When we checked out, they tried to charge us an extra $50 because there were two of us, not one. We were never told in advance, even when we checked in that they charge for double occupancy. We finally managed to convince them that we should not be charged. Also, it is hardly a bed and breakfast. Toast and coffee and an orange slice. Not even a muffin? Terrible. For the price that they were planning on charging us we could have stayed in a regular hotel room. Some friends of ours recently stayed there and had some people visiting (quietly) in their room in the afternoon and they got a phone call that their guests had to go.. no explanation. This place would definitely be a last resort.", "Date": "June 24, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Berkeley, California", "Title": "“Average, clean, you get what you pay for”", "Author": "Steefje17", "ReviewID": "UR5882386", "Content": "Great location, walking distance from shops and the asian market around the corner. Clean rooms but the halls were a bit dim. About as cheap as you can go without going to a hostel and definitely you don't get much more. Not what I would call a real 'bed and breakfast', since breakfast consisted of toast, coffee, orange juice, orange slices, period. You do get a choice of buttered or non-buttered toast so I took my joy in annoucing 'butter please'. The breakfast room was rather small, always crowded. They offer internet access but the one MAC is rather old and needed rebooting several times a day. You had to ask at the desk for a reboot. The manager/owner never greeted anyone which I thought was odd. And I was there four nights. The rest of the staff was great, nice and friendly.", "Date": "September 27, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Salt Lake City, UT", "Title": "“A great cheap place”", "Author": "A TripAdvisor Member", "ReviewID": "UR4388108", "Content": "I stayed at the Kingston Hotel for 4 nights and had a great experience. The single room I stayed in was small but clean, and the shared bathroom on my floor (2nd floor) was very clean, and also nice because it was for single use, so I didn't have to share it while I was using it. Two of the staff members were exceptionally friendly and helpful; the third was not as pleasant as the others but sill helpful. The hotel was offered exactly what it advertised: European-style sleeping rooms with single, double or twin beds, and European-style breakfast. If you are looking for a fancy hotel with big rooms and TV’s, this is not the place for you. But if you want something cheap, clean and at a great location this is an excellent choice. I was in Vancouver to see and experience the city, not to stay in my hotel room watching TV, so the Kingston was perfect for me.", "Date": "January 25, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Vancouver, BC", "Title": "“Stay Away”", "Author": "A TripAdvisor Member", "ReviewID": "UR4327782", "Content": "I stayed in this hotel because of its location and good price. However, I would advise you stay away from it. I got bed bugs!!! In addition, my privacy was invaded when one of the receptionists decided to call me on my cell phone the day of my departure without my consent. He called me a few more times inviting me to go out with him until I reported this to the Vancouver Tourim Bureau. There are other options in Vancouver that I would recommend if you are on a low budget, such as the YWCA or the Vancouver Accommodation and Conferences at UBC.", "Date": "January 6, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "3", "Service": "1", "Rooms": "2"}, "AuthorLocation": "San Francisco", "Title": "“Lousy Customer Service”", "Author": "R0adrnr", "ReviewID": "UR3639704", "Content": "Although overall the Kingston Hotel \"Bed and Breakfast\" was a pretty good bargain, I'd say it's a far cry from being a true Bed and Breakfast. The room was small had no TV and their breakfast consisted of two pieces of toast and two slices of orange. The hotel had a sauna on my floor that would have completely changed my mind about the place but this sauna didnt work. I made reservations at the downtown hotel as a walk in and was greeted by a pleasant man who worked the afternoon shift but when I came back the next morning to check in after 11 am, the day shift man was very rude, unfriendly and condescending to say the least. I have travelled throughout the US and Europe and stayed in several hotels along the way. I have never ever been treated as coarsely as I did in Canada, which shocked me. Folks in Canada area generally friendly and pleasant but this guy definitely needs to either retire or take a refresher course in customer service. Each day I saw this guy I noticed that he never smiled to anyone and didnt speak to anyone at the desk unless spoken to. I think the Kingston Hotel would be better served if they didnt have this guy as their representative at the front desk, particularly during the morning to early afternoon hours. Perhaps they should replace him with the afternoon or overnight representatives who were both quite friendly.", "Date": "July 6, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Seattle, WA", "Title": "“Not bad for the price and location.”", "Author": "A TripAdvisor Member", "ReviewID": "UR3260143", "Content": "I have stayed at the Kingston every time I have been in Vancouver for the last 7 years and while it is most definately NOT a fancy hotel - it has always been clean, affordable and centrally located. It is walking distance of the shopping district, Gas Light area, Stanley Park and Granville Island as well as the museums. The staff is courteous and pleasant. The other guests are considerate. It has a unique charm lacking in most \"budget\" motels and quite frankly for the price it's much better than your average Days Inn or Motel 6 or what have you.", "Date": "March 8, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Bellevue, WA", "Title": "“Avoid like the plague!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1218089", "Content": "I read the reviews from Fodor and looked through the Kingston Hotel's webpage. Both looked okay. I only realized my mistake after booking into the hotel. No parking unless you paid to park at the Westin across the street for $15 for 24 hour parking. No elevators, so you had to lug all your bags up several flights of narrow stairways. No A/C, so the room's really hot (I stayed there in July, and it was SWEATY HOT!). Walls are very thin; I could hear water pipes and my neighbors when they walked around. Security very lax; I left my room locked at 11am, came back at 2pm and found my room door was wide open. Management not responsive; I called the front desk about my open door, but did not receive help nor a call back from the manager or front desk. Very upsetting. Good thing for them that nothing was stolen or rifled through, since the open door was negligence on their part. My advice is to avoid this place like the plague.", "Date": "August 7, 2003"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Lucerne, Switzerland", "Title": "“You get what you pay for”", "Author": "inkwave17", "ReviewID": "UR1024394", "Content": "This place is a great bargain but is basically a slight upgrade on a hostel (minus the hostel community feeling). It is similar to staying in a converted dormitory. Rooms are very small but comfortable enough. It can get quite noisy since your pillow is literally 2 feet from the hallway so bring earplugs. Lots of Europeans staying here and some backpacker types - definitely a safe place to stay and everything is fairly clean (although after 10 people have showered, the bathroom can get a little soggy). To address the parking issue mentioned in the other review - we parked our car at a ritzy 4-star hotel garage across the street for a small fee and it was fine. Best thing about this place is the location as you can easily walk anywhere you might want to go in downtown Vancouver. The Kingston is definitely not for everyone, but the price is unbeatable and it's a great alternative to a standard hostel.", "Date": "May 21, 2003"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "", "Title": "“Penny-wise, pound foolish”", "Author": "A TripAdvisor Member", "ReviewID": "UR681792", "Content": "The Kingston Hotel is absolutely what it states it is--a budget-rate, Europeon-style hotel in downtown Vancouver. The rooms are well-kept, nicely decorated, and quite but not perfectly clean. The feel is both retro and old-world. Minor flaws are a lack of air-conditioning in the rooms, bathrooms down the hall for some rooms, and thin plywood doors so that all movement in the hallways is clearly heard. The continental breakfast is toast, coffee and a half of an orange. The BIG flaw is a lack of parking--my car was towed away my first night (fortunately cheaper in CA than the US) and broken into the second night (mucho bucks). For the $210 I spent on these matters, I could have stayed in a MUCH nicer hotel.", "Date": "August 23, 2002"}], "HotelInfo": {"Name": "The Kingston Hotel Bed & Breakfast", "HotelURL": "/ShowUserReviews-g154943-d185466-Reviews-The_Kingston_Hotel_Bed_Breakfast-Vancouver_British_Columbia.html", "Price": "$86 - $98*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">757 Richards St.</span>, <span class=\"locality\"><span property=\"v:locality\">Vancouver</span>, <span property=\"v:region\">British Columbia</span> <span property=\"v:postal-code\">V6B 3A6</span></span>, <span class=\"country-name\" property=\"v:country-name\">Canada</span> </span></span></address>", "HotelID": "185466", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/60/a1/76/the-kingston-hotel-bed.jpg"}}