{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Extremely friendly and helpful staff”", "Author": "R T", "ReviewID": "UR126194400", "Content": "I will stay here again, the staff was the friendliest I have encountered at any hotel. The location was convenient, and I appreciated the kitchenette in the room. The entire room, including bathroom was exceptionally clean. Unlike other reviewers, I only heard two loud planes during the daytime hours, no bothersome noise at night. Additionally, there was plenty of room for the complimentry breakfast. I will stay here again because the staff was so friendly and helpful. Thanks Ladies!!!", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Antonio, Texas", "Title": "“friendly staff”", "Author": "alan c", "ReviewID": "UR125104808", "Content": "I really appreciate the courteous service Very clean, nice rooms! great location, close to all amenities, and the staff is very nice and helpful! Sometimes when you choose a Hotel that cots less, you tend to get what you pay for.. But thats not the case here!!! Its inexpensive and very nice!", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Anchorage", "Title": "“Excellent Value”", "Author": "goodmother2", "ReviewID": "UR124272749", "Content": "I was in town for a convention and chose this hotel for the price and it's amenities. I was not disappointed. The staff was very friendly and helpful and the hotel was extremely clean. It was only a 10 minute drive to the strip and there were plenty of places to eat nearby and Walmart for the couple of things I needed to buy. I will definitely stay here again if I return to Vegas.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Pleasant stay”", "Author": "rangerwife2009", "ReviewID": "UR124235114", "Content": "I throughly enjoyed my stay. The staff was efficient and very kind. My room was very clean and was impressed. Would recommend to others.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Island Pond, Vermont, United States", "Title": "“Amazing Hotel!”", "Author": "Mary E", "ReviewID": "UR124231393", "Content": "Very clean, nice rooms! great location, close to all amenities, and the staff is very nice and helpful! Sometimes when you choose a Hotel that cots less, you tend to get what you pay for.. But thats not the case here!!! Its inexpensive and very nice! It was a nice place to stay with my Children in Las Vegas! No ruckus and commotion wee hours of the night! So to anyone out there looking for a place to stay in Vegas.... This is it!!!!", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Lakeland, Florida, United States", "Title": "“Warm and Friendly Staff”", "Author": "Danielle S", "ReviewID": "UR124121794", "Content": "Great stay for the price. The staff was warm and friendly. Always greeted us with a smile and answered any questions we had. They met our needs and then some. Would recommend staying here with the family.", "Date": "February 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "las vegas", "Title": "“L.V. \"HoJo\" Best location for \"Las Vegas Motor-Speedway\" access.”", "Author": "dan c", "ReviewID": "UR123886536", "Content": "Great value for extended stay in L.V.. Clean comfortable and safe. Staff always greets you w/ a smile. I am here doing buiness w/ \"LVMS\" this property has quickest access to speedway 5=mins.away. rooms have full kitchens, all brand new, gym, meeting rooms, lounge and business center. daily maid service kept my room spotless. close to resturants and shopping. well stocked free breakfast 6-10a.m. free \"wi-fi\" in room. highly recommend.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Rialto, California", "Title": "“Couldn't sleep!!!”", "Author": "Ds C", "ReviewID": "UR120920673", "Content": "I stayed here when it was being converted to a Howard Johnson from a Value Place in mid November of 2011. I got into town almost around midnight and as soon as I parked and exited the car I was immediately asked for change. A guy approached me saying he had some Home Depot gift cards he was willing to sell me. He said he was selling them in order to get money for him and his family to stay at the hotel. He said his family was acorss the street sitting in the restaurant waiting for him to come back. This was a lie. He left us and went walking in the complete opposite direction of where his family was suppossedly at. The front office was set up more like an office at some public government building (very uninviting). When we walked in, we had to use a phone on the wall to call the night worker. He came and let us into the office area to check in. He said that he was working alone. He said he was not only the night manager but also the security for both buildings on the property. He also told us to beware of people in the parking lot offering to sell drugs. Luckily that didn't happen. There were no curtains, just miniblinds that had some gaps between it and the window frame. The lights were very bright in the room. The tv was nice as well as the many channel options. LOL!!! The shower had very little water pressure. The bed was rock hard and small. The hallway and rooms had a very strong smell of fresh paint. It was so bad that the next morning I went across the street to Walmart to buy candles. The air conditioning unit was either freezing cold or scorching hot, there was no in between! I could here people walking around in the room above us. I could here people talking in both rooms to either side of us! I was waken up by my neighbors having some pretty loud sex. It was bad enough that the walls are paper thin but for them to have loud sex just made things worse. I'm all for people having sex loud or quiet but please be aware of the walls. The next morning I went to eat their continental breakfast and found that their dinning area was just in one the empty rooms. When I got back to my room, I realized my room was out of toilet paper. I called the front desk and was told I could find someone in the dinning area who could assist me. I found the worker and asked for some toilet paper, she said she would find someone to help me. All she did was make 1 phone call and couldn't reach anyone. She contiued her duties in the dining area and totally left me hanging!! I kept stopping her to ask for more toilet paper. She looked in a few storage areas and didn't find any. She then contiued her dining duties. I stopped her again and asked for some. At this time she opened the bathroom in the dining area and gave me the half used roll that was in there. She asked for my room number and I told her. I went back to my room and while I was using the restroom I heard the door open and then I shouted out \"HELLO\". There was no knock at the door, just a worker barging in!! When i shouted out, the worker replied as if I caught her off guard, \"sorry I was just dropping off some t.p. for you\" and then she took out my trash and left the room. After leaving the hotel and coming back for the night to shower and sleep, I was waken up again by my neighbors having sex again. They would finish and talk, then back at it again, finish and talk and back at it again. This happened a total of 5 times! I'm not mad that they were having fun. In fact I applaud them for having energy to go at it like they were. After a loooong day all I wanted was some sleep. I asked if I could switch rooms so I could get some sleep and was told the hotel was booked up and there were not any rooms available to move to. It took about 20 minutes to get in touch with a night worker to ask to move just find out that they couldn't move me. I told the staff all the reasons why I wanted to move to another room and I was then told that there is nothing they could do about my neighbors, the loud traffic on the street or the people hanging out on the side walk near my room. I got only about an hour and a half of sleep that night. Even if my neighbors were not having nightly fun, I still would have had trouble sleeping, especially with the hard bed, ac unit not working correctly, the sound of cars passing by and the sound of people hanging out on the side walk or in the parking lot. After packing my bags and leaving the room for the final time, I slipped my neighbors a kind note to tell them thanks for keeping me up all night with their fun. As I did that and started to walk away, a lady came out wearing just a tank top to say \"sorry you didn't get any sleep but I couldn't resist my boss!\" I couldn't believe that was how I was wrapping up a weird and miserable experience at the hotel! My advice is if you want to sleep and not be around shady employees, shady things people were doing around the hotel, paper thin walls, uncomfortable beds, low pressure showers, broken ac units, then don't stay here!!! You'll just regret it!", "Date": "November 22, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Austin", "Title": "“Terrible Service, bad part of town”", "Author": "CAS30", "ReviewID": "UR119766863", "Content": "Required a 100 dollar deposit on top of weekly rental, which was supposed to be refunded upon check out. At check out, supposedly the systems were down, was promised it would be refunded within 15 minutes back to credit card after I left. Never was refunded. Every time I called, I listened to the same run around....\"It's in auditing,\" it should already show as an authorized credit on your credit card\" (not a debit card), \"we already refunded it to you,\" we don't what's wrong\" we will call you back (5 plus times told this and never called back), etc. Bottom line is this place is being run by a bunch of incompetent clowns. The place is infested with families, some homeless, others in transition. Kids play in the parking lot like it's their back yard. Constant sirens, high crime area of LV. If you like being approached for change, window washing, cigarettes, selling stolen items from the Wal-Mart across the street, than this is your type of place. Have fun with the high traffic of the less desirable, smoke and grease smelling hallways, loud noises from other rooms as well as outside. Beds were stiff, lightbulbs needed replacement, wireless internet did not work, and they opened in 2011? What a joke! I will never stay here or any other Value Inn again. Terrible customer service! Corporate office doesn't have a direct line to contact regarding issues. 10 days have passed and still no refund. I just disputed the charge, but it's the principalities.", "Date": "October 26, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Value Place experience”", "Author": "Angelaaa35805", "ReviewID": "UR117888158", "Content": "Was not impressed with the paper thin walls and floors, uncomfortable bed and stained towels. There's an extra charge for internet but it's frequently not working. Staff uses the same cramped elevator as guests to haul dirty sheets? Not very sanitary! The front office is not 24 hrs. and the staff is luke warm in personality and customer service. Very bad area of town.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Charlotte, Tennessee", "Title": "“Simple , clean, great staff”", "Author": "jeepman4x4", "ReviewID": "UR114941279", "Content": "I work out of town for weeks at a time. I always stay with Value place. They are so clean. Nothing fancy may i say but cost effective. This one was not here last time i was in town. I am so excited there is not a affordable place in Vegas. That for a great stay.", "Date": "July 1, 2011"}], "HotelInfo": {"Name": "Howard Johnson Las Vegas", "HotelURL": "/ShowUserReviews-g45963-d1858830-Reviews-Howard_Johnson_Las_Vegas-Las_Vegas_Nevada.html", "Price": "$66 - $89*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">5300 East Craig Road</span>, <span class=\"locality\"><span property=\"v:locality\">Las Vegas</span>, <span property=\"v:region\">NV</span> <span property=\"v:postal-code\">89115</span></span> (Formerly Value Place Las Vegas (Nellis AFB))</span> </span> </address>", "HotelID": "1858830", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/d9/ea/96/getlstd-property-photo.jpg"}}