{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“location, location, location and more”", "Author": "Leonard26", "ReviewID": "UR127816197", "Content": "we were here a year ago and now returned in April 2012 so the pertinent question is why did we come back here and not try a newer and bigger and more serviced hotel with pool, restaurants in-house, room service, valet service, etc. etc.? and the answer is likely, without probing too deeply for meanings, because the total environment is relaxing and laid back ------ you hear the call of the Canada geese, blue herons, and swans coming through your opened windows in the mornings; the noise factor from cars and bars is non-existent; in the immediate area are well maintained flower and tree endowed low rise with a few high rise condos and apartments; the walk to the water is 10 minutes; the walk to Delany's Coffee House on Denman St. is 7 minutes; even though we had kitchen facilities in the suite, the walk to a \"thousand\" Vancouver restaurants, is minutes away, north, south, east, or west;.... want more? the front office people are very friendly (Ken, Tag, Kent) and will go out of their way to help you; we love the cleaning staff; the place is clean; we had no major complaints last year or this year; no, it's not 5 star but once you've stayed downtown amidst the bustle and noise and then come here and find a little peace and quiet, you won't be going back down town.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Bahrain", "Title": "“Decor not up to the mark.”", "Author": "JMF707", "ReviewID": "UR127713070", "Content": "Myself and two other ladies, shared a two bedroom suite in Rosellen Suites last weekend. We were shown a suite on the ground floor which was totally unacceptable so we asked for another suite. The suite we were originally allocated smelt moldy and the decor was dated and scruffy. We were offered another suite on the same floor for $30 per day extra which was is better condition and had modern T.V.'s. It was a nice suite but was also rather tatty. There were old and torn net curtains and it had only been half modernized. Nice kitchen with granite tops, but why didn't they change the units and old appliances too? All the curtains were scruffy. The fire cover looked terrible. Even the common areas need to be renovated. However, the linen was clean, the apartment was warm and bedrooms and bathrooms were nice. The apartment was a good size and we did enjoy ourselves. Wish it had been as good as the apartments look in the ad. Location good for a short visit to Vancouver and the concierge directed us to a really nice fish restaurant in Stanley Park, a short walk away. I have stayed in many holiday apartments and houses around the world, for a similar price, and this was one of the worst I have stayed in so far. Staff were pleasant and helpful. I have seen the other reviews and can only assume that the writers were staying in a different apartment to the two that we saw.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pickering, Canada", "Title": "“A Hidden Gem in Vancouver!”", "Author": "Tempoman", "ReviewID": "UR126939828", "Content": "I travel a lot for business and for me a hotel has to be clean, convenient and have lots of space to work and relax! I don't want to sit on my bed to do my work. The Rosellen gives you apartment space at a great price. My unit is usually two bedrooms, a handy kitchen, and lots of living room to relax. There is always a desk and a dinning room table if you need more room to work on. Their internet is fast and free.You will not believe how friendly the staff are because they want you to have a great hotel experience. One of the cleaning staff has been here for 20 years so what does that tell you about the property. There is no restaurant but you are only about 2 blocks for more than enough food selection. Not all the suites have been upgraded yet so if that is important to you ask before you book. The Rosellen will enhance your trip to Vancouver!", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "vancouver, bc", "Title": "“gem of the west end”", "Author": "gitlin", "ReviewID": "UR126599739", "Content": "We couldn't have had a more delightful stay in Vancouver! A quiet peaceful place with Stanley Park and big city amenities a few blocks away. After staying in a suite here, I'll never opt for a hotel room again! It was very roomy with the generosity of space older buildings possess. There were wood floors throughout, and pleasantly decorated. I felt I was returning \"home\", every time I came back from my wanderings. The staff was exceptionally helpful and welcoming, the housekeeping great. I felt looked after yet left alone. We were only there for a 2-day getaway. Next time I'm planning a week!! I hesitated writing this review, afraid this cozy quiet spot will become too well-known. .", "Date": "March 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Canada", "Title": "“Great location and room size”", "Author": "wahini1", "ReviewID": "UR126066327", "Content": "Terrific location just a half block from Lost Lagoon in Stanley Park. A quiet residential neighbourhood. 3 blocks to Denman Street with loads of restaurants and easy access to English Bay and Robson street. Wonderful staff who make you feel really welcome. The studio unit is nicely updated with warm colours and a spacious feel. Full kitchen too.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Surrey, Canada", "Title": "“Holly N - Great weekend retreat”", "Author": "KellyDaisy", "ReviewID": "UR125672680", "Content": "My husband and I live in Vancouver's suburbs and occasionally enjoy spending weekends downtown Vancouver as tourists in our own city. In March 2012, we spent a weekend evening at the Rosselen and were impressed with our stay. The staff were friendly and attentive. Our 2 bedroom suite was comfortably retro and clean. The full kitchen was especially appreciated when we decided to remain in and prepare a fabulous and leisurely dinner. The Rosellen's location is ideal for interesting walks and exploring as it is close to parks, beaches, shopping and great dining locations. We are happy to have discovered this gem and look forward to returning in the future.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“A real find”", "Author": "Richard T", "ReviewID": "UR125579581", "Content": "This place is great. In that really nice, quiet hidden part of town between Denman and Stanley Park - so quiet and safe location but really close to everything you need. Tag and the rest of the staff were incredibly helpful and friendly when we booked and when we arrived. Decor quite dated in the basic suites but everything was exceptionally clean and the suites are a really good size. Great price compared with Vancouver's expensive hotels that gives you the independence of having your own apartment. A great find, highly recommended.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Prince George, Canada", "Title": "“Perfect for a family get-away”", "Author": "Cecilia S S", "ReviewID": "UR125110273", "Content": "We stayed at the Rosellen Suites for 3 nights in February. It was perfect for my young family. My daughters had their own bedroom and our spacious master bedroom had its own ensuite. A full kitchen made making meals easy. The excellent location meant Stanley Park and shopping was just a short walk away. We will look forward to visiting Vancouver again and Rosellen Suites at Stanley Park will be our home away from home.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perth", "Title": "“Fabulous”", "Author": "BaliBarbara", "ReviewID": "UR124000016", "Content": "We stayed at the Rosellen Suites twice in January enroute and returning from our trip to the snow. It really is a fabulous place, extremely well located in walking distance to downtown and so close to Stanley Park, English Bay , Coal Harbour and an easy stroll to the restaurants and cafes in Denman Street. The apartments are clean, comfortable and very well equipped. We were upgraded to a superior apartment at no extra charge. The staff were all very friendly and extremely helpful with any request and happily provided maps, directions, details of where to eat etc.All our party were delighted with the accomodations and service and would always recommend it as the place to stay in Vancouver. Well done to all .", "Date": "February 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Quiet and Comfortable”", "Author": "Stephen B", "ReviewID": "UR123965852", "Content": "We enjoyed our stay at the Rosellen Suites. This quiet retreat was great after a busy business day. The staff were very helpful. Spacious rooms. Close to the park to enjoy a walk [if it isn't raining]. We will returning to Vancouver in a few months and booking with the Rosellen again.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Adelaide", "Title": "“Great, quiet location and plenty of room”", "Author": "lis77", "ReviewID": "UR123764071", "Content": "Rosellen Suites is a great base for Vancouver, particularly if staying with a family. We stayed in a 2-bedroom 2-bathroom apartment and the setup was superb for 2 adults and 2 teenage children. The location is marvellous. The West End is my favourite part of Vancouver, as you feel like you're in a suburban neighbourhood and not in a big endless hotel strip filled with tourist shops (such as Robson Street). The apartments are right next door to Stanley Park with its numerous walking tracks. A couple of blocks away is access to frequent public buses to downtown (although you can also walk with no problems, count on 20 mins plus), cafes, a large Safeway supermarket and a liquor store. The price was very competitive to hotels, given you get a full kitchen and can self-cater allowing you to save on food costs. Staff were also very friendly and helpful, and there is carparking on site (more room if you park on the street as the downstairs parking area is very tight for large cars).", "Date": "January 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mancos, Colorado, United States", "Title": "“Great location - quiet yet so convenient”", "Author": "rocksnpots", "ReviewID": "UR123715977", "Content": "Rosellen Suites is my preferred lodging for business or pleasure trips to Vancouver Island. The trails of Stanley Park are right there for walking, running or biking. It is a quick 15 minute walk to the Bayshore and only about 30 minutes walk to city center along lively Robson Street. The suites are well furnished, nice-sized and very quiet. The staff are friendly and helpful. Twice I have arrived very late because of travel glitches, and the hotel staff made late check-in most convenient. There are a Safeway, convenient stores, coffee shops, wine shops and a variety of small restaurants all within a few blocks on Denman Street. After a noisy stressful business day, it is wonderful to relax in a quiet room at Rosellen.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "100 Mile House, Canada", "Title": "“Peaceful Business getaway”", "Author": "didikh", "ReviewID": "UR123125051", "Content": "When working in Vancouver I like to stay somewhere central, but was sick of basic hotels rooms. Rosellen suites provided a quieter location and apartment -like amenities, so we could eat in or out with so many great restaurants nearby. The kitchenette was surprisingly well equipped, the bathroom a little small, but the value for $ was excellent. There was enough room in living room to work, do yoga and relax:). The after hours check-in procedure was a little non-traditional but worked fine. Nice and quiet, friendly, will stay here again.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hope", "Title": "“great place in the city”", "Author": "lorraineHope", "ReviewID": "UR122897600", "Content": "enjoyed staying here with friends-great location for walking around Robson St, Denman and Stanley Park. 2 bedrooms and sofa bed- able to sleep 5 comfortably. Well equipped kitchen- able to have breakfast and snacks in. Tag and his assistant helpful- allowed us to park for the day when the Santa Claus parade was on. Booked on priceline. Planning to go back!", "Date": "January 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“rosellen suites hideaway”", "Author": "davidsuzpruitt", "ReviewID": "UR122868293", "Content": "Just this last weekend my husband and I stayed in Vancouver at Rosellen Suites. We have been regular visitors to Vancouver and like to try different hotels. The suite had a full kitchen --all the gadgets needed if you are choosing ingredients for dinner from Granville Island. Having an suite of rooms is so pleasant after spending the day out about sightseeing. Being able to walk to Stanley Park is convenient -its almost as close as your backyard, Dining and entertainment are also a short walk away. Secured parking is available for a reasonable fee . Special thanks to Kent in the front office - for being a gracious host, because it is the warm hospitality that will guarantee our return,", "Date": "January 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "La Ronge, Canada", "Title": "“warm, quiet, and friendly”", "Author": "Sheila F", "ReviewID": "UR122791448", "Content": "The warmth of this place is in its character. My husband and I have stayed here numerous times of the years and always appreciate the location, amenities and friendly staff. It is not the fanciest hotel, but the suites are clean, quiet, roomy and well-appointed. The location is great! Close to Denman, Davie, Robson and Stanley Park, everything you want is close by. We often consider booking more lavish digs when going to Vancouver, but always end up choosing to stay at the Rosellen.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Auburn, Washington", "Title": "“Clean, friendly, quiet, and convenient”", "Author": "AlinaCarter", "ReviewID": "UR122265847", "Content": "We came to Vancouver for a 3-days vacation and stayed at the Rosellen Suites because it was close to Stanley park (and we had to visit the aquarium), to museums, to the Lookout, and to dining galore on Denman street. The friendly and knowledgeable staff helped us find our ways to all attractions we needed! The sweet was large and clean; the beds were very comfortable; and there was a full kitchen and 2 TVs! We would recommend the Rosellen Suites at Stanley Park to all families visiting Vancouver! Thanks to everyone who made our stay so pleasant!", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“Convenient, family friendly, and clean”", "Author": "Linda B", "ReviewID": "UR122072440", "Content": "My husband had a business meeting, and when he found the Rosellen Suites at Stanley Park offered reasonably priced suites, my daughter and I tagged along. The suite was clean, spacious and convenient to restaurants and shopping. There was even small kitchenette and dining table in our suite, as well as two TV's. The staff were friendly and there was a choice of above ground or underground parking.", "Date": "December 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Spruce Grove, Canada", "Title": "“location, location”", "Author": "dunsm0re", "ReviewID": "UR121696187", "Content": "We were so happy with this hotel and location. Clean, spacious, and walking distance to so many great restaurants and shops. Very Quiet, staff were friendly and helpful. We would recommend this to anyone with a family, or group, Steps from beautiful Stanley Park, and the ocean. We would highly recommend this property, and when in Vcr, will definitely stay here again.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vancouver Island, Canada", "Title": "“Big suites, very clean, good linen, great location, excellent service!”", "Author": "sparklemarilyn", "ReviewID": "UR120353636", "Content": "Tucked on a leafy side-street bordering Stanley Park and Lost Lagoon, blocks from busy Denman Street, ethnic restos, the beach, and a five minute bus ride from downtown, we'll certainly return to this newly reno'd former apartment block, now a charming and unassuming boutique hotel. Check-in was quick. Knowledgable, attentive operations manager, Kent Chan, gave us a good map highlighting the area, and suite 305 was an exceptionally clean, large modern one bedroom with full bath and kitchen! Discovered through Tourism Vancouver's website, the special seasonal rate was $119, certainly a bargain at this location! A cab ride from downtown is about $10, and transit is two blocks away. The park trails lead a short distance to the renowned seawall and English Bay beach, and there are tennis courts, a shopping area, community centre, ethnic restaurants and exceptional 4* dining establishments nearby. (notably Adesso Bistro and Raincity Grill) Staff seem eager to please and one can pay a little extra or apparently be upgraded to the fireplace suites, some even with themed vintage decor, but all with modern conveniences including flat screen tv, duvets, comfortable yet firm pillow-top mattress, fine linen, and well appointed kitchens. We were interested in the Katherine Hepburn penthouse with rooftop deck and vistas so will look further into that for our next trip. Our suite, though lovely, faced an inner courtyard of sorts, quite near the controlled entrance, which could get a bit noisy at night with the rather loud voice system, however with windows closed this wasn't a problem. Three small amenities, standard in most other hotels, would have been appreciated....a full length mirror, notepad and desk pen, and an ipod docking station/cd player, although there was a tiny alarm clock radio in the bedroom. I was assured that many other suites had mirrored doors, so perhaps this has just been overlooked here. Helpful also would be a do/ do not disturb sign as we were woken quite early, but a post-it note on the door would also do the trick. Regardless, Rosellen Suites are a great value in a wonderful quiet location and we'll return of course!", "Date": "November 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Great Location for family get together”", "Author": "quiches", "ReviewID": "UR120046296", "Content": "Comfortable,clean suites. Very nice space for family gathering and location that can not be beat , very quite as well.", "Date": "November 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Location": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Wonderful family vacation!”", "Author": "Robert S", "ReviewID": "UR119935698", "Content": "Outstanding customer service! Clean, comfortable and many extras which made our stay in Vancouver a wonderful experience. Close to parks and within walking distance to many of Vancouver's attractions.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nelson, Canada", "Title": "“Excellent Stay in Vancouver”", "Author": "Lana D", "ReviewID": "UR119635340", "Content": "We usually stay in a hotel when visiting Vancouver, but this time opted for the convenience of an apartment for the same price. Our 5 night stay at the Rosellen was excellent. Located on a gorgeous tree lined street in the quiet West End of Vancouver, the Rosellen provided a very comfortable apartment for our stay. While we didn't plan to \"cook\" (preferring to enjoy the wonderful restaurants in the big city), it was so convenient to be able to make breakfast/snacks etc in the suite. Our suite had 2 large bedrooms, one bathroom, spacious livingroom, dining area, and a compact kitchen including dishwasher! Everything we needed and more -- including daily maid service. The location is superb and the area is very quiet yet so convenient to downtown, restaurants, shopping and, of course, Stanley Park. Thanks so much to all of the staff. We certainly plan to stay at the Rosellen on our next visit.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hamilton, Canada", "Title": "“Thanks to the Rosellen Team for a Great Stay!”", "Author": "Tone333", "ReviewID": "UR119570642", "Content": "We stayed at the Rosellen Hotel in early October 2011 for our first time for 3 relaxing nights. Our stay here was the last leg of our Western Canada trip that I treated my retired parents to, and it was a great way to end our vacation. The Rosellen is in a quiet, clean, West Vancouver residential neighbourhood, and is close to all Vancouver's major attractions. It appears to be a 70's era apartment building that has been converted into a hotel. We booked here because of the good reviews that we had read on tripadvisor.ca and Booking.com, but to be honest had just a little bit of doubt because of a couple bad reviews. That doubt was unwarranted. The front office management team (Ken, Tag, and Kent ) were very welcoming and helpful when we arrived. We were upgraded from a 1 bedroom to a 2 bedroom suite when we checked in. As we made our way to our room, we noticed that the common areas (lobby, elevator, and hallways) are very clean but basic, but upon entering our huge suite we were pleasantly suprised to find how very clean, modern, and fully equipped it was. All the positive reviews that we read were true.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, WA", "Title": "“Away from the noise, but close to everything”", "Author": "DianaSeattle_WA", "ReviewID": "UR119166227", "Content": "This is the first time we stayed at Rosellen Suites and we're very happy we decided to give it a try. The hotel is located in Vancouver's West End and we loved the close proximity to downtown, English Bay, Coal Harbor, and best of all, Stanley Park was practically at our doorstep. It is only a short walk to Denman Street with many restaurants and shops. The employees were very helpful and pleasant. Tag checked us in early, which we appreciated, and gave us maps and useful information about the area. Our room was very nice, a one bedroom unit with a full kitchen. It had everything we needed. We were only in town for one night, but definitely plan to stay here again soon for a longer visit.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wollongong, Australia", "Title": "“Aussie family review”", "Author": "Larissa H", "ReviewID": "UR119010160", "Content": "We stayed here for 3 nights from Sept 29th. Located on nice, quiet tree-lined street but only 6mins to local supermarket on cnr of the busy Denham-Robson Streets. Stanley Park about 4 mins away and the aquarium is within an easy 20min walk as well. Hotel staff couldnt do enough for us, very helpful. GREAT location and really good value for a 2 bedroom apartment", "Date": "October 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hervey Bay, Australia", "Title": "“Great Accommodation”", "Author": "Bob S", "ReviewID": "UR118830963", "Content": "A great place to stay. We arrived at 9am in the morning, way before check in time. We didn't expect to be checked in so early, but were greeted by friendly staff and advised that our suite was ready and upgraded to a better suite. This was welcoming as we had traveled from Australia non stop and were looking forward to a shower and a sleep. We found the staff just great and it was a very clean and nice suite and located in a terrific spot near Stanley Park and Restaurants. We had stayed overnight at a 5 star hotel at the Sydney Airport and the Rosellen was much nicer and staff were far more Friendly. The Manager Tag and his staff are some of the best we have uncounted in our many travels of countries throughout the world and should be congratulated.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Charles, Illinois", "Title": "“Lovely Place to Vacation”", "Author": "waynekay55", "ReviewID": "UR118616651", "Content": "My husband and I spent a week recently at the Rosellen Suites and absolutely loved it. We chose this hotel because our son lives in a nearby apartment building, otherwise we may not have found this charming, well located place to stay. The place is well maintained, clean, close to Stanley Park and so many attractions in the city. The hotel holds so much charm and character, and the staff is absolutely wonderful. Kent was on the desk most of our visit and he couldn't have been more helpful, his quiet laid back demeanor was as charming as the hotel itself. Thank you Kent for all of your help from the minute we checked in until we departed. We will be making many trips back to Vancouver to see our son, and will most definitely be staying again at this lovely hotel. My husband and I have never felt so comfortable and well taken care of any where we have stayed before. Thank you, especially Kent for everything. Katherine Evans", "Date": "September 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Richardson, Texas", "Title": "“Hidden gem”", "Author": "momuvami", "ReviewID": "UR118498603", "Content": "On a ski trip with my mother-in-law, friend, husband and two toddlers, we stopped in Vancouver on our way to Whistler and stayed at the Rosellen Suites. For an incredibly low price, we had a clean, comfortable two bedroom apartment with a sleeper sofa that easily accommodated all of us. It had a full, well-appointed kitchen (which was terrific with the little ones) and TV. They provided a crib at no charge. The hotel is located in a quiet neighborhood, and offers reserved parking spots. The proprietors were very friendly and helpful. The hotel also is walking distance to several restaurants, a pretty playground park, and only a short drive to other attractions. It was a great bargain and we will definitely stay here again. Be aware that the parking was accessed only by some pretty steep stairs.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Great Hidden Gem”", "Author": "pmichaud", "ReviewID": "UR118425462", "Content": "Stayed at the Rosellen Suites on our way to the Island. From the moment we called to reserve we were treated amazing. The staff is wonderful The facility itself is very beautiful, two large bedrooms, living space, kitchen and dining space. Bathroom small but very clean. Steps away from the Lagoon side of Stanley Park, the Ocean Wall, Robson Street. Small off leash area for Dogs close by. The site is locked at night accessible only by a Code. Parking charge $12.50. Pet Fee $15.00 we took our dog no problem. Will definitely stay here again", "Date": "September 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Excellent!”", "Author": "emilyau", "ReviewID": "UR118394904", "Content": "We stayed in one of the one bedroom suites at Rosellen Suites in mid-August. The staff were very helpful, the bedding, bathroom and kitchen were all in good condition and clean. Housekeeping did a wonderful job for the week that we were there. The price is also decent for the location. The neighbourhood is quiet and is close to major bus stops offering transfers to the sky train, restaurants and English Bay.", "Date": "September 21, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Camano Island, Washington", "Title": "“Rosellen Suite at Stanley Park Vancouver, BC”", "Author": "Sharron500", "ReviewID": "UR118120552", "Content": "We had a wonderful suite at the Rosellen Suite. There were three adults and three children. There were 2 baths and two large bedrooms, plus a fully equiped kitchen and a large dining room. The decor was very well decorated, much more then we have ever seen before. The staff was unbelieveable, what ever you asked for, they had it there for you right away, no waiting for anything. There were three flat TV and a sofa that made into a large bed. Their grounds are beautiful. Just a block away from the entrance to Stanley Park. I would recommend this place to anyone or families, they do have weekly rates if you are planning on a long stay. You won't be disappointed!!! http://www.rosellensuites.com/", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto", "Title": "“Great hotel, good service!”", "Author": "EladToronto", "ReviewID": "UR118012742", "Content": "The Rosellen Suites is a really good hotel located in the West End of Vancouver. At first, we arrived in the hotel that is in an old building and was kinda surprised, but the hotel from the inside was really clean, comfortable and had large rooms. The staff at the hotel is very friendly and accommodating, gave us ton of info about the city. The hotel is located on Stanley park, a really big park in the city, the Vancouver aquarium is there and its really nice to take a walk or cycle on the sea wall, surrounding the park. The only \"bad\" thing I have to say about this hotel is that it's a bit far from downtown Vancouver, but is located on a main street with access to bus lines that take you straight downtown in 15 min. We'll be back at this hotel on our next vaca in Vancouver!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Epsom, UK", "Title": "“Friendly, Quiet, Spacious and right next to Stanley Park!”", "Author": "Victoria37", "ReviewID": "UR117751875", "Content": "Review for Trip Advisor of Rosellen Suites My husband and I stayed at Rosellen Suites from 16th – 22nd July 2011. We already knew that it was an older apartment block, so that did not come as a surprise. Any negatives due to this were definitely outweighed by the plusses – namely friendliness of the staff, its location, and size of apartment. I would say though that the windows really do need replacing – in our suite we were unable to close them fully. The kitchen had everything one needed to cook a meal – the full oven was very useful and the dishwasher much appreciated. The housekeeping staff kept the apartment clean, and they too were very friendly. As our stay at Rosellen was at the start of a 3 week holiday we really appreciated being able to use the laundry at the end of the week. Washing powder is available from reception in reasonable size packets so you don’t have to buy the huge boxes on sale in the supermarket! Located only a few minutes walk from Stanley Park, in a quiet leafy street, restaurants, banks and supermarkets are close by (about a 7 minute walk), on Denman Street. You can also catch buses to Downtown from there, and they are pretty frequent. If you prefer to use foot power then Canada Place is a 25-30 minute walk away. English Bay beach is a 10 -15 minute walk from the hotel. We ate in most of the time in the evenings, but we did splash out on a visit to the Fish House in Stanley Park – expensive but well worth it, and the service was excellent. Reception staff were extremely helpful, and when we had a problem with the bathroom washbasin it was fixed the same day. We had more or less given up on being able to visit Victoria and the Buchardt Gardens on a day trip without spending a fortune or getting up incredibly early, but the staff researched our options, discussed them with us and booked our preferred option for us. Taking a sea-plane for the outward journey, and returning by ferry worked well for us (sea-planes leave every 15 minutes from the dock which is within walking distance, so there is a good choice of flight times), giving us plenty of time to explore Victoria before catching the coach (already booked) to the Buchardt Gardens, where we had 2½ hours to look around before picking up the coach again for the onward trip to the ferry terminal. Being from the UK we Brits do love our cup of tea in bed in the mornings, so an apartment such as that at Rosellen Suites suited us very nicely. Our next two weeks were spent on a Cruise and Land Tour to and in Alaska, but boy did we miss our little kitchen at Rosellen and our morning cup of tea in bed, not to mention in the 4* pre-cruise hotel, where there was only a $30 breakfast on offer! We would certainly recommend Rosellen to other travellers – don’t go there expecting a modern glamorous hotel and you won’t be disappointed. Instead enjoy the friendly helpfulness of the staff and the large, comfortable suites in a lovely area of Vancouver.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Reston, Virginia", "Title": "“Terrific hotel and staff, we definitely want to return.”", "Author": "Jim H", "ReviewID": "UR117673127", "Content": "My wife, son and I just returned from spending a week at the Rosellen Suites and found nothing to complain about and everything to praise. The location of the hotel in Vancouver's West End less than a block from Stanley Park was ideal. We had never visited the city and heard positive things about it so decided to give it a try. The hotel's location was perfect. Every day we were out walking in Stanley Park and throughout the downtown. Our suite had no problems and was quite comfortable and clean, with a nice view of the mountains as well. The staff was so helpful and friendly, we could not believe it, had never experienced anywhere such courtesy and willingness to provide us with tips about places to see, restaurants to choose from, nearby places to rent bicycles, best ways to get where we wanted to go, a useful way to see Victoria that saved us plenty of time and enabled us to see more while there on a day trip. Tag, Kent and Ken at the front desk always made time for us and provided us with sightseeing options that we had not been aware of. If there was an award for best Vancouver hotel staff, their friendliness, practical suggestions, and helpful overall approach would make them the unquestionable winners. They also communicated with us before arrival to see if we needed any additional sightseeing details. The housekeeping staff kept our room clean. In significant degree due to the friendliness of the staff and location of the hotel, we came away with a very positive experience in Vancouver and look forward to returning.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Hong Kong, China", "Title": "“No air con”", "Author": "GLT_HK", "ReviewID": "UR117564336", "Content": "The hotel is a nice boutique hotel in a great location, but didn't realize there was no air-con in the hotel. Weather wise in the evening is ok without the air-con, don't feel hot, but as we need to leave our windows open, can get noisy. Staff are generally helpful and friendly. Daily housekeeping will only include changing of towels, no refills of coffee, so be prepared.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Saskatoon, Canada", "Title": "“We'll stay again if we're ever back”", "Author": "Carolynn D", "ReviewID": "UR116958348", "Content": "We and our 8 year old grandson stayed at Rosellen Suites for two nights. We arrived earlier than expected. We hadn't been advised of check in time but were accommodated quickly. We had booked several months ago and at that time a two bedroom suite was unavailable. Upon asking during check in we found that a two bedroom one bath was available which we accepted happily. But then we were ungraded to a two bedroom two bath on the main floor which was greatly appreciated. We found the suite comfortable and well equipped for what we needed - except the scissors in 106 could be replaced! I was especially happy to have a dishwasher. Groceries were close by, Stanley Park just a short walk and English Bay and the beach even closer. We didn't have a vehicle so I'm unable to comment about parking but taxi rides to any of the places we wanted to go were a reasonable price. Friends who have stayed there numerous times over a number of years had recommended this place. They cook gourmet meals when they're there so you know kitchen facilities and equipment are adequate! We found the staff helpful and they quickly provided towels for the beach upon our request. For the price this was excellent value - we had stayed in a five-star hotel in downtown Vancouver for two nights before this and found Rosellen Suites every bit as comfortable with a lot more space (especially with an energetic 8-year-old) and free internet (hotel charged $14.95).", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "3.0", "Value": "2", "Service": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Mixed results”", "Author": "Amymacarthur", "ReviewID": "UR116633109", "Content": "Reception staff are wonderful and very helpful. But Rosellen is an old apartment building converted into rental units. Spacious but OLD. Location is a bit dodgey but convienent. Clean but so dated it doesn't feel that way.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Kendal, United Kingdom", "Title": "“Lovely staff and excellent location”", "Author": "sarahjvt", "ReviewID": "UR116577114", "Content": "My husband, young son and I stayed here at the end of our Canadian holiday. The location is superb - a residential area with Stanley Park at the end of the road and only a few minutes walk from the main shopping area. Every member of staff we met could not have been more helpful, especially when my son was ill on the last day and we needed assistance. Whatever the suites lack in modern amenities, is more than made up for by the lovely staff and the excellent location. We would definitely return.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Kingston, On", "Title": "“Would highly recommend Rosellen Suites”", "Author": "Wendy N", "ReviewID": "UR116574376", "Content": "Our 2 families stayed 4 nights. Had a 2 bedroom 2 bathroom executive suite and a 2 bedroom 1 bathroom suite. Both were upgrades from what we had booked. Location is great, short walk to Stanley Park for International fireworks competition. Beds were comfortable and apartments were very clean. Staff was friendly and helpful. I would recommend this to anyone looking for a place to stay downtown.", "Date": "August 11, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Good value city stay”", "Author": "PeterW63", "ReviewID": "UR116352493", "Content": "Suites are large and decent value for a city location. Great location right next to beautiful Stanley Park. Things are bit dated and beds aren't the best but for the price we were very happy.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Life Savers”", "Author": "Sumomo89", "ReviewID": "UR116287666", "Content": "We just had a situation where our apartment was flooded. While looking for accommodations the entire city was sold out. Friends had previously recommended that we try Rosellen Suites as they had stayed there before. Even though they were also sold out they were so helpful to try to accommodate us and eventually got us a suite, made us feel right at home once we arrived, and couldn't have been more compassionate with the situation we were going through. We now know why it was recommended to us and we will most certainly recommend to others.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Great location and friendly staff”", "Author": "Katway", "ReviewID": "UR116270739", "Content": "Love this location in Vancouver..close to everything and walking distance from the best nature and restaurant areas in town. The staff is simply excellent on all counts. It's he rooms keep this hotel from being a 5 star. The rooms are clean, but could use some minor updating. Also, Vancouver, like any major city, has a number of homeless people. That doesn't bother me; but given the proximity to Stanley park, there's a lot of noisy rummaging through the hotel trash in the evening and early morning hours. I'd recommend a room facing the front of the building.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "4"}, "AuthorLocation": "Sarasota, Florida", "Title": "“Try somewhere else...”", "Author": "LovetoTravelSRQ", "ReviewID": "UR116110140", "Content": "I'm sorry to write a bad review but I can't help myself. We visited Vancouver in late May and had reservations at Rosellen. I have been travelling my entire life and I have never checked-out of a hotel the same night I checked-in... It started when we arrived and could not get into the building b/c the code provided was not working (we were checking in after 6pm). Another visitor came out and opened the door and told us she could not get in either but kept calling and eventually the operator let her in. You are provided a code to open the box where you find your keys. Every other guest's keys are in this box so there is no security. It doesn't make sense. When we returned to our car to get our luggage we were accosted by a racoon. We could not get up the stairs to get back to the hotel b/c the racoon was domesticated enough to not be afraid of us. It ended up working out b/c the homeless man who lives under the stairs told us the racoon was harmless. I felt like I was on Punked b/c it was one thing after another. We did finally get into our room - it has not received any updating since 1970 and there were stains on the carpet. Needless to say we called and made arrangements to leave the next morning. We had a difficult time finding another room so we made our way to Victoria. The one positive point is that the management did not give us a hard time about leaving right away. They only charged us the one night and were very professional. I feel bad writing this review but this hotel almost ruined our trip and we had to go through additional expenses and trouble to rectify the issue...and I wouldn't wish that on any traveler.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Palmerston North", "Title": "“Spacious, Great Value Close to the City”", "Author": "mpeacey", "ReviewID": "UR115928879", "Content": "We really enjoyed our stay at the Rosellen Suites. The apartment was large and spacious with two double rooms and a foldout couch in the lounge. Everything was clean and tidy, although the decor seemed a little dated, which was nothing to worry about. The location is excellent, being so close to Stanley Park, although those on business in the city might want to consider something more downtown. For us it was great being able to go for walks and would be much quieter than anything downtown. The kitchen was well-equipped and there was a small dining table with chairs - not really big enough for the six of us, but we weren't doing proper sit-down dinners anyway. We were awoken at 1am one night by the fire alarm, which was less than ideal - especially seeing as there was no manager onsite. We waited (initially outside in the freezing cold, and then in the foyer) for a good 20 minutes before we were allowed back to our rooms. The next morning there was a note of apology from the manager. Overall, the fire alarm experience wasn't enough to put us off (these things happen), and we would happily go back to stay, especially for the great price we got.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Estero, Fl", "Title": "“Excellent accommodations, service and location!”", "Author": "Michael K", "ReviewID": "UR115799366", "Content": "Our group of four couples rented two suites here recently. We were very pleased with the roomy suites, the outstanding service from the front office staff and the excellent location. For the price, you couldn't do any better. We would highly recommend the Rosselen Suites to anyone who has an opportunity to visit this beautiful city. Alaskan Travelers", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "brisbane", "Title": "“Will stay there next time in Vancouver”", "Author": "crhsmith", "ReviewID": "UR115608203", "Content": "Had 1 bedroom apartment for 2 nights, fully self contained with kitchen, our apartment comfortable and clean, couple of streets away from Denman street restaurants and Safeway, Could have walked to Stanley park if we had time. Quaint lift (only small). Underground parking a bit tight (especially if you driving a left hand car for the first time!). We''ll be back.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tillsonburg, Canada", "Title": "“Good value and excellent location”", "Author": "AEA41", "ReviewID": "UR115430190", "Content": "We (two senior couples) stayed in a two bedroom \"personality suite\" for three nights in June. The unit, which overlooked Barclay Street, was well furnished and clean and housekeeping visited every day (which we didn't expect). The staff were friendly and cooperative. The location is excellent with its proximity to Stanley Park and to Denman Street and its numerous restaurants.", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Seattle", "Title": "“Home away from home in Vancouver”", "Author": "Janet063", "ReviewID": "UR115130775", "Content": "We love staying at the Rosellen Suites in Vancouver. Each suite is its own apartment, complete with full kitchen and dining room. You can fix your own lovely breakfast, then walk out the door, turn left and enter Stanley Park. The folks who manage the Rosellen Suites are friendly and helpful. You can bring your dog here. You can walk to some of the best restaurants in Vancouver. Then end each day with a stroll around Lost Lagoon. We highly recommend Rosellen Suites.", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Service": "5"}, "AuthorLocation": "Seattle", "Title": "“Rosellen Suites is a treasure”", "Author": "mission419", "ReviewID": "UR115094009", "Content": "We booked two nights, having found Rosellen Suites online and chosen it for its proximity to Stanley Park. It was even closer than it looked on the maps, go out the front door and turn left and it was at the end of the block. When we got there we were warmly greeted by Ken, who proceeded to tell us everything we needed to know about the area and located everything on a map we got to take with us. We were given an upgrade to a two bedroom suite without even asking. The suite itself delighted, having a full kitchen (very well equipped), a foyer, two desks, a dining alcove, a master bedroom with walk-in closet. There was a basket with goodies, including popcorn for the microwave. Not that we needed this, but there were two TV's. The thing we liked least, but which was very doable, was the small space in the bathroom for storing one's own toiletries. On the other hand, they are totally generous with towels, providing way more than we ended up needing. I was training for a fundraising event early in the fall, so the walkable location was a major highlight for me. I got to circumnavigate the Park, then walk downtown, a distance of a little over a mile. I returned to the Park many times and logged all the miles I needed in beautiful surroundings. Check out the Rhododendron Gardens, lovely to walk through and close to the Rosellen. The hotel is located in a very quiet residential area, but only two blocks from the local restaurant and shopping scene, which has every different kind of cuisine one could want. This hotel is more like a European pension, given that there is no restaurant or room service. We loved the quiet and the approach to the hotel, which includes peaceful sounds of a fountain in the outdoor front court. Once, when we were leaving for the Park, another manager came outside after us to give us coupons for the Aquarium. That is the general level of attentiveness we experienced. We will definitely be back!", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "West Sussex", "Title": "“Fantastic value, location - would thoroghly recommend”", "Author": "Topsy277", "ReviewID": "UR114881712", "Content": "Stayed here for three nights in may and loved every second. Apartment is seconds away from the park, and is walkable into the centre of the city too. Spacious, well kept and unique, would definitely stay here again when visiting this fabulous city. In a quiet area, but close to great restaurants.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Rochester, Indiana", "Title": "“Great Family Lodging”", "Author": "dmccarthy44", "ReviewID": "UR114775395", "Content": "We had about a dozen of us staying in two rooms. The rooms were decorated as if it was a condo that someone decorated according to their own taste. There were marble countertops and the amenities that did not seem like regular hotel rooms. This actually added to the homey atmosphere and everything was very clean. The manager named Tet was Asian and kind of hard to understand, but you could not ask for a more helpful and professional individual. He was knowledgeable about getting around and gave me a map. He called us a cab and stored our luggage. In fact, everyone there was super nice.", "Date": "June 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Moseley", "Title": "“Excellent stay”", "Author": "Grondo", "ReviewID": "UR114201294", "Content": "This was a most enjoyable experience. The suites of rooms were comfortable and well-appointed. The hotel is beautifully situated close to Vancouver downtown and on the edge of Stanley Park and near to English Bay. The staff were welcoming and very friendly and helpful, both those on the desk and the cleaning staff. Would highly recommend this.", "Date": "June 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Most ideal spot to stay in downtown Vancouver for a group of 4 or more”", "Author": "smj881", "ReviewID": "UR110039694", "Content": "Rosellen Suites were comfortable, affordable, accessible, convenient, clean and accommodating. A group of five of us stayed the weekend at Rosellen Suites and would definitely return. The rooms had all of the amenities of home, were clean and comfortable. The location was relatively central and near banks, grocery stores and liquor stores. What really made our experience as enjoyable as it was, was the exemplary customer service we received from the owners of the hotel. They were so kind, caring and went out of their way to ensure our needs were me.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "100 Mile House, Canada", "Title": "“Could not have asked for more!”", "Author": "jaymanda", "ReviewID": "UR107811397", "Content": "From booking to checkout, we have had a phenomenal experience at the Rosellen Suites At Stanley Park. Staff was courteous, accommodating, friendly and welcoming. We were traveling with our 10 month old son and two large dogs, which can be difficult at the best of times. The location was perfect for a busy family and we appreciated the staff being very accommodating to all our needs, including an early check in! I would highly recommend this place to anyone who does not need to be catered to but rather needs a clean, comfortable place to stay where they can make Vancouver (and Stanley Park) their home for a few days or longer!", "Date": "May 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Roses for Rosellen”", "Author": "MagMagpie", "ReviewID": "UR107290622", "Content": "Three of my friends were running in the BMO Vancouver Marathon, and I came along as Sherpa and Paparazzi. One of our group had stayed at Rosellen on a previous trip to Vancouver, and booked our stay there for this trip. We often tease her that she goes for (low) price over all else, so we were ambivalent in our expectations; I was looking forward to a weekend with the girls, we figured we would be out more than in, have all travelled and found ourselves in all kinds of situations, so really had no expectations. From the moment we pulled up to the curb, we were happy. The neighbourhood was lovely, and the gardens at the Suites were very beautiful. The entrance was old-style glamour leading us to a very welcoming reception at the office. Our host, who checked us in and out, was one of the friendliest and enthusiastic hoteliers any of us had ever met, and was ready to answer any and all of our crazy questions. Our room was spacious and very well appointed. Large bedrooms, really comfy beds and linens, roomy living room and very well equipped kitchen, as well as a roomy bathroom - with LOTS of towels. Stanley Park was a block away, the Sea Wall a five minute walk and tons of great restaurants a few blocks away on Denman St. Very happy with the location and the amenities, we were amazed with the price; it was easily a third of similar accommodations in the area. Thumbs up!!", "Date": "May 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, British Columbia", "Title": "“Excellent home away from home as usual!”", "Author": "moleesmith", "ReviewID": "UR106045428", "Content": "This was my 6th stay at the Rosellen. The staff are always friendly and helpful. Our room was nicely decorated, well equipped and comfortable. This location is awesome, close to the beach, park, shopping and downtown. It's in a quiet neighbourhood. Just a terrific value for what it offers. We'll stay again. I've recommended this hotel to many friends who also stay there regularly now too.", "Date": "April 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“on the doorstep of Stanley Park”", "Author": "Leonard26", "ReviewID": "UR106012742", "Content": "clean, spacious (800 sq.ft.) 2-bedroom in quiet Vancouver west end with full kitchen; more than generously friendly staff; stayed 6 days ; parking is pricey but likely is all over Van.; 5 minutes away into Stanley Park to see Blue Herons doing their annual nesting rituals; building is older but well maintained.", "Date": "April 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vernon, Canada", "Title": "“Best place to stay with kids!”", "Author": "LOVEMYBOYS02", "ReviewID": "UR105804589", "Content": "We have stayed at the Rosellen several times over the last 5 years, and have never been disappointed. It truly is the best place to stay when you're traveling with small kids. These are full apartments with kitchens - and it is a lifesaver to NOT have to take the kids to restaurants if you don't want to. The suites are roomy and comfortable - we hosted Easter dinner in ours, with 6 adults and 2 kids. It did not feel cramped. I cannot say enough about this place - we love it!", "Date": "April 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“So quiet for sleeping, and in the most beautiful part of the city.”", "Author": "Astrae", "ReviewID": "UR101408972", "Content": "Our college freshman was home for spring break so we wanted a brief family retreat. This was the perfect location to able to walk everywhere---great food, movies and shopping nearby but on a quiet residential street just 1/2 block from Stanley Park. The website had unfortunately booked us for one night instead of two, but the receptionist warmly accommodated us with a free upgrade to a Personality Suite on the top floor. Nice layout with kitchen, dining and 2 bedrooms with comfy double beds, TVs/DVD and WiFi, great temperature control on chilly spring nights. All staff were very friendly and helpful. No fitness center on site but they'll reimburse you if you go to the community center a few blocks away. Definitely the best place for the price that we've stayed in Vancouver, we'll be back!", "Date": "March 24, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Toronto, Canada", "Title": "“Could Not Be More Accommodating!”", "Author": "Yingele", "ReviewID": "UR98797141", "Content": "We stayed at the Rosellen Suites for a month and were very impressed with the way we were treated while staying there. Our accommodations were spacious and very clean (Housekeeping staff came twice a week to clean.). The staff at the front desk could not be more accommodating. When we asked about Saturday markets in Vancouver, the gentleman at the desk did not have the information, but he subsequently went to the trouble to go on the Internet and print out the appropriate details. When Vancouver was celebrating the anniversary of the Olympics, the staff gave us information sheets about all the related events in the city. On Valentine's Day, each suite received a \"chocolate rose\" – a lovely touch! Whenever we needed directions to get to places in the city, the front desk always provided the information. Staying there for a month, we wanted to do some cooking in the apartment as well. When we didn't have certain specialized cooking utensils in our suite (e.g. roasting pan, stockpot), a simple request at the front desk was made and in minutes, the needed materials appeared in our apartment. We have nothing but praise for all the staff at the Rosellen Suites. They helped to make our stay a memorable one and our apartment there feel like home.", "Date": "March 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Perfect place for an intimate wedding reception, awesome location, charming staff”", "Author": "fishcakes69", "ReviewID": "UR87918118", "Content": "This was the perfect place for an intimate wedding reception, with friends and family staying in the other rooms for comfort and accessability. Everybody walked everywhere. No drinking and driving consequentially. We got married in the forest in Stanley Park and were able to walk there and back with our wedding party. The Katharine Hepburn Suite Penthouse was a unique and well chosen venue for our wedding reception, both before and after the wedding night. We stayed a whole weekend so that we were able to have brunch there the next day and continue to visit with friends and family. It is a huge suite with a gorgeous deck - amazing view of mountains - plus a full kitchen and two bathrooms. both tubs are soakers, the master suite being especially lovely. Charmingly old fashioned in decor with the only thing we didn't like was the wall behind the (wood burning) fireplace - dreadful colour....but otherwise just lovely. They had a bit of a dance floor even, with a bar and area for computers and such. The amazing staff were attentive and kind, and never anything but helpful. Even when one of our guests got locked out of their room in the middle of the night. awesome location - everything is close by including shopping and the beach. Charming staff and rooms were comfortable. Stellar times were had. We would rent this suite again for a big birthday party or family reunion.", "Date": "November 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Epsom", "Title": "“Good value and location for the price”", "Author": "FarandWide07", "ReviewID": "UR83895978", "Content": "We stayed three nights in early September. We were two couples and I had booked the suite on the basis of what I had read on Trip Advisor. We had a two bedroom unit which was fine, Not flash but clean and wuth everything that we required. The hotel is wa;king distance ( 5 minuyes) to the a wide variety of restaurants all reasonably priced and 5 minutes to Stanley Park We hired bikes on day and rode around. very easy. While we were only there 3 mights we managed to do a fair amount of the touristy things all without the need for a car, We would stay there again", "Date": "October 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kent, England", "Title": "“What gem of a find”", "Author": "mrscoml", "ReviewID": "UR83454086", "Content": "This Suite Hotel is amazing. We had a most perfect and comfortable stay when visiting for a week. The suite was well furnished and equipped. All bedding and towels etc were of high quality. The hotel staff were obliging and friendly, nothing was too much trouble. We also rented the Katharine Hepburn suite for a small wedding reception and it was just perfect, again nothing was overlooked by the hotel staff. The wedding ceremony took place in a small glade in Stanley Park, just a stone's throw from the hotel. Denman and Robson Street are within easy walking distance. We hope to stay again on our next visit to Vancouver. Thank you Rosellen for making our stay perfect in every way.", "Date": "October 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Beautiful comfortable home away from home”", "Author": "Hcorman", "ReviewID": "UR78672715", "Content": "Staying in Vancouver can be a challange with a kid but not at Rosellan Suites. The suite was beautiful, comfortable and quiet. All the necessities of home (wine opener, bath supples, toaster, microwave etc.) I will be staying at the suites again on my next visit to Vancouver! Thanks again to the wonderful staff :) Oh and the bedding was super plush.", "Date": "September 7, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "washington", "Title": "“Perfect Anniversary”", "Author": "sjjgkmax", "ReviewID": "UR77251050", "Content": "We stayed at the Rosellen Suites for our 25th anniversary. We absolutely loved it! We had a 2 bedroom executive suite and it was so much better than just a hotel room. While in the suite, we could all play cards in the dining room, use the kitchen area, or hang out together or separately in the individual rooms, whatever suited us. This worked really well as we brought our 3 older teens with us. Stanley Park is just a couple blocks away, we were close to many tennis courts, the dog loved his first vacation and enjoyed all the walking we were able to do. You can walk to the many restaurants and shopping on Denman and Robson easily. The neighborhood is quiet and friendly and we felt very welcome there. My husband and I had a wonderful anniversary dinner at the Fish House which was only a couple of blocks away so we were able to walk there. It was perfect! Jean and Ken Soucie and Tak are so friendly and helpful. They helped us with directions, dinner and travel suggestions, gave our dog treats and surprised us with a wonderful bottle of champagne for our anniversary! I highly recommend staying at the wonderful Rosellen Suites. It feels like a home away from home!", "Date": "August 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Butte, Montana", "Title": "“Great place for traveling with friends.”", "Author": "janfitz1974", "ReviewID": "UR76859265", "Content": "Very clean and rooms were beautiful. The staff was very helpful,friendly and polite. Some furniture was a bit old. Easy walk to everything.", "Date": "August 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cedarburg, Wisconsin", "Title": "“Clean and Comfortable but a Bit Worn”", "Author": "PMNEE", "ReviewID": "UR76736162", "Content": "We recently rented a 2 BR Executive suite for a one night stay in Vancouver and found the Rosellen Suites to be just okay. The location was fantastic; in a quiet residential area close to Stanley Park with lots of shops and restaurants, and easily within walking distance to everything we wanted to see. The suite itself was very spacious and clean, but was in dire need of some updating. The carpeting was streched out and wavy, two of the drawers in the kitchen were falling apart and the bedroom furniture was old, unmatching and with worn finishes. The master bathroom was large with a nice shower and the bed was comfortable, but the whole place was just really dated and worn. Check-in and parking was a bit confusing as there was no staff on duty when we arrived at 6 p.m. on a Friday night. If you're fussy about appearance then this is not the place for you. Considering this was the most expensive place we stayed on our vacation, ($350/night including taxes) I guess we were expecting more.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gig Harbor, Washington", "Title": "“Excellent experience”", "Author": "Bunz17", "ReviewID": "UR73509777", "Content": "Wonderful staff and the greeting was exceptional. We were upgraded to the diva suite, which we loved and perfect for our newly graduated senior. The room was great and perfectly appointed for Diva's. Lots of space inside the suite. The location was excellent right next to Stanley Park and many activities and shopping to be had. We will definitely go back.", "Date": "August 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary", "Title": "“a gem in the heart of vancouver”", "Author": "xtreme_industries", "ReviewID": "UR70820067", "Content": "this hotel is beyond expectations. amazing location half a block from stanley park lagoon and just a short walk to denman st.. staff were extremely friendly, suite was in great shape with beautiful finishes and nicely decorated. rooms were of ample size. we had a 2 bedroom suite, master had its own ensuite, 2nd bed room had 2 single beds which was ideal. it had a seperate bathroom located just outside the 2nd bedroom for the kids to use. kitchen was great, had everything you would need to make and enjoy you meals. dining room would seat six with no problems. living room was large and welcoming with flat screen tv, dvd player, digital cable. parking underground. quite location. i cant wait to go back for another stay.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Belvedere, CA", "Title": "“Convenient and spacious”", "Author": "Blessington", "ReviewID": "UR70817340", "Content": "We arrived at Rosellen Suites on Sunday afternoon and after some negotiations took an upgrade to a two bedroom \"diva\" suite for an extra charge. The weather happened to be really hot, so the lack of air conditioning was somewhat daunting. We opened windows and turned on fans and managed to make the place bearable. There is a lot of space in this suite; really a two bedroom apartment with full kitchen and two bathrooms. More than adequate for two people and perfect for a few more. The decor is attractive and the place is quite clean. Everyone working at Rosellen is cordial and helpful, and other guests seem quiet and nice. We were here for just three nights, but Rosellen would be fine for longer stays as well. While there are no breath-taking views, Rosellen is 1/2 block from Stanley Park and a short walk takes one down to the Coal Harbor Waterfront. Additionally, it's easy to walk downtown to the shopping district and Art Gallery as well as to Yaletown, Gastown, and other interesting neighborhoods. Rosellen is a fine place as long as one makes sure to get a larger suite facing on Barclay Street.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chelmsford, United Kingdom", "Title": "“Great location and quirky room decor”", "Author": "CHews", "ReviewID": "UR70293217", "Content": "We arrived late and foundd the front desk very helpful in getting us installed and pointed in the right direction for food and drink The room we had was imaginatively decorated and fun to be in although one of the bedrooms was rather small and included a need for climbing across the bed to get to the window. Not-withstanding that the place suited us and was well equiped with basic stuff. We would definately stay again and cannot fault the location. So much better than a hotel", "Date": "July 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Collingwood, Canada", "Title": "“All round great”", "Author": "burger123", "ReviewID": "UR64826010", "Content": "We have stayed at the Rosellen Suites many times and have recommended it to friends both Canadian and foreign visitors. We all agree it is a great place. We always find the staff (especially Ken and Jean) extremely helpful. The location is great, close to Stanley Park, shops, restaurants and public transport. The accomodation is good and this last visit as the Suites were heavily booked we were fortunate to receive a complimentary upgrade. We will certainly be back next time we are in Vancouver.", "Date": "May 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria, BC", "Title": "“Surprising Decor - Great Location - Wonderful Staff”", "Author": "NiceTwice", "ReviewID": "UR64082388", "Content": "From the first moment I spoke the hotel regarding our plans for our trip over to Vancouver, the experience was wonderful. The staff was so acommodating right from the start, and when we got there, we were totally amazed by the room. The decor was wonderful, the linens were beautiful which made the bed all the more inviting, and you could definitely feel like you were in a place that could feel like home for the time you were there. A really nice, well furnished home. The room welcomed us with a lovely basket of goodies compliments of the hotel staff.... No corners were missed when this hotel was being decorated. The location was completely central. The cost of a taxi to our venue (GM Place and dinner in the surrounding area) was so inexpensive. Overall I was thouroughly impressed by this hotel and it's staff. I would highly recommend The Rossellen Suites and I can honestly say you will be well looked after for the duration of your stay.", "Date": "May 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Sunshine Coast, QLD, Australia", "Title": "“Easy, safe and friendly, what more could a family want!”", "Author": "kirra99", "ReviewID": "UR54192815", "Content": "We stayed here for what was to be 4 nights, ended up being 3 because of delays. The staff were incredibly friendly (but what Vancouverites aren't!). The style of the hotel is older (i.e. a bit dated) but definitely fulfilled all our requirements. We stayed in the 2 bedroom Executive Suite with 4 adults and 2 x 3 year olds. There was more than enough room and privacy. The kitchen was kitted out with eveything we needed. The position of the hotel was in a safe area with easy access to the park, woolworths, restaurants, coffee shops, banks and shopping! Can't forget to mention the fireplace, which was wonderful as we watched the snow fall outside. We would definitely recommend you stay here!", "Date": "January 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Sydney", "Title": "“Comfortable accommodation with Very Friendly & Helpful staff”", "Author": "STAN8899", "ReviewID": "UR51829808", "Content": "My family and I stayed for several days at Rosellen Suites earlier this month. All staff that we encountered was very friuendly and helpful; they really tried their best to accommodate what the guests need, and that was certainly highly appreciated by us. We will choose to stay there again next time we are in Vancouver.", "Date": "December 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Northern California", "Title": "“Incredible location, quiet, and perfect for a larger group.”", "Author": "camperkat", "ReviewID": "UR47672521", "Content": "I met up with a friend and her mother for a family wedding. We shared a suite and had adequate privacy for all three of us. The bathroom and kitchen were a bit dated, but very clean. It was perfect for our needs as a number of family members were in the other suites and rooms. Stanley Park is a few blocks away and it is in a quiet residential area. It is wonderful to wake up to the sounds of birds singing rather than traffic. Just a few blocks away are numerous dining options, shops, spas, etc. We all took wonderful walks every day. Public transportation is also close by. We had a bit of trouble with cabs when each room called at the same time to get to the wedding.", "Date": "October 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Abbotsford, BC", "Title": "“Fabulous place...but you have to know what you're getting!”", "Author": "nightnurse", "ReviewID": "UR46269895", "Content": "I have stayed at the Rosellen Suites on two occasions.The first was January 2009 for a girls' weekend. There were four of us and we go away every year for a weekend in to downtown Vancouver. We have stayed in many of the hotels there. We loved the Rosellen as we could have two bedrooms, two bathrooms and a full living area and kitchen for a very reasonable price. In fact we only ate out once! We stayed in and cooked and lounged and watched movies and went for walks. It is located right next to Stanley Park and is within walking distance to Denman and Robson streets, both wonderful shopping areas. It is a fabulous location in a quiet West End neighbourhood. We stayed there again in June, when our daughter got married. This time we rented the \"Katherine Hepburn Suite\" (so named because she used to stay there when she would come to Vnacouver, which she did every year apparently.) This turned out to be a fantastic place to hold the rehearsal dinner and for the bridal party to get ready in the morning. It had large rooms, mirrors everywhere for the girls to put on their makeup and do their hair, a full kitchen and dining room, and an expansive wrap-around deck for our out-of-town guests to dine and enjoy the beautiful Vancouver scenery. It wasn't cheap, but for what we needed it was worth evey penny. The down side? Well, this place was built in the late 1950's, was converted into an apratment hotel in 1986 for Expo, and not much has been done with it since! So you will find the decor a bit outdated, and some maintenance and upkeep needing to be done! We found the housekeeping a bit lacking in some areas, but overall it was clean and comfortable. We would absolutely stay there again, in fact plan to later this month! So if you know what you are getting, I don't think you will be disappointed!", "Date": "October 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Banff", "Title": "“Exactly as expected. Great place to stay.”", "Author": "sekaitraveller", "ReviewID": "UR39715950", "Content": "This property is obviously a converted apartment block that caters to long stay / low maintenance guests who are looking for a great location. This is what we expected and this is what we got. We did not count on the front desk for a lot of help or information. We basically had our entire weekend planned out. We stayed for two nights and we were very happy with our choice. The two bedroom suite was very spacious. The wireless came in handy. It is an old building. We did not mind the lack of amenities. I'm sure that some suites are nicer than the one we had. If travellers haven't realized that all websites 'lie' to a certain extent to sell, then they should stay home. My major problem was with the website itself. I had trouble booking and navigating through the various pages and management should really look into it. I would certainly suggest this hotel for any one of my friends who are looking for a getaway in Vancouver. I would certainly not suggest for high maintenance vacationers who are visiting Vancouver for the first time and are looking for a full service facility.", "Date": "September 3, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "U.S.", "Title": "“Rosellan website photos grossly misrepresent quality of rooms”", "Author": "Profile1228", "ReviewID": "UR37410715", "Content": "We left Rosellan very disappointed for several reasons, including: matresses were horribly uncomfortable, there were black hairs left in the shower, shower fan was full of dust and hung down from the ceiling by a single bolt, the remote didn't work, couldn't use air conditioner without leaving window drapes open - made for very little privacy, etc. etc.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“Great location, great value”", "Author": "tkyt99", "ReviewID": "UR22622353", "Content": "We were looking for a hotel suite with 2 bedrooms and a kitchen as we have two little children, 1 and 3. The rates are very reasonable and you are a block from Stanley Park and right in downtown Vancouver. The value here is incomparable. Quiet area and very helpy and friendly staff. We rate it excellent based on value for money and an overall excellent experience.", "Date": "December 10, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hamilton, New Zealand", "Title": "“Had a great stay and recommend the Rosellen”", "Author": "Bluebird62", "ReviewID": "UR21345277", "Content": "We stayed at the Rosellen for 5 nights on our arrival in Canada and couldn't wait to get back there for the other 3 nights at the end of our trip. We had 2 couples and wanted 2 separate bedrooms with one living area and kitchen facilities. We were more than happy with the clean and spacious facilities, the friendly staff and the location was great. It was quiet and we felt very safe in the area. Very close to Stanley Park and close to buses on Denman Street or a short walk to town which we did a few times. Recommend this for families, couples or the mature traveller.", "Date": "October 28, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Amsterdam", "Title": "“old but ok”", "Author": "ArtistheP", "ReviewID": "UR20304104", "Content": "The place doesn't really look like a hotel, and neither do the rooms; it feels more like you're staying in someone's (big!) apartment than in a hotelroom. The place is clean, but quite old (windows that can't be properly closed, disorganized kitchen, outdated bathrooms). It's located very nice close to Stanley Park.", "Date": "September 23, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Fremont, CA", "Title": "“Extremely Disappointed with Rosellen Suites”", "Author": "PostivePower", "ReviewID": "UR19592141", "Content": "Aside from its close proximity to Stanley Park, Rosellen Suites Hotel at Stanley Park left much to be desired. My family and I stayed in the largest available accomodations, an executive suite, but there was nothing \"executive\" about it other than its size. The room itself was larger than most suite hotels, however, this alone was not enough to make up for its many inadequacies: (1) smelly room, hallway, and stairway; (2) huge chips all along inside of doorway entry and at least one hole in the wall; (3) no air conditioning; (4) windows that do not shut completely; (5) old, mismatched furniture (room did not look anything like what is pictured on the website); (6) lamp did not work; (7) refrigerator handle was grimy and felt greasy; (8) headboard was loose and made a lot of noise; and (9) toilet kept running (was told to just jiggle the handle). Although it appeared that the hotel had been updated at some point, the updating was minimal and shoddy. The furniture was mismatched (e.g., black plastic coffee table, end table, and dining table circa the 1980's juxtaposed with what appeared to be somewhat newer brown wooden furniture). The bedroom furniture and bedding was very old and rundown; the sheets and pillowcases were rundown and worn thin. A portion of one of the drawers in the bathroom had fallen off. The bathtub was on the older side and had only a rubber stopper/plug which was mildewed. Overall, the hotel and my room was dirty. I caution anyone who is considering staying at this hotel to reconsider. It is not worth the cost. Unlike most hotels which provide for a 24-hour cancellation policy, this hotel requires a 7-day advance cancellation.", "Date": "September 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "fremont,ca", "Title": "“Love the location, like the service, but not the room itself”", "Author": "TravelMoreWorld", "ReviewID": "UR18985130", "Content": "We have just came back from Vancouver, had stayed in the hotel for 3 nights. We were there late at around 7PM which is after the lobby opening hour from 9am - 5:30PM. I didn't get the late check in information at the first place, it could be my own fault that I didn't ask for it. I called the number from the intercom system outside the hotel. After a couple of try, I got in the hotel, but still didn't know how to unlock the key box. Luckiely enough I have met a couple who checked in late as well and know the passcode to unlock the keybox. Our room is at #108 first floor. I think this is probabely the worst unit in the whole building. The bathrom is next to the corridor, the bedrooms are next to the street, the kitchen is next to the entrance of garage. Two bedroom, eough bed for five of us. The room is at the small side, kitchen is small but equipped with everything we need. I am very dissapointed with bathroom, two bedroom suite with only one bathroom, and very small and run down. When we were there, the next door building is ding the remodeling, it was very noisy. When I booked hotel, we didn't expect to rent a car, so I didn't reserve a parking spot. But we had rented a car as a last minute decision, though the front desk is closed, but with a few phone calls I was still able to get hold of someone to arrange the parking space. The house keeping comes twice a week, it was fine with us. The location is very nice, just a few blocks away from a busy street, with shops and restaurant, very convenient. Stanley park is just a short stroll away. When we check out the last day, we were able to store the baggage at the front desk for half a day, and was able to print our boarding pass in the front desk. Overall stay is pleasant. But I will try a different hotel in the same area next time.", "Date": "August 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Alberta", "Title": "“The Rosellen Suites, Great place to stay!!!!”", "Author": "golfwidowAlberta", "ReviewID": "UR17390426", "Content": "We recenty spent 4 nights at the Rosellen Suites with family and friends that came over from England. The accomodations and the staff could not have been nicer! The location is 1/2 block from the Lagoon on Stanley Park and it is an easy walk to restaurants, grocery shopping,Stanley Park and more. I would definately recommend the Rosellen Suites to eveyone and we will be very excited to visit Vancouver again soon and stay at the Rosellen Suites again. I would give it 5 stars for efficient and friendly staff and service, cleanliness, size of the suite and the central location!!!", "Date": "July 1, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Freeland (Seattle) WA", "Title": "“Loved the location”", "Author": "Shahbazie", "ReviewID": "UR16423675", "Content": "I booked a two bedroom suite at this hotel after reading the reviews on this website and looking at its location on Google maps. After visiting W. Vancouver last summer, i wanted a location close to Stanley Park so that we could stroll to and enjoy exploring the park and its amenities with the kids. The neighborhood for the building is great and well kept. Neighbors are friendly and its just two easy blocks to the shops and resturants on Denman. The foyer of the hotel has a easy worn charm. The manager was a nice enough gentelman. The room #107 was on the ground floor with the living room window facing the alley. Not the best location I thought. The 2 bd unit was quite warm and i was surprised to find no central AC in the living room but the two bedrooms had a unit each, retrofitted into the glass windows. The kitchen was smaller than i expected. and there was just a single full bath. Overall, everything was old and a bit worn but clean. I doubted the two small AC units would cool the living room judging from their recessed locations and i was correct. I left the units on all through the stay and when we got back after an afternoon of exploration and wandering along the English Bay waterfront, the living room was still quite warm and still slightly less that comfortable. The following morning, we went a block and stepped into Stanley Park with the intent of walking to the aquarium that was located in the park and we found the pedestrian trail along Lost lagoon. The day was warm and sunny and the edge of the lagoon was sprinkled with sleeping ducks and geese. The willows provided a speckeled shade from time to time and the walk was thoroughly enjoyable. The Vancouver Aquarium turned out to be quite interesting. My 7 5 and two year old boys enjoyed every display. My personal favorite was the Amazon exhibit. After the aquarium we wandered along the waterfront and then back up Denman street to the hotel. A nice day's activity. Notable was the lack of maid service when we returned that evening . Then to find out that maid service was every other day, which is ok but not preferable with 3 kids. Day two didnt improve the cooling situation. The living room area was small but with the lack of cooling seemed a bit opressive. The kids didnt notice , just the adults. Next morning we awoke to discover that one of the cars was broken into..one of four cars vandalized, in the secure underground parking garage. ! what a downer. The manager was apologetic and equally well-prepared with vacuum cleaners, plastic , tape and phone numbers to log a case with the local Police for insurance claims. I was quite disappointed that at the end of it all, the sense of safety of personal possessions was lost. Glad we didnt leave valuabls in the van . My reccomendation- for the price, stay in a hotel wth better security. Its not worth it to have your car damaged and items stolen during a weekender at this hotel in Vancouver.", "Date": "May 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "alberta", "Title": "“Like your own apt in the west end”", "Author": "lauriedrumheller", "ReviewID": "UR15234758", "Content": "Clean apt. in a great neighbourhood. We had a one bed. suite that was disappointingly much smaller than pic's on website but it was a smoking room so you know you won't be offered the best suite in the place ! Our bedroom window faced a side exit which was extremely noisy at night. Bathroom was very tiny and worn out looking. T.V. loudness control had been permanently altered - couldn't hear it well when turned to full volume!! Staff was very friendly and knowledgeable about area. Neighbourhood is really lovely and very close to shopping on Robson St. and Stanley Park. Lots of great restaurants nearby. Would stay again definitely but might be willing to smoke outside and have a bigger room or book one with a balcony instead!", "Date": "April 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Nanaimo, Canada", "Title": "“Great for the price”", "Author": "BuccaneerDave", "ReviewID": "UR12514832", "Content": "We stayed for 3 nights in a Director's Suite. It was massive. Had 2 separate bedrooms, full kitchen, dining room and living room with a fireplace (but no firewood). The suite we were in, 303, was pretty clean but the furnishings and decor are dated. Could use a fresh coat of paint in the kitchen but the outstanding location next to Stanley Park and Denman Street more than make up for it. The bed was very comfortable. The parking area out back, that many other TripAdvisor members have talked about, looks a bit dodgy but is fine if you are familiar with the West End. We had no problems. Hands down, best Japanese food we've ever had outside of Japan, is a couple blocks away at Kingyo Izakaya on Denman Street. We stay in many different properties in Vancouver, depending on what we are doing in Vancouver, and this is one we will stay in again, especially if we want to walk around the West End and eat on Denman Street!", "Date": "January 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“Highly recommended!”", "Author": "kittycAustralia", "ReviewID": "UR11469669", "Content": "I stayed at this lovely hotel in December, 2007. I cannot say enough about how much I enjoyed my stay at this great hotel. Reasonable rates, absolutely fantastic location and clean, spacious rooms are only the start. The staff at the hotel are wonderfully helpful and were always cheerful and friendly. The closeness to beautiful Stanley Park and a short stroll to tasty restaurants and downtown shopping makes for a peaceful and trouble-free holiday. Top marks for a memorable stay in one of the world's great cities!", "Date": "December 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toowoomba", "Title": "“Absolutly the best value for Money & best location in Vancouver”", "Author": "Alimac7", "ReviewID": "UR10708097", "Content": "Rosellen Suites was one of our favourite places to stay during our entire Canadian trip. Located next to Stanly park in a beautiful leafy neighbourhood, we felt very safe at night walking to the restaurants & shops just a few blocks away, the location is perfect. The best thing was the apartment we had 106 - was very roomy - two bedrooms , two bathrooms, a lounge room, dining room & full kitchen, all spotllessly clean & very comfortable beds. Traveling with a family of five we found many other places more much more expensive & cramped with no cooking facilities let alone a dining room as well. Yes the decor is a bit older,but not at all run down or shabby & we felt it was tasteful & suited the era the street was built in. The lift was a bit slow as mentioned but it did the job, (at least they have a lift )& such a small inconvenience for all the other wonderful attributes. Parking is also limited but booking ahead there was no problem. Jean in the office was so helpful & answered our constant questions with a smile every time. He also recommended a seafood restaurant only a few blocks away over looking the water \"The Boathouse\" It was sensational for seafood, would have to go down as one of the best Seafood meals ever & I have had a few across Europe, Asia USA & Australia! Also Worth visiting was the Stanley Park Aquarium, again I have seen quite a few . It is better than Sea World SanDeigo, & as good as Great Barrier Reef Australia .It is up there with the best. I booked our entire trip 20 different hotel/appartments solely using trip advisor for a family of 3 teenagers , 2 adults & 2 elderly grandparents (not easy to please every one) & we had fantastic accomodation the whole way with only one exception & we can't say we weren't warned by trip advisor (it had very mixed reviews.) I think it is a great service, definately the way to go.", "Date": "November 9, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Diego", "Title": "“Rosellen Suites is Clean, Affordable, Quiet, and Roomy”", "Author": "Traveltolearn", "ReviewID": "UR10349354", "Content": "I agree that this is a great place to stay for a family. It is more like an apartment than a hotel. It was located on a quiet residential street 1/2 block from Stanley Park, and within walking distance to restaurants, a market and Robson St shopping. The room I stayed in could sleep a family of 4, with a sofa bed in living rm and a small bedroom, plus fully equipped kitchen and dining room. It's affordable, quiet and clean. The parking isn't great, in the back in an alley, but nothing to complain about. If I return to Vancouver, I would stay there again.", "Date": "October 26, 2007"}], "HotelInfo": {"Name": "Rosellen Suites At Stanley Park", "HotelURL": "/ShowUserReviews-g154943-d186061-Reviews-Rosellen_Suites_At_Stanley_Park-Vancouver_British_Columbia.html", "Price": "$148 - $289*", "Address": "<div class=\"wrap_bl wrap\">", "HotelID": "186061", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/21/d8/21d8063ec48effba0368345bdadb267b7large.jpg"}}