{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bli Bli", "Title": "“Good location right in the heart of Montreal - very quaint”", "Author": "gsvon", "ReviewID": "UR126803398", "Content": "The location was great right in the middle of the City and easy walking distance to all shops and metro stations and underground shopping. The staff were very friendly however the old Manager was finishing the day we booked in and a new one was being trained. The new manager was great and very helpful. They allowed us to leave our bags as the room was not ready and then we could go and explore montreal. I would stay there again and the breakfast provided was very good, basic but good. There was no fridge in the room though but you could get ice from downstairs. There is no lift and the staircase is very steep and not very wide but that added to the ambience of the place. Would stay again - very good. I was disappointed that on the website the room portrayed a fireplace in the picture when in fact it did not have one. Classic Double Room.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Quirky, good value”", "Author": "ExBCer", "ReviewID": "UR122174539", "Content": "Loved the location (very close to McGill), friendly staff - but the building itself was the draw for me. Odd shaped, weird stairways, confusing sightlines. I loved it. Dedicated parking was limited. No elevators (not a problem for me). Free wifi. Simple breakfast. Bottom line: well, it's the bottom line. Traveling alone, this place was a bargain. 3 nights for the price of 1.5 nights at a \"normal hotel\".", "Date": "December 28, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Never Judge a Book By its Cover!”", "Author": "Jlou101", "ReviewID": "UR121204359", "Content": "I stayed here for three nights during a trip to Montreal with my husband. Upon arriving to this hotel, I was intrigued by the brown stone style buildiing, and the warm and cozy lobby area. However, after exhaustively carrying our own luggage up the long and seemingly neverending staircase, we enter our small standard room, and are immediately overcome by a strong mildew stench that was coming from the bathroom. The shower head had green mold on it. We bought Lysol and ended up cleaning the bathroom thoroughly, ourselves. The carpet was stained from what seemed to be water damage. After we sprayed the room with air freshener, we hoped that we can begin to enjoy our trip to Montreal. However, unfortunatately this was not the case. Our first night, we were extremely hot. We had the window wide open (it was cold outside, since it was late November), yet no air seemed to get in. I had to sleep with a washcloth that was soaked with ice water around my neck. We had no control over the temperature in the room, and the hotel pumped heat through the hotel and made the room feel like it was 90 degrees. The extreme heat continued for the rest of the trip. On our second night, we were kept up by this strange loud humming sound that was coming from the shower. In addition to the noises and heat, a terrible mattress and horrible pillows contributed to the poor sleep I received. Every morning, I woke up with a sore neck, and I'm still sore after being home for two days. Also, at 7:30 am every morning, we were woken up by someone doing construction in the side of the building. I know this is not under the hotel's control, but it did add to our frustrations nontheless. We ended up accidentally dropping the one bar of soap in the toilet, and we never were given another one, so we ended up buying one at a local store. Overall, this hotel did not make this the vacation we had hoped for, and will be sure to stay at a chain hotel next time, just to be safe. Finally, we asked the front desk for some directions to a few museums in the area, and they seemed to be just as clueless as we were as to how to get around the city.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hot Springs, Arkansas", "Title": "“Good Value, Good Location”", "Author": "boneman7", "ReviewID": "UR120134746", "Content": "I stayed at this hotel after reading reviews on Trip Advisor. I had a basic room-I think they call it classic. It was quiet and very comfortable. It was very clean but probably needed a coat of paint. The breakfast was fine-nothing special-included hard boiled eggs, pastries, single portions of individually wrapped cheese, yogurt and other basic items. It was made available in a nice room. The orange juice was like drinking orange water-it was watered down pretty badly. The staff was awfully helpful, spoke wonderful English and was willing to tackle every question. The location is fantastic-right in downtown and within a twenty minute walk of the old city-port. It is two streets over from McGill University which has a very interesting campus. If you have a vehicle, the parking is very tricky. The street signs are in French and are confusing so be careful.", "Date": "November 3, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Kingston, Canada", "Title": "“Simple and Quiet”", "Author": "r q", "ReviewID": "UR117795194", "Content": "We stayed for two nights at the Hotel Ambrose. Had trouble finding on street parking, but the receptionist pointed us toward a few underground spots further down on Stanley. We found one right at Sherbrooke and Stanley, only about a minutes walk. The location of the hotel is amazing! Located at the bottom of Mont Royal, with great access to the Metro on a quieter downtown street. The reception staff are quiet and unobtrusive, checked us in efficiently. We had an economy room with private bath. No elevator. However, stairs are not nearly as bad as some on here say. We stayed on the top (3rd) Floor. I am a healthy adult and had no problems with them, maybe a little tiring after a long day. They are part of the charm of staying in a historic spot rather than a chain hotel. The room was small, but reflected the price we paid. An unexpected plus was the A/C unit, as it was quite hot and humid while we stayed. It was clean and the double bed was comfortable. The washroom was also small, but again clean and well kept. The television was again..very small..but we didn't come to Montreal to watch TV. I would say there was over 20 stations, equally split between the languages. Loved the breakfast. Lots of coffee, teas, fruit, oatmeal, toast, pastries, hard boiled eggs, cereal in a nice room with a high ceiling. Could've used maybe a little radio playing to break the silence in the mornings though :) Thanks for a great stay!", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "2.0", "Value": "1", "Service": "5"}, "AuthorLocation": "Houston, TX 77005", "Title": "“Why didn't they tell us about the stairs?”", "Author": "jbrown2618", "ReviewID": "UR117600844", "Content": "The congenial staff and good location did not compensate for the stairs-from Hell we encountered, a narrow, twisting shaft that spiraled seemingly endlessly upward to our small abode on the upper floors. (About 20 steps in front+12 steps over a \"stile\" between the two sides+ 46 steps to the top.) The owners must be investors in a cardiac center where those not possessed with the strength and will of a K-2 climber will likely find themselves after bumpity-bumping their luggage skyward. We had to schlep up and down this cousin-of-Jack's-beanstalk to the lobby for everything, such as coffee, wifi (advertised, but not in the rooms), information, ice, etc. By the end of the trip, we were tossing a coin to see who had to make the dark passage, then arguing about what heads and tails \"really\" meant if we lost. The modest breakfast (boiled eggs, cereal, cheese, juice, toast,yogurt, etc.), shared with several ants, was enough to get us to mid-day. The bathroom was clean but small, and the rug was worn and stained. The tv reception was laughable, very snowy with maybe three of the 25 or so channels in English. Be warned, this is not a two star hotel even though the price is.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Good value and location”", "Author": "Elle032", "ReviewID": "UR116177143", "Content": "Our stay was brief (one night), but pleasant. The room was relatively small, but for the price and length of stay, it was totally fine. The private bath was quite large and very clean. The location is great-- walking distance to Mont Royal, St. Catherine Street, and the Old City. The hotel itself is on a quiet side- street, surrounded by what seems to be private residences and apartment buildings. The building itself was also quiet, even at night. The gentleman who checked us in was very pleasant and even helped my boyfriend find a (free!) parking spot on the street. I can't say that such a spot always exists, but I have read a similiar post from at least one other person. It was really nice of him to do so, rather than insist we pay for the hotel's spot or a garage (which we were prepared and willing to do). The one downside is the lack of elevator. Be prepared for a climb if you're on the top floor.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Cute, friendly and perfectly located”", "Author": "Joebrown28", "ReviewID": "UR115905783", "Content": "We only stayed one night at the Manoir Ambrose but we really enjoyed our stay. We got a very reasonable price for such a great central location too. The location of the hotel is probably it's best feature, however, the customer service was also exceptional. I was especially impressed when the hotel receptionist found me a free parking spot on the street which was good for 4 days! Going that extra mile really impressed me. We climbed to the top of Mount Royal for the stunning views and shopped on St Catherine st, both very close to the hotel. We also enjoyed the continental breakfast which was included, the croissants and pain au chocolat were fresh and excellent. This hotel is not ideal if you're older and allocated a room upstairs as there are a lot of stairs, but this does not detract from what is a cute, comfortable, friendly and cost effective place to stay in the heart of downtown Montreal. We will stay there again in a heartbeat.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "New York", "Title": "“Quaint, good location”", "Author": "misscrusty", "ReviewID": "UR115121453", "Content": "Cute Victorian style hotel, odd layout, great location. Complimentary continental breakfast a plus. Newer (private) bathrooms, clean enough. Wifi worked intermittently. Staff seemed quiet so we didn't really ask them for much...Overall we were satisfied with our stay. I would mention that this hotel is more in the range of $100 per night than the $130+ we paid, so shop around for rates.", "Date": "July 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Georgia", "Title": "“Warm Hospitality in the Cold Winter”", "Author": "Shellsa", "ReviewID": "UR98763942", "Content": "My sister and I stayed at the Hotel Manoir Ambrose in February 2011. We are both from South Carolina and didn't know what to expect as it was our first visit to Canada. What we found was a sweet bed & breakfast with loads of character, conveniently located (walkable everywhere & near an easy metro stop), and a welcome host in the Hotel Manoir Ambrose. The staff was extremely helpful and friendly, recommending restaurants and providing directions. As mentioned in some of the previous posts, this hotel is in the process of undergoing some renovations. Soon the breakfast room (which is currently in a cozy ground floor room) will be moved to a prime location on the second floor right by the front desk. Oh and a word on the breakfast -- the cinnamon raisin bread is delicious toasted! Aside from that, you have many choices of hard-boiled eggs, cereal, yogurt, fruit, bagels, orange juice, coffee, etc. The guest rooms are also getting upgrades. Ours had been freshly painted. Overall, this is a warm and cozy bed & breakfast, a perfect escape from the piles of snow outside.", "Date": "March 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Perfect location for a short stay”", "Author": "worldtwanabe", "ReviewID": "UR98086152", "Content": "This hotel is on a quiet one-way side street in busy Montreal downtown. It is not quite visible from the corner of Stanley and Sherbrook. It is 5 minutes from subway station and here is taxi stand in front of the hotel. Some nice restaurant near-by and the famost Crescent street night life is within 10 minutes on foot. Perfect. Note: This hotel was converted from 2 old 3-story Victoria styled houses. Bathroom is a bit unusaul. Each room is different. The staircase joining 2 buildings is also strange. No Elevator", "Date": "February 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Comfortable, sweet hotel”", "Author": "Alammana", "ReviewID": "UR96980027", "Content": "Stayed here on a recent trip to Montreal for four nights. We received really lovely service, in three languages, no less! The building is clean and quiet, the bed was comfortable and the included breakfasts were amply laid out. While the internet access is free, you must retrieve a new login & password each day from the front desk. I wish I'd asked more about the building itself (my guess is mid-1800s). Our room had been reconfigured, like the rest of the hotel, remodeled so that new construction is mixed in with elements of the original architecture. Laying in bed, I tried to puzzle out the mix of molding on the ceiling to figure what the room had been like before. The same goes for trying to guess the meaning behind all of the different sets of stairs - they're everywhere! It's a neat old building. Location is convenient to downtown and just a block from the McGill campus.", "Date": "February 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Taipei, Taiwan", "Title": "“Exceptional value”", "Author": "urbanoutpost", "ReviewID": "UR91387141", "Content": "I love the location of this hotel, quiet and central. My room was very spacious and clean.The breakfast area in the basement is a bit disappointing, but I am pleasantly surprised by the the bagel and smoked salmon, maybe it is holiday special....", "Date": "January 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Superb value!”", "Author": "snowbo", "ReviewID": "UR90123174", "Content": "Like the other reviewers mention, this is a truly no frills hotel. It looks like it hasn't been updated in a while, but the room was adequately comfortable. Also like other reviewers mentioned, the breakfast was truly barebones, and could be improved. However, the location of the hotel is exceptional, and considering the price, it presented an excellent value. We were literally in the heart of downtown, and everything was easily accessible. There seems to be a new policy on Wifi, as it was free for us. I easily recommend this little hotel purely for it's value. Staff were extremely helpful and kind. Would come again.", "Date": "December 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Ontario", "Title": "“Not so great for the money”", "Author": "Libera", "ReviewID": "UR78339225", "Content": "We stayed here recently mostly because of the location--although there are so many hotels nearby that you can take your pick where to stay. My biggest disappointment was the mattress quality and the flat, pancake pillows. Please hoteliers--recognize how important the bed is! Forget the multiple bottles of shampoo and the vanity kits--invest in good mattresses and/or replace them regularly. The room was quite small which I can live with, the walk up three steep, narrow, flights of stairs carrying a suitcase, I can take, the bathroom--well, the shower door was off its' track, and the drain cap not tight meaning you could sprain an ankle quickly if not paying attention, I can take--but not sleeping on a soft, lumpy mattress with a flat pillow, I cannot. Also, if staying here--for your own good, place a rolled up towel at the bottom of the door to drown out noises--there is a gap and you hear everyone coming up the stairs and opening/closing doors. For comparison, we recently stayed (two weeks ago) at Hotel Jazz St. Denis for $71.00 less a nite--while the hostel was not quite as clean--the room was bigger, and the bed much, much nicer! Oh, and we did have to bring our own shampoo :).", "Date": "September 5, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Shanghai", "Title": "“Dissapointed indeed”", "Author": "chloewei", "ReviewID": "UR75706211", "Content": "After a long flight we 3 (my husband, my 5-year daughter and I) arrived the hotel and were told the room is not ready though we had booked/paid online already. You can't imagine how small/old the room is. almost no space to turn around. no any noise provention. it is a B&B but the breadfast was so poor and their staff seem hate you to take any of them. most of staff in front desk are friendly except one handsome guy who treat people English/French speaking so differently. Toni (lovely lady working as front desk) is the best.", "Date": "August 18, 2010"}, {"Ratings": {"Overall": "1.0", "Value": "1"}, "AuthorLocation": "Salmon Arm, BC", "Title": "“Rate Change After F1 Announcement”", "Author": "FairbutBlunt", "ReviewID": "UR52008273", "Content": "We booked this hotel (5 rooms) in April for $120 per night prior to the official announcement of the Montrel F1 races. After the announcement by F1 for the go ahead they informed us the room rate is $400 per night. We cancelled obviously.", "Date": "December 28, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Toronto, Canada", "Title": "“..perfect location”", "Author": "RumanaHaque", "ReviewID": "UR48604201", "Content": "just in the heart of downtown, this small hotel is an excllent option if you don't want to spend much but still want to stay in a convenient location in downtown..the staff were friendly...an old house turned into a hotel...rooms are of good size..didn't like the breakfast service (included with room) though..my overall experience is very pleasent and would like to go back and stay in the same hotel!!", "Date": "November 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Denver, Colorado", "Title": "“Good and clean but felt squeezed in.”", "Author": "tejal", "ReviewID": "UR34383227", "Content": "We went to this hotel because it was recommended by Fodors. The location is great. The place offers paid parking if you reserve it in advance. The breakfast in the morning is sufficient to fuel you in the morning. The staff is very friendly - if you are arriving early or departing later, they can store your luggage before you check in/ after you check out. Check out the stairs near the reception, looks like a mirror! However, the room was extremely small. We had shower cubicle and a sink inside the room and the toilet outside (the manager did tell us this when making the reservation). Our blanket had tiny holes in it. Also, no elevators here - you will have to carry your luggage to your room - so travel light! For what you get, the room felt pricey for $100 + taxes (which is quite high in Montreal).", "Date": "July 10, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Edmonton", "Title": "“Try to Avoid If You Can”", "Author": "Tourist118", "ReviewID": "UR7803488", "Content": "The hotel is in a great location to be downtown and close to the Metro. The standard room is VERY small and needs some work. The rugs are old and stained and the room also smelled like urine. You must beware that even though the hotel site states they have wireless internet, what we didnt know until we got here is that its extra money to get a username and password to access their server. Luckily we are only here one night because we can barely open our suitcases and you definetely cant walk around the bed with them open.", "Date": "June 7, 2007"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Alberta", "Title": "“Charm and location”", "Author": "A TripAdvisor Member", "ReviewID": "UR4366653", "Content": "We picked this location for our stay in Montreal because of its downtown location and novelty of staying in a small inn off the beaten path. We weren't disappointed. The staff was helpful and accomodating throughout our stay. Our flight arrived in Montreal at around 1am and after checking with the management in advance we were able to check in at this late hour. Even though the staffer \"on duty\" that night had to get out of bed to check us in, we still felt welcomed. Our room was on the top floor and had a private bathroom. The room was clean, well-maintained and more spacious than I expected. No, it's not as big as a room at the Hilton or Sheraton would be, but we didn't feel cramped. The complimentary breakfast was definitely not the highlight of our stay. There were a few choices of dry breads and muffins, as well as coffee, tea, juice and milk. The breakfast room felt like we were eating in a staff lunch room. This was a charming hotel for our stay in Montreal. It's definitely a different experience than staying at one of the large chain hotels, but I truly enjoyed it. As already mentioned, the hotel has a great location - just off the McGill Campus, right downtown, a block from a Metro station. I would have a hard time visiting Montreal and NOT staying at the Manoir Ambrose....I'm very pleased.", "Date": "January 21, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Baltimore, MD", "Title": "“Very comfortable at Manoir Ambrose”", "Author": "A TripAdvisor Member", "ReviewID": "UR3727932", "Content": "Our stay at Manoir Ambrose was very comfortable and quiet. Although the weather was very warm outside, the AC and the portable fan kept us very comfortable. The room was clean and roomy enough. Definitely above average for the price paid. The manager and evening staff were very pleasant to deal with.", "Date": "August 1, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Toronto, Canada", "Title": "“Glad I cancelled my reservation there!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2887029", "Content": "I am glad I cancelled my reservation at the Manoir Ambrose Inn! I am a diabetic,and due to worsening diabetic-related health issues,I was under medical advice to cancel my entire Montreal trip this week. I regret only cancelling the trip. I have stayed in Holiday Inn,:Midtown,Sheraton Midtown, also Hotel de la Montagne. All of these hotels,esp Hotel de la Montagne,and the Sheraton,are far better than the Monoir Ambrose Inn. After I sent an e-mail letter 48 hours to the Innkeeper,advising them of my reasons for cancelling,I received a rather uncivil and rude and nasty reply. They wanted to charge me for the room. Based upon the comments here,this Inn is no bargain. In the words of the Film Industry (which I work for) the Manoir Ambrose Inn is a \"Stiff\"!! In future,the Manoir Ambrose Inn will not receive any business from me. I DO NOT recommend this Inn AT ALL. There are better Inns in Ottawa,London,Kingston.", "Date": "December 16, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Ambiance and Value”", "Author": "A TripAdvisor Member", "ReviewID": "UR2606007", "Content": "I was utterly impressed with my stay at the Ambrose Manoir this weekend in Montreal. The price was 112(CAD) after all taxes (2 people). I was a little concerned because of the way they told me my suite was in the basement and the bathroom was seperate (private w/key- but outside the room). However, when I got their I thought that it was awesome - it was like a cozy basement apartment. The room looked just as good as any hotel room and the bathroom was really clean an original. The location is also perfect. Right near St. Catherines and about a ten minute walk to the train station. As well, the outside of the building had this awesome vintage old Montreal feel to it. I was completely satisfied.", "Date": "September 28, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Burlington, CT", "Title": "“Good Location,”", "Author": "A TripAdvisor Member", "ReviewID": "UR1843426", "Content": "The Manoir Ambrose is reasonably priced, quiet and in a convenient location, near the McGill campus and the nightlife on Rue Crescent. Our room was small but decently furnished, though the water pressure on the third floor made the tiny shower a bit trying. Also, the climb up the narrow, steep stairs might be difficult for some folks.Nobody should expect first-class amenities in a small hotel at that price, but one might hope for a little more charm. The staff was inattentive and rather cold and the continental breakfast was paltry and bland.Overall, it's not a bad deal if the location suits you. Otherwise, you can probably do better elsewhere.", "Date": "April 27, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Minneapolis, MN", "Title": "“None of the complaints as above.”", "Author": "A TripAdvisor Member", "ReviewID": "UR1490932", "Content": "The Ambrose was recommended in Frommer's Budget Traveler magazine and lived up to the review...it was clean, the staff was friendly and the location was good. What more do you want for $65 (US) a night. We encountered none of the problems that others dealt with...fortunately, I guess!", "Date": "November 17, 2003"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "London, ON", "Title": "“Worst hotel ever!”", "Author": "A TripAdvisor Member", "ReviewID": "UR858775", "Content": "This was absolutely the worst hotel experience I have ever had. When a friend of ours tried to call our room, the concierge would not transfer her call, and proceeded to call our room to tell us (angrily) that we had woken her up. In addition, she actually came to our room, said that we were told that we could not have a phone call after 10:30pm (which we were never told), and insulted us, saying we \"needed to learn how to hear\". Because of her rudeness, we left the hotel in the morning and stayed somewhere else the following night. She even had the audacity to make us pay for 2 nights... we were just glad to get out of there! I would NEVER recommend this hotel to anyone!!", "Date": "February 19, 2003"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“you get what you pay for......”", "Author": "A TripAdvisor Member", "ReviewID": "UR643348", "Content": "...well, the Ambrose is not the Ritz, but it is located only a block or so away. The location is great and so is the price. No, you are not going to feel pampered here, but with the money you save you can get out and enjoy the city. If you are looking to save some cash this is a comfortable place to crash. The basement rooms are a bit dank, but a great way to beat the heat in the summer. If you have a room on a higher floor, make sure it has AC.", "Date": "July 22, 2002"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "", "Title": "“Manoir Ambrose, better look elsewhere”", "Author": "A TripAdvisor Member", "ReviewID": "UR577215", "Content": "While the location near McGill is nice, as well as the exterior, the hotel is the pits! Our matress was lumpy and stained beyone belief. The rug was also stained. Breakfast had a new twist: you are advised to wash your own dishes. While I wouldnt mind this in a dorm or even a B&B, in a so-called hotel its a joke. When we decided to leave asap the next morning to find other accomodations, the manager wanted to charge us for another night! An outrage. You can do much better for less in Montreal by staying in a B&B, of which there are tons. \"Pierre and Dominique\" is a nice one in a great area. NOT recommended!", "Date": "May 15, 2002"}], "HotelInfo": {"Name": "Hotel Manoir Ambrose", "HotelURL": "/ShowUserReviews-g155032-d186190-Reviews-Hotel_Manoir_Ambrose-Montreal_Quebec.html", "Price": "$91 - $150*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3422 rue Stanley</span>, <span class=\"locality\"><span property=\"v:locality\">Montreal</span>, <span property=\"v:region\">Quebec</span> <span property=\"v:postal-code\">H3A-1R8</span></span>, <span class=\"country-name\" property=\"v:country-name\">Canada</span> </span></span></address>", "HotelID": "186190", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/c3/5d/a8/hotel-manoir-ambrose.jpg"}}