{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nanaimo, BC", "Title": "“Very Happy with this hotel”", "Author": "Showyoucare", "ReviewID": "UR128347259", "Content": "First Time staying here for just one night. Everything is great, quiet, bed are great, sheets are awesome. Clean, Big TV's, Convenient to everything. The best part is the great complimentary breakfast, with just about anything you need or want. Hey and complimentary free bottles of water, who does that today?, Free internet. Priced well.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Comfy Hotel with Friendly Staff & Hearty Breakfast”", "Author": "OZMIK", "ReviewID": "UR128293051", "Content": "Our family of 4 stayed 8 nights at this hotel before going to Whistler. This is a well run hotel & has provided for our family needs: good breakfast, close to food outlets, restaurants, public transport-Stadium/Chinatown Station, easy walk to Robson St Shopping area as well as near a Costco. Good housekeeping & a shuttle is available to go anywhere in downtown. Our kids loves playing table tennis when my wife & I could relax in the whirlpool. Tea & coffee are available all day. Staff are always helpful & friendly. Thank you so much Susan at the reception for providing us a room on the higher floor & for organising our family first ski lessons at Grouse Mountain. We had so much fun at Grouse (they open till 10pm!!!) that we spent 3 full days skiing there. My wife had a cut on her hand & Chris at the reception gave her band-aid & disinfectant spray. We had to leave at 5am & the hotel staff gave us takeaway breakfast. All these things are the reason why I gave this hotel an excellent rating even though it is not a 5 Star hotel.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "florida", "Title": "“Cannot Beat This Value!”", "Author": "honeymooners34", "ReviewID": "UR128247663", "Content": "This hotel was wonderful!!! The complimentary shuttle and bikes with the breakfast each morning really made it super great deal for us. One night after a long day’s work/adventure, we just went to the Jacuzzi and soaked our feet. The sauna was great as well!! Our room was quiet and clean with a view of the neon-lit BC Stadium. Breakfast included eggs and sausage daily with scones, oatmeals, cereals, fruit, juices – everything we needed. The waffles we made each day were our very favorite. About two blocks up the street from the hotel, 489 Robson, there was a grocery store, MarketPlace, which enabled us to stock our room refrigerator. The bicycle rental enabled trips through Stanley Park, to Granville Island, Chinatown, and Gastown. The staff was very friendly and provided great solutions to any challenge we had for them. The location was good as well. Though we were traveling to the convention center each day, the shuttle made it very convenient and we could either walk back to the hotel (which was a pleasant, 20 minute walk or so) or take the train (4 minute journey). Upon our arrival was the most pleasant orange and strawberry water. We purchased the 10 ticket books for the train from the airport (7 eleven domestic terminal), so it made taking the train very easy. The shuttle and bikes must be reserved each day. The hotel was also very safe. Hotel room keys operated the elevators and the surrounding areas outside of the hotel seemed clean and safe, no matter how late. We arrived to the hotel at dark and left in the early morning hours. They also provided bottled a water. Another bonus. It was truly a delight staying at this hotel!", "Date": "April 20, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Great location and Comfy”", "Author": "BeckyReardon", "ReviewID": "UR128021798", "Content": "My husband, friend and I spent the last 6 days at the Hampton in downtown Vancouver. The location on Robson was great.....adjacent to the stadium where the Canucks play. It was very convenient for getting around the town and shopping. The hotel is very comfortable and clean. Our only problem with them was a television that wouldn't work, and wasn't replaced until the second night of our stay. The staff at the desk were not particularly helpful or friendly. The breakfast bar was great though, and the folks working there were very nice. Good stay overall.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Tampa, Florida", "Title": "“Never expected this from a Hampton Inn!”", "Author": "davidmeyer", "ReviewID": "UR127348216", "Content": "Because I spend most of my week on the road, I usually try as much as possible to stay away from the \"Value\" brands of chains. So when the Hampton Vancouver was recommended to me I almost declined...but I am glad I did not. First of all, the rooms rivaled anything that a full-service hotel would offer, and we're, in fact, bigger than most of them. They were nicely appointed and the best part...you could actually control the temperature in your room (the thermostat actually worked). The free breakfast was decent, as was the location to everywheree you may wish to get to in Vancouver. The ONLY drawback was the parking. If you have a large car, you'll have a heck of a time in the garage...and in most garages in Vancouver you'll find the same thing.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“fun and family friendly”", "Author": "onesar", "ReviewID": "UR127304404", "Content": "great location, only a 20 minute cab ride from airport right into downtown area. we loved that not only is it what we expected of the hotel chain but even better as there was a ping pong table as well as foosball up on the 16th floor! we walked to nearby Yaletown and checked out most of the downtown area and then headed up for some family fun! nice walk to False Creek where we took a boat to Granville Island. Near BC Place, for those Hockey fans. Complimentary waters and local calls, as well as chocolates at check in! Only complaint was one morning there was a huge rush at breakfast and they ran out fast... it was replenished but took a little time to do that.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Good quality on edge of Yaletown and Gastown”", "Author": "CanTravel106", "ReviewID": "UR126636019", "Content": "Loacated across from BC Place, easy to get o/ from. Good quality hotel - newer, nice rooms, helpful staff. Good self- serve breakfast included.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Convenient to BC Stadium & Chinatown”", "Author": "RussBock", "ReviewID": "UR125982942", "Content": "We enjoyed our stay on the 15th floor, overlooking BC Stadium and Robson Street. Easy walk to Chinatown, Robson Street shopping, Rogers Arena and just across the street from the BC Stadium. We had a king suite, which was roomy, quite and had a small kitchen. Bed and pillows were comfortable. The included breakfast buffet was the typical Hampton Inn offering, OK but not great. Parking is about $26/d.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "British Columbia", "Title": "“Very nice property”", "Author": "Patches07", "ReviewID": "UR125648360", "Content": "We've stayed here a few times when going to a Canucks game. It is perfect! Friendly staff at check-in. Very nice (free) breakfast with waffles, eggs, sausage, pastries, cereals, fruit, etc. Bedrooms are very clean, beds are very comfortable and the rooms are a nice size - quite roomy. Quiet, too. There is not much in the area EXCEPT Rogers Arena and BC Place, though. You have to walk a bit for good dining. But I would stay here in a heartbeat if attending an event at those two arenas.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Home away from home”", "Author": "Traveller653", "ReviewID": "UR124254936", "Content": "The Hotel is located in a great location. The city is easy to drive around and the hotel is centrally located, with a secure parking garage. The hotel staff was knowledgable and friendly. The suites are a generous size and comfortably furnished. The beds and are comfortable and the linens fresh. Free wi-fi in the rooms and free breakfast. The breakfast buffet offered a variety of choices to include delicious scrambled eggs. The woman who staffed the breakfast buffet was pleasant and welcoming. The hotel provided little extra's like the paper and bottled water. The fireplace in the lobby was a nice place to sit while waiting to meet friends. I recommend this hotel and will return here the next time I am in Vancouver.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Great Place Near BC Place - Go Figure...”", "Author": "TravelGuy045", "ReviewID": "UR124093388", "Content": "Very nice clean hotel - hey its a Hampton Inn they do that!. The bed was great - I did eat in the resturant attached not sure if they own it but it was excellent. The free breakfast was a delite and the lady making all the magic happen was friendly and a delite to deal with. The garge was the most secure I have ever felt with not one but two steel doors - not sure why they would need all that secuirty - a bit concerning. Some great resturants near by within walking distance. Think I paid $110.00 per night which for downtown Vancouver is almost cheaper than owning your own condo :) I would stay here again.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Haywards Heath", "Title": "“One of the best Hampton Inn's our there”", "Author": "wildthing271", "ReviewID": "UR123733482", "Content": "After my first night at the Vancouver Airport Hilton, I moved downtown. As I had to self fund the weekend in between business stays, I stayed at the Hampton Inn, partly because it was cheap, partly because I wanted the Hilton points, and partly because it was convenient for the NHL at Rogers Arena. Despite an early arrival, I was able to check in straight away, and I was given a suite. It was, quite honestly, the best room I have ever had in a Hampton Inn. It was larger than my apartment, with a sizeable kitchen, a large living room, and a large bedroom. The bathroom was standard size. It was spotless - I could not find anything to complain about at all in terms of cleanliness. The towels were large and soft, and the amenities, whilst being the standard Hampton amenities, were plentiful. The kitchen area was equipped with a dual hob, dishwasher, fridge, microwave, and various electricals. There was also a coffee maker, as expected in any room, with a plentiful supply of sugar and coffee. The living room and bed room both had large flat screen televisions. The view was nothing to write home about, being as it was of the construction site next door, but this did not affect me at all. WiFi was free and I was able to connect multiple devices - iPad, iPhone and work laptop with no issue. Location was good - a little further from the airprot Skytrain than I expected, but still only 5 or 6 blocks. I had tickets for the Canucks hockey, and Roger's arena is only about 3 blocks away...very convenient. I could mark the hotel down on the breakfast - but with Hampton's in North America, you know what it is going to be - it was not exotic, but certainly adequate. The biggest downsize to the breakfast was the horde of screaming toddlers on morning 1, who seems to regard the buffet island as an obstacle to run around, and the fact that on morning 2, I seemed to be the only person at breakfast NOT wearning pyjamas (I was in normal day clothes I hasten to add!). An excellent property in a great location.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oak Flats, NSW", "Title": "“GOOD LOCATION”", "Author": "linlu65", "ReviewID": "UR123586849", "Content": "We stayed here fro 2 nights with 2 children in a room with 2 queen beds. It was very clean with coffee machine and plenty of room for the 4 of us. Breakfast was also very good especially the make your own waffles. The staff were very helpful with directions and organising transport to the airport for us. The hotel is close to the waterfront and Yaletown with lots of restaurants and shops. Wish we could spend more time in the lovely city of Vancouver.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Newbury, United Kingdom", "Title": "“Hampton Inn”", "Author": "Jaz187", "ReviewID": "UR122826760", "Content": "This was an excellent value Hotel. We stayed here in July 2011 and it was a convenient location just next to Yaletown. It is walking distance to Gastown and Stanley Park, which we really enjoyed. There were a few drug addicts wandering around this part of town, but we didn't feel unsafe. The free breakfast was quite good too. I would recommend it.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Excellent service and HUGE rooms”", "Author": "Fern T", "ReviewID": "UR122620688", "Content": "Staying two nights here in vancouver and have two children (5 and 7). The suite we are in is HUGE with kitchen and a great games and fitness centre. There is a coin operated laundry which is super clean and cheap $1.50 per wash. Location is great a close to the sky rail( 2 blocks) and we had its of bags to carry so it really was a easy walk. Highly recommend this accomm.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Best Hampton yet”", "Author": "Hammy59", "ReviewID": "UR122578618", "Content": "I booked two rooms and travelled with friends from Seattle for a one night break in Vancouver. The weather wasn`t kind but the hotel more than made up for it and I was really delighted with our choice. I have stayed in countless Hamptons throughout the USA and this was easily the finest. On arrival we were upgraded to a king suite and the room was huge, clean and very comfortable. Great location right near the main shopping street, great selection of food and indoor stadium. We used the the games room to play table tennis, fussball and the hot tub and the view from the open terrace was great. Breakfast was the usual fare but the staff were very cheery and when they heard that one of our young children had a birthday then they came back with a teddy bear for him. Its little points like that which make an impression......well done Vancouver Hampton !!", "Date": "January 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great place to stay most of the time...”", "Author": "Thor_Odinsson", "ReviewID": "UR121644511", "Content": "Arrived at the hotel, and was checked in fairly fast by Front Desk. I arrived to find an awkward, disturbing sight in the jetted tub. Four small pubic hairs remained from the last guests. I bought a frozen ice-cream pie from the Keg for a birthday and put it in the freezer. Unfortunately the hotel had a scheduled power outage from 11:30 AM until 4 PM on December 6th for maintenance, but this was not indicated on the website when booking the room for the hotel. If it was, I would have either selected a different hotel, or selected different dates to avoid the inconvenience. That meant TV and Internet and other non-essentials would not be available, and that made for a melted ice-cream birthday cake. The coffee makers are so small, and a larger one would be nice. The chocolates they give upon arrival are a nice touch but they used Lindt this time, and the ones they used before I actually like better, but I don't know the brand name. All in all, this place is usually a good hotel to stay in. It provides a free hot breakfast, but it could use an upgrade, and I wish it would stay open longer than 10 AM. It has free Internet and coin laundry costing $1.50 each for washer and dryer. I would say this hotel is a pretty good place to stay, but this last time was disappointing.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edmonton, Alberta", "Title": "“Best Hampton Inn... possibly Best Vancouver Hotel!”", "Author": "CDN-Traveller1961", "ReviewID": "UR121593631", "Content": "I've stayed hear several times over the past 2 years and the service, cleanliness and downtown hotel value are excellent. The location is fantastic especially if you are going to a sporting event as well as using the hotel as a base for doing business in the greater Vancouver area (in addition to downtown). One tip; the underground parking is a bonus as long as you don't drive a very large vehicle like a Suburban or similar. Underground parking spaces are a little tight. So if your renting a vehicle during your trip, make sure it is mid-sized.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Comfort and GR8 service”", "Author": "Thornhillite", "ReviewID": "UR121584551", "Content": "Stayed here several times during the past few years. Very clean and comfortable with excellent service at a good price. We stayed in a one bedroom suite which was very spacious with a full kitchen. Personnel were friendly and accommodating, especially the women in the breakfast room. Rooftop exercise room has a great view. Convenient to downtown and close to Cambie Bridge.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Grey Cup 2012 week stay - Hampton Suites”", "Author": "maratimer", "ReviewID": "UR121557500", "Content": "We stayed here during the Grey Cup 2012 festivities and the hotel was clean, warm and friendly. The staff were happy to accommodate our requests for early check-in, late check-out and privacy when requested. Breakfast was on par for Hampton Suites, and a nice savings to our week. I was glad to hear from staff that the plastic cutlery used for breakfast was Eco-friendly and 100% bio-degradable when I inquired as to why they used them from a waste perspective. The elevators were a bit slow, but only due to the number of guests arriving so probably the same as other hotels during this busy time. Security was great, they ensured only guest access to the hotels with key cards, and front desk staff. Overall, I was pleasantly surprised with the hotel, the accommodations were very clean, beds were very comfy and bathroom supplies were never an issue. Having a fridge and microwave, amenities were great as well. We walked everywhere from Burrard, Granville, shopping, etc as well as very close to two sky trains so easy to get to from airport. Very happy with this hotel, would stay again.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Vancouver", "Title": "“Spotlessly clean, comfortable, good location”", "Author": "Anna_Karen", "ReviewID": "UR121038980", "Content": "Stayed for 2 weeks during house repairs, in a suite with king bed, with husband and toddler. I loved: Clean! They wash all bedding for every guest, vacuum the sofas, clean *under* furniture. Most hotels don't do that. Good-quality furnishings, all fairly new. Very comfy bed. Pretty good hot & cold breakfast buffet (though I got a little tired of it after the first week). Kitchen is good enough to make eggs & toast or pasta & sauce etc, but not a full meal (hot plates and a microwave, but no oven). Location pretty good: 5 min walk from Yaletown, 15 min walk from the heart of Robson street shopping district, 15 mins from Gasstown, all are good for shopping and restaurants. (Also some decent restaurants close by) Right by BC place. Generally very quiet - has double-pane windows and thick curtains, rooms seem very soundproof. Rooms are very bright too. To be aware of: they are not going for 'atmosphere' or 'character' here; it is in no way romantic! The staff is friendly rather than polished. Located at the boring end of Robson street (still a safe location in the city though). Right across from BC Place so if there is a concert you will hear it! Also not cheap: if you want romance and character, there are other hotels are in the same price range that would deliver better. Overall, my favorite hotel for a family stay.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tel Aviv", "Title": "“nice hotel in downtown vancouver”", "Author": "Nacii", "ReviewID": "UR121032953", "Content": "stayed here couple of nights end of july, nice and clean. a bit crowded in the mornings, overall good value for vancouver", "Date": "November 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“Great hotel - pity about the cutlery”", "Author": "fluffybinks", "ReviewID": "UR119919790", "Content": "I chose this hotel based on reviews at TA and on location to Robson St and gaslight area. We spent 2 nights, to relax after business before our trip home. The location was great as we could walk everywhere, and even though there was a football game across the road in the stadium that we could see the roof of from our room, there was no noise in the room. The rooms are spacious and well appointed, a cheaper \"Hilton-like\" room i.e. the fittings are cheap but functional. But you get what you pay for. There is not much service - there is a bell man that is never at his post... you have to take luggage up to your room yourself. There is a complimentary breakfast - its not great but the coffee is drinkable and you can make your own waffles! You get what you pay for so all in all the hotel is great EXCEPT FOR ONE THING THAT WILL MAKE ME NEVER STAY AGAIN - WHY oh why do you have to eat breakfast from plastic knives and forks and plates! This is a horrible experience , not to mention the rubbish it creates - made me and my colleague vow to never stay here again. I overheard others talking about that too.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Melbourne", "Title": "“Good value hotel in good location”", "Author": "Travelling_Jag", "ReviewID": "UR119420572", "Content": "Definitely recommend this hotel as good value for money. Good restaurant out front (Zachary) and location great ( especially for sports fans with stadium next door)", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Raleigh, NC", "Title": "“Excellent Hampton Inn”", "Author": "HappyCamperNC", "ReviewID": "UR119183762", "Content": "We stay at many Hampton Inns throughout the year and come to expect a clean and comfortable place to stay that is moderate in price. However, the Hampton Inn in downtown Vancouver rises above the average. From smooth and friendly check-in to a sparking clean upgraded suite, our stay exceeded our expectations. (Great Italian restaurant next door in a competing hotel.) Easy and free hotel shuttle to the cruise port.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "White Rock", "Title": "“Excellent Location for BC Lions Game”", "Author": "VE7CKT", "ReviewID": "UR119127799", "Content": "We chose the Hampton Inn because of it's proximity to BC Place and the BC Lions game and it was an excellent choice. Very easy and prompt check-in. The room was a good size with comfortable queen beds. It was quiet and there was little noise from the street and none from other guests. Great complimentary breakfast. Would stay here again for other events at BC Place or Rogers Arena.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manhattan", "Title": "“Great place to stay before or after a cruise!”", "Author": "SuzanneManhattan", "ReviewID": "UR118585058", "Content": "We stayed here for one night prior to going on a cruise. Upon arrival, the front desk staff was an absolute delight and very helpful in getting accustomed with the downtown area. The room itself was a standard Hampton Inn room, and well kept. It is a highrise facility, so the view from the room was terrific. The location is optimal as it is in walking distance to lots of restaurants, shops, and last minute purchases (bottle of wine and pop/soda for the cruise). There is a downtown mall not too far away, and a free hotel shuttle helps transport you around...not to mention free shuttle to the cruise port! The only somewhat downside of this site is that the breakfast area has a small area for seating, but the offering of different types of foods is more significant than at other Hampton Inns. I would definitely stay here again.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cape Town", "Title": "“Perfect location and brilliant value for money”", "Author": "TeamThomasCapeTown", "ReviewID": "UR118549399", "Content": "We stayed at the Robson Street Hampton Inn recently following positive reveiws on trip advisor, and just wanted to add some additional information. Robson Street is the main shopping street and the hotel is located at the bottom of Robson Street. There are plenty of good places to eat in the area, and also walking distance to the skytrain station. There is parking in the building, and a bus stops right opposite the building. The room was huge with typical Hamton Inn fluffy white pillows and bedding. Spotlessly clean. We had a kitchenette in our room which was brilliant. Almost like a self catering, but with the convenience of a hotel. Breakfast was basic, but good. Free wireless internet access was fast. Would definitely stay here again.", "Date": "September 25, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Clean, convenient, great ammenities”", "Author": "Joshua G", "ReviewID": "UR118074778", "Content": "This hotel is very conveniently located in downtown Vancouver. Staff is very welcoming and helpful. The rooms are equipped with anything you could possibly need for your stay. Having complimentary Wi-Fi is also a useful feature of the hotel. The rooms are very tidy and clean. It is definitely a good value for the rate paid. The restaurant downstairs has a nice atmosphere and the complimentary breakfast offered at the hotel is very varied and good. If you are looking for a great hotel with good value, this is your best bet for sure!", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Assonet, MA", "Title": "“great choice for a pre-cruise stay”", "Author": "It's a Red Sox Nation", "ReviewID": "UR117885663", "Content": "We arrived by train around 6pm and left the next morning around 10am but we have no complaints during our brief stay. We enjoyed dinner downstairs and even played some ping pong the next morning. It was nice to be in a metropolitan setting and we felt safe and comfortable. The complimentary transportation to the cruise terminal was a nice plus but be sure to reserve your time early in the morning.", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Nashua, NH", "Title": "“Good location, nice ammenties”", "Author": "MarissaNH", "ReviewID": "UR117812515", "Content": "We found that this place had clean, decent rooms which were very comfortable. It is very close to Yaletown and you can basically walk everywhere. We also found that you could have a ride at no charge to anywhere in Vancouver, you just have to find your way back. Andy was our driver both times and he was so friendly and helpful. I didn't even know they would do this so it was a very nice surprise! Breakfast is nice, pretty standard. Price was decent for a downtown hotel. The woman in the gift shop even personally changed my USD to CAD when our ATM wouldn't work, a very nice thing for her to do. Fitness center needs more machines.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "nj", "Title": "“Great location”", "Author": "mktrip1", "ReviewID": "UR117729480", "Content": "Nice hotel to stay in Vancouver. Their staff is very friendly. Breakfast is reasonably diversified. They got a fooseball/ping pong table on the 16th floor, which is where my kids spent most time. Parking is kind of expensif at 25+$ per night.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Sydney", "Title": "“Very central location with great food choices nearby”", "Author": "GemmaSydney", "ReviewID": "UR117512362", "Content": "We stayed for three nights and found the very central location to be extremely convenient for our first visit to Vancouver. Hotel is close to an extensive range of cafes/restaurants and shopping, supermarket etc; only a short walk to skytrain. Noise levels are not too bad – we were on 6th floor and it was pretty quiet through the night; but there is noise during the day from nearby construction on stadium. Room facilities are just as listed on website – good size bathroom; small fridge; microwave; coffee-maker; comfortable beds; it was great to have a table & 2 chairs in addition to a desk and computer chair; the complimentary internet access in room worked well. The air-conditioning was very touchy and did get too hot/cold at times beyond the set temperature – the sensors seem to take a long time to settle into the set temperature. Breakfast is included – not a huge range of choices but sufficient – 2 or 3 cereals; juice; fruit; yoghurt; waffles; toasts; egg. Have never before encountered the use of disposable paper plates and plastic cutlery in a hotel though. Hotel facilities included a gym and well set up coin operated laundry – we much appreciated the laundry facility. Zachary’s Restaurant had a small menu but nice meals and reasonably priced – thanks to the chef who was happy to meet special dietary needs. Very friendly and helpful wait staff – we had fun trying out the local brews on their advice.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Great Location and Best view from Rooftop Jacuzzi at Night”", "Author": "SheilaNewYorkCity", "ReviewID": "UR117495415", "Content": "I arrived at the Hotel just as the first Hockey game of final playoffs was starting. After Rooftop Jacuzzi I paused to look down at crowds leaving BMO arena after the game with whoops of cheers going up all through the neighbourhood. This hotel was best location to see Vancouver come alive with opening win.The desk staff were helpful in finding a restaurant for dinner even drawing on a map the safe way to walk to Gastown and location of the lookout Tower a block away from restaurants on the waterfront. Don't believe talk about cold and rain as weather claimed before I flew in. While walking to and from the restaurant area it was sunny and warm with beautiful sunset over the waterfront with Mountains across the way in West Vancouver. Next day I was kind of cold after returning from Whistler and rooftop Jacuzzi after dark was magic overlooking the beautiful lights of Vancouver. Breakfast off lobby provided lots of foods to grab and take with you as I had to leave early both mornings for train tour. I really enjoyed the hotel and recommend it highly for downtown activities and nice long walk to Stanley Park and especially to catch a hockey game 2 blocks away. I fell in love with Vancouver and can't wait to return for longer visit and do that walk around Stanley Park which tourists assured me I could do form the Hampton Inn. I would definitely return to this hotel.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Sydney", "Title": "“Standard hotel in good location”", "Author": "wywk", "ReviewID": "UR117254067", "Content": "I chose to stay at the Hampton Inn for 2 main reasons: I am part of the Hilton Honors program 2. Location + Price There is no wow about this hotel, room was pretty standard of average size, basic amenities. No mini-bar. You get a microwave, coffee/tea making facility and a small fridge which was convenient. Bathroom was small but clean with a tub/shower. Internet was free as part of the honors program which was a bonus. The bed was of queen size and comfy, room was quiet. I had view on the streets from my room which was nice. You also get daily free breakfast, nothing fancy but the usual (toasts, bagels, waffles, eggs, sausages, bacon, fresh fruits, yogurt, coffee, tea etc) and it was enough. The plus side was its location, it was a few mins away from the hop on/off tour bus stop, within walking distance to Chinatown and Gas town. There was also a chemist/pharmacy closely where you can get drinks and snacks. There were also a few restaurants around the area and a few coffee shops. All in all, I think it was a good place to stay in terms of value for money.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Southern New Jersey", "Title": "“Great Facility”", "Author": "Niamb", "ReviewID": "UR117222899", "Content": "We stayed at the Hampton Inn Vancouver for only one night, but it was a very pleasant stay. The staff were very helpful. The room was large and comfortable. We did not have breakfast, as we were having breakfast elsewhere but the area looked nice and the choices good. The entire facility was very clean. Best of all was on the 16th floor where there is a large, extensive, well-maintained fitness area, a hot tub, an outside seating area and a LAUNDRY. Now a laundry may not be a selling point to many but when you have been on vacation for a week and have an additional week in front of you its importance soars. There were two coin operated washers and dryers and a large folding table. It was in a good sized room with a window and access to the outside roof area. The equipment worked well and the dryers actually got the clothes dry on one run. There is also a vending machine for detergent and softener sheets. This hotel is conveniently located downtown. We chose it as it is both convenient to downtown, but also fairly close to the train station as we were heading out on the Rocky Mountaineer the next day. It is also fairly close to the bus station, which is also across the river. The Pacific Coast cross water bus from Victoria has a drop-off point downtown that is more convenient to the hotel, however. All in all it was a brief, pleasant and very productive stay as we left with bags full of clean, fresh clothing for the remainder of our vacation.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Allentown", "Title": "“Simply Amazing!!!”", "Author": "eeyore10479", "ReviewID": "UR116878732", "Content": "There is nothing that could have been done to make our stay better. It was AMAZING!!! We had one of the best stays ever at the Hampton Inn and Suites in Vancouver. From the time we checked in until the time we checked out, the friendliness was beyond expectation. The wonderful front desk staff on Aug. 7 was amazing and friendly. I sadly don't remember their names, but they were wonderful! Our room was spotless! I am very picky about the cleanliness in a hotel room, and this room exceeded my expectations! It was spacious, comfortable and the beds were amazing! The breakfast was great. Try the blueberry jam. It was wonderful! It was fully stocked and the breakfast hostesses were very friendly! This is a wonderful hotel to stay at in Vancouver. I highly recommend it!", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“Wish I could have stayed longer!”", "Author": "cmwpm", "ReviewID": "UR116828624", "Content": "Very nice hotel. Was iin town for literally 24 hours and I needed to find somewhere to sleep. I wish I could have stayed longer so I could have taken advantage of the amenties this hotel has. The gym and hot tub look awesome, I will definitely return, and next time with my swim suit! Great views, spacious roomm, friendly front desk staff. Complimentary breakfast is a bonus. I have many food allergies, and the breakfast staff helped me out in checking exactly what I could and could not eat. A short but great stay!", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "La Verne, CA", "Title": "“Good Hotel for Teenagers”", "Author": "Potteryacoma", "ReviewID": "UR116682597", "Content": "My husband, two teenage boys and myself stayed 3 nights at this Suite hotel in Vancouver. We had a king suite with a kitchen area, living room with pull-out couch for the boys and a separate bedroom with bath. The room was large and gave us the space and privacy needed from our boys. They have a free shuttle that will take you anywhere downtown but you need to book each morning in advance. They also have free bikes for their hotel guests, but again you need to book each morning in advance. We really enjoyed our stay. The hotel is convenient all areas downtown. My husbands only complaint was the eggs at breakfast seemed they were made from a powdered mix. My boys and I found the free breakfast buffet fine, especially the waffles. I would recommend this hotel especially for families.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Wisconsin", "Title": "“Short, overnight stay, but very nice room, great view from 15th floor, friendly & helpful staff”", "Author": "ClearWater62", "ReviewID": "UR116623641", "Content": "We stayed here one night, after several days in Victoria, and boarding the Rocky Mountaineer the next morning. Front desk staff were very friendly and helpful, both at check-in and in the morning, calling a taxi for us so as to arrive almost \"on cue\" when we were ready to leave. The room was very nice and on an upper floor, as I had requested. We look for Hamptons when traveling, but only chose this one because it was also convenient to the train station (of prime importance to us, because of the early morning train check-in).", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Waldwick, New Jersey", "Title": "“Moved to this hotel from another and were very glad we did”", "Author": "timbosul", "ReviewID": "UR116306322", "Content": "We were in another hotel that was awful. We got a room here and were so glad we did. I really like Hampton Inn. The rooms are always clean, the beds very comfortable. The room was bright and cheery and overlooked the stadium across the street. Breakfast is included and they give out free newspapers. In my other hotel, I spent $70 on breakfast! We were in Vancouver for a wedding and I had rented a Chevy Suburban. There is adequate parking for oversized vehicles (i don't remember if they charged extra for parking). The hotel is close to many sights. We also shared a cab which came directly to the hotel when called by the front desk. I would definitely stay there again.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Spokane, Washington", "Title": "“Very convenient to downtown.”", "Author": "weezlikestotravel", "ReviewID": "UR116283583", "Content": "I stayed here for the weekend in March while I attended a conference. It was very convenient. I could walk to my meetings as well as to many very excellent restaurants. The free breakfast in the morning was more than adequate to help start the day. Room had refrigerator and microwave which were convenient. I opted for a room with a whirlpool tub which was very relaxing. On the frist day there, the staff brought candy to the room as a thank you. The only downside was that there was construction going on across the street (at the stadium) which was noisy. I'm not sure if this construction has stopped.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Ocean, New Jersey", "Title": "“Great downtown hotel”", "Author": "e2637", "ReviewID": "UR116039748", "Content": "We stayed in this hotel for one evening at the end of a long road trip. The room was clean and quiet with especially comfortable beds. The parking, pricey but the norm for most major cities - was very secure with gated access. My stay was excellent aside from the fact that my wakeup call never came. I missed a business conference call as a result. I mentioned this at checkout and was shocked when the manager refunded my entire hotel bill. I never expected to be offered any compensation but was pleasantly surprised and appreciative of the manager’s actions.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Kamloops BC Canada", "Title": "“Great place! Great location!”", "Author": "PaulLake", "ReviewID": "UR116036134", "Content": "This is a great location for downtown. The staff are very helpful,The room are always clean. The hot-tub on roof is fun with a nice outside area, gym is good as well. Have stayed before and will be back. We had a problem with the A/C however they gave us a free room because of the inconvience.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Good location and amenities. A very comfortable place to stay.”", "Author": "Lee060", "ReviewID": "UR115975944", "Content": "We like the Hampton Inn chain as it is always consistent in providing a good bed and the amenities we need. This location offers free breakfast, self-service washer/dryer for $1.50/each, courtesy van one way to downtown locations as long as scheduled with front desk. We stayed here while touring Vancouver before our Alaskan cruise. It is close to the hop on/hop off trolley we used for getting to the tourist attractions in Vancouver (did not rent a car for this stay). Tour buses to areas like Victoria and Whistler will pick you up from this hotel.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "cheshire UK", "Title": "“Great base to explore the city”", "Author": "marathonman52", "ReviewID": "UR115825597", "Content": "Stayed here on Hilton loyalty points but was still pleasantly surprised! Breakfast,Internet and shuttle service all free, and Granville island and yaletown within easy walking distance. Room was quiet and well kept, I would be happy tonstay here on business.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Dundee, United Kingdom", "Title": "“Good first choice”", "Author": "FionaandGordonB", "ReviewID": "UR115717400", "Content": "Spent three nights in Vancouver at the Hampton Inn. Very pleased with choice. Clean, excellent service with large and well maintained room. Breakfast was more than satisfactory although very busy. Within walking distance of most of Downtown attractions. Vancouver very easy to get around and safe. Not cheapest city in the world but definitely worth a visit. Stanley Park is wonderful. Would recommend.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Buffalo, New York", "Title": "“Exceptionally helpful front desk staff”", "Author": "dot2com", "ReviewID": "UR115201655", "Content": "This hotel has the most helpful front desk staff. They function as all purpose staff and seem to do everything well. We were especially appreciative of their assistance with booking tours and suggesting activities. When we inquired about a certain activity, they whipped out a coupon for discounted admission to the activity. When asked for directions, they provided directions keeping both our pocketbook and our physical condition in mind - for example sugesting public transportation as an alternative to a 20 minute walk. They found us at breakfast to tell us that a shuttle driver couldn't take us somewhere and offered an alternative to the shuttle. They also offered to call a restaurant that wasn't answering their phone throughout the day until they got through to make a reservation for us. Rooms were comfortable with complimentary water provided. The typical Hampton breakfast was nicer than at many other Hamptons and they replenished foods - unlike another Hampton that I stayed at where you had to get down early before the fresh fruit was gone. Location was ok. There is an on-site restaurant that was very good - and provides room service!", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Sublime inner city sanctuary with class and yet so modest”", "Author": "jss6270", "ReviewID": "UR115067891", "Content": "Not your typical Hampton Inn and Suites. Much more upscale and yet so modest. Right in the heart of a vibrant and energetic city with much flair and no pretensions. The staff at the front desk were courteous, professional, knowledgable and very helpful. The suite was perfect for a family- lots of room, separate bedrooms and full kitchen with real cutlery and crockery. The location could'nt be better. Want to recommend this place so badly! Oh and btw check out the fantastic hot tub- very modern design- on the top floor with stunning views of the city and BC Place. You can pretty much leave your car in the garage and just walk, bus or hop the train to see the sights and delights of this great city.", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "New York", "Title": "“Best Jacuzzi Tub Around”", "Author": "YanniBananni", "ReviewID": "UR115032032", "Content": "First time I've stayed here; I have booked family into this property before and never got any complaints so I figured I'd give it a whirl. Vancouver is famous for its void of any really great hotels so rather than be disappointed after spending $400-700 at a hotel that just doesn't get it, I'd be loyal to Hilton and save some money. Turns out the hotel was actually pretty good. Free-Wifi: big check. Can't stand hotels that nickel and dime you for wifi. nice corner room with wall to wall windows that look out onto...renovations on a stadium. Kind of cool looking, actually but if you're into looking at the gorgeous vancouver mountains this isn't the place. The service, though, is really good at this hotel. First, they upgraded me from the standard two queen room that I booked online to a better one king deluxe room. It also included a free breakfast that I must say was fairly decent if you like healthy breakfasts; cereals, fruit, good coffee. Apparently they can make you an omelette if you want. Anyway, the breakfast was free so for the money it was a thumbs up. I extended my stay another two nights and they upgraded me again at no charge and moved some other reservations around so I could keep the same room. Very courteous, very friendly people at the front desk every time I dealt with them. There's a good size fridge in the room - nice and cold for beer, and also a small microwave. There's no room service, however; I had to call a pizza delivery service but I was in the mood for pizza so it worked out okay. The best part of the room, though, is absolutely the jacuzzi tub. These guys really did a nice job with the tub in the bathroom. It is really a nice size and fits two really comfortably. The tub fills up very quickly and the water is deep. The jets have two speeds. The tub was exactly what I needed after 17 hours of flying. The location of the hotel is pretty ideal. Yaletown is a 5 minute walk; gastown is a 10 minute walk, and Robson Street shopping is 5 minutes away, also. The fitness facility on the top floor is quite interesting. They have both a ping pong and foosball table which was a nice surprise. They also have a decent hot tub. no pool, though. The only negative thing I would submit is that the parking seems very expensive: $25/night for secured underground self-parking; you can come and go as you please which is a plus, though.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Ohio", "Title": "“Very nice, highly recommended!”", "Author": "professorroyhinkley", "ReviewID": "UR114972513", "Content": "This hotel was a nice surprise. We saw a lot of reviews for other Vancouver hotels that talked about small rooms - not here. We had a 1 br suite and it was really nice and roomy. The staff was excellent and very helpful, especially one person (I wish I got her name!) The sink had trouble getting hot water or pressure, which was strange because the shower didn't seem to have an issue. Bed comfort, fridge, heat all worked as hoped. Breakfast seemed to be a notch higher than expected - and they didn't have a problem with me stopping in a little early! The area was wonderful - we had a view of the stadium (right across the street) and could walk to 1000 restaurants that seemed to be open early to late. Easy walking to shopping, longer walk to the aquarium & convention center. The walk was good - past coffee shops & stores. The only negative was the expensive parking - $25/day & tough to find a space unless you have a tiny car. Otherwise, I'd highly recommend it!", "Date": "July 2, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Excellent Value”", "Author": "Selbourn", "ReviewID": "UR114713804", "Content": "Most helpful pleasant staff. Excellent Value for money. Very convenient location. Most strongly recommended", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Florence, Oregon", "Title": "“great location, fine accomodatons, helpful staff and excellent breakfast available”", "Author": "wickedheadache", "ReviewID": "UR114571351", "Content": "Try the Chop House restaurant across from the hotel along with Frank's Italian restaurant next door. Both offer excellent cuisine and a pleasant atmosphere", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Canada", "Title": "“Wonderful hotel”", "Author": "cf_travellers", "ReviewID": "UR113216676", "Content": "Service at the front desk was wonderful when we checked in. The room was so beautiful. We were on the 9th floor and had a corner jacuzzi suite. The view from our room was amazing, we had two full walls of windows. Very clean room and a super comfortable bed. Wi-fi internet connection was bad, we couldn't get a signal. Breakfast was really good and included with the room. There was pancakes, waffles, sausage, fruit, yogurt, hard boiled eggs, bagels, toast, scones, juice, coffee, tea. It was the biggest complimentary breakfast buffet I have ever seen at a hotel. We loved this hotel so much that we would definitely stay here again the next time we are in Vancouver.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Wonderful Hotel”", "Author": "Webwill", "ReviewID": "UR112672023", "Content": "Stayed at the Hampton for a total of 3 nights. It is just a wonderful Hotel and I couldn't find fault with it at all. Breakfasts are great, staff good - friendly and helpful. Great location, clean, lovely rooms. Free bikes (biked to and around Stanley Park - really recommend this). Bikes come with helmets, backpack, water and a map - fantastic. I would really recommend this Hotel as found it excellent value for money. Would definitely stay there again.", "Date": "June 11, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“A little disappointed by this Hampton Inn”", "Author": "happytravelpal", "ReviewID": "UR112127884", "Content": "I usually rave about Hampton Inn's and Hilton properties in general. However, I was a little underwhelmed by my recent stay here in Vancouver. The staff were mostly pleasant but in no way were they extra friendly or accommodating. While the two free truffles for HHonors were indeed delicious - real, warm, genuine service would have left a sweeter taste in this reviewers mouth. We booked and received a 1 bedroom suite. The only redeeming feature in my mind was the standard Hampton bed which is always comfortable. The room itself needed a major overhaul. The carpet and sofa bed in particular were looking quite worn and sad. There were hairs stuck to the ceiling above the shower when we arrived. Long black hairs. Not the kind of thing you expect for $230 a night. The shower itself was also disappointing with poor water pressure and woeful drainage. Standing ankle deep in water is not something I would expect and do not appreciate from this hotel chain. Noise is an issue in this hotel. Neighbors can be heard, air conditioning can be heard (even when the room A/C is off) and most notably - rattling of pipes can be heard. I found the breakfast to be quite good by Hampton standard. The usual fare was there and everything was frequently refilled. Complimentary use of the hotel bikes was appreciated and the gentleman who assisted us with these was the standout of staff we encountered. Parking was just over $25 a night to self park. Aside from the two truffles at check-in there were no perks for HHonors gold members which was a little disappointing. With the service and value absent at this property it is unlikely we will stay again when visiting Vancouver.", "Date": "June 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Victoria, BC Canada", "Title": "“Great location and Room”", "Author": "snoopy647", "ReviewID": "UR111105525", "Content": "Stayed in a 1 bedroom suite with a girlfriend as we were over for the Bon Jovi concert. Had stayed there the month before with my husband in a studio room, and were very pleased. The 1 bedroom is very spacious with full kitchen and breakfast bar. The bedroom was very large and had lots of closet space. The bedroom had a large TV as well as the living room. After our check in we were down at the front desk inquiring on which way to walk to Pacific Centre Shopping Mall. They have a shuttle which was dropping someone else off at a different location, so they told us we could hop a ride with it. What a nice surprise! Later in the afternoon a staff member arrived at our suite with \"welcome back\" chocolates. The breakfast buffet the next morning was good, and had a lovely selection of items. I would definately stay there again next time we go to a concert as so close to BC Place and Rogers Arena. The one thing I wish they would do would be to include parking in their room price.", "Date": "June 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“Great value and service”", "Author": "Nessie5", "ReviewID": "UR105235801", "Content": "Arrived at 8:30am and they managed to find us a room which was great after a 15 hr flight. Room was spacious and clean. Location of hotel was walking distance to everything. Great value, would definately stay here again and recommend to others.", "Date": "April 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Always Enjoyed my Stay - Great Location”", "Author": "prbimaniac", "ReviewID": "UR104585529", "Content": "I have stayed here several times in the last few months. Staff are great. Rooms are good. Location is walking distance to Yaletown downtown.", "Date": "April 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nashville, TN", "Title": "“Great location, clean hotel, friendly staff.”", "Author": "yehaaw", "ReviewID": "UR100142071", "Content": "The Hampton Inn is located right in the heart of the city. I didn't need a car because of its location. Across the street from BC Place, Rogers Arena, and close to many restaurants. The rooms are SPOTLESS. VERY CLEAN. The hotel has a great workout room that has a sauna, hot tub, laundry facilities, and a great view. Do not hesitate to stay at this hotel!", "Date": "March 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria, BC Canada", "Title": "“Great location for Rogers Arena, BC Place and QE Theatre”", "Author": "snoopy647", "ReviewID": "UR98525639", "Content": "Chose this hotel because of proximity to Rogers Arena (Eric Clapton concert) and reviews on Trip Advisor. Stayed in a room with a king size bed. Very roomy, including the bathroom. Bathroom had a night light and makeup mirror which was nice. Room included a mini fridge and microwave that many would find handy. WIFI worked great. Huge window which actually opened. Very spacious breakfast area with a good selection of items. I think it would be better to have parking included, as $25 extra.", "Date": "March 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Salt Spring Island, Canada", "Title": "“Comfortable, friendly staff.”", "Author": "Tabaxi", "ReviewID": "UR97656499", "Content": "We stayed at the Hampton Inn and Suites as it was close to Rogers Arena as we had tckets to a game. It was great. Very easy to get around, friendly staff, a nice serve yourself breakfast. The room was comfortable. We had a king suite. We found it very quiet but we were on the 7th floor. The whirlpool and sauna were fun, plus tried the ping pong with my 13 year old son.", "Date": "February 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "BC", "Title": "“Location, Location, Location”", "Author": "Bima", "ReviewID": "UR97202235", "Content": "This is a good midrange hotel for anyone planning to attend a hockey game, or any event at Rogers Arena or BC Place (when it's finished). Rooms are average-sized, with excellent beds, lots of pillows, free wi-fi, and a safe. The included buffet breakfast is very good. The lobby contains a kiosk for airline check-in, which is a great convenience. In good weather, it's an easy walk up to Robson or Granville Streets for galleries, shopping, etc. This is a comfortable hotel in a very convenient location.", "Date": "February 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Limerick, Ireland", "Title": "“Great find”", "Author": "cwl40", "ReviewID": "UR97050578", "Content": "Loved this hotel. Great location near Yaletown. Free bike hire for guests. Good breakfast, rec room with hot tub and laundry. The room was very comfortable", "Date": "February 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St. Catharines, Canada", "Title": "“Tough to beat!”", "Author": "JJ_McQ", "ReviewID": "UR93787406", "Content": "Stayed at this downtown hotel for 5 days this month. Great location although at the bottom of Robson Street, but not a far walk to dining and shopping. Staff were attentive, complimentary breakfast was great, rooms clean and not dated. Would not hesitate to recommend this spot for out of towners. The $20 underground parking fee is a bit of a grab though.", "Date": "January 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Freehold, New Jersey", "Title": "“Great Hotel!”", "Author": "Jimgotkp", "ReviewID": "UR91479620", "Content": "The complimentary water, breakfast, and internet were awesome. It's near the stadium and Chinatown. The rooms were spacious with the flat screen, microwave and fridge. The room was clean upon arrival as well. The negatives were the underground parking since the handicapped space is on the bottom level (P3) instead of the top one (P1). It's quite hard for a handicapped person to drive in a pretty tight garage. Instead of having parking for small cars they should make it for handicapped people. The second negative is the breakfast even though it's free. They need to put the breakfast in a larger space since it was packed when I went. I didn't see such offerings like bacon like other reviewers reported. The price seems to be pretty high for this property but it was at $155 for NYE which is VERY cheap when comparing it to other similar properties. Being a city hotel though not surprised it's a bit more expensive. However, don't forget to have an additional $19 daily fee for parking.", "Date": "January 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Altadena, CA", "Title": "“Great nights stay just before we went on a cruise/Near the train station too”", "Author": "aswessen", "ReviewID": "UR90197103", "Content": "Our family needed a place to stay prior to boarding a cruise to Alaska. We got a nice two room suite, so the teens stayed in one room and parents in another. The room had a mini kitchen and with the addition of a rollaway bed, plenty of room for all 4 of us. Breakfast was both ample and had great variety. Eggs, yogurt, cereal, fruit, waffles. My only complaint was it was overcrowded and hard to get a table. The hotel was also close to the train station where we disembarked so the cab ride was reasonable. I am only sorry we didnt have more time to explore Vancouver.", "Date": "December 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Wow!”", "Author": "MitchBlock", "ReviewID": "UR88708564", "Content": "Was in Vancouver for a special concert given by a friend of mine, who told me that this is the place to stay. I am from the US originally, and when I think of Hampton I think of a suburban type hotel. Suburban this isn`t. All the good amenities of a Hampton, with great service, and an excellent location as well. (I feel like I`m in one of those Holiday Inn comercials.) I had a great time here.", "Date": "November 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Exceptional Hotel”", "Author": "ridersfan23", "ReviewID": "UR86388267", "Content": "When staying in vancouver I've always chosen between Pacific Palisades (which is no longer), a sheraton or a westin. I use to stay at this hampton back quite a few years ago when I was in town a lot. It was a great hotel then and its still a great hotel now. The staff at the front are always so helpful their customer service skills are exceptional. Since the renos this hotel is really great especially if your taking in a hockey game which is a quick walk down beatty street to the game. Fantastic. The breakfast is a nice treat also!!! Great comfy, exceptional hotel! Keep up the great work!", "Date": "November 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Nearly a \"Five\"- Great Location, Very Good Stay”", "Author": "AnacoTraveler", "ReviewID": "UR85632528", "Content": "We traveled by train from the Puget Sound area to see a play in Vancouver in late October. The Hampton is a terrific home base, just a short taxi or Skytrain ride from the central station. It's location next to BC Place and within walking distance of lots of restaurants, theaters, shopping,etc work well for almost any activity. It is a little challenging to figure out where the entrance is, but one way or the other you eventually get in. Front desk service was excellent for check in , check out and for concierge service. We have stayed here before and dining recommendations have always been spot on. At least half a dozen newspapers are complementary each day if you just have to know what is going on in the world. The complementary breakfast is served upstairs from the lobby in a space that could be enlarged for a hotel of this size. The breakfast is a very good upgrade continental, with eggs, bacon, waffles, fresh fruit, carbs, juices and coffee. There is a decent enough bar and restaurant in the hotel. The rooms are large and efficiently if not exactly elegantly decorated. Bottles of water and coffee / tea are complementary. Wired and wireless Internet is also complementary although the day we were there it was pretty sluggish. The beds and linens were above average although it loses points for the towels which are not remotely commensurate with this quality of hotel or room rate. Everything was clean and functional, lots of TV channels on flat screens, and nice views. Although this can be a very busy area of town, it is quiet inside the building. Improvements: Already mentioned the towels and while you get a lot of complementary ammenities, it is not an inexpensive place to stay, including nearly 16% taxes and fees ( what the heck is a destination marketing fee and why am I paying it?). But given its overall quality and location it only gets docked a little for value. We have always found Hampton to be a quality operation, if a bit pricy, and this one is no different.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Belfast, Ireland", "Title": "“Comfortable, quite stay”", "Author": "TechGuy123", "ReviewID": "UR85573010", "Content": "To get to the hotel, we took the Airport train all the way and got off at China town and then walked the remaining distance - I believe you can travel to the Rogers Arena which might be a little closer but we couldn’t see the stop on the map. While we were excited to make our first stop in Canada, the distance was a little far and on reflection the hotel was quite a walk from most of the entertainment. The hotel is about 10mins away from Granville area and right across the road from BC Place and the Rogers Arena - an excellent choice if you plan on seeing an event. We booked a double queen which was quite spacious and included a large bathroom and separate wardrobe (?) containing a kitchenette. This was a nice touch although we only used the fridge and ate out most of the time. The view from our room (9th floor) was awesome and you could see right into the BC Place stadium which is currently having some work done to add a retractable roof. We stayed over a weekend and the noise from the workmen was only noticeable on the Monday Morning. Being at the end of Beatty Street it was quite out of the distance but it meant that street noise was at a bare minimum and we always got a good night’s sleep. Free wireless internet in the room is a bonus although a given in a hotel of this type and assisted in our planning for the day ahead. Maid Service didn’t arrive too early in the morning which is a positive for the night owls and each morning they provide complimentary papers and bottles of water in addition to new towels. It is satisfying to receive double-towels for that night time shower given that most hotels are now restricting their linen arrangement. The decor was welcoming (although I wasn’t that bothered) and the beds were super comfortable - exactly what I needed after many days of walking the city. When turning the A/C off I couldn't help but notice an odour in the room. I can't remember if I had specifically asked for a non-smoking room but there was definitely that type of smell in the air. Breakfast was the usual buffet arrangement with scrambled eggs and waffles provided most mornings in addition to a meat item and the common cereal and juice/tea. I don't remember seeing a set restaurant in the building as we ate out each night. I would definitely recommend this hotel and would certainly consider it again when I visit.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tipperary", "Title": "“Perfect”", "Author": "lovetatravellots", "ReviewID": "UR84896604", "Content": "The hotel is perfect, location is amazing right across from BC Place. The breakfast is great. Stayed for a week in September 2009 and loved it, would be happy to return", "Date": "October 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Definitely the bet kept secret in downtown Vancouver!”", "Author": "OyBO2010", "ReviewID": "UR82807769", "Content": "I stayed here for 5 nights at the beginning of October 2010. It was a wonderful experience. The room was very clean with an extremely comfortable bed. The staff were very friendly and helpful. They allowed me to check in earlier and gave me a room immediately because they had one ready. I had a microwave oven and a fridge which was handy for my takeaway meals. There is a very nice retaurant conveniently located on the ground floor of the hotel and they deliver meals to the room when you order. I was attending a conference at the Canada Place Convention Centre and the hotel offered me a free shuttle bus every morning and to whatever other location I wanted to go to downtown as many times as I wanted to go. Also had free hot breakfast (limited choice but good all the same) and free internet. And all this for under $160.00 per night! In addition the hotel is walking distance to many of the restaurants and shops in downtown Vancouver. None of my colleagues attending the conference had such a good deal. No downsides for me, would definitely stay here again!", "Date": "October 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Plymouth, England", "Title": "“Enjoyable Stay”", "Author": "Markate", "ReviewID": "UR81221846", "Content": "We stayed at the Hampton for 3 nights at the start of a driving holiday round the Rockies and found it to be very good value. Staff were very friendly and helpful, especially Andrew who organised a last minute whale watching trip for us and dropped us at a bank and to Granville Island. Our room was spacious and clean with plenty of towels. As others have mentioned, the breakfast area is small and busy but has more than enough choice. We ate at Zacharys restaurant attached to the hotel one evening and had a good meal with 10% discount. We also ate at Yaletown, a short distance away with many restaurants. The hotel is in a good position and we walked everywhere.", "Date": "September 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Astoria, Oregon", "Title": "“Good Location and Serv”", "Author": "ater42", "ReviewID": "UR79022951", "Content": "The location is good for most of the city sights. Our room was a good size for a city centre hotel and the service was friendly and helpful. The only negative aspect was the breakfast which was included in our room rate. The size of the breakfast room was about a quarter of the size needed for a hotel this size. Also as there was no check I suspect that a number of people just came in off the street for a free breakfast. The food was generally unhealthy even by north American standards and the quality should have been better.", "Date": "September 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Takoma Park, Maryland", "Title": "“Nice place to stay for a downtown Vancouver visit”", "Author": "Leeskibike", "ReviewID": "UR78550865", "Content": "Attended a conference in Vancouver; my spouse and 3 year old son came with me. We stayed in a 1 bedroom suite with a kitchenette. We got a full-size crib rental for our son from bambinobabyrentals.com; they delivered the crib for free to the hotel because it was downtown. It was set up in the room when we checked in, which was nice. I tilted the couch on end and draped blankets and comforters from it to other places to make a sleeping area for our son in a corner of the living room. We didn't use the kitchenette as much as we could have; everything was available for meal preparation, including a full-size refrigerator. One reason the kitchenette was underused was the excellent free breakfast buffet. There was free Internet access via two terminals (with printers available) adjacent to the breakfast area. There is a SkyTrain station two blocks from the motel, which made it simple to get to the motel from the airport, and which I used every day to go to the conference at Canada Place. There is a grocery store a short distance up Robson from the motel. The motel had hybrid bicycles and helmets available for free; it was nice to check one out one day and take a ride around the perimeter of Stanley Park. The motel staff were very nice, friendly people. My spouse and son rode a free shuttle one day from the motel to Stanley Park. A coin laundry is available on the top floor, where the fitness center (with hot tub) also is located. It's a short walk to False Creek, where the little ferries offer service to Granville Island, etc.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“just a perfect stay....”", "Author": "robo16888", "ReviewID": "UR77922248", "Content": "I stayed at this hampton downtown from aug14-21,2010, with my parents (3 adults). our room price was very reasonable at $159/night pre-paid at least 1 month in advance, (i avoided the hst tax by pre-paying before the hst kicked in). we had just got off the cruise ships. bought my 'big bus' hop-on-hop-off tickets from near Canada Place where the cruise port is. and the 'Bug Bus' dropped us off 30 feet from the hotel door at the foot of Robson St across from BC Place (where the BC Lions football plays). we got there about 11am, so our room wasn't ready, they did their best to accomadate us, and our room was ready at 1pm. our room was very clean and spacious with 2 queen beds, facing directly onto BC Place. it has a complimentary coffee maker, and 2 bottles of complimentary water, and a bar fridge/freezer, and a lockable room safe. i needed a freezer for my alaska salmon. it has a 32\" flat screen tv. the AC was working very well, as the week was very hot and humid at nights. the complimentary buffet breakfast was also very good, with standard coffee/tea, OJ, and apple juice, milk. sometimes scrambled eggs, somtimes easy over, and hash brown potatoes (something different everyday), and a waffle-maker, toaster, yogurt, and bananas, and apples. you can sleep-in and still catch the breakfast till 10am. it has 2 computers and a printer with free internet access for half hour segments, until you re-login again, (I guess so that you don't hog the pc). it has a fountain in the lobby so you can refill your water bottles. the lobby and front desk area is kind of small tho. there's a gift shop, and a burgar and steak restraurant with live nightly music/band. there's an ice machine on a different floor and coin laundry on the 16th floor with a games room with ping pong table, and foosball table, and several seating chairs, and a few excercise machines. the games/excercise room has a door that can go outside onto a rooftop patio, with a couple of bench tables over looking bc place. there's a small 4 foot deep pool, and another door to a smaller patio. Susan, at the front desk was very nice to me and my parents, and she told me all the best places to see and do. also this hampton, was within walking distance to the edgwater casino. you can get complimentary coupon book at the front desk for free cab to the casino, and free $10 slot play, and $10 table plays, (my parents like to walk to the casino to get their excercise). in a strange hotel and environment, it usually takes me 2 or 3 nights to get used to the bed and room, i slept like a baby EVERY night for 7 nights. in the same week, my sister and her family stayed at the westin grande, and i think they paid $200+/night, cosmetically it looks nice, but they dont get the continental breakfast. as they say, the breakfast is the most important meal to start your day. so hope they had a good day and good stay as we did. we're extremely happy we stayed at this hampton, and we definetly will be coming back next time. i relied entirely on tripadvisor and other ppl's comments. so thanks to all the previous comments. anyways, DO YOUR RESEARCH! Thank you again Susan.", "Date": "September 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“No complaints! Good location and helpful staff”", "Author": "rand415", "ReviewID": "UR77535339", "Content": "My fiance and I just returned home from a 4 day trip to Vancouver. We stayed at the Hampton Inn during this time. While it is not exactly in the heart of downtown Vancouver, it's so close that it was worth it for the reduced cost/night plus free breakfast. The hotel staff was very accommodating and friendly, and there was even an on-site shuttle that took us to the local downtown sites we wanted to see. All we had to do was tip the driver, which isn't a necessity, but he was super nice too so we wanted to say thanks. The hotel room - we stayed on the 7th floor - didn't have wonderful views but we were able to see all the sites in our own travels so we didn't care to have a great view from our room. In our eyes, if you're spending too much time in the room, you're not enjoying the wonderful scenery outdoors enough! Anyway, the room was clean, and had a mini fridge and microwave, which was helpful when we had leftovers. This hotel is in a quieter part of the city, which was nice at night when we actually did want to go to sleep. Here are some things we did while staying in the city that you may want to try: -Yaletown - we found this area to be the most suited to our tastes (older 20-somethings to younger to mid 30-somethings). Upscale restaurants, great bars, good scenery and people watching. We ate lunch at Milestones in Yaletown, which was great. I know they have a deal for every day of the week. I think Wed was date night where all bottles of wine are $5 off. We also ate at Earl's (great patio with heat lamps and blankets if you want one!), Yaletown Pub & Brewery, and another tapas/sushi place whose name escapes me. Definitely check out the rooftop patio at The Keg - we loved this place. The drinks aren't cheap but they didn't seem to be cheap anywhere. The staff was incredibly friendly (and good looking!!), and the views from the roof were fantastic. -Yuk Yuk's Comedy Club - went on a Saturday night. This is located at a hotel downtown (again, I forget the name but you can probably look it up). I found it very funny and enjoyed the \"different' humor. We're from the States so the jokes some of the comedians cracked about Canada and Vancouver sometimes went over our heads, but for the most part it was very entertaining. Make a reservation in advance if you want to visit. -Granville Island - we went kayaking through EcoMarine for 2.5 hours (creek tour). Fun time - not cheap. Also, take note that if you make a reservation in advance, if you need to change days (we did due to rain on the initial day we booked), they charge you $10 if you're 48 hours from your original booking. Seemed silly but we paid it and enjoyed it. The shops are cute to visit - we didn't eat at the market since it was so crowded to walk through. Instead we went to Go Fish, this little stand that was recommended by our kayak instructor. The BEST fish and chips we had out there. We also tried the tomato soup and the sesame crusted tuna sandwich. The line for this place was super long, as I've heard it always is, and the wait to get your food after you order takes about 15-20 mins, but it was delicious and not all that expensive! Highly recommended. -Stanley Park - we rented bicycles and rode the seawall. I don't ride often so I was a bit nervous, but it was easy riding and gorgeous scenery. The food at the park was very expensive so we didn't eat there but I heard people packing picnics. Try that! Also, if you rent a bike, make sure to shop around. We found a place that was cheaper than some others, but didn't offer flat tire service in case you get a flat while you're out in the park. We took the risk and everything was fine so we ended up saving some money. -Granville Street - many bars and clubs on this street that are hot on Friday/Saturdays, but we're not much into the clubbing scene so we decided to walk around the street to check out what goes on there. Since the drinking age is a bit younger in Canada than home for us, there seemed to be many younger people (18-early 20's) totally wasted wandering the streets. In just the 2 blocks we walked, we witnessed a girl almost puke, two guys being broken up from getting into a fight, people drinking in the streets, and girls with dresses so short and tight that I was amazed they could breathe. Interesting to walk through, but Yaletown felt less wild and crazy to us. Totally a personal preference and I'm sure the club scene is a lot of fun, but it was definitely wild :-) Was fun to check out though! Aside from that, we spent a lot of time at the English Bay beach and some of the parks in the area. I highly recommend laying on a blanket and just relaxing out there, or bringing picnic food and staying to watch the sunset. Just beautiful.", "Date": "August 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Vancouver Island", "Title": "“The Best.......”", "Author": "TheInnocentBystander", "ReviewID": "UR75992450", "Content": "I stayed here for almost 4 weeks from June 2010 to middle of July 2010......as I suffered a concusion at work and was sent to Vancouver to a clinic. This hotel is a gem in downtown Vancouver. I have stayed just up the street on Robson at a few different hotels and nothing comes close value wise. First off....it is quiet. I was only there from Sun to Thurs so I can't comment on the weekends but during the week in was great. With my concussion I needed a quiet hotel and this fit the bill to a T. The beds are awesome as most Hamptons are. There is a ping pong table and foos ball table......weights...treadmill and hot tub & sauna rooftop..you can sit in the hot tub and see inside BC PLace as the roof is being replaced at the stadium. Or sit out and enjoy a starlit night on the deck. The breakfast was awesome..always hot..I always ate early though so can't comment if you are eating later but if you eat a free breakfast at any hotel you will find it crowded, You can walk anywhere......Chinatown,Yaletown....sky train...Canada line. On Beatty Street on one side of the hotel you can always get a cab as it is a waiting location for one of the cab companys, Too far to walk to English Bay/Stanley Park but a cab there is only around $8.00. The staff went out of their way to make sure my stay was a good one.....especially Susan at the front desk and Lauren the sale manager. I pre-paid for one of the weeks but ended up having to have dental surgery back home. They could have kept my money but instead reworked my stay into the following week. After staying there 20 days I don't have one bad thing to say about them.", "Date": "August 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Overall great hotel, just pricey for a Hampton”", "Author": "techfan", "ReviewID": "UR75190863", "Content": "Just returned from a week in Victoria and Vancouver and stayed at the Hampton Inn in Vancouver. For us the location was great, we are not cruisers and did not want to stay near the cruise docks and crowds. The location is in between two rails stops and within walking distance of Yaletown (many restaurants) and Gastown. The hotel has 4 complimentary bikes that you can use for 3 hours which was plenty of time to ride the seawall from Yaletown area all the way around Stanley Park. (Remember to ride counter clockwise!) Our room was very quiet and overlooked BC stadium. Yes, the breakfast room is on the small side but they do their best to accomodate everyone as best they can. The food was very typical of the Hampton chain. Vancouver in general seems to have a problem with homeless and pan handling - read other posts about this and pay attention to your surroundings. We had no problems around the hotel, mainly Chinatown and Gastown. We did have the fire alarm go off at 3:30 AM and had to walk down from the 11th floor! We heard someone was smoking in a non-smoking room and set off the alarm. All was handled well, just a delay in unlocking the elevators (my husband has walking issues and had to wait for the elevators). My only complaint was the price but when researching hotels it just appears that Vancouver is a very expensive place to stay. They have coin operated washers and dryers on the 16th floor as well as an exercise room, whirlpool with incredible view and roof deck.", "Date": "August 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "St. Louis", "Title": "“Pretty good”", "Author": "ziggydssp", "ReviewID": "UR73293874", "Content": "Stayed here in July for 2 nights. I would say it's an okay hotel worth no more than $135 per night. It was clean, pretty quiet and the staff were sufficient but not great. The shuttle driver had a bit of attitude which turned me off. The breakfast was okay but not anything too good to brag about. The danish were cold and hard and they kept running out of milk. There is not much seating for peak hours. The location of the hotel is at the southern extreme of the main tourist district. It's quite a hoof to Stanley Park or other area to the north. The hotel is close to Yaletown which has lots of dining options. We tried Simply Thai and Yaltwown Brewery and both were very good.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Clean, comfortable and perfect for our trip”", "Author": "justjayce", "ReviewID": "UR72161248", "Content": "This was our overnight stop off point prior to our cruise. I picked this hotel because it had a free shuttle to the cruise terminal, a big bonus, and I could burn some of my Hilton points as Vancouver is very very expensive. Check-in was easy and the people were friendly. The room was nice and the bed was comfy. There were free bottles of water in the room which was a nice touch, and plenty of choices on the TV. At first the internet was not working - other patrons were complaining about it. So instead of coming back to tripadvisor to find a place to eat I asked the front desk. They steered us towards southwest of the hotel (Hamilton street) where there were lots of trendy shops and eateries where the hamburgers start at $15 USD. Was not interested and considering their eateries were mainly empty not many others were at that time either. Robson street was the answer. There were several \"cheaper eats\" along the road including the Japadog restaurant which I now regret missing out on. When we got back the internet still was not working for me, but we were able to get the wired connection up after calling their tech support. I was worried that the evening was going to be a loud one since there was a heavy metal concert going on nearby. We did hear lots of people shouting before the concert, but didn't hear anything in the evening. Must have been dead tired. The breakfast in the morning was one of the best set up I had ever seen at a Hampton. The second floor of the lobby area was all for breakfast and the selections were plentiful. Our shuttle to Canada Pier was easy and free - which saved us a cab ride or a train ride/walk if we stayed anywhere else. The staff were friendly and the service was good - I have no complaints other than the internet wasn't working right for me and others.", "Date": "July 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“Excellent 4 star hotel in convenient downtown Vancouver location”", "Author": "AussieTraveller56", "ReviewID": "UR71596073", "Content": "My wife and I spent 6 nights at the Hampton Inn & Suites, in 3 stays of 2 nights each, as part of a package booking around Rocky Mountaineer train trips and an Alaskan cruise. We had 3 different rooms, all of which were of a very high standard - large, comfortable and clean. The included breakfast buffet was good, and the reception staff very pleasant and helpful. The location was good for exploring Vancouver, and the hotel was within walking distance of the SkyTrain to the airport. No complaints whatsoever. Highly recommended.", "Date": "July 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "edmonton", "Title": "“Great Hotel”", "Author": "kelsek", "ReviewID": "UR69254939", "Content": "Well situated in downtown vancouver, this hotel has very friendly service and great rooms. Walking distance from market and other ammenties. Good rates and very comfortable beds. Fire alarm went off twice but other wise it is very nice.", "Date": "June 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scottsdale, Arizona", "Title": "“Don't misss the view from the 16th floor”", "Author": "tafuti", "ReviewID": "UR66480234", "Content": "Stop shopping for a place to stay in Vancover if you want a great experience. When you check into this hotel not only are you getting a room but a personal travel guide when you meet Ryan Christopher and Andrew behind the counter. Their recommendations on what to do in Vancouver is amazing. They took into consideration that we were traveling with a teenager and found a comedy club we could get into and set up a perfect evening in Vancover. Don't miss an opportunity to go out with Hampton's excellent and entertaining driver Andrew. He gives you great insight to the city and makes your time with him interesting and makes you feel like you got to see Vancouver from a proud Canadian. The complimentary breakfast is excellent and very nicely presented. The biggest wow moment is when we went to the 16th floor and saw the most magnificent view of the city. Don't know of another hotel where you can sit in the jacuzzi and see the entire city. What a view and a hotel.", "Date": "June 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bathurst, Australia", "Title": "“A Credit To Canadian Tourism”", "Author": "Kendallclan", "ReviewID": "UR64872000", "Content": "After arriving tired and weary from a 14 hour direct flight from Australia at 8 a.m., my husband and I were warmly welcomed to this excellent hotel with an early check-in and crawled into the ultra-comfortable bed for a nap before exploring the nearby delights of Vancouver. The hotel is an easy walk to the shopping precinct and an extensive range of restaurants, bars and convenience stores. The room was perfect with expansive windows, tasteful decor and a pristine, roomy bathroom - plus, large screen TV, table & chairs etc. When we returned for a three day stay at the end of our vacation, we were provided with a room which provided the benefit of a kitchenette with microwave, crockery etc. The complimentary breakfast (a rarity these days) was of a very high standard with a surprising array of goodies and, if one is sensible enough to choose an off-peak time, provided a relaxing and sustaining start to the day. We dined at the downstairs restaurant/bar and were impressed with the friendly, hospitable staff - as were the front desk attendants. They provided a friendly, relaxed and warm stay and this hotel cannot be praised highly enough. Canadian tourism generally proved to be excellent throughout our holiday and we will be recommending Hampton Inn and Suites and Canada generally as an ideal vacation destination. Thank you, - The Kendalls", "Date": "May 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calgary", "Title": "“Hampton Inn is always a consistent choice”", "Author": "gypsytravels", "ReviewID": "UR62510364", "Content": "Free internet, complimentary breakfast and consistent service make the Hampton Inn a choice hotel for travel within Canada. I find that the rooms are always new and clean and the service is good. The location on Robson was ideal for two days of downtown meetings with all being within walking distance. I will stay at this hotel whenever traveling in Vancouver for business", "Date": "April 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Alberta, Canada", "Title": "“Fantastic!!!!”", "Author": "SugarnFlower", "ReviewID": "UR59264617", "Content": "We stayed at this hotel for 5 days in Feb 2009 for the Vancouver Boat Show. This was a fabulous hotel. Beautiful room, nice staff, comfortable beds, clean hotel overall. We will stay with them again hands down. Highly recommended!!!! Great place to stay for hockey games and lots of great pubs, bars etc within walking distance. Just a nice clean, comfortable hotel overall. :)", "Date": "March 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Kamloops, Canada", "Title": "“Great location for concerts”", "Author": "cynlouhoo", "ReviewID": "UR49602382", "Content": "This was our second stay at the Hampton and since we were so happy with the first stay, we had high expectations this time. We arrived a little early, but not too much before the official check in time. We were there with another couple (seperate rooms) and they were told their reserved room wasn't available, but they managed to get another room.....they never said anything to us, but just gave us a room. Turns out both our rooms were RIGHT next to the elevator....like touching. We went down and got different rooms, but one of them was on the 4th floor and definately lacked the view. We managed to scoop the higher floor room with the better view. As usual the bed was VERY comfortable, and they have a large, flat screen TV in the room. Bathroom decent with the curved shower rod and peek-a-boo shower curtain to avoid any of those \"Psycho\" moments. Pretty decent access to ice machines, but plastic cups in the room. All was going fairly well until breakfast rolled around and a large group of hungover concert goers were faced with a very horribly managed breakfast \"buffet\". Items were not replenished quickly, and in some cases not at all. It was sad. And this was one of our highlights last time! All in all, it was a decent stay and the location is perfect for concerts.....especially if the concert is at BC Place (this time we went to GM Place).", "Date": "November 19, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Washington", "Title": "“Perfect for BC Place.”", "Author": "RavennaEvans", "ReviewID": "UR48455384", "Content": "This was my second stay at this hotel, and it will not be my last -- this is a great hotel for attending concerts at BC Place Stadium. It's right across the street from the venue, nothing closer except the Georgian (which is usually booked by the roadies of the band, at least in U2's case). Check-in was a breeze, took all of 30 seconds, and check-out was even faster. Parking was super convenient in the garage, although kind of pricey. We didn't get up early enough to eat breakfast, so I can't attest to the included breakfast -- we ended up walking two blocks or so to McDonalds. The room itself was wonderful: nicely decorated with clean, white bedspreads and down pillows. Flat screen TV, beautiful bathroom, not bad water pressure. The best part of the room, however, was that two whole walls were glass windows, floor to ceiling, looking over BC Place (we were on the 10th floor). What a view! Admittedly, it wasn't looking onto anything really cool like a pretty city view, but it made keeping an eye on the proceedings of the concert below super easy (so we could decide when to go down to the venue without having to wait in line). My only complaint would be the lack of a decent sit-down restaurant at the hotel. All in all a great experience!", "Date": "November 3, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "So. Cal", "Title": "“Fine. but...”", "Author": "socalbeachbum97", "ReviewID": "UR47642864", "Content": "If you need a place to rest your head, then this place is fine. Excellent location if you plan on going to a Canucks game. Other than that, the rooms are very plain, small, and suffocating. The location isn't that great for most sightseeing in Vancouver. And the free breakfast? A completely chaotic experience. You get what you pay for here. And the views are undesirable. The opposite end of Robson St. has a lot more to offer. Skip the restaurant. The food and service is lousy.", "Date": "October 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Australia", "Title": "“Convenient affordable nice clean hotel downtown”", "Author": "kyh86", "ReviewID": "UR47124105", "Content": "This was our first time staying at a Hampton Inn & Suites within the Hilton chain, and it was a most pleasant experience supported by many reviews by TripAdvisor members. Nice helpful reception and efficient check-in. Located just off the stadium on the east end of Robson St, it is a short walk to the main shopping area but on the night that we arrived, there was a musical event outside the stadium due to a major football match that day. Thankfully that ended by about 7pm otherwise the noise would be unbearable, and otherwise the rooms were quiet and no traffic noise was noticed. Self parking is CAD17 per day which is reasonable for downtown. Rooms (we had two kingsize bedrooms) were spacious, clean and bright with very comfortable beds (two queens in one room, and one King in another), free inroom wireless, flatscreen TV and a nice lap-rest for using the notebook in bed. Airconditioning was very efficient and quiet - there is even a humidity control feature. Toilet/shower bathroom clean and spacious enough as well. Large In-room safe. Free coffee/tea making facilities in the room and free bottles of water each day. All rooms include hot breakfast which has a good selection of quality cereals, pastry, some fruits but poor quality of hot meals (weird plastic looking fried eggs that don't even look like proper eggs, and poor quality of sausage or meat patties - only one type available each day). Good selection of teas and coffees which are freely available to-go as well. We were happy with the experience except for that weird fried egg which we all (4 or us adults) agreed was not worth even a try.", "Date": "October 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "southern", "Title": "“great stay”", "Author": "tripfoot", "ReviewID": "UR46594981", "Content": "very good stay on way in to Canada and up to Whistler. clean, great amenities, and excellent service. in great location.", "Date": "October 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Rochester", "Title": "“Friendly staff and good location.”", "Author": "Jojicat", "ReviewID": "UR42865044", "Content": "Good sized suite that was perfect for my early rising husband to have his space without disturbing my beauty sleep. Comfortable bed, clean bathroom and quiet location. We didn't have the breakfast as my husband prefers a cooked breakfast and what little is provided didn't look that great. However if you're happy with Continental breakfast it looked fine. There is limited space in the breakfast room which could be a problem if the hotel was busy. Reception staff were friendly and helpful. Provide free shuttle around town. Would stay again.", "Date": "September 19, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Ocean City, Maryland", "Title": "“Great room with a view!”", "Author": "skydivehockey", "ReviewID": "UR41996060", "Content": "Our room was a large king, corner room (12th floor, I think) with floor to ceiling windows on two sides overlooking downtown Vancouver. Staff at front desk, bellhop, etc. were all very helpful and friendly (it was our first visit to Vancouver). Very quiet. One of the few hotels with free internet in rooms. Would definitely stay there again.", "Date": "September 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "San Juan, PR", "Title": "“Great Location for Leisure Traveller”", "Author": "pr123", "ReviewID": "UR41463143", "Content": "My wife and I were in Vancouver for 3 days getting our daughter set up in university. We booked the Hampton Inn as we wanted a suite and they offered the best rate for a branded hotel downtown. The hotel is not large, but well located across from BC Place and only 3 or 4 blocks walk from Yaletown (a great place for dinner or nightlife). That was a pleasant surprise, as I expected to be a bit out of the way. The room was as expected for Hampton; clean and functional. The front desk staff were friendly. The hotel offers free hot breakfast, which was OK. I can't recall how it compares with other Hampton Inns (its been a while), but we found the selection very limited and it was very busy. (Basically a continental breakfast with 1 hot item; eggs one day and waffles the next.) The other minor annoyance was the parking; it is very tight to get into/out of and there are limited spaces. 1 night every space was full except for handicapped parking. Notwithstanding the 2 issues we had, it was still a good value for a good quality suite in a good location. While I plan to try something else next time I'm in Vancouver simply for variety, I wouldn't hesitate to recommend the Hampton Inn.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Victoria", "Title": "“great value, great service”", "Author": "srdavis033", "ReviewID": "UR39289598", "Content": "The front desk staff was incredible. What a difference from the Sandman that is right beside it. Great location and great value.", "Date": "August 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Edmonton", "Title": "“Great hotel, great service, would visit again”", "Author": "mollsworth", "ReviewID": "UR39077190", "Content": "We stayed over for 4 nights and consistently found the service at this hotel to be excellent. The front desk staff are very helpful, and can offer plenty of suggestions about which parts of downtown Vancouver to visit! Renting a bike to zip around Stanley Park was a highlight - even in November!", "Date": "August 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Canoe, BC", "Title": "“Indulgent”", "Author": "scottycanoe", "ReviewID": "UR37158007", "Content": "My first stay at the Hampton-- excellent reception on arrival, marvellous and plentiful fresh food at breakfast, friendly helpful staff who appear to like their jobs. Location cannot be beat in beautiful Vancouver - enjoyed the panoramic view while using the fitness room. Excellent hotel, I will be back.", "Date": "August 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "St. Albert, Alberta", "Title": "“When I visit Vancouver, this is the hotel to stay at.”", "Author": "bagstrap", "ReviewID": "UR37023116", "Content": "The service at the Hampton Inn Hotel is great. People are friendly and helpful. Two years ago I stayed with my daughter and we have a wonderful time. So close to everything we were able to walk everywhere. I have stayed this year with my sister, and again we enjoyed the service, the rooms, and the lovely breakfast.", "Date": "August 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“fantastic home away from home!”", "Author": "albertamouse", "ReviewID": "UR36082200", "Content": "I have stayed at this hotel several times in the past couple of years and i love it! excellent staff, excellent rooms. very clean and comfy. the breakfast is so tasty, and i really liked the bagged breakfast to go. their shuttle service is very reliable and pleasant. i would rate it a 10 out of 10 for sure. i will be staying there in a few weeks again and am greatly looking forward to it.", "Date": "July 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Edmonton", "Title": "“my favourite hotel to stay in while in vancouver!”", "Author": "mofoqueezee", "ReviewID": "UR35706269", "Content": "I love this hotel. I stay here everytime I am in town, about every 4-6 months. The location is great, right on Robson street, the staff is super friendly and helpful, the rooms are amazing and the free breakfast is the icing on the cake! Not your typical continental bagels and coffee, but we're talking pancakes, different cereal, eggs...yum! Would definitely recommend this place to anyone!", "Date": "July 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sacramento, CA", "Title": "“Wonderful first trip to Canada”", "Author": "RoseLizenberg", "ReviewID": "UR35687707", "Content": "i don't normally bother submitting reviews like this, but your staff was so kind to us and our rooms were IMMACULATE. I'd definitely recommend your hotel to anyone taking a Holiday in the Vancouver area.", "Date": "July 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Mississippi", "Title": "“Consistently excellent!”", "Author": "eledean", "ReviewID": "UR34406686", "Content": "I have stayed at the Hampton Inn in Downtown Vancouver three times over the past three years, and the stay has been excellent every time. The front desk employees are very nice and helpful. Checking in and out is easy and generally very fast. The rooms are large, the beds are comfortable, and the sleeping areas of the hotel are quiet. You would never know that you were in the downtown area of a very large city. The location of the hotel is also excellent and within easy walking distance of almost everything. Also the free internet service worked well although don't plan to use the hotel computer or printer because the charge is $30 per minute! The only negative was the overcrowded breakfast, but that wasn't the fault of the hotel. Considering all of the people, I was amazed at how quickly the staff kept the food replenished and the tables cleaned off. The hotel is a bit pricey for a Hampton Inn, but as someone who made the mistake of trying a different hotel in the area at a lower price, I think this Hampton Inn is worth it, and the price is usually lower in the off season.", "Date": "July 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Kelowna", "Title": "“Comfortable Rooms and Great Service”", "Author": "FootballFan27", "ReviewID": "UR33664972", "Content": "I stayed at this hotel while attending a Lions game with some friends - and we all really enjoyed our stay. We were able to get into our rooms before 3pm, which was great! The front desk staff was really helpful with restaurants (Keith helped us find a really delicious restaurant in Yaletown), and it was so close to BC Place. The free internet and bottled water were a great touch. I'd definitely stay here again next time I come in for a hockey/football game or a concert.", "Date": "July 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "buckingham", "Title": "“very good hotel”", "Author": "michele777777", "ReviewID": "UR33633802", "Content": "Only stayed two nights but it was long enought to see that the hotel staff were very efficient and always happy to point you in the right direction. The rooms were big and airey, with comfortable beds. The food was yummy and we especially liked the new waitress from Nova Scotia. Would return if we w ere in Canada.", "Date": "July 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Singingsweetie", "Title": "“Amazing view, staff and room.. who could want more?”", "Author": "Singingsweetie", "ReviewID": "UR33271945", "Content": "I had planned to stay at the Hampton Inn in Downtown Vancouver with my boyfriend (at the time) to have a romantic stay in the city for the Valentine's day weekend. Not only did the staff treat us both with consistant respect and consideration, they were incredibly helpful and knowledgeable about the city. The front desk staff are exceptional- they made the stay at the Hotel feel like i was in my own home away from home. I highly recommended this hotel to all my friends~ especially the amazing Jacuzzi Tub in the room and comfortable king-sized bed.", "Date": "June 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Abbotsford", "Title": "“Fantastic Hotel!”", "Author": "HappyTraveler13_9", "ReviewID": "UR33137601", "Content": "I had a fantastic stay at this hotel this month! The staff was excellent, service was great! I would recommend this hotel to anyone.", "Date": "June 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "San Diego, California", "Title": "“Good Location, Ok Customer Service, Hard to Get Room Before 3pm”", "Author": "FreqTravelers", "ReviewID": "UR31163308", "Content": "We arrived to Vancouver off a cruise ship. We first arrived at the hotel at 11am and tried to get our room, but it was too early, they said it would be guaranteed by 3pm. There were a lot of people waiting in the lobby. We left our bags and went off to explore. We came back at 2pm and our room still wasn't ready, so we left again. We finally came back about 5pm and was able to check into our room. We found customer service to be just ok. The porter wasn't all that friendly when we left our bags with him, but he did remember our name when we came back. When we checked on our room at 2pm, the front desk didn't really seem helpful. However, the front desk was helpful when helping us with cabs and directions. It took about 5 minutes for them to get us a cab. Our room was on the top floor (15th). You have to have a key with you at all times throughout the hotel. It is required to operate the elevator, get into the ice/vending room, and to get into the lobby bathrooms. I'm sure this is for security reasons, but I went to get ice once without a key and ended up coming back with none after walking up and down 6 floors. There was free wi-fi available, which we used. There is free breakfast from 6 to 10am, although we got up too late our first morning, we did see it our second morning before leaving for the airport. They had coffee, tea, pastries, cereal (all sugar ones), and some hot items (not sure what they were). The top floor has a recreation room with a couple of treadmills, some weights, a ping-pong table, a foosball table, and a huge hot tub. The hot tub wasn't very hot, but warm enough to feel like you were sitting in a bath. The jets weren't very powerful at all either. There was also a balcony area to look out over Vancouver. The location was ok. We were within 15 minute walking distance to the marina in Yaletown and also Chinatown and Gastown. The area of the hotel was pretty safe, it's the areas in between Chinatown and Gastown that can get a little sketchy. The hotel is located along Robson St which is a good shopping street. We've stayed at a lot of Hilton hotels, but I just didn't really feel the hospitality, coziness, or charm here that we normally feel when staying at a Hilton. We usually have great experience with and enjoy staying at the Hampton Inns. Next time we visit Vancouver, I'd probably try to stay somewhere else.", "Date": "May 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Rio de Janeiro", "Title": "“great value”", "Author": "Thelma K", "ReviewID": "UR31054996", "Content": "I spent ten days in Vancouver to visit a relative, and the hotel was totally adequate to my needs. The roms are spacious and confortable, with a fridge, a microwave and even an iron and an ironing board. The hotel also offers an umbrella (Vancouver is said to be a very rainy place though I only got one day of bad weather during my entire stay) and complimentary bottles of water. Breakfast was also free, and, despite some reviews I saw posted here, I didn't think it was poor or unsavory . It was just simple, but enough to start the day. The staff was nice and helpful, and the chambermaids were simply great. One day my mother forgot a gold ring on the bathroom sink, and no one even touched it! The only aspect that is not so good about the hotel is its location. It stands right in front of BC place, but the area around it is not very nice. I saw beggers on the street almost everyday, and you must walk about five or six block to reach the main shops and restaurants around Robson St. Nonetheless, I must say it is not such a long walk (ten to fifteen minutes) and overall I had a very good time.", "Date": "May 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Hollins, Virginia", "Title": "“Remains my business choice in Vancouver”", "Author": "global-engineer", "ReviewID": "UR30181265", "Content": "I have stayed here several times over the last three years or so when visiting central Vancouver on business. My recent visit confirms that all the good points I made in my previous reviews are still valid. I highly recommend this hotel for both business and tourist travel, especially if you have a car. But I will point out (as I have in previous reviews), that this is a Hampton Inn, not the Four Seasons or the Mandarin Oriental. Just because it is highest rated in TripAdvisor does not mean that it is the most luxurious hotel in town -- in fact it is not even a luxury hotel. It is a clean, safe, comfortable place to stay. If you are not familiar with the Hampton Inn chain, then check it out before selected this hotel so you will have the correct level of expectation. If you are familiar with Hampton Inn, you will find this to be just as nice, if not nicer, than any Hampton Inn in the USA.", "Date": "May 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Canberra, Australia", "Title": "“Large apartment, convenient location”", "Author": "Frade", "ReviewID": "UR27127562", "Content": "We were pleasantly surprised by a number of things. Firstly, it was easy to find. Secondly, our room was much larger than we expected. And thirdly, it is close enough to everything Downtown to be able to walk everywhere (shops, entertainment, restaurants, etc). Free WiFi was a bonus. Many other places only have wired internet. The staff were always friendly and helpful. The restaurant downstairs did a basic room service, and they were very flexible with our special orders. The free breakfast was okay, but nothing amazing. Very basic and the quality was ordinary.", "Date": "March 30, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "California", "Title": "“Overrated”", "Author": "AGTraveller", "ReviewID": "UR23204272", "Content": "The room is spacious and clean, but the furnishing is quite dated, given the room rate. Our reception at the desk was not exactly warm when we arrived on a snowy, quiet day. The location is ideal if you are a hockey fan (as it is right next to the BC Place, the stadium), but not for shoppers even though it is on Robson Street. In fact, the neighborhood struck us as somewhat seedy. The suites do not have a bathroom that opens into the living area, and so if you have more than a couple in the party it is not an ideal situation. There were two computers available in the lobby and you must obtain an access code to use one at 30 minutes at a time. On the days when I stayed there I had to compete each morning with two small small kids who used the computers, in the words of their own parents, to kill time.", "Date": "January 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kamloops, Canada", "Title": "“Extremely Safe Hotel!!”", "Author": "CDNLynn", "ReviewID": "UR23089948", "Content": "Our family has just returned from an overnight stay at the Hampton Inn (part of the Hilton brand) in downtown Vancouver. This is probably the 3rd time we have stayed there and have always had a wonderful experience. This time was different though! Our hotel room was right by the elevator and because of distraction, didn't check that our door was properly closed when we left to watch the Canucks play the Senators. We had used the \"hockey parent' strategy of leaving the door open with the latch so that our kids could come and go without us having to get up to answer the door...only we left the hotel!! We headed out at 5 pm and returned around 11 pm to find a message on the phone saying that our room had been left unlocked...and to check the room to see if anything was missing. Everything was still in the room...even the laptop. Thank goodness a staff member does a sweep of each floor several times in the evening. As other reviewers have mentioned the hotel is very secure...a room card for swiping is needed to access the rooms by elevator. I appreciated that in the past, but now...even more. The breakfast was great and just what we needed before making the trek back up the Coquihalla highway. I can't say thank you enough to the staff who made our stay complete. They were friendly and kind...and that was before our unlocked door fiasco! As always, the rooms are very clean and immaculate. It is a great hotel that is really close to GM Place and BC Place. It is within walking distance of the downtown core as well. PS. We had 1 room with 2 queens and 1 room with a king bed and paid $143 Cdn each. Parking was $16 per day. I am surprised that it is rated only 2 stars.", "Date": "December 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Kamloops", "Title": "“Friendly and accommodating”", "Author": "biker367", "ReviewID": "UR22409131", "Content": "Our room was ready at 2 pm when we arrived. The initial room that was given to us was right beside the elevator. Within minutes of us being there someone was leaning on our door waiting for the elevator. A request to change rooms was promptly dealt with. The staff was very courteous and the free buffet in the morning was very generous. The underground parking is the most secure I have found so far in downtown Vancouver. Room key to get in and security cameras. Also keep a room key if you check out before getting your car, you need to swipe the card in the elevator to get to the parking level. There is a key drop box at the parking level. I will stay here when I ride my motortcycle here next summer.", "Date": "December 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "north carolina", "Title": "“Great hotel!”", "Author": "tweeternc", "ReviewID": "UR22218158", "Content": "My husband and I stayed at this hotel for three nights in Nov 2008. This is a very nice Hampton Inn. Our room was nice and clean and had a microwave and fridge. The staff was very friendly and helpful. They even offered us bigger umbrellas than the ones we had because they saw how soaked we were. The location is great. We only took the car out one time the whole weekend because we were able to walk almost everywhere we wanted to go. They also have a guest laundry facility, which is very handy when you are on a long trip. We are planning to visit Vancouver again in the future and we will definitely be staying at the Hampton Inn.", "Date": "November 26, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Surrey", "Title": "“Very pleasant city-centre hotel and great value”", "Author": "Stevie390", "ReviewID": "UR21878969", "Content": "This Hampton Inn is located slightly off-centre, but is still an easy walk from the tourist sights and business district in Vancouver. Several restaurants and convenience stores are located close-by. The worst inconvenience was that the hotel is not on the circuit of the Airport Bus. The hotel is modern with very pleasantly furnished and fully-equipped rooms. The complimentary breakfast had a wide choice, including a daily hot option. The breakfast area, though compact, never seemed overwhelmed. Complimentary internet access was also available. There is a restaurant attached that provides evening meals. The food was okay, but the service was poor and I wouldn't rate it highly.", "Date": "November 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Orlando, Florida", "Title": "“Great Place to Stay in Downtown Vancouver”", "Author": "DisneyParis", "ReviewID": "UR21694864", "Content": "Dates of Stay-25-26 October 2008 (1 night) in Room #407 We arrived just after noon and were allowed to check in early. We could have stayed on a higher floor had we waited a few hours but since the floor plan was the same, we opted for the best available at that time. Staff went above and beyond-always friendly, smiling, and professional (see comment about safe below). The hotel was directly across the street from BC Place, where the BC Lions CFL team plays, and we were on the side facing it. General Motors Place, where the NHL Vancouver Canucks play, is about 100 metres away. Both teams had home games the night we were there, and there were lots of boisterous fans. There was pre game music and other celebratory noise during and just after the games until about 11 pm, but can’t fault hotel. The fans were well behaved but just loud. If this is an issue, check the game schedules, and stay across town somewhere. The room had 2 very comfortable beds with duvets, 3 large pillows, and 1 small pillow. I got a great night’s sleep. Also, 2 telephones, internet connection in room for dialup but wifi also-didn’t have computer so not sure how well it works (there are two free internet stations on 2nd floor near breakfast room-just ask for 30 minute passwords at front desk), a television with about 50 channels-US and Canadian but no ESPN or ESPN2 so limited US sports, especially NCAA. There was a free in room safe-it didn’t work so I called front desk and someone came in less than 5 minutes to reprogram. There was a refrigerator and microwave but no minibar to rip you off. (there is a convenience store-7/11 I think, just down Robson for drinks and snacks) There was a kettle for coffee and tea and ample supplies-sure they would give more supplies, if requested-2 complimentary bottles of water also! There was a desk, table with 2 chairs, ample lighting, and clock radio. There was a closet with plenty of space and several hangers. The top floor of the hotel has an area with table tennis, 4 exercise machines, pool, dry sauna, hot tub as well as bathrooms and water station-not sure if there is shower in the bathrooms since I didn’t go in there. Terrace for sun bathing or touristy views of city-area very clean and well maintained-no litter or anything negative except smoker on terrace. Realize hotel can’t be everywhere all the time, but warning signs may help. $200 fine for smoking in room, but does that include the terrace or standing in room with head out window-2 windows that opened from room-can see cigarette butts on roof just below room-I wondered if people smoke in room next to window or with their head out window and then use the rooftop for their ashtray. If the hotel is totally smoke free, that should mean “totally”, everywhere!!! (hotel should investigate) Parking area very secure-2 gates to pass through with room key before reaching parking spots. You don’t need key to get out as one previous reviewer mentioned. Parking price reasonable for downtown Vancouver where even meters aren’t free on Sundays and holidays. Elevators require card swipe everytime-even from guest room floors. Felt very safe and secure. Ice machine out of order on my floor but no big issue-hotel had sign and was repairing. I had to go up a few floor for ice. Typical Hampton Inn breakfast-ham patties and fried egg circles the morning we were there plus coffee, tea, juice, breads, cereals, etc. as well-everyday standards at Hampton Inns. I would have preferred sausage patties but no big deal-I just picked the wrong morning for those. If you are meat lover and want a fantastic lunch-head for Samba Brazilian Steakhouse & Churrascaria at 1122 Alberni St (between Robson and Georgia just past Burrard). It’s about a kilometer from the hotel. All you can eat lunch with buffet and servers walking around with different meat skewers for CDN$14, I believe. Lamb is especially good. It’s currently in the Delta Dining guide so I even earned some SkyMiles! I have no complaints except for the lone smoker or two who breaks the rules. This was a great find for a very reasonable price in the centre of a fantastic city. I hope to return to Vancouver in the next few years and will definitely consider staying at this great hotel again. For the price and location, there is no place better!", "Date": "November 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "London, england", "Title": "“Great hotel”", "Author": "taxdoug", "ReviewID": "UR21372648", "Content": "I booked the hotel because of the positive Tripadviser recommendations. They were fully justified. Really welcoming reception staff, excellent room (following free, unasked for, upgrade). no noise and good breakfast. All for an excellent rate. Downsides - the location isn't great particularly after dark and don't expect too much of a view from your room!", "Date": "October 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kaneohe", "Title": "“Highly recommended”", "Author": "LeimomiC", "ReviewID": "UR21324714", "Content": "we spent 3 nights at this hotel and we were very happy! the free breakfast had a nice selection. there was a great workout room on the roof. we felt very secure and safe because the parking garage required your room key to get in and out. the rooms were very clean and beds were comfy. walking distance to many places to eat, mostly casual places.", "Date": "October 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Liked the hotel, hated the \"private tax\"”", "Author": "Crooksmeister", "ReviewID": "UR21216918", "Content": "We stayed at Hampton Inn and Suites Vancouver for 5 nights in the middle of October, 2008. We enjoyed the stay a great deal. The hotel was in excellent shape, despite the fact that it looks to be around 20 years old. Our accommodation was a large, one-bedroom king suite on the 14th floor. It was light, bright and very spacious. The outlook, North-West along Robson Street, wasn’t anything to write home about, but we weren’t there particularly for the view. Everything in the suite was spotless, from the kitchen (equipped with a microwave oven, a dishwasher and a refrigerator, but no stove) through the bedroom and living room to the spacious bathroom. The suite was equipped with two large television sets, and there was adequate lighting for activities during the evenings. The king bed was excellent. There was an adequate supply of high-quality towels and toiletries in the bathroom. The kitchen was fully equipped with cutlery, crockery, microwave cooking dishes and a variety of other implements. Perfect if (like us) you wanted to do a bit of cooking “at home” after a long time on the road. The breakfast (included in the room rate) was OK – standard for the lower-cost establishments in the Hilton range. The high-point for us was that (unlike others at this end of the market) there was real (steel) cutlery and china plates, not plastic. There was an average cold buffet of cereals, juices, fruits and breads, plus the usual “egg-like” and “sausage-like” hot material. We ate at Zachary’s restaurant, in the lower lobby, once while we were there and found it to be quite agreeable. The reception staff were friendly and very helpful. There was adequate free Internet access that was rationed to half an hour/ticket (available from reception), though no-one seemed to mind if you took more than one ticket. The location of the hotel was good for us –a 20 minute walk to the harbour-front, Gas Town and China Town, and less than ten minutes to the restaurant strip in Yaletown and the Robson/Burrard shopping area. There's a skytrain station about 5 minutes walk away. There was a selection of decent takeaway joints on Robson within two blocks of the hotel, and a few bars within the same distance. There’s an excellent IGA Marketplace just three blocks away, and here you can buy almost every (food) thing your heart may desire. And if you can’t suppress the shopping urge, there are Sears and Hudson Bay shopatoriums within three blocks. The hotel runs a free shuttle that will take you most anywhere in downtown (the rule, apparently, is that it will not cross any bridge), including Stanley Park, West Vancouver and so on. For the downside – just one thing. We HATED and REJECT the Destination Marketing Fee (DMF) of 1.5% that’s added to the bill. Provincial sales tax and federal Goods and Services Tax are added to the DMF, so it ends up being significantly more than 1.5%. This bit of lunacy, according to the maniacs at the Vancouver Hotel Destination Association who designed it, is intended to pay for marketing the Vancouver hotels (you can see their laughable rationale at http://www.vanhda.ca/ ). We were at a loss to see why the hotels would expect us to pay for their marketing – one usually expects to see business overheads reflected in the room rate. Paying the DMF is not an option (as it is in Canadian Niagara Falls). You’re stuck with it. We will not stay in downtown Vancouver again while this “private tax” exists (we stayed there 3 times during our latest trip and didn’t think to ask what the DMF was until our final day). We’ll be in Canada again in May, but we will NOT stay in downtown Vancouver. Overall, The Hampton Inn is an excellent place to stay if you have some time in Vancouver and you can stand the rapacity of the Vancouver Hotel Destination Association.", "Date": "October 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bellingham, Washington", "Title": "“Great hotel in great location”", "Author": "cps102", "ReviewID": "UR21041799", "Content": "Stayed here for one night to go to the Vancouver Snow Show, and had a great time. The room was nicely appointed, and nice big windows with a downtown view. The rooftop gym/hot tub was great, with great big views of downtown and the surrounding hills. The gym also had ping pong, foosball, and a vending machine. The breakfast in the morning, although busy, was just adequate, with pastrys, yogurt, cereal, egg and ham patties, etc. The hotel had an excellent location, right next to BC Stadium, and walking distance to the False Creek Seawall (try Hurricane Grill for dinner...nice location on the seawall). Overall, if I had to stay in the Vancouver area, I wouldn't hesitate to go back here...that's how much I enjoyed it. Many activities in and around the hotel.", "Date": "October 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "chicago", "Title": "“Great Place to Stay”", "Author": "wetravelin", "ReviewID": "UR20766844", "Content": "We stayed here for two nights before our cruise. The Hotel is extremly clean the front desk personel wonderful and very helpful. They provided a shuttle for us to a restaurant and also the cruise ship. We all thought the breakfast was great. We loved the location everything was pretty accessible. This is a city so you need to be as careful here as any other city. I always felt safe and the upstairs was great had some beautiful views. Would stay again no questions about it.", "Date": "October 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "California USA", "Title": "“Great hotel stay”", "Author": "VisitorBob", "ReviewID": "UR20185733", "Content": "We enjoyed our one night stay at this hotel. We booked two rooms and each was very clean and included a microwave oven and small fridge. The services from the front desk were extremely helpful. The continental BF offered a variety of items and were a step above standard cont. BF offerings. The location was about five easily walked blocks from the central city offerings. Two of the members in our group were in their 80s and a taxi or hotel shuttle was available if it was neeeded. We would agree with other posters that the location was on the edge of the downtown area.The dinner at the next door restaurant was fine.", "Date": "September 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "5", "Location": "1"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Average hotel not centrally located”", "Author": "Swedish_Traveller", "ReviewID": "UR19807713", "Content": "We booked this hotel because of the good reviews on Tripadvisor. For us on a holiday from Europe it is very hard to understand why this hotel gets so excellent reviews. It is located close to BC Place Stadium but far away from the shops, restaurants and sights in central parts of downtown Vancouver. There is a lot of construction work going on around the area but also besides that this area was far from the Skytrain station and it wasnt always a pleasant walk to get down here from shops and restaurants downtown. The area feels a bit unsafe. The hotel in it self is modern but nothing special a standard average good quality hotel. The room was clean with a normal size and had a standard hotel design look. You get a free morning paper and free wireless internet in the rooms. The worst experience is the breakfast that was included. The service was horrible and the whole situation chaotic with people sitting and standing everywhere. There were too few tables and frequently they run out of food on the buffet specially they had problems with the hot food. There is a nice restaurant connected with the hotel where we had nice dinners that we can recommend. The hotel however is nothing we would recommend for tourists that plan to stay in Vancouver only a few days. Its better to pick a hotel closer to shops, sights and public transport.", "Date": "September 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Guadalajara, Mexico", "Title": "“excellent”", "Author": "MARILOI", "ReviewID": "UR19555770", "Content": "Excellent service, location, facilities, rate, and breakfast is included, couldnt been better", "Date": "August 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Exceptional service!”", "Author": "GatorsFan", "ReviewID": "UR19238271", "Content": "We arrived early after getting off a cruise. Our room was not quite ready, but the front desk staff made the large fitness area available for us to change. The front desk staff was extremely helpful, even booking us on a hop-on/hop-off bus tour at my request (The Big Red Bus -- don't waste your time and money). We left our bags at the front desk and these were waiting in our room at the end of the day. The suite was extremely clean and comfortable, as was the entire hotel. The front desk arranged a van-cab for us as well. We missed the breakfast, as we left at 5:00 a.m. to catch our flight. I'm sure it was typical Hampton Inn buffet, which usually offers a variety of choices, and, in expensive cities, it beats a $20 breakfast! Location -- at the quiet end of Robson Street, the heart of downtown. We were glad the hotel was not located in the busy section of Robson Street, as it would have been noisy. Great overall expereince!", "Date": "August 22, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Paris, France", "Title": "“Good quality hotel”", "Author": "French", "ReviewID": "UR19102492", "Content": "This hotel is a good quality one in downtown Vancouver. Comfortable rooms, acceptable breakfast (free of charge) and good service. Very useful garage. However no apparent sign of HH level recognition. No bath/shower gel provided: they had a bad quality product and decided to stop providing it! OK but they should provide another one... Quiet hotel: excellent for recovering from jet lag!", "Date": "August 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Minden", "Title": "“Great hotel, Great service”", "Author": "roadie4", "ReviewID": "UR18826673", "Content": "We stayed at the Hampton Inn for 4 nights in August. The hotel itself is located right beside BC place, so the east end of downtown. It's an unassuming building that is situated between Yaletown and Gastown, pretty much. The hotel rooms themselves are good, but seemingly a little dated. Didn't matter to us though. It was a solid room and had everything we needed. Beds are comfortable and it is quiet. The real feature of this hotel is the service. The front desk staff are all outstanding. They deal with so many people every day asking the same questions, and not only do they do it with a smile and are very pleasant to talk to, but they are very organized. Along with little tips and great suggestions that they have, there are also a set documents at the ready of the frequently asked questions (public transit routes and times, maps of the city). From the get-go, they went the extra mile on every request that we had, including organizing transportation to the airport at the ungodly hour of 4am. To a person visiting the city to see the city, this service made the hotel top notch. The breakfast is fine. Don't expect a grand buffet, however, there is the stuff you need to take on the day: Yogurt, cereal, toast, juice, pastries, sometimes sausage, sometimes pancakes. It's nothing special, but nothing bad either. Overall, it's a great place for people who wish to see the city and for families with kids. I would definately stay here again.", "Date": "August 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Barbados", "Title": "“Fabulous hotel”", "Author": "BarbadosMillie", "ReviewID": "UR18774463", "Content": "From the moment we checked in (on a very busy holiday weekend) we were impressed by the hotel staff. Without exception every member of staff was friendy, helpful and polite. They all smiled, spoke to you in the lifts and remembered details - how refreshing! The front desk staff were very professional and right on the ball. Concierge staff very helpful and advised on buses and attractions. We were given a lovely one bedroom suite on the 6th floor, bright modern, clean, airy and spacious. Small kitchenette contained everything needed for a basic meal. Great as we were travelling with 2 young children (5&7) The breakfast buffet although crowded, was very well staffed and stocked. Items were being replenished right up to the end of the service time and tables were being cleared efficiently. I wish every hotel ran a breakfast buffet like this - no waiting for orders or bills and a good basic selection of breakfast items. We ate one night in Zacharary's downstairs - a very average meal, but nice service. The parking was secure and reasonably priced, internet access fast and easy. The package that we had booked said that movies were included, so when we were charged for a movie I questioned this and it was immediately removed from our bill, although I was very politely told that pay movies were not included. We loved this Hampton Inn and will try to stay with this brand in the future.", "Date": "August 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Great Neck, New York", "Title": "“Fantastic!”", "Author": "isles_123", "ReviewID": "UR18456380", "Content": "I spent two pre-cruise nights at his hotel. We had one of our nicest hotel experiences at the Hampton Inn. We booked a King Suite which was very spacious and immaculate. We had a very late check-in after a long lfight and we were in the room within five minutes. Based on all the reviews I read here in making my decision to stay here, I realize there is little that I can add that has not already been mentioned about this location, so I will address just a few things that seem to keep coming up: Service: The front desk staff during out stay and the reservation staff I spoke with pre-stay were beyond helpful. These were some of the nicest people I have ever dealt with relating to a hotel stay. Everyone went above and beyond to give us information. Breakfast: It is not gourmet, but it is extremely generous considering it is free for ALL guests every day of the week. Most hotels that offer breakfast, even for their best customers, do not offer hot items. This, plus the standard pastries and all-day fresh coffee is a huge money saver. Location: This is a big city folks. There will be homeless people. Walk up a few blocks to the coveted \"heart of it all\" on Robson. There are homeless people there too. There is nothing unsafe about the location of the Hampton Inn. You are within walking distance to Yaletown, Chinatown, the main shopping district on Robson, GM Place and BC Place. We even walked up to the entrance of Stanley Park in less than 30 minutes. There is nothing unsafe about the area; it is just busy. Shuttle Service: Not only may you use the shuttle to get to the cruise pier (no return service) but, if available, the shuttle will take you whereever you want to go Downtown...FOR FREE. Please tip the driver, George; he is very helpful and works hard all day :) I would stay at the Hampton Inn Vancouver - Downtown again in a heartbeat.", "Date": "July 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Nice place”", "Author": "Dzonka", "ReviewID": "UR18083546", "Content": "This is an excellent hotel in an unfortuate position down in the center of Vancuover right beside the football stadium. When there are no games on, it is easy to walk to the center of everything, and the staff of th hotel are excellent at helping you to decide what to do. When the games are on..hmm!", "Date": "July 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "North Babylon, New York", "Title": "“Great Place to Stay”", "Author": "Yackswife", "ReviewID": "UR17670162", "Content": "We stayed only one night at the Hampton Inn before our Alaskan cruise and were more than satisfied. The staff was very helpful and the room was clean and comfortable. The breakfast was what we expected after reading reviews but we didn't have a problem with it. We walked around the area during the day and saw a lot of homeless people. I must say that I would not have been comfortable walking after dark. We had dinner at Zachary's, the restaurant adjacent to the lobby and that left something to be desired. They were definitely understaffed for the amount of people that were dining and had to turn people away. There appeared to be only two cooks who seemed to prepare one meal at a time, so if there were a number of people at one table, they didn't get their meals at the same time. I noticed one woman got her food about 20 minutes after everyone else. Some people got upset because of the long wait and walked out. This is definitely not a reflection on the Hampton Inn and I would definite recommend it to anyone.", "Date": "July 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Oxford", "Title": "“Our first trip to Canada”", "Author": "Beeemerr", "ReviewID": "UR17544817", "Content": "We went to Canada for the first time in June 08. Our first three nights were spent at the downtown Hampton Inn. It was an excellent experience. The staff were friendly and professional, the room spotless, breakfast very good. The biggest bonus was Zachary's restaurant onsite, which was so good we didn't bother to go out to eat at all. The hotel was happy to run us about in their van, and we couldn't have asked for anything more. Would definitely recommend this hotel.", "Date": "July 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "South Florida, Florida", "Title": "“Pre Cruise Destination”", "Author": "saxmanlee", "ReviewID": "UR17463320", "Content": "We stayed at this hotel before our Alaskan cruise. No problems at all. The location was not a problem if you can handle walking a few blocks up Robson Street to catch a local bus. The room was a bit small, the bed was a bit firm. Over all, my wife and I hardly stayed in the hotel as we were out and about exploring the Vancouver area. The staff was very friendly and helpful. The breakfast was par, but that is average for Hampton Inn. The internet connection was a bit slow. The room was kept very clean. I don't expect too much from a Hampton Inn, but I know they are usually very reliable. Indeed, this hotel delivered as expected. I read a few complaints about the nearby construction - yes, there is construction work nearby, but it wasn't a problem at night, to loose any sleep over. I also read a few complaints about the homeless nearby, again its a city, you have homeless people in every city. They were not a problem. Check out my rooftop photos from the hotel.", "Date": "July 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Mirfield, West Yorkshire", "Title": "“Excellent choice”", "Author": "Yetton", "ReviewID": "UR17407580", "Content": "As I always use Trip Advisor if I am prebooking I only choose hotels / B&B's that review well. Hence my my scores are usually high, suggesting that I am easliy satisfied. That is far from the truth as we like good quality and value for money and thankfully using TA we get that.. We had two nights at this hotel in early June and can see why it so highly rated by TA members. Nothing was too much trouble, check in was excellent, rooms/bathrooms on 4th floor were spacious, very clean, comfortable, welcoming bed linen and secure. Umbrellas were available to use. Breakfast was more than adequate, internet was easy and quick and the views from the 16th floor are stupendous. We ate dinner in the attached restaurant and had a very pleasant meal. I have no problems in recommending this hotel to anyone and will return if we visit Vancouver again.", "Date": "July 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“Nice Hotel”", "Author": "drewantha", "ReviewID": "UR16972805", "Content": "The hotel itself is a very nice property and the breakfast is the usually good Hampton fare. The only detractor which really wasn't that bad was the 3-4 block hike to get into the fun part of Robson Street. There is a lot of construction going on in the area so be prepard for a bit of noise during the week. Parking is good, under the hotel but they charge a bit for it. Overall, a good stay.", "Date": "June 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Nice hotel for the money”", "Author": "drbsfm", "ReviewID": "UR16778823", "Content": "Nice location at the end of Robson Street. Short walk to the stores, Gastown and Yaletown. Rooms are comforable and suprisingly quiet.", "Date": "June 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Maidstone, United Kingdom", "Title": "“Great Security”", "Author": "ps5108", "ReviewID": "UR16733383", "Content": "Stayed two nights here after a trip on The Rocky Mountaineer train from Banff to Vancouver. As part of the train trip, our bags were delivered straight to this hotel and we were taken there free of charge by coach from the station. The check in staff were polite and extemely helpful, a guy called 'Keith' in particular. On arrival, I said that I needed to use a computer to check in with BA 24 hours before my flight. Keith immediately explained to me how I could use the hotel's computer to check in, and print off our boarding passes. I then said that our flight did not leave until late evening on the day we were checking out. Before I could ask about it, Keith informed me we were welcome to leave our cases in the Reception office, that we could use the facilities on the 16th floor before leaving and they would call a cab for us when we asked. Absolutely superb ! On the day of our departure we were hot and tired after cycling round Stanley Park, then walking around Downtown Vancouver. We went up to the 16th floor to find showers, fresh towels and toiletries all free to use. The two nights we spent there were very comfortable, the room was spotlessly clean, well furnished and decorated. One aspect that impressed us was their security system. The swipe card you are given to enter your room is also required to activate the lift and the toilets on the ground floor can only be entered using this card as well. Thereby preventing non-residents from using them, or gaining access to the other floors.", "Date": "June 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Not you father's Hampton Inn..”", "Author": "IVegas", "ReviewID": "UR16657465", "Content": "Just came back on a 3 nights/4 days stay at the Hampton Inn on Robson after an Alaskan cruise. Cost about $10 (tip included) to hail cab from the Ballantyne Pier to the Hotel (about 10-15 minutes ride) which is at the East end of Robson. Location wise is not as centrally located as the Blue Horizon which was what I originally planned. Chose Hampton Inn instead because I am a long time HH Honor member and has plenty of points to get free nights except for a weekend night which the points cant be used. Anyway it cost $230 CAD for the entire stay. As for not as centrally located which really is not a problem for us. We've been to Vancouver multiple times and always look at downtown Vancouver like a San Francisco (walking town for us). We can walk from the east end to the west end (to the outskirt of Stanley Park) in half an hour - 45 minutes. Of course not counting time spent going in and out of all the wonderful shops on Robson. We've also walked to Yaletown by the False Creek in 15 minutes, same with going a little north to cover both Chinatown and Gastown. There is bicycle on loan that we took advantage of for 3 hours at a stretch. Recommendation is to get up early (to avoid crowds for both bicycle loan and breakfast bar, or free internet for that matter). We got up around 6:30am, no one at all at the second floor breakfast (which compared to the many other Hamptons that I've stayed in) that has much more extensive menu. Juice, milk, coffee, yogurt, all sorts of breads, pastries, croissant, fresh fruits as well as some eggs and meats. At 8am the doorman came and we checked out the bicycle/helmet and off we go. 3 hours are plenty of time to bike along the entire downtown shoreline including a visit inside the Stanley Park. Getting to Granville Island is convenient on the Aqua Bus. The pier is only about 10 minutes walk behind the BC Stadium. We stayed on the 12 floor, nice size corner room. There were construction around us (2010 Olympics has something to do with the boom in Vancouver) but no noise. Beds were comfortable. Room has the usual Hampton Inn amenities which included microwave, fridge, hairdryer, internet connection. This is not the usual Hampton Inn which stands 16 stories high (top floor is gym/spa/pool) which on the upside gives a great view at the roof top level on BC Place and part of the city. The downside is having only 2 elevators for the entire building make certain time of the day extremely slow service (avoid the usual check in/check out time, the lobby is not big). Staff however are always pleasant and remember your name from start to finish. Courteous and professional and offer help when needed. Hailed cab for us promptly at end of stay and cost $26 + tips to get to Vancouver International in about half hour.", "Date": "June 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Skeptical at first, then LOVED this hotel!”", "Author": "laleary", "ReviewID": "UR16444725", "Content": "At first, I was disappointed with the hotel and mad that I hadn't chosen to stay in the downtown Hiton (it had cheaper parking and felt that we would've gotten a King room there ...). We didn't get the King bed like we had requested and I was bummed by the location (at first) because there was construction going on and it didn't seem to be in a good location. Well ... my feelings changed the next morning. The breakfast was very good, considering it was free. Very few hot items, but a sausage patty and muffin later and I had a nice breakfast sandwich! It was a good assortment. The front desk clerks are VERY helpful and friendly. They were more than willing to help us plan our day, even printing information about bike rentals, complete with prices so we didn't have to make those phone calls! They offered to set up the shuttle to take us to a bike rental (which we didn't take because we wanted the freedom of having our car near when we were ready to leave). The next day, we debated if we should take the ferry into Victoria. They again were very helpful in the pros and cons of taking such a long time on a ferry and once again offered to help us with the arrangements. We chose to stay in the city and explore more of Vancouver itself. The hotel is walking distance way from SO MANY THINGS! We walked to Yaletown, Chinatown, Gastown, shops, etc. We walked to dinner everynight and felt pretty safe in doing so. (Just keep your eyes open and be aware!) We noticed the most amount of homeless/beggars around Chinatown, Gastown and the shops on Robson. The room was very nice, and the hot tub on the 15th floor was enjoyable at night (esp. after so much walking!) Complimentary water, small frig and microwave made bringing back leftovers easy and stress-free so we could continue to enjoy the awesome food we had. If you're curious, we found these places to have very tasty food ... Yaletown Brewery ($8.00 pizza on Sundays!) ... try the one with apple - it is really good! La Bodega (Tapas) Banana Leaf (Near Stanley park - by where we rented our bikes) Floata Chinese (Dim Sum) ... if you've never had Dim Sum, probably not the best place to start since we had NO CLUE what we were doing! We had great food, but couldn't understand half of what was being offered to us! After our stay was over, I realized why everyone else had reviewed the Hampton Inn so well - the location is prime, the people are top notch and the city is great! Enjoy!", "Date": "May 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Monterey", "Title": "“Nice room and hotel”", "Author": "HonuNole", "ReviewID": "UR15642209", "Content": "Nice clean room and good beds (not great) with great bathroom, TV, etc. Good staff, very good complimentary breakfast. Expensive parking in secure lot downstairs, restaurant on-site was ok, but service was non-existent, suggest going elsewhere, numerous choices nearby. Great location if going to stadium next door, otherwise a good distance from Stanley park, the aquarium and many other places. Need to get used to the many one-way streets in Vancouver, otherwise you could go around in circles for awhile.", "Date": "May 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "High Wycombe, United Kingdom", "Title": "“Great Hotel”", "Author": "Aged_Travellers", "ReviewID": "UR15514191", "Content": "We have just returned from a 5 night stay at this hotel and would like to recommend it to other travellers. The staff were friendly, extremely helpful and nothing was ever too much trouble for them. We felt we had very good value for money. The hotel is just few blocks away from the centre of Downtown. It looked to be fairly new, so all the decor was in good condition. There was a restaurant attached as well as a coffee bar and gift shop. Breakfast was provided with a varied spread daily. Coffee was available at all times. Our room was light and spacious with a very comfortable bed and pillows. Great views of the city were had from the top floor fitness centre.", "Date": "April 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Seattle", "Title": "“Great Stay!”", "Author": "FamilyGuySeattle", "ReviewID": "UR14885080", "Content": "We stayed at the Hampton Inn & Suites for two nights right after Christmas. Went to Vancouver to shop the Boxing Day / Week specials and enjoy the city. The hotel is located at the end of Robson Street, right across from the BC Place Stadium. As other reviewers have noted, there are a considerable number of homeless folks in the area, but the same can be said for just about ALL of downtown Vancouver. All od this said, I we were able to easily walk up Robson for shopping, just a block away to the beautiful Vancouver Library, and maybe 10 minutes to the heart of downtown and Canada Place, etc.. Check-in was quick and efficient, and like other reviewers have noted, extremely courtious. We were given a corner room on a higher floor (as requested) with two double beds. The room was clean and clean-smelling when we arived, and the bathroom was well stocked with towels, shampoo, etc.. Nice to have the small fridge and microwave in the room. The wireless high speed internet worked as promised, and was fast. Our room looked down onto Robson Street and to the West. Like I said earlier, the Vancouver Public Library is just up the street, as well as a Starbucks, several good restaurants and a nice grocery store - everything you might want is nearby. We liked the fact that the underground parking was secured (the gate was opened with your room key). The breakfast served each morning has a good selection of hot and cold items - but - the area in which it'[s served is without question too small for the size of the hotel. Each morning that we were there, the room was jammed full, with people standing around waiting for others to finish eating so that they too could sit down. Best to get there early and avoid the rush. The only other thing that was a problem during stay was that the second elevator in the building was \"out of order\". This left just one elevator working to service all guests, which at times caused a considerable wait. Can the hotel have this fixed? Overall, we enjoyed our stay, and would definitely book there again.", "Date": "April 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great accommodation, first class staff, didn't like location”", "Author": "miselemeas", "ReviewID": "UR13423796", "Content": "From the date of booking to our departure we were treated extremely courteously and efficiently by the staff who were first class. They couldn't have been more helpful, assisting with any queries regarding local facilities, restaurants, transport etc and I can honestly say that I have never met more professional staff in ANY hotel worldwide. We (family of four) stayed for four nights after an Alaskan cruise and chose this hotel because of its No 1 position on Tripadvisor. The accommodation was spotless, absolutely first class. They guarantee that all bedding, including duvets, are cleaned after every use. The bathroom was beautifully clean and we were provided with lovely toiletries. The breakfast was nothing to write home about, however, very basic and some items in short supply. The eating area was quite small for the number of people staying, which meant queuing as most people eat around the same time. However it's included in the price so you can take it or leave it. Don't miss the views from the roof. Its a lovely place to relax with a book if you have time to spare. There's a coin-operated washer and drier for guest use which is very convenient. We couldn't find a stairs on our floor and the elevator seemed to be the only way up or down, except for the fire exit. We didn't feel safe at night walking back to the hotel, due to the number of homeless people which seemed to be proportionately higher in that area than anywhere else. We were never hassled or approached by them but didn't feel comfortable walking at night, so we tended to take a taxi for even a short distance at night. Quite a lot of construction going on in the area. There are a couple of streets nearby which we were advised not to use - Hastings Street is one I remember. All in all a great hotel, with super accommodation and staff.", "Date": "February 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Billings, Montana", "Title": "“Excellent for the money!”", "Author": "loves_photos", "ReviewID": "UR12969458", "Content": "It was our first time to Vancouver, and we had no idea what to expect. The Hampton Inn is a really nice hotel with 16 floors. The gym is on the top floor, and has a fantastic view of the city. There is also a hot tub on the roof (indoors, but with glass walls, so you can view the city). The rooms are well done--modern, but very comfortable, and the beds are so comfortable!! There are newspapers available at the desk (5 or 6 different types). The breakfast is very good--cereals, Belgium waffles, sausage, fresh fruit, yogurt, donuts/muffins--all fresh. A nice feature is the underground parking that is accessible by using your room key. It is well lit and very safe, and the elevator in the garage goes directly to your floor. The elevators will only work if you use your card as well, so the security is very good. The staff was very helpful in directing us towards restaurants.", "Date": "January 24, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Western part", "Title": "“It is a good place to stay”", "Author": "guy_traveller", "ReviewID": "UR12905696", "Content": "I\"ve stayed in this hotel several times, and it has always been a pleasant experience. The rooms are well set up, and the hotel is well maintained. I like the fact that you can self park and don't have to use valet parking (which so many hotels insist upon). The internet works well, the beds are comfortable, and the bathrooms are nice. It would be nice if the hotel would go \"non smoking\" and I'm not a big fan of the Hampton Inn breakfasts....at the same time, it is a nice touch to be able to have a free breakfast. I will definitely be staying again.", "Date": "January 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, WA", "Title": "“Great hotel experience”", "Author": "TravelLib", "ReviewID": "UR11097071", "Content": "Spent a wonderful evening at the Hampton Inn & Suites in Vancouver. The location is south of the hustle and bustle, but everything that we wanted to do or see was a walkable distance. Great staff at checkin made us feel very welcome. We'd arrived by train and wanted to just leave a bag, but Staci was able to give us a terrific room on the spot. Corner room with jacuzzi, king bed, and windows all around. Very clean and very quiet! Although it was a chilly evening, we did enjoy the view from the rooftop common space. We'd go back in a heartbeat!", "Date": "November 27, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Good value, well situated hotel”", "Author": "UkReviewer2007", "ReviewID": "UR10792891", "Content": "We stayed at the Hampton Inn in August 2007 and found it to be a really well situated hotel, close to the science museum and the water, right at the bottom (or top!) of Robson Street. The breakfast (which was included in the room rate) was great, a good buffet selection hot and cold. The only down side was if you are in a room next to/close to the lift/elevator - and purely because of people chatting outside your door when waiting for the lift, the hotel staff weere great though when we asked to be moved, it wasn't too much trouble and was sorted out without fuss or hassle. In summary a really decent hotel.", "Date": "November 13, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Richmond, VA", "Title": "“Great Stay in Vancouver BC”", "Author": "ilsete", "ReviewID": "UR10500549", "Content": "Stayed here for three nights with my wife and had a very nice stay. Although this is not a full service hotel like a Hilton or a Marriott, it came pretty close to those brands in most areas. Hotel: Located near the BC Lions football stadium, this hotel is near shopping in an up-and-coming area just out of downtown. Some have noted that places near the hotel can be sketchy. I've been to Vancouver many times and think is and is not the case. If you're from a larger metro area, you'll likely think nothing of it. But, Vancouver is a port city and has some of those port city issues. One is an active drug trade and a lot of homeless drug abusers flock to the city (Canada has pretty limited enforcement). My wife and I were approached by a several homeless drug addicts during this last trip, one within 200 feet of the hotel door. But, the other was within a similar distance to the Four Seasons and the Fairmont so you'll likely get that kind of thing. Anyway, the hotel is nice, although oddly located in terms of accessing the lobby. It was clean, well maintained, and near everything. We used the hot tub (up on the top floor with a deck outside so you can enjoy the view) and the sauna (same location). Both were great; clean, comfortable, and largely ignored by other guests. They serve a free breakfast one flight up and connected to the lobby. Plenty of food: eggs, bacon, sausage, waffles, biscuits, bagels, pastries, fruits. Can be crowded though. All in all, a great addition to the stay. We didn't drive, so can't speak to parking. Its close enough to walk to many downtown locations, and relatively easy to catch a cab. Its not a full service hotel, so there wasn't a real taxi stand, but exiting from the lobby in to the drive we always found a cab there (although I think we waited about 2 minutes once. Room: We had a king non-smoking room. When we arrived, we needed to change our reservation but that was not an issue. The front desk clerk (1 of 2 on duty at the time) was considerate, knew his stuff, and made the change without issue. The room looked out on BC Place. Our second night there the hometeam CFL BC Lions won a game and the cheering spilled out on to the street for about 10 minutes shortly after 11PM. Not loud in the room though, and we thought it was cute that the CFL crowd was so quiet and went home so quickly (not like an NFL game to be sure!). The room had a small sofa, a desk and chair, and the bed. All nicely arranged and in good shape. The room was cleaned daily; adequate towels and supplies left. No complaints. All in all, a very good stay. I go to Vancouver often, and prefer to be near the water. If this isn't a must, or if you can't get a room waterfront in the summer, this is a great choice.", "Date": "November 1, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Tuusula, Finland", "Title": "“Nice Place”", "Author": "dadsasdasd", "ReviewID": "UR10114667", "Content": "Location could have perhaps been a bit more central for a hotel called “downtown”, but still only 10 min walk to the actual downtown, so no major complaints. Also a SkyTrain station a couple of minutes away. A number of options for eating and drinking close by in the neighborhood (e.g. a couple of grill bars, McDonalds, Starbucks, 7-Eleven etc). Very convenient location for GM Place, for watching Canucks for instance. Breakfast was probably the biggest flaw of the hotel, I certainly wasn’t excepting anything super-luxury like in some five-star Asian hotel, but still the outcome was a failure. Didn’t even bother to take the breakfast at all after two tries… Room was quite large, had two TVs (both traditional models), comfortable bed and a fully functional kitchen. View towards downtown, straight to big construction site next to the hotel. I guess the hotel was fully booked but still it was very very quiet, basically no noise whatsoever in the room. All in all, generally a better hotel than the “corresponding Hilton brand hotel” in Seattle (Homewood Suites) that I was in two weeks earlier. Would I return there? Yes, for sure.", "Date": "October 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Cairns, Queensland", "Title": "“Great stay in Vancouver, very friendly staff”", "Author": "wemarriedinvegas", "ReviewID": "UR10072374", "Content": "We stayed here because of previous reviews and requested this hotel through our travel agent. We stayed for 3 night but due to Princess Cruises being hopeless, we arrived at 1am. Even arriving at this time the front desk clerk was friendly and willing to give us all the details and more you would expect when checking in. He was even nice enough to remind us of a wake up call should we need it since we had arrived so late and were frazzled after a day of constant disappointment. This hotel is a bit away from the action on Robson Street, but my wife and I found it no problem to walk there even though it maybe a bit much for some (around 3 kilometres, says Google Maps). We also walked to and from Stanley Park which was around the same distance. Breakfast was complimentary and excellent. A great way to start each morning, fresh fruit, coffee (strong, mild, decaf), pastries, hot food, yoghurt. It had something for every taste, if not, you are just too fussy!!! Cab from the airport was $25 plus tip. Well worth it, great place to rest your head and in Vancouver during cruise season was competitively priced. Has a fitness centre with table tennis, sauna, air hockey, hot tub.", "Date": "October 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Jose, Calif.", "Title": "“Great Place”", "Author": "mgsinger", "ReviewID": "UR10035320", "Content": "We really enjoyed our stay at the Hampton. Excellent location. We walked to most places and when we took the car we had easy access to all of the bridges and Highway 1. The staff were very helpful, even printed driving directions for us. There is a sanwich shop on one corner of the building and it has really good sandwiches and soups. Very friendly mom and pop kind of place.", "Date": "October 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Ontario", "Title": "“Hampton very good for our purposes”", "Author": "Marilyn42", "ReviewID": "UR10000282", "Content": "Stayed at the Hampton for 3 nights - Sept. 14-17 at the end of a 12 day western Canada trip. We were concerned about the location (being on the east side of Vancouver and not downtown) as we returned our rental car, but that was not a problem. Very nice hotel, front desk personnel very helpful. I loved the rooms with the floor to ceiling windows making the room very bright during the day. They have fridge, coffee maker and microwave. It is hard to find accommodation in Vancouver that has smoking rooms, but the Hampton allocate the 4th floor for smokers. We were walking distance to the boat to Granville Island, a casino, a few blocks from Yaletown and a little further to the Tower in Downtown. We planned on taking the Hop on Hop Off Bus, but had covered all we wanted to see except Stanley Park, so decided to just take a taxi as it was a cloudy day. One way fare was around $10.00 - cheaper than paying $33.00 pp for the bus. Plenty of restaurants in the Yaletown district, but can be confusing, even when reading the menus posted outside. We ate across the road from the Hampton - at Players Chophouse -the last night and it was excellent! Service and food were excellent. They were very busy at first, serving the guests going to the Keith Urban concert, but once they cleared out, we were given their undivided attention. We enjoyed not being right downtown in \"the thick of things\" and found this hotel to be excellent. Take advantage of their hot continental breakfast! Be sure to visit the top floor with the whirlpool and gym, if only to take pictures of the surrounding area.", "Date": "September 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ireland", "Title": "“Nice Hotel”", "Author": "Ann_Ireland", "ReviewID": "UR8699064", "Content": "This is a lovely hotel in Vancouver. The rooms were lovely and the public areas are very nice. Our room was large with 2 double beds with a fridge and a micro wave. Bottled water was left in the room every day too which is a nice touch. The complimentary breakfast every morning was great with a large selection. There is a small shop along with a restaurant in the hotel. The restaurant closed at 9pm which is a bit early but there are plenty of places to eat around. The hotel is right across the road from the BC Stadium. The is a fitness room with a sauna and jacuzzi on the top floor which was nice but there was never enough towels. The only fault that I can find with this hotel is that it is about 3 or 4 blocks too far down on Robson, I'm not sure I would feel safe walking around on my own. Overall this is a great hotel and I would definitely recommend this hotel. The staff were very friendly.", "Date": "September 12, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Good Downtown Hotel”", "Author": "mmuggeri", "ReviewID": "UR8675491", "Content": "We have had 3 good days here in Vancouver. Room very comfortable. Location right at the Bottom of Robson St, quite a bit of building work in neighbourhood (all over Vancouver). The rate I got was quite good for a downtow hotel, and the free BFast helps with the costs. Breakfast typical of free Buffet in this Hotel chain but very adequate. Staff very helpful and provided us with free shuttle to local location.", "Date": "September 8, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "scotland", "Title": "“Reasonable value for money”", "Author": "true bleu", "ReviewID": "UR8522691", "Content": "Location near a run down area .A lot of building work all over central Vancouver. Two bed suite however was of good standard.Clean and comfortable Breakfast was very limited with not enough tables for customers Reception staff very friendly and provided lots of worthwhile info on Vancouver. Lots to see in Vancouver and surrounding areas", "Date": "August 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Buncrana, Ireland", "Title": "“Best hotel in vancouver..”", "Author": "BALLYBAY", "ReviewID": "UR8518985", "Content": "Great location/breakfast/room/staff. The way all hotel should be.", "Date": "August 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Canton, MI", "Title": "“Great value, but beware of BC Place noisy events.”", "Author": "Benzy2", "ReviewID": "UR8518430", "Content": "Chose this hotel because of it's favorable reviews on TripAdvisor. Was not disappointed until the last night of a 3 night stay. We needed to be up early and were unable to sleep due to heavy, pulsing music and bass coming from BC Place. It did not stop until 2:30am and was loud enough for us to make out some of the lyrics. Our room was on the 15th floor (facing BC Place) which had been great for reduction of street noise, but was no match for the \"concert\" coming through the closed windows. For value, safety, and location, I will definately stay here again, but I will be checking BC's event schedule to determine whether to ask for a room on the \"other\" side of the hotel. Our traveling companions had a room on that other side and weren't able to hear any of what we complained about.", "Date": "August 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Calgary, Canada", "Title": "“Most comfortable bed yet”", "Author": "Adele02", "ReviewID": "UR8439901", "Content": "Stayed at Hampton Suites for 2 nights at an exorbitant price due to busy long weekend and being unable to find a more moderately priced hotel for 2 nights. It was a very pleasant stay with helpful staff (although they omitted to tell us about the shuttle bus and the fact that there is a booking system to use it). The beds and pillows were the most comfortable we've encountered in any hotel. The breakfast is good although we are horrified at the carbon footprint of Hampton Inns due to their use of syrofoam plates, bowls and cups and plastic cutlery. After a simple breakfast the mound of non-recyclable and non-decomposing garbage is dreadful. It also lowers the standard of an otherwise higher end hotel. The location is a little further away from English Bay and Stanley Park than we'd have liked but if you're unencumbered by young children it is a good walk. No view of the ocean from this hotel either and our room overlooked the rooftops. All in all we really enjoyed staying at the Hampton Suites but would have enjoyed it more if it hadn't cost so much.", "Date": "August 16, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Good Value Hotel”", "Author": "MrsSpen", "ReviewID": "UR8372489", "Content": "Location: Convenient for Downtown (5 - 10 mins) and Yaletown (5 mins - check out the Blue Water restaurant for an excellent meal), close to the Sky Train Terminal and about a 30 minute walk from Stanley Park. The hotel is right next to the BC Stadium, so really easy if you're going to see a BC Lions game. Rooms: Spacious and airy room and good bathroom with bath and overhead shower. The nightlight in the bathroom was a nice touch. It was great to have a fridge tea/coffee making facilities and a microwave. The room was very clean when we arrived and on the second day of our stay; however on our third day it wasn't cleaned or made up, which was a shame as we'd been out for a long day and just wanted to relax when we got in. Breakfast: It's great that this is complimentary and although the breakfast room was busy we always managed to find a table. The selection of cereals and hot food wasn't huge, but we always managed to find something we liked. The one criticism is that for a hotel that in other areas wanted to convey how environmentally friendly it is, it uses polystyrene plates and cups. Service Mixed impressions here - at check in the receptionist was friendly and helpful, but for the rest of the time we didn't get the service we were expecting after reading previous reviews. Nothing serious, just unfriendly, unhelpful staff and a mistake by reception with regard to the taxi to the airport (which they didn't really apologise for). Hopefully the people who served us were just having off-days (it sounds like it since the other reviews have been so glowing). Overall A good value hotel in a convenient location, slightly let down by the service received. I would stay here again, but if it was a special occasion I would probably go for one of the more upmarket hotels.", "Date": "August 8, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Utah", "Title": "“Great Pre-Cruise Stay”", "Author": "Jazz77", "ReviewID": "UR8275271", "Content": "We stayed here one night prior to our Alaskan cruise. we took limojet gold from the airport to the hotel and that was great! The Room: We booked a corner, two bed on the top floor and that was superb with fantastic views. The only problem we had was the toilet clogged but nothing big there. Beds were the best hotel beds we slept on ever. Very Very Clean! The Hotel/Breakfast/Facilities The hotel is nice with a cool lobby. the rooftop hot tub/spa we never used, but our kids used the ping pong and fooseball and that kept them entertained. The Elevator on the cruise day (saturday) took at least 5 minutes to get to our floor because of the demand to leave the hotel. The elevator requires key card to use which is good 4 security. The staff is great and very nice and can recommendend great places to eat. Breakfast is better than expected and is good being that it is free. The Cruise shuttle. The hotel offers a free shuttle to the cruise pier and that is great. They take reservations for the shuttle starting at 7 am the day of. IF YOU WANT TO TAKE THE SHUTTLE, BE AT THE FRONT DESK, WAITING IN LINE NO LATER THAN 6:50 OR THE TIMES AVALIABLE ARE AFTER 2. The hotel only has one van, and they should buy more, but still one free one is good. We got stuck with the shuttle time at 2:30 p.m when we wanted earlier. we arrived at the pier 2:45 and there was NO LINES at all. TAKE MY ADVICE, BOOK A SHUTTLE AFTER 2 pm FOR BETTER PIER EXPERIENCE. BUY THEN SHIP CABINS WERE READY. The van driver's name is George and he is the coolest.", "Date": "August 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "NY", "Title": "“Nice, but not #1”", "Author": "2teenmom", "ReviewID": "UR8267895", "Content": "Sorry to disagree with all the glowing reviews, but we had one serious reservation about the Hampton Inn Downtown -- its location. As we drove to the hotel, we noticed dozens of homeless congregating on the streets adjacent to the hotel. The fact that the parking lot had double electronic gates to protect guests strenghtened our feeling that the area was not safe or pleasant, and made us uncomfortable. Also, the view was disappointing -- buildings and rooftops. The elevators are indeed slow, and there is a crush at the breakfast buffet. On the positive side, the room itself was fine, the beds were comfortable (though the pillows were not), and the breakfast was a real bonus. The staff was lovely and helpful. In summary, the hotel was OK, but not what I expected based on TA reviews.", "Date": "July 31, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aptos, California", "Title": "“Highly Recommend the Hampton Inn & Suites!”", "Author": "MarshaMello", "ReviewID": "UR8267371", "Content": "My husband, myself and our two teenage sons stayed at the Hampton Inn & Suites for three nights during a pre-Alaska-cruise visit to Vancouver. We couldn't have been more pleased with the hotel staff (who were very friendly and helpful), our room (which was immaculate and spacious) and the location (across the street from BC Place, and within easy walking distance of the Seabus terminal, the Robson St. shopping district, Yaletown and Gastown). As noted by other reviewers, the hotel offers free high speed internet, as well as bikes for exploring the area via its extensive and scenic bike paths. (Normally the \"rental\" period is two hours, but because no one was waiting for our bikes, we were able to keep them the entire afternoon, and thoroughly enjoyed cruising Stanley Park's seawall.) Booking the free shuttle to the cruise ship terminal on Saturday was not a problem; the hotel even allowed a late checkout so that we wouldn't arrive at Ballantyne too early in the day. My one minor complaint would be the quality of the hot breakfast items, which left something to be desired, but other options (cereals, oatmeal, pastries, fresh fruits, yogurt, etc.) were plentiful, so it wasn't really a problem. During our stay, I must have repeated \"I LOVE this hotel!\" on at least a twice-daily basis to my family. You can't go wrong with the Hampton Inn & Suites!", "Date": "July 31, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Chattanooga", "Title": "“Loved this hotel!”", "Author": "ChattanoogaMcmom", "ReviewID": "UR8224794", "Content": "After a week's cruise in Alaska, this hotel was the icing on the cake! The front desk staff was helpful in every way...from directing us to good restaurants and areas in the city to making sure our every need was met. The rooms are spacious and clean, and the beds were wonderful. We liked having a small refrigerator, microwave, and sink in the \"kitchen\" part of the room, and appreciated the daily complimentary bottles of water. Although we rented a car for the 3 days we were there, the hotel is withing walking distance to many areas of downtown Vancouver. We felt safe (though we saw several panhandlers and vagrants many places in the area), and the hotel is very secure (both in their parking garage and in getting to our floor in the hotel). The continental breakfast was above average, and although there was only one computer with internet access (for a nominal charge), it was easy to use. We have already recommended this hotel to a family member who will be visiting Vancouver soon. It was great!", "Date": "July 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Richmond, VA", "Title": "“Excellent value, great service”", "Author": "injungun", "ReviewID": "UR8052338", "Content": "I decided to stay here after seeing the other reviews and I was extremely happy with the stay. My family and I traveled around BC in the last week of June 2007. Though we stayed in more expensive places during our trip, all of us enjoyed our stay at the Hampton Inn. The place was neat and well maintained. The location was good, and the internet connection speed was good as well. The free breakfast provided came with lots of options. To top it all, the front desk personnel were always help providing great service. I would definitely recommend this place.", "Date": "July 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "MA", "Title": "“Just right for overnite”", "Author": "krish2", "ReviewID": "UR8023677", "Content": "We enjoyed our overnite stay at the Hampton Inn before our cruise. Our room was clean and reasonably priced. The beds were extremely comfortable. The view from the top floor was fabulous. The elevator took some getting used to, a little slow. The breakfast buffet was very good. It was convenient to several stores and restaurants. I would definitely stay here again.", "Date": "June 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Newcastle, UK", "Title": "“Great base for downtown Vancouver, and beyond”", "Author": "BWUK", "ReviewID": "UR7971113", "Content": "We stayed in a king suite to start a special holiday in Western Canada. The hotel is nicely presented, with a modern lobby and nice restaurant. The hotel is very close to the harbour and downtown. Ten mins walk to downtown, maybe a half-hour to the harbour. A ten minute taxi ride takes you to Kits beach, Granville Island or Stanley park. The staff are wonderful people, who seem to take a genuine pleasure in helping each guest. We spoke to many reception and waiting staff throughout, who all took the time to get to know us personally. While we were there the staff managed an early morning fire alam very professionally and cheerfully. The room itself was nice, very bright with large windows. The suite consisted of two rooms, including kitchenette and bathroom adjoining the bedroom. Whilst the rooms were pleasant, they weren't amazing. I'm not sure the upgrade to king suite was particularly worth it - but certainly nice all the same. Breakfast was good, and free! A nice selection, but overcrowded at busy times. The friendly staff and good value mean I'd love to visit Vancouver, and this hotel again.", "Date": "June 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "The Netherlands", "Title": "“Good value for money”", "Author": "FMLW", "ReviewID": "UR7960199", "Content": "We stayed here after our airline caused us to miss our cruise ship. We were depressed when we got to the Hampton but the staff there were very sympathetic and extremely helpful. The room was great, the breakfast was very nice, certainly enough to eat, and the staff unfailingly courteous and helpful. Mark the Bellman is a font of local information, he can help you with anything. The free shuttle to places like Stanley Park (you have to come back on your own) is also quite welcome. The rest of downtown is a brisk walk away. This will be our number one hotel in Vancouver for future visits.", "Date": "June 22, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "McFarland, Wisconsin", "Title": "“Well run hotel”", "Author": "Wisconsin84", "ReviewID": "UR7870953", "Content": "Front desk manager is focused on customer service. Enjoyed the roof top pool and spa. Easy walk to the harbor (about 1/2 hr) Found the breakfast quite extensive. Will stay here again@", "Date": "June 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Georgia", "Title": "“Loved the free breakfast! Big money saver”", "Author": "BaileyBlossom", "ReviewID": "UR7853442", "Content": "We stayed in Vancouver for two nights and found the Hampton Inn Suites clean and convenient. We enjoyed the extra room that the pull out sofa provided. Stuck the two kids there, while we luxuriated in their king size bed. Extremely comfy. The sleeper sofa was a queen, so there was plently of room for both kids, although once they laid on our bed, they did not want to sleep there particularly. The staff was excellent. Breakfast was plentiful. Safe underground parking.", "Date": "June 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“number 1 for a reason”", "Author": "kiwitravellers07", "ReviewID": "UR7796941", "Content": "we stayed here for 3 nights end of April prior to moving to the Sandman 1 block away to join a tour. we had travelled for 19 hours from NZ via LAX and encountered unfriendly and rude customs agents at both LAX and Vancouver, the taxi driver who drove us from the airport was also not friendly and we were by then very tired and wondering why we had come so far for a holiday when the people were so unfriendly, and then we got to the Hampton Inn and were checked in by Stacey, what can we say, one person managed to turn how we were feeling completely around, she was so friendly, bubbly and helpful, we ran into her a few more times during the time we were there and every time she remembered us and asked if we had done activities that we had mentioned we might do etc. The rest of the staff we saw around the place were always smiling and appeared to enjoy working there. as for the hotel itself, the rooms were bright, light and very clean, the complimentary bottles of water in the fridge were also appreciated. breakfast is included and is above the lobby on a mezzanine level, there is a good selection (cererals, toast, bagels, pastries etc plus a couple of hot dishes) along with juices, coffees. the view from the top floor of the city lights is great also, i didnt use the laundry area but it looked very clean and the machines looked new. location wise was also good, we had no problems finding our way around the city and walked everywhere, the only downside to vancouver is the number of homeless people everywhere, something we are not accustomed to seeing, but we just ignored those who approached us and felt safe enough. I would have no hesitation in recommending the hampton inn, and given the opportunity would stay there again.", "Date": "June 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Walking On The Moon”", "Author": "johnnyjumpstart", "ReviewID": "UR7731433", "Content": "Stayed here for three nights beginning May 27, 2007. I was in town to see the POLICE in concert & wanted a hotel from which I could just walk to the GM Place venue. This was the PERFECT location just across the street. Hotel is definitely 3 stars, maybe more. Rooms are large with wonderful beds. Hotel serves a wonderful breakast in a lovely breakfast area with multiple papers available in the morning to take for free. The Hotel is within walking distance of a local riverfront casino & also the main shopping area of vancouver. Very quiet rooms, Very Clean. Paid $179/night for sat, sun & mon nights. I'd stay here again without hesitation. It's about a 6-7 minute cab ride from the cruiseship terminal too.", "Date": "June 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edmonton, Alberta", "Title": "“The reviews are all true...great hotel!”", "Author": "danoilers", "ReviewID": "UR7592870", "Content": "First of all, the location is first class. If you're going to GM Place or BC Place Stadium, you're literally a 2 minute walk away. The hotel is also located directly on Robson street so you're a 2 minute walk away from Vancouver's equivalent of Rodeo Drive. For those locations that might take a 10 or 15 minute walk like the Granville Island autobus or Stanley Park, the hotel provides a complimentary shuttle...it goes anywhere downtown. Oh, and the hotel also provides complimentary bike rentals; riding the oceanside bike path's are a must! The hotel itself is wonderful...the rooms, the staff, everything! The rooms are spacious and come with everything you could possibly need (including enough pillows for about 8 people). Wireless internet is included with each room. The room service is reasonably priced, has a good selection and arrives promptly. The breakfast is a very high-end continental. Lots of choices from cereals to pastries to fruits to yogurts to waffles...on and on. You can also get a 'breakfast to go' bag if you're in a hurry in the morning with some fruit, a muffin and a bottle of water. Great idea. Every single staff member I encountered was extremely friendly and in a number of cases they went out of their way to accomodate me. There's also a very convenient web check-in kiosk for the airlines located in the lobby. If you have the chance to stay at this hotel, don't pass it up. It's a steal of a deal at the price.", "Date": "May 13, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Bristol", "Title": "“we loved this hotel”", "Author": "sleepyh", "ReviewID": "UR7570726", "Content": "We stayed here for 2 nights on our 2 month round the world honeymoon - we loved it. We got a taxi from the airport which was better than 2 bus journeys (especially with all our bags!) and it was only about $30. The staff in the hotel were excellent, especially Candice who tried her best to get us some ice hockey tickets. Room was very large with lots of nice touches, umbrella, scales, yellow pages. The gym & spa looked great but a bit too high & close to the window for my vertigoed husband We bought new ski/ snowboard gear while we were in Vancouver - all the shops are located slightly out of town around 4th avenue, about 30min walk from our hotel (we got some serious bargains in the sales!) We didn't get hockey tickets in the end so went to sharks sports bar & had a great night", "Date": "May 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Wonderful gem, just on the edge of everything”", "Author": "klever-weis", "ReviewID": "UR7567561", "Content": "I have been staying at the Hampton Inn on Robson almost every time I come up to Vancouver. The location is execellent - a few blocks from the shopping on Robson, the restaurants of Yaletown, right next to BC Place. The staff is great, the rooms are spacious and have nice views. The complementary breakfast is fantastic. The gym, while small, has the best views of any hotel gym in the city. The restaurant and cafe are also great.", "Date": "May 8, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“Almost perfect”", "Author": "MK1England", "ReviewID": "UR7486023", "Content": "I stayed here with my family on vacation. We requested and got rooms opposite each other. Check in staff were really friendly and helpful. We were really impressed with one of the breakfast room staff who remembered where we said we'd be visiting and then asked how we'd enjoyed it a day or so later. The only downside was that on occasion there were more people wanting breakfast than there were available seats and tables. The hotel is well positioned at the end of Robson with central Vancouver within walking distant. Rooms are large and well appointed. Will definitely book here again if we return to Vancouver.", "Date": "April 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Linn, Oregon", "Title": "“Excellent Lodging Option in Vancouver, BC”", "Author": "West_Linn_Travelers", "ReviewID": "UR7474792", "Content": "The Hampton Inn & Suites in Downtown Vancouver is unlike any Hampton you're likely to stay at in the US. The property is a 16-story hotel well-located in the central core. I had made my reservation on hilton.com, and paid about C$160/night for a two-room suite on the 15th floor. I stayed for two nights as partof a business trip to Vancouver. Arrival and check-in took perhaps two minutes; the desk agent was friendly and made sure I had my internet access code and a quick run down of the hotel's major services and ammenities. Guests must use their room keys to operate the elevators, a nice security feature. My room was a two-room setup, with a living/room kitchen area with electric range, microwave, and full-size fridge. The living room area has a queen-size sofa bed, a large TV with remote, and a cordless phone. The bedroom had a king-bed with an assortment of pillows (soft/hard), another TV with remote, and a small but adequate work desk with phone and high-speed internet connection (internet is free). The suite was spotless; bedding was crisp and clean. The bathroom was large and well stocked with linens. The bedroom and living room each featured their own HVAC controls, while the bedroom/bath area also featured a control that allows you to control the humidity in the room. I generally do not sleep well in hotels, but at this Hampton I enjoyed a restful, quiet, and altogether enjoyable sleep both nights. The complimentary breakfast is served in a small area that overlooks the small main lobby area. A nice selection of cold and hot items was available. The service and eating areas were extremely clean and well-serviced. All of hotel staff members I met during my stay were friendly and eager to answer questions or offer personal help. An additional complementary service offered by the hotel in the morning is its shuttle service. I used the shuttle to travel from the hotel to the downgtown location where I had meetings scheduled. Not only did I save the cost of a cab, but the driver took the time to point out a number of features of interest. I am a Hilton Diamond HHonors member and over the past 20 years I have stayed at properties from every member of the Hilton family in locations around the world. I can honestly say that the Hampton Downtown Vancouver exceeded my expectations in all respects, whether as to comfort, amenities, value for the rate paid, etc. Whether on business or for a personal/vacation visit, I strongly recommend this property as an option for a stay in Vancouver.", "Date": "April 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Loved my stay”", "Author": "lovesports", "ReviewID": "UR7394098", "Content": "I just stayed there two weeks ago. It was hard not to like this hotel. First, the location is great. You can easily walk to General Motors place for hockey and shopping is also walkable on the same street you're on: Robson. The gym has great views of the city, a weight bench, treadmills, a sauna, ping-pong table and a hot tub. Apples are left there and there are two TVs. The only thing missing was free weights. The breakfast is incredible and included free with your stay. There are cereals, muffins, oatmeal, fruits, tons of beverages and several newspapers you can have. As for parking, it's self-parking, which is better than valet for sure. Also, the lot was safe and you need key access to get in there. It's $16 Canadian daily for the parking, which is very reasonable. The staff was extremely freindly. The room was very nice with a chair and scale in the bathroom. A great experience.", "Date": "April 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hinckley, Leicestershire", "Title": "“Great value”", "Author": "DavidHinckley", "ReviewID": "UR7365483", "Content": "For me and my family this hotel is excellent and every other hotel should try and live up to this standard - if they can. All the staff were really helpful and not just the reception staff but also the cleaners and breakfast staff. The rooms were of a high standard of cleanliness and everything worked. They were also brilliant for a tourist as there was a microwave and lots of other useful equipment. There was also available on the top floor gym equipment, table tennis table and a hot tub. Also nearby were washing machines and driers. For me the best thing was the breakfast, it was excellent, as much food as you could eat. The fresh fruit salad made a great start to the day. What made it particularly good was the price, it really was good value. As someone who has visited many hotels around the world, the package offered here is the best you will ever find. Ps The restaurants in Yaletown are a bit expensive, ask at the reception and they will tell you of others just as close and better value.", "Date": "April 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Arizona", "Title": "“Enjoyed the Hampton”", "Author": "WandererAZ", "ReviewID": "UR7219001", "Content": "Just returned from Canada. My sister and I spent four nights at this hotel. Room was clean and spacious, contained small refrigerator and microwave plus complimentary coffee/tea. Staff very courteous and accommodating. Breakfasts, which are included, were convenient and hardy, always a hot choice, eggs and sausage one day, waffles and ham the next. Coffee available throughout the day. Location close to transit but also within walking distance to some tourist attractions.", "Date": "March 25, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria, BC", "Title": "“Spa on the 16th”", "Author": "mermaido", "ReviewID": "UR7012476", "Content": "Stayed with my husband and took advantage of the Romance in the City package. We were very satisfied with the room and package there was only 2 things we were unhappy about. 1st was the fact our in room safe was broken. The hotel staff was very friendly about it and sent someone to fix it but it did not get fix. We were offered to put valuables in the hotel safe instead. The other thing we were unhappy about was the restaurant Zachery's. The food was not that great. We ordered the seafood chowder and it was good but me and my husband ordered steaks and mine though I asked for medium cam out well and was burnt and instead of a server asking near beinginng of the meal if the food was ok only noticed at the end that I was not eating my dinner and only after I reapeated to my husband several times that I was not going to eat it did the server offered to discount the bill. Service in the restaurant needs to be much better. But what we really like about the hotel was the hot tub and game room on the 16th floor. It was very romantic on top of the building. We would defintaly go back to this Hotel", "Date": "March 11, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Southampton", "Title": "“Doesn't quite live up to the hype”", "Author": "ajrduff", "ReviewID": "UR6940275", "Content": "My fiance and I stayed here for two nights (4-6 March 2007) and although I would recommend the Hampton overall, it is let down by a couple of silly details. The staff are friendly, our room (a King Suite) was big, clean and comfortable and the hotel's location was convenient for us, with plenty of restaurants within easy walking distance. At C$322 for two nights including tax I can't argue with the price, either. Although the room is superbly equipped with tea, coffee, a coffee maker, electric scales, a safe and even an umbrella, there's no kettle. A strange omission - and the staff didn't seem to think it odd that teabags are provided, but without any means of making tea! But my biggest complaint concerns the breakfast. The food itself is good and the coffee is excellent - but I was horrified to find polystyrene plates, plastic cutlery and paper cups. This is just not good enough, and sours an otherwise good service. It would be unacceptable in a cheap motel, let alone in a big downtown hotel. I for one would be happy to pay an extra $5 a night for proper cutlery and crockery - and I can't believe that the energy required to wash it outweighs the environmental cost of landfilling thousands of polystyrene plates a week. Having said that, it is good value. Excellent in some ways, poor in others. Young couples would love it, my parents would hate it.", "Date": "March 9, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Abbotsford, BC, Canada", "Title": "“Not impressed...Sour Experience”", "Author": "CanadianTravellers18", "ReviewID": "UR6751677", "Content": "We stayed at the Hampton Inn because of the location and previous positive experiences at other locations. However, we were constantly faced with challenges throughout our one-night stay. We purchased the Romance Package with included sparkling apple cider, $30 gift voucher to the restaurant on-site, and late check out (2pm). When we got to our room, we got sparkling water instead of cider (which my husband hates...so that was pretty useless), then called down to the restaurant for dinner and were told we could not use the voucher because they were busy...what kind of a reason is that, especially since no such condition was published anywhere!? The next day when we went to use it for lunch, and they were closed! Granted, the hotel refunded us the $30, but we had looked forward to a convenient location to eat. After that, we received a phone call at 11am asking us to check out. We had to inform them that we had a late check out. In the meantime, after we got back from lunch they erased our key card, so we had to go back down to the lobby to get a new one. Normally, this wouldn't be a big deal, but honestly, their elevators are the SLOWEST elevators we've ever experienced, and you're not permitted to use the stairs. That being said, the rooms are clean, and the location is great if you're going to BC or GM Place for a concert or game.", "Date": "February 6, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "New York, NY", "Title": "“Its a Hampton Inn”", "Author": "Mike_the_traveller", "ReviewID": "UR6534756", "Content": "The title says it all. You get what you pay for. Its a Hampton Inn, the prices are fair, the accomadation is clean, bed is clean, bathroom is clean, and furniture and decor are Hampton inn style. The location is right next to the BC Stadium, which means far away from everything else except the BC Stadium. It is at the very end of Robson St, about 1 mile walk from the main shopping district of town. I'm also a Hilton Honor Gold VIP and did not receive my upgrades, water, complimentary snack, or anything. If you are use to Westin, Sheraton, or Hyatt, this is NOT it or comparable. The amenties are not comparable and the location so-so. But if you are on a budget, this is the right place for you. Clean, cheap, and safe.", "Date": "January 1, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Loved breakfast, good wheelchair access”", "Author": "Melissa M", "ReviewID": "UR6527836", "Content": "My partner and I stayed here for six nights in May 2006. I'm a wheelchair user and chose the hotel based on price, complimentary continental breakfast, location, excellent detailed information on their website regarding wheelchair accessibility and the ability to check accessible room availability and book such rooms directly online. Other (especially Australian) hotels take note - the ability to check availability of accessible rooms and book these directly via hotel online booking systems is a real selling point for me, and probably other wheelchair users. It saves a lot of time and effort, and says a lot about a property's willingness to treat wheelchair users as real customers. The hotel facilities did not disappoint at all. The room accessibility was good (no roll-in shower though), fantastically comfortable bed (for which we were very grateful after *long* flights from Australia) and a kitchenette with sink, microwave and plates, glasses and cutlery. Accessible train transport was an easy two blocks away. The location for us was a minor disappointment. Although the hotel is located in Robson Street, there were not many restaurants or cafes in the immediate vicinity, although there is an onsite restaurant. Room service hours were limited too. Nevertheless, complimentary continental breakfasts and coffee in the lobby made up for this minor disappointment, and as mentioned above, transport was a breeze. Given the length of our stay, we really appreciated also the hotel's laundry for guests and its panoramic views of Vancouver from the top floor. Overall, a great experience and a hotel recommended for a Vancouver stay.", "Date": "December 31, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Seattle", "Title": "“Enjoyed hotel but far from shopping/dining on Robson”", "Author": "jdrblue", "ReviewID": "UR6518075", "Content": "My family of three (2 adults, 1 six yr old) stayed here Dec 27-29. The room was comfortable--down comforters, choice of soft/firm pillows, bottled water, clean bathrooms, free internet connection, free decent breakfast and secure ($14/day) parking. Be sure to ask for a room away from the elevators (noisy guests) and a city view--we had an up-close view of the stadium. I suppose we could have requested a different room but it was not a big deal. The only major drawback of this hotel is the location. It is at the very end of Robson Street, where there is no activity taking place except for a few homeless people mulling about. That made things a little sketchy at night. The hotel does everything to make you feel secure as you need your key card for practically everything. Still,we walked to Robson in the morning but took cabs back in the evening. The main shopping and dining areas are too far to walk roundtrip in the winter with a child. Perhaps ok for a couple. Nevertheless, it might make sense to stay in this comfortable hotel and save money, and then spend $5-7 dollars (one way) on a taxi for transportation to Robson. Good location if you have a car and want to visit Granville, Space Center, Vancouver Aquarium. (Side note: Driving around Vancouver is like driving around NYC.)", "Date": "December 29, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Vancouver, BC, Canada", "Title": "“Amazing value!”", "Author": "rocks009", "ReviewID": "UR6510738", "Content": "We chose this hotel for 2 reasons: in-room hot tubs and the great reviews on TripAdvisor. Although I was doubtful that a 3 star hotel could really be superior to other fancy 5 star hotels in town, it was the only hotel we could find with in-room jacuzzis. We loved the place! Our room was a Deluxe King Jacuzzi room located on a corner with full windows looking out over BC Place and the Cambie St Bridge. It was a very nice room, with an extremely comfy bed and nice fittings. The jacuzzi was fantastic and a great size for two. We payed for a Romance package (C$199) for one night, which included a box of chocolates, some non-alcoholic sparkling cider, a $30 voucher for dinner in the hotel's restaurant, and most importantly a 2pm check-out. At a premium over the standard room rate of $159, the package may not be worth the extra cost. With so many amazing restaurants nearby in Yaletown, the hotel restaurant is an unappealing option and we didn't use the voucher (although it might be able to be used for breakfast?). The chocolates were tasty, but the 2pm checkout was excellent and almost made the package deal worthwhile on its own. The standard room rates all seem to include a continental buffet breakfast: standard fare with juices, coffee, pastries, cereals, fruit, yogurt, but with bonus scrambled eggs and breakfast sausage patties. Nothing fancy and a bit wasteful with disposable plates and cutlery. This place definitely deserves its #1 popularity rating on Trip Advisor. Although it is down at the quiet end of Robson Street, it is only a short (4 blocks) walk from all the superb nightlife, restaurants, cafes and shops in Yaletown. The money you save on the room can easily be spent on a high class night out.", "Date": "December 28, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Portland, OR", "Title": "“Good Value, Good for Stadium Events”", "Author": "Kahbah", "ReviewID": "UR6477188", "Content": "I took my husband to the Avs/Canucks game for a birthday weekend in Vancouver. This hotel couldn't have been located better - the walk to and from GM Place took 5 minutes. Additionally, we did a little shopping on Robson Street, which was only a few blocks away. The location was great - it was downtown, but it was really quick to get out of downtown too. It's true the hotel is not immediately surrounded by lots of pretty buildings, but it was hard to beat the view once you got up to your room. I booked a Jacuzzi suite which was clean and beautiful. We had a corner room, so we had views of two directions as both outside walls were nothing but windows. The king bed had nice linens, though we found it a bit hard for our tastes (we like really soft beds, though). Housekeeping left us alone to sleep in and just relax in our larger-than-average room. We enjoyed the jacuzzi, which was roomy enough for tall (6'5\") folks, though the jets were really loud (not uncommon). There is a lack of breakfast places nearby, so we ate a late breakfast in the restaurant and were immediately taken care of and served a good meal. Was it the best hotel room I've stayed in? No. Was it a better-than-average room, for a good value in a downtown location in an increasingly expensive city? Yes. If you are expecting boutique, original design or to bathe in luxury, forget it - this is not Hilton's luxury chain. But it's a better-than-average chain hotel (with free WiFi, no less) and sometimes that's just fine. Oh, I forgot to mention the free bottled water, replaced daily. I can't recall the last time I stayed in a hotel outside of Mexico (and often one much more luxurious), and wasn't charged some ridiculous rate for water. I realize it's just water, but when you get to your room after dinner or a few drinks, it's nice to have a free bottle there.", "Date": "December 20, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Atherton, California", "Title": "“This cannot be the top rated hotel in Vancouver!!!”", "Author": "juju1967", "ReviewID": "UR6433460", "Content": "I booked a three night stay at the Hampton Inn in Vancouver at the end of November based on the incredible reviews from Tripadvisor.com. The Hampton Inn is a nice budget hotel. The location is NOT fabulous in my opinion. It is at the very end of Robson Street and not really next to anything other than the Stadium (which is directly across the street.) Really I was depressed when my taxi pulled up to it. On my flight I met a woman who works for the Tourism Department in Vancouver. She was stunned that Tripadvisor had rated Hamton Inn as the # 1 hotel in Vancouver and EMBARASSED!! Certainly you can walk to shops and restaurants from the hotel-but nothing cute or charming is within eyesight. The Opus Hotel (which ranks # 5 by Tripadvisor.com) by comparison is in a cool, unique neighborhood surrounded by great restaurants and shops. However, the Opus Hotel is directly next to a large and noisy construction project. The beds were very comfortable at the Hampton Inn and we had no complaints in that department. The breakfasts were not great nor was the staff very friendly. Vancouver is a beautiful city that is very unique. The Hampton Inn is great if you are on a budget, however has a very motelish feeling to it. This is not a hotel I would reccommend to someone other than for price as it is cheap. It is definitely not upscale or luxurious and frankly neither are the clientele!", "Date": "December 12, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "washington", "Title": "“Fantastic Staff”", "Author": "ralph55", "ReviewID": "UR6163202", "Content": "This hotel is on a very popular street with restaurants and boutiques. The hotel staff was very helpful helping us to get places using their shuttle or taxis or explaining the sky tram. They made us feel quite at home. The room was very clean and comfortable with down comforters. A bonus was the complementary buffet style breakfast, not just the usual toast and oatmeal. The aquarium is great with families as is Stanley Park. We checked out the huge 500 store mall, but one store started to look like all the others and the only main restaurant was TGI Fridays. Our biggest regret was being across the street from the hockey stadium and not taking in a game. Lots of opportunities for $40 seats.", "Date": "November 22, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Essex", "Title": "“Great Value”", "Author": "Bfords", "ReviewID": "UR6110464", "Content": "We recently stayed here on holiday with our two young children. The hotel is in a good location, approx 8min walk from all the main attractions and shopping on Robson street. The hotel offers excellent value for money, so good we checked with the reception as we could not believe how cheap it was! The room was cleaned to a really high standard and the beds really comfy, the room was situated on the 14th floor and we had views of the BC place (football/event stadium). There was a football match on that night and music could be heard but this all finished at around 22.00. The breakfast was really very good and included in the price of the room, the choice changed daily. The jacuzzi on the 16th floor had really good views of the city, the fitness and sauna area was clean and well equipped. Reception offered a free courtesy bus ride anywhere in downtown, we went to the aquarium, not to be missed!!", "Date": "November 12, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“The Hampton Inn Rocks! Everything was excellent-The room & The STAFF!”", "Author": "Whooligan", "ReviewID": "UR6056629", "Content": "This hotel is worthy of all of the praise. We had a large group of Who-> Fans book this hotel based on the reviews here. Three of us shared a huge suite, one bedroom-two qn beds with a sitting room & kitchen. The location is esp excellent for events at BC Place & GM Place. Easy walking distance for many of the downtown tourist sites. The rooftop spa and workout room were great. The breakfast was substantial, including eggs. On top of it all the staff were wonderfully helpful with every need. All 12 of us a had a great experience.", "Date": "November 4, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai", "Title": "“Fantastic Service!”", "Author": "akwablu", "ReviewID": "UR6023962", "Content": "We stayed at the Hampton Inn & Suites for 3 nights and we have to say that the service was exceptional. The staff went out of their way to make sure we were comfortable and that all was well with our room. They were sold out of non-smoking rooms but quickly accomodated us to one as soon as it was available. Their breakfast was good and they had good Wi-Fi service available with access codes for us to use. The room was clean and had a great view of Robson street. The staff recommended the best tours of Vancouver and the tour guide was very friendly and humorous and had an opinion on everything which made for a great 4 hours of sightseeing. They even recommended places that we could take our kids to which would make their visit to Vancouver just as memorable. Exceptional hotel, fantastic price!", "Date": "October 29, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Overall Best Quality-great long term stay”", "Author": "flyin321", "ReviewID": "UR6020022", "Content": "We brought in group of 20+ people for filming in the city, all checking in different dates and time, and the front desk handled everyone's check-in smoothly and with NO MISTAKE! Even Smoking/Non Smoking request and credit card authorization was taken care of prior to our arrival. With my experience with other high-ranking hotels, this was never done so well before! Great Job Hampton VAC! We were all satisfied with service, room, breakfast, amenities, etc. Most of us stayed in this hotel for about 3 weeks, and everyone felt like home coming back every night. Room amenities are well thought of. Each rooms were equipped with frig, microwave, free bottles of water, umbrella for rainy day outing, and a scale to keep us in shape! Not to forget free high speed internet everywhere in the premise. Lovely experience here. We'd love to be back!", "Date": "October 28, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "san francisco", "Title": "“Great Value!”", "Author": "rosrey", "ReviewID": "UR6002085", "Content": "Besides the facilities and location, I look for overall value when booking a hotel and The Hampton Inn exceeded all my expectations. We slept very well for 4 nights: the black out curtains were very effective, the mattress was firm, the bedsheets were soft and the down comforter with the white coverlett was cloudy soft goodness. Overall, the complimentary continental breakfast was very good and I was particularly happy with the quality of the fresh fruit and coffee. There were also some other thoughtful complimentary amenities such as a two hour bike rental, gym with jacuzzi and sauna, bottled water, in room safe and in room high speed internet. However, there's a fee for the underground gated parking which came to about US $14/day. Since it's located at the end of Robson street (close to the library and BC place stadium) it's about a 10 min walk to Yaletown and the center of downtown. Although it's not a shi-shi 5 star hotel, I appreciate the non-shi-shi prices and I doubt I could have been more comfortable. Thanks Tripadvisor! Tip: the highlight of our trip was the bike ride around Stanley Park and the amazing food scene (for the foodies out there you have got to try La Bodega for some excellent Spanish tapas!)", "Date": "October 23, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Abbotsford, BC", "Title": "“Loved It!”", "Author": "stasho1", "ReviewID": "UR5901884", "Content": "Great stay!! Excellent attentive staff who came to our rescue twice in 15 minutes. Once the bathroom light was flickering and neede changing and the TV wouldn't change channels. Both times we got fast friendly service. As always at the Hampton Inn, the bed was amazing, the room was clean and the breakfast perfect.", "Date": "October 3, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chester", "Title": "“A great base for visiting Vancouver”", "Author": "champagne traveller", "ReviewID": "UR5831319", "Content": "Located in the heart of the downtown distrct, the Hampton Inn and Suites is a 1st class base when visiting Vancouver. We stayed in a 1 bedroom suite for 3 nights in July and although we booked for room only, the first pleasant surprise was the complimentary breakfast. Add to this the free cycle hire, free shuttle bus (which you can book to take you anywhere you want to go in the city, whenever it's available) and amazingly firendly and helpful staff, you can easily see that we couldn't recommend this hotel any higher. The large top floor (indoor) hot tub with views of Vancouver was a welcome place to chill after a long day's sightseeing! Don't go anywhere else - you really don't have to.", "Date": "September 24, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "TORONTO", "Title": "“Starting off on the right foot...”", "Author": "SOFTWARECONSULTANT", "ReviewID": "UR5813420", "Content": "I stayed at this hotel on the first night based on all the great reviews on Tripadvisor. The reviews were accurate, this hotel was fabulous. Can't say enough about their front desk service, very helpful and pleasant. The pillows was best among the hotels we stayed during our trip. Complimentary hot & cold breakfast was added bonus. The location was alright, lower end of Robson street, which presented less traffic. Overall, the stay was excellent.", "Date": "September 18, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "silver spring", "Title": "“Excellent Hotel !!Lots to Do in Vancouver”", "Author": "steadyhand98", "ReviewID": "UR5761176", "Content": "I am sure you can stay in a fancier place but this hotel lives up to its rave reviews ..Excellent staff ..great modern clean rooms and a convenient location..Nice roof top patio with minimal gym, ping pong table, washer dryer..No need for a car..Free bikes provided for 2 hours(reserve them early) so you can take a beautful bike ride along the water to can't miss Stanley park.. A day trip to Grouse mountain is a must do if you like spectacular views and there is a nice restaurant at the top of the mountain overlooking the city...We skipped the hokey log rolling show they do there but young kids seemed to enjoy it..There is a great observation deck not too far from the Hampden Hotel located in another hotel called Harbor Place..The restaraunt isn't that great so just do the obervation deck (about $11 each I think..) Night views are spectacular...\"Canada Place\" is another interesting area and is where the cruise ships dock along with the seaplanes..They have a world class hotel there you can walkaround with places to eat and an Imax...Try the \"Boathouse \" outdoor deck for lunch near the entrance to Stanley Park..Decent food and good waterviews..Use your ATM card to get money instead of exchanging money at the airport..The $200 I took out in Canadian money ended up being somewhere around $175 American money with a $1.75 ATM fee..Save your receipts for everything ..Some taxes are refundable..Bring a light jacket and or sweater and rain gear although it was perfect when we were there in mid August", "Date": "September 1, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Singapore", "Title": "“Fantastic”", "Author": "miltonmao", "ReviewID": "UR5702034", "Content": "My wife and I travel extensively usually staying at 4 to 5 star hotels.I'm hard to please but we were very happy here, everything was new and clean,the staff were courteous andefficient.The breakfast wasn't elaborate but very satisfying.Free wifi in the lobby and I loved the breakfast bags to go at the front desk.My only minor gripe is the room we had was next to the elevator,and we were disturbed by guests speaking loudly while waiting for the lifts.Perhaps a sign near the lift could help?I would definitely stay here again.", "Date": "August 23, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Highly Recommend The Hampton”", "Author": "Toopsie", "ReviewID": "UR5624081", "Content": "My husband and I spent last weekend at the Hampton and couldn't have been happier. On Friday night, our plane landed at 11:30, so by the time we got through customs, collected our bags and took a taxi to the hotel, it was after one in the morning. The staff was wonderful; polite, helpful and totally welcoming which surprised me, considering the hour. When we got up to our room, we saw the lights had been left on for us. It was a nice touch. The room itself was honestly the cleanest hotel room we've ever been in. This is extremely high praise, since I'm notoriously picky about cleanliness. (You could say I'm anal-retentive but I prefer to say I have high standards.) Even the toiletries in the bathroom and the condiments by the coffee maker were laid out in perfectly neat rows. I thought I'd died and gone to neat-freak heaven. The bed was wonderful, with a fluffy down comforter, soft cotton sheets and a mattress so nice, my husband woke up the next morning without the backache he usually gets when we travel. In the morning, we used the workout room on the top floor of the hotel. Again, it was perfectly clean and boasted a fabulous view of the city. After running on the treadmills, we stretched out on the large, wrap-around deck area. With the beautiful view and the cool breeze, it was the perfect way to end our run. On our way out of the workout room, we noticed a large basket full of fresh apples (we each grabbed one and they were delicious) and stacks of cups next to the water fountain. For me, that kind of thoughtfulness and attention to detail sums up the Hampton. We normally would never stay in anything below a four star hotel. Originally, we were going to stay at the Opus, which I'm sure is a fine hotel but before we booked anything, we consulted the reviews on this site. After reading the overwhelmingly positive comments, we thought we'd take a chance. We were not disappointed.", "Date": "August 18, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chino Hills Ca", "Title": "“love the Hampton inn & suite”", "Author": "melofun", "ReviewID": "UR5613661", "Content": "We are a party of 7 all adult, we like the hotel and the people at the hotel, they always ready to help. we have two suite, one next to the other one, all our requirement were meet. We request the two suite been closed also we want a roller bed in one of the suite, and when we arrived the roller bed where there. Also the people on the reception were very nice and always help with map and directions. The hotel is very closed to downtown, plus they have a shuttle, the one we used twice, the bed was very confortable and the breakfast very good and was included. If we come back to Vancouver we will go to Hampton inn & suite, Eden was our cleaning lady, she was very nice, even she have to be nervious about her wedding, she always meet all our requirement, specially we need a small pillow, and she bring to us. Thank you to everybody at hampton Inn Mercedes Cabrera Chino Hills Ca", "Date": "August 15, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Perth, Australia", "Title": "“Loved the Hampton”", "Author": "Aussie08", "ReviewID": "UR5602095", "Content": "We stayed at theHampton Inn for three nights in early July. Firstly the staff are EXCELLENT. Nothing is too much trouble. From checkin to check out they were very efficient and helpful. The continental breakfast is one of the best we encountered in the entire five weeks of our vacation. There is a guest laundry. We had free self park on the premises in a locked underground garage. The beds are extremly comfortable the rooms well appointed with fridge and safe. We chose to walk downtown and it was only about four blocks to the main part of downtown. We would defintiely return to the Hampton.", "Date": "August 12, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Excellent choice”", "Author": "rightboy", "ReviewID": "UR5593508", "Content": "We stayed at the Hampton Inn and Suites post Alaska cruise and found the hotel to be well maintained, efficiently run and a good choice to make in Vancouver. The hotel is at the end of Robson Street and is about a 6 block walk to the shopping district. Yaletown is about 4 blocks away and is also an easy walk. The bed is our room was heavenly -- very comfortable and apparently new. The rooms are very good size with all the regular Hampton Inn features. The lobby of the hotel is minimal and the breakfast area appears to be somewhat small and crowded for the size of the property. There are also only two elevators for this 16 story hotel, so waits can be lengthy. This is the first Hampton that we have experienced that did not provide free internet service on the hotel lobby computer. There is a $4.00 per 20 minute fee charged for their computer, but no charge for the wireless service if you have your own. Vancouver is a city of contrasts -- beautiful scenery, great shopping and restaurants and many wonderful things to see and do. With that said, Vancouver has a more visable homeless population than almost any city we have visited. We were approached many times during our walks by people asking for handouts. It's so sad to see so many people sleeping on sidewalks and lining up for handouts. One needs to be careful where one walks, both day and night, in this city. The Hampton Inn is a good choice to make, at a reasonable cost, while visiting Vancouver.", "Date": "August 10, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Virginia", "Title": "“Great location, pleasant stay”", "Author": "flyqueen", "ReviewID": "UR5536364", "Content": "My husband and I recently stayed at the Hampton during a vacation to Vancouver and Victoria. We returned to the hotel after a brief stay in Victoria, so we had the chance to sample the deluxe king room with jacuzzi during the first part of our visit and the standard room with double beds upon our return. We both agreed that the standard room was superior given the view and the sense that the room was larger. The beds were very comfy, the rooms and hotel were clean and bright, and the location of the hotel was perfectly nestled near trendy Yaletown, where there are many fine restaurants and boutiques. The continental breakfast was a nice perk, with coffee, eggs, sausage, fruit, and various pastries. There is a fee to use the one computer at the hotel, and don't count on the free shuttle service because every time we requested to use it, we were told they were booked up. Apparently, several hotels use that one shuttle, so you will need to book it well in advance. This is not a fancy hotel, but a great one for the cost, location, and overall service. We absolutely loved Vancouver! It's a modern, lively, and fun city. And the people are so friendly!", "Date": "August 1, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Toronto, Canada", "Title": "“Fantastic hotel for Vancouver”", "Author": "SLin96", "ReviewID": "UR5499637", "Content": "We absolutely loved this hotel. It was more than we expected. I had booked on the basis of the great reviews on tripadvisor and everything they say is true...we were able to check in early (I realize that not everyone will be able to) and the reception was cheerful and helpful...she even told us if we were hurried we could still catch breakfast! Excellent continental breakfast - a couple hot items such as scrambled eggs, sausages...all kinds of cereals, wide variety of baked goods, free papers at the breakfast area, room clean and very inviting...a wonderful hotel....free shuttle to the cruise terminal (have to book), great location near downtown...can't say enough about the friendliness of this place.", "Date": "July 23, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "London, UK", "Title": "“Go for it!”", "Author": "Jimforever", "ReviewID": "UR5468038", "Content": "This hotel is such a breath of fresh air. It's not grand luxury, but very comfortable and attention has been paid to every detail from the night light in the bathroom to the choice of pillows. Excellent free breakfast too. Only minor quibbles would be the limited choice of TV channels and the lack of internet facilities for anyone who's not wireless. Would definitely go back.", "Date": "July 15, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Manchester,UK", "Title": "“A little bit of luxury”", "Author": "A TripAdvisor Member", "ReviewID": "UR5357262", "Content": "Decided to stay at Hampton Inn after reading 20+ recommendations on Trip Advisor and was not disappointed. AFter spending 1 week in Whistler mountain biking we wanted our 2nd week in Vancouver to be relaxing. What swung it for us was the fact we could have a kitchen and living area so could save a little money if we needed to by cooking in and have more room to chill out in then a standard hotel room. We opted for the 1 bed king suite which was booked through the hotel website - this seemed to offer the same rates as any of the online agents. The room itself was spotlessly clean with an enormous and the most comforable bed we have ever slept in. If you can remember to take your laptop as you get free internet access in your rooms. I can not praise enough the housekeeping staff, we left written requests in the room for extra complimentaty items such as bottled water and tea and this was always noted, also our first day we realised that our floor (10th) was not serviced till quite late on in the day but after talking with the housekeeper they moved us to a time that suited us better for the rest of our stay. The only downsides to the hotel were; check in staff not overly friendly and do not volunteer inforamation i.e. there is a complimnetary shuttle bus which takes you downtown but this is not in the hotel guide book in your room and check in did not mention it; breakfast is served daily between 6 and 10 am but there is limited seating so ask check in when the best time to go or if you have a suite take the food back to your room and cook it there; the hotel is at the very end of RObson Street, so ladies take your trainers - I didn't wear heals once!!! If I can I would also like to recommed the Vancouver Whale Watch Company- we booked a day out with them and arranged for the pick up facility - we happened to be in Zone One which is right opposite the hotels front door which made a fantastic day out even better : ) All in all a great end to our first visit to Canada.", "Date": "June 18, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Atlanta", "Title": "“This one will exceed your expectations”", "Author": "jcniii", "ReviewID": "UR5351897", "Content": "While not in the center of Vancouver this hotel is great...especially the staff. I've never stayed anywhere(and god knows I have) where the staff were more helpful and knowledgeable. Rooms and bathroom are niced sized and have A/C and of course heat. The hotel is at the very end of Robson near the Vancouver Stadium but catching cabs and transportation are easy. Their shuttle will even take you to most places for free!!! Beware of Zachary's the bar/restaurant in the hotel..a few drinks will run you broke as I discovered...$7-$8can per drink can add up fast and food is mediocre at best. Overall this is one of the best hotel's Ive stayed in for the money...but if there on Saturday morning everyone and their brother is there to catch a cruise to Alaska so be aware that you might have to wait awhile for the elevator.", "Date": "June 15, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Diego", "Title": "“A good choice”", "Author": "Sooz2", "ReviewID": "UR5348997", "Content": "I'm glad we stayed at the Hampton for 4 nights, and the things that really matter to us were good: very comfortable beds, very quiet, very clean, and everything in good condition ... things like that. It's actually an amazingly good location, although not perfect. The breakfast offered the BEST fresh fruit of our trip although not much else that we are crazy about, but NICE. The little things that are not special are the very modest lobby, the usual Hampton Inn plastic cups... As someone else mentioned, it's within walking distance of \"Yaletown\" and wonderful restaurants. We thoroughly enjoyed \"The Cactus Club.\" We would definitely pick this hotel again, unless something even better opens up!", "Date": "June 14, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Perfect for US!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5315855", "Content": "Spent one night prior to cruise. Deluxe room with Jacuzzi was exactly what we needed after flying, very comfortable corner room and the bed was PERFECT. Staff couldn't be nicer, complimentary shuttle was an added bonus. Only downside would be the area, would not want to walk around at night, however had no problems doing so during the day. Would definately stay here again.", "Date": "June 6, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "California", "Title": "“Happy with Hampton”", "Author": "Cruzer2", "ReviewID": "UR5233048", "Content": "We stayed post-cruise for two nights in a king bed jacuzzi tub corner room (eighth floor). Strong Points: Bed was outstanding with quality duvet/linens. Very comfortable and clean. Room was extremely clean and well-maintained Very quiet, even though it was a full house Good view - not fantastic Ideal for stadium visits and cruise port Reasonable location if you enjoy walking Full buffet breakfast Small gym on the rooftop terrace - about three pieces of equipment Jacuzzi tub was large, mmaculate, and totally functional Free shuttle to downtown areas Weaker Points: Not as centrally located as I'd originally thought, but not enough to be a deterrent to staying here again - plus, they have a shuttle Lobby and overall look of hotel is so-so, but you aren't staying in the lobby Breakfast was a zoo...too small of an eating area Crowded and noisy in public areas The steakhouse directly across the street was fantastic and reasonable (for nice dining). Best sweet and sour chicken anyone of us (group of four) had ever had was at Mitzi's in Chinatown. We went back again, and ordered more dishes - delicious Chinese food. There was a cafe on the corner in Gastown called Waterside, or something like that - also excellent. The food is super in this city. People are friendly and helpful. There is a lot of panhandling and drug addiction, however. Talked to locals about this at length. Try a double-decker hop on and off bus to get a good overall sightseeing tour. The pick-up spot is around the corner from the hotel. We would stay here again.", "Date": "May 29, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "USA", "Title": "“Miles above the typical Hampton”", "Author": "Trav0042", "ReviewID": "UR5229822", "Content": "This is not your typical Hampton Inn. The front desk staff was knowledgable, and they spent about half the time helping guests with directions & recommendations. At breakfast, they offered no fewer than 3 daily newspapers, which was quite unexpected. An AMAZING view from the rooftop health club (the health club was on par with the average Marriott) with rooftop patio seating. There was an onsite laundry also on the top floor. VERY comfortable beds. The hotel even has an onsite restaurant (above average food with below average service). It is located quite a ways from Stanley Park, but they offer a shuttle and city buses are convenient.", "Date": "May 28, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Manchester, UK", "Title": "“not as good as I'd hoped”", "Author": "CatherineRice", "ReviewID": "UR5221995", "Content": "The disappointing thing about this hotel was the fact that I was so led by the rave reviews on this site that I cancelled my reservation with the Granville Island Hotel & booked this one, which was more expensive and not as nice a location. It was an ok hotel, but nothing amazing. The room was nice but the view looked out onto a car park, and the sauna was out of order. The breakfasts were exactly the same every day of the week apart from one, and the hotel is 5 minutes walk near a really run-down part of town, although this can be easily avoided & you wouldn't know unless you were to venture into this area as there are no panhandlers around the hotel area. However, it was near Yaletown which has some great restaurants. The hotel also provide a really useful shuttlebus which is a great service. The beds were extremely comfortable & the maid service was excellent. The check in service wasn't great as the man on reception kept answering the phone whilst he was dealing with us, something I would have got into big trouble in my time when I was a hotel receptionist, but i guess they were extremely busy & he probably had no choice. I was also disappointed that days after I'd booked the hotel I found that they were running a cheaper rate for the same room. I would recommend it for a shorter stay, and also it would be very good value for families, but I guess I was just so disappointed it didn't live up to all the claims on the website and wished I'd never read them & had stuck with my previous booking, as this was supposed to be the trip of a lifetime and I ended up with a view of a parking lot.", "Date": "May 26, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Corinth, TX", "Title": "“Decent place for pre-cruise hotel”", "Author": "sagacioustraveler", "ReviewID": "UR5225225", "Content": "We chose the Hampton Inn based on other reviews and price for a downtown Vancouver hotel for the night prior to our cruise. Room was good sized with mircrowave, sink, dishes, corkscrew (!) wine glasses, etc. Bed comfy. Nice amenities. Quiet. They didn't give us a requested higher floor so view from our 6th floor was minimal. Regardless, they have a lovely rooftop terrace (and jacquzzi) where we brought up a bottle of wine and enjoyed what views they did have to offer. Not exacly in a bustling part of town (which made location quieter)yet it was walking distance from the Marina and Gastown. And yes, careful of where you walk after dark - neighborhood can get dicey. This is, I'm sure, why you need a room key to operate the elevator. Breakfast area was cheerful, food was adequate and maybe a step above most continential breakfast stations. They offer a complimentary shuttle service around the area, including the cruise ship terminal at Canada Place. (Definitely a perc.) Reservations for the shuttle service is first come, first serve. We called promptly at 7:00 am and had no problem getting the shuttle for the time we wanted. If you want a more centrally located hotel you might be disappointed. On the other hand, with all the major pre-Olympics construction going on next to the more pricey hotels the Hampton may be your quieter choice unless you're booking it on a night an event is going on at the arena across the street.", "Date": "May 25, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Manchester", "Title": "“It's ok”", "Author": "Wood71", "ReviewID": "UR5187920", "Content": "Stayed here for 10 days and although the hotel is fine I think a lot of the reviews on here are over the top. Breakfast is ok but nothing amazing! Rooms are tidy but bland Lacks a decent hotel bar Very near the dodgy end of town Good service from front desk", "Date": "May 22, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Portsmouth, UK", "Title": "“Fantastic hotel at a great price”", "Author": "Ninajay", "ReviewID": "UR5021254", "Content": "We stayed here for nearly three weeks, in a standard room for 2 weeks and a king suite for one week. The rooms were thoroughly cleaned every day, staff were cheerful and extermely helpful. We were getting married during our stay the staff couldn't have been more lovely. Friends and family were staying at the Wall Sheraton and Sutton Place and our standard room had more room and was brighter than either of theirs. The sky train station and bus stop were close by if the 10 minute walk up to Burrad/Roson was too far. The babystitting service recommended to us by the staff were brilliant. All in all we would definitely go back to this hotel on our next trip to Vancouver.", "Date": "April 30, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "LA", "Title": "“I love the Hampton Inn”", "Author": "LuvSLO", "ReviewID": "UR4941330", "Content": "I will forever be a fan of the Hampton Inn and Suites after staying at the Vancouver location. After 6 days in Whistler, we concluded our honeymoon with a short stay in Vancouver (awesome city by the way). The Hampton Inn exceeded my expectations 100 fold. We stayed in a King Bed 1 Bedroom Suite. We found an inexpensive fare on Travelocity and paid CAD 130 per night....a PHENOMENAL deal for a hotel of these standards. First, the room was clean, cozy and had a kitchenette, which I wasn't expecting (I thought it would have a microwave and that's all). It even had a scale and free internet if you brought a computer. Second, the front desk staff was absolutley awesome...very helpful and eager to help with anything. There was even a free shuttle that drove us around town and saved us a bundle on taxi fares. The shuttle took us to and from the Aquarium (which was very cool) and to Chinatown and the ferry boats to get to Granville Island. The complimentary breakfast is 100% phenomenal. It had everything you could want (within reason of course), was very clean and tidy. I think the location was pretty convenient as well. I wish we had more time in the beautiful city of Vancouver and in the comforts of the Hampton Inn because we loved every minute of our stay. Enjoy...definitely stay here if you are going to Vancouver....best value in the city by far!!!!", "Date": "April 6, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "tacoma", "Title": "“It's great - honest”", "Author": "heather_nun_ya", "ReviewID": "UR4588861", "Content": "I have to admit - I almost changed our reservations to a trendier hotel in Yaletown that was almost twice the price. I just didn't believe that so many positive reviews could be real. But I was wrong. We went to Vancouver to do the tourist stuff and to go to a Canucks hockey game. The Hampton was appealing because of it's location - downtown next to GM Place and near museums and shopping. I was a bit disappointed when we checked in and during the few days we were there, the roof top hot tub was closed for yearly maintenance (just our luck). However, I had booked a \"deluxe\" room which had a jacuzzi big enough for two people! Plus, two whole walls of our corner room were windows so we had a great view of the city. The breakfast had cold items as well as sausage and eggs. Everything was good quality and fresh. The staff was really wonderful as well. They were all helpful (giving directions and coupons and advice) and very cheerful and polite. This is a very nice place to stay and it's a great, great value.", "Date": "March 6, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“TripAdvisor does it again!”", "Author": "BoeingDad", "ReviewID": "UR4410490", "Content": "We stayed here to visit the Chinese New Year celebrations with two adults and four kids - three of them teens. All of the reviews were right on. Great breakfast, great room (#1203), first run movies on two TVs in seperate french door divided rooms. Full kitchen and cooking supplies (no oven). Excellent, helpful staff. The $12 secure parking was double gated in the garage. There was no noise in our 12th floor suite from the city. I asked about Dim Sum and they printed directions up for two different places in Chinatown. The top floor of the hotel is a great workout, TV and small pool sized hot tub for about 15 people. Everything looks out to a nice view. I could go on and on, but read the reviews like I did. There's no argument from me on any of them. I've been writing here in TripAdvisor for a long time, and I can tell you as fact that this is the only place to stay in Vancouver, BC.", "Date": "February 3, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great hotel and real value for money”", "Author": "Looseal", "ReviewID": "UR4399561", "Content": "We stayed at this hotel last week at the recommendation of trip advisor reviews and we were not disapointed, it was great. We were upgraded to a suite and it was very well appointed, clean and luxurious. I was very surprised that it was this cheap. The breakfast was acceptable although the plastic plates and cutlery were a little bit of a let down. However all in all this hotel is in a good location, parking is easy and the hotel staff will do everything they can to help you. I would recommend it to anyone.", "Date": "January 31, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Connecticut", "Title": "“Very nice hotel”", "Author": "ctmb-traveller", "ReviewID": "UR4320878", "Content": "I stayed at the Hampton 12/26 - 12/30/05 after reading reviews in TripAdvisor. Our family of four stayed in a suite on the 15th floor (room 1503, $143 Cdn/night +tax) and found the room large and comfortable, the staff very friendly and helpful, and the breakfast predictible but good. The location was fine to get easily to the shops on Robson etc. My 9-year old son would have loved to have a pool but he still had fun in the hot tub and with the table tennis table. I would definitely return to the same hotel.", "Date": "January 3, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Anchorage, AK", "Title": "“Exemplary 5-Star Hotel at a 3-Star Price!”", "Author": "SA&WJ", "ReviewID": "UR4315707", "Content": "We stayed in 2 king suites overlooking the city from the 12th and 14th floors for the same price per room as standard rooms in Seattle (excellent bargain!)....spectacular views, first-rate accommodations (the rooms were like executive suites at a 5-star hotel...spacious, clean, new beds and bedding, beautifully appointed), friendly staff....the hostess at breakfast was exceptional (welcoming, attentive and thoughtful). The breakfast was also a nice surprise...fresh fruit salad, juices, eggs, sausage, cereal, milk, a variety of muffins and breads, bagels/cream cheese, etc. The management has definitely taken this hotel to a new level of superior accommodations and service!!!! The jacuzzi, exercise room and sun deck on the top of the hotel have spectacular city views too. Great location....right across the street from GM Place (where the Vancouver Canucks play), short walk to downtown mega-mall shopping and restaurants, and a casino is also nearby. This is our favorite hotel worldwide!! (We will be trying to find reasons to back to Vancouver just to stay here.)", "Date": "January 1, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Pretty good for a larger, mid range hotel.”", "Author": "A TripAdvisor Member", "ReviewID": "UR4127824", "Content": "Pretty much what you would expect of a mid-range, fairly large hotel; clean, furnishings in good condition, pretty convenient location, large selection of television chanels, laundry. What this hotel does offer that some others do not is a refrigerator in the room, two complementary bottles of water a day, free gym and spa facility and a substantial buffet breakfast each day. They also have a complementary hotel bus, which we used to get from the hotel to Stanley Park and from the hotel to the Bus Station.", "Date": "November 20, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London, UK", "Title": "“Great breakfasts”", "Author": "A TripAdvisor Member", "ReviewID": "UR4075564", "Content": "We stayed at this hotel for three nights at the beginning of our trip and one night at the end. We had expected an average quality hotel but were pleasantly surprised with every detail. Reception staff were knowledgeable and friendly. Our room was spacious, comfortable and very clean. The balcony by the fitness area at the top of the building offered excellent views over the city. Best of all was the breakfast - excellent choice, with sausage and eggs, fruit, yoghurt and toast. Being able to linger over the coffee and newspaper in the morning really set us up for the day.", "Date": "October 31, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Australia", "Title": "“Lovely”", "Author": "A TripAdvisor Member", "ReviewID": "UR4074386", "Content": "Thank you... A great place to stay. We really enjoyed our stay at this Hotel. Its a little way out of the city but in walking distance. Get view from the entertainment room. Would stay here again. Next time we travel we will stay in more Hampton Inns..", "Date": "October 31, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Very Nice Hotel...new and clean”", "Author": "VegasCanuck", "ReviewID": "UR4074233", "Content": "Very nice new hotel in a pretty good location. I was upgraded to a suite after a reservation mishap at the front desk. New \"Totally Fresh Bed\". What a treat. Restaurant in the lobby was decent. Amazing West Coast Chowder...yum! See attached photos of the room and view from the 12th floor.", "Date": "October 30, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Liverpool, UK", "Title": "“Great place to stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR4035340", "Content": "We stayed at this hotel last June. The hotel was very clean, and staff were very helpful. They helped organise a whale watching trip for us to Victoria, which was great. It has secure parking, where we left the car for the duration of our stay. Had no problem getting taxis round the city. The breakfast was great, and free tea and coffee are available all day. Good location, as we could easily walk to restaurants and shops.", "Date": "October 19, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Winnipeg, Manitoba", "Title": "“We Highly Recommend!”", "Author": "GenerationXer", "ReviewID": "UR4013451", "Content": "My husband and I just came back from our 4 day/night stay at the Hampton and we would definitely stay there again! We had spent days looking for a hotel online that was reasonably priced, located in a good area, and had good amenities. Here's what we got: 1. Price: We paid only $119 a night for a room with a jacuzzi, a king size bed, ceiling to floor windows with an amazing view of the city, complimentary breakfast - (scrambled eggs, cinnamon buns, muffins, toast, english muffins, coffee, tea, cereal, fresh fruit, yogurt, danishes, juice, etc.) The room even had a complimentary umbrella for us to use - and we definitely used it. A nice touch! 2. Location: Contrary to what some of the reviews said, the location was great! We were within walking distance to the sky train, great shops, etc. It was on the quieter end of Robson but not that far away...(however, we do love to walk.) It felt safe in our area - there were many panhandlers and homeless people downtown but we did not see any within a few blocks of our hotel. They were mostly on the busier area of Robson and definitely on Granville! 3. Amenities: On the 16th floor was the excercise room, hot tub, ping pong table, foosball table, sauna, balcony with a great view, couches, etc. It was opened until midnight every night. We even entertained some friends there for an hour or two while we were waiting to go out for the evening! Too bad there wasn't a pool! 4. Service: Excellent service right from calling them over the phone to book our stay...to our last day there. Every employee we met were smiling and friendly! My husband and I ran into a small problem on our last day; we ended up shopping a little too much and did not have any room in our luggage to carry the extra goodies. The front desk staff helped out and found us a box that fit perfectly and gave us packing tape to seal it! Plus, we got these chocolates that were crazy good on our last night! (They ended up giving us an extra box of chocolates at the front desk - just because!) There were only 2 problems that we had during our stay at the Hampton and they were minor problems: 1. the tv was kind of wonky - colour was changing from being too red to kinda green, and was also a little fuzzy at times while watching shows and movies. 2. the shower leaked and we had to use all our towels to sop up the water on the floor! (only on the first night though) Having said ALL of that, you really won't regret your stay at the Hampton! Hope this helps with your decision.", "Date": "October 11, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Big comfort, reasonable price tag”", "Author": "Mozart_fan", "ReviewID": "UR4006508", "Content": "Wow, we were pleasantly surprised at this hotel. The Web site photos do not do it justice. The hotel is clean, modern and far enough from the sleazy part of Granville Street yet near enough to walk to the shopping heart of Robson. Chinatown is less than 5 blocks away. The reception staff is accomodating and courteous. The breakfast is substantial and tasty (compared to other chain hotels with 'free breakfasts') that included eggs and sausage, yoghurt, fruit, all kind of breads, juice and milk -- do tip those hardworking breakfast staff who scurry around to replenish the stock and keep the counters/tables clean guest after guest. The guest rooms are light and bright; the beds and duvet are super clean and comfortable. The bathroom is well-stocked and the bathtub/shower was even equipped with pump shower gel and shampoo. Exercise room could be a little better maintained but the view of the city from that floor makes up for it. Would definitely return on next visit to Vancouver. Way to go!", "Date": "October 11, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Northern California", "Title": "“Wow!”", "Author": "BirdingIsFun", "ReviewID": "UR4004484", "Content": "I can't say enough about how pleased we were with this hotel. My very quiet 12th floor corner room had floor-to-ceiling windows overlooking the city, the North Vancouver hills, the sunrise, and even a bit of the bay. The new \"fresh beds\" are cozy and comfortable, and the room had little helpful touches you might not find even in a more expensive hotel: a lap desk, umbrella, safe and free in-room coffee and bottled water. A full breakfast buffet is included, with hot scrambled eggs and sausage as well as cereals, juice, breads, and yogurt. And all of this for a remarkably low price (less than $100 U.S.). The underground parking lot has ridiculously tight spaces and is overpriced at $12/night - that would be pretty much my only complaint. It's true the hotel isn't in the busy tourist section down by the waterfront, but it was very convenient for our needs. I would definitely stay here again and recommend it to others.", "Date": "October 10, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "dallas, tx", "Title": "“Best Value”", "Author": "dfword", "ReviewID": "UR3941447", "Content": "This is a great hotel and a great value. If you don't mind walking five short city blocks to the main shopping area, you can't beat it. The rooms room and are impeccable, with free in-room high speed Internet access and great cable channels. An added bonus is a mini kitchen with a microwave, sink, and fridge. The exercise room is more than adequate, and the free breakfasts are much better than the standard toast and cereal fare dished out at other chains. Some posts mention \"unsavory\" characters hanging around, or that it's not in the best area of the city. Give me a break! The neighborhood is clean and very safe--have these folks been in a major US city lately? Vancouver is the cleanest and friendliest large city I have ever visited. The staff is extremely helpful. The only complaint I had is that there is not a separate elevator for the cleaning staff to use, and during busy times this can make the wait for an elevator a bit long. But minor quibbles aside, this is a great place.", "Date": "September 27, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Nottingham", "Title": "“Great place to stay”", "Author": "Moofe", "ReviewID": "UR3926298", "Content": "Stayed here for 3 nights in late August 2005. The hotel is modern, bright and clean. Had a fantastic corner room on the 14th floor overlooking BC Place. The complimentary breakfast was excellent and included toast, cereals, eggs, fruit and bagels etc. It's worth a trip to the 16th floor for the amazing views of Vancouver at night. Must mention that the reception staff were extremely friendly and helpful. We asked for restaurant recommendations and they were great every time, especially Moxies. Would happily stay here again.", "Date": "September 20, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "London, UK", "Title": "“Great Hotel for the money”", "Author": "C_GLondon_UK", "ReviewID": "UR3889132", "Content": "We stayed in this hotel for three nights prior to embarking on an Alaskan cruise from Vancouver. The hotel was excellent. Very quiet; it was extremely easy to get a good night's sleep. The service was brilliant. After a long flight and having been awake for nearly 24 hrs when we arrived at the hotel, the receptionist was very accomadating and allowed us to check in at 11.00am. The continental breakfast that was included in the price was v good. The only reservation we had was with the location. It wasn't terrible, and was within easy reach of most of the tourist spots of Vancouver (Gastown, Yaletown, China Town, Robson St shopping etc), but it was located on the quieter end of Robson St, and this is also the more downtrodden end of the main shopping street. But don't let this put you off. It was value for money and we would stay there again. Plus, they did a free shuttle service to any part of downtown Vancouver.", "Date": "September 9, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Wichita, KS", "Title": "“Great Service”", "Author": "b2buck", "ReviewID": "UR3881887", "Content": "Everything about this hotel was top notch. Our room was clean and well laid out. The front desk and bell personnel were very friendly and helpful. We got there before our room was ready and the held our luggage and gave us directions to a great lunch at Yaletown Brewing. Well worth the money.", "Date": "September 8, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "scotland", "Title": "“Good, comfortable hotel”", "Author": "jimmcc09", "ReviewID": "UR3832877", "Content": "One bedroom suite very comfortable. Upper floor had little traffic noise. Location quite good – easy walk to Canada Place, and Yaletown with all its restaurants very close. Hotel service good – everyone willing and helpful. Breakfast a bit of a melee at times, but good quality – and free. Recommendations from hotel staff on local restaurants never included the in-house restaurant. Gave lots of other good recommendations though. Best was Moxies, (less than three minutes walk at diagonal opposite corner of the same block), which had great food, service and was good value.", "Date": "August 31, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "1", "Service": "2", "Rooms": "2"}, "AuthorLocation": "", "Title": "“2 words : over rated”", "Author": "A TripAdvisor Member", "ReviewID": "UR3805905", "Content": "noisy room. bad view. stale air. service was ok at best. the cleaning lady kindly reminded me at 10:50 am when i was walking out the door that i needed to check out at 11am.", "Date": "August 25, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Redmond, WA", "Title": "“Wonderful place to stay”", "Author": "MKGRedmond", "ReviewID": "UR3799626", "Content": "We have stayed in Vancouver many times and this hotel undoubtedly has the most helpful, knowledgeable and accomodating staff that we have ever encountered. They rank up there with a concierge at the best of hotels. Plus the free downtown shuttle service and the great location, not more than a 15 minute walk from most Vancouver attractions, makes this a very convenient place to stay. We stayed in a very quiet and roomy suite which was well laid out and particularly pleasant for families traveling with kids, as there were two televisions and the living room was separated from the bedroom by french doors. The only drawbacks for us were that there is no pool (indoor or outdoor) and that there are not sufficient elevators to serve the entire building; only two elevators for a 16 story building. But its location at the end of Robson Street makes it a very quiet place to stay and a little oasis in the midst of an incredibly vibrant, bustling and busy downtown. Breakfast is pretty good but a bit boring and the menu did not change for the five days we were there. We would easily stay here again.", "Date": "August 23, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "San Clemente, California", "Title": "“Hospitality Awaits You!”", "Author": "Lauren00616", "ReviewID": "UR3782320", "Content": "My family and I just returned from a 5 night stay at this fine hotel. We found the front desk personnel to be very accomodating throughout our stay. In fact, at one point, one of them overheard us talking about forgetting a toothbrush and they immediately came to our rescue with a toothbrush in hand! Our room was very clean and the Maid service kept it that way. The complimentary breakfast buffet has a wide variety of bread, bagels, english muffins, cinnamon rolls, cereals, fruit, yogurt, eggs and sausage. The quality is good. Here's a tip: If you don't get to the buffet before the crowd, and you find yourself with no where to sit, just ask the hostess for a tray and take your food to your room. We did, and it worked great. The Hampton Inn is conveniently located in the downtown area, near a variety of shops and restaurants. We found the BEST place to enjoy a great meal and superb service is downstairs at Zachary's. This also happens to be where room service is ordered. I highly recommend the Salmon & Halibut Linguini, it was soooooooo good! The 16th floor has a ping pong table, foosball, gym equipment, treadmills, bike, TV's, jacuzzi, sauna, locker room and showers. We enjoyed all these great amenities (daily) during our stay. Here are a few places that make it to the Must See, Must Do category: BC Feeries Cruise to Vancouver Island- Victoria and Buschard Gardens Stanley Park- Vancouver Aquarium, hike, bike or walk the park's many trails or beaches The Museum of Anthropology, overlooks the ocean and mountains with impressive selection of Aboriginal art and exhibits Kayaking off of Vancouver Island's west coast The only downside to our stay here was that there are a few unsavory individuals that roam the streets and parking lot directly across from the hotel. Keep in mind though, that this is an unfortunate fact in many areas. The atttached photo captures the magnificent view from the spa area on the 16th floor- enjoy!!", "Date": "August 18, 2005"}], "HotelInfo": {"Name": "Hampton Inn & Suites Downtown Vancouver", "HotelURL": "/ShowUserReviews-g154943-d186788-Reviews-Hampton_Inn_Suites_Downtown_Vancouver-Vancouver_British_Columbia.html", "Price": "$177 - $279*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">111 Robson St</span>, <span class=\"locality\"><span property=\"v:locality\">Vancouver</span>, <span property=\"v:region\">British Columbia</span> <span property=\"v:postal-code\">V6B 2A8</span></span>, <span class=\"country-name\" property=\"v:country-name\">Canada</span> </span></span></address>", "HotelID": "186788", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/c0/9a/c09acd69ee5df7993107d63d290d57465large.jpg"}}