{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Worcester, United Kingdom", "Title": "“Above average - Good for couples or groups but would be wary if you are female travelling alone.”", "Author": "Clare H", "ReviewID": "UR125574580", "Content": "The hotel is in a great location for the MTR and also walking access to the harbour and the tourist attractions such as nathan road. The staff are friendly and the room was clean and well presented. The only point i would make is if you are a woman travelling alone - the hotel reception is on the first floor and you access the hotel on the ground floor and there is no security or locked doors in the entrance thus anyone can access the hotel and get to the outside of the rooms (Although the rooms has a locked door and a chain). I would say the hotel is good value for money and although slightly on the small side it doesn't matter as there is so much to do you will be out all the time!!", "Date": "March 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“above average considering price and location...”", "Author": "asmin_rage", "ReviewID": "UR120096897", "Content": "hotel is in centrally located in tourist shopping area. rooms are small as expected but clean. running hot and cold water. staff are helpful. no internet/ wifi or laundry service.", "Date": "November 3, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "2"}, "AuthorLocation": "Chennai", "Title": "“cheap alternative for a great location”", "Author": "RiteshLakhotia", "ReviewID": "UR112123491", "Content": "Hi, stayed here for 4 nights in June 2011. The hotel is a part of a larger building with just two rooms per floor. I would rate it about 1.5/2 star rating, the hotel has the check-in desk at First Floor and the place is a little cramped. If you are a single or max 2 people per room, the place seem to be ok, if you are a larger family - the rooms may be quite small. We had booked the room through CTS for HK560, and the deal was good as the walk-in cost more. The hotel has not eateries, so no breakfast. Wifi internet is free, though they make u feel as if they are making a favour to give u the access. The only way to access the rooms are Lift, which is too slow during peak check-in/check-out times. Eating joints are at close vicinity, bars, restaurants etcs are just walking distance. the best way to access the hotel is through Tsim Sha Tsui exit N2. It is right opposite to Hyatt Regency, we had walked to this location to take the free airport express shuttle. The staff are just ok, We had problems with the air-condition not functioning for 2 nights, but there was not much the hotel did to resolve it. Overall, stay here only for a good location and price. Else, nothing great!", "Date": "June 8, 2011"}], "HotelInfo": {"Name": "Chelsea Hotel", "HotelURL": "/ShowUserReviews-g294217-d1868184-Reviews-Chelsea_Hotel-Hong_Kong.html", "Price": "0", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">8A Hanoi Road, Tsim Sha Tsui, Kowloon</span>, <span class=\"locality\"><span property=\"v:locality\">Hong Kong</span></span>, <span class=\"country-name\" property=\"v:country-name\">China</span> </span></span></address>", "HotelID": "1868184", "ImgURL": "http://media-cdn.tripadvisor.com/media/daodao/photo-s/01/a9/bd/3f/caption.jpg"}}