{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hanau, Deutschland", "Title": "“Great staff”", "Author": "bonitasteffi", "ReviewID": "UR124957822", "Content": "Stayed there many times in spring/ summer 2011. The staff is exceptional! Loved the breakfast. Good beds, nice and quiet pool. Awesome and cheap indian food just across the street.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amman, Irbid, Jordan", "Title": "“Excellent”", "Author": "Oribe M R", "ReviewID": "UR124290448", "Content": "good service good rooms, with beautiful location and view", "Date": "February 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dubai, Dubai, United Arab Emirates", "Title": "“Great pool area”", "Author": "VindalooQueen11", "ReviewID": "UR121051514", "Content": "Comfortable beds, great restaurant and lovely pool area, this hotel is fab if you don't mind being a bit away from the centre and close to the airport. There are some tasty restaurants nearby too. The corridors are well soundproofed which makes for a great sleep. My only niggles were that the air con wasn't overtly powerful and had to change rooms because of it, and that the wifi was a shocking 35 dhs an hour when most 4 star hotels give it for free. This hotel is great for airline crew as they offer discounts for certain airlines too!", "Date": "November 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Nr Cambridge", "Title": "“Wrong location”", "Author": "MikeJenvey", "ReviewID": "UR120581248", "Content": "I stayed one night in mid-Nov for business. It's a relatively quick ride from the airport (15 - 20 mins), which is advantageous. However, location isn't great. There are nearby food outlets, they don't seem to be \"haute cuisine\" but rather more orientated towards the local industry - lots in the immediate area - want your car tyres changed? Whilst not the most important factor for a hotel, not having a bar is rather disappointing! Yes, it's possible in UAE. Consequently, if you wanted to enjoy the night life (actually, anything in Dubai), you would have to take a taxi. Not ideal if your time is limited. The room was very well furnished & for the first few hours, very comfortable. However, when I tried to sleep, it became very apparent that there was general background noise that was quite pronounced. It wasn't the conditioning (it was off), nor the mini-bar 'fridge. I tried to sleep, but to no avail. The sound was slightly louder near the window (which looked onto the central atrium - I measured it (very handy iPhone app = Decibel Ultra), 45db average, 50db peak. For interest, 45db = a quiet office, 50db = a normal home. I tried ear-plugs = no good. So, at 0400 local, I went down to reception to ask for technical help - previously, a receptionist had told me that the noise was from a tourist bus parked outside! Yeah, right!!. An engineer came to my room & told me that the cause was the a/c blowing from very large vents into the central atrium. I opened the room window (into the atrium area) & measured the volume again. This time it was 72db average & 77db peak!! The engineer couldn't do anything about the noise: I had a very disturbed & uncomfortable \"sleep\" - as did a colleague whose room faced from the front of the hotel onto the busy main road. Note - a high proportion of rooms face into the atrium or out onto the main road. So, to me, it was a short & disappointing stay.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "medway", "Title": "“Pleasant Business Hotel”", "Author": "lincolnlady64", "ReviewID": "UR119965899", "Content": "Layia Plaza hotel was a very pleasant hotel with accomadating staff. It is a about a 10 minute cab ride from the airport and about 1/2 hour from the downtown area. Rooms are well appointed and comfortable. We had an early flight in and as we had requested an early check in. Although they tell you that it is based upon availabilty, they had made sure the rooms were ready. We only tried the restaurant at breakfast which had a good buffet.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Gold Coast", "Title": "“Very new & spacious .”", "Author": "MargGoldCoast", "ReviewID": "UR115444306", "Content": "So new no one seemed to know where it was! Rooms large and all facilities available . I overnighted so only stayed a few hours. Good value for a stopover in Dubai .", "Date": "July 17, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“Spacious rooms, great value for the money.”", "Author": "sandy4115", "ReviewID": "UR110194819", "Content": "Stayed here for a business trip for a couple of weeks and was very satisfied. Positive: Room was spacious, clean, nice design. Bathroom was large and liked the built-in speakers. Friendly staff, very helpful. Hotel is new and looks elegant, not crowded, quiet. Location is only a few minutes from the airport. Negative: No vallet parking. When we first arrived, we had to wait for somebody to meet and inform us where to park. A nice view would have been good. Hotel is at least 20 mins from the nearest mall and attractions by taxi - expensive for tourists coming for city tours. Internet costs AED 35 per hour - too much. All in all, good hotel. Liked my stay. Would stay here again.", "Date": "May 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "london", "Title": "“Nice Hotel but could do better”", "Author": "boytunde", "ReviewID": "UR107418606", "Content": "Arrived at hotel and was checked in by friendly staff . we asked for 2 baby cot but only provided with 1 and after several attempted to get the hotel to supply 2nd cot was fruitless. the hotel location to local attraction are far and cost in the region of 50-60 Dirham one way. the room are very spcaious and huge but the house keeping could do with with more attention to cleaniness . some part of room dusty and bathroom were not washed some days even Brio service poor , took 30mins for for to be served . overal good hotel with friendly staff but more could be done .", "Date": "May 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "boston", "Title": "“Fantastic Stay”", "Author": "redlineboston", "ReviewID": "UR93889401", "Content": "New hotel, open just for 2 mos. The hotel is near the airport but not too close. Staff was fantastic, very helpful. Food was excellent, no Alcohol. Bar down the street. Hotel is not in a touristy area but a quick taxi to the Creek, Gold Souk or the beach. Room was very nice clean and quite. Great health club and pool on the roof.", "Date": "January 20, 2011"}], "HotelInfo": {"Name": "TIME Grand Plaza Hotel", "HotelURL": "/ShowUserReviews-g295424-d1879023-Reviews-TIME_Grand_Plaza_Hotel-Dubai.html", "Price": "$109 - $191*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Damscus Street, Qusais, DAFZA</span> | <span class=\"extended-address\">PO Box 237844</span>, <span class=\"locality\"><span property=\"v:locality\">Dubai</span></span>, <span class=\"country-name\" property=\"v:country-name\">United Arab Emirates</span> (Formerly Layia Plaza Hotel)</span> </span> </address>", "HotelID": "1879023", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/5d/23/0c/layia-plaza-hotel.jpg"}}