{"Reviews": [{"Content": "GREAT Simply perfect in any possible way. Great beauty items in the bathroom. Ralaxing: what London requires.", "Date": "Jan 1, 2009", "ReviewID": "UR246450372", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "THECLEVERADVISOR"}, {"Content": "super duper London, Belgravia, Full five star. This could have been the whole review. However, here's a few more.The hotel is relatively small giving you the impression of a more personal service. Front desk staff is polite and effective. Hardware relatively new. The rooms are well designed, and give you the feeling of relaxation. Their size is ok, typical london hotel room but of well implemented luxury. Marble bathrooms exceptionaly clean and shiny.The address is quiet, although you are in the heart of London. Everything is close by. Shopping, eating, walking etc. Very easy to find your way around.Do not leave unless you try the restaurant. Simply excellent.", "Date": "Nov 28, 2008", "ReviewID": "UR960383964", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "coastalux"}, {"Content": "Very special Hotel I did not know about this hotel, but i thinki everuone should, as it is so good, i wish i could stay there all the time!I did not know Belgravia, but it is a very fancy part of London, with only the best resturants and shops. It is close to Kightsbridge and the Hyde Park, but feals like a little village.The Halkin looks like a house, but inside is so luxirious, you will be so happy to stay here. I loved the bed and the funny shaped walls, it was great to be somewhere diffrent.The staf were very formal, and knew alot about the area. They also helped me find a resturant with Ababic food, becaus ei don't like English food. The staff look so smart, and are so kind", "Date": "Nov 20, 2008", "ReviewID": "UR343468242", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "4"}, "Author": "hamdan01"}, {"Content": "Lovely We stayed at the halkin for two nights everything was great the reception staff the entrance the bar the room... the bed it was one of the most confortable i've ever sleeped on!!!!! the room was lovely the bathroom very nice i cannot complain about anything in this hotel as it was everything PERFECT i would reccomend it to anyone traveling to london very near to the tube of hyde park corner knigthsbridge area... great stay", "Date": "Nov 16, 2008", "ReviewID": "UR930778241", "Ratings": {"Service": "4", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "4"}, "Author": "ofe"}, {"Content": "Unforgettable luxury in Belgravia       Room service", "Date": "Sep 15, 2008", "ReviewID": "UR632478285", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "3", "Rooms": "5", "Location": "4"}, "Author": "UpperDecker"}, {"Content": "Now we are cooking! My fiancee booked one of the Thai cookery courses that the hotel does so we decided to stay for the weekend. The hotel website is easy to use and does some special deals.We stayed in a superior room which was a perfect size for 2 nights. The room was very comfortable and peaceful and the staff very efficient and friendly. We particularly liked the waiter at breakfast who reminded us of Jimi Mistry of Guru and East is East fame.The shower was good and the products were great. The staff were excellent and assisted us with a booking at Benares on the second night. Although we wished we had eaten at Nahm as we found Atul Kotcher's restaurant disappointing. And we have eaten and cooked a lot of curries in our time. But that would have been greed as we had lunch there that day and the cookery course!The cookery course was excellent and the lunch following it was superb. Yum yum!A definite recommendation from us and we will be back sooner rather than later. An early Xmas shopping trip beckons me thinks!", "Date": "Sep 15, 2008", "ReviewID": "UR490587617", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "Fraserhiddelston"}, {"Content": "An Old Friend... Oh my old friend...I came to you first in the early 90's as a blossom eyed young buck who thought he would rule the world. I felt so sexy back in those days in my skinny pants and tight shirts. Sitting next to Bono in the lobby bar. Watching as you snuck out celebrities into the back alley. Feeling a bit like a celebrity myself. It was all so decadent. You were so wonderful before...and if longevity is the cornerstone of true excellence in a hotel you are by far one of the great hotels of the world. I salute you. Because as great hotels have opened left and right in London, and perhaps taken some of the celebrities with them, you still shine as brightly as you did 15 years ago. Perhaps better. As for me, and those who have stayed here for years, not only has the hotel aged gracefully in a modern sense - it retains the same essence and beautiful scent that makes for nostalgic reminiscence every time I walk through the door. The Halkin was always, and still is, completely flawless, It easily ranks as one of my top 10 hotels in the world. And for me London is just not London If I am not peering out my window on an early rainy morning to watch the effervescent stodginess of stodgy little Belgravia. And opening those special heavy room doors for another day in giddy London. The Scorpion.....", "Date": "Jun 20, 2008", "ReviewID": "UR119121534", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "eyechip"}, {"Content": "Quiet  I had to attend a party in Belgrave square . I looked at various hotels around but decided to stay here because of its location. Considering where it is i was amazed at how little traffic passes through here  hence this is a quiet road.Everything about the hotel is discreet , from the simple exterior to the service. The room was very comfortable with lovely marble bath  i very much liked the decor in the bedrooms which was well designed  uncluttered . This was a hotel that didnt feel busy or rushed, everything seemed to be correct  worked as it should. We slept very well , the bed was very comfortable  i did not hear any noise from outside.Our breakfast of eggs  bacon was piping hot and served efficiently.This place is for those that prefer a mercedes to a ferrari.!!! If you cant work this out, dont stay.", "Date": "Jun 19, 2008", "ReviewID": "UR890334632", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "member007England"}, {"Content": "Amazing Hotel This hotel is incredible in every way. Quiet and luxurious, with a friendly and helpful staff, in a great location (on a quiet and charming street, but only blocks away from the Hyde Park Corner tube stop) and fabulous rooms that are high tech but not overly trendy. Great linens and super soft heated towels, and their bathroom products (COMO, I believe) are also wonderful. Honestly one of the nicest hotels I've stayed in.", "Date": "May 22, 2008", "ReviewID": "UR874192775", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Lauren111111"}, {"Content": "Posh hotel in quiet yet convenient location       Studio Suite", "Date": "Apr 22, 2008", "ReviewID": "UR890056885", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "4"}, "Author": "boston_tripadviser"}, {"Content": "perfect Perfect in every way. I booked the halkin, for my wife's 30th birthday on recomendation. The hotel is tucked away, near all the embassies. the rooms are luxurious, with really comfortable beds,the restaurant ( Nahm is lovely). What really sets this hotel apart from the rest is the concierge. I had a list of things i wanted to book for the birthday trip and all i did was sent them an email with a list and they did the rest, They sorted out horse riding in hyde park, private cabins on the london eye, tickets to phantom of the opera, and private dining in some of london's finest restaurants. I barely had to lift a finger. Stefano, Diego and Justin really looked after us. if you want a taxi from the hotel they go outside, find one and bring it to the front of the hotel too, Justin even queued up outside the british museum from 6 am to get us tickets for the terracotta army at the british museum. Perfect. Go. Enjoy.", "Date": "Apr 13, 2008", "ReviewID": "UR252962351", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "neelBarchha"}, {"Content": "Excellent Location; Small Quiet Modern Hotel Overall I really liked The Halkin. It is on a quiet street in Belgravia and within walking easy walking distance to Sloane Street, Harrods and Beauchamp Place. I loved the bed, as well as the electronic control of the lighting and temperature. Turndown service was great. Minor problems: the closet doors were hard to open and shut and not very convenient for putting clothes in and getting them out. The small flat screen TV was not ideally situated in terms of viewing from the bed. The bathroom was great because it had windows (I had a corner room) and you could listen to the TV in there, but the showerhead was not adjusting as it should have, and the towels were not very fluffy. Also, the room was a bit cold, even after putting the heat on maximum, although that is kind of typical in London. I did not like the Como shambala bath products. Hyde Park Corner underground is five minutes away by foot.", "Date": "Dec 17, 2007", "ReviewID": "UR276305422", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "voyageurNY"}, {"Content": "A very private jewel --a bit unpolished It is difficult to make up my mind about the Halkin, where i have stayed 3 times. What's excellent is the small size of the hotel and the huge size of my deluxe rooms, the Thai restaurant and the immediate access to Nobu in the sister hotel Metropolitan. What is less than excellent is the bathrooms-huge, very design and very luxurious but impractical. You can hardly go in and out the bathtub and the separate shower dispenses water to the entire floor. Service is a bit erratic, though overall good though not for a 380 pound a night hotel.", "Date": "Nov 6, 2007", "ReviewID": "UR475554381", "Ratings": {"Service": "3", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "3", "Rooms": "5", "Location": "4"}, "Author": "BagsParis_france"}, {"Content": "Fantastic I recently spent a few days in a Belgravia Suite at the Halkin. It was simply my best hotel stay in London so far.Greeted with truffles from Charbonnel et Walker, fruit, fresh orange juice and water. Large and very comfortable room with a separate sitting area, superior technology (Hi and Wifi, lighting), brown marble bathroom with separate shower, excellent toiletries from Como Shambhala, bath salts, two types of robes, etc. Good turndown service.I had lunch and dinner at Nahm, and both were excellent (service a little stiff). Breakfast (脿 la carte) was unusually good for London: really fresh juice (this is getting rare in hotels), honeycomb, good jams, muesli from Southern Alps, excellent egg-white omelette, loose-leaf tea.The hotel has no spa but I walked (about ten minutes) to the Metropolitan and used the spa there. It is nothing special (very 1990s, rather small and in the basement) but I was told they plan to build a new spa on the top floor.I had almost given up on luxury hotels in London but I loved my stay at the Hakin: Asian restraint + Italian style + good location + quiet.", "Date": "Oct 5, 2007", "ReviewID": "UR669799992", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "topsmed"}, {"Content": "Complete Luxury       It's a beautiful bidet in the neighborhood, a beautiful bidet in the neighborhood...", "Date": "Sep 22, 2007", "ReviewID": "UR558077790", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "hip_hotels_4_me"}, {"Content": "WOW! From the elegant entrance to our spectacular suite,The Halkin was first class all the way! The locationwas central to many of the tourist attractions that wewanted to see, and the staff was polished andprofessional. The modern design somehow meldedbeautifully with the historical surroundings. The roomeven had a computer system that controlled everythingfrom the lights to the ac, and even maid or butlerservice!We did not try the in house restaurant (Thai food),but the room service was to die for (mozzarella andpesto burger, anyone?).The only downside was the high price tag, but theluxury that the hotel provided was well worth it forthis once in a lifetime European vacation.", "Date": "Aug 21, 2007", "ReviewID": "UR824054397", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "5"}, "Author": "ekmcler"}, {"Content": "Superb What a fantastic place. Cannot agree with the other reviews enough, from checking in to checking out the next morning, everything was first rate.The decor is not in any way tired but is understated and just has a overall feeling of quality and class. We had the most basic room, but it was easily big enough with an amazing bathroom.My wife loved the bathing products and I loved the in room entertainment facility, the jukebox was huge with more than enough choice at the touch of a button.The staff were attentive, but not in your face and everything we asked for was provided with courtesy and care.We didn't eat at the restaurant, but the breakfast was simply amazing.Loved this place and cannot recommend it enough.", "Date": "May 29, 2007", "ReviewID": "UR266275086", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "jc2k"}, {"Content": "Deserves More Press!", "Date": "Dec 27, 2006", "ReviewID": "UR773156305", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "mintyspottedcat"}, {"Content": "Ok but not more Hotel is little like sister Metropolitan (see review 23 Feb-06). Bit run down and with used to be fashioned interior design. Much to my regret the pictures on the website does not correspond with reality. The lobby is small and uninviting. The bar is nothing to mention. There are absolutely no facilities at the hotel, the reception will refer you to the facilities offered at the Metropolitan. Although this hotel is not quite 鈥渁round the corner鈥? I would not recommend the hotel for business traveller. Its location is not ideal. It鈥檚 better for tourists with sights and shopping in a near distance. The hotel is situated on a one way street, and to get cab is really difficult (impossible). It is a rather quiet area, but there are no interesting views. Also, be aware, rooms facing the back of the hotel are next to a large ongoing construction/renovation project. I had booked a quiet king deluxe room on a high floor with guaranteed upgrade if available. I received a room on first floor facing the construction work. I was told no other rooms available. After a little discussion they had a 鈥渇ew鈥?other alternatives and I was shown a smaller room on a higher floor facing the front of the hotel (so downgrade instead of upgrade). Rooms are ok, beds are fine and my bathroom was large and comfortable. Although nothing special and definitely not at all as expected. A let down! However, considering London hotel prices it can be possible to get a decent rate here, so for someone not looking for an extraordinary hotel, this one is ok.", "Date": "Dec 19, 2006", "ReviewID": "UR181713130", "Ratings": {"Service": "2", "Business service": "1", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "2", "Value": "2", "Rooms": "2", "Location": "2"}, "Author": "pelun"}, {"Content": "Modern Oasis in Belgravia This hotel was my idea of heaven: A spacious and extremely comfortable room with clean, modern decor and a spacious and luxurious bathroom. A friendly and helpful staff. A fabulous location near wonderful restaurants and shopping, and close to a Tube station for those sightseeing trips further afield.All this AND free Internet access. What more could you want?", "Date": "Dec 13, 2006", "ReviewID": "UR755973785", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "theresama40"}, {"Content": "Home away from home Absolutely recommendable - feels like home away from home. We are staying in this hotel on a regular basis (monthly). It's time to write an appreciative note! The rooms (stylish and with all ameniites, clean and modern), the service (especially the concierges and check-in staff), great breakfast. The hotel is situated in the quite diplomatic quarter, walking reach to Knightsbridge shopping mile and famous department stores. It has a small bar/lounge area, which is a bit a shame, a bigger and not so drafty sitting lounge would certainly enhance the place. Great service there though. The hotel with asian touch is ideal for spoiled travellers and business people who depend on a good nights rest.", "Date": "Jul 8, 2006", "ReviewID": "UR217706135", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Outstanding Service Marks the Halkin I recently stayed a week at the Halkin, left for Paris for four days, then returned for a day, before departing for home. The outstanding and accommodating service that its staff consistently delivers sets the Halkin apart. In addition to the usual services, such as making restaurant reservations, the staff helped us in many ways. Getting third row seats to a sold-out Royal Opera Theatre performance, holding some of our luggage while we were in Paris and picking up our bags at check-out within two minutes of calling are just some examples of the attentive, helpful service the staff provides. All this with style and grace -- and no attitude. The staff care and want to be of service (for example, once when we needed help with luggage but only the concierge staff was free, one of them stepped in), and I never once observed the it's not my job attitude so prevalent today.The small touches equally impress -- a welcome drink at check-in; turn-down service (Frette floor mats) no matter how late (the staff seemed to know instinctively when we were out); lavendar roses and fresh fruits in the room; a sturdy umbrella and a long, leather shoe horn in the closet. The Halkin is situated in a great neighborhood that is quiet and serene while also just minutes from the action (Hyde Park Corner tube station is only three minutes away walking, Harvey Nichols less than ten). The room is large (for London), stylish, quiet and well designed with heated bathroom floors and towel racks (with great towels -- absorbent but not bulky); a large soaking tub and separate shower with lots of water pressure; a comfortable, big bed with great linens and pillows; good lighting; and touch controls for everything at bedside. A flat-screen TV, an air conditioner that goes a little cooler and more dresser space are all I would ask for (also, the room in which I stayed had only one small window, so if sunlight or window space is a priority, book a suite). There were some glitches -- bottled water was left at turn-down on most, but not all, evenings and there were no roses on our return of one night -- but they were minor. I definitely would recommend the Halkin and intend to stay there when I return to London.", "Date": "Jun 1, 2006", "ReviewID": "UR451967104", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "Explorer777"}, {"Content": "A memorable weekend, a beautiful hotel I wanted somewhere special to spend the weekend of my 40th birthday with my husband, and couldn't have chosen a lovelier or more stylish place. I booked a package called Breakfsat in Belgravia from the hotel's own site (not the LHW one) which, as well as full breakfast, included a late check out at 2pm on our last day which was much appreciated. Our room was a deluxe double facing Halkin St, with a large sofa  armchair in the seating area. The decor was modern with a calming, Oriental feel, also very chic touches such as a bright vase of fresh tulips, and a dish of apples lined with a green leaf. The bathroom was huge  full of lovely touches - bathroom scales, loofahs, gorgeous smelling toiletries - plus an incredibly powerful shower. The 6ft bed was the most comfortable I have ever encountered in a hotel, with high quality sheets and goose down duvet/pillows. There were even 2 types of robe - towelling bathrobes and soft waffle cotton robes for lounging in, plus his  hers-sized slippers! However, what made the Halkin really stand out was the wonderful service we received at every turn. Nothing was too much trouble for the staff, every need was thought of  we were addressed by name most of the time, a lovely personal touch. They really seemed to care that we enjoyed ourselves  felt special. This hotel is such a breath of fresh air compared to many supposedly top London hotels with their tired, traditional styles, corner-cutting and sullen service. Yes, our weekend was expensive, but we felt it was worth every penny, and could not recommend it more highly.", "Date": "Mar 28, 2006", "ReviewID": "UR875261291", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "SarahGibson"}, {"Content": "Oasis of calm My now wife and I booked the Halkin for the weekend of our wedding last year. It was perhaps an unusual choice for the occasion as it's not laden with heavy curtains, deep carpets and rich furnishings like many London hotels. But it's all the better for it. The Halkin is in a very quiet location and inside, it's equally peaceful. For a design hotel, the staff couldn't have been friendlier or less pretentious. The rooms were extremely comfortable, particularly the bathrooms. Some well thought-out touches like a toaster with breakfast so you don't get soggy toast.One tip: we were on a splurge but decided against booking a suite as we were so impressed by the size and comfort of the deluxe rooms at half the price.", "Date": "Feb 24, 2006", "ReviewID": "UR541035889", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "banktonroad"}, {"Content": "Very mixed service spoils a good hotel We have stayed in this hotel before and before were very happy. On our second trip we were still impressed by the room which is of a high quality and the location. The problem is that the service is very mixed, some staff are great but others downright aloof and almost rude. The hotel has no facilities and paying almost $700 a night is very expensive fow what you actually get given the sketchy service. The food at Nahm is great though.Management need to weed out the weak staff in this hotel as they let the side down and in a luxury top end product you cannot afford to have second rate staff serving.", "Date": "Jan 7, 2006", "ReviewID": "UR596215653", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "2", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Don't hesitate! I arrived at the Halkin well before check in (maybe 10am) after arriving on an early flight into London from Geneva. I was exhausted and while my room was as expected not immediately ready, the check in staff whisked away my luggage and immediately offered me tea while I waited. Instead of waiting in the lobby I walked around Knightsbridge for about 45 minutes and upon my return not only was my room ready but there was a full still-piping hot tea service and fresh fruit waiting in my room. I mean are they mind readers or what? And no extra charge on the bill, whereas I have usually found most London hotels will not hesitate to charge you for anything. The bathroom has a huge and terrific tub, perfect for two, and the bed is divine. The provided hair dryer fizzled out while I was using it and a new one was brought to me within 5 minutes. The room, facing Halkin street, was quiet, stylish but not pretentious - just like the hotel itself. It is on a good end of Knightsbridge - not that there is a bad end, but you can walk easily to Park Lane/Picadilly/Oxford Street along with all the Knightsbridge/Sloane Street shopping etc. Another plus for me was easy short term parking in front of the hotel - I had friends meet me a couple times who had no problems finding spots - unheard of in central London. All in all, a GREAT place - try booking through Orbitz where I found an awesome deal.", "Date": "Jan 2, 2006", "ReviewID": "UR631357024", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "A truly superb and incredibly quiet hotel I decided to stay at The Halkin based entirely on the positive reviews on this website. I can only say that the rooms and the service are just as outstanding as the most enthusiastic reviewers have said they are, comparable even to a top class hotel in Asia (and I have never said that about a hotel anywhere in Europe before). Another unique quality is the peace and quiet, so very difficult to find in any major city. This is accounted for not by any unusual soundproofing (and any significant external noise would in fact intrude, see below) but by the hotel's location on a narrow one-way street which sees very little traffic. Since I was on a short non-business visit from the East Coast of the US, I decided to stay on my home time zone and sleep from 0300 to 1200. I was able to accomplish this even on a weekday morning.The only exception to the peace and quiet was a function of the room where I spent the first night being on the west side of the hotel, overlooking an alley, Montrose Place. This must be where the service entrance is located, and I was woken up before dawn by the usual rubbish collection noises -- bags of bottles being slung into a truck, the truck revving up to compact them, the beeping noise as the truck backed out, miscellaneous shouts and yells. Rooms on this side are definitely to be avoided.Thereafter I slept in a room facing Halkin Street, where I was not disturbed at all. I believe rooms on the east side (where there is no alley) and at the back would probably be quietest of all. Although there is a massive, block-long construction project under way right behind The Halkin, it is noisy only during normal working hours (this not being Asia, after all). It looked to me as if it has about another year to go.The only complaint that I would have is the outrageous charge of 20 pounds ($35!) per day for internet service in the room. When will hotels in Europe stop charging for internet service as if it were some new, rich man's toy, instead of a routine utility, like electricity and TV?", "Date": "Dec 13, 2005", "ReviewID": "UR549509562", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Westonian"}, {"Content": "Great Room, Great Service   showReview(3702515, 'full');", "Date": "Jul 27, 2005", "ReviewID": "UR484252371", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "The Wow factor   showReview(3615158, 'full');", "Date": "Jun 27, 2005", "ReviewID": "UR106513047", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "bingofish"}, {"Content": "Superb, sophisticated, and elegant   showReview(3576305, 'full');", "Date": "Jun 19, 2005", "ReviewID": "UR241840019", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Quiet and Stylish. I liked it.   showReview(3523437, 'full');", "Date": "Jun 3, 2005", "ReviewID": "UR900700749", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "3", "Rooms": "5", "Location": "-1"}, "Author": "isabelle304"}, {"Content": "So calm, so cool, so stylish, so relaxing.   showReview(3513540, 'full');", "Date": "May 31, 2005", "ReviewID": "UR761008570", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "3", "Rooms": "5", "Location": "-1"}, "Author": "Brownbreadnbutter"}, {"Content": "Best Hotel Ever!   showReview(3402237, 'full');", "Date": "Apr 24, 2005", "ReviewID": "UR461719827", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Dougals Adams Fan? Stay at the Startship Titanic!!!!   showReview(2865477, 'full');", "Date": "Dec 6, 2004", "ReviewID": "UR797707005", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Understated elegance, excellent location    showReview(2591773, 'full');", "Date": "Sep 22, 2004", "ReviewID": "UR583113002", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Beautiful, elegant and quiet hotel   showReview(2381341, 'full');", "Date": "Aug 4, 2004", "ReviewID": "UR269287953", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "hi2emma"}, {"Content": "Peace and Calm   showReview(1218551, 'full');", "Date": "Aug 8, 2003", "ReviewID": "UR473961297", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Fabuleux   showReview(22494044, 'full');", "Date": "Dec 6, 2008", "ReviewID": "UR885959883", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "3"}, "Author": "PACS2209"}, {"Content": "闈欍亱銇儑銈躲偆銉娿兗銈恒儧銉嗐儷   showReview(20525526, 'full');", "Date": "Oct 1, 2008", "ReviewID": "UR164364608", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "waileaJapan"}, {"Content": "Maravilloso hotel en una zona muy tranquila       parkimetro en el halkin", "Date": "Sep 1, 2007", "ReviewID": "UR741555902", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "ELFER"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g186338-d187994-r23160046-The_Halkin-London_England.html", "HotelID": "187994", "Price": "$468"}}