{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Clean, reasonably priced, good area”", "Author": "Nicoc", "ReviewID": "UR128183918", "Content": "After living several years in Amsterdam, I often go back and Conscious Vondelpark is my preferred choice. Fun to simply discover your room with all ecologic solutions (ok, some of them a bit forced, but the concept is there!). Cean, modern and with a resonable price if you book ahead. The Overtoom area is well packed with restaurants (etnic and not) and offers a \"local\" alternative to the overtouristic Leidseplein. Highly recommend.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Tunisia", "Title": "“Pretty Disappointed”", "Author": "I_will_take_you_home", "ReviewID": "UR128074771", "Content": "My wife and I travel to Amsterdam about once a year for fun. We chose the Conscious hotel because it looked descent and there were rooms available. The whole experience was a little disappointing. The hotel staff were professional enough, and although the rooms were really small they were clean. The hotel felt very corporate and it was clear that their policies prioritized their making money over creating an enjoyable authentic experience for travelers. Sure every hotel has to make money, but you shouldn't feel it when you walk in. Corporate headquarters must have decided to make every guest sign of on the fee structure for smoking in the rooms (150euro) or messing with the smoke detector (250euro). Nothing really lived up to the cool cafe vibe they attempted to create in the lobby. The whole \"conscious\" theme is a bit of a sham. Putting little environmental signs all over the room and eliminating the shower curtain in favor of an open door seemed to be the extent of the green design. The dumb sayings plastered on the door of every room are tacky. The tram is close by, but it is sill a bit of a hassle getting into downtown. It is a solid 20 minute brisk walk to Leidsplien. I won't stay with them again. There are too many other cool hotels in better areas at the same price point.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Rome, Italy", "Title": "“Decent place to stay in Amsterdam”", "Author": "KR1212", "ReviewID": "UR127716754", "Content": "Hotel Conscious is modern, clean and quiet; the bathroom is palatial compared to most Amsterdam hotels (where it is--literally--a water closet!); mattress is very comfortable. I appreciated the ecoconsciousness and the reduction of waste at this hotel. The hotel is right on the no. 1 tram line (stop Overtoomsesluis), which makes getting around very easy. From Schiphol, you can take the train station to A'dam Lelyland and then the no. 1 tram from there--much less hassle than going to Central Station. This is a nice place to stay outside of the hysterical center, which is full of stoned tourists and dingy, dirty hotels, but still convenient. I didn't have the breakfast, but the bar in the front lobby serves coffee and pastries, which were good. I would recommend this hotel and would stay there again.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hong Kong", "Title": "“First choice for budget travller”", "Author": "InvisibleMo", "ReviewID": "UR127601303", "Content": "Staff is very friendly and helpful. Very new decor & clean room and the size is acceptable. Price/Quality ratio is very high. Breakfast is very delicious. It is located right next to the tram station and 20 mins from Amsterdam Centraal station to there. Nearby you may find a restaurant called Pizza Bakker which serves excellent pizza!", "Date": "April 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Manchester", "Title": "“Good price, basic with a twist”", "Author": "Walco", "ReviewID": "UR127548017", "Content": "Stayed at the hotel the first weekend in January, attracted by the decent room price. Found hotel to be clean, modern & functional. Communal reception / bar area was a really nice environment to sit, read / chill out in. Fab window seats allows great opportunity to watch the world go by. Drinks prices were quite expensive for a hotel out of the central area (perhaps that's why!). Rooms were on the small side (expected for a city hotel) and the minimal design did feel a little sparse but was spot on for a weekend base to explore the city. Staff were really friendly & gave us a great recommendation for a small nearby cafe to eat at & we enjoyed a delicious lunch there. We ate breakfast at the hotel one morning for convenience and whilst we liked it we were aware that there are cheaper alternatives elsewhere. Hotel location is out of the busy central part of Amsterdam but very easily accessible by tram right outside the hotel. Buy a 3 day tram pass and getting around the city is never an issue. Vondelpark sits behind the hotel and with a very short walk to the park entrance we enjoyed several strolls through the park and as a route into the city, choosing this as an alternative to the tram. We would stay at the hotel again & would recommend it to anyone looking to explore the city on a budget. Rated 4* for what it is, not in comparison to ALL hotels & categories. Constructive feedback for management: found reception check in / out slow so somewhat frustrating. Nail that to further improve customer experience :-) Shower was good but spray did go all over the bathroom floor so care needed when stepping out not to slip...bigger bath mat?", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Royal Palm Beach, Florida", "Title": "“Amazing staff”", "Author": "leelee561", "ReviewID": "UR127190886", "Content": "We stayed at the conscious hotel for 5 nights. Hands down the coolest staff. They were so helpful in finding the best restaurants and fun night spots to eat and hang out in. A must see is the madelief which is literally 2 blocks away and the best dining experience we had. Another fav was the moralang. Best bar we thought was 3 sisters pub. But back to the conscious hotel...super clean, cozy white fluffy blankets, black out curtains (just in case you need to sleep in ) and the best organic beer. We had a blast talking and hanging out with the bartender who happened to be the front desk workers as well. Also, not that it matters ;) but EVERYONE was good looking and went above and beyond to make our experience the best. This trip was last year but we are planning to go again next month..and I know where I will be staying!", "Date": "April 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lyon, France", "Title": "“Lovely staff and awesome room with an eco-touch! The perfect hotel!”", "Author": "nnssxx", "ReviewID": "UR126754772", "Content": "Everything was perfect! No, really, EVERYTHING! The staff is lovely, the hotel and rooms are super clean and quiet, even with the tramway (line 1) being literally 5 meters away from the hotel door (super convenient!). The price range is very good for Amsterdam, and the Vondelpark is really nice too! I will definitely go back to this hotel next time I visit Amsterdam! Highly recommended!", "Date": "March 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Friendly Staff”", "Author": "BaMi P", "ReviewID": "UR126641334", "Content": "We traveled for vacation with my girlfriend and baby. We asked for y quiet room which we had. The staff was friendly and helpfull, the room was clean ! The downs side is that the location is far but easy to access with the tram/train... The price is note cheap but seems ok for the city... The shower has a waterconsumption reducer so it goes for cold to hot, which is not so nice..", "Date": "March 25, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Charged in advance most 36%, and returned only 20% !!”", "Author": "Sergio Seiji I", "ReviewID": "UR126479265", "Content": "Hotel very nice, modern but impersonal. Lack soul. Just found out I was robbed after I left. We made reservations for 10 hotels and none of them had this problem.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“simple but worthwhile...”", "Author": "theshirtshop", "ReviewID": "UR126398344", "Content": "a simple but worthwhile stay, if you prefer a quieter yet still convenient location... paid â‚¬85 for a superior room, definitely 'worth it' for amsterdam... bathroom spacious, room basic but comfortable...no complaints, would certainly recommend onward..", "Date": "March 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "milano", "Title": "“Good hotel but poor breakfast”", "Author": "federicoa", "ReviewID": "UR126297923", "Content": "The hotel was clean, modern and in a good position to join in a few steps Van Gogh Museum and the city centre. What we didn't expect was the poor and expensive breakfast ( 12â‚¬ added per person) we found. No cakes, croissants or any \"sweet\" food (you had to pay an extra ) apart from some fruit jam, eggs, ham and cheese.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "banbridge", "Title": "“Excellent value”", "Author": "metbolt Posted by an Easytobook.com traveler", "ReviewID": "UR125608178", "Content": "Stayed at the hotel for 2 nights with my partner and another couple. the staff were extremely helpful and polite, very relaxed atmosphere at the hotel, especially in the lounge area. nice and quiet at night, and very secure hotel and hotel rooms, the safe was especially appreciated. tram stop right outside the door which was excellent, and tram tickets were available to buy from the hotel reception. beautiful rooms and huge beds, which were so comfortable!! although the only downfall was the 10minute wait because the receptionist could not find my booking, which resulted in not getting the room i requested (with a balcony) but i think this was down to the \"easy to book\"website and not the hotel itself. but the receptionists were very helpful and found me another room, so i do not think i would book through this website again, as it caused a bit of panic.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nijmegen, Nederland", "Title": "“Just good and not expensive”", "Author": "Bartho0", "ReviewID": "UR125603310", "Content": "Hip and cool hotel in Amsterdam, with a relaxed atmosphere. The reception was a bit messy and we were suprised that we had to pay the city tax and breakfast in advance. We also had to sign to promise not to smoke in the room. The hotel consists of an A-and B-tower, that means 2 houses in 2 blocks, connected by a corridor. The corridors are bit of a dark maze. The room itself was fresh, not large, but neat and had a neat bathroom. We had a good and quit sleep. Tram 1 stops right outside, 8 minutes to Leidseplein. The breakfast was good enough (â‚¬ 11.50), but nothing special. Free WIFI. Conscious Vondelpark is just a good and not too expensive hotel has a good public transport to the city centre. Take also a relaxing walk in the Vondel-Park, just around the corner. We have also stayed once in Conscious Museumsquare, the rooms were bigger there and the location was closer to the center, but was a little more expensive.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Amsterdam", "Title": "“Good Hotel, Good Price”", "Author": "Jsunset", "ReviewID": "UR125448640", "Content": "Spent two nights at this hotel and had a very good experience. Took the upgraded room, perhaps 10 euro more per night. it was in the back wing on the quiet street in the rear of the hotel. Nice size room, good bathroom, very clean and quiet. it's a simple room but nicely done and the staff were friendly. For this price in Amsterdam, I can certainly recommend this hotel. Right next to Vondel Park and 5 minutes to the city center are on a tram (stop right out front) or on a bike. Impressed.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brooklyn", "Title": "“The best Hotel and City I have ever been to!!!!!”", "Author": "Senn M", "ReviewID": "UR125370117", "Content": "Let me start by saying that I plan on going back within the next few weeks and this WILL be my place of stay. This hotel was absolutly great. When I first walked in I was amazed to see how beautiful the place really was. The pictures are FORREAL! This place is really beautiful, and that was not to mention that the 1 Tram from Cental station stops directly infront of the hotel. This was too convient. Even though your not in the Red Light district area the tram from the district bring you straight here. When I checked in i was giving a room on the B side, after taking the elevator up and walking across to the other side my key did not work so I went back down stairs, in the midst the cleaning supervisor was in the hall and I asked her was there any rooms availible in the front because being a woman alone I didnt feel comfortable doing that walk later to my room at late night alone. She quickly told me that room 116 was clean and availible and that she was calling the front desk to have me changed. By the time I got down there the front desk person was already on the phone with her and changing my room. She told me that I didnt need to explain and that it was ok. OMG When I walked in the room I was at a awww at how cozy and nice the room looked and felt. It felt like an 5star hoel just smaller. Actually I have been in 5star hotels and none of them had flavor like unless its like the Wynn in Vegas. Everything looked brand new and spanking clean. It took a second to realize how to turn the light on because you have to put your room key in a slot on the wall to turn on the power in the room to save energy and when you take it out to leave the room everything shuts off. Once I sat down on the bed I was then confirmed that I choose the best play to stay in Amsterdam. The bed was soft as ever just how I love it. I layed down and it felt like the mattress was hugging me. I didnt have a problem not once with the free wii fi it worked with my laptop and ipod even at the same time. The day Time front desk people were so great. They advised me of everything I can experience. The night time guy on my 1st night wasnt too good but I will not hold the hotel responsible because when I did speak to the manager Xavier about it the next morning he was extra extra helpful and not accepting of non customer service, He went out of his way to help me. The next night guy and evening girls were so great. Since they have a bar in the lobby they just talked to me and laughed as I sat and enjoyed one of their home made smoothies. The night uy even took the time to print out time and directions for the tram to locations. My room was cleaned spotless, Tissue refilled. The only thing is the there isnt a iron or ironing board in your room and you have to get it from the front desk, and since they have a really big and good ironing board it was really heavy to loged back and forth to the front desk but it was cool. I stayed two nights here and like I said when I return I will be staying there again. Let me not forget that the Price was much much cheaper than those of te hotels I saw online and when I saw them in person they were run downed hotels. I know my review may sound like im a worker there trying to big up the hotel but im not. Im just a NY traveler who travels alot and I appreciate getting my moneys worth. I would reccommend this place to everyone", "Date": "February 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great value, modern hotel”", "Author": "Rigatti", "ReviewID": "UR124777819", "Content": "My wife and I stayed here on a recent trip and greatly enjoyed our stay. Rooms were small but cute, clean and modern, staff was friendly and helpful, and overall I felt like it was a great value. The location is quiet and untouristy but it is a bit of a haul to get to the main attractions. That's what bikes are for though! Vondelpark is right there too, so you can bike through it and avoid traffic (not that it's much of an issue with the dedicated bike lanes). Overall we were very satisfied with our stay", "Date": "February 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Very nice eco-friendly hotel”", "Author": "oni_lovely", "ReviewID": "UR124743399", "Content": "I stayed here for 1 night. It was easy to found from Schiphol Airport. Just take train to Amsterdam Lelyaan, after that take tram no 1 to Central Station. Then stop at Overtoom. The hotel location just in front of the tram Overtoom. But if you carry a lot of things, better just take taxi since u need to change train & to tram. I came there after my trip to Barcelona, with a lot of luggage & belongings and it was quite troublesome. When I came there & made the payment for the room, they said they didn't have the standard room & they only have the premium room which a bit more expensive but had bigger room. I also had asked for room with double bed, but they said the room was unavailable since it was Valentine's day and the hotel quite fully booked. Since I asked for room not facing the street side, they gave me the room at tower B which quite far from the lobby. With many things to bring, it was quite frustrating to found my room. But my room was nice & big. The bed was very comfortable. And the bathroom were big & spacious. I had a very pleasant stay here. One of my problem was the shower didn't have door so after I took my bath, the water were everywhere. Maybe the management can consider to put the door together with the bath, so that guest won't spent more towels to clean the floor. Tram to go to Dam Square is just in front of the hotel. It take around 15 minutes to reach Central Station. From there, u just can walk and go to Dam Square. It just too bad, the hotel isn't near Dam Square. Actually I stayed for 1 night only. I had asked for the staff last time how much if I wanted to have late check out, they asked me to paid another 50 euro. Then I changed my mind, since my flight at 9pm the day after. I thought to do late check out. The hotel didn't provide number to called the lobby, so I called from my mobile instead. And from the staff she said she doesn't have any room available for tomorrow, all was fully booked and I must check out tomorrow. And the day after, I tried my luck again & called the lobby to asked whether I could do late check out, and the guy staff said I could do it ! I was surprise since the day before the other staff insisted I couldn't stay since it was fully booked. And the guy said his colleagues didn't know I stayed at premium room and I could do late check out at 6 pm (his colleague that I asked the day before said if I wanted to do late check out, I must check out at 5 pm) ! Very nice ! Too bad, I couldn't remember his name. And I didn't know that if I did late check out, the hotel won't clean my room. So when I came back from Dam Square I still found out my room was messy. And I asked the lobby staff to gave me new towels. I need to wait for 30 minutes but all the housekeeping person never came, so I called the lobby again and within 10 minutes, I got 5 new towels ! So nice ! Will consider to stay at this hotel again. But overall, I really enjoy stay at this hotel.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Southampton, United Kingdom", "Title": "“Great hotel...”", "Author": "gemma105", "ReviewID": "UR124720312", "Content": "We stayed in this hotel for two nights during February half term. The hotel is a good 15-20 minute walk from the main centre of the city. It was easy to find. We took the 197 bus from the airport (4E each) which was nice and simple. The hotel itself suited our needs fine. The room was a reasonable size and was very clean. Hotel staff were friendly. During our time in Amsterdam, the weather was freezing (the canals had frozen over) but our hotel room was always warm. We liked the quirkiness of the eco messages around the room explaining how the window sills were made from recycled coffee cups etc. Overall, we would definately recommend this hotel for visiting Amsterdam, especially for the price.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Helsinki, Southern Finland, Finland", "Title": "“Excellent hotel with great location”", "Author": "Ebba_Sve", "ReviewID": "UR124052713", "Content": "From the beginning of the stay I was warmly welcomed and personnel was very friendly and polite. Whole hotel and room was very tidy. Beds were comfortable and rooms very quiet. As a runner the location next to Vondelpark was perfect to me. It was easy to start your day with a morning run in the park and after that had a delicious and organic breakfast. Tram goes right next to the hotel which is totally bonus. I can warmly recommend this hotel!", "Date": "February 3, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Madrid, Spain", "Title": "“VERY VERY VERY BAD HOTEL”", "Author": "SAF101", "ReviewID": "UR123841287", "Content": "disrespectful...impolite...lie in bed photos...small room...cold room...despots...I mixed it my room without permission...not appear in the picture at the hotel, the building back on the street is that you need ...Do not go Do not..... very very bad", "Date": "January 30, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New York City", "Title": "“The Conscious Hotel Vondelpark Amsterdam”", "Author": "fforbes212", "ReviewID": "UR123752139", "Content": "This being my first time in Amsterdam,I decided to try out a different type of hotel from the ones I usually stay in.Most of the hotels I stay in are four or five stars,with tons of amenities.So this time around I wanted to expand my travel horizons.Which lead me to staying at the Conscious Hotel Amsterdam.It is located in the Vondelpark section of Amsterdam. The Vondelpark is a public urban park of 47 hectares (120 acres) in Amsterdam, Netherlands. It is located in the stadsdeel Amsterdam Oud-Zuid, west from the Leidseplein and the Museumplein. Centrally located and a 15 minute tram ride from the center of town.The tram is located directly in front of the hotel.So its a quick 1 tram ride from Amsterdam's Centraal Station. Upon entering the hotel lobby after getting off a train from Antwerp at Centraal Station.I was little bit tired,sweaty,and hungry.I arrived at around 12 in the afternoon.Approaching the desk I was met by a very warm smile.Welcoming me to Amsterdam and the hotel,telling him my name we were told our room wasn't ready.Which was fine I went out and explored Amsterdam. Coming back a couple of hours later the room was available .The room was typical to european standards..smaallll.but that is to be expected.This being a eco hotel that means no control of the air condition.I t was sent from the lobby.No refrigerator in the room so no midnight snacks.I don't ever use the snacks provided .I often use it to store things I have purchased during the day from the local supermarket(wine,cheese,fruit).This was a slight inconvenience,actually more than a slight inconvenience.Also after a long day of touring a little ice would be nice with my drink.For you to get ice you had to go to the lobby to get it.After asking they only gave you a cup of ice for two people.They also asked why you needed the ice.Why i needed the ice?Are you serious? The shower was also not that great,I don't know if it had to do with conservation or poor plumbing.The room was decorated nicely in a plant theme,most of the rooms in the hotel ,as well as the lobby have a eco plant theme going on.The bathrooms was clean and efficient and unusually big.I almost wish they had taken a little less room for the bathroom and added a little of that space for the actual room itself. So if you have a chance to visit one of my favorite cities in the world.You can take a chance on The Conscious Hotel.Some might love it while others might hate it.I personally depending on the time of day felt both.For the price and location you can't beat it,so this might tip the scales for some.Either way travel,explore,and as always be safe. I have some pictures from my stay here: http://atravelbugg.com/2012/01/13/the-conscious-hotel-vondelpark-amsterdam/", "Date": "January 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great location, Great front desk best deal!”", "Author": "Milan M", "ReviewID": "UR123587482", "Content": "Traveled to Amsterdam with the family (2 young kids). wanted a nice hotel not to expensive that is not smack in the center of town. I could not be happier to stay at the Conscious Hotel Vondelpark! 10 minutes from the center, nice clean rooms, decent breakfast and best of all GREAT STAFF!!! helped with anything I needed or requested. I'm planning my trip to AMS again and hope to be able to get rooms at the this hotel.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“No coffee or tea facilities in room”", "Author": "Alichia58", "ReviewID": "UR123405399", "Content": "Good location, No.1 Tram stops right in from of hotel and takes you into the city centre. I requested a twin room but was given a double room. In the corridor outside our room was a dirty glass and spoon which was there for more than 24 hours. We had such a lovely time discovering Amsterdam that we only realised the next morning that the linen was quite badly stained. Staff were absolutely lovely, friendly and very helpful. Good location but very basic. Maybe just me, but I've never stayed in a hotel without coffee and tea facilities, even the youth hostels I've stayed in had coffee and tea facilities.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Belgium", "Title": "“Good, clean and spacious rooms”", "Author": "punitworld", "ReviewID": "UR123370542", "Content": "Stayed in this Hotel for one night and found this to be conveniently located in middle of restaurants. Very well maintained rooms that are clean, eco-friendly and reasonable sized. Also, staff is very very friendly and helps you to best they can. Hotel has a paid parking and some very good restaurants around. Hotel breakfast is ordinary. While all was good, one needs to keep in mind that pathways inside Hotel resemble a zig saw puzzle with you having open at least 5 doors and take 2 elevators (in your room is in Tower B)", "Date": "January 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bournemouth, United Kingdom", "Title": "“Wonderful”", "Author": "epj123", "ReviewID": "UR123098931", "Content": "We arrived very late due to airport issues and were greeted warmly by the reception team and offered a drink straight away â€“ perfect. The rooms are great, small but functional. All a very interesting hotel, being green etc makes it have some quirky and amusing features â€“ plants growing out of the wall in the bar being one of them. Breakfast was great. No frills or fuss. Excellent.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“simple and good”", "Author": "frostie9999", "ReviewID": "UR122918953", "Content": "Hi, this is prefect, simple to get to from the airport, 4 euro. Smack bang in all the museums, twenty min walk into town or five mins on the number 5 tram tickets from reception. Staff very friendly and the hotel very clean. Would I stay again? YES. Done the red light, done the Anne frank museum I personally would go on the last day because it is very emotional and you do not want to be walking around Amsterdam thinking of exactly what went on, you are on holiday costs 8-euro book online to avoid ques but a most see. Went into a cafe as well and what ever you do just get one and share it, or else you will be in bed at eight, bad times. enjoy your stay hopefully i will be back", "Date": "January 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "England", "Title": "“Good! a lovely place to stay and affordable”", "Author": "anbil", "ReviewID": "UR122020027", "Content": "A great modern hotel with a recycling theme and very good price. room was lovely and nicely decorated.situated within easy reach of the centre of Amsterdam. staff were very friendly and helpful.would definately stop there again", "Date": "December 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Amslon", "Title": "“Patronising Boutique Chic”", "Author": "RobNIkAmslon", "ReviewID": "UR122017936", "Content": "Hi Travellers to amsterdam. I went early december 2011, booked online via booking.com and got accordding to websites a very good deal 320Euro for 4nights, premium room tower b. In high season you can pay almost double that and more at this hotel. Room was clean, comfortable but quite basic in design, it is basically breeze block room with a rubbish wall mural and grey industrial carpet, heavy black curtains but next to residential homes which can be quite noisy at times. LCD tv pathetic and way to small for a premium room but it did have all the channels and crstyal clear picture. Wifi throughout hotel(gratis) and work very well in my room. I asked for a double but got 2 singles squashed together. Always annoys me. Bathroom clean, good hot shower, with usual amenities but no tea/coffee making facilities. This hotel gimmick is an eco model, water saving features, heating, etc but I found the constant stickers next to plug points, in bathroom on the hotel doors quite condescending, patronising. Hotel is quite big, tower A Tower B with many rooms, if you get tower B be prepared for a good walk to your room and upstairs. Staff are good, quite funny and friendly, lobby, bar area very smart. Breakfast 13 euro. Just walk across the road to Albert Hein and breakfast is 2euro. I have lived in amsterdam on and off for 7yrs. Between homes I stay in Hotels, been in many a dutch hotel room at all times of the year and I speak Dutch. so when I say this is good bargain to be had in low season but in high season given its location(overtoom at the very bottom) long bike ride or walk to Leisdseplein I would not stay here. The choice is yours, 7/10 overall.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Thessaloniki, Greece", "Title": "“Good value of money....”", "Author": "JOETTA32", "ReviewID": "UR121893776", "Content": "Conscious Hotel Voldelpark is a cozy hotel, new, modern, clean but nothing is for free. Expensive parking charge, 22eur per day, breakfast 13 eur per person etc....but has a very stylish lobby area, very friendly and warm for coffee. The room coud be a little more bigger. The bathroom has enough space. Very convenient to the public transport, about 20 minutes walking from the centre but if you travel by car, believe this is a big problem in Amsterdam!", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Southern California", "Title": "“Good! Simple & affordable with some style”", "Author": "Solaster", "ReviewID": "UR121858764", "Content": "I picked this hotel for the price - it was the cheapest hotel I could find last minute on a 5 night trip to Amsterdam in December 2011. It is a budget hotel; simple amenities in the room and a slightly out of the way location. However, it is styled very nicely, so it stills feels fun & like you're on vacation. In addition, the staff is very nice. My husband and I like to walk, and even in typical Dutch winter weather found the walk from the hotel to various sights and Central Station enjoyable and not too time consuming. I imagine in nice weather it would be down right pleasant. The breakfast in the hotel is quite good and not too expensive; the first morning we did not have the breakfast and walked quite far before we found a suitable spot and probably paid the same amount in the end; so the next four mornings we ate at the hotel. It would be a nice addition to the breakfast if hot chocolate was available! There is a small bar in the lobby where drinks can be ordered at any time; we had hot chocolate or drinks late every night after hoofing it back from Central Station. The bed was good - but the pillow are of the awful neck breaking variety I hate and often find in hotels . . . so I'm beginning to think maybe it is just me and most people love these huge pillows. This hotel could make a few small additions to add to the budget appeal of it's accommodations; a mini fridge and kettle would be awesome, allowing guests to take advantage of nearby groceries and affordable take-out spots to save money. I would pay a little extra for an \"enhanced\" room that included these features. I would recommend this hotel!", "Date": "December 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Rio de Janeiro", "Title": "“Not the best location...”", "Author": "PriscilaO", "ReviewID": "UR121702739", "Content": "Location is one of the most important things for me when choosing a hotel, that's why I was a little disappointed with the Conscious Hotel. You can take a tram in front of the hotel to get to the center, but it's far away to go walking everyday. The hotel itself is good, nice breakfast, friendly staff and cool atmosphere, with an eco-friendly touch. The room is a little small.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Barcelona", "Title": "“3,8 km from center but well connected”", "Author": "traveler-art", "ReviewID": "UR121386211", "Content": "We stayed in this hotel for two nights. The maximum temperature outside was 10C and the first might we nearly froze. This hotel is eco-friendly and they shut down the heater when a host leaves. They never told us and as we got there at 7PM the room was cold. After that lesson learned, the following night was fine even if there's a constant air fan regenerating the room's air, as we were told, which didn't make it cozy enough. The standard rooms are smaller than expected specially the bathroom but it's clean and new. Staff is friendly even if asking for a room in tower B wasn't specially well received by the woman that checked us in: \"you're just guessing\" she replied when I asked her for a room looking towards the park (following other TripAdvisor tips)", "Date": "December 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "tpclapham", "Title": "“A Hotel Apart”", "Author": "tpclapham", "ReviewID": "UR121199247", "Content": "My only complaint about this hotel is that I only stayed for one night. I had an overnight layover and booked the hotel based on reviews from other travelers and wasn't disappointed. It is away from the hustle of the city center, but a tram to Leisdensplein and the main train station in the city center stops literally at the front door. The staff were incredibly helpful- I arrived a day early and had booked through Expedia and the front desk clerk allowed me to use the hotel phone to call Expedia to change my arrival date. I wish I could have stayed longer and explored the large park behind the property, but will be staying here again for sure the next time I visit Amsterdam. Note that the beds are twins, pushed together, as is the European style.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Grimsby, United Kingdom", "Title": "“brilliant hotel”", "Author": "bridget-x", "ReviewID": "UR121052837", "Content": "i stayed at conscious for a night on the 24th november 2011. the hotel is incredibly clean, smart and modern. i like that it had a eco-friendly twist, most things are recycled and the bathroom has little notes about little changes that have been made to help the environment. we didn't eat at the hotel but there are a few restaurants around. the staff were incredibly friendly and the beds were so comfy! i would stay here again.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“nice hotel”", "Author": "rogerioprolo", "ReviewID": "UR121022637", "Content": "Just came back from a two night stay at the Conscious Hotel Vondelpark, and was quite happy with it. The rooms are a decent size, the bed was big and comfortable, if I can complain about something it would be he oversized pillows, but having said that if a pillow is over one inch high it's oversized to me. Toilet was nice and clean, however a door, or curtain, on the shower box would be nice. Room and toilet were clean, but the wall needed a lick of paint, as it was full of marks. Staff was always friendly and happy to help. Did not have breakfast, thought 10euro per person was a bit overpriced. It's a bit far from the centre, but the tram that takes you there stops right in front of the hotel, but do yourself a favour and walk through Vondelpark. All in all a good hotel for the price, would recommend.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Very nice and cozy hotel”", "Author": "Parismast", "ReviewID": "UR120905262", "Content": "I spent 5 days there and it was awesome!i went with my girlfriend and we had a great time!The hotel is brand new!the rooms are clean but they could be a little more spacious!Comfortable beds,wifi free for every customer!A minor disadvantage is that there was no refrigerator!Great environment though and great people working there!Conscious hotel is one of my favorites!Good job guys!", "Date": "November 22, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Some staff let this hotel down.”", "Author": "Tom906", "ReviewID": "UR120864222", "Content": "First i'll start with a positive. The rooms look as they do on the website and place is stylish - quite trendy if that floats your boat. However if you sctratch under the surface in my opinion its a little style over sustance. There are some lovely staff there in particular the female staff who seemed warm and genuinely welcoming. The one thing that massively let this place down was a male member of staff who seemed like he wanted to be elsewhere and unfortunately he left a final and lasting impression on the hotel. He seemed to work during the night (maybe that was his problem). The bar is open until 2pm which is great. However being served by someone eating a sandwich whilst chatting to another member of his team is not so great. I felt like an inconvenience. Also this person needs to take note of the following - when a customer books a shuttlebus to the airport its not because its highly necessary. Our shuttlebus that was booked did not turn up so we were a little worried about making our flight. He just shrugged his shoulders and said 'sometimes they don't show up' - NOT GOOD ENOUGH. He was not bothered at all and then asked if i wanted him to call the shuttlebus company up and order another life to the airport. Ludicrous question. OF COURSE we did as we wanted to catch our flight home. I felt like asking him if he wanted me to call them!", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mountain View, California", "Title": "“Amazing stay”", "Author": "J_Kim32761", "ReviewID": "UR120345643", "Content": "Please do yourself a favor and stay here! My boyfriend and I had the most amazing stay here. The rooms are exactly as the pictures. Most places don't look like the pictures seen on their websites but this place looks exactly like it. It's clean, location is perfect, modern, and super environmentally friendly. I wish I had stayed here longer. If we go back to Amsterdam, we'll definitely stay here.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Swindon, United Kingdom", "Title": "“Very environment conscious !!”", "Author": "Shabster81", "ReviewID": "UR120166189", "Content": "Great place and truly environment conscious. Stayed in standard rooms and the experience overall was good. Service was also great and it is just around 15-20 mins tram ride from the main train station. The tram actually stops right in front of the hotel so very convenient to travel around", "Date": "November 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berlin, Germany", "Title": "“I doff my hat to the staff and the pizza joint next door...”", "Author": "Andy H", "ReviewID": "UR119624497", "Content": "I stayed at the Conscious Hotel Vondelpark for some relatively extended periods during August and September of this year. Almost 7 weeks in total. That's a long time, if something is irking you after a few days, you can guarantee you'll want to smash it after a few weeks. I felt no such urges. During this time, I moved around a few of the rooms, usually down to availability (point of note there, avoid the broadcasting seminar in August, Amsterdam sells out, even with rooms at triple rate), so tried out deluxe as well as standard rooms. If I'm honest, I wouldn't bother with the luxury rooms, unless you're partial to bathing (they have a bath and much bigger bathrooms) or need to dock your ipad/iphone constantly. So, my humble... Downsides? well, yes, I guess trekking to tower B was a bit of a pain, but only a minor twinge in the buttock rather than an utter bum ache. Yes, the rooms can be quite small, which can make things a bit tight with a big suitcase (but I still managed that and a Brompton folding bicycle) and yes, my god, the bathroom lighting is harsh, I was quite relieved upon my return to Berlin that I didn't look THAT bad. I suppose you could see the location as less than central, but personally, I'd rather be away from the Liedseplein and much closer to Vondelpark, which is truly beautiful. The tram is actually pretty quick, or you can walk into the centre in 20 mins, or even better, get a bike! More upsides, well firstly the staff, I think sometimes it's easy to misunderstand different cultures as rude, when in fact, they're just a little more efficient with their language than the English. Iâ€™m still learning to deal with this in Berlin. That said, I didn't find the staff at Vondelpark brusque at all. On every occasion they were very helpful, very well natured and quite willing to share some fun with you. On the occasions I was staring down the possibility of sofa surfing they did everything they could to find me rooms at good rates (I was on a budget, as my company, is well... 'me' so it comes out of my pocket). I found the rooms very clean, simple, stylish and exactly as described. Everything you need, but nothing else. No coffee making facilities, no small bottles of shower gel, no massive TV, then they never promised me these. I got all I was looking for, a clean, modern room, a comfortable bed and the Beeb. Any problems I had (an overflowing shower tray at one point) were dealt with quickly and efficiently. All-in-all my stay was very pleasant, I would definitely stay there again, in fact I look forward to it! I miss being greeted personally... and I wouldn't hesitate to recommend it to others. BTW - Iâ€™d also recommend 'De Pizzabakkers' next door, some of the best pizza Iâ€™ve ever had, better than Rome and Naples in my humble. So good in fact, that by the end of my stay, it wasn't just the hotel that was greeting me personally...", "Date": "October 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Norwich, England, United Kingdom", "Title": "“Great beds, shame about the location”", "Author": "Shillinglaw", "ReviewID": "UR119495380", "Content": "We stayed here for five nights in October 2011, It has been over 25 years since I had been to Amsterdam and boy has it changed. No, not the architecture but the vibe of the place - too many people, too many bikes, dirty with no respite from the relentless 'tourist experience' - but that's all another story. We had clear instruction to get the No 1 tram and this worked very well. Quite a fun and frantic ride and it dropped us right outside the hotel. We were in the rear 'B' block which was quiet and relativly peaceful. Quite a trek to our room No 220 on the first floor - everytime my partner was drawn down a different corridor but I have a better sense of direction so we didn't get lost! The room was small - there really isn't anyway to dress that up! We did like it though. The bed was very comfortable - memory foam, which I had never slept on before but we both agreed it was great. Not quite enough surfaces to put your stuff but one manages, the trendy little upsidedown hanging plant was cool but it did leave a tiny, sticky puddle on the chair underneath it - good job we didn't leave a clean white shirt on the chair! It was quite a warm spell and it was frustrating we couldn't open the window fully - just a small ventilation gap - other windows looked as if they were open fully - but not ours. The tiny shower room looked stylish but had it's own problems - the shower absolutly soaked the floor due to the open nature of the tray, very little space to put stuff and pretty hash lighting when using the mirror but, as I said, looked fab - form over function, depends what you look for in life. The green and recycled credentials I found slightly bogus - we are into that at home so it's not that we don't care - it just felt a little patronising but really it's a sensible and profitable way to run a hotel. The extractor fan in the shower room was on constantly when the card key was in the slot, the wash basin took too much water to fill, the dual flush on the WC was 'quirky'. Don't get me wrong, we did like the hotel but, like nearly every hotel we have ever stayed at, they are experts in self promotion and promise so much and deliver a very average experience. We didn't have breakfast - too expensive for what they were offering, we took our mini kettle and bought bakery items and had a jolly little breakfast for very little money in our room. The lobby seating area was not a big draw for us although we did like the 'green, living wall'. Reception staff were rather cold but efficient - we had nothing to do with them really but if we had a problem I guess they would have delt with it. Our soap and shower gel both ran out and they had to be told as cleaners didn't replace them - basic stuff I would have thought but going back to all the hype they make about themselves.... I wouldn't stay here again, not because it was dreadful but I've had the experience of the Concious Hotel and if I went again I would want to be nearer to the city. The tram was essential to get around but the novelty did wear off. It wasn't really very feasible to go back to the hotel throughout the day. We are in our 50's and are by no means lacking in energy but Amsterdam is exhausting and there is nowhere to step aside from the buzz and chill for half an hour - public seating is minimal. A hotel on one of the canal streets would have meant we could have popped back for a couple of hours before going out again. We were leaving our hotel at about 11am and getting back at about 9pm - that's a long day in a fast moving city. Hope this helps you with your trip to Amsterdam - have a great time, it is a place to experience at least once!", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Good value hotel in Amsterdam”", "Author": "SonjaLondon", "ReviewID": "UR119292635", "Content": "I booked this hotel at the last minute before a business trip and got a good rate online. On arrival, the reception team were very friendly and welcoming. They were very helpful in giving me directions and advice on public transport/traffic. My room was in the 2nd tower so a little ways to go but fine. It was clean and large with a comfortable bed. There weren't the usual extras like mini-fridges etc but I really didn't need them. There was no door or curtain on the shower so be mindful of where to place your floor towel! The hotel itself was interesting. There were lots of eco-friendly products used in the rooms from the soap and showerhead to the sheets and type of lighting used. I didn't have any problems using the internet in the lobby or in my room. Breakfast was quite standard. I hear there are cheaper options if you go outside but I didn't have time to explore that. One tip - take the hotel's free map on offer. The tourist office in the city charges for them!", "Date": "October 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Exactly what I had expected”", "Author": "MrsEJ", "ReviewID": "UR118514020", "Content": "I stayed at this hotel in August 2011 for 3 nights. Based on other travellers reviews and their website it was exactly what I expected: clean, modern, friendly, a little far out of the center (I would highly recommend a bike). The rooms were not large but I was pleasantly surprised by the size of the bathroom. I would stay here again, not for a romantic or family holiday but was totally adequate for my purpose - hanging out for a few days en route elsewhere and getting in some shopping and exploring by bicycle.", "Date": "September 23, 2011"}, {"Ratings": {"Location": "3", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Hong Kong, China", "Title": "“Good value for an Amsterdam stay”", "Author": "Eud", "ReviewID": "UR118294631", "Content": "I stayed for a five day stretch and this was a nice hotel. The first room I had was underwhelming - in the second tower and at the back with views of the neighbours. The internet was also misbehaving (supposedly was being upgraded so there was no free wireless). I was fortunate and upgraded to a top floor room in the first tower and it was very nice. That room initially couldn't get the net, then it could, then it couldn't but on the last day had no problems (maybe the internet upgrade got completed). The rooms are small - its Europe. The top floor room I was upgraded to though had its own outdoor patio - unfortunately there were no chairs on it but you could move ones out from your room. The showers were nice and you didn't notice that they were lower flow heads. The hotel has a 'groovy' feel with labels on items telling you how they were environmentally friendly. The downside of the top floor room is that the elevator only goes to 5 so you have to bring your luggage up two flights of stairs. There is a small bar/snack/coffee area in the lobby that always had some people kicking around even late into the night for a nice vibe - I suspect part of the reason though was that the net was down in a lot of areas and the lobby was the only place to get a connection. Parking is a good deal here (well, for Amsterdam, its still expensive but only about half what you would pay elsewhere). The downside is that to get in is a bit of a pain - all I could figure you could do was to get to it around back and then run around to the front of the hotel to get them to let you in (and there is no sign to tell you where it is so the first time I was past it and had to go around again as its a one way street around the back). If there was a buzzer to the front desk I was not made aware of it. The spots are tight as well, a large car would be a challenge for parking; doable but a challenge. The location is good - its near the park obviously and the tram is immediately outfront for quickly getting over to the center of town. There are a couple restaurants nearby that are good as well (the baked pizza place about a minute away was good value and tasty). There is a breakfast buffet that I didn't try available for 10 euro a day if you pre book which is probably not bad value considering what things generally cost elsewhere. One review mentioned the beds feeling lumpy/curved and I would concur, they were a bit odd. Its like they have a curve for you to sink into rather than a normal bed feel (that is flat). I am not sure if that is by design or if its just wonky/old beds - I suspect by design and you may or may not like it. I wasn't a huge fan of the sensation. All said though, a nice hotel in a good location that is good value for the money.", "Date": "September 19, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Something different”", "Author": "Austraveller49", "ReviewID": "UR118215402", "Content": "What a great surprise to find a hotel where some fun and practical ideas are actually carried through. The quality of the rooms was very good with all the facilities except for coffee and tea in the room. Size was a little disappointing but manageable. The service from the front door to check out was excellent and everyone very helpful. Breakfast at an extra but reasonable cost was excellent with a good range. Location is a bit of a walk to the â€˜action centreâ€™. Our only problem was with the â€œdoorlessâ€� shower as we battled to control the water overspray onto the bathroom floor and subsequently soaked a bathmat everyday. We would stay here again.", "Date": "September 16, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Berlin, Germany", "Title": "“nature near oasis in crowded city”", "Author": "pureperspective", "ReviewID": "UR118192819", "Content": "I have been in quite a few hotels in amsterdam and now for the first time I want to share my experiences because I am so pleased with the hotel: First of all it is an \"ORGANIC\" forward thinking hotel meaning everything is designed to support the health and balance of you the visitor and the planet. the entire hotel has a very friendly \"theme\" and tries to interact with the visitor thanks to little stickers here and there pointing out fun facts about the interior. We personally enjoyed these little fun reminders and all in all I think it speaks of the ATTENTION TO DETAIL this hotel offers. Maybe it is exaggerated to say it has a soul but there is a good feeling in the air. The rooms we have been in are very comfortable because of the nature near feeling. Furniture carpets towels chairs table, everything feels kind of natural, safe and most important the interior feels like there is QUALITY to it! Not cheaply mass produced stuff but like a true DESIGN HOTEL. and for everybody with allergies or somebody who enjoys chemical free atmosphere this is the place to go. The climax of this overall VERY NATURAL FEEL is definitely the SUPERB BED. One of the best hotel beds I have been in. So soft and comfortable with a huge blanket. Everything was VERY CLEAN and WELL MAINTAINED. So the most important tasks are perfectly fulfilled: excellent bed for a great refreshing sleep, very pleasant atmosphere and good location. Another great plus is the VERY GOOD BREAKFAST with a LOT OF CHOICE. also very healthy food, of course all organic. and the asking price of 13 Euros for the breakfast is really good considering the QUALITY of the food. Service was VERY FRIENDLY and capable of fulfilling all of our requests. They have a nice little unique comfortable \"nature\" lobby where you can buy cool organic/conscious gifts. The place of the hotel is great because it is just 5 min from the biggest and (I think nicest ) park in amsterdam the vondelpark. tram is near just in front of the hotel so there is an excellent connection.There is a raw food restaurant just 5 min away and a lot of other really good places to enjoy good food! only probable down site: If you are somebody who enjoys sitting all day in your hotel room I would choose another hotel because during daytime you have the street in front of your window which is not really annoying but could be a distraction when you want absolute silence. but in this case you shouldn't choose any city hotel at all. in the night there is no real noise and the excellent beds make up for it BIG time. All in all we will DEFINITELY COME BACK whenever we are here. The youthful stylish progressive atmosphere is just excellent. Everybody who enjoys organic or a healthy lifestyle should choose this over any other hotel in amsterdam. Also for this price point I think it is impossible to find any other hotel with such a comfortable and clean atmosphere.", "Date": "September 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "West Palm Beach", "Title": "“No complaints.”", "Author": "fyrmun37", "ReviewID": "UR117972914", "Content": "Clean, good value, courteous staff. Convenient as it was right at a #1 tram stop.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "2", "Service": "4"}, "AuthorLocation": "", "Title": "“Can be found a better hotel for the same money”", "Author": "rovas", "ReviewID": "UR117784333", "Content": "Let's start with the good things. The hotel is in a nice neighborhood near the center of Amsterdam. Moving to the city center is easy tram stop is opposite the entrance. Premium rooms are clean and large enough. The beds are comfortable, according to our criteria. The rest: Foolish design. Our room had a bathroom with a large excess space, in contrast, small wardrobe and no mini bar. As part of the hotel called \"tower B\" has no WiFi, although in web site they write that there is one. Watching how the lobby is filled nightly with people trying to use the internet, I can assume that the situation was not better in other parts of the hotel.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Cologne, Germany", "Title": "“Going green never felt better”", "Author": "Plino", "ReviewID": "UR117768655", "Content": "We stayed in September 2011 in this hotel which is very new (probably less than a year old). It is so new that google street does not show it. The concept is a green one; organic food, organic materials, responsible use of energy, recycling but do not be afraid it is so comfortable that you will probably think why this is not widespread. It is located on a few steps away from Vondelpark which is a real jogging paradise (i did not run but apparently everyone else did). The area is very nice and there are several restaurants very close. To get there with the car is very easy at least if your GPS is working well. It is not possible to park in the front of the hotel but you can drive around (first rigth) and follow the street to the parking entry in the back of the hotel; it is normally closed but you can at least leave the car there and go to the reception by foot. I recommend to reserve a parking slot because in Amsterdam is very difficult and expensive. To visit the city you can use the efficient public transport in Amsterdam (24/48/72 hours ticket) or rent a bike. The Hotel is located in front of a Tram stop. the hotel has a reception in the ground floor and two \"towers\" with rooms. The tower A is closer to the street and the tower B is closer to the Park. The size of the rooms is very pleasent, the bath is also roomy. As everything is still new you will not find anything to complain. The bed was so nice and the pillows too. We took the breakfast (10 â‚¬ p.p.) which is not bad if you consider that Amsterdam is expensive, the excellent quality of the ingrediants (bio products) and the fact that is a buffet with fresh coffee (Expresso, Capuchino etc.). If you only take a coup of coffee then it is too much. The design is very modern, with a lot of details and funny things.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent hotel would definately stay here again if we return to Amsterdam”", "Author": "sockman2", "ReviewID": "UR117646679", "Content": "When we first arrived we bought a travel card or their equivelent for the trams buses etc the trams run all over the city and it was a great way to travel around also as the hotel is a bit far to walk to and the tram stops right out side the hotel and leaves from right in front of the train station. We didn`t take up the offer of breakfast as we considered it expensive and there are plenty of restaurants to choose from. But the hotel its self was lovely clean and tidy the area around the hotel felt safe at anytime of day, and although the room was probably a bit on the small side it had everything we needed and was beautifully decorated.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Ottignies, Belgium", "Title": "“Good hotel, but needs some improuvment in management”", "Author": "rochlaurentprive", "ReviewID": "UR116789635", "Content": "Hi, We stayed in this hotel for one night in august 2011. The reservation was made on internet at a good rate (95 Eur for a premium room). The hotel is very nice. We liked the \"green\" conept. 2 days before arrival I called the hotel to book a parking place (22,5 EUR for 24h). It's cheaper than parking in the street. The parking is just under tower B of the hotel (back of the hotel). During this phone call they proposed me a room with a balcony as one was still available . When I checked in the room number was scratched on the reservation paper and replaced by another one. When I complained the receptionist discussed with his colleague saying in Dutch that I'ts not there fault if I did not received the room that I ASKED. Saddly for them I understand ducth and stopped them in the conversation to tell that I did not asked for the balcony room and that it had been proposed to me. The guy just said it's collegue should'nt have offered me something thet they did not had. I think they gave the room to someone else and that's all. Not very proffessional. Check in was a real pain. I never spent that much time checking in... 15 min (not including the balcony room argue). We paid 10 Eur per person for the breakfast wich is good but nothing special. Choices of food is just ok compared to many other breafast buffet I had in simillar category hotels. Renewing of the buffet (espacially the hot part: sausages and eggs) is very slow also. The room are nice. Nice bathroom, Good bedroom size. very minimalist but we liked it. No airco (but we knew it). I don't found the bed very good. It's not bad but it's a bit soft. I preffer stronger bed. The soap in the douche was empty. They put dispenser wich is \"green\" but they should at least be sure that it's been refilled. Not a bad experience... but could have been better.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Practical â€“ and in-your-face ecofriendly, in a good way!”", "Author": "LassiK", "ReviewID": "UR116713639", "Content": "A stylish hotel with lots of character: it does a good job explaining to you why things are the way they are (eco-friendly), even if the badges are quite in-your-face at times. I can't complain: slept like a saint knowing my stay isn't as hard on the planet as nights in many other hotels. Add to that the nice location next to Vondelpark (although I heartily recommend having bikes to travel around town!), and it's worth picking. For breakfast though go for the Caffe Oslo on the other side of the canal.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Leeds", "Title": "“Very reasonably priced, convenient and comfortable hotel”", "Author": "oh1984", "ReviewID": "UR116368890", "Content": "My girlfriend and I stayed here in July after we booked to visit Amsterdam for a long weekend. The hotel is very tastefully fitted out, with a contemporary 'green' theme, and the rooms, although fairly basic, provide everything you need for a weekend getaway. The bed was really comfortable, and I especially liked the double shower in the bathroom. The hotel is located a small distance outside of the main hub of the city centre, but in my opinion this was a blessing in disguise as it meant we got a peaceful sleep each night. There is also the Vondelpark not too far away. The number 1 tram stop is directly outside the main entrance and this runs more or less every 10 minutes into the city centre. You can buy 24/48/72 hour travel cards so this makes the tram a fairly cheap way to get around. We couldn't fault the hotel staff, all very friendly and willing to help out with any questions or queries.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Modern, charming, easy tram access--we'll be back again”", "Author": "beautifultree12", "ReviewID": "UR116312817", "Content": "It was no surprise that this great hotel had great reviews. I was drawn to the eco part and the price. Not right in the centre of things, but with a tram pass, you can easily get anywhere in no time. We got to Amsterdam (jet-lagged) in the morning and were told we couldn't check-in until 2pm. So we had lunch and wandered around a bit, enjoying what there is to enjoy in Amsterday, and returned at 2 to be told we could check in then or wait an additional 30 minutes for an upgraded room. Very glad we waited. We were on the top floor with access to our own private balcony. Beautiful. My only complaint was that there was no door or curtain to the shower which left quite a wet mess after bathing. Otherwise--great! If you are a night owl, there isn't a lot to do in vondelpark after about 10pm, and be careful to catch the last tram back or you'' be stucking walking or shelling out for a cab. Enjoy your stay.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "west yorkshire", "Title": "“Wouldn't stay here again”", "Author": "bigjezzer", "ReviewID": "UR116012546", "Content": "Our first trip to Amsterdam, so we didn't know the ropes. The hotel was handy enough, just a 10 mins tram trip into the hustle and bustle and there were two very friendly bars within 400 yards. For a hotel that prides itself on it's green and eco policies, we thought they let themselves down a bit, especially with the flat bottomed sink in the bathroom that required a lot of hot water in it before we could wash and shave. Lighting in the room was overkill for many different moods, and used a lot of electricity if one couldn't decide on a mood and had the lot on! The room was OK for an overnight stay, but anything longer means one is struggling for drawer space to put folded clothes - because there isn't any! But our main gripe was the lack of tea and coffee making facilities in the room, our only option being to use the 24/7 bar at E2.20 for a tea! That's certainly not the way all hotels do it in Amsterdam because we checked. That meant we had to use the lift down and up five floors, so a lot of electricity wasted there too. At E100+ a night room rate, the help yourself breakfast also wasn't up to much, with people often waiting for hot food to appear. CafFe Oslo just over the canal did a great plateful for half the price. Not somewhere we would stay again, but we want to go back to Amsterdam, so maybe we should be prepared to pay a bit more next time.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Nice staff, great location”", "Author": "Anne123456789", "ReviewID": "UR115976566", "Content": "The hotel is located a few steps from all Amsterdam major attractions, few tourists around! The room are confortable and well equiped. Bathrooms are moderns and functional", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "3"}, "AuthorLocation": "London", "Title": "“Trendy eco-friendly hotel, far from the hustle and bustle”", "Author": "panoskaran", "ReviewID": "UR115968612", "Content": "My wife and I spent a weekend in this hotel. This was actually our second visit. Design is very trendy and original. Warm, clean and \"boutique\" feeling. Rooms are not very large, but that is common in Amsterdam. The location is a bit out of the centre, but it is ideal for someone that wants to enjoy Amsterdam, without all the craziness of the centre. The tram stop is exactly in front of the hotel and the trams are very regular (every 5-6 minutes). Some of the staff could be friendlier, but that is also a common occurrence in the Netherlands. We will stay there again.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "2.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Liege, Belgium", "Title": "“Looks good, but it's not !”", "Author": "Leodium", "ReviewID": "UR115957260", "Content": "The whole hotel is based on the \"green\" attitude (meaning it's cheaper for them to run because green = cheap = an excuse if it's not too nice). There is no air conditioning, meaning the hotel is completely unusable during the summer months. It was 30Â°C in the room ! The mattress was quite strange, even in the premium room. Premium is only a name because the room was very small and really nothing special. The wifi coverage is just bad, in my case, only half of the room had a signal. The only positive point was the bathroom. The breakfast is bellow average, although the coffee was great. Conclusion : it's not extremely bad, but i will not go there again.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Would stay here again.”", "Author": "nekeyah", "ReviewID": "UR115657457", "Content": "A trendy eco aware hotel. Room quiet as they gave us one away from the street. Clean and well appointed room, if a little small. Bed comfortable. Aircon worked. Twin towers which necessitated two lifts and a corridor but not really any problem. Situated on a busy street with plenty of restaurants around, and near a large park. Staff extremely friendly and helpful. Breakfast a little sparse. They had no cornflakes, but did have gluten free bread which was a plus. Free internet which worked well. Would stay here again.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Reading, Pennsylvania", "Title": "“We'd stay here again”", "Author": "jenksoccer21", "ReviewID": "UR115544361", "Content": "Pros: -big open shower w/ great water pressure -nice staff -yummy organic breakfast buffet (10 Euro extra a person) -across the street from the tram -\"green\" hotel -not near the loud touristy areas -comfortable bed -trendy-looking room Cons: -no air conditioning -not near a lot of the sights (however, we wanted to walk everywhere...we could have taken the tram to get places faster, but chose not to....but sometimes it would have been nice to just walk out & be close to where we needed to go) -too far from other possibly cheaper breakfast locations to eat anywhere but the hotel (we like to eat right when we get up) -very uncomfortable pillows All in all, we'd stay here again. The price was right.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Funky, cool, comfortable, convenient and brilliant value.”", "Author": "Skyros2001", "ReviewID": "UR115519430", "Content": "The hotel is brand new with the kind of low-key style that the Dutch do brilliantly. The public area downstairs is like a funky living room with free WiFi and an airy cafe. The whole place is full of personality with quirky design touches and staff who come across as real people not automatons who've had all their humanity trained out of them. Our room was small, impeccably clean and quiet with hilarious wording on the door! Iit had the most comfortable bed we have ever slept in. Seriously. The shower was pretty special too and the notices reminding you how green the hotel is and asking you to think about saving water and towels are witty and light-hearted. Tram Number 1 is incredibly frequent and stops right outside the front door so we could be on Prinsengracht in a couple of minutes and the lovely Vondelpark was a minute's walk away so we could stroll across to the Van Gogh Museum. We had a brilliant weekend. Highlights were the amazing and innovative Envy Restaurant on Prinsengracht, an afternoon wandering around the Negen Straatjes and a long leisurely breakfast at the hotel. (Love the way the Dutch turn breakfast into a proper meal!) We'll definitely be back to Amsterdam and the Conscious Hotel.", "Date": "July 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Excellent value quirky hotel”", "Author": "55jim", "ReviewID": "UR115272075", "Content": "This hotel met all our expectations. It was immaculately clean, the bedroom was comfortable with a generous sized bathroom. Particularly liked the large shower. Very impressed with the reception staff who were very helpful, polite and showed great patience. Car parking arrangements were excellent. Very handy hotel bike and scooter hire.", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Norway", "Title": "“Clean, eco friendly, no luxury”", "Author": "EGHT", "ReviewID": "UR115258789", "Content": "On the plus side: The hotel staff is friendly, the rooms are quiet, free internet, parking (at a charge, but a luxury in amsterdam), comfy bed. On the negative: A bit to many of: \"Becuase we're an eco friendly hotel we do not have this and that\", they are a bit to basic for the price they charge, ten minute tram ride to the city. I would possibly return, but compared to what they hype themselves up to be on their website I was a bit disapointed.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Doha, Qatar", "Title": "“Clean with green consciousness”", "Author": "Directeur0", "ReviewID": "UR115190984", "Content": "Besides cleanliness, you have the convenience of nearby Vondelpark for running, biking, etc. The tram #1 is outside the door although a relaxing walk through Vondelpark leads to the museum district. If you need services, across the street and to the right, you'll find everything from hairstyle to grocery. Nice pubs and restaurants are in the neighborhood although the 10 euro extra for the organic breakfast is worth it.", "Date": "July 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Average”", "Author": "ptang09", "ReviewID": "UR115088271", "Content": "Although this hotel claims to be in the \"city centre\", it's really not. The tram is right outside the hotel which is very convenient, but by no means is it IN the city centre. The rooms were clean, but don't count on having a warm shower. The water goes from hot to cold throughout the 3 days we stayed. There's always this vacuuming sound going on throughout the night. At first we thought they were cleaning, but it doesn't stop. There's no restaurant in the hotel, and not many restaurants were appealing to us on Overtoom, so we walked all the way to city centre/ took the tram to grab a bite. I would say it's not the greatest value for your money considering you're paying more than 100 euros per night, but if you want something clean in amsterdam, Conscious Hotel is not a bad choice. Also, the price you pay on the website is BEFORE tax. They charge you the tax upon arrival and although the email says \"Tax Included---......... no\"...which we found to be very sneaky!!! so beware to pay an extra 10% on top of the price you're already paying on the website!!", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Good night sleep”", "Author": "USESTATE", "ReviewID": "UR114958898", "Content": "I stayed 2 nights at this hotel with my wife. Overall I would recommend this hotel. We had a very comfortable king size bed, and got the best sleep we have had in Europe. The hotel room is not to small with a good sized bathroom. To get to the hotel, just jump on the tram from central line (number 1 tram). The number one tram passes right by the hotel (on your left), you can not miss it. You could walk or bike from the hotel to any where, the hotel provides bike rental (24 hrs for I think 10 euro), but it does run out quick. Vondel park is located approx 30 second walk from the hotel. The staff was very knowledgable about Amsterdam and answered all of our questions. When it comes to getting back to the airport, make sure you have coins to pay for the train. We took the tram three stops lefts of the hotel, where we could of jumped on the train to the airport. while at the train stop we realized it did not except our credit cards, and only took coins (about 5.50 euros for 2 one way tickets). We ended up taking a 30 euro cab ride from the train station. You dont need to take a shuttle or taxi, save money and take the train to tram stop (save money). If you are visiting for several days buy a two day tram pass at the central station, if not you pay about 2.10 euros one way. Free internet in room. Only negative things about the hotel is it got a little loud at night, i would suggest a garden view room to keep the noise down, but all hotel are going to be this way. Also no ac, but it was cold when we where there (end of June). Also there is no free breakfast. Overall thumbs up.", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lincoln UK", "Title": "“Another Excellent Choice”", "Author": "lincolni", "ReviewID": "UR114831083", "Content": "The main criteria I had when choosing a hotel in Amsterdam was that there it must have a lift and be adjacent to a tram stop. Hotel Concious met the requirement and the price! I read reviews and was prepared for disadvantages listed but they proved to be few. No kettle in room so we took one. Reception staff were excellent and luggage could be left in a room for which you are given a left luggage label. Bed very comfortable, rooms good size and clean, large bathroom with open shower. Stayed for 5 nights at end of June and room could get warm at night. Location for us was excellent as No1 tram is right outside and is very frequent into the centre and one stop away in the other direction to catch No17 tram to Anne Frank House. Ter Brugge Pub is directly opposite which does meals after 6pm and next to it a Herring stall. A short walk brings you to other cafe/restaurant and Vondelpark. I would suggest this hotel is not for party animals. It is located the right side of town for the airport which took less than 20 mins in a taxi for â‚¬30 with taxireservering.nl On the whole Trip Advisor reports for the hotel are pretty accurate", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Oreland, Pennsylvania", "Title": "“I would stay again”", "Author": "ecniv", "ReviewID": "UR114825403", "Content": "The desk staff were very helpful; room was small but very clean. -odd hotel floor plan Public transit was very convenient - easy access to downtown or airport, or any part of the city [ recommend transit pass]. My room was very quiet - overall, a nice stay.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Auckland", "Title": "“Excellent simple hotel”", "Author": "SorrelliAuckland", "ReviewID": "UR114816180", "Content": "We stayed here with friends to visit Amsterdam for a few days. Very clean, well equipped and a bonus having car parking as part of the hotel - and yes, we did expect to pay for it. Very comforatable bed and good storage. Enjoyed being able to sleep with a window open and still have a quiet room. Highly recommend", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“trendy hotel in a non-touristy neighborhood”", "Author": "ecdickinson", "ReviewID": "UR114713994", "Content": "My husband and I stayed here for two nights at the beginning of a European vacation. It is easy to reach the hotel using the 1 line tram from Centraal Station. The neighborhood is removed from most of the tourist locations and sight-seeing, a quiet residential area along the big park. We enjoyed walking through the Vondelpark every day to get over to the museums and seeing the beautiful houses along the way. Our room did not have A/C - apparently not all rooms do - and we were a little warm with the window open during the day (night was fine). The wireless is easy to access, the rooms are set up well, we couldn't hear any of our \"neighbors,\" and the bathroom was very modern and the provided toiletries great. The staff was extremely friendly and helpful. We enjoyed staying here for the two nights, then moving to another hotel in a different neighborhood at the end of our trip - you have to walk very far or take the train to get to other sight-seeing areas of the city, like Ann Frank's house.", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Stavanger, Norway", "Title": "“Quiet location, but not very central”", "Author": "fasttravellers", "ReviewID": "UR114648966", "Content": "This is a nice and clean hotel, we might consider staying at again. It is enviormental friendly, in a funny way; stickers and messages popped up everywhere with info about this and that. We only stayed there for one night, and the bed was FANTASTIC! The room was nice and clean. Really liked the interior, especially the wallpaper. The only thing that was a bit negative was that when we arrived, we had two huge siutcases with us. Our room was located in \"b tower \", and it was some hassle getting there,...switching elevators,...manouvering through small hallways.,...at least we think they could have offered us some help. Breakfast was very good, but no bacon though...,boyfriend so disappointed ;) The hotel is located outside the city centre, near the beautiful Vondelpark...", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Munich, Germany", "Title": "“Convenient Hotel for Seeing Amsterdam”", "Author": "GeorgeMunich", "ReviewID": "UR114617286", "Content": "This hotel features modern dÃ©cor and comfortable beds. The staff is friendly and cheerful and the rooms are quiet; we heard absolutely no sound from other rooms. The hotel is conveniently located on the number 1 tramline, which takes you directly to the historical centre and all major attractions. It also backs onto the Vondelpark, Amsterdamâ€™s favourite park and is within walking distance of the Leidseplein restaurant district and two major museums , also on the tram line, Rijksmuseum and Van Gogh Museum. Parking in Amsterdam is expensive, at 3-4 Euros per hour and almost impossible to find, so the hotelâ€™s garage, while it seems expensive, is a reasonable price. They will arrange bike rentals for you. Hotel breakfasts in Amsterdam are also very expensive. We enjoyed the Oslo cafÃ© across the street and over the bridge from the hotel for breakfast at a reasonable price. We took both the â€œ100 Treasuresâ€� canal tour and the 3 hour Yellow Bike Tour. Both are informative and enjoyable and highly recommended. The Canal tour starts across the street from the central train station and the yellow bike tour starts 500 metres from Dam Square .We also can recommend Abyssinia restaurant, on Overtoom Street a few minuteâ€™s walk from the hotel, for an enjoyable evening of African food in a cosy atmosphere. A good day trip from Amsterdam is to go to Central train station and walk through it to the sea side bus area and buy a â€œWaterland Ticketâ€� from the driver on an Arriva Bus, for 9 Euros. You can get off in the charming cheese village of Edam in about 45 minutes and from there after looking around you can use your ticket again to take another Arriva bus to Volendam (10 minutes), which is a touristy seaport. From there, for 5 Euros, you can take the Marken express ferryboat (30 minutes) and enjoy being on the sea for a while. The used-to-be-island has bike rentals, walking paths and interesting architecture. From there, you can use your Waterland Ticket again, to take a bus back to Amsterdam central train station.", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Maastricht, The Netherlands", "Title": "“Best budget lodgings in Amsterdam”", "Author": "DaveH-ExPat", "ReviewID": "UR114201982", "Content": "The Conscious Hotel (Vondelpark) is a wonderful budget hotel located adjacent to central Amsterdam, with a tram stop outside giving easy access to the city. It is located on a main street running parallel to the Vondelpark, one of the main green spaces in the city and perfect for jogging, cycling, or picnicking. There is a friendly lobby with windowsills for reading and tables for talking, served by a small bar with drinks and snacks. Check-in is adjacent and the staff was helpful and quick (despite having to work around a changeover in computer systems). Rooms are modern and compact, yet comfortable and complete (we found no difference between the basic and deluxe rooms in size or style). The wall murals stand bright against the minimalist black and white of the rest of the room, but it works. The double bed is well sized and firm, there is a workspace (although the free wifi was weak outside the lobby), there is local cable TV, a small refrigerator, and an efficient bathroom with open shower stall. I didnâ€™t find as many restaurants within walking distance as others have indicated, and would recommend taking the tram into town to eat. The hotel serves a buffet breakfast but it is expensive (although coffee and tea is free). Itâ€™s probably better to take the tram into the town center to eat. The light afternoon snacks and evening drinks are good, though, and there are local pannekoeken and cafÃ© restaurants nearby for later in the day. Overall, this is an outstanding value for money in the city, with good location and fresh, new facilities. Recommended!", "Date": "June 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Leicester", "Title": "“Eco & excellent”", "Author": "thewidds", "ReviewID": "UR113198837", "Content": "We stayed for 2 nights in an upgraded double. It was excellent, the bathroom superb and possibly had the most comfortable bed I've ever slept in. The balcony was lovely especially as it was 30 degrees!! Would recommend this hotel and will be going back. The tram stops outside the door and all in all the hotel is in a superb location.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tilburg, The Netherlands", "Title": "“perfect location and friendly staff”", "Author": "bododewit", "ReviewID": "UR111629732", "Content": "excellent location to discover Amsterdam, next to Vondelpark, parking and rental bikes from hotel were very practical, good beds, very friendly personnel....!", "Date": "June 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Champaign, Illinois", "Title": "“Amazing Hotel!”", "Author": "RuthEllenThomas", "ReviewID": "UR110905090", "Content": "This hotel was amazing and we can't say enough great things about it! Upon arrival, the staff were friendly and helpful and apologized that the lift only goes to the 5th floor and our room as on the sixth floor. This was not an issue! Not at all! One takes the lift to the 5th floor and it's only about twelve steps to our room. We had a rooftop terrace! Amazing views! The room was perfect for our needs--the size was perfect. Our first nght we stopped at a small market and then enjoyed chesse, fruit, bread and wine with lovely sunset views. On the website, you'll see what looks like a mural in the lobby--it's not a mural of greenery--it is actually an entire wall that has greenery growing out from it. The number 1 tram stops right outside the hotel--just mind your step to avoid getting hit by a cyclist! Whether you are a seasoned traveler to Amsterdam of this is your first time, you can't go wrong with the Conscious Hotel Vondelpark! They offer breakfast--I reviewed the \"restaurant\" as excellent. They also have a bar in the lobby with excellent service.", "Date": "June 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Toronto", "Title": "“Great for a one night stay!”", "Author": "LDV15", "ReviewID": "UR110718279", "Content": "We just finished our one night stay at this hotel and we enjoyed it very much. Conveniently located right in front of the tram platform in which a 24 hour tram pass allowed us to explore the city easily. Room was very clean but more pillows would have been more comfortable. No idea how to use the soap dispensers and was too inconvenient to ask, esp at the actual moment. No blowdryer and frankly not many tools to offer but good for one night stay! Front staff was very delightful.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Spotless eco-hotel in great city!!”", "Author": "Yeahbaby81", "ReviewID": "UR110685766", "Content": "We stayed in the Conscious hotel Vondelpark for 3 nights in May and I must say this is one of the best hotels in Amsterdam! Located right next to the Vondelpark (the weather was great!), excellent organic breakfast and great staff! For an extra â‚¬10 we got the room on the topfloor which had a spacious roofterrace! The hotel is located in a quiet area, but there are still many nice restaurants and bars around. The last day we decided to rent an electric scooter at the hotel and we regret that we didn't do that sooner! A scooter (or bike but we are lazy) really is the best way to get around in Amsterdam, even though there is a tramstop right in front of the hotel. Would definately stay again!", "Date": "May 31, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "LA", "Title": "“Worst hotel EVER!!!”", "Author": "LaGila", "ReviewID": "UR109501844", "Content": "My wife and I were in Amsterdam for a week and we got back a few days ago. Amsterdam was great, but this hotel ruined a big part of the experience and we really regretted reserving it. the worst thing was definitely the bed. Oh my god, what a horrible bed!!! when we were lying on the mattress, it would sink in the middle to form a hole, so the whole night we slept in the most uncomfortable position and in the morning we got up with such backaches which lasted all day long, and it was like that for the whole week!!! The room was cleaned very poorly and the sheets were not replaced even when we put the sign that states \"make me clean again\" which the hotel provides. we had to pay extra taxes above what we paid when we ordered at hotels.com. The hotel is located in a god-forsaken neighborhood and there's nothing around it, no restaurants, no cafes, not even a small supermarket to buy things for the room. The structure of the hotel is weird, and we had to take 2 elevators + walk a corridor + going through 5 heavy doors to get to our room, every time!!! It was awful and we will never stay in this hotel again, even if we have to pay twice for another hotel. It's just not worth it.", "Date": "May 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Haifa, Israel", "Title": "“Very clean hotel, convenient location (though a bit far away from the Canal Ring)”", "Author": "sergof", "ReviewID": "UR109106864", "Content": "First, this hotel is very clean. Extremely clean. Obsessively clean, I would say. It is impractical to reach the hotel by foot from the area of main toursit attractions (~20 mins walk from Leidseplein), however, Tram 1 will take you to the hotel front in ~10 minutes. Get yourself a 24/48/72/96 hr public transportation card and you will be set. The rooms are bigger that an average Amsterdam hotel for an equivalent price level. Breakfast was OK, bu do not expect anything extraordinary. One drawback we suffered from is a lack of a curtain or a shielding plastic protecting the shower in the bathroom, which resulted in a completely wet floor after every shower we took. Maybe it's an environmental thing but that's definitely wrong. The staff is super friendly. Overall, we were very happy with our choice and definitely recommend this nice hotel to the others.", "Date": "May 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Pleasant stay”", "Author": "Pinkposhisland", "ReviewID": "UR108879064", "Content": "Friendly staffs, helpful n cheerful Clean n new furbished room Love the shower Love the Eco friendly concept Tram station in front of the hotel Very convenience. It is close to both city center n airport. Breakfast is fantastic. Especially love the cheese n salami!", "Date": "May 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic in every way”", "Author": "SBnHV", "ReviewID": "UR107542396", "Content": "Great value, great location, great service, clean and neat rooms, with very comfy bed, and the best thing was the breakfast. Had a lovely stay at this hotel. Only downside is probably the confusing layout, but we ended up making a game of trying to find the right way to the elevator.", "Date": "May 9, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Decent hotel but way overpriced”", "Author": "lordnelso", "ReviewID": "UR106807162", "Content": "The hotel itself was good, but the value for money was terrible. For the amount we payed (~120 euros a night) we got a basic room with no tea making facilities (tea was available at the bar, but for a price!), no breakfast, unhelpful night staff and faulty key cards. Its a shame really, because the place was decent enough and most of the staff were really friendly. I'd say if it was about half the price I would have been really pleased with it, but when you pay through the nose you expect something more than a trendily decorated Travelodge....", "Date": "May 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“Quirky clean hotel in good location (bring own hairdryer)”", "Author": "NicolaGail", "ReviewID": "UR106224754", "Content": "The hotel is on Tram Line 01. Do not get a taxi from the train station, its a complete waste of money as the tram stop is literally outside the front door of the hotel. Located on the outskirts of Vondelpark, you can take a leisurely stroll through the very prettty park and be in the Museamplein within 15 minutes. There are some lovely coffeeshops en route. During our stay we took a slightly different route each day of our three day trip and took lots of photos of tulips, gorgeous riverbanks and the impressive fountain. Its location means you can be in Leidenplein within a 30 minute stroll or five minutes on the tram. The hotel itself is exceptionally clean, and the staff very friendly helpful and polite. Its an eco friendly hotel, and its for this reason I assume the rooms don't come with a hairdryer, you can borrow one but it takes a while. The breakfasts have simple choices but worth having.", "Date": "April 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Clean, green, and efficient!”", "Author": "indiehotel", "ReviewID": "UR105224577", "Content": "We are actually still here - and wanted to write this review whilst in situ to make sure I did not forget anything. This hotel is very convenient - admittedly not right in the centre, but good if you want to avoid the bustle and ensure a good night sleep. It has very hip decor, with lots of reminders everywhere about its green philosophy which runs through everything. The room is clean and air conditioned, with a good sized bathroom and a fanstastic shower, shower gel and soap provided. There is also free wi-fi, hence my being able to do this review and all other travel related business conveniently. The staff are multilingual and very helpful - we had a problem with our safe, which was sorted out without any hassle. As for the food, we have not had breakfast here so cannot comment on that, but we did use the bar and they serve a good range of wines and beers. The location is great too as it is right on the No.1 tramline which takes you speedily into the central canal ring, so by being a bit out of the way you do not miss out. There are a good few restaurants and bars on Overtoom itself if you need to stay local at the beginning and end of your trip - we arrived quite late on Thursday and had a delicious meal in a bistro down the road populated by locals but with a menu in English and a helpful waitress. I would recommend this hotel very highly, it is clean and comfortable, good value, has a good philosophy, helpful staff, and is in a good location.", "Date": "April 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "uk", "Title": "“Environmental hotel - not that great”", "Author": "kidhead", "ReviewID": "UR104137998", "Content": "Very clean and tidy hotel, breakfast was very poor not much selection & didn't taste very fresh for the price, good location, rooms are a little basic for the price there was no hair dryer, tea/coffee facilities in the room,have stayed in cheaper hotels with better facilities. Overall a basic hotel but a tad over priced but still cheaper than a lot of hotels in Amsterdam", "Date": "April 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Going Green”", "Author": "bobmel", "ReviewID": "UR103215776", "Content": "Cool concept hotel. We had top floor room on street with terrace. Elevator did not go to the top floor so we had a one floor walkup. Room would be better if it was a little bigger and terrace a little smaller. Service was friendly but not great and some people did not seem to know too much about the hotel or the area. For example, the front desk should know where the recycling bins are in a green hotel and if there is a laundry in the area. The location was good if you did not mind taking the trolley outside of the main city center. Restaurants in the area within walking distance were a little sparse. Bed was comfortable. Breakfast good but expensive. Internet good and lobby was comfortable. Overall we liked the hotel but the staff did not really have their act together. An issue arose after our departure when our credit card was charged over $300 without any notice. Upon calling we were informed the charge was to pay for a broken chair in our room (which we knew nothing about). After a few email exchanges the hotel manager graciously agreed to reverse this charge and was going to investigate what happened.", "Date": "April 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Bristol", "Title": "“Fab hotel!!!”", "Author": "DirtyStinker", "ReviewID": "UR102045785", "Content": "This hotel is lovely: modern, clean and funky! We spent 3 nights here and loved the quirkiness of the hotel, as well as the small (but perfectly formed) room. The bathroom was very chic with a great shower. The bathroom was a really good size! The only moan is that there was a whirring noise in the room constantly - caused by the fan in the bathroom. This was most annoying when trying to sleep at night!!! The number 1 tram stops immediately outside... And I also vouch for the amazing Pizza & Prosecco restaurant next door: delicious and excellent service!", "Date": "March 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "South Staffs", "Title": "“Decent hotel ,good value and not a bad location”", "Author": "Russell1973", "ReviewID": "UR101852659", "Content": "Good value hotel which provides a pleasant stay and a decent base to explore. The museum district is only ten minutes walk and thirty minutes walk to the RLD Trams outside the hotel are frequent if you can work out which door to get on! Few good eateries near the hotel including pizza restaurant next door, nice bar opposite in the corner. If you are looking to see the city on the hop give Mikes Bike Tour a go, great fun a good way to see Amsterdam", "Date": "March 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hertforshire, UK", "Title": "“Good value, clean modern hotel.”", "Author": "Eurotraveller58", "ReviewID": "UR101339760", "Content": "Good clean hotel, with good staff on reception. Located in a quiet part of town with the number 1 tram stop directly outside the hotel. This runs through most of the busy parts of town and ends at Central station. We were asked if we wanted a quiet room and took this option, our room was in a secondary block linked to the main part of the hotel by a 'walkway' bridge. Being in the main block would havbe been a little closer to reception/bar/breakfast room and didn't appear to be any noisier than the 'quiet' rooms. Was offered breakfast at a 'special offer' price of 10 euros, but was poor value. If I stayed again (which I would) I'd buy a coffee and a pastry at the bar for half the price. If you write review text, it should be at least 50 characters, otherwise only your ratings will count.", "Date": "March 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Curacao", "Title": "“Clean, cozy and fair priced”", "Author": "Nanookh", "ReviewID": "UR100287995", "Content": "I needed to stay for just one night and was surprised by the price/quality. The room was clean as was the bathroom/toilet. The bed was good (not too hard, and not too soft) and for â‚¬ 59.00 very neatly priced.", "Date": "March 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ireland", "Title": "“Pleasant stay in a clean, bright hotel right on the tram line.”", "Author": "DP2K", "ReviewID": "UR100261106", "Content": "Hi, we stayed in the this hotel for a short holiday to Amsterdam. The hotel is about 15 mins by tram (No.1) to the city centre so is reasonably convenient. It is a new hotel with clean and well laid out rooms, which were a little on the small side. I recommend booking a room in a high floor as we did so the traffic/tram noises don't disturb. I would also suggest to the hotel that they produce instructions on how to dial reception - we had to dial out to speak to downstairs! Otherwise, would recommend this hotel to any future customer.", "Date": "March 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Quite Good”", "Author": "23betty", "ReviewID": "UR99121642", "Content": "We only stayed for one night in this hotel. On the positive side, we liked the green styling and theme, the hotel was quite cosy in the reception/bar area and the room was very clean if a little basic. No tea/coffee making but drinks available in reception. I hadn't brought a hairdryer or adapter plug and reception were quick to provide them when I asked. The bathroom was also exceptionally clean with a shower but no bath. Breakfast was an additional cost and wasn't very exciting so I would go out for breakfast if we stayed again. On the downside, it was a little further out of the city than we anticipated, although easy to get to by tram. Also, the member of reception staff on duty in the morning was very unhelpful and refused to print out our return flight boarding passes or help in any way which meant we had to spend an hour finding an internet cafe. I can understand this isn't always possible but her attitude was very off putting and left a bad impression.", "Date": "March 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent”", "Author": "humphjon", "ReviewID": "UR98346918", "Content": "Clean, quiet comfortable. Right on the 1 tram less than 15min from Central Amstedam. (also possible to get 17 to Anne Franks nearby) Staff were welcoming and the room was comrfortable and felt like a much more pricey hotel. Definatly recomend this hotel.", "Date": "February 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Lovely, clean, and eco-friendly”", "Author": "A_Dangerfield", "ReviewID": "UR97504498", "Content": "We stayed in Conscious for 3 nights, and really enjoyed it. The room was spotless, bright and airy. The bed is gigantic and so comfortable. The shower didn't have a curtain or door, but the extractor was effective so the bathroom dried quickly. The shower itself was lovely (and used 30% less water apparently, not that I noticed!). Couldn't fault it.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Albuquerque, New Mexico", "Title": "“This is simply the cutest, most original, lovely hotel!”", "Author": "osaruby", "ReviewID": "UR97319539", "Content": "I travelled to Amsterdam this winter with my mom and stayed at Conscious Vondelpark. We loved the hotel from the minute we walked in the door. The design is unique, modern, and artsy-- suited to our tastes exactly. I loved the green plant wall in the lobby and the adorable signs throughout the hotel. The beds were incredibly comfortable (most comfortable bed I've slept in in a while!) and the rooms clean. One thing I will note, however, is that the hotel bar was out of most of the food listed on their (adorable) menu. So, if you're hungry in the afternoon or evening, go next door to the Pizza and Prosecco restaurant (it's awesome, good value, and simply delicious). Also GET the breakfast buffet at the hotel. It features all organic, yummy food. You can eat enough good, wholesome food at the breakfast to last you for most of the day. If you can, opt for a room on the 1st floor. We had a great room on the first floor, but the elecrticity was out in it, so we were moved to the 2nd floor. Our 2nd room was fine, totally cute as all of Conscious hotel is, but was not as spacious or pretty as our first room (and the view wasn't as good-- try to get a room at the back of the hotel). Also, the free Wifi was appreciated, but it didn't work in our 2nd room (it did in our 1st room). I think this had to do with the placement of our room. It wasn't an issue though, as I enjoyed using the computer in the common areas throughout the hotel and in the chic lobby. Stay here. You WILL NOT get a better deal in Amsterdam-- it is exactly my taste and I would (will) stay here again in a heartbeat.", "Date": "February 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Trendy & nice but not the best”", "Author": "londoner46", "ReviewID": "UR97314096", "Content": "The hotel itself is very trendy and modern, the room is clean with nice decorations. Upon arrival (at night) the staff were very nice and welcoming. I stayed for 3 nights and on my first night after a long travel to Amsterdam I experienced a bad night sleep thanks to the bathroom's extractor fan, it was too noisy (natural noise of air coming) even when the bathroom door was shut, I phoned the reception at midnight and asked if there's a way I can turn it off but told it's impossible, I tried to sleep again but at 2am I had enough of it and went down to the reception to ask the member of staff to come and experience at problem - he came and almost fixed it by turning the part of extractor fan, so eventually I went back to sleep at 2:30am which is not ideal if you want to wake up at 8:00 to explore the city. The \"Organic\" breakfast was OK but not great - there's not much to choose from especially if you're a vegetarian. Wish it would offer a more variety. The location is so so, but when you use tram no. 1 it takes less than 5 mins to get to the heart of Amsterdam and 15 mins to Central station. When I checked out the receptionist wasn't really nice, she gave me the feeling she is trying to get rid of me. Overall I enjoyed my stay in the hotel and love to come back in the future...", "Date": "February 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Fab room, very quirky”", "Author": "CharlySugs", "ReviewID": "UR97071172", "Content": "Room was lovely (white walls were a little marked in places!). Very quirky signs, loved the upside down plant!! Was very happy with it, the bed was fantastically comfy. Had a great view from the fourth floor. Wouldn't pay the 10 Euros for breakfast again though but that's mine and my husbands own personal opinions. We got dropped off at the Central Station - having never been to Amsterdam before we had no idea where to go so got a taxi - 19/20 Euros! There's the number 1 tram which drops you off right outside the hotel and you pay 7 Euros for 24 hours for the trams which'll take you anywhere. Takes a bit of getting used to. So from the station, get the number 1 tram. Can't really walk it, it'll take a while with big bags... Got to the vondelpaark, it was a lovely day when we went. I think going to this hotel let us see so much more than if we'd have stayed in one directly in the centre", "Date": "February 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Cheap, 'clean', good location from visionary dutch planeteers”", "Author": "BigDickSunday", "ReviewID": "UR96986113", "Content": "This place is a bargain. Pretty good location half way down vondelpark which would come into its own in summer. Opted for slightly more expensive room, though still very cheap, decent size and quite nicely decorated. Really nice reception/cafe area and a gym right next door. Two things 1) When I went into my room there were already folk in there. Bit awkward. Reception, who were very pleasant, came up and gave me a new room but failed to come up with an adequate explanation. Apparently it had 'never happened before'. 2) They clean the rooms with water only. I mean there is a place for being eco friendly and a place for blitzing away any residue left by previous feral guests. I'd opt for the latter. That said, I appreciate their eco mission and while it gave me the heebie jeebies it did seem pretty clean.", "Date": "February 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Salem, Oregon", "Title": "“Amazing, perfect, convenient”", "Author": "jmann23", "ReviewID": "UR96645491", "Content": "Such a nice hotel. Nice location, friendly, very English-oriented. Affordable. Small rooms but that's to be expected. Nicest bathroom I've ever had in a hotel. Great atmosphere, near public transportation (tram stop 25 ft from front door).", "Date": "February 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Shipley, UK", "Title": "“The best hotel I've ever stayed in in Amsterdam - I will definitely book here again!”", "Author": "KerryG47", "ReviewID": "UR96213490", "Content": "The tram stop for the number 1 tram is right outside the door, so the hotel is easy to get to. My room was in the front section of the hotel, not enormous but still spacious, very comfortable bed and a nice table and chairs by the huge window. My bathroom didn't have a bath, but the walk-in shower was lovely. The bed is very comfortable, plenty of pillows for lounging, with more and an extra blanket in the wardrobe - I slept very well. Flat-screen TV with lots of channels, Dutch and English. The Vondelpark is just round the corner, excellent for walking and running, and the Oud-West and Oud-Zuid areas are fun to explore. The staff were friendly and helpful, the bar/coffee area was a nice place to relax and watch the world go by. The hotel feels very secure - you need your electronic room key to get past the lobby - and the room was very quiet.", "Date": "February 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Newcastle", "Title": "“Clean, Beautiful and the amazingly comfortable bed! Book it.”", "Author": "chemicachemica", "ReviewID": "UR96178893", "Content": "We were visiting Amsterdam for the first time for one night for my partners birthday. I booked the hotel as it had good reviews here and to be honest it was cheap. I dont think I could fault the hotel on anything. The staff were polite and helpful, the rooms were clean, nicely decorated and genuinely had the comfiest bed I've ever slept on. The hotel was slightly furtherout of the city center than we had first thought but it is literally one street away from the Vondelpark which makes it actually a lovely walk back to the center. It's close to the main museums and plenty of restaurants and shops. As we're not really into going out and were completely exhausted by the nighttime we were there I cant really judge how well it's situated for clubs or bars but I did find that our room [in Tower B] was very quiet on a night time. I didnt realise until we started walking to the room but the hotel is actually two 'tower' buildings connected by an enclosed walkway. Eeverything is very well sign posted trhough so still nice and easy to get arounf the hotel and find your room and if anything I think this may be an added bonus as when we arrived we were offered the choice of either a front tower room witha street view or a back toweer room which would be quieter. All in all a lovely hotel well worth the [more than reasonable] price. Also well done for the environmental concept of the hotel which was more than followed through without ever feeling skimped on or preaching.", "Date": "February 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Perfect modern hotel!”", "Author": "CheenJ", "ReviewID": "UR94127240", "Content": "This hotel is fantastic, a little out of town but purchasing a 24hr bus, tram and train ticket for â‚¬7, the location was not a problem. It's about a 15minute tram journey, or a 35min walk to the centre. The rooms are spot on, clean, modern, spacious and basic. Rooms have a flat screen and an iPod dock. Bathroom shower is large and hot. The beds are comfortable, however if your not a fan of memory foam you may want to remove the topper. I personally love them. The hotel staff we very friendly and helpful. We purchased breakfast upon arriving for an additional â‚¬10 each. Its your typical continental breakfast, with various eggs to offer. We certainly got our money's worth. Plan on staying here again,", "Date": "January 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Clean, comfortable, accomodating. Great hotel!”", "Author": "sarahsarah22", "ReviewID": "UR92441364", "Content": "We booked the hotel online, unsure of what reality would hold for us, and were extremely relieved and pleased when we walked into the lobby. Perfect place to stay for two 30-somethings on a holiday! Besides being affordable, they may have the most comfortable beds in the world, its super clean and comfortable, and they were very accomodating when almost everything on our trip went wrong (lost luggage, food poisoning, locked safe that refused to open and give us our euros back, etc). Fantastic service from Tim especially, wonderful bartender and host! The tram is right outside the door, market and pharmacy just up the street, and the Vondelpark right beside. Also, perfect for those that dont want to stay right downtown with all the young kids. Very mature hotel, we'll go back for sure.", "Date": "January 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Wonderful stay, great Tim and it felt classy as hell !”", "Author": "MasterMing", "ReviewID": "UR91913700", "Content": "This was a great opportunity to wind down after a couple days of partyin in Amsterdam. Tim was the dude workin in the night and the staff and other guests were so friendly. He was able to spend the night workin away and also entertaining us with good food, drinks and enjoyable fun. I had a super early flight and tim provided a sandwich as well as a tea for me. Across the street is a nice pub that it was moreso locals which was great because I was able to meet some dutch speakers who also of course spoke english like most of the locals. Down the street is Vondelpark, and its quite beautiful out there. All in all, everything ruled and it was a great deal. Many deals online and Amsterdam was so much fun!", "Date": "January 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Trendy, eco-friendly and good value”", "Author": "BernardZalm", "ReviewID": "UR91133621", "Content": "This hotel has a very nice, trendy atmosphere; the staff at the reception was very friendly. The hotel is eco-friendly (hence 'conscious') and reminds you of this via all kinds of messages which you will find everywhere (\"Hi, I'm your towel\") The standard room we booked was quite small, but clean and nicely decorated. The bathroom was fine; they don't give you small bottles of shampoo and soap, but dispensers with it are installed (more eco-friendly). There's also free wi-fi available on every floor. The breakfast was an additional charge of 13,50 EUR p.p. but was worth it; nice fresh products and good coffee.", "Date": "December 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Lovely clean hotel with excellent transport links and a comfy bed”", "Author": "fayemouse", "ReviewID": "UR89259345", "Content": "My boyfriend and I spent the weekend in Amsterdam recently and stayed at the Conscious Hotel Vondelpark. At first we were reluctant to stay in a 3* hotel but any apprehension disappeared as soon as we arrived. We had an excellent weekend away and I would not hesitate recommending this hotel to anyone. The room was warm (it was freezing outside!) clean and the staff were very helpful and provided lots of tips for in and around Amsterdam. The hotel itself is situated perfectly opposite a Line 1 (Tram line that takes you into the centre and to the central station in about 10 mins) Our room was situated on the same side as the main road and I must say, I didn't find it too loud or disruptive. The only thing I would advise is to be patient at breakfast time as this hotel is still finding its feet and it can be a little slow. I will definitely stay here again and intend on doing so when the weather heats up a bit!", "Date": "December 7, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Just Forget about it”", "Author": "vacati0nseeker", "ReviewID": "UR89194862", "Content": "They are very rude and not flexible. They made us pay for the trip even though we haven't stayed at the hotel because of an emergency.", "Date": "December 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "tel aviv", "Title": "“Wonderful hotel”", "Author": "ayait", "ReviewID": "UR87639561", "Content": "I stayed for 5 days. the hotel is beautifull , well Designed. a lot of small details which makes you belive that Someone really spent a lot of thought on how to make it a fun stay. the location is a bit problematic but there is a tram station one step from the hotel. it was a great experiance which made our trip great.", "Date": "November 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Little Hallingbury, United Kingdom", "Title": "“At last, something different in Amsterdam!”", "Author": "VirtualOli", "ReviewID": "UR87429235", "Content": "I opted for this hotel as it scored highly on TA, and I can see why. Good location, with a tram stop outside 10 minutes from Leidseplein. Really nice reception/cafe area, and good service. My room at the back of the hotel in B-Tower was square and spacious, with interesting upside down plants and nice lamps. Free internet was very fast. Large shower in the bathroom and very comfortable bed. A bit of outside noise at night, but not as much as I imagine the front of the hotel would have. The speech bubbles on the walls are a very nice touch - friendly and relaxing. Would not hesitate to book here next time I'm in Amsterdam.", "Date": "November 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Excellent place to stay”", "Author": "SIulian", "ReviewID": "UR85577864", "Content": "The location is excellent;just a few stops from Museum Quarter with the tram no.1. The room was clean and quiet.The bathroom was spotless,and there were lots of nice tips about the reasons why this hotel is eco-friendly.The reception stuff was very helpful;they gave us a city map and told us about the main attractions.Breakfast was good(i suppose all those things were organic). There also a safe deposit, but we could not make it work.There is free Wifi Internet all over the hotel. Overall, an excellent place to stay;I definitely recommend it .", "Date": "November 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great hotel, highly recommend!”", "Author": "potato2", "ReviewID": "UR85406015", "Content": "Just got back from a trip to Amsterdam with my sister and the hotel was excellent - clean and bright, friendly and helpful staff, nicely decorated and green too!!! Our room was on the top floor with great views over the city and two lovely balconies - one from the bedroom and another from the bathroom!! Think that this may be the only room in the hotel with the two balconies but even without those the room was excellent - really nice and light. Its in the Vondelpark area so not right in the middle of the city centre but the tram stop is directly outside and only takes about 10 minutes to get to the city centre. I think the hotel only opened recently so everything is really lovely. Before we booked our hotel we checked loads on the internet and this was one of the cheapest in its range, so great value for money too.", "Date": "October 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Palo Alto, California", "Title": "“Convenient location, nice rooms, but very noisy”", "Author": "hello143", "ReviewID": "UR85372465", "Content": "We stayed at this hotel for 4 nights. It is located a few bus stops from the museum square and downtown. I found this green hotel very modern and comfortable. If you stay here, don't forget to bring your hair shampoo, hair conditioner, and lotion. There is no hair dryer in the room, but you can borrow one by calling the front desk. Two things bothered me during my stay: The shower had no curtain or door, so there was always a puddle on the bathroom floor. The noise from next door neighbors slamming the door always startled me. When housekeeping clean the rooms next door, it sounded like they were throwing furniture around. I'm a lazy traveler and like to sleep in. It's impossible to have any peace after 9am. If you don't mind the noise, this hotel has a lot to offer.", "Date": "October 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Beware of over booking”", "Author": "carol_trower", "ReviewID": "UR85270320", "Content": "We had booked to stay in this new hotel for 3 nights but on arrival we were asked to take a seat in the hotels snack bar. When we asked if there was a problem we were told by the receptionist \"no\". One hour and a free drink later! we were told that we did not have a confirmed booking - even though we presented the paperwork confirming the booking. They eventually informed us they were fully booked and could not accomadate us. They blamed our travel agent and would not take the responsibilty for this over booking, even though their system must have allowed this to happen as we were certainly not the only ones in this position. After much negociation - they did find us a room for one night. and it was a great experience with comfortable beds/pillows/ large shower room and a great breakfast with healthy options. The staff were friendly but the reception staff lacked, confidence, experience and people training and were very slow at booking people in, with guests waiting 30 mins. or more whilst they tried to sort out their over booking problem. So our 3 night break turned into a hotel hopping experience being in a different hotel each night. We trust this is just a teething problem in which we were the unfortunate recepients - as this hotel was comfortable, good value with good access to the city centre.", "Date": "October 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Paris, France", "Title": "“Great experience, even better value, should be a four star!”", "Author": "JJofLA", "ReviewID": "UR85007380", "Content": "By far this is one of the best values amongst Amsterdam hotels. It should be a four star hotel based upon the hip design, the comfortable rooms and beds, the flat screen TVs, the clean bathrooms, the eco-friendly touches, just to name a few. The hotel was just renovated, so everything is quite new and nice. I highly recommend this hotel.", "Date": "October 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“feels good to enjoy and still contribute”", "Author": "ivo_tol", "ReviewID": "UR84467891", "Content": "all big parts make a bigger difference! i really enjoyed this hotel. being aware of doing something for a better world is so much better then trying to push it. as a designer the first thing i noticed where the pillows on the left side in the lobby. thumbs up for whomever thought of that. got my card key at the desk and then moved up for the room. first thing i always do is jump on the bed and have a 5 min powernap. if that feels good, the rest of the hotel is good. and it was. after a nap one needs a drink and i got served well at the bar. all in all a very nice hotel thats price wise is a bless. and leaving after the stay i can honestly say that i felt great.", "Date": "October 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Lovely hotel - cozy and relaxing environment.”", "Author": "Anne_Sark", "ReviewID": "UR84219984", "Content": "This hotel is a true gem - the lobby is very welcoming and cozy, a place to enjoy coffee/ a drink and have a chat. The rooms are light, love the graphics and the small witty environmental messages spread in the space. Will definitely recommend to friends and family.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amsterdam", "Title": "“Interesting & Comfortable Hotel”", "Author": "Grace_on_Holiday", "ReviewID": "UR84216324", "Content": "Great new hotel in Amsterdam. Love the contemporary and stylish design that is yet so sustainable and eco-friendly. The tram stops in front of the hotel for easy moving about in the city.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“great stay! lovely hotel!”", "Author": "sh2003", "ReviewID": "UR83962106", "Content": "We went to Amsterdam to have a small holiday. We came by car and booked a parking space at the hotel for â‚¬ 22.50 which was a really good deal compared to the rates on the street. The hotel interior is nicely decorated and the panorama window in the bar has very nice authentic pillows where we enjoyed an afternoon tea. Check-in was efficient even though it was the first day the hotel was open! The hotel is sustainable and has all kinds of organic snacks, which is a nice plus. The room itself (standard double) is small, but very comfy and quiet. The beds were heavenly and decorated with a nice pillow with an old map of the city. Wifi is available throughout the hotel and is free. The breakfastroom was very crouded but we were seated immediately and the buffet (organic aswell!!) was refilled timely and of good taste and variety. The tram (line 1) stops in front of the hotel and takes you to the Leidse square within minutes! All in all we enjoyed our stay in Amsterdam and the Conscious Hotel Vondelpark and will certainly book here again when we visit Amsterdam!", "Date": "October 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A great hotel, very good and nice rooms...”", "Author": "sfgarcia79", "ReviewID": "UR83778448", "Content": "A great hotel, very good and nice rooms, good bar and a perfect breakfast. It's the new pearl for Amsterdam.", "Date": "October 17, 2010"}], "HotelInfo": {"Name": "Conscious Hotel Vondelpark", "HotelURL": "/ShowUserReviews-g188590-d1879075-Reviews-Conscious_Hotel_Vondelpark-Amsterdam_Noord_Holland.html", "Price": "$127 - $244*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Overtoom 519-521</span>, <span class=\"locality\"><span property=\"v:locality\">Amsterdam</span> <span property=\"v:postal-code\">1054 LH</span></span>, <span class=\"country-name\" property=\"v:country-name\">The Netherlands</span> </span></span></address>", "HotelID": "1879075", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/5e/bc/65/premium-room.jpg"}}