{"Reviews": [{"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Buckinghamshire", "Title": "“Excellent hotel and great location”", "Author": "JerseyBean007", "ReviewID": "UR126289007", "Content": "Spacious and luxurious rooms with all the mod cons. Well located on Ave. George V. Easy walk to Champs Élysées and attractions. Staff very friendly and breakfast good.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Salonga, New York", "Title": "“Excellent hotel”", "Author": "Kitmin2010", "ReviewID": "UR125336246", "Content": "My husband and I just got back from staying at Hotel Fouquet last week. The service was spectcular and the food was excellent. They knew we were arriving early to Paris (6am) so by the time we got to the hotel within 5 mins we were brought to our upgraded room where we were escorted from the front desk and our luggage seconds behind us (they first asked if we prefer breakfast first). When we did arrive to our room our butler Charles was kind enough to explain what our amenties are in the grand room. We were upgrade from the Jr Suite to the Executive Jr Suite which basically is a better view and a better view we got. It overlooked the Champs Elysee and true to what I read the room was sound proof. Never once did we hear the noise from the street unless we opened our balcony doors. The room was always clean and our great mini bar was always stocked. The couple of afternoons we were in our room little treats were sent up which was really a nice thing to receive. We ate dinner one night at Fouquet and the food was excellent and the wine recommendation was the best red wine I ever had! We also got back late one evening and was a bit hungry and they were able to have Le Diane prepare us some delicious appetizers from their menu. Luckily that night they were open a bit later for another table so we were able to sit there and enjoy our treats and never once did they rush us. Their breakfast was also lovely and great choices. One morning I wasn't too hungry and they must've mistaken that for me not liking their food because they offered to make me something off the menu, it was so sweet of them to notice and ask. It was the first time in Europe for my husband and we have traveled to many places and I am so happy that this first experience will cause us to have many more in the future. Thank you again for the outstanding service. Special thanks to their conceirge staff, AMAZING! They helped us with so much even before we arrived to Paris, thank you! Maxim and Mauro were wonderful and so warm each time we saw them! I'm sure the other people at the front desk is as warm but it seemed like Maxim or Mauro were just always there to greet us. Hope to see them again! :)", "Date": "February 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“\" A Beautiful Hotel\"”", "Author": "Mary L", "ReviewID": "UR125321165", "Content": "I found the hotel on luxurygroup.com web site that I now use often. The hotel was all that the web site described it to be. The Hotel is elegant and beautiful. If you like to pamper your self you would be happy with this hotel. Loved the location right on Avenue George V. The staff was helpful and friendly. All around great stay.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“3rd stay at this gorgeous Hotel.”", "Author": "blueyloons", "ReviewID": "UR125124377", "Content": "My daughter and I had the pleasure of staying at Hotel Fouquet's Barriere, Paris for the 3rd time. The staff are extremely friendly, helpful and professional in every area of the Hotel. Our room was sumptuous in its decor and amenities. I particularly LOVE the complimentary bottle of Hermes perfume and complimentary mini-bar. Our room had the most magnificent outlook over the Champs Elysees thru ceiling to floor double glazed windows, which could be opened letting in the fresh air and wonderful sounds of Paris. In comparison to other 5 star hotels I have stayed in, through out the world, this is definitely my favourite! We will defiantly stay here again and again.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Excellent experience!!”", "Author": "Sarah21ny", "ReviewID": "UR125021610", "Content": "The breakfast was very nice with plenty of choice, great omelets and is available till 11, handy if you like a sleep in. Staff was very welcoming, helpful and polite. The staff all spoke English and was very pleasant and helpful. Our room was spacious and smart, and the whole place looks like it has just been completely refurnished. We booked the hotel after reading previous reviews and we were not disappointed. My only recommendation is that the hotel has more French movies, with English subtitles, to enjoy. Wi-Fi connectivity was free in the whole building. Printing facility was available at the front desk for absolutely free. I can't wait to come and stay here again. Excellent experience!!", "Date": "February 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Prague, the Czech Republic", "Title": "“High Level of Luxury”", "Author": "CzechTourist", "ReviewID": "UR124465019", "Content": "Spent a weekend in this hotel. Really enjoyed impressive interiors of the hotel. Service was OK but we expected something really special. Made a good deal throug membership in the leading hotels of the world. Were no so impressed by dining in associated restaurant - too touristic. Overall experience was very positive, will probably come back.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bruxelles, BE", "Title": "“Very congenial staff, excluding bar and spa!”", "Author": "Rj A", "ReviewID": "UR123435779", "Content": "A previous reviewer stated \"not relaxing\" re. Fouquet's. Prior to my visit I thought that comment odd, but I can understand it now. While stylish and edgy sometimes, the room chairs and couches are not designed for either long-term comfort or nestling with a good book (why nestle, why stay in your room with the heart of Paris right outside!?--you are right to ask!). However, the large suite bed was extremely comfortable if one wanted to coccoon. Butlers were helpful and most (except one gent) were unobtrusive. The cuisine was both fresh and delicious with much variety of choice. Spa reception was marred by staff at desk bungling appointments, assuming that people somehow never make sequential appts (so, if you booked a massage followed by foot reflexology--they repeated to me a number of times: \"you cannot have a foot massage and a regular massage at the same time\"-well, duh, you can say that again--and they did...). Fortunately, therapist intervened and both treatments were had (not consecutive, mind you!). A trip to the hotel bar was not altogether pleasant initially. I forgot to wear my Euroblacks and arrived in jeans (but black shirt) whereupon, thin blonde non-smiling lady asks: \"can I help you sir\"? Let's see, gentleman (I really am) walks into bar and hostess might optionally say: \"here for a drink or to eat--where would you like to sit?\". She was unable and after I stated I would like a drink, she was silent, gestured with her hand down the bar. I took off and was immediately intercepted by black (of course)-suited gentleman who said (guess what?) \"can I help you sir\"? At this point, I secured eye contact and said:\"I'm a guest at this hotel and I would like a drink\". He gave up and reluctantly seated me. I ordered my martini (deflected the \"dirty martini\" encouragement) and relaxed. At that point, I rather strategically took out my suite key and placed it on the table. Guess what? Service improved 100% with bartender coming over to inquire as to the correct amount of vermouth, etc. Waiters so much more soilicitous. I suspect I am making this more of a \"big deal\" than I politely should, but there was that strong whiff of anti-something. Nuff said. Overall, I would return because of location, cuisine, and concierge/reception/room service. (Laura will be grabbed soon as an assistant to some European President, I'm sure). Olivier, genuinely friendly and possessing just the right balance of sophistication and humor. Thanks Fouquet's, just a few \"bumps\" detailed as feedback that do not lower my rating of your fine hotel.", "Date": "January 22, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Amsterdam", "Title": "“Genuinely passionate in providing great service!”", "Author": "DeLeurope", "ReviewID": "UR123350523", "Content": "Just returned from a 3 night stay at this sublime hotel. From the moment you approach the front door you are greeted by a team of immaculately dressed doormen (and woman!) who guide you to the Front Desk where a team member awaits you to escort you directly up to your room whilst explaining all the hotel's facilities. The rooms are designed elegantly and the bathrooms are very comfortable with rain showers and bathtubs featuring televisions. In the morning a lavish breakfast buffet can be enjoyed where a team of people ensure you do not even have to refill your own glass since it is done for you before you even realize. The bar is also not to be missed. On all nights, there was a great vibe with consistently friendly service. Make sure to also check out the Spa - it's a true gem. Compliments to Juliette at Reception & her team! Cannot wait to go back.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“a real FIVE”", "Author": "88traveler_11", "ReviewID": "UR122637508", "Content": "You have not stayed in a 5 star hotel until Fouquet's Barriere. Stayed there for New Year's eve and we know that our 2012 would be a great year. First, we got upgraded to a higher level due to our unlimited membership with the leading hotel of the world. This is a membership to have if you travel a lot. You get guarantee upgrade, breakfast for two, free internet. If you stay 5 nights, you already get your membership paid for. Imagine getting an upgrade during a high season in a 5 star hotel on Champs Elysees. We got there about 2:30pm and check in time was 3:00pm, the manager was very embarassed that our room was not ready. He told his people that he was not happy about this and made it up to us by inviting us to have a drink up in the cafe. The room was moderned with two minibars and every things in the minibars are included and everythings mean many bottles of perrier and other sparkling water, sodas, juices, and M&M. there is a nespresso and a tea pot with teas from Tea Forte. We got a fruit basket, many chocolates from La Maison, and nightly chocolate on a turn down service. The room was clean and the heater was comfortable and quiet. There is a tv in the bathroom. the sound system was high quality. You can take a bath with classical music. They also give you a his and her Hermes products. There is a good size swimming pool with comfortable temperature and a slim trail where you walk against a current which was very hard and a good work out. The sauna and steamroom were very clean and nice. The locker is a little small but equipped with everything you need. There are complimentary tea, coffee, dry fruits and nuts available during your swim. There is a gym with treadmill and some sort of eliptical machines but we were so busy that we did not get a chance to try. there is also a power plate which is great for loosening your tired muscles. We did not have a chance to try the Le Diane because it was fulled on New Year's Eve and was not open during our stay. Food at the Fouquet was just ok but very expensive. Breakfast was wonderful. The juices were freshly squeezed. Best orange and grapefruit juices I ever had. We had the best time and will not stay in any hotel again. We have stayed in Le Meurice and Hotel de Crillion. Hotel de Crillion was old style and beautiful but the fact that you paid almost 1,000 euros per night and don't even give a bottled water during turn down was absurd. Le Meurice room was elegant but stuffy. The restaurant at Le Meurice was very special. I have to say that we love to stay at nice hotels. We always stay at Four Season, Ritz Carlton, Mandarin Oriental properties and Hotel Fouquet's is our top choice. One needs to stay here once to experience heaven on earth.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Heaven does not wait”", "Author": "Loire-Normandie", "ReviewID": "UR121363736", "Content": "Our stay was an absolute joy in luxury and pampering. The hotel is quite luxurious and its staff very helpful and courteous. Never mind the great location, our room was gorgeous, spacious and discreetly equipped with the latest high tech; when we encountered some problems with our internet connection, the IT people where very efficient. We had a delicious dinner at Fouquet's which has become, again, the darling of the stars. That night, I was delighted to see Roger Vadim, the great Film & Theater director..It was a first stay for us and we loved every minute of our stay.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nicosia, Cyprus", "Title": "“luxurious, unpretencious, great service and rooms!”", "Author": "Eva-cyprus", "ReviewID": "UR120277103", "Content": "This is a luxurious hotel in the heart of paris. on the expensive side i would say but worth it. The rooms are great. the bathrooms are wonderful. service is unique and very discreet. formal but yet friendly and not stuffy. food is very nice. breakfast is excellent.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“One amazing night”", "Author": "Romulo P", "ReviewID": "UR119691140", "Content": "Me and my wife spent onw night at the Fouquet's last October. It was the first day of our honeymoon so we would expect nothing less than perfect which, by the way, Fouquet's managed to deliver. Our room was huge (specially for a Parisian hotel) with perfect service. Location: Location is amazing for this hotel. At the corner of Champs-Elysee and George V it is close to numerous restaurants, boutiques and turistic points. Within 5-10 minutes walking you can reach the Arc de Triomphe or any great restaurant in the area. Concierge and service: Concierge was really helpful. We tried to book a room at a fancy restaurant that was full for that night. So I asked the concierge for any indications on good restaurants nearby and they had exactly what we neede for the ocasion, just perfect. Staff was also very helpful at all times. Room and amenities: All you need to be very confortable and relax. 2 Tvs (one in the bathroom), great bed, AC, huge closet, good desk with confortable chair, free internet... Just everything! I would sure be willing to come back to this place.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“This place is not for everyone.”", "Author": "Tim C", "ReviewID": "UR119631853", "Content": "My wife and I and our 6 month old baby were greeted by 7 people before we even saw our room. A representative met us at the airport gate and transferred us to our driver. Our driver was great and introduced us to Paris' neighbourhoods. Two people took our bags from our car and the front door man introduced us to not one but two concierege. And all before we even got to our room. Our room was upgraded. The linens and duvet were ironed. The shower pressure was awesome. The room was quiet and the mattress was of high quality. We had questions everyday about where to eat and what to do and the butler/concierge: had tickets to the Louvre, subway tickets, made reservations 30 minutes before a dinner on Saturday night, gave us a complimentary umbrella, booked our high speed rail tickets to Germany, suggested great wines, put a chocolate on our pillow, allowed us to live a couple of days way above our norm. They left us wanting for nothing.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Marietta, Georgia", "Title": "“FORMIDABLE !!!!!”", "Author": "ZETA333", "ReviewID": "UR119536497", "Content": "This property in my opinion is the best hotel that Paris has to offer. I have visited Paris numerous times and have stayed in the best 5 star luxury properties such as the Ritz Paris, Four Seasons, Hotel de Crillon ... This last visit was in celebration of my 50th Birthda, from the moment I arrived at the property, they treated me like royalty. Every member of the staff knew about my birthday, and wished me happy birthday at every turn. I was upgraded to a suite on the Champs which was breath-taking. We were provided with 24 hour butler service available to do whatever was needed for my comfort. I was provided a complimentary dinner at the world-renowed Fouquet's restaurant for a sumptuous birthday dinner. The piece de resistance was the butler bringing up chilled champagne and a birthday \"cake\" with sparkling candles. The hotel is elegantly decorated, ultra modern with the most intoxicating scented air in the foyer. The bed had luxurious sheets and duvet cover which made for the best sleep I have ever had in a hotel. The tv programming had 150 channels which even allowed me to catch up on NFL action . The hotel provided free passes to the Louvre Museum and booked reservations for touring the Eiffel tower without having to wait in line. As if this all was not enough, the general manager thanked me personally for staying at this property, which was a first for me. The location on the Champs is unbeatable, right in the center of the heart of Paris. For all of my trips to this magnificent city, this is wher I will be. I ABSOLUTELY recommend this hotel as the best of Paris!!!!!", "Date": "October 21, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Bedford, Canada", "Title": "“An Oasis In The Heart of Paris”", "Author": "DonnaS1951", "ReviewID": "UR118155073", "Content": "It was my friend's dream to celebrate her 60th Birthday in Paris on Sep 11, 2011. Paris was \"the light at the end of the tunnel\" which pulled her through a medical crisis and let the dream unfold. We spent considerable time researching luxury hotels and came upon Fouquet's Barriere and after viewing the hotel's video we knew this was a special hotel to celebrate this special birthday.When we arrived and walked through the entrance to reception with the sound of tinkling prisims we immediately felt the stresses of travel float away. The reception staff, and indeed all staff, were professional..with sincerity and kindness in their welcoming demeanour. The room was luxurious..food wonderful..many breakfasts eaten on the peaceful, serene terrace with attentive service from Miguel. The terrace was a restful haven after a day of sightseeing or shopping with the staff of the Lucien bar welcoming us \"home\". The Birthday Dinnner at Le Diane was exquisite and the hotel's gift of champagne and birthday cake was wonderfully generous and thoughful. Although personal butler service was experienced in other locations the attentiveness of Charles and Laura was unsurpassed. The hotel's location at the corner of George V and the Champs Elysees made lunching at Fouquet's sidewalk cafe an amazing place to watch Parisians and People of the world stroll by. We owe a special thanks to Monika who inspired the staff to live the dream with us. We became Ambassadors of Fouquet's Barriere and through our praise to new friends staying at the Four Seasons they are convinced that Fouquet's Barriere is were they will stay when next in Paris. Without a doubt Fouquet's Barriere will leave you with a golden memory of a lifetime. , a place where \"All staff know your Name\".", "Date": "September 15, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“A Tremendous First Time in Paris!”", "Author": "Troy B", "ReviewID": "UR117089320", "Content": "My wife and I stayed at Fouquetâ€™s for 6 nights in mid-July. It was our first time in Paris, and we did extensive research in advance. We travel high-end, and had narrowed our choices to Fouquetâ€™s, Four Seasons-George V, and Plaza Athenee. The three features that led us to choose Fouqetâ€™s were: (1) reviews noting how helpful the concierge staff was at Fouquetâ€™s, versus what seemed to be an approach at the other two where the concierges expected a more seasoned European traveler with fewer need for particularized recommendations and advanced planning; (2) the included breakfast buffet, which for Americans used to eating a large breakfast before full days of touring and sight-seeing was key, and would have added 100 euros to the daily rate at the Four Seasons and the Plaza, where neither have included breakfasts; and (3) the U-Spa. In sum, we were extremely pleased with our stay and experience at Fouquetâ€™s. A note on prices: none of the three hotels above are for the financially faint of heart. Itâ€™s all a matter of expectations. Iâ€™m sure there are 100â€™s of other great choices throughout Paris at every rate class. We landed on a junior suite for 1,070 euros/night. The rate at Four Seasons was equivalent, and the rate at the Plaza for an equivalent suite was approx. 1,300 euros. The room: our suite was gorgeous; larger than we expected. While the suites come with butler service, we could never find a way to use it without feeling pretentious and awkward. Huge bathroom, separate shower and full jacuzzi tub with flat screen TV over the tub. Welcome basket of fruit lasted all week, and the fully-stocked free mini fridge was great. Hotel food: we ate dinner at Fouquetâ€™s on our first night (Sunday). The food was great. We had lunch there another day. We indulged, and ate at two different Michelin-starred restaurants (Alain Ducasse and Pierre Gagnaire) over the course of the week, and at Jules Verne for my wifeâ€™s birthday. While Fouquetâ€™s food doesnâ€™t compare, I think we have a good foundation to evaluate it and you canâ€™t go wrong for solid brasserie food with a great people-watching spot on the Champs-Elysees. Concierge: we were really pleased with the genuine and non-pretentious help we received from the concierge staff, both before we arrived (they made our reservations at the three restaurants noted above, including getting us in my view the best window table at Jules Verne for my wifeâ€™s birthday dinner) and during our stay, with lunch recommendations and others. They even had our butler deliver a complimentary bottle of champagne and a large desert to our room on the night of my wifeâ€™s birthday. Unfortunately, we had just came back from a three-hour indulgent meal at Jules Verne, and could only taste one bite each, but it was the thought that counted. Negatives: there were only two â€œnegativesâ€� I can think of, and frankly they are minor issues. One was referenced in the most recent review, which is the cost of hotel-secured transportation to/from Orly, where we flew into. The cost was approx. 325 euro each way; we didnâ€™t know any better, so we paid. The transport was convenient, in a large Lexus sedan, but the cost was ridiculously high. Iâ€™m sure we could have secured similar arrangements for much lower cost, and will do so in the future. The other was an issue we had at check-in with one particular hotel desk clerk. We arrived in Paris from New York at 9 am on Sunday morning, and were at the hotel by 10 am. We didnâ€™t book an extra night, so we recognized that we might not get to check-in until later. Check-in is 3 pm, but we had a specific suite booked, and weâ€™ve never had to wait until check-in time at high-end hotels in Europe (or the US for that matter) when booking a suite. The first female clerk told us the room should be ready by noon. Between noon and 3 pm, a different male clerk kept putting us off, reminding me every time that check-in was 3 pm. I thought he was unfriendly and worried we were getting off to a bad start. At 2:40 pm we came back to the front desk for the third time, and he told us to sit in the waiting area. At 3:01 pm he came over and said the room was now ready. I think he was lying and decided to make us wait until 3 pm on the button to prove some point. It was obnoxious, and he seemed fake at every moment. We actually had another minor issue with the same clerk the day before we checked out. Because the room was not ready on Sunday until 3 pm, we had breakfast at the hotel while we waited. We then slept in on Monday morning and didnâ€™t use our free breakfast that day. To avoid the extra 100 euro charge (on a hotel bill of well more than 10,000 USD), we asked if our Monday breakfast could be applied to Sunday. He acted snooty and made me feel like we were asking for a free night or something. he made a big show of calling the General Manager, who quickly approved the credit. The whole process was distasteful for such a high-end hotel. I wish I had noted his name, as I would have separately emailed the Manager to complain about what I perceive as a lack of professionalism by this individual. This is my first ever review of a hotel on any website, so I hope itâ€™s not too long-winded. I was surprised that there is so little information about Fouquetâ€™s (the hotel) out there. I hope this helps.", "Date": "August 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Romantic, character, and lived up to already high expectations!”", "Author": "SSTHO", "ReviewID": "UR116581851", "Content": "Booked 3 nights with AMEX FHR. Had a great promotion on a stay 2 nights and received a 3rd night free. We were granted 2 set dinners to Fouquet's as part of the 4th amenity!! I was stunned and felt very well treated. It was a 140 Euro meal on the house. The hotel also gave us access to the Uspa on floor -1. If you look at the pictures of the Uspa, WYSIWYG. Beautiful pool area and fountains, jets and small circular wave trail and sauna, steam room, lots of sitting areas and free drinks, tea, etc. My wife and I spent a good 1.5hrs there and it was a highlight away from the city. Our room was beautiful. A unique design for a suite (#501) with a separate bathroom from the shower and sinks. An area for clothes, luggage, mini bar and safe. Oh - they stocked the mini bar well and everything was inclusive as well! The premium sound system integrated into the ceiling really stood out. Attention to details like premium teas and boutique chocolates rounded out the full on experience. Concierge and hotel staff were all exceptional. The breakfast was top notch with cheeses, charcuterie and smoked salmon. Again, everything was top notch. I found this to be a great value in Paris, but I can understand how many people would be shocked at these prices. Only item that irked me a little (I think someone mentioned it earlier on a review here) was the price of the car service: 170 Euros for MB S-class to the train station... I opted not to and we had an Audi A6 taxi. We got to the train station for under 20 Euros and in the same comfort as in an E-class that was offered to us at 130 Euros. It's an option I didn't take. We were at the patio for lunch on our last day. My wife was in the mood for a spaghetti carbonara and I asked her to request it and see what happens. The maitre D told her, \"we will make anything you want\". Yes, it is an expensive restaurant - but I must say that it was the best 41 Euros I've ever spent. It was a life changing spaghetti carbonara! Thank you for a wonderful stay! We did not want to leave!", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0", "Value": "1", "Service": "4"}, "AuthorLocation": "Sacramento, California", "Title": "“Fancy, but not a place where you can relax”", "Author": "MikeyR", "ReviewID": "UR116556706", "Content": "Whenever in Paris, I usually stay at the George V or Prince De Galle, since the location for both on Rue George V is excellent. This time, and at the recommendation of a fellow traveler, we stayed at the Hotel Fouquet's Barriere. First of all, I didn't know the hotel existed, I like their streetside cafe, as a Paris hallmark, and it is typical of the Champs street side cafes; pricey, snotty, but great for people watching. The hotel is heavily decorated, the rooms are well appointed, with some nice touches/gimmicks like the TV hidden in the mirror, cute Aladdin like slippers, etc.. The design and layout of the room is strange, the bathroom cubicle is by the room door, while the shower/basin/sink is by the beds at the other end of the room. So, after using the toilet, you have to walk across the room to wash your hands!! The walk-in closet, was a nice touch. Overall, the hotel is different, VERY PRICEY, but noisy, and has no charm whatsoever.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“Beautful Hotel!”", "Author": "r1ch12", "ReviewID": "UR116527170", "Content": "I've traveled extensively and always stay in 5 star hotels. Stayed here 4 nights and can honestly say this is one of the nicest hotels I have ever stayed in. From personalized butler service to incredible, modern decor of the rooms, I was just blown away. I booked through American Express Fine Hotels and Resorts, and they were offering 3 nights for 2 promo, so if you are an Amex holder, you may want to try them before booking through hotel site, etc. Also got free wifi and diner through Amex at their namesake restaurant. Great meal even though service was a tad slow. I will be staying here every time I visit Paris in the future!", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Fabulous hotel, service and location”", "Author": "lasinv01", "ReviewID": "UR116367716", "Content": "Returned to the hotel on holiday with my wife and two daughters and once again found the hotel and staff to be exceptional. The rooms are sizable, the spa and pool is first class and the bar and restaurant very good. The staff cannot do enough for you, a great stay, would highly recommend", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Riyadh, Saudi Arabia", "Title": "“we simply loved everything about this hotel <3”", "Author": "gwillmousa", "ReviewID": "UR116322411", "Content": "we usually stay at gorge cinq four seasons hotel , but this year we only found available rooms for one night so we had to change it and try something new and it was worth it <3 , the rooms were wide and luxury . the bathroom is as big as the room it also got a tv on the bathroom's wall , the minibar was for free which is great , the services was at the top (Y) the staff were so helpful and nice , we got complimentary chocolate and cakes every other day , the room services food was delicious , the location is awesome overall the hotel is a real 5 star hotel .", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Canada", "Title": "“What can one say?”", "Author": "materialboi", "ReviewID": "UR115972268", "Content": "A hotel of this caliber always has great amenities and fantastic suits but this hotel goes above the usual with it's attention to detail and customer service. The staff could not be more attentive... the personal butler was always available and no request was too small or too large for them to handle and always with a smile! We were instantly upgraded to a suite which had a fantastic balcony stretching the entire length of the room. The included mini bar (all complimentary and refilled daily with beverages of your choice) and the included breakfast were extremely nice touches! I would not hesitate coming back here agin and again! Location was fantastic for shopping and sight seeing and it was located right on the Georges V metro stop... very convenient! Fantastic stay!!", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Best kept secret in Paris !!!!”", "Author": "triptartine", "ReviewID": "UR115770316", "Content": "We had a wonderful time at the Fouquet's Location - Location - Location !!! The hotel is so well run. The room are exquisite with the expertise of a private butler ( S'il vous plait ) The Jardin interior is so lovely - (Un havre de paix in the middle of Paris) Over all The best address in Paris A boutique hotel at the level of a Palace Will certainly be back and will tell all my friends", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Outstanding, a real jewel in the heart of bustling Paris”", "Author": "Ritoune", "ReviewID": "UR115423310", "Content": "Unexpected luxury and calm, oasis like haven on the avenue Georges V and Champs-Elysees, surely one of the busiest and noisiest avenues of Paris. Welcome, amenities, service, cuisine, personal attention to detail: simply stellar. A palace with a human dimension, and extremely elegant and stylish (Jacques Garcia is the architect/designer). Can't wait to go back!", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Love it”", "Author": "YildizChoi", "ReviewID": "UR115420158", "Content": "Stayed in this fabulous hotel for 4 days in early July. 3rd floor I stayed. Greeted by the manager and then our butler. Extremely helpful and efficient concierge people. Big, nice room! I had stayed in another hotel just 100 or 200 meters away, more or less the same room rate. I must say Fouquet's Barriere beats that hotel in every aspects, especially the services provided. FB will sure be my choice in my next visit to Paris ( next year, I guess!). Just Love it! See you guys soon!", "Date": "July 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "orlando", "Title": "“Excellent hotel!”", "Author": "ellen1895", "ReviewID": "UR115019695", "Content": "Worth the splurge! Loved the modern boutique hotel. Good location. Impeccable service and accommodating to Americans. Loved our personal butler and concierge did a great job on restaurant recommendations. Highly recommend this hotel.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tetbury, United Kingdom", "Title": "“Secrets”", "Author": "LMc070", "ReviewID": "UR114536238", "Content": "Certainly a place I'd love to keep secret but would that be fair to all my fellow Paris lovers. This hotel is the best we've stayed in within Paris. Great location and with rooms soundproofed to ensure a peaceful sleep, providing the space you need to thoroughly enjoy your stay.. The staff, attention to detail & service are all exception and we are most grateful for the care & consideration taken to look after us. Without doubt the place to enjoy yourself and worth every penny.", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“wonderful and memorable experience”", "Author": "Wilma880", "ReviewID": "UR111033999", "Content": "The hotel is located in a very convenient location with easy access to the metro and taxi as well as restaurants and shops in george v area and on champs elysees. The room is spacious and well planned out. All staff are very friendly and helpful and we really love the balcony at the nighttime and the little desserts found in our room after a long day of shopping and walking around. I love the quality of breakfast and the food at le fouquet's is exceptionally good, especially the dessert trolley and the steak tartare. One thing that is missing in the room is probably a dvd machine (but we didn't bother to check with the butler for one) This hotel is defintely on the top of my priority list in my next visits to paris!", "Date": "June 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great Hotel Although Car Service prices too High”", "Author": "eddielouie9892", "ReviewID": "UR110626187", "Content": "Fouquet's delivered on everything I read ahead of time. The rooms were great with three very nice touches 1) free wifi, 2) free mini-bar with soft drinks 3) free printer in the room. There was one issue that the printer ink cartridges were not working and there was no paper in the room but it was fixed within an hour (they apologized for the wait). The room had high ceilings with a balcony and very nice view of Champs Elysse and the Arc. There is indeed a TV in the mirror and a water proof remote control for the tub. Overall the room was very comfortable, quiet, and gave us a great place to rest up after hours of working around Paris. The breakfast buffet was nice with breads, salmon, fruit, cereal, juice. You can order any type of eggs and waffles. I had an omlette and fried eggs both of which were good. My wife ordered scrambled eggs one day which were odd - came in a bowl and very undercooked which they admitted. It was not a great buffet but enough. The butler service was nice and the concierge was helpful with reservations. We used the pool in the fitness center which was nice and is open late (til 10p) which was also a bonus The only real issue I had is the price of the car service to and from the airport. I know its my choice to use them and no one forced them on me but I do like using this service in an new city - it was 240 Euros one way for the cheapest vehicle which is nearly $400 U.S. This just seemed exorbidantly high for a hotel where most other things were a fair enough value. I'd say 150 Euro is a fair but still profitable price.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lazy Point", "Title": "“Absolutely wonderful”", "Author": "LazyPoint", "ReviewID": "UR108231658", "Content": "Just spent two short days at the terrific hotel less than a block off the Champs Elysees. Our butler Nicholas was terrific, helping us settle in, bringing a chilled bottled of Champagne after a long day of walking. The spa is terrific as well. Perfection.", "Date": "May 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "new york", "Title": "“awesome hotel”", "Author": "stevecNewYork", "ReviewID": "UR107426345", "Content": "I must say that this is one of the best hotel's I've ever been to. When we travel we always stay at 5 star hotels. The Fouquet Barriere was a cut above the rest. The service was excellent and the staff was very friendly and knowledgable. The hotel is simply beautiful. Contemporary while preserving a real flavor for Paris. The room was excellent. The furnishings were beautiful, the bed extremely comfortable and the air conditioning was great. I love the fact that the mini bar was on the house. I hate spending a lot of money on a room and paying obscene amounts of money every time I open the mini bar to grab a cold water. I would highly recommend this hotel It's not cheap but worth every penny. I will absolutely stay here on my next visit to paris.", "Date": "May 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Absolutely Breathtaking”", "Author": "joelbess", "ReviewID": "UR101218650", "Content": "Ok, I have stayed at a lot of hotels in my life. This hotel has superceded its service in every way possible. This was am ABOVE first class hotel. I was shocked how well managed and executed the flow of the hotel went. From the butler, to the concierge to the personal greetings by the managerâ€¦.oh just heaven. If you are a stickler for Service, this is your dream come true. oh... and the food was out of the world as well.", "Date": "March 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Madrid, Spain", "Title": "“WOW”", "Author": "danpb", "ReviewID": "UR100690686", "Content": "Perfect location, meters away from the FS George V. Extremely well prepared and trained service: we had a medical enquiry, which recquired a doctor having to come in-house, they managed so well and quick! Will be back soon for sure.", "Date": "March 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow", "Title": "“The best hotel in Paris!”", "Author": "NathalieMoscow Posted by an OctopusTravel traveler", "ReviewID": "UR94357741", "Content": "Sophisticated, stylish, warm and inviting luxury hotel in Paris! The hotel and everyhting it brings is excellent. We stayed in the hotel for two times and were never disappointed. The staff is really very attentive and the service is beyond five star - personal butler, welcome gourmet chocolates on arrival and even our little daughter received a small gift (toy phone). We are frequent travellers and this hotel is our favorite in Paris. And for sure we would stay here again and again when travelling to Paris.", "Date": "January 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minnesota", "Title": "“Excellent location, service, room, food-Outstanding Hotel”", "Author": "bigpain", "ReviewID": "UR89682461", "Content": "Before our trip we did quite a bit of research about where to stay. Fortunately, a friend of a friend recommended this hotel and that turned out to be the the best advice of our trip. We arrived in paris after a week in Dubai so our expectations were already high. The hotel really delivered in every way, from the transportation arrrangements from the airport to the hotel, all the way through our entire stay to the check-out. The location could not be better. The hotel and the rooms are perfect-modern and elegant with all of the amenities one would expect in a hotel of this caliber but yet warm and comforting. The service from everyone we encountered was top-notch and the dining and sightseeing advice and recommendations from the concierge were spot-on every time. We are frequent travellers and this hotel is on our top-5 list for sure. There is no question that we would stay here again when travelling to Paris.", "Date": "December 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Johannesburg", "Title": "“Special”", "Author": "GoldenSpencer", "ReviewID": "UR89555926", "Content": "Make no mistake, this hotel is not cheap, so we arrived with high expectations & we were very happy with what we received. Our suite was everything we'd hoped it would be and more. The service was top-drawer, and we felt like a prince & princess the whole time we were there. The staff are so well trained, & they have mastered the art of treating their guests with the utmost respect & attention. When they found out it was our 20th wedding anniversary, they sent champagne to our suite & gave us gifts from their beautiful spa. The general manager came to meet us when we left & thanked us for staying in the hotel. Besides the hotel & the staff, the POSITION of the hotel is absolutely perfect. We felt we were at the centre of everything & had easy access to other parts of Paris. We will definitely go back to Fouquet's, perhaps in Spring when it's not as cold.", "Date": "December 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Munich, Germany", "Title": "“Great Hotel and deals really well with complaints”", "Author": "eddala2004", "ReviewID": "UR89474787", "Content": "We spent 2 Nights at the Fouquet's Barriere and when we left I was convinced that this is really a great Hotel. We had 2 rooms (1 Suite) and the Suite was just perfect. Before you arrive you are asked to fill out a questionnaire regarding flowers, sweets, room temperature and so on. We found everything we have asked for in the Suite. The other room however was not equipped as asked for but the room however was very nice and really big. What I didn't like was the spot in the shower (see picture). I think that a hotel in this category must take care of these things. What really convinced me was how the hotel handled a rather ugly mistake. I asked for a car to take us back to the airport and just said 4:30. Nobody asked me so I assumed they realized that I was talking about 4:30 pm. Unfortunately the Hotel assumed it was 4:30 am and therefore woke my parents at 4:15 am. When we cam down from the great breakfast the Hotel Manager approached us and he was really sorry. We even got 2 giftbags and the ride to the airport for free. This is something I have never experienced before. In contrary: other hotels don't even answer to your complaints. So in the end, I can really say, that the hotel is great, the rooms are big and beautiful and the hotel is situated perfectly. We will go there again.", "Date": "December 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Wonderful”", "Author": "Chaterin", "ReviewID": "UR85852939", "Content": "I travel all around the world and I really enjoyed my stay in this hotel! I loved the location staff is very kind and helpfull. Nice Rooms, except for tv hard to work by. I was particulerely impressde by the copncierge Olivier, who delivered on every requested that I had with great talent! Has I told him on departure, he is the bst concierge I ever meet!", "Date": "November 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Bernardino, California", "Title": "“I loved this beautiful place and WHEN not if I go back I will be staying here”", "Author": "jamiie", "ReviewID": "UR83369521", "Content": "I was looking online for a hotel to stay at on expedia.com they had this questionair for me to fill out saying what kind of features I would like my hotel to have. I selected my choice and of all the hotel this is the one that showed up I decided to give it a chance snd ended up staying at the hotel another night. I really liked this hotel and recommend it to everyone. The only thing that I would have liked to add would have been free parking Lol .", "Date": "October 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Great Service, Great Room, Great Food, Great Location”", "Author": "fbpt1", "ReviewID": "UR82780592", "Content": "My wife and I stayed at the Fouquet's Barriere at the front end of a 25th anniversary trip. Our Amex card allowed for an upgrade and we were given a stunning suite on the top floor with the Eiffel Tower to our left and the Champs elysees to our right. Located in the 8th district, we walked to the River at night, and to the Louvre and other attractions through the day. We were also given a complementary dinner at the adjoining Fouquet's restaurant that was fabulous. I can't say enough about the service and the room, from the smiling and pleasent check-in personnel to the amazing bathroom and bedding. The hotel also had a beautiful garden bar for relaxing at nite under the stars. If you have a special trip in mind, I strongly suggest you consider this property.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“A new favourite in Paris”", "Author": "Ioveit", "ReviewID": "UR81792762", "Content": "I stayed here as it was fashion week and the George V where I normally reside in Paris was full on one of the nights. Their loss as I will be staying here in future. Rooms are very comfortable and I love that they include Internet and the minibar in your rate. It is a nice feeling of not having someone try to squeeze extra juice out of you. The bathroom was a treat. The service is just perfect. Our butler Charles was always helpful and delighted to serve. Special recommendation for the duty manager Ralph Bardaghji who came next door to the restaurant because he heard we were unhappy. He is an excellent hotelier. This is a great hotel and I am very pleased to have stayed.", "Date": "October 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“A deluxe property in a great location”", "Author": "Victoria39", "ReviewID": "UR78513346", "Content": "Hote is a boutique style property, just on the Champs Elysees. Rooms are huge and well equipeed with beautiful bathrooms, with great products, a double walk in shower, great for a romatic weekend or special treat. The room came with a butler who is only to happy to assist with unpacking, pressing clothes etc. They have the most amazing clean and tranquil spa with pool/jacuzzi. It has an oriental feel with gentle lighting and candles, very romantic! Fouquets restaurant is also great, very authentic french style, great amosphere. Hotel staff are delightful it is a fantastic hotel and I can highly recommend it.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Eindhoven, The Netherlands", "Title": "“A present to stay”", "Author": "jwillemb", "ReviewID": "UR67331816", "Content": "Very good hotel on super spot in Paris. Rooms are great with all the luxuery you can wish, like tv in the bathroom, champagne and valid parking. The pool and massage is one off the best after a walking day in Paris. The terrace is famous and a hot spot in the city. At the back of the hotel there is a tranquille terrace for breaqkfast, lunch etc.", "Date": "June 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai", "Title": "“Amazing Experience - Very nice & Welcoming staff”", "Author": "UAEexplorer", "ReviewID": "UR63521826", "Content": "My usual Paris hotel was fully booked and a friend recommended La Fouquet's. I must say that i was glad that my usual hotel was full, as we had a superb experience at La Fouquet's. The staff and hotel manager nicely greeted us and showed us to our room. The quality of the rooms, furniture and amenities far exceeded our expectations. The hotels is seconds away from the Champs and boutiques. An amazing location. I will definitely be visiting this hotel again in the future.", "Date": "May 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brussels", "Title": "“Wonderfull stay!”", "Author": "Stefnie", "ReviewID": "UR56035981", "Content": "Superb hotel, friendly staff, nice large rooms. Perfect location. Breakfast was also very good! When you stay at the hotel you must certainly go eat at \"Le Fouquet\"!", "Date": "February 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Australia", "Title": "“There is no such thing as the p[erfect hotel, but The Foquet comes pretty close”", "Author": "AustraliaRaymond", "ReviewID": "UR53884745", "Content": "The Foquet Barriere Paris. If you can afford it, take a suite. If you can't afford it - tough;but the rooms are equally impressive. You'll be hard presssed to find better service in any hotel - anywhere, and it always appears that there is someone available especially for you. Ths food is exceptional as is the waiting service, but it is expensive, even for Paris standards, but you will always leave perfectyly satisified with the experience. One further attraction. It would seem that whoever employs female staff has visions of making this hotel known as having A - \"Service by Miss World Beauties\", title. Even the GM, usually hidden away, is out there making her presence known and assuring each and everyone of us, that this is the place to be in Paris. Raymond G Waterhouse: raymondw@bigpnd.net.au", "Date": "January 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Great Great Place to Stay in Paris”", "Author": "Beony", "ReviewID": "UR52875741", "Content": "I took my wife for Valentine's Day to Paris and couldn't have had a better experience with this hotel. My favorite part was the Lounge on the 2nd floor....you can also eat there in the morning and all day....the service is very professional and the attention to detail is very high. I heard that Sarkozy had his victory celebration in this lounge.... Rooms were smaller but for European standards ok. Very good beds and the butler service was nice. One caution though: don't eat at the Brasserie that borders the Champs-Ã‰lysÃ©es....the service is very poor due to what I imagine is the influx of tourists that come in...otherwise the other restaurant in the hotel is great, just make sure you tell them you are staying in the hotel and then I believe you get much much better service....", "Date": "January 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fouquet's is everything a hotel should be - great people, great location, great service”", "Author": "dont_dis_me", "ReviewID": "UR48313573", "Content": "My family and I have travelled alot and stayed in some of the world's best hotels. This was our first stay at Fouquet's in Paris. Right from the word go we were pretty sure we were going to enjoy it. Check-in was quick and simple and staff very welcoming. We had booked a junior suite and were upgraded to a larger suite for the same rate. We were travelling with our three children aged 12, 10 and 6 so we need quite a bit of space. Both suites offered us that with 2 separate rooms and separate toilet and bathroom. The rooms are tastefully decorated and everything works. When we inquired about a DVD player for one of the flatscreen TVs, our butler was there plugging one in within 10 minutes. The location of this hotel is just fabulous and was one of the reasons we chose it. Ten minutes walk to L'Arc de Triomphe and I would guess 20 minutes to the Eiffel Tower. Fouquet's started life years ago as a fashionable Parisienne cafe and place to be seen. It's easy to see why. Situated on a corner (like so many good French cafes), one side of the hotel is on the Champs Elysees and the other side on Avenue George V. We ate at Fouquet's cafe on one occasion, choosing to book a babysitter for the evening who spoke faultless English and was great. Food was excellent (Dover Sole) if expensive (with that location not surprising) and was not that hot (temperature) but a fabulous atmosphere and a real treat. Breakfast in the hotel was delicious with excellent personal service from the staff. We ordered room service on two occasions which we found to be prompt, hot, delicious and well presented. Access to the beautiful underground spa and pool were included in the room rate. The spa looks very new and is clean and quiet. The fitness centre is small but had the basic cardio machines and some free weights and floor mats. Fabulous swimming pool and Hammam pool/jacuzzi. This team really knows how to run a hotel and we were very sorry to leave. We will look forward to returning just as soon as we can.", "Date": "November 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Taipei, Taiwan", "Title": "“Most amazing hotel I've ever stayed at in Paris...great staff, great location!!!”", "Author": "northstar_jojo", "ReviewID": "UR46818018", "Content": "This is truly one of the best hotel experiences I've ever had in my life! Which hotel has ever given you a questionnaire to fill out after you booked a room to ask you about your preferred flowers, music, type of refreshments, brand of water, etc.? The location cannot be any better, right around the corner of Champs-ElysÃ©es and Avenue George V, across the street from Louis Vuitton. There are already so many boutiques, restaurants and great night clubs to visit nearby that I didn't even feel like I need to get out of this area! The 24/7 butler service was always delightful to help with everything from restaurant reservations to my wrinkled gown emergency. I stayed at Fouquet's BarriÃ¨re for a week, and the manager personally came out to greet me when I check out, asking if everything is good with my stay. Absolutely great hotel, I'll definitely stay here again!", "Date": "October 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Aberdeen", "Title": "“Could not have wished for a better hotel, staff and location”", "Author": "gmonaghan", "ReviewID": "UR45719007", "Content": "We have just returned from a 4 night stay in the Fouquet's Barriere and it's probably the best hotel we've stayed in worldwide (inc Mandarin Orientals, Grand Hyatts etc). The view from the junior suite overlooked the Champs Elysee and Arc de Triomphe, the staff were magnificent and the amenities second to none. Highly recommended!", "Date": "October 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "NewYork, NY", "Title": "“Magnificent!!!”", "Author": "dostrau", "ReviewID": "UR38628825", "Content": "This is one of the BEST hotels we have EVER stayed in!! The rooms were gorgeous, the service was impeccable, and the STAFF WAS BEYOND!!! We were treated like \"royalty\" from the moment we first stepped into the gorgeous lobby......everyone from the managers, consierge, doormen, bellhops, cleaning staff and more were overwhelmingly warm and welcoming!! We would never stay anywhere else in Paris, and although we have traveled around the world and stayed in some of the finest hotels, Fouquet's Barriere is truly a remarkable place!!! Thank you all for the most wonderful vacation in Paris!! Donna O. New York NY", "Date": "August 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "montreal", "Title": "“FANTASTIQUE!”", "Author": "acprod", "ReviewID": "UR35011298", "Content": "As one of an earlier reviewer stated, what separates Fouquet's Barrierre from every other 5 star hotel in Paris is the staff, who are amazingly warm and welcoming from the moment you arrive until departure, in particular the lovely, elegant Julie Bruley who is Fouquet's Director of Client Operations. Although it was June, we arrived on a rainy, cold Parisian day. Our welcome was so unusually friendly that I thought they were mistaking me for someone else. Ms. Bruley came over and told us that she had a wonderful surpise for us but that our room wouldn't be ready for another ten or fifteen minutes. She invited us to go up to the bar and have whatever we wished, compliments of the hotel. We were escorted upstairs to a gorgeous bar, which also serves as a resturant for breakfast and lunch with a beautiful and comfortable terrace outside, complete with sofas and very comfortable chairs. The room itself is decorated in colors of eggplant and lime green... exquisite. The service was impeccable. After 15 minutes Ms. Bruley arrived to show us to our room. I had booked a junior suite, a definite extravagance in Paris, but it was our 30th anniversary and this was a celebration. When we stepped into our room, my mouth fell open. She asked if we liked it. She had upgraded us to a full suite that took my breath away. There were a dozen roses in the livingroom and another dozen in the bedroom and fresh peonies in the bathroom. There were 3 plasma tv's, one of which hung over the sunken tub in the bathroom. 8 or 9 floor to ceiling French windows that opened out over the quiet and landscaped courtyard. The shear luxury of the suite took my breath away. Now I was convinced they had mistaken us for someone else! I looked at her and told her I might just never leave our suite. She pointed to a bottle of champagne chilling in a bucket next to a bowl of fresh fruit and canapes and wished us a wonderful stay. That was just the beginning of four days of tender loving care at the hands of the hotel's staff. It is the most subperbly run hotel I've ever stayed in and both my husband and I are world travellers who definitely like our comforts. There was a bottle of Hermes cologne and a bottle of Hermes eau d'toilette waiting for us in the bathroom, which was huge and did not house the toilette, which was in a separate room. There was a huge and beautifully designed dressing room/walk in closet with two gorgeous terry lined silk robes and beautiful slippers. The food was wonderful and did not disappoint. While it was our first time at Fouquet's, it will not be our last. This hotel owns me for life. Luxury is easy to find as it simply requires cash, but a warm and inviting hotel staff, especially in Paris is never a guarantee unless you stay at Fouquet's, where it is the norm. Simply wonderful hotel.", "Date": "July 17, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "St. Albans, UK", "Title": "“stunning rooms/ avoid the room service”", "Author": "parrotpuppet", "ReviewID": "UR26622865", "Content": "the rooms and concierge were excellent, however the outer image was tainted by the behind the scenes staff. our rooms were continually not cleaned until 4pm, and the room service was the worst i have ever had in a hotel, to the point that we refused to pay for it. the brasserie food was just ok, however the expensive restaurant however is excellent, any restaurant that will make my brother eat pea soup really deserves a medal. it is however worth going just for the own brand energy drink and the slippers!", "Date": "March 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Monterey, CA", "Title": "“How Can This Be Only The 316th Best Hotel In Paris?”", "Author": "AmoureuxDeVoituresFR", "ReviewID": "UR24763070", "Content": "I have stayed at the George V, Hotel De Crillon, Hotel Lancaster, Hotel Le Bristol, Hotel Plaza Athenee and the Park Hyatt Paris-Vendome. Hotel Fouquet's Barriere is better than all of them. Sure, some of them have their high points (George V and their flowers) but this hotel just knocked me out with their service, attitude, graciousness, attention to detail and the physical property itself. I have stayed in many 5 star properties all over the world for the past 30 years. I have never received a questionnaire before my arrival asking me for my preferences. Did I want to be close or far from an elevator? Did I like my bed hard or soft? What kind and softness of pillows did I prefer? Would I like a savory, sweet or fruit upon my arrival? There were more questions, but the one that really knocked me out was \"Which do you prefer. Roses or Orchids? And what color?\" When I arrived into my room, my Red Roses were waiting for me, not a detail was out of place. (See Photo) Can you tell me of another Hotel in Paris that does this? So why is this Hotel only 316th out of all the Hotels in Paris? I do like the George V, don't get me wrong. But whenever I stay there I feel as though I have to put on a veneer of falseness to match the artificial attitude exuded by the staff. Not here. Everyone was VERY friendly and real. I was immediately made to feel relaxed and comfortable. I had a few travel-related problems that needed to be solved and the front desk staff, my butler and the concierge could not have been more accommodating. I wasn't made to feel as though I was a problem for them, but rather I think they really did enjoy helping me. My room faced the Champs-Ã‰lysÃ©es but had double doors between my room and street. It was silent. And what a treat to be able to go out on the little balcony and turn my head left to see the Arc de Triomphe. Very memorable. The bed was sumptuous. The sheets were like butter. I'm not someone to stay in bed in the morning, but it was hard to leave this bed. The room was very luxurious but not in a 19th Century French way. It was modern and yet warm and intimate with beautiful colors and fabrics throughout the room. I was not able to dine in any of their restaurants, just room service. But this was superb and very well presented. The Continental Breakfast was so beautifully presented, I took a picture and sent it back to my partner in California. (Included) In conclusion, the only thing I can think of is that the Hotel Fouquet's Barriere's ranking will move up as it becomes better known. It opened in 2006 and it takes a while for people to find you. I'm sure that after a few years, The George V will feel them giving them a run for their money. And then they too will send you a welcoming questionnaire to make you feel as at home as The Hotel Fouquet's Barriere did for my stay.", "Date": "February 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "manchester UK", "Title": "“Worth the 10month wait!!”", "Author": "dezzieB", "ReviewID": "UR22467902", "Content": "I first booked this hotel for my wife and i to celebrate our first anniversary in January. Unfortunately when we arrived we were greeted by the operations director who informed us there was no room as a previous guest had extended their stay. We were naturally disappointed but have to say the way the situation was handled we couldnt of asked for more under their difficult circumstances. We were put up at fouqets expense in the Hilton where there was champagne constantly put in our room. We had booked a meal in Le Fouqets restaurant for the night of our anniversary and we were still invited to attend that. When we arrived we were taken to the more upmarket Le Diane restaurant which was a truly marvelous dining experience. Despite having a the usuall bottle of decent wine and an expensive brandy to finish there was no charge from the hotel for either the food or drink a saving of around Â£450 and the service was exemplary. We were told at the time we could return for free in the future for our intended two night stay. What started out as a disappointment was seeming a fortunate misfortune! We had enjoyed a free weekend in a good hotel and still had the promise of returning to experience what we had booked for free in the future. We took up this opportunity late november without any problem whatsoever. Upon arriving we were made to feel very welcome by staff who spoke excellent English without making you feel guilty for using your own language. ( i can speak french but struggle to understand it) We were taken to our room which had been upgraded to an executive room on the top floor overlooking the champs elysees. The room was immaculate and hi tec with a huge bed surround sound touch button lighting and a fantastic shower and bathroom. The full size french windows across the width of the room were totally sound proof whilst providing an excellent view of the bustle on the champs elysees. Again there was complimentary champagne waiting. We like to be left alone when away and although you are assigned a private butler we never found the need to trouble him/her and were pleased we were never disturbed either. The spa in this hotel is excellent and again friendly english speaking staff make you feel very welcome. The treatments we had were excellent in superb surroundings. We had our meal in Le Fouqets this time and this also was excellent with very professional yet friendly service and again in english without embarrasment. In fact one of the humorous points was when my wife said she didnt want a desert and our french waiter said \"your kidding me\" as if he had lived in england all his life! In all this hotel is high class well maintained and fashioned with professional friendly and discreet staff. The bar area is excellent with perfect service. Yes it is pricy but not over priced in my opinion for the quality of hotel and service that you enjoy. I would reccomend this hotel to anyone and we will return in the future even though next time we will be paying for the room as well as the extras!! Thanks foquets for more than making up for the initial dissapointment in January.", "Date": "December 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“One of the Best”", "Author": "travelbh", "ReviewID": "UR22002711", "Content": "Thru Luxurylink.com travel site we purchased a 3 night stay at this wonderful luxury hotel just off the Champs Elysees and fronting on Ave George V. The room (we had a one bedroom suite) was superb. One of the most comforable beds, electronic controls for the lights, and quiet. The staff is wonderful. From front desk to restaurant (breakfast and dinner was great). The location is superb, next to a metro, plenty of nearby restaurants and stores, and very convenient for cabs. It's not cheap, but very very luxurious and very comfortable. And it compares well with some of the best hotels I have stayed at in the world.", "Date": "November 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "mexico city", "Title": "“Paris at its best”", "Author": "oadelarc", "ReviewID": "UR20569387", "Content": "I m a Mexican national who travels to europe at least 3 times a year and have to say that i was a little nervous after reading the reviews of this hotel because they where really diverse, I stay there with my partner at the end of august for 5 nights and i have just one word, Marvelous, this is the sort of hotel you wish to arrive in every city, the buttlers were superb, the spa is magnificent. all in all a truly first class hotel.", "Date": "October 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Lux and lovely”", "Author": "Bucci73", "ReviewID": "UR16943427", "Content": "We stayed at this hotel in early June for a business trip. It is absolutely beautiful! The decor is modern and romantic, the rooms are spacious, high-tech and warm. And the service is top notch. They have definitely made it their mission to take very good care of their guests and meet whatever needs you require. The courtyard is really amazing and worth spending some time sitting outside and having a cocktail. The architecture and design is really something to see. It's got a very cool, modern and young European vibe. Because it was a business trip and I did not have to pay for anything, I cannot speak to how much everything cost--though I'm sure it was quite expensive. If you looking to have a romantic trip with high-end accommodations and service then I would say this hotel is worth whatever they're asking. The location is on George V, right off of the Champs-Elysees so you're in walking distance to the Eiffel Tower, Arc de Triumphe, Palais Royale and of course the Lourve Museum. It's in a very touristy-district so be prepared for that. But I would say that that is the only negative.", "Date": "June 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Santa Catarina", "Title": "“Our palace in Paris”", "Author": "HeringBell", "ReviewID": "UR14243520", "Content": "Me and my wife stayed two nights at the FouquetÂ´s BarriÃ©re and we love the hotel. It is very cool and stylish, and for us that love fashion is just perfect. Our butler served breakfast in the room and I ask him to put the table just in front of the window, so we could have breakfast looking at the Louis Vuitton flagship. Unfortunately we didnÂ´t see Marc Jacobs at work but no problems, all the view and the benedict eggs were great! The U Spa is incredible, very sofisticated. At the beutiful Le Diane restaurant I suggest the menu degustacion. We really loved the dÃ©cor by Jacques Garcia, modern and classic at the same time. The staff was so polite and friendly. Ah, before we leave the hotel we asked for two slippers to wear during the flght back to Brazil and they kindly gave us two pairs in a beutiful bag. Just great! FouquetÂ´s BarriÃ©re now is our palace in Paris, forever.", "Date": "March 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto,Canada", "Title": "“Absolute pleasure”", "Author": "jacadi", "ReviewID": "UR13728599", "Content": "My wife & I spent 5 gloriously relaxing nights at Fouquet's Paris. Although our stay was for business with all the tension & time restraints for meetings,etc. the entire staff made everything as smooth as possible. After a long flight & agonizing taxi ride, the concierge loaded our many bags, the front desk made our room available early, the butler helped with room arranging & our first meeting was more relaxed than ever. The breakfast was excellent & we can't wait to return to enjoy the outdoor atrium for breakfast & drinks. The swimming pool & hot tubs were an enjoyable surprise considering the hotel is a stones throw from the Arc & the Champs. We enjoyed massages in the peace & quiet of the spa; a nice touch to relieve the tensions of the day. Unfortunately, the dining room was closed, but Fouquet's is always a dining pleasure. We are returning in July & look forward to being spoiled again.", "Date": "February 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Turku", "Title": "“Exelent Hotel in Paris, France”", "Author": "finn_8", "ReviewID": "UR13058188", "Content": "We spend a long weekend in Paris in hotel FouquetÂ´s Barriere.We had 4 childre(6-16 years) and 6 adults. We had the best service ever. The hotel stuff was exellent.The rooms were beautiful and nice decor with very technick. We have been many times in Paris( first time in Hotel FouquetÂ´s Barriere) and this was the first time we felt that we were welcome and everybody was friendly.", "Date": "January 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“Nice Hotel, Great Location”", "Author": "Genob", "ReviewID": "UR11963487", "Content": "Just returned from a five night stay at Fouquets during the week before Christmas. I bought a package from Luxury Link, but was a bit fearful after reading some reviews on this site. We had a very pleasant time., My review is a bit mixed. Positives: The room was spacious and very nicely appointed. Looked out on the corner of George V and Champs Elysees, which was nicley decorated for Christmas. Great sound insulation too..barely any outside noise in the room despite the very busy corner. The staff was very nice. I didn't get the anti-American vibe that some described, and I'm about as American as they come. (I speak almost no French at all and butcher the pronunciation when I try.) The location is great. Walking distance to many places, steps from George V metro that will take you anywhere else. Indoor pool and spa facilities were nice, though the fitness center lacked for equipment a bit....I think this is a problem everywere in Europe. I love a good gym and seek it out when I travel....You just have to accept that you won't find it at a European hotel. Negatives: Service is a bit spotty at times. It isn't up to the standards of the Four Seasons down the street, which, based upon the prices they are charging, is their direct competition. Our mini bar and glasses were not replenished on a couple of days. And once I asked to have a couple of champagne glasses sent to the room, the acted a little put off that I wanted \"two glasses of champagne without the glasses.\" (maybe a language issue?). When we checked in, our room wasn't yet ready, but they forgot to come get us from the bar when it was. Maybe this will improve over time as the staff gets more experience, but I think the general manager needs to really demand more from his staff and instill much higher standards. Spa is in the same area as the pool. This meant that during a massage, the sound of kids screaming in the pool was quite audible.. Not very relaxing and that won't make them a spa destination. They need to figure out something here. Also, the men's steam room was out of commission during the stay... :( Restaurant: We had a dinner included in our package. Thank God it was included. While the food was good (not great), the prices were shocking, even by Paris standards. Appetizers in the 50-80 euro range, and entrees from 60-120 euro. Yes, you can pay that much in Paris, but this was not even one star stuff . After the meal, we both wished we had gone back to Aux Lyonnais for another round of the best Coq Au Vin we had ever tasted...for about 25 Euro.", "Date": "December 26, 2007"}], "HotelInfo": {"Name": "Hotel Fouquet's Barriere", "HotelURL": "/ShowUserReviews-g187147-d188742-Reviews-Hotel_Fouquet_s_Barriere-Paris_Ile_de_France.html", "Price": "$847 - $1,533*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">46 Avenue George V</span> | <span class=\"extended-address\">08 Arr.</span>, <span class=\"locality\"><span property=\"v:postal-code\">75008</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "188742", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/06/60/7e/chambre-executive.jpg"}}