{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“One of the worlds finest hotels and I speak from experiance.”", "Author": "Adrian B", "ReviewID": "UR128231073", "Content": "This is my favorite hotel in the world without doubt! My wife and I have stayed at this hotel since it was in the Demure group and even though it has changed owners since then standards have not slipped in each of my 9 stays over the years. I have been through the range of rooms as my fortunes have changed so would consider myself a good judge of this hotel. Somtimes the staff will offer upgrades and free parking but this is not the sort of establisment that you should expect freebies, it is expensive but worth every penny. Service and food are always great as is the location and ambiance. If you are in the market for a suite its well worth asking the reservation staff if there are any VIP apartments avaialble, at least twice the price but oh my they are somthing special and will give you a memory you will never forget.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Budapest, Hungary", "Title": "“So Luxury!!!”", "Author": "StarbucksFreak25", "ReviewID": "UR128190632", "Content": "Hotel is located 5 minutes away from the city center. The building is just fantastic inside as outside.. new and old linked together, decore is amazing! The interior is warm and modern. Rooms are large and extremely comfortable. Restaurant is very stylish and has a fantastic garden. Staff is very professional and nice.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“So good, we didn't want to come home!!!!”", "Author": "llovenz", "ReviewID": "UR127759897", "Content": "This hotel was by far the best we have ever stayed in. We booked the Junior Suite, but i am sure that we were upgraded to an apartment, with Butler service. The room was huge and was amazing. Loving the My Bed. Best nights sleep in a long time!! We chose this hotel for a special birthday celebration and we were treated wonderfully. It was quite overwhelming. To begin with we checked in early and shown to our room by our lovely butler, who was fantastic, so helpful. The hotel then sent up a birthday cake, which they organised. A total surprise. We asked our butler which Indonesian restaurant he could recommend, and he actually booked us one we had seen on the web prior to us coming to Amsterdam. But thought it was too late to book as booking is done well in advance, but he managed to get us a table, which was fantastic. It was called Tempo Doeloe, highly recommend it (thats another review). The breakfast, with complementary champagne was great and the staff new it was my husbands birthday, and brought him in a Dutch apple cake with candle (more like a flare) and the waitress, who was so lovely sang to him, amazing voice. We felt so spoilt. During our stay there were so many other things that the hotel did for us that made our stay spectacular. On our last day the hotel let us have a later check out time as they new we were getting a later flight and arranged a transfer to the airport. Overall, all the staff at the hotel made our stay so much more than what we were expecting, it was quite sad to leave. Since we have been back, we have recommended the hotel to all our friends and family. Thank you all so much. Brilliant memories of Amsterdam.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Very comfortable and central”", "Author": "LuckyLooch", "ReviewID": "UR127745960", "Content": "Even on top floor rooms are very comfortable. Great bar for drinks, and breakfast excellent. Central location means no need for trams or taxis.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Almost didn't stay - glad we did”", "Author": "carorab", "ReviewID": "UR127242217", "Content": "Like others, I almost did not stay here because of the negative comments about proximity to the red light district and noise. We are on the 3rd floor, overlooking the canal and it is lovely. No noise at all. The red light district is not close - you have to make an effort to get there. We have stayed previously at the Fusion Suites and although liked it very much, we wanted to be a bit more central and have more amenities. The Fusion is really a B&B. The Sofitel is very comfortable, and although a larger luxury hotel it retains it dutch feeling. The area is lovely and central to everything. I was on my own a good deal as my husband was attending a conference and at no time did I worry about walking on my own or around the area of this hotel. The concierge has sent us to wonderful restaurants (not touristy ones - more where the dutch would eat). the staff are very friendly and always remember our names. After a long day walking, I truly appreciated the long deep bathtub. If you want a cute canal house - this is not for you but if you want luxury, amenities, excellent staff and a great location, then look at the Sofitel.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cambridge", "Title": "“Great hotel in Amsterdam”", "Author": "drivervet", "ReviewID": "UR127202273", "Content": "Ignore the reviews saying this hotel is in the red light district and a seedy part of the city. It is a beautiful hotel, in its own courtyard. My wife and I walked all over Amsterdam from the hotel, and never felt we were in an undesirable area. The staff were very helpful, the rooms were lovely, well equipped and a good size. The fish restaurant was well worth visiting as well, with some really tasty dishes. Highly recommend the hotel.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Stavanger, Rogaland, Norway", "Title": "“3 Days March 2012”", "Author": "Mark U", "ReviewID": "UR126793199", "Content": "We arrived on Thursday and were welcomed by the doorman. Checking was easy but we were not shown to our room and the presentation of the hotel services and facilities was all too brief. The room was a good size and well maintained and the housekeeper was always on hand to assist if necessary. We have no complaints regarding noise from either inside or outside the hotel in the evenings. Whilst having a quiet drink in the bar a mouse appeared around my girlfriends feet. This was reported to the barman and he joked that it was probably the cheeseboard that attracted it. We took an hours tour on the hotel boat which was very pleasant and we were lucky enough to be the only couple. A nice trip but no narrative from the skipper. On the whole very good but not sure the staff treat all guest alike perhaps.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“Luxury”", "Author": "larstobi", "ReviewID": "UR126663915", "Content": "Very nice hotel with very friendly staff. Clean, spacious rooms, nice bathrooms. They could have some more cushion on the pillow topper for the bed for my preference. The windows are not sound proofed. The door is not sound proofed at all. The location is said to be near Red Light district but it is actually far enough to not notice anything at all. There are often celebrities staying at this hotel.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Fantastic!!”", "Author": "leahbx", "ReviewID": "UR126372980", "Content": "Absolutely beautiful hotel! Felt as I'd we we're treated like royalty from the moment we stepped foot through the doors. The bed is just amazing, so so comfortable! Truly a 5 star experience.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "1.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“What an experience!!”", "Author": "ranirahul", "ReviewID": "UR126250358", "Content": "Checked in to the hotel on Thursday, greeted by a host and a lovely Butler Domingo! We were celebrating our anniversary and were treated like a prince and princess! our luggage was misplaced so stress levels were up, but the butler chased this up regularly! We had a suite room which was outstanding with views of the canal, The bathroom was lovely, and the bedroom so romantic! Lovely size bed! Loved everything about the stay, hotel is a walk way from all the shops/rest and the staff are all so pleasant! We even got treated like VIP at the restaurant Domingo booked for us where we got a special table too! Loved it, want to do it al again! Thank you for the amazing stay!", "Date": "March 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Fantastic hotel”", "Author": "lanzlady", "ReviewID": "UR126233735", "Content": "Spent 3 nights at this hotel in luxury double room overlooking the canal. Beautiful bed with feather topper so comfy turndown service each night with bottle evian water and beautiful truffle bath with TV on the wall large wet room we wil be returning to his hotel next year very friendly polite staff and very helpful.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good but overpriced”", "Author": "Sagittarius_7", "ReviewID": "UR126146662", "Content": "Good points - interesting old building Helpful staff Good room with canal view Bad points - the area is a bit grim, the proximity to the red light district means you may get woken by noise on the street at 3am. The hotel, while generally good, is overpriced.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hong Kong", "Title": "“Wonderful - Stay Here”", "Author": "oznick", "ReviewID": "UR125966845", "Content": "I have stayed in quite a few hotels in Amsterdam and most have been very ordinary in terms of the facilities and style; I am happy to report a change; Sofitel! ACCOR and Sofitel The Grand Amsterdam have done a really great job in renovating and very old worn out product and given it a new lease of life for several years to come. The public areas are small but beautifully done; the rooms once again decent size for Amsterdam and decorated to suit most tastes. I have stayed in several Sofitels world wide and even brought a Sofitel MyBed over mattress; however these beds MUST be the best beds I have ever slept in! Give it a try you will not be disappointed.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Markham, Canada", "Title": "“Would Stay There Again!”", "Author": "lwdem", "ReviewID": "UR125780607", "Content": "Spent a night at the Sofitel The Grand Amsterdam, on a layover en-route to Kenya. My room was very nice overlooking a canal. There was a slight odour in the room but it was immediately remedied. My jeans got soaked from the rain while out exploring the city and the housekeeping staff collected them from my room and put them in the hotel dryer. They were returned with 40 minutes - no charge. All staff were very friendly and accommodating.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dinas Powys, Cymru", "Title": "“Style and quality in central Amsterdam”", "Author": "Crwydryn2", "ReviewID": "UR125655244", "Content": "The Grand is a quadrangle of elegant rooms in the central area. The staff are warm and welcoming and show you individually to the cosy and well-specified rooms whilst your baggage is being brought up. The restaurant has deservedly won many awards and whilst being costly it's worth every penny for the devotion to fresh ingredients and professional service. There's a bargain lunch, which with a few glasses of wine may well deter you from touring further that day. A very well run establishment where you will feel valued, happy and comfortable.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Los Angeles, California", "Title": "“Horrendous - house of horrors”", "Author": "Albert W", "ReviewID": "UR125531224", "Content": "This hotel must be the worst I have ever stayed in. It all started with check in, when I was given a room key to a room that was already occupied by others,... This was solved OK by the front office staff. I found the rooms to be tiny and extremely dark. Then we decided after a walk over the canals (make sure you don't turn right, because that's were the red light district is) to have dinner at the Bridges Restaurant. The service was again poor, with an arrogant hostess and so/so food. Breakfast was reasonably good, but then the great surprise came out upon check out; we were charged for minibar items that we never used (?!?) After complaining to this and speaking to the manager, this was waived. Will definitely not recommend this hotel to any of my friends or family.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Johannesburg", "Title": "“Details on facilities could be more detailed”", "Author": "VeraJohannesburg", "ReviewID": "UR125370260", "Content": "My son and I recently stayed over at this hotel. Generally the service was good although I would not have made a reservation at this hotel if I realized that the bathrooms offer showers only. I enjoy a soak in a hot bath after walking all day long day but had to suffice with a shower. The water leaked out from under the shower door over the bathroom floor and had to mopped up every time I sued the shower. Water from the wash hand basin drains very slowly. Location is very central as one can walk to most places of interest. Ask for a room higher up off the street as I was woken up at 3 o'clock one morning when 4 taxi drivers decided to have a disagreement outside my bedroom window. Also the garbage bins are moved out on the pavement in the mornings which cause a lot of noise. The steps up to the bathroom and/or down to the bedroom could also be a nuisance especially during the night. Towels, linen, pillows and so on were all in good condition. Overall quite good although I would not return to this property for the reasons given above.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "roseburg, oregon", "Title": "“Outstanding service, superb location”", "Author": "marinbean", "ReviewID": "UR124995160", "Content": "This hotel had exactly what we wanted for our stay in Amsterdam: an excellent location from which we could walk anywhere we wished to go in Amsterdam, outstanding service, comfortable rooms, and a luxurious feel. Prior to our trip, I emailed the concierge department with many questions. They were very skilled at anticipating what I would want to know next based on their answers, and I found this hotel exceptionally easy to deal with via email. They even called me in the USA from Amsterdam with a clarification, especially impressive as it would have been 4am their time. Our room was luxurious, spacious, and beautiful. We had been upgraded at no charge to a junior suite upon check-in. My husband and I each had our own sinks, and there was a towel warmer next to the large soaking tub. Every staff member was friendly and competent, and they were always asking how our stay was going and if they could do anything for us. We felt very pampered here. The decor is rich in color, fun, and modern despite the fact that the building is very historic and started out as a convent. The breakfast buffet is wonderful with every choice you could imagine available.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Sofitel Legend Amsterdam”", "Author": "186338Kathryn", "ReviewID": "UR124989499", "Content": "Very poor in every respect, bar closed early, barman had to look up how to make a cocktail, cold water in the shower, TV that didn't work - (I could do on). If you take advantage of one of the special offers you can expect a second rate service, a noisey room and staff who really don't want you to return.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Definitely not a 5 star”", "Author": "LCinChicago", "ReviewID": "UR124754978", "Content": "There is no way this hotel is a five star hotel. We've stayed at five and six star hotels, and this is, at best, a 3-4 star hotel. At a true five star, one would expect most things to be seamless and offer excellent service with a great attention to detail. Nothing was seamless except for when it was time to pay on checking out. Let's start with the reservation process which was a bit of a headache. I emailed with them back and forth and inquired about the Stay 4, Pay 3 nights. One person confirmed the promotion, and another person quoted me the full price. I don't think it's too much to ask for people to read the chain of prior emails. I also asked for a room with one bed (it was our 1 year wedding anniversary celebration, and we wanted to be in the same bed - go figure). We had inquired about early check in, and upon arrival, we were delighted to hear our room was ready. When we walked in, there were two double beds. Not awesome. So we asked for another room, presuming it'd be comparable. Nope, the second room we got was most likely their emergency back up room because it was probably the worst room in the entire hotel (room 360, by the way). There's a large pole in the middle of the room, and it's directly above the entrance so you get to hear people's conversations. The butler who walked us to our new room was a bit pretentious and lacked all sense of warmth. He asked why we chose Amsterdam when there are many other cities like Paris and Rome. Odd question, I thought. I told him that we've been to all of the other cities he named, which quieted him. It certainly felt like he was making a presumption that all tourists were there to smoke pot, watch sex shows, and trash the city. Thanks for the implication. One thing people should be aware of - there is NO WATER PRESSURE in the shower head. Not a wonderful job with renovations if you can't offer water pressure. The cleaning service was not of even a four star caliber hotel. For one thing, they are extremely FRUGAL with their little bottles of Hermes product. It'd be empty or near empty and they still would not replace it. DonI'm amazed that people rated this hotel so well. If you have the fortunate opportunity to compare, go stay at a hotel equivalent to the Raffles or any five or six star hotel in Asia and you'll see a remarkable difference.'t pretend to offer luxury by offering Hermes when you don't replenish it. And if you're lucky, you might get one bottle of water at turn down service. You might get two if you're really, really lucky. Sometimes, we got no bottles of water. We dined at Bridges, which was a nice restaurant and did provide good service. It wasn't impeccable like La Rive, however. I'm surprised about all of the rave reviews on here. If you get the fortunate opportunity to compare, stay at a hotel equivalent to the Raffles or a true five or six star hotel in Asia and you'll see a noticeable difference.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Olney, United Kingdom", "Title": "“Great staff, fab comfortable bed, great food!”", "Author": "tja1230", "ReviewID": "UR124729869", "Content": "Value for Amsterdam was ok, hotel is within walking distance of main attractions, only 20 mins walk from grand central station. I thought the room was ok, small only big enough for a cot beside the bed, looked under bed when we left only to find an empty juice bottle from previous tenants this was disappointing, but the staff and food made up for it all! The swimming pool is small but nice and warm. Overall good value for money", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Birthday in style”", "Author": "Lambrettali", "ReviewID": "UR124588975", "Content": "Fantastic location right in the heart of Amsterdam. When we arrived we were greeted by the hotel doorman who took our bags to the front desk. We had booked the hotel to celebrate my Birthday in style and because of that we were upgraded to a Junior Suit which was a pleasant surprise, they even brought a cake to the room. The room was fabulous, the bathroom had a walk in shower and the bath that was big enough for two had a television at one end, and two separate wash basins, The bed was huge with the feather and down duvet and top-mattress to wrap you up in soft, cozy comfort. We had the breakfast each morning and were amazed by the choices available, the service was amazing. Not once did a member of staff walk by without a smile and a welcome. The staff were all so kind, polite and professional. If you want to treat yourselves go here! I really would recommend staying in this hotel, not only for the luxury but the excellent customer service.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Paris, Ile-de-France, France", "Title": "“amazing hotel, top service !”", "Author": "Eric G", "ReviewID": "UR124575031", "Content": "location of the hotel is very nice, rooms are comfortable and this bed ... it is like sleeping in in the sky .... :-) amazing the staff, especially the butler tea, is efficient and can find you solutions to any of your problems breakfast is goooooood However,the gym could be bigger, it is quite small !", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Loved every bit of this hotel”", "Author": "Somit12 Posted by an Accorhotels.com traveler", "ReviewID": "UR124338557", "Content": "We stayed there for a weekend in August and it was amazing. We booked a superior double room but when we checked in, we were upgraded to a suite with a butler service. It was great, the butler helped us book a table at a restaurant, and answered every question that we had. The room was great as well. The massage in the hotel's spa can only be recommended! The location was great as well. I can only recommend this hotel and we will be staying there again when in Amsterdam", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "North Pole, Alaska", "Title": "“a memorable experience”", "Author": "Iaetitia", "ReviewID": "UR124170205", "Content": "Had an excellent stay. Have rarely encountered such service-oriented staff in The Netherlands. My room was spacious and well equipped. Location is perfect. You get the feel of life along the canals and it is an easy walking distance from key sights and shops, including the flower market. Did not try the restaurants. Yes, it is pricey but you do get a lot in return!", "Date": "February 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Durban, South Africa", "Title": "“Nice hotel, perfect location”", "Author": "Melanie_G10184", "ReviewID": "UR124003391", "Content": "Amsterdam is an interesting exciting place but i was a bit sceptical about the hotel choices as there weren't many options for 5 star luxury which i am fanatical about. However when we checked into this hotel we were pleasantly surprised. The location is amazing as it is a short walk to the red light district and other interesting hot spots. We stayed in a luxury room and it was furnished nicely, clean and comfortable. The bathroom was quiet large and also very nice. The view out the window was of another building so didnt get much out of that. We ordered a few times from room service and the food was quiet enjoyable. Had dinner once at the Bridges restaurant, the service was good and so was the food. The concierge service was average and overall we enjoyed our stay at the hotel. This is not the most luxurious 5 star hotel you will stay in but in Amsterdam i think this was the perfect choice.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Antalya", "Title": "“Crazy location, elagant building very high quality service for Amsterdam”", "Author": "Ozmaster13", "ReviewID": "UR123805300", "Content": "I have been to Amsterdam more than 15 times, sometimes for fun but mostly for business, when you travel for business there is big chance you might be alone therefore I like to choose preperties with 24 hour room service centre location plus I love to walk a lot so central locaiton is crucial. I usually stay at Starwood Hotel Pulitzer which was nice between 2005-2008 but after the service went down. I also stayed at swiss and grand krasnoplolsy several times. Last september I had to have emergency trip to Amsterdam, I mean I learned my trip around 13.00 and I was at Schipnol Airport at 2100 the same day, the booking was done by my staff, I told them 5 star city centre and a good room. when I arrived I received an sms from my team that I am staying at Sofitel. ooops I have never been there before and had no idea. When I arrived I understood they choose one the best hotels in Amsterdam. The hotel is old dutch building,rooms with hign ceilings, but the best part it was all very modern, high tech and quiet. The bathrooms were amazing (because uncertain events I had to check out and re check in so I stayed in two different rooms.) the bed was all comfy I mean all was looking very new especially Ä±f you know the hotels in Amsterdam. Food was fine, as I said if you are alone room service gets very important. Location is crazy it right in the heart of the most crazy part Amsterdam, I mean 20m left of the hotel there were 3 coffee shops. it was a very high contrast for me, such luxury and elegant setting next to coffee shops and red light distirict I just loved it. I strongly suggest traveller who is looking for modern luxurius hotel in a elegant setting in the crazy heart of Amsterdam, they should go sofitel. Negative parts, Expensive and very small reception.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "yorkshire", "Title": "“top class hotel”", "Author": "rubyhoo", "ReviewID": "UR123684063", "Content": "i loved this hotel , we had gone to amsterdam without booking a hotel and we were having trouble finding a suitable place. it was very expensive and on turning up there with our rucksacks and jeans on i did feel out of place but was made to feel welcome. the room was fantastic and comfortable. the hotel is in a brilliant position for exploring amsterdam. staff very friendly. if you want to treat yourselves go here!", "Date": "January 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Amazingly perfect weekend!”", "Author": "Mosparkle11", "ReviewID": "UR122826122", "Content": "Wow! What a perfect stay! We had booked a junior suite yet on arrival were upgraded to a prestige suite which was unbelievable. We had a separate livingroom with all the amenities and more (Bose sound system, nespresso machine to name a few) the bathroom had a fantastic shower and bath with television and then a very comfortable and luxurious bed. We had a the breakfast each morning and were amazed by the food and choices available as well as later sampling some delicious cocktails! The location is fabulous, although at the red light district you would never be aware of this and it makes it so easy to explore the city centre on foot as everything is near by. I have to leave the best to last though, the service was just fantastic. Not once did a member of staff walk by without a welcome. The staff were all so kind, polite and efficient. On our first night my now fiancÃ©e proposed, on hearing this news we were then presented with a complimentary bottle of champagne and congratulated, adding to the wonderful moment. I really would recommend staying in this hotel, not only for the luxury but the excellent customer service.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“You know you are in Amsterdam!”", "Author": "MonkeyGreen", "ReviewID": "UR122460434", "Content": "Had the good fortune of staying in one of the suites. This hotel is superb in every respect. Flawless service in the Dutch style. The buildings are pure Amsterdam on the outside, feels like arriving at a small royal palace. Modern and elegant interiors. It is expensive however the value is there. 5 star price and 5 star service providing a quintessential Dutch luxury travel experience.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Best Restaurant in central Amsterdam (in our experience)”", "Author": "DevDesai", "ReviewID": "UR122431400", "Content": "We found the location of the hotel difficult to find but when we finally got there, we were really pleased. The location is excellent for central Amsterdam. The courtyard is immediately impressive and the hotel staff are friendly and helpful. For instance, we were recommended a brilliant little French restaurant for lunch on Sunday. The room are modern, well-equipped and very comfortable. I have been to Amsterdam 6 or 7 times and this is, by far, the best hotel I have stayed at. The room service is pretty good but we could not get enough of the delicious crepes. Worth every penny.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Belgrade, Serbia", "Title": "“great hotel in heart of Ams”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR122431378", "Content": "..great location, very nice suites, excellent service - all in best part of Amsterdam. If you are looking for top notch service, with great rooms and also nice spa, this hotel will satisfy all your needs.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kent", "Title": "“Amazing 40th birthday!!”", "Author": "Nonacrascall", "ReviewID": "UR122312610", "Content": "We stayed at this hotel for two nights, as my 40th birthday was on the 29th December. We had complimentary champagne upon arrival. The location is perfect for exploring beautiful Amsterdam and the staff were extremely helpful. We used the spa which was relaxing and therapeutic. We enjoyed champagne with the staff on the Thursday evening and tried some delicious cheese! Our room was comfy and was regularly tidied and freshened up. It was a birthday that I will always remember and I would love to return one day. Amsterdam is a fantastic and architecturally wonderful city.", "Date": "December 31, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "1.0", "Value": "1", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“Worst hotel experience in my life”", "Author": "Johan M", "ReviewID": "UR122140238", "Content": "Check in 45 min due to a wrong arrival date. Twin room instead of DBL room booked 1 day to change the bed in Italian bed. Conciergerie push you to buy services all time If you are not rich, you will receive a different welcome and services. Taxi did not want to drive us until central station They debit my card 2 times without asking me and the made 1 week to re-credit it. For a 5 stars hotel, the service is worst than an ibis hotel.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne Australia", "Title": "“Fantastic concierge”", "Author": "Peter361", "ReviewID": "UR122076935", "Content": "The hotel is in the centre of town so we walked to all the attractions that we wanted to see. The standard rooms are not big but the suitable for us. The used the hotel transfer to and from the airport which made everything very easy as we arrived at different times and no one had to organize money. The highlight of our stay was the concierge Mr Udo Eshuijs who organized medicine for our daughter who had asthma and needed a puffer. He organized the hotel doctor to send a script to the chemist and sent a taxi to collect it then delivered it to the room personally. He suggested various restaurants that were all great and made our stay memorable. If you stay please use his recommendations.", "Date": "December 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Just amazing!”", "Author": "Fairytale2010", "ReviewID": "UR122029829", "Content": "All I can say is that this is the most amazing hotel I have ever stayed at! The room was absolutely wonderful; including a free standing bath in the middle of our huge bathroom. The MyBed was so comfortable, that it was really difficult to drag myself out of there. The service was great, and the breakfast delicious. Highly recommended!", "Date": "December 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Excellence is hospitality”", "Author": "kingkelly77", "ReviewID": "UR122019336", "Content": "Ive stayed at the Grand a few times in Amsterdam and this December was there for 3 nights. The hotel and it's staff are excellent and you can't fault it one bit. The Christmas decor is beautiful and the open fireplace in the library is great for relaxing in front of. We also enjoyed champagne with the whole team on Thursday evening, nothing is too much trouble. I also used the spa which was incredible, a 60min massage, it's world class. Hermes toiletries are in your room and I also got a nice complimentary bottle of champagne sent up! This is The Best hotel in Amsterdam and they will make it feel like home from home.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Yorkshire Dales National Park, United Kingdom", "Title": "“AMAZINGLY wonderful........”", "Author": "Tracy006", "ReviewID": "UR121651137", "Content": "Have just returned from a wonderful weekend at The Grand, what a truly wonderful Hotel. The staff are incredibly friendly and helpful, and we received impeccable service. The Bridges restaurant, I have to mention, is one of the finest restaurants I have dined in, the ambience, the decor, the food and staff all were amazing, i haven't checked, but if this restaurant doesn't have a Michelin star it, definitely requires several. Food from Te Raw bar is a MUST to sample, and the bÃ©arnaise sauce is to die for, alongside the entrcote steak !!!!!! I have to stop writing, as it is making me salivate..... I haven't had a weekend in amsterdam for a long time, this place makes we want to go again, i think I may well have just found one of my favourite places on earth........ Also the beds!!!!!!!soft, warm, a wonderful turn down at night, with slippers and chocolates, seriously, you must visit this place.........", "Date": "December 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Very impressive, but at a price!”", "Author": "LondonBas", "ReviewID": "UR121497823", "Content": "Stayed here for one night as part of a business conference (conference was also at the hotel). There's really only one \"downside\" to this hotel and that is the price (if you are paying yourself). Non deal prices are quite hefty but I would still book here if I could get a small discount. The pro's: - it's slap bang in the middle of historic Amsterdam, actually on the edge of the red light district; 10min walk to central station (which has a train to Schiphol airport every 5/10 min) - it's a very well preserved historic building which has kept all its historic features but is beautifully renovated. The building is the prinsenhof, which has longstanding roots with the house of Orange (Dutch Royal family). The current Queen of Holland actually got married in this building - Rooms look beautiful with walk in showers and closets, art deco interior, very comfortable beds and a free nespresso coffee machine, free newspaper in the morning) - staff is well trained and ver attentative (only mishap on my visit is that my complementary newspaper wasn't there in the morning) - food at the hotel is solid, but nothing extremely special (but if you are in the centre of Amsterdam, there's plenty of good restaurants close by) In general it's a great hotel to stay. It looks new (no idea when they renovated it, but it can't be very long ago), is in a gerat location and is in a beautiful building. For business conferences it was definately a great hotel. If it would have been a personal trip, I would have still stuck to my review. Can you get better value for money in the same area? Yes! But sometimes it's worth to splash out and this one is worth it", "Date": "December 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Great hotel, but not for the price”", "Author": "sandiUKLondon", "ReviewID": "UR121445348", "Content": "4 of us stayed in this hotel the last trip to Amsterdam, and I think they all raved about it. I could not understand how it was worth the cost of the rooms. We ended up getting a lot of money off due to a special, but considering the cost of these rooms on every other website, I just don't think its worth it. Maybe compared to the other hotels in the city, but then that's a sad state of affairs for Amsterdam. The room was TINY. So small. on the main level, so we had a street view which was nothing great, but it was not noisy which was nice. The beds were comfortable, as all Sofitel beds are, but I couldn't get over the smallness of the room FOR THE PRICE. I travel quite frequently in Europe and am aware of hotel size, but there was nothing here to be able to charge what they do. The lobby area is quite stunning, as is the bar in the hotel. The back courtyard is also quite nice on a sunny day. We had afternoon drinks in the courtyard when we realized we hadn't used up our drink vouchers. The area is good, not spectacular. I would not stay again unless I wasn't paying for the room.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Short but brilliant stay”", "Author": "awesometraveller05", "ReviewID": "UR121357716", "Content": "Brilliant, central hotel, very clean and good facilities. Very near bus-stop and boat-stop and amazing service Overall really amazing", "Date": "December 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Nice Experience, Great Location”", "Author": "Jodes244", "ReviewID": "UR121298870", "Content": "The hotel is located near it all, Central Station, Dam Square, The Red Light District and other key parts of town. Though close to everything, the hotel is quiet and tranquil. The rooms are modern and have all the amenities: Bose iPod docking station, towel warmer, Nespresso machine, etc. The beds are super comfy and the chocolate provided each nite was a nice treat. The only strange thing was we had two separate beds, rather than a king or queen. The concierge was helpful as were the other hotel staff. Niels was the best concierge and always provided great advice. We had breakfast each morning (included with our type of room rate) at Bridges, which was extensive and really good. If we go back to Amsterdam, we would stay here again.", "Date": "December 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Eindhoven, The Netherlands", "Title": "“Good stay with perfect service”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR121208298", "Content": "The stay and service was as good as expected with an hotel from this level. Looked good, felt good, was good. Especcially as platinum member, it felt good to be there. Only, the bill in the hotelbar was a bit (unexpted) high. But, was our own foult and worth it :-) Great!", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Stunning”", "Author": "DoctorDebs", "ReviewID": "UR121143468", "Content": "Very chic hotel, very well-placed near the main tourist sites and with very warm and friendly service, which you normally don't get in places like this. The design of the hotel is modern, cool and very trendy. The restaurant is superlative but very pricey. We had a breakfast there too, very expensive but incredibly rich both in quantity and diversity of food. The rooms were to die for. We loved it and can't wait to go back.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chester", "Title": "“This is the only hotel to stay in when visiting Amsterdam”", "Author": "ChesterNipper", "ReviewID": "UR121114497", "Content": "My husband and I stayed here for 2 nights at the start of November 2011. The staff were wonderful, really helpful, friendly and couldn't do enough to help us. They parked my husband's beloved car in a safe location, hired us some bikes to potter about on and recommended a few night spots, which were fantastic. The hotel was luxurious, very nicely furnished and had a non stuffy atmosphere. We had a decent sized room overlooking the canal on the 1st floor, but it was really quiet and comfortable. However, the best things that make this hotel great, are the staff and its location. Would recommend it to tourists or business travellers, you definitely won't be disappointed.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Absolutely 5 star experience”", "Author": "brettnLis", "ReviewID": "UR121008951", "Content": "We had the pleasure of staying at the Sofitel Grand Amsterdam and can say it was one of the best hotel stays we have ever experienced. Once you enter the grounds of the hotel, the crazy outside world just disappears.... The hotel itself is stunning. On check in you are shown to your room and the features of the room & hotel are explained to you. The compliementary dried fruits & syrup biscuits are a lovely touch. The nespresso coffee machine was also appreciated! The central courtyard of the hotel is a oasis, the perfect place to enjoy a glass of champagne. We had dinner at the restaurant, the menu is fish based and we completely enjoy both the food and the amibence. All the staff we spoke with were outstanding. The staff are extremely friendly yet professional, a perfect balance. We can not reccommend a stay a this Grand Hotel strongly enough!!!", "Date": "November 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlantic City, New Jersey", "Title": "“great hotel”", "Author": "sf55", "ReviewID": "UR120759562", "Content": "we have traveled extensively and were very impressed with the \"grand\" . Beautiful hotel, great location, friendly and efficient staff, would definitely go back", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Treated like royalty”", "Author": "ukm2009freqtrav", "ReviewID": "UR120742501", "Content": "From check-in we were treated like royalty and given a complimentary upgrade to a suite. As it was a special birthday, the hotel sent us some champagne and a lovely note. The rooms are truly luxurious with excellent quality bath products. In a city which is not known for very good service, the Sofitel stands out. You really won't want to leave the grounds! The only minor let down I had was Sunday service in the breakfast room - a bit chaotic. The Sofitel Luxembourg was previously my most favourite hotel in Europe but the Grand is now no 1!", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Absolutely Cracking”", "Author": "jpargeter", "ReviewID": "UR120706681", "Content": "This was the best hotel I've stayed at in ages. The location is fantastic - close proximity to the centre of town yet amazingly tranquil. You enter into a courtyard currently filled with arty mosaic-covered benches and chaise longues. The reception staff were not only helpful bit also very easy on the eye! We were upgraded to a suite, which only enhanced the experience. Beds were fantastically comfortable. The shower and bath were brilliant. The only comment would be that some of the technology could do with some TLC.. the TV in the bath didn't work.. The concierge were fantastic. At very short notice they were able to conjure up a table at one of Amsterdam's popular bistro and cocktail bars without any fuss whatsoever. The bar, spa and restaurant (for breakfast) were up to scratch. Overall, this is a five star hotel that doesn't compromise and certainly lives up to the expectations of the Sofitel brand. If you're looking to treat a partner or celebrate a special event, I'd recommend a stay at The Grand.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“helpful concierge”", "Author": "Nirai", "ReviewID": "UR120651243", "Content": "thumbs up for the concierge staff. they gave good restaurant recommendation and very helpful indeed. good location too.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“If I had only one month to live, I would spend it at The Grand”", "Author": "JCG098", "ReviewID": "UR120637059", "Content": "I booked my trip to the Sofitel six months in advance for a Luxury Room. When I checked in at the Hotel, they could not find my reservation so I showed them my confirmation number. They told me they didn't have any Luxury Rooms available, so they had to put me in an Opera Suite. This was a HUGE upgrade; I had a living room and a dining area and it was completely first class. The bed was amazingly comfortable. The bathroom was immaculate. The staff treated me like a king. They met exceeded my expectations for every request I made. The restaurant had incredible oysters on the half shell which were native to The Netherlands. The atmosphere is magical, you feel like you are in a different world. I felt like everything was in slow motion, time stopped. I was treated like royalty. I coming back whenver I get the chance. I am going to upload my pictures of the hotel later.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Good choice in A'dam”", "Author": "OllieOreo", "ReviewID": "UR120590831", "Content": "I have stayed at most of the top hotels in Amsterdam and this is def. one of them! The location is good but it all depends on what you are doing in Amsterdam. Its very close to the red light district which can be a bit annoying if you are not into that because you will easily cross the red light district when walking around... Lobby is quite dark but the rooms are light and the bed are SUPER comfortable! Bed and Breakfast! This is not an B&B but its the best par of the hotel! The bed & the breakfast! Breakfast is really really good with a huge selection of fruit and FRESH juice! Also I think the restaurant has a michelin star or use to have, very good! Reason why I dont give the hotel 5 stars is value, Its very expensive and its not that good! I have a few hotels in Amsterdam I prefer over this.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Worth every cent”", "Author": "voyagevoyage40", "ReviewID": "UR120450407", "Content": "I travel a lot and this is one of the best hotel in the world. Everything is perfect, staff, service and room. Location is just amazing, walking distance to a lot of major tourist destination. As an Accor card member, this is one on the only hotel where the card was recognized and acknowledge. Well do not hesitate, if you go to Amsterdam this is the place you want to stay.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Wonderful Hotel”", "Author": "FScfs", "ReviewID": "UR120353499", "Content": "My favorite hotel in Amsterdam. This is a truly Grand hotel. It is within an easy walk from Centraal Station. 2 blocks to the Dam Square, many museums are walkable, the Anne Frank House and the Flower Market are also walkable. Bridges Restaurant within the hotel is excellent, particularly for seafood. They have a good wine list which includes a few selections from Holland as well. The central courtyard is delightful in warm months for dining or a drink. The lobby bar area is quiet, relaxing and has good selection of single malts.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Amazing! I could live there.”", "Author": "Titamxnl", "ReviewID": "UR120347845", "Content": "I travel a lot and stay in lots of hotels for fun and work. This hotel is amazing! I always pay attention to the service and here I was amazed. It was a dream! Please note that The Netherlands is a country were generally the client is almost never first even if you spend considerable amounts of money, i.e., Metz & Co in Amsterdam - worst client service ever. Don't bother to visit. So with that said that this hotel makes yout stay lovely!! The staff puts attention to every detail. Everybody is friendly, attentive and food and quality are great. Loved room service and I was amazed by the service at the restaurant too. They have delicious sea food. During our stay, We got three times drinks from the house. We got upgraded so we stayed the first night in a suite and it was perfect! Living room, dinning room. Big bathroom and lovely room with walk in closet. We can't complain at all. We couldn't leave the hotel after the great expirience. And we literally didn't leave the hotel since we went from room to great restaurant and bar and then decided to stay another night. This time we got a normal room and still we enjoyed it very much. Thanks to the good attitude of staff. This hotel is well located since its in the middle of the center and still gives you the relax feeling. If you want to make use of the spa book it in advance because it could be very busy. It is quite expensive but it's more than worth it. You won't regret it.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent”", "Author": "Paulmat555", "ReviewID": "UR120239024", "Content": "Excellent service and amenities, the lounge is amazing, so was the brakfast. Located in close proximity to the red light area and coffee shops.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“A splendid, historical hotel”", "Author": "PSeib Posted by an Accorhotels.com traveler", "ReviewID": "UR120216166", "Content": "Close to the center of things but flanked by two quiet canals, Sofitel The Grand Amsterdam provides an excellent base for tourist or business traveler. The former Amsterdam city hall has become a luxurious hotel with an excellent seafood restaurant. It is an easy ten-minute walk from the train station and all the principal tourist stops are likewise easily accessible. The service is excellent, the rooms plush.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Lausanne, Switzerland", "Title": "“Best location in the heart of the city”", "Author": "Claude_Ray", "ReviewID": "UR119925707", "Content": "I have stayed two nights in a superior room at the Sofitel. I must say it is not as nice as other Sofitel. The room although 2 levels above Classic room is rather small and furnished ok, and not upscale. The first room that was assigned stunk chemical mized with smoke odors. I was changed for another room without much problem. I did not like the low pressure shower head and the price ( circa EUR 30-35) of the breakfast. The restaurant is not well lighted and the food is ok but not worth EUR30. I liked the location and the pool. In general, l think the room was overpriced (360/night) and the service good but not like with the other Sofitel.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Groningen, The Netherlands", "Title": "“Oasis of tranquility in a hectic A'dam”", "Author": "RafaelRedczus", "ReviewID": "UR119676984", "Content": "Wonderful old building with a lot of cozy corners (old palace), great decorations (beautiful fresh flowers everywhere) with a mixture between classis and modern (award winning), very friendly service, central location (3 min. walk from the Dam), small but nice spa", "Date": "October 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "hong kong", "Title": "“Great location, good rooms, lovely historical building”", "Author": "anilegna", "ReviewID": "UR119462397", "Content": "First impressions of this hotel were good. Stayed here twice for six nights total over a two week period. The front desk staff were endearing, one let me check in at 7 am in the morning after a 12 hour flight, the other remembered my name as soon as I walked in the second time (impressed as this is not exactly a boutique hotel).Â  Location was very good, Â an easy walk everywhere whether to the shops, restaurants (ie Envy, Casa di David) or to the museums, and just down the street from Dam Square. Â Also the tram system is easy to use. Â Despite being in such a convenient location, there was minimal noise once in the hotel, just good old plain silence once back in room. Â Â  As is often the case in this part of Europe, the Â rooms were quite tiny, the first room I stayed in was slightly wider with two twin beds pushed together, the second room with a queen sized bed took up most of the space, there was a minature sofa and a small desk. Â I liked the bathroom more, it had a cheerful Â white/beige color tone, with heated towel racks, a shower space with super hot water (essential after walking around all day in the cold windy rain) and Hermes toiletries. Â  The gym was also small with one treadmill, two bikes and one elliptical. Â  Â The bar at bridges was beautifully designed, a welcoming haven (again after a long day walking in the cold rain), I didn't get a chance to eat at Bridges but it is a good looking restaurant. Â  I liked the fact wifi was free (or you could pay for higher speed at â‚¬17 a day.) Â The well designed and welcoming \"library\" in the lobby also had state of the art Apple computers, a convenient place to buy and print your museum tickets in advance. Â  Room for minor improvement: ~ room temperature was hard to control. Â There were times I'd like to have fresh air but the windows would not open. Also there were times the room was cold but the only working heat came from the towels rack, as the one by the window didn't work ~ housekeeping related: left my room at 11 amÂ one day, came back at 430 pm & room was being serviced, so returned after a drink at the bar & realized laundry did not get picked up, instead of shampoo and conditioner in shower was given shampoo and lotion, the water bottles were not replenished (happened more than once), then at 9 pm got a call from housekeeping asking if the laundry was mine as she got \"confused\" which room they belonged to. ... Sigh....", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manila", "Title": "“I had a grand time!”", "Author": "DramaQueenFlip", "ReviewID": "UR119461971", "Content": "We were a party of 7 and we stayed at The Grand from September 30 to October 3. The brick exterior was beautiful and the modern lobby was a good contrast to it. Check in was a breeze and guest relations manager Zsa Zsa even escorted us to our room. She was most friendly and helpful. Everyday before and after dinner we would enjoy drinks at the terrace, in the courtyard formed by the hotel's different buildings that were connected together. The staff at the terrace were friendly and very efficient. The concierge staff were also very efficient and helpful in terms of providing dinner reservations and transport services. The entire staff, from the restaurant to housekeeping to the doormen were the epitome of gracious, hospitable and efficient service. The bed in our room was so comfortable, if Amsterdam wasn't such an exciting city it might have been doubly difficult to get out of bed in the mornings. Breakfast was always delicious and had a good variety to choose from. The hotel was located only 5 minutes away from the red light district. We also booked a private dinner cruise and we were picked up by the skipper at the hotel's front door. The company's name is Belle Epoque and they served a 3-course dinner where each course was obtained from gourmet restaurants. From starter to dessert, it was well worth it! The skipper and her assistant were a joy to cruise with. I love Amsterdam and I love The Grand!", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "York, United Kingdom", "Title": "“Outstanding hotel - must stay”", "Author": "2809GPL", "ReviewID": "UR119380099", "Content": "Great hotel, wonderful staff. Stayed one night for business and had excellent, relaxing stay. Staff couldn't help enough and breakfast was outstanding. Worth every penny.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Fabulous”", "Author": "alex m", "ReviewID": "UR119376511", "Content": "I stayed at this hotel for 3 nights with my wife, before a business trip to Germany. The location is perfect, everything is close to walk distance. The staff was Ok, just a few confused during my check-in, but everybody were gentle and polite. The room was a charm! There is a restaurant in the hotel (The Bridges) with a wonderful food, excellent staff and a good price. Definitely we recommend the Sofitel Amsterdam.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Nice hotel fab restaurant but female staff a bit stepford wivesExpensive”", "Author": "Lizzyfa", "ReviewID": "UR119313882", "Content": "Hotel is central for walking around Amsterdam and is really comfortable we had a great bar meal one night and fantastic meal in the restaurant ..the best halibut I have ever had .I also liked the spa pool very quiet and a place for a peaceful swim The barman in the brown bar was also great . I did not however think the breakfasts were that good especially the cooked bacon and dggs ..with Stepford wives type waitress staff who were very polite but did not listen to what was asked for ..one welcomed a guest in front with \"welcome to France \" err what ? .I also hated the fact that staff repeatedly knocked or came into the room making all kinds of excuses , particularly on the morning we were trying to pack and get ready to leave.. just leave guests in peace", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Amazing Experience/will stay again”", "Author": "Ronnie S", "ReviewID": "UR119304148", "Content": "This hotel is absolutely amazing. They overlook nothing, down to the smallest detail such as Hermes bath products!! Check-in was a breeze. The concierge and front desk staff were super friendly and very helpful. The hotel itself, like the city has a long history going back as far as A 14th century convent. The room was very comfortable and particularly well designed. The room resembled a loft apartment. We enjoyed High Tea in the library because it was raining out and this was a fun experience. The entire staff is just very well trained and attentive. The hotel is centrally located in the most perfect location(in my opinon). Just a block walk from great food, Coffeeshops, girls in the window(if that is your thing, I was there with my girlfriend), The best parts of the Canal rings etc. Our room had a view of the canal and was very nice. The rooms were cleaned several times a day. Additionally, when we left the hotel in July, I left my flip video camera in the room. I realized this in September and after contacting the hotel, their security officer Mr. Crama gave me quick correspondence, located the camera and shipped the item free of charge. That is very rare, but not surprising for such an amazing establishment! I have stayed in many 4 and 5 star hotels worldwide and with all honesty, this is my favorite. I will never stay in another hotel when visiting Amsterdam.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lund, Sweden", "Title": "“One of my favourite hotels ...”", "Author": "Intrepid75", "ReviewID": "UR119158214", "Content": "This is a truly great hotel. The decor is really cool, the beds are superbly comfortable, the bathrooms excellent, the food is wonderful. But what makes a great hotel is the staff. I've stayed here twice this year. The first time I was really busy with work and was working at the business centre even after I'd checked out. One of the staff noticed that I'd been beavering away at my laptop for quite a long and asked whether she could bring me a drink. She then brought me a beautiful pot of tea (and I do mean the teapot was very beautiful, but it was also a very touching gesture). When I returned more recently, the person checking me in mentioned that on the previous visit I'd had a problem with room service (it was simply that because I was working I wanted to have dinner in my room and there did not seem to be a room service menu in the room, when I rang room service, one was delivered to my room very promptly) and that problem had been addressed and there were now room service menus in the room. That is really impressive service and excellent follow up by the staff. As much as I love Amsterdam, I will return simply to stay at the Grand.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Berlin, Germany", "Title": "“somthing else”", "Author": "john a", "ReviewID": "UR119071576", "Content": "very nice hotel near the canals of amsterdam. nice historic building. great servise and great rooms with comforteble beds . good breakfast", "Date": "October 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Not worth the money.”", "Author": "beefeater34", "ReviewID": "UR119001140", "Content": "Booked room type (deluxe king) not available \"due to construction\" but only found out when we got to the room. Large cobweb in the room and stained grouting in shower area. Room service order delivered incorrectly. 7am alarm call received, waking us up, which we'd not requested! The hotel is in a very good location but so are many less expensive ones! Sofitel are off my list - this is meant to be one of their best and it's really not that good.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "", "Title": "“1.40m beds in doubles for a 5*hotel... I guess not!?”", "Author": "MilesandMore123", "ReviewID": "UR118919208", "Content": "Lets start with what I liked: -very nice decor and atmosphere. -very nice breakfast -very good concierge service -on average nice and friendly staff -rent of bikes and motorcycles on site -the cosy atmosphere of the pool -the fact that the managerial staff came twice gently to apologize about the bed issue What I disliked: -size of the double beds in superior rooms, 1.40M is a SCANDAL for a 5 stars hotel!!! -when mentioning the bed problem to the check-in counter the fact they lied to me and claimed there were no bigger beds in that category.... funny to see later the room of a friend with a normal king size bed! -not enough machines in the gym -I had to wait 10min in the breakfast room before somebody finally took care of us, took another 5 minutes for our table to be cleaned and setup. -the fact that the Sofitel site, who claimed they have the lowest rate and/or to adapt, even grant a reduction of 10% if a lower rate is found with same conditions, refused to do so, although I've send them all the proofs/documents!? Would I go back there!? I believe I would, should I manage to get a good deal, as I really liked the decor, and the atmosphere but not without the assurance they give me a room with a normal bed!", "Date": "October 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Malibu, California", "Title": "“A Gracious Staff Surround by a Beautiful Hotel”", "Author": "BRNR", "ReviewID": "UR118705914", "Content": "This hotel exceeds the beauty of the canals of Amsterdam and its own historical building with its superb staff. We have traveled extensively throughout the world staying in many 5 star hotels, and have had the \"butler\" experience before: the guy who shows up in tails to shake your hand who you rarely see again. This hotel's butler service is honestly a butler service. We had as our butlers Bart and Luis. They were extremely helpful in terms of sharing their knowledge of the city, making reservations, assuring that your room was to your satistaction, noting your individual likes and dislikes, even down to personally delivering your room service order, inquiring if your would like them to pack or unpack your bags, etc. Bottom line, their service was so exquisite, you hated to leave the hotel. The hotel itself is beautifully appointed and very conveniently located. They are right on one of the canals. Walk in one direction and you have great pubs or cafes as they called them. Walk in the other and you get a first hand look at the red light district. Their breakfast is not to be missed and do not leave without eating their waffles. These are not your normal fabulous waffle. These are small pieces of indescribable heaven on your plate. We were on day one of our stay and already planning when we could return. You will feel at home and welcome in the beauty that is the Sofitel The Grand Amsterdam.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Den Haag", "Title": "“Excellent”", "Author": "SusanGrogan", "ReviewID": "UR118616932", "Content": "We stayed for one night on a Sunday in September to celebrate our wedding anniversary. From the moment we arrived until the moment we left the service was excellent. The hotel delivered a complimentary bottle of champage to our room which was well received! The room was great and the bed very comfortable. The hotel breakfast was delicious. I read some reports that the breakfast area can get over crowded but it absolutely fine for us, however it wasn't a weekend. The location is ideal too. All in all I would thoroughly recommend this hotel.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Definitely stay here as the service is outstanding and the best we had on our trip”", "Author": "jean_mar_10", "ReviewID": "UR118590000", "Content": "This is a great value,the staff are warm and welcoming,the rooms are wonderfully well-equipped,the breakfast is excellent,the location is perfect and the whole hotel is spotless. Everything was great, they had free wifi,a balcony,laundry service,breakfast included,and they were happy to help with whatever we needed.The hotel itself was very clean & comfortable.", "Date": "September 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fayetteville, Arkansas", "Title": "“Spectacular!”", "Author": "Hope B", "ReviewID": "UR117944697", "Content": "I can't fully explain how much we loved this hotel. After our long flight overseas, the train ride into the city and carting our luggage through the streets of Amsterdam... to be welcomed at The Grand was the best. We were upgraded to a Junior Suite, with a beautiful view over a quite canal. The room was stunning. I love the style and detail of everything at the hotel. The staff was beyond gracious! We had dinner one evening at the restaurant, Bridges.... it too was wonderful. The location is great, close to Dam square. The concierge provided wonderful recommendations for other restaurants. We were delayed returning to the states for two nights at the end of our trip, because of the hurricane that hit New York. We immediately called and booked at The Grand. It was like a mini-return home....after having been traveling for three weeks. I really can't say enough wonderful things about this hotel! I will recommend it to anyone I know going to Amsterdam! It is spectacular!", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Queensland", "Title": "“Good location”", "Author": "greynomad16", "ReviewID": "UR117519656", "Content": "We only stayed for 2 nights in a junior suite which overlooked the canal. We had a third bed in a twin room. The extra bed was very comfortable but it left only a small amount of space in the room. The room was really only big enough for twin beds. The hotel was clean and in a good location to easily walk to Dam Square. Would have liked more time to explore Amsterdam", "Date": "September 1, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“This one gets a 4.5”", "Author": "SkyeTraveler", "ReviewID": "UR117457768", "Content": "I've stayed in the Sofitel New York a few times, and it's one of my favorite hotels. So I thought I'd give this one a go. Overall, we liked it a lot. It's in a large, historic, very interesting building -- they have a guided tour that unfortunately we didn't have time to do. Our luxury room wasn't overly spacious but not oppressively small either. The bathroom, with tub and separate rainshower, was modern and sleek and looked like it had been recently renovated. We requested a canal-side room and that's what we got. Dinner at Bridges restaurant, which specializes in seafood, was outstanding (but I would have liked more vegetables please!) I wavered between giving this a 4 and a 5 for a number of (probably overly picky) reasons. But here goes. Breakfast was included in our rate. It's served buffet style, and there are also some cooked items that you can order separately. I've rarely found a hotel that does this well. Because guests serve themselves, and the staff are constantly having to clear tables, take orders, and replenish the buffet items, the result is chaos. I had to keep dodging staff who were walking briskly, loaded down with dishes. If you want to order something from the a la carte menu, you have to flag down one of the waiting staff, and this can be hard when the restaurant is busy. One morning, the main restaurant was full, so we were directed to the overflow room on the other side of the hotel. It was a nice room and actually quieter. But they ran out of some items that took a while to replenish. The hotel has a swimming pool as well as sauna and steam room, which is all very nice. But there's nowhere to lounge around the pool. So apparently the idea is that you swim, maybe go into the sauna or steam room, then leave. Which is not as relaxing as it could be. The hotel is on the border of the red light district, which is seedy in a safe sort of way. If you turn right when leaving the hotel, you're in the Amsterdam of a thousand bachelor parties; turn left and there isn't a single brothel in sight. I think this was okay for one night, but three nights of it was a bit much for me. The fact that you enter the hotel through a courtyard gives you the sense that you've left that all behind. But even so, next time I may try a hotel in a less risque part of town.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Rossendale, United Kingdom", "Title": "“Thank you the Grand,our 14th Wedding Anniversary we will never forget.”", "Author": "FALLINGWATERS6700", "ReviewID": "UR117414438", "Content": "We have just returned from our trip from Amsterdam, where we stayed at this wonderful hotel, from the moment we entered the beautiful court yard we were treated exceptionally well. We were upgraded to a suite which was a wonderful surprise of which we thoroughly enjoyed. The staff here make your stay perfect nothing is to much trouble. The hotel surroundings are sumptuous and everywhere is immaculately clean. The breakfast is wonderful with a buffet and hot breakfast and champagne included. If you want somewhere extra special with great customer service and very central this is the hotel for you.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Ireland", "Title": "“Pricey but fabulous”", "Author": "kitty064", "ReviewID": "UR117268127", "Content": "Lovely hotel, very central but quiet. Fantastic beds Great internal courtyard garden, perfect for balmy summer evenings. And on cooler evenings, they can give you blankets!", "Date": "August 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, UK", "Title": "“Just prefect!”", "Author": "BusinessJumper", "ReviewID": "UR117187946", "Content": "I spent a couple of days at the Grand with some colleagues preparing for a big meeting and it was just awesome. Rooms were great, service perfect, great vibe, fantastic restaurant, extremely central location - particularly if you want to see the - shall we say - real Amsterdam. I can highly recommend it if you have the cash. It's worth it!!", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Conakry, Guinea", "Title": "“Great Hotel in the heart of Amsterdam”", "Author": "Selayzim", "ReviewID": "UR117142309", "Content": "This hotel is all about feeling good. For start you are in the heart of Amsterdam, close to the major atractions. The rooms are very confortable and the toilet was one of the nicier I ever seen, I really enjoyed the dark atmosphere on it. I will not keep longer, just like to say that is probably one of the best hotels in Amsterdam with a reasonable price for what it offers and you wil feel like a king after coming back from a fun night in Amsterdam to rest in this luxury Hotel.", "Date": "August 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "dubai, uae", "Title": "“If you can... Do it!”", "Author": "abu-noah", "ReviewID": "UR117012586", "Content": "I have stayed in many gorgeous hotels in the past, but this one beats most of them on many grounds: 1) it's in amsterdam! Old Europe, home of tiny houses, cramped hotel rooms, dark hallways.. Yet the grand is, well... Grand... Spacious, luxurious, airy, light.... The courtyard is gorgeous, the garden is peaceful, and the room was beautiful. 2) the service is something I had not had for a long time in Europe. I am not saying that european service is bad... No, just that Asian and middle eastern (read, dubai) service is just better... Well, the grand was definitely at par, with dubai... Except that it felt geniun...so actually better than dubai 3) location location location: perfect! 4) price: steep. But then again it's the Grand... If you can afford it, if u can smuggle it during a business trip... Do it!", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Old World Hotel”", "Author": "SAM5000", "ReviewID": "UR116206670", "Content": "A classic old world style hotel. Although only a block from the red light district, it felt worlds apart. Enter through a grand courtyard. The hotel was beautiful. Rooms were small but not tiny. Excellent furnishings. Rooms on back canal can be loud, especially when trash is collected. Staff was very good with suggestions and help. Loved the spa area. Nice indoor pool and workout area, though it needs more seating area at pool. Rooms are not as expensive as they could be, but everything at hotel is pricey. We skipped the overpriced breakfast buffet and ate down the street.", "Date": "August 3, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Portland, Oregon", "Title": "“Perfect central city hotel.”", "Author": "OregonStateTravler", "ReviewID": "UR116034487", "Content": "We stayed at The Grand Sofitel in Amsterdam on the nights of June 4, 5 and 6 in suite 336. Two other couples in our traveling party also stayed at The Grand on the same nights at our recommendation. WE ALL HAD A VERY ENJOYABLE STAY. From my first contact with Sanne Pisters in reservations to the last contact with the concierge as we all left for the airport our stay WAS PERFECT. You have a wonderful property. I own the Ocean Lodge and The Lodges at Cannon Beach in Cannon Beach, Oregon a beachside town located 90 minutes west of Portland Oregon so I know good service when I see it. Your rooms were clean and well appointed. Everything worked properly and was explained by the valet. Your morning breakfast buffet was very complete including the hot entrees we ordered after getting fruit and pastry. The Grand is a wonderful spot to stay because it is central to all of the activities we planned. Once day four in our group went to the train station and rented bikes to ride the dikes across the river, two others walked to the Zoo. Others went to the Anne Frank House, on canal tours and to museums. At the end of each day we met back at The Grand for a quiet moment of respite. We enjoyed two late evenings outside in the terrace bar and one room service when one of our party twisted a knee and needed a night off from walking. Your concierge selected perfect places for us to eat where they clearly knew we were Sofitel guests. Each night we had a nice hot shower and then fell asleep in the wonderful beds - ready for a new day, All of your employees made us feel at home and we will be returning to The Grand when we take a cruise from Amsterdam to Basel, Switzerland.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Kuwait", "Title": "“Superb”", "Author": "xinki", "ReviewID": "UR115995885", "Content": "Sofitel's renowned service in addition to Dutch hospitality have made our stay at this hotel a wonderful experience. The contrast of modern furnishing in a historical building dating back to the 1500s makes this hotel ideal for a romantic getaway. The guest relations manager greeted us from the lobby and escorted us to the room. The entire staff were eager to please us. The guest-staff get together on thursdays with flowing champagne glasses and finger foods is just one example of the warmth and hospitality you'll expect. Dam square is right across the corner and the red light district is a five minute walk away, making its location ideal regardless of what your idea of fun is. The beds were extremely comfortable and the view of the canal from the room was just perfect. I highly recommend this hotel to everyone and I would definitely stay there if I ever go to Amsterdam again.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great hotel and Location”", "Author": "JenM72", "ReviewID": "UR115907517", "Content": "Stayed here for about 10 days in July. Staff were extremely friendly and helpful. Rooms were normal size for European standards, with a nice bathroom and good range of Hermes ammenities (though for me, they felt more a scent men would prefer than women). Bed was softer than I am normally use to, but comfortable none the less. Use the free \"low speed\" internet in my room, which met all my needs e.g. could still do skype video chats etc. My room faced the inner courtyard, so was very quiet. Breakfast is very good, but you have to order hot food (so if you are in a rush, order it as soon as you step inside). Hotel is about a 10 minute walk from the main train station, and just on the edge of the red light district and shoppin area. So you are not in the middle of any, but only a stones throw away, which made the hotel very suitabel for me (ie all the convenience without the noise, but again I had a inner courtyard viewing room). lastly, there is a gym, but it is very small with just a few cardio machines and some weights and one other machine. Only 2 small negatives were , the room rate is not cheap for those on a budget, and the lift if you need it is al little slow. All in all, a great hotel, good location, nice rooms, and friendly staff", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "", "Title": "“Won't come back again”", "Author": "lovetotravelhk", "ReviewID": "UR115879456", "Content": "We had a good stay at this hotel 10 months ago, and decided to stay here again. When we first arrived it was all good and we were greeted by a very helpful guest relations manager and shown to our room. The experience turned for the worst the night morning when we went for breakfast the next morning. Understandably it was a Sunday morning at 9.30am so it was packed full. The restaurant is composed of mainly a few large square tables of 8 which means you have to share your breakfast table with 2-3 other groups of guests if the restaurant is full. Otherwise you wait until a table is free - could have been at least half hour. Not a very nice \"first thing in the morning experience\" to share a table with strangers, especially when breakfast costs â‚¬33 per person. Service was slow at breakfast and we were not even served our coffees until we had almost finished breakfast. We also had to flag down staff to order our coffees and hot food. Again for â‚¬66 this has to be the worst and most expensive breakfast ever. We were in our room getting ready to check out before 12pm and we had 2 staff ring our bell wanting to get in the room. It was really disruptive as we obviously had not checked out so room could not be cleaned yet. Not sure if this is their way of scooting guests out of the hotel. When we went down to the lobby to check out, there was one long queue of about 5 groups of people waiting to be served by 2 staff. I got in line but when I got to the front of the queue another line had formed behind the desk of the second staff - effectively pushing in. The staff paid no attention and just served whoever was in front of her desk. This has got to be the worst service on check-out I've ever had. I must have waited for 15 minutes but people who pushed in did not even had to wait 2 minutes. The arrangement at reception should be made more clear to avoid misunderstandings. Even though the hotel bill had a â‚¬50 charge for overnight parking the front desk staff asked if I needed transport. Mmmm... There were some exceptional staff at this hotel but it's typical Sofitel which I have found really is a Novotel that is better designed and decorated with designer toiletries, better bedding and a fancy restaurant and bar. Attitude is the same as any other mass market hotel chain mentality. As we were dragging our bags out to the car, the front door staff just watched us and only offered to help when we were moving our last one, which was really funny. There is no bath in the superior rooms but shower only. The shower head had very poor low pressure even though it was about 20cm wide. The rooms facing the front can be noisy as well. Overall it's a nice hotel on the outside but they need to improve on the \"software\". They also opened a spa and swimming pool on the 1st floor since the first time we were there.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“What an amzing hotel”", "Author": "londonha8", "ReviewID": "UR115819387", "Content": "We had the most amazing time in Amsterdam and the hotel was the best we have stayed in, everyone was so helpful with such comfortable room & beds, my wife loved the way when we came back from our evening out to find our curtains had been closed :-) . we would deffinatly stay again. Loved the pancakes at breakfast.", "Date": "July 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Perfect antidote to the weather...”", "Author": "kitkat1717", "ReviewID": "UR115786472", "Content": "Amsterdam can be a bit rainy, which is to be expected, but on one of our days it was absolutely torrential all day. This is the perfect hotel to be as we never had to leave. we ventured out into the cold and rain for a bit, but came back to a spa visit and a little time in the sauna to warm up. Service here is definitely first rate, Gabrielle went out of our way upon check in (room was not ready) - but we had an upgrade to a junior suite and their IT person came by while we were waiting and hooked up our internet. From making dinner reservations to ensuring all our needs were met, this hotel met all of our needs. Central location and very easy to navigate from there.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Stamford CT", "Title": "“Pretty Grand”", "Author": "billyboy18", "ReviewID": "UR115650831", "Content": "First off, the location cannot be beat. While it is a block off hte Red Light District, it is like a little oasis--very quiet and relaxing. I would recommend you opt for a canal view room as it is just beautiful viewing the canal, especially in the middle of the night. The price was reasonable for a 5 star hotel. The room was comfortable if a bit tight. The bathroom was narrow and a bit weird. The hotel restaurant (Bridges) was just ok--a bit pretentious and overpriced--but the breakfast buffet excellent at 33 Euros. The pool was small and changing rooms tight but nice to have. Check in easy, nice outdoor courtyard and small bar. Coffee shop Greenhouse down the block with a friendly mix of folks. All in all, a great experience with a few minor flaws.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "glos,UK", "Title": "“A Lovely Hotel”", "Author": "jaclh", "ReviewID": "UR115320988", "Content": "We have just returned from the Sofitel, which is in a very lovely building with warm, welcoming and attentive staff. Everything is done to ensure that their guests feel comfortable. Breakfast is a sumptuous affair - probably one of the best I have had anywhere. So good in fact that we just lingered for much longer than we would normally do over breakfast. Ours was a ' superior ' room and whilst being very comfortable, was quite compact. The pool is calm and peaceful and very welcome after a busy sight seeing day. The location of the hotel is perfect as most important locations are within walking distance (or borrow/hire bicycles from the hotel). The only thing that would have made the stay perfect was if our bed could have been made properly, without any creases in the too large quilt cover for the quilt, & if the bottom sheet had been properly laid on the mattress so it could be firmly tucked in. I had to remake the bed on our first 2 nights & yes I could have called someone to do it, but we were ready for bed & had already got in to go to sleep, so it was just quicker & easier to do it myself. I told reception about it after the 2nd night & certainly it was better on the 3rd night, but I still had to readjust the (now better fitting) quilt cover to get rid of the creases on the underside of the quilt. It is really not difficult to make a bed and in a hotel like this it should be perfect. Once the bedding was properly in place, we slept really well as the beds are very comfortable. So overall, if you get a maid who can make a bed you will have a lovely time in this hotel. If I knew I wouldn't have to make my bed I would be happy to stay again!", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Amazing Stay - wouldn't stay anywhere else”", "Author": "rc127", "ReviewID": "UR115133935", "Content": "Sofitel The Grand was our second stop on a 4 stop honeymoon. The hotel gave us a complimentary upgrade and champagne to celebrate the occasion. Aside from the upgrade, the staff was extremely warm and welcoming upon check-in. They escorted us to our beautiful room which overlooked the courtyard and walked us through all of the features of the hotel room. The room was well decorated and very clean. The bathroom was amazing, with a dual head shower, a large soaking tub and his and hers sinks. Also, the location of the hotel itself was great as we were within walking distance of the city center. We both used the gym, swimming pool and steam room (all complimentary) during our stay. While the gym was definitely tiny, the indoor pool was a decent size. The conciergeâ€™s recommendations were all a hit from Pancake Bakery, to a new Vietnamese restaurant, to a great wine bar. Even though the weather wasnâ€™t ideal (pockets of rain the whole weekend) our trip was excellent because of Sofitel The Grand. We will definitely be back and wouldnâ€™t think of staying anywhere else!", "Date": "July 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nunspeet", "Title": "“Just perfect..”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR115007681", "Content": "We had dinner in the restaurant and the food was just perfect. What a beautiful atmosphere and nice people. We stayed in a Prestige Suite (124) and the room was very, very nice. Could not be better. Very spacious and clean. The service we had was outstanding, especially at Reception and Guest Relations, beautiful and very kind ladies!! We defenitely are going back to the Grand. What an amazing hotel..", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Braintree, United Kingdom", "Title": "“Pampered”", "Author": "rj_watters", "ReviewID": "UR114634106", "Content": "Service second to none, we have stayed here before and was well worth going back, and will use this hotel in the future, friendly staff, in the middle of the town easy access to night life etc.", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Australia", "Title": "“exqusite accomodation in ideal location”", "Author": "aurorasev", "ReviewID": "UR113372065", "Content": "stayed here for 4 days in May 2011 within walking distance of the central train station as well as the Dam area it is an oasis in the busy and touristy area The architecture and interior decoration is truly exquisite, there is a large flower filled courtyard to relax in, and the staff are very professional and helpful", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“great hotel! it made our trip!!!”", "Author": "mohkh", "ReviewID": "UR112393314", "Content": "i visited this hotel with my girlfriend on June 2nd for 3 days and had a great great time! they upgraded us to the William suite and offered great service all around , i specially want to thank Mauricio and Domingo who were our butlers and were of great assistance , i cannot recommend this hotel enough , if you want to visit Amsterdam and want a genuine 5 star experience look no further. other perks are great location, and the best in room dining you can ever taste! try there daily chocolate dessert and the 4 cheese pizza! to top it all of they have a horse carriage downstairs that can take you anywhere!", "Date": "June 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“Excellent hotel, amazing, renovated room”", "Author": "Chris015", "ReviewID": "UR111828800", "Content": "We spent 3 nights at the Grand and stayed in one of their newly renovated apartments, truly amazing with its oversize living-room (complimentary nespresso machine included) and bathroom (best shower ever) and its quiet, comfortable bedroom. Nice view on a small canal (sleepy swans drifting slowly at night, their neck twisted back to rest their head on their feathers, a sight to be seen). I stayed in this hotel 5-6 years ago and it looks so much better now : I remember a very outdated decoration in the bedroom but everything looks fresh now. There were beautiful pink and violet tulips everywhere in the hotel, it was gorgeous. The breakfast room is impressive, not to be missed. Breakfast itself is good although not as good as Sofitel London or Berlin. The food at the restaurant was good, not amazing, and the service a bit slow although restaurant was only half full. Location is very good, red light district very close but you wouldn't believe it, there was absolutely no nuisance from it. Would definitely recommend.", "Date": "June 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bordeaux", "Title": "“Not cheap, but worth every penny”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR111492675", "Content": "Stayed for the weekend - first visit to Amsterdam so played safe with the Sofitel. Great staff, great welcome, beautiful room with some very original features. A Krups Nespressomachine was a welcome find, as was the excellent shower. The bed was probably the most comfortable I have ever slept in, and although it's a noisy town, the bedroom was completely insulated and the windows overlooked a quieter canal behind the hotel. Almost didn't want to go out...", "Date": "June 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jersey", "Title": "“One of the best hotels in the world”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR110803697", "Content": "We have been lucky and stayed in some great hotels over the years but our recent stay Sofitel The Grand was one of the best. From the moment we arrived the staff could not have done more to help every single person was excellent and really cared about making a difference to our stay. They fused over our little boy and made him feel welcome which is not always the reaction in hotels. The room was superb, big and comfortable with a great bathroom. Swimming pool was great and food both in room and in Bridges was great. Although not the cheapest hotel it was money well spent and good value. Would definitely recommend to anyone. It really is one of the best hotels in the world.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Miami, Florida", "Title": "“A mediocre hotel without attention to detail”", "Author": "aj005", "ReviewID": "UR110758210", "Content": "I stayed at the hotel for a few nights at the end of May 2011. What seemed to be nice upon arrival, turned out to be less than pleasant later.... Pluses: + location Minuses: - canal view room - very loud at night (people coming back from parties), at dawn and early in the morning (trash trucks) - the door bell did not work in the room, so a few times per day, different staff members would enter the room unexpectedly without knocking on the door - the light bulb in the bathroom did not work for the whole stay - no one bothered to fix it for 3 days - dog's poo in the pool, the cleaning lady said \"I cannot swim, so my friend will come soon and take it out\", next day there was just a little mark on the wall after fishing it out.... - a prebooked gift package that never arrived - I did approach the floor manager before checking-out and informed her about all of the above - she suggested a fruit cocktail..... In summary, certainly not a five-star hotel. Not recommended.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Portland, Oregon", "Title": "“Convention/meeting Hotel”", "Author": "AlanZ07", "ReviewID": "UR110638689", "Content": "My wife and I stayed at this hotel April 30- May 2. We got to the hotel at noon; check-in was 3 PM. Front desk finally gave us a room at 4:30 PM. The room they provided was on two levels Bed on lower level and bath and closet up 5 steps. Very challenging to maneuver around and use toilet at night. We spoke to many people and a lot of them got stuck with this type of room. Breakfast was included and dining room was disorganized. You had to hail servers to get tea, coffee or hot food. Cold food was buffet. Quality was good but a pain to constantly get someone to bring hot items. This is a big hotel in an old building which could not be renovated sufficiently to keep old world charm with modern conveniences. The service in this hotel is poor, the rates high and they are disorganized. My wife and I are from USA and a fellow guest from Germany commented about the many quality problems at this hotel. I would avoid this hotel even if they offered a great rate.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Without doubt or hesitation the best hotel in town...”", "Author": "dutchboy81", "ReviewID": "UR109330655", "Content": "Let me start with the only and I mean only negative thing to this hotel... They will say \"Bonjour\" wherever you are, reception, bar, restaurant and even housekeeping says it! I questioned this when I stayed at the Sofitel in Budapest last year and they explained that as Sofitel is the top brand within the Accor (French) hotel chain, this is therefore an instruction they receive from their head office in Paris to welcome all clients with the French Bonjour... But of course do it when you know a guest is French but when I stay at the NH Barbizon Palace I will not be greeted with a \"Buenos dias\" referring to their Spanish heritage. (I think it is clear from the above that France will never be my chosen holiday destination lol) But too many lines spend already on the the bad, back to the REALLY good: - Location = 10 minutes from Central Station - In red light district but as soon as you enter their courtyard, you honestly wouldnÂ´t know! (Red light district is traditionally one of the safest areas of Amsterdam due to huge police presence) - This hotel is pure luxury but at the same time VERY suitable for people that can afford luxury hotels but donÂ´t want the snobbish part of it. (eg Ritz London, Four Seasons George V Paris etc) This really does not mean though that this is not a top hotel, but it just feels naturally chilled. The staff have a uniform that does not involve ties but still look EXTREMELY smart so again not sure who came up with the idea but TOPCLASS. Upon arrival we were greeted by the doorman who took care of our luggage and brought us to reception where the very friendly Front desk staff checked us in quick and we were taken to our room by a member of staff. the luggage at that point had already arrived there. The rooms were immaculately clean and spacious and while it may seem strange, but I was travelling with a female colleague and the room she was given was really a feminine room with soft tones and just girly chairs etc, while mine was with open brick work, hence giving it a more masculine feeling. Really liked this touch but not sure if it was done on purpose or if this was pure coincidence but nevertheless nice. In the room there were 2 apples on a plate which were really juicy and nice. Also the turn down service is just nice but naturally is expected from a real 5 star but again the little chocolate was delicious. The bathrooms we had were with walk-in shower only but apparently this is with all the base rooms and from the luxury rooms onwards the rooms come with bath. For me this was not a problem and think most business people would not waste their time in a bath tub anyway. The room was also equipped with a Krupps coffee machine and a dvd player. The beds... oh the beds... WestinÂ´s heavenly and Marriott beds are nice and comfy but I never had a problem getting up, here however 3 mornings in a row I overslept!!! Eventhough I got my wake up calls and my phone alarm snoozed me twice I was almost late for my meetings 3 times... So due to the above I only managed breakfast once, which was a shame as it was really diverse and plentiful. Again the staff amazing with eye for detail, if my cup as not even half full it was topped up again so really really EXCELLENT! Large selection of cheeses, meats and juices and a large hot buffet too. Anyway, I have stayed in many hotels in Amsterdam but this by far tops them all. As for the people that call this hotel expensive, yes there are 5 star hotels in town that are cheaper (NH Grand Krasnapolsky, Marriott, Renaissance etc) but for me these hotels are not the real 5 star hotels of Amsterdam. (and comparing the rates of Sofitel to the Pulitzer, Dylan, De LÂ´Europe or the Amstel Intercontinental, I found their rates to generally either match or are better but maybe I have been lucky. lol) Anyway to finish off, if you have the chance: You cannot go wrong here, definitely recommend this place for a good night sleep and top class experience!", "Date": "May 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hemel Hempstead, United Kingdom", "Title": "“Well worth it...”", "Author": "Boyds_TSB", "ReviewID": "UR107687062", "Content": "A beautiful Hotel from start to finish. Lovely room overlooking the canal, fantastic bed!...so comfortable. Excellent service. All in all a great place to stay - will go back.", "Date": "May 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Just great!”", "Author": "jfdx Posted by an Accorhotels.com traveler", "ReviewID": "UR106856367", "Content": "Wonderful stay in the heart of Amsterdam! The restaurant serves amazing seafood, the bar is cosy and opens on a intimate garden. Service is elegant and friendly. There is a fireplace room next to the lobby where it is nice to relax and have a drink after walking around Amsterdam. We'll come back!", "Date": "May 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Clean, friendley, central”", "Author": "tedsca", "ReviewID": "UR106196117", "Content": "Stopped there for 3 nights and was very well looked after. food and service is fantastic!! It is in the centre of amsterdam turn right out the hotel and your in the red light district, but you wouldnt know from inside the hotel. turn left out the hotel if you want to avoid the red light area. Anyone put off by this should reconsider visiting the city as you will stumble unplanned into the red light area where ever you stay. Loverly building (where the queen got married), fantastic staff, swimming pool, gym all things considered you must stop there", "Date": "April 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Not really 5-star”", "Author": "brittripper", "ReviewID": "UR102265316", "Content": "Strange hotel. Charming staff but rather naff decoration, a bit like mid-range Ikea circa 1995. When this hotel was Sofitelled it probably looked quite trendy - for about a year. Now it is horribly dated and just a bit too expensive. Why do Sofitel have to try to be \"modern\" when country house classic would not have dated nearly so fast? Our room was pretty hideous and totally lacking in zen: duck egg blue on three walls and burgundy flock wallpaper on the fourth. On one wall was a floor to ceiling stencil of Rembrandt's cavalier. Couple that with the two tone burgundy-brown carpet and you have a right old mess. And all this for getting on for 400 euros per night. Also, the hose between the bath taps and shower fitting was missing, meaning a gush of water across the bathroom, and the pay per view in house movies kept stuttering and stalling. Nor did the promised free newspaper turn up on either day, and on the first night there was no turn down service. That said, the room was basically comfortable and quiet if a little chipped round the edges (bit of skirting board missing by the bed), and the bed very comfy indeed. Staff very nice. Breakfast expensive and nothing to shout about but you expect that in a so-called 5-star hotel.", "Date": "March 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Outstanding”", "Author": "clays4sue", "ReviewID": "UR100419090", "Content": "We loved staying here. We realized it was a splurge, but it was worth it. Every aspect of our stay was wonderful. No one mentions the amazing exterior detailing of the hotel or the courtyard entry. Very charming. The Guest Services person, Zsa Zsa, went out of her way to greet us and treat us warmly. My only complaint is that is was several blocks from the nearest tram. The pool, although below ground level and small, is still lovely. I don't think it would be my choice with small children due to its sophistication.", "Date": "March 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Duluth, Minnesota", "Title": "“Top stay in Amsterdam - can't go wrong”", "Author": "boogiedown26", "ReviewID": "UR98962010", "Content": "The Sofitel is located right next to the RLD. Even in cold weather, it seemed to be a short walk from everything. We stayed in a suite that offered butler service. The service was outstanding. We have stayed at other top hotels/resorts (Four Seasons, Ritz) and this particular Sofitel location was up to snuff. Luis and Domingo went out of their way to help us out, as did the check-in staff. We also used the amenities (indoor pool) and my wife and her sister used the spa services. Great time! They also have working Macs with printers in the lobby area that came in really handy.", "Date": "March 5, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“AAAAAAAMAZING”", "Author": "royroy65", "ReviewID": "UR98700047", "Content": "My lovely Boyfriend took me the the Sofitel for a pre- Valantine weekend I have never ever stayed in such a grand hotel befor and felt like Julia Roberts from pritty women ( not that i,m a hooker nor am i a woman ok or pritty ) From the moment we steped out of the taxi we were treated like kings ( ok Queen then) i still look at my photos and dream of what a wonderful time we had ............................ i,m sure i will be back one day................. 11 out of 10", "Date": "March 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“A Grand time on the Canal...”", "Author": "gigi35805", "ReviewID": "UR96886356", "Content": "A truly beautiful and histoic building...a magnificent structure built in the 1500's but updated with the latest modern designs inside. A great mix. Very nice service from housekeeping and in the restaurant. The concierge staff was also top notch. We had a couple problems with front desk not understanding our needs due to language, but otherwise they tried very hard to assure top level service. The location was also wonderful since it allowed us to be a little off of the main streets but within a few short blocks of Dam Square and was able to walk to the Rijksmuseum (20 minutes tops) access to a number of the main attractions. Each morning we awoke to a view of the canal with a dozen or so swans swimming and the hooves of horses with carriages on the small road across the canal. We had a junior suite - it was spacious and had nice decor. Loved the bathrooms! And the turn down service with chololates on each of the nightstands. Only downside was they did not have the room down free (they understand the word feathers more than the word down) - so we had to order that again and wait, and the TV was not working and the phone had issues. The service people were all very nice though. Just a small pain to not be able to really relax till all the service folks came and went.", "Date": "February 16, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Wimborne, United Kingdom", "Title": "“fautless what an amazing hotel with amazing staff”", "Author": "gazza2303", "ReviewID": "UR96562919", "Content": "the location the staff and the whole experince was simply amazing . every hotel in the world should base there customer experince on this one.are personel butler louis was a true gent.", "Date": "February 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Austria", "Title": "“Great hotel - wonderful Imperial Suite”", "Author": "flo147", "ReviewID": "UR95759999", "Content": "Hotel The Sofitel The Grand is a really amazing hotel. It is not an 'ordinary' Sofitel hotel, it is a so called Sofitel Legend hotel, which just a few Sofitel hotels get awarded with. The hotel was really nicely decorated over the X-mas session 2010. After a few discrepancies (expedia made an error concerning the room category), which were handled in a real professional way by the young receptionists, our butler Domingo showed us the way to our Imperial Suite. All in all, the check-in was fast, professional and moreover all A-Club Platinum benefits were given. They even went a step further than the published Platinum benefits (one room category upgrade) and did not walk us for the last days - many thanks to Mr. Hogetoorn for this pre-X-mas-present ;) Rating: 9.5/10 Location The location is exceptional - you are in the middle of Amsterdam when you step outside of the hotel. All main sightseeing attractions are close by. To compare it with their immediate competitor the IC Amstel, it is much more convenient and you really can feel the old charm of the city of Amsterdam when you stroll through the iconic canals just outside of the hotel. Rating: 9.5/10 Service The service is top-notch. First of all I really have to say a big thank you to Domingo. He was here for us whenever we needed something and w/o him we probably would have spent X-mas in Amsterdam due to the snow chaos. Compared to other properties, which offer butler service like the Burj al Arab, the Touessrok or the Townhouse Galleria, the butler service at the Sofitel The Grand was much more private and all in all much better than at the mentioned former properties. Also the guys at the reception greeted me every morning by name (but next time please not so formal :p) and also did a great job, as I already have mentioned. Service compared to the IC Amstel was also much better. Clear win for The Grand again. Rating: 10/10 Food Breakfast is compared to other hotels maybe a bit pricy but definitely worth it. You get champagne as well as nearly everything you could dream of. As far as I remember, I just missed a natural yoghurt there on one day. Room service is also efficient and tasty. We had dinner always outside at awesome restaurants due to the suggestions of Domingo. Rating: 8.5/10 Room I just say Imperial Suite. Well, the room was really cool. Big living room with working desk, 2 Nespresso machines, steam bath, awesome bed (I need such a bed at home too, so ship it over to me lol), 3 LCD TVs and so on and so on. The best thing is when you simply scroll through my pictures, then you will get the impression of this room ;) Compared to the IC Amstel, where we had an Executive Suite, the Imperial Suite was definitely bigger - around 110sqm - but still lacked a few things. I missed a bathroom scale and maybe some more amenities like a toothbrush. But I have to admit that you will get such things when you say it to your butler. Maybe a running map in pocket design could maybe also be provided in the room. But everything else, from the fine towels to the Hermes toiletries, was just outstanding. Rating: 9.5/10", "Date": "February 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "desenzano del garda", "Title": "“Very good Hotel”", "Author": "marckred Posted by an Accorhotels.com traveler", "ReviewID": "UR95338739", "Content": "Very good Hotel, good position, good elegance, good services, good rooms, a really pleasure!!", "Date": "February 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "silicon valley", "Title": "“Best Hotel in Amsterdam”", "Author": "chhook", "ReviewID": "UR94408253", "Content": "I've stayed at the Sofitel \"The Grand Amsterdam\" hotel a number of times and found it to be outstanding. The city center location is excellent while also being quite and just a little bit removed from the hustle and bustle. I've found the staff to be initially reserved but warm up quickly if you actual converse with them. NOTE: My stays were a few years ago so the Feb 2010 date was the earliest date in the review menu,", "Date": "January 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“An average experience in a supposedly superior hotel”", "Author": "katstrov", "ReviewID": "UR94127297", "Content": "Although we had booked months previous to our arrival, we arrived to discover our children (13 & 15) had been put in a room on a completely different floor to us. The girl who assisted us at reception was very cold and almost rude. It was Christmas and although we could see that people were enjoying Christmas treats in the bar, we not asked to partake; nor were we given any introduction to the hotel facilities. This cold treatment continued for our entire stay (5 nights). The concierge made us feel that any question or required assistance was an imposition - it was really unbelievable. Probably felt even more as we had just previously been in a hotel in Prague (The Augustine) which was not only superior in every way, but where the staff were so warm and friendly we felt sad to leave!! Anyway - our rooms, although attractive, were tiny with far too much furniture/lamps etc which we were forever bumping into! The bathrooms were tiny, so we continually tripped over each other. The beds were too too soft, even by European standards. The breakfasts (not included) were exorbitant - infact the only saving grace was that the rooms contained an espresso machine, so we could have our morning coffee then eat elsewhere!! We have previously stayed at the Pulitzer, which is old but charming - I would definitely not stay at The Grand Amsterdam again, I could have forgiven all of the room faults if the services at the front desk had been friendlier..... but there is no excuse for cold staff", "Date": "January 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bucharest", "Title": "“quite expensive but extremely good”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR92388330", "Content": "Quite expensive hotel but extremely good location and quality of service. I highly recommend if money is not o problem :)", "Date": "January 10, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London", "Title": "“Teeny tiny rooms and no internet service!”", "Author": "poogleypie", "ReviewID": "UR90096446", "Content": "This hotel was really a disappointment. It is supposed to be one of the nicer hotels in Amsterdam. The location is good, and everything seemed fresh and new inside. However, the whole experience was one disappointment after another. When I checked in, they could not find my reservation, even though I had the paperwork to go with it (reserved through American Express travel). Finally they said they found it and gave me a reservation printout with someone else's name and address - I pointed out that it wasn't mine, and they insisted it was and crossed that person's name off and wrote mine in. I hope that person didn't have a problem getting their room. My room wasn't ready (not surprising since it was actually someone else's room) so they agreed to store my luggage. Beware that their luggage storage appears to be just leaving all of the luggage in the main reception. I sat in the reception for about an hour before leaving for a meeting, and my suitcase remained with the piles of others out in the open the whole time. The room was absolutely tiny. I was traveling on business and supposedly had a superior room. There was just enough space on either side of the bed for a useless bedside table (not actually large enough for placing anything there), and that was it. The bed was a double size bed, not a queen or king. In other words, the bed is only a bit bigger than a single size bed and certainly far too small for two people. There was barely enough room between the end of the bed and the desk to squeeze through. The bathroom was a good size, with a nice walk in shower, but no bath tub. There was no wireless internet service. Instead you had to buy (at a hefty charge) a little scratch off card from the front desk for a local wireless service, but after many attempts I still could not get this to work because the wireless signal did not reach the room. They sent someone to the room but he could not get it to work either. It is absolutely unacceptable for a hotel that pretends to be 5 star not to have internet access. Actually, hotels of any star should offer internet access and most do. I don't really understand what is going on at the Sofitel but I don't intend to return to find out.", "Date": "December 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Milan, Italy", "Title": "“Terrific experience, best hotel in Amsterdam so far!”", "Author": "snagg__v", "ReviewID": "UR89585879", "Content": "We are still at the hotel, we will be leaving tomorrow. The stay here so far has been amazing. As soon as we arrived we were warmly welcomed and informed that we were the \"guest of the day\" as such we were entitled to a room upgrade (we got a junior suite), private concierge and late check-out to suit our flight schedule. The location of the hotel is very central, close to pretty much every attraction of the city. The concierge was really helpful when we were looking for a sushi restaurant. Rooms are definitely nice and well furnished; in the suites have a complimentary coffee machine is included which is a nice touch for us avid coffee drinkers. Everyday they offered us a different present with a hand signed letter from the hotel manager and the guest relationship manager; it was a totally unexpected and very welcomed surprise. The hotel has also a SPA and a swimming pool but we didn't have a chance to use either of them. So far the best hotel we've stayed at here in AMS, looking forward to coming back here in the near future!", "Date": "December 11, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "london", "Title": "“Great Disappointment”", "Author": "phastidious", "ReviewID": "UR88549380", "Content": "This hotel has beautiful common parts and comfortable bedrooms, complete with nespresso machines. Centrally situated with apparently attentive staff it is fine until you want something, like breakfast, or dinner, or lunch, or a coffee, or a taxi, or indeed anything at all. They screwed up every single time. It just all goes to pieces. The hotel was fully booked. That means 250 people. The restaurant only sits 80. Everyone comes for breakfast at once. There are no tables, not enough food, not enough staff. This would be ok if they didn't expect it. However they knew. They just didn't care. And by the way, breakfast is not included in their fancy room price (and neither is wifi!). Dinner - with three young children we waited nearly 90 minutes for the starters! The main courses were wrong. Side orders were missing. The drinks were good though. Hardly made up for it because, of course, the kids were going up the wall as a consequence of the useless service. The concierge, whether ordering a cab, renting bikes, indeed anything, got it all wrong. They didn't bother to order a cab until the last minute - even though we had to be punctual and had ordered the cabs with them at least a day in advance. They got the bike renting so wrong that it was just pathetic and ruined our last morning there. And just in case you think this was perhaps a \"one-off\", we ordered coffee in the lounge. They forgot to bring it. When they did bring it, it was wrong. And they forgot the cake to go with it. Frankly, and as I explained to them at the time, their hotel is let down by the management staff at every level. Interestingly, they agreed with me! One delightful and apologetic waiter in the restaurant cannot make up for this utterly appalling state of affairs. But, their complete and utter ineptitude continued even after my complaints to them. My advice, choose another hotel. A lovely room (even with television in the bath) is not enough and the whole thing really did ruin this family break.", "Date": "November 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kendal, United Kingdom", "Title": "“A lovely hotel with very nice staff. Room didnt have a bath though!”", "Author": "BigFozMorecambe_UK", "ReviewID": "UR87401328", "Content": "This is a really lovely hotel with loads of staff fussing over your every move. On arrival I was a little dissapointed that our superior room only had a shower, not a bath but other than that it was a nice room and very well appointed. Also it doesnt have free wifi and at this price it should have! The hotel has been recently been refitted and it shows. Everything is magnificent and clean and everyone of the staff is really smart and pleasant. On Sundays you gett o breakfast in the old council chambers which is an amazing room. The hotel is situated right in the middle of the action being right next to the main city and the red light district. It couldnt be nearer to see the sights but yet is totally quiet and calm inside. We will definately go back to this hotel.", "Date": "November 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“We loved it!”", "Author": "AshleyDCandBrussels", "ReviewID": "UR86952622", "Content": "Beautiful hotel, fantastic staff, great location. Total luxury and very service oriented. The building itself has a wonderful history. Parking is a bit expensive.", "Date": "November 13, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Never a 5* Hotel”", "Author": "hargar", "ReviewID": "UR86349263", "Content": "Travelled to Amsterdam with Partner who was at hotel for a conference. Hotel facade was covered in scaffolding. The hotel accepted a reservation for a Premium Suite with Canal View. Canal view completely obscured by scaffolding, except for one window in bedroom. Other bedroom window looks straight into somebody's apartment!! Probably a good room if you are a voyeur. To say this was a Premier Suite is a joke. It looks to be furnished by Ikea, although at least with Ikea furniture you dont usually have electical wires and extension cables running along the floor in full view. The dark brown and crimson carpet does not help the ambiance either. Bed is extremely comfortable but with only 12\" of space either side of the bed it is a tight fit. Luckily their was no cat to swing!! Workmen started work directly outside the room at 7.45am making further sleep impossible, despite being told by reception staff that we should not be bothered by noise!! Buffet Breakfast at 34Euros is a joke. Staff are friendly but basically clueless. It took 3 goes at getting someone to bring a pepper pot to the table!! And had somebody else's breakfast delivered to the table twice by mistake by two different people! I suppose this maybe considered a 5* hotel if you think travelling by Easyjet or Ryanair is luxurious. It is just a rather clumsy attempt by a rather mediocre chain, Sofitel, of trying to move into the luxury travel section, when they should stay doing what they do well, 3* - 4* hotels. Last month I stayed at true 5* hotels from the Aman & Shangri-la Chains, Sofitel comes nowhere near their level. I am not the only person to be upset with the hotel, 4 other delegates from the hotel are very disappointed here and some even changed rooms. I", "Date": "November 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "boca raton, fl", "Title": "“Unbelieveable staff”", "Author": "sabisf", "ReviewID": "UR85493117", "Content": "Great location. Loved the privacy of the courtyard. Most of the hotels had the entrance right off the street, but the grand has a nice couryard so it doesn't feel like your falling into the street. The decor was very trendy and comfortable. The staff was wonderful! The concierge was very helpful and everyone was super friendly. The breakfast buffet was very good. The room was nice but small. The bathroom expecially was very uncomfortable. It was long and narrow and the toilet did not have much privacy from the room.", "Date": "October 31, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London", "Title": "“Lush Lush Lush”", "Author": "SPBLondon", "ReviewID": "UR84614666", "Content": "A fabulous hotel - the room was total wow factor, walk in to a large bathroom on the left, storage to the right and then down 5 steps to the bedroom area - a brilliant use of space. So modern but not tacky, very stylish, amazing double height windows. After a morning of sightseeing we spent every afternoon lazing around on that huge sofitel bed, and have now invested in our own goose down mattress topper to keep the luxury going. Skip the breakfast if you can, the restaurant was nothing special and better value elsewhere. Definitely visit the cigar shop a few blocks away (a worthy tourist trip in its own right) and enjoy in the hotel courtyard with a wine or two.", "Date": "October 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Extraordinary Luxury and Service”", "Author": "TravelLover23456", "ReviewID": "UR83943579", "Content": "Upon check in, the Sofitel Amsterdam The Grand offered us a free upgrade from the \"Prestige Suite\" we reserved, to their \"Imperial Suite.\" Not knowing the difference, I accepted the offer, only to find that the difference was indeed substantial. The Imperial Suite was enormous and extraordinarily luxurious -- one of the largest hotel rooms in which I've ever stayed, and the suite was replete with fresh flowers everywhere, free gifts of wine, fresh fruit and bottled water, 1.5 baths, monstrous living quarters, a glorious master bathroom, a changing room, a steam shower, butler service, modern electronics everywhere, and THE most comfortable bed and pillows I think I've ever experienced. All the furnishings in the suite were modern and very new ... so much so that we actually considered whether we were the very first people to stay in that particular suite since it was refurbished. The hotel is very nice generally, but this upgraded room (which retails for about 3 to 4 times what we paid for our \"Prestige Suite\") helped make our stay in Amsterdam unforgettable. If you can justify the splurge on the Imperial Suite, book it for a memorable experience. (In case there's more than one Imperial Suite, ask for the William the 5th Suite.) Aside from the remarkable room, the hotel extrance is an old-style very \"grand\" courtyard, which leads into a modernly furnished and attractive lobby. The staff was outstanding throughout the entire stay. Areas of the newly refurbished Spa were still under construction at the time we were there, but The Grand offers a good-sized indoor pool -- quite unusual in Europe -- which was open and wonderful. The only potentially negative we experienced was the corridors. While they look very clean, they are definitely old-style and had a slightly musty smell. This wasn't a problem for us because those same hallways led to our extremely clean and glorious suite. But the hallways did create a rather unusual dichotomy: Old-style architecture and entrance courtyard, very modern lobby, old-style corridors, very modern suite. Not a problem, just unusual. Overall, we had a truly wonderful hotel experience and one we'll surely always remember among our all-time best. The Grand gets my strongest recommendation.", "Date": "October 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "singapore", "Title": "“Calm amongst chaos”", "Author": "sunshinenow66", "ReviewID": "UR82450606", "Content": "A beautiful hotel with friendly staff. You sometimes get forgotten when asking for drinks, but everyone has a smile for you. Rooms are small but well furnished, and want for nothing. You are in the middle of town and next to red light district, but inside the hotel it is calm and wonderful. Some of the drinks are expensive, but overall there are few negatives for this hotel.", "Date": "October 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Very nice hotel in Amsterdam”", "Author": "lovetotravelhk", "ReviewID": "UR80492236", "Content": "We often travel to Amsterdam and most hotels in the city are small, old, worn, as well as being expensive. We stayed at the Radisson Blu last year and although the rooms were big, it was rather dark in the room and felt more like a business hotel. This year we stayed at the Sofitel and we were very impressed by the renovations they've done. Just walking into the large front courtyard gives you a relaxed feeling right away making you feel at home. The hotel is conveniently located in the city centre of Amsterdam. We stayed for 2 nights in interconecting Superior rooms. The bathrooms were brand new and large (no bath, just shower) but the rooms were compact. We have no complaints about the service, it was sometimes a bit quirky but we wouldn't say it was bad service. Staff were all very nice. There are 2 iMacs in the cozy lounge by the lobby with free access to the internet. Otherwise in the room it's 17 Euros a day. We had the buffet breakfasts on both mornings which had a great selection but at 32 Euros per person you'd hope so. We had dinner in Bridges one night and although the raw seafood platter was extremely good, the main course was average. We'd definitely come back to this hotel again. It's very comfortable and a great place to stay in Amsterdam. The hotel has a similar feel to the Sofitel St James in London.", "Date": "September 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Liked it better before the remodel”", "Author": "richardsonsnm1", "ReviewID": "UR80212933", "Content": "I have stayed at the Grand a dozen times, but i had not been back since it was remodeled. Now I do agree that the bathrooms needed work, the showers were a joke, water all over the floor every time you used them. They have been improved greatly. My problem is with the rest of the room, very poorly designed. Try to get to the closet or the in room safe, almost impossible. The lighting is just TERRIBLE. The color schemes do not help being very dark. It is just not possible to sit in the living room of the suite and do anything but maybe watch TV. The spa was under construction but i did get a peak inside, nice addition. The Library internet area is probably the nicest addition but with just two computers it was constantly in use. The new restaurant, Bridges is touted as one of Amsterdam's finest, I thought that the breakfast buffet was nowhere near as nice as the former Roux offerings so we did not bother. We did enjoy the bar staff and the oysters, the staff could not have been better and more helpful. I think that maybe they should have fixed the bathrooms and changed the furniture and TV's but left the hotels charm alone. We used to enjoy hanging out in our Suite and having drinks and room service, but the ambiance has been ruined. I have stayed in many of the Suites and Jr. Suites but i have mixed feelings about returning, I have no idea what room I would request. I found the front office staff excellent as was the concierge. Anyone that goes to Amsterdam and does not buy their tickets to the Van Gogh from a concierge is making a very BIG mistake, you simply bypass the huge line and go to the fast track line, no waiting. My first hotel that I stayed at was the Hotel De L'Europe, which is also into a very large remodel, and i am afraid they are making some of the same mistakes that the Grand has made and have gone too modern.", "Date": "September 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Could not fault this beautiful Hotel”", "Author": "Louise186394", "ReviewID": "UR78793670", "Content": "We stayed at the beginning of June and it was a fantastic hotel, the staff could not have been more attentive. Only minor downside - my room faced one of the canals and was slightly noisy now and again, would suggest If you want a quiet room ask for a room overlooking the courtyard.", "Date": "September 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aberdeen, UK", "Title": "“Great hotel but staff not up to scratch”", "Author": "Pauline010", "ReviewID": "UR78222634", "Content": "We recently stayed in this hotel and met friends there. On their arrival (after a transatlantic flight) their room was not ready and after waiting for over an hour, were upgraded and taken to their room, which was beautiful. We arrived the following day at 3pm. Our room was not ready either, but we sat in the fantastic courtyard and had some drinks with our friends. We went back to the reception a couple of times to check on our room, which was still not ready. At 6pm, my patience run out and receptionist agreed to upgrade our room, to one immediately available. The reason given for the room not being available was due to other guests having late check-outs but surely this can only be granted by the hotel when nobody is due into the room later the same day. The hotel decor is fantastic, both in the public areas and rooms. Toiletries are nice and plentiful and bed is very comfortable. The location is great and everything is within walking distance. You would not be aware that the red light district is nearby as you access the hotel from the other side. We had ordered a picnic for midday on one of the days. Even though I checked three times with the receptionist that it would be ready, it was not and we had to wait for 30 minutes. We have stayed in other Sofitel hotels around the world and have no complaints. The staff at this hotel, although pleasant, really let down the hotel reputation. I have to agree with previous comments that they have no interest in serving customers, but, newsflash, that is their job! We never ate in the hotel so cannot make any comment. We had breakfast in the cafe over the canal (Bredero's). It looks a bit 'greasy spoon' but is not and serves the best omelettes and pancakes!", "Date": "September 4, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Eastbourne", "Title": "“Excellent hotel let down by poor service”", "Author": "DoubleScorpio", "ReviewID": "UR77503015", "Content": "My husband and I stayed for three nights in August and our overall impressions of the hotel were extremely favourable from the excellent location and impressive decor to the cleanliness of the room. Our only gripe was with the service, both in the bar and the restaurant when we had breakfast. It was painfully slow, and the waiting staff suffered from tunnel vision, ignoring our attempts to catch their attention. Someone needs to do a time and motion exercise to improve things - why have waitresses standing around doing nothing because (presumably) it is not in their remit to, for example, take your order but instead just to clear tables? That irritation aside, tho, I would not hesitate to stay at the hotel again.", "Date": "August 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Florence, South Carolina", "Title": "“Absolutely wonderful hotel”", "Author": "LosRobertsons", "ReviewID": "UR76841310", "Content": "So beautiful and modern and perfectly clean. Great place for travelers who like nothing but the best. The location was excellent, so close to everything, but beware, it is also very close to the red light district, so, if you may be offended by it, don't stay there or don't take a right once you leave the hotel. It didn't bother us at all so I didn't see it as a problem. The room we stayed was pretty small, but the bed was the most comfortable ever! the curtains were heavy and dark so you could relax and nap at any time of the day. The bathroom was large and very modern and the toiletries excellent. I may be going to other Sofitels around the world!", "Date": "August 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manhattan, New York", "Title": "“Great location, nice rooms, great service. One of the best in Amsterdam”", "Author": "nymark2", "ReviewID": "UR76577950", "Content": "The location of the hotel is just great. It is right in the center of the city. You can walk just about anywhere from the hotel. And the walk from the Central train station is only about 10 minutes. Front reception was very friendly. A man showed us to our room which was on the fourth floor in the corner. They called it a junior suite with two twin beds. Windows looked out onto the front of the hotel over the canal. Very nice views. Bathroom was fantastic. Big tub and separate shower with a window. There was a TV in the bathroom and stereo speakers. The only thing I didn't care for was the glass swing open bathroom doors which did not give enough privacy. Room was very clean. Beds were very comfortable. Some of the best I have experienced. Plenty of room to walk around and separate closets to put clothes. I did not try the restaurant. It was expensive, but looked very nice. The courtyard in the center of the hotel is very nice for drinks. A little expensive, the the atmosphere is worth it. There is a coffee shop right outside the hotel. Every morning and afternoon we would walk by and smell the pot that they were smoking there. Didn't bother me (it's Amsterdam after all), but I wasn't expecting something like that so close to the hotel. Staff at checkout was very friendly. Overall, my stay here was excellent and I would definitely return. The sofitel beds and pillows are so comfortable. This sofitel ranks in the top 3 that I have stayed at. Get a good deal by booking a promotion through their website and you won't regret it.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great hotel, though it is expensive, let down by service which was not great”", "Author": "KeninWLondon", "ReviewID": "UR75932839", "Content": "Stayed for 5 days in August. Delighted to get an upgrade to a junior suite and very impressed to be taken their by our \"personal butler\". The hotel location is fantastic - right next to but not in, the busiest part of town. The room was huge, a wonderful canal view, with every amenity possible .......at first sight. There was a Nespresso machine which we used, the capsules were never replaced so after 6 cups between two of us we had to ask for more. There was some fruit in the room - we ate it and it was not replaced. It was a lottery as to what combination of bath towels, small towels and face cloths would appear. We asked the butler to arrange afternoon tea in the library for us and 3 friends - nothing special, it was an advertised service. 5 minutes later he was up in the room with menus asking us to choose - but the friends were not due until the afternoon so we said we would decide specifics then. (The specifics were which tea, and did we want champagne). Friends arrived, no sign of tea in the library and no one knew of then request. Butler was summoned and appeared to sort it out - 4 teas arrived for 5 people. The hotel was very expensive - even for a junior suite - you are paying for location and room. Service was pretty second rate. One final thing - we had the room buy the lift and every time it moved we could hear it winding up and down. Did not stop us sleeping but it did disturb our sleep.", "Date": "August 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Nice hotel...and so close to being perfect”", "Author": "LadyF1", "ReviewID": "UR75599146", "Content": "The Sofitel is a grand, luxurious hotel. The location was pretty central and you can walk to any tourist areas. There were building works going on outside the building but this did not detract from the hotel and there were not any disturbances. Having said that, the coffee maker in the room was extremely dusty and in need of a good clean. Also when i tried to use it, i found that the inside was dirty too. Not really acceptable for a Â£300 a night hotel. This was the only downside. Other than that, great hotel, great location and great staff.", "Date": "August 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“A quiet haven close to the red light district”", "Author": "swiss_nomad", "ReviewID": "UR74857741", "Content": "Only a few steps away from the hustle and bustle around the Old Church and yet as quiet as a mansion in the countryside: That's the Amsterdam Grand Sofitel for you. It's so centrally located that you can actually walk from Amsterdam Centraal train station. Also some of the best restaurants are in close proximity. The hotel used to be a convent and later Amsterdam city hall. Don't miss the council hall, the mayor's office and the marriage chamber â€“ they are all open to the public.", "Date": "August 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“A real \"Grand\" hotel”", "Author": "MikeV_Wolverine", "ReviewID": "UR73317647", "Content": "A real AAA hotel perfectly located in the heart of Amsterdam with efficient service and smiling personnel. Would definitely go back whether on business or for a leisure staying.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "chelmsford", "Title": "“our new favourite Ansterdam hotel”", "Author": "labarkley", "ReviewID": "UR71609672", "Content": "After a glorious refurb. this hotel is looking stunning. The staff seem really to enjoy their work, they are very smart too. Service is superb, friendly, yet very professional. We were asked if we wanted to upgrade to a junior suite for 60 euros a night, we did and were not disappointed. The decor is plush, the bathroom in black slate, a huge bath -freestanding and glorious toiletries. We had views from our 5th floor across the Amsterdam rooftops and canals. The hotel could not be in a better position, close to bars, restaurants, sleaze - if you want it and shops. The prices were what you would expect in a 5* hotel, the bar prices were actually reasonable. There is building work in the spa area, we didn't notice so much as a workman, this will be finished in August. We had room service, the food was decent quality, but the menu is limited, great croque monsieur though. There is a simply stunning courtyard bar and restaurant area, which was always lively, being a courtyard it was also an oasis from the hedonistic delights outside. The room was quiet, with excellent air conditioning, TV had BBC1 and2 and a few other English Channels. Parking was 50 Euros a night, but that was to be expected here. Also bottled water seemed very expensive compared to other drinks. The nicest touch was when they brought the car when we left and there was a gift for the journey home; two bottles of water, two muesli bars and two wipe up towelettes, how sweet is that?", "Date": "July 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Very swish but needs to grow into into its personality and up service”", "Author": "Gemstone4ever", "ReviewID": "UR70188836", "Content": "Beautiful hotel with gorgeous courtyard and very well appointed, modern rooms. super high spec bathrooms with proper hairdryer and nice toilettries. Nespresso machine fab touch. Wonderful bed and linen. Nice 5\" welcome home when returned from work. BEST club sandwich ever. My criticism lies with the service. On a sunny day, they were understaffed in the courtyard and I waited half an hour for a glass of wine after first order was forgotten. The bar is stylish but feels awkward. I hope these are growing pains re refurb and new restaurant. Will be back to see.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Newcastle", "Title": "“Sofitel Grand in Amsterdam was absolutely lovely, but very expensive”", "Author": "JanisNewcastle", "ReviewID": "UR69071994", "Content": "I would recommend this hotel for overnight accommodation. The decor and customer service was fabulous. However the price of the food was ridiculous and there are lots of places to eat out at less than half the price they charge.", "Date": "June 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Excelsior, Minnesota", "Title": "“An Expensive Gem”", "Author": "mntraveler46", "ReviewID": "UR68695401", "Content": "A great hotel for lots of money. The room we reserved was much smaller in person than on the website. On inspection we wanted to upgrade and pay. Reception gave us a suite at a reduced price which was very fair. The only odditiy: the hallway to the bathroom went up a half-step, then down then up again. A bit trying in the middle of the night. Also, breakfast was hugely expensive--$90/2 but extraordinary. Champagne and everything one could want. No chance for an egg and some toast--all $45.Otherwise, the location, staff, room and food were outstanding.", "Date": "June 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Grand Old Hotel with smart new renovation”", "Author": "burgsSydney", "ReviewID": "UR66956493", "Content": "We loved this hotel, the entrance and the courtyard have been renovated beautifully. The decoration is trendy, cozy, romantic and elegant. The rooms are a nice size, the bathrooms renovated and are smart with nice amenities. Our room had its own Nespresso machine. The hotel is conveniently located and in walking distance to movies, galleries(- the Van Gogh is a must see! ) The staff is incredibly helpful and efficient! We would recommend this hotel to our family and friends.", "Date": "June 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Grand hotel--great staff”", "Author": "lhs76", "ReviewID": "UR65085521", "Content": "We wanted a canal view and were given one, in the section of the hotel facing the back. At around 6:00 the next morning, we were awakened by the garbage collection crew below our window. The next morning, customer relations staffer Zsa Zsa(pronounced T-sa T-sa) asked how our room was, and I asked how often the garbage was collected. \"Daily,\" she said with a frown. \"Was that a problem?\" Told that it was, Zsa Zsa said she would look into it. About an hour later, she had us upgraded to another room at no additional cost, and she sent us a complimentary bottle of wine for our trouble. We were there during the Iceland volcano eruption and were able to keep our room beyond our check out date. The entire concierge staff was excellent, both in recommending restaurants and in trying to rebook our return flight, which was a challenging task at that time. We would take a stroll to our pet breakfast spot, on the Rokin across from one of the places where you take a canal cruise, called Meuwese. Nothing special, but friendly, prompt, and a good bit less expensive than the hotel breakfast. When we were there, the fitness center consisted of an elliptical and a treadmill. However, we were told a full-fledged spa was scheduled to open soon. The hotel restaurant \"Bridges\" was quite good, but a bit fancier than what we would normally choose. Nevertheless an excellent rainy day choice.", "Date": "May 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "wassenaar", "Title": "“We had a lovely stay at Hotel The Grand”", "Author": "happyhallow", "ReviewID": "UR61687931", "Content": "We stayed here for only one night in the Easter weekend with three children. The service was excellent. Staff really went out of their way to make our stay enjoyable. The rooms were lovely decorated. The children were thrilled to find huge chocolate bunnies in their rooms. The restaurant was excellent. You need to book way ahead of time because it is often full. Breakfast was a bit chaotic not enough staff to keep up with everybody. We organized a small boat with captain from the hotel. A bit expensive but really worth seeing Amsterdam from a boat through the canals. It is a lovely hotel. Nicely decorated and quiet location. Unfortunately they were renovating the spa area so we could not try out the swimming pool.", "Date": "April 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minneapolis, MN", "Title": "“Worth the price, 5 stars all around”", "Author": "NancyMM", "ReviewID": "UR60673575", "Content": "Great hotel, fabulous, courteous helpful staff and Guido the concierge among the best ever! Convenient central location, excellent restaurants. Beautiful building and rooms, immaculate, comfortable - Wow!! Only negative was that like most nicer European hotels, they expect you to eat a large and very expensive breakfast buffet. A la carte only available via room service. Great guest lounge on main floor with 2 complimentary computers (and free internet) for guest use was a nice plus.", "Date": "April 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "tulsa", "Title": "“Best Service Ever”", "Author": "tulsanative", "ReviewID": "UR59411708", "Content": "The beds at The Grand are actually like sleeping on cloud. As a couple who sleep on a Tempurpedic in the US, this bed is ten times more comfortable. Incredible sleeping on this lovely feather bed with a feather duvet. The service is impeccable and I'm sure they would cheerfully scrape gum off the sole of my shoe had I asked. Every detail was attended to and the turn-down service included the most incredible chocolate truffles I've ever had! it's right on the canal and just a block from the boat tours, and the neighborhood where you can walk all day to see the lovely touristy shops or the high end shopping district. The Grand keeps taxis on hand for a ride at a moments notice. This place has a historic history and the breakfast buffet was delicious. We're American so they made lovely scrambled eggs from scratch and there were plenty of meats, cheeses, fresh fruit, and breads including those heavenly croissants. In case you can't tell this place ROCKS! It's well worth the price.", "Date": "March 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Total Luxury and a real hidden gem”", "Author": "throppy", "ReviewID": "UR57528468", "Content": "This is definitely the best hotel I've stayed in in Amsterdam. We actually drove there from the UK, and the valet met us, and deposited our car in the garage - the parking was included in the price, so that was nice. The hotel was realyl plush, and you enter via a courtyard, so even if you walk past the hotel, you have no idea what it's like inside unless you go in. Lovely room, with opulent decor, overlooking a lovely courtyard at the rear of the hotel. Filled with lovely vegetation, it was nice to not be looking over the street, and gave a real feel of privacy. Great location, just moments from Dam Square, and the Red Light District. Not cheap, but so much nicer than staying anywhere else in the city!", "Date": "March 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "leicester uk", "Title": "“Good bits and Bad bits, Bad bits outweigh the good bits...”", "Author": "daami1988", "ReviewID": "UR55500552", "Content": "Not the worst of hotels, but several issues made it less than enjoyable. We had arranged for a limosine pick up from Schiphol, but our flight got cancelled. We informed the hotel we would be getting there later therefore please arrange the limo later - but they didn't and then had the gall to blame me for their incompentency! They said I would be forced to pay the full charge, something which I kicked up a great deal of fuss about, and they eventually agreed to reduce it by 50%. As a matter of principle I should not have had to pay anything. But with it being a holiday I didn't want to have long arguments with the manager so I agreed so as to get him off my back. Something which irritated me, but nonetheless was one headache taken care of. Next. The window in the hotel was smashed, reported to concierge, they didn't do anything so we had cold drafts coming in at night. When I booked I was told the spa would be in full operation. When I rang to confirm the booking they said it was under renovation - another empty promise there. Instead they sent me to a hotel round the corner which I could use instead - only thing is it was open for only 6 hours a day at really awkward times and was the size of a shoebox! The night staff were brilliant, I have nothing bad to say about them - they were extremely helpful, especially the bald chap (there's only one!) and made sure our every need was taken care of. Unfortunately with the price that I paid for the half assed service I got, I will not be returning here - Marriot seems to be a much better deal with the same facilities.", "Date": "February 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Mediocre experience..”", "Author": "Billt_Ath", "ReviewID": "UR53078308", "Content": "The Grand is suitably located at the heart of the medieval city and the atmosphere has a touch of real \"grandieuse\". However, the staff totally ruined it for us: We booked through hotel's own website and opted for the \"stay 4 -pay 3 nights\" package. It was clear that breakfast was not inclusive and as we always enjoy our breakfast during vacation, we clicked the extra \"breakfast\" option as well. We received shortly a confirmatory email, with a total reservation price which included breakfast as requested. However, after checking-in and during breakfast, staff seemed unaware that we decided to include the breakfast option during our reservation and insisted that breakfast was not included in the price. Staff also seemed unwilling (or uncapable) to check the details of our reservation with their own reservation confirmatory email. Thankfully we brought a printout with us, and brought it to the reception desk. The scene with the Reservation Manager taking curious looks and questioning their own email was less than pleasant and unheard of from a 5 star establishment. We received no apologies for this annoyance during our stay. For the history, the balance (for the stay 4-pay 3 package incl. breakfast) was 4 euros less than our initial total reservation price!!! Sofitel The Grand management really needs to set things straight with regards to their reservation, billing and attitude towards guests policies.", "Date": "January 10, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Powhatan, Virginia", "Title": "“Vacation in Amersterdam”", "Author": "boomergal", "ReviewID": "UR52270737", "Content": "The hotel was in the middle of a renovation, so sometimes the elevator didn't work. But the staff was very friendly and always took us up in the 'construction' elevator. The breakfast there was wonderful. We did not eat dinner there, however, as it was very expensive.", "Date": "December 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Possibly the best hotel room I have stayed in”", "Author": "Scottoon", "ReviewID": "UR47002775", "Content": "Stayed here in September with three friends. I travel frequently and have stayed in a lot of hotels worldwide. This hotel had one of the best standard of bedrooms I have seen. The beds are amazingly comfortable. The bathrooms are incredibly modern with fantastic rain showers. It is close to the red light district but if you turned left out of the hotel then you may not have noticed. Staff were wonderful and attentive. The restaurant was a little short staffed during the breakfast which led to delays but there are few who would possibly want to pay for it. Although good, very expensive - even by hotel standards. Wonderful architecture and history to the building which I prefer to modern hotels.", "Date": "October 16, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Good hotel but not a true 5-star”", "Author": "doucemelody", "ReviewID": "UR46812314", "Content": "My girlfriend and i have just spent 2 nights at the Sofitel Amsterdam The Grand. The location was great, the decoration of great taste but the service was not worthy of a 5-star. If you intend to use the spa facilities, please be aware that it is currently being renovated, so no access there. We booked the cheapest room which featured : - No bathtub (never seen that in any hotel at all, let alone a \"5-star\" ! - Broken glass on the floor ! (they apologized and offered us a complementary bottle of wine, which was nice). - No TV remote control (i had to go down to reception to ask for one..). - No direct access by phone to the reception. - Dusty shelves in the bathroom. - Scratches on the furniture. - The complementary bottle of water was not replaced overnight. Except for the glass, you might think that these are small details of no importance, but when you add them all together it does somehow lessen the appeal of this great hotel and diminishes the rating too. Still a very good place to stay. The staff are kind and well intentioned, but it shouldn't be hard work for the customer as it was for me. We did not have lunch nor breakfast in the hotel, so i cannot comment on the food.", "Date": "October 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Koper, Slovenia", "Title": "“Excellent accommodation”", "Author": "Artiha", "ReviewID": "UR46623512", "Content": "I have been in many luxurious hotels all over the world and I can affirm that this hotel is one of the best, without any doubt. The location of the hotel is excellent, the room (suite) is fantastically furnished and the staff is incredibly polite.", "Date": "October 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Grantham", "Title": "“In so many ways exceptional but slightly disappointing this time”", "Author": "arthurh", "ReviewID": "UR46508165", "Content": "I booked a suite at this hotel as a treat for a few days away for total relaxation. Arrived by car and from the moment we went into the courtyard service could not be bettered anywhere. However I chose this hotel for two real reasons, firstly the Spa and secondly the central location. The spa was closed for refurbishment ! I didnt realise the hotel was literally on the edge of the red light district, for many people that wouldnt be a problem but at a weekend especially the whole area is crawling with drunken stag party revellers, unfortunately many are British using foul language and flouting any drinking in the street laws etc etc. Not what I wanted from a romantic weekend away, I am sure that during the week this wouldnt be too much of an issue and anyway instead of turning right from the hotel just turn left, it is different again and you see the real Amsterdam. The spa being closed was a real issue as we just wanted to relax, the hotel offered us the opportunity to be bussed to another hotel they use the facilities of, but I declined as its not the same as being able to walk downstairs in the fluffy robe just when you feel like it. So we cancelled our third night and moved on to Bruges. Would I stay there again, yes almost certainly, the spa being closed wasnt their fault although I wish I had been told on booking and the location, whilst being a little intimidating, is so central and exceptional by just walking the other way. The concierge was really very good, booking us at the very last minute an exceptionally good restaurant, the five flies, and on leaving there was mad panic when we decided to leave a day early as apparently the concierge hadnt got my \"parcel\" ready for the car. The car was brought to the door, he hurried off and came back with \"the parcel\". This consisted of sustenance for the journey, a couple of apples, breakfast bars and 2 bottles of water, a very nice touch!", "Date": "October 11, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York", "Title": "“The Grand is a 10”", "Author": "MikaStanford", "ReviewID": "UR45653309", "Content": "Me and my wife stayed at this wonderful hotel for five days and loved it. Great atmosphere, beautiful architecture and even better service. This hotel can be recommended to everyone who is visiting Amsterdam. It is near al the big tourist attractions and the Central Station. The rooms are very comfortable and the interior is outstanding. This hotel has my vote for best hotel in Amsterdam!", "Date": "October 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Porto", "Title": "“Oasis!”", "Author": "TitaCatita", "ReviewID": "UR44180707", "Content": "My husband and me booked an escapade, at promotional rates, got upgraded to an apartment suite! Although we didn't use the first floor, it was a nice touch! The location is great; although close to everything, walking distance from the train station, the Dam, the main places, it is an oasis of quiet, a chic ambiance. The hotel itself is worth seeing, with its colored glasses and reminiscences of distinguished guests from bygone times. We didn't try the facilities though, but what we saw was good enough. The service is excellent, (very untypical of the locals, unfortunately), from the reception staff, to Udo, the concierge who makes miracles, or Peter, the bell boy. Would go back, for sure!", "Date": "September 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic city centre hotel”", "Author": "KWH1", "ReviewID": "UR39983168", "Content": "This hotel is an excellent choice for a weekend city break in Amsterdam. I stayed 2 nights with friends and the hotel made it such an enjoyable experience! The rooms are luxurious and a good size with fantastic beds making it very hard to get up in the morning! We had a great view over the canal and were not disturbed by any noise. Rooms contained all the amenities needed and staff were extremely helpful and professional.", "Date": "September 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "england", "Title": "“fantastic hotel”", "Author": "herbie1709", "ReviewID": "UR39044716", "Content": "just returned from the sofitel booked a surprise 50th birthday for my husband. hotel ,rooms, staff, and location were fantastic. the hotel staff were wonderful and made every effort to make our stay special. they presented my husband with a cake and domingo the waiter in the resturant was very hospitable and really nice guy, providing us with information of the city . thanks again to the sofitel we will be back. lorraine, mick robinson and john and lynne hewitt. ps domingo enjoy your friends wedding dont get to drunk you have to work the next day x", "Date": "August 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "netherlands", "Title": "“historic hotel at top location”", "Author": "panda58", "ReviewID": "UR37843352", "Content": "location in amsterdam is unbeatable;close to the very centre,next to red light district and still quiet.rooms very nice and faultless.atmosphere is great and cozy.business rooms are splendid.one of the best locations for visiting amsterdam. not very easy to reach when traffic is busy.", "Date": "August 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Centereach, New York", "Title": "“Would absolutely stay there again!”", "Author": "Evelgirl", "ReviewID": "UR37075790", "Content": "Beautiful Hotel that was once a Convent. Stayed 2 nights in July. Room was spacious and contemporary with flatscreen TV and great channels. Nice coffee machine. Big bathroom, yes, the shower did leak but have had that happen in other hotels. Had a view of the courtyard, unfortunately they were working on it while we were there and we did hear some noise. Breakfast in the restaurant was overpriced. Great location! 5 minutes from Dam Square(and the Tram), 2 minutes to the Red Light District, 15 minute walk to Central Station. Tons of shopping, restaurants and coffeeshops around but the hotel is set back enough away from the hustle and bustle. Staff was pleasant and helpful. I will definately stay here the next time I go to Amsterdam!", "Date": "August 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Adelaide", "Title": "“Good Location & Contemporary”", "Author": "holidaygirladelaide", "ReviewID": "UR35696461", "Content": "The hotel is centrally located, 10 minutes walk to the Central Station. But some locals got it mixed up with other Sofitel and it took us a while to find it. Although it is right next to the red light district, it is tucked away and is quiet and safe. It is close to most sight seeing places. The room is spacious, tastefully refurnished and well designed. The bathroom is simple, clean and contemporary. I am very fussy about bathroom and I was happy with this. But water leaked from the glass partition of the shower. The hotel is still undergoing some major renovation but it did not create any noise. They provided free internet at the business centre. The restaurant was a pleasant surprise. The food was nice and not too over priced. It is trully a five star hotel.", "Date": "July 24, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "amsterdam", "Title": "“very nice - great neighbourhood”", "Author": "mhl01", "ReviewID": "UR29737239", "Content": "I stayed at this hotel more then once. Great place. Check out the cafe's around the corner, like Cafe de Pool in de Oude Hoogstraat 8, one bridge away. This is my favorite. They have a great art collection of 40 works on the wall by contemporary Dutch artists. This 85 year old artist-cafe is different from the rest in the neighborhood, and a great place for coffee, sandwich or a beer ;-)", "Date": "May 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "england", "Title": "“faultless overnight stay; can't wait to return”", "Author": "philipellis", "ReviewID": "UR26888344", "Content": "we (2 couples) stayed at this hotel for one night in mid march - a brief weekend stay in Amsterdam to celebrate my wife's recovery from illness. we checked in at 11 a.m; it was somewhat disappointing to be told that neither of our rooms were ready despite asking in advance for at least one room to be prepared for an early check in, but it didn't really matter and our bags were put aside whilst we went out for lunch. as we checked in, we asked if our rooms were nice, and one of our party requested the availability of refurbished rooms; we each secured these for a â‚¬40 premium, and went out for lunch. when we returned at about 3.30 pm, our rooms were ready, and they were spectacular. beautifully decorated, immaculately clean and a fantastic bathroom, with a good sized walk in shower; really top notch. at the same time, my wife and I each booked a treatment in the spa; she opted for a reflexology session, and I chose a deep tissue massage. we then wandered over to dam sq (300m away) for a bit of people watching in the cafe there. we also asked the concierge for a good steak restaurant; he recommended the informal torro de rado where we enjoyed the best steaks we have ever had in our lives and the most tender ribs. it was however well more than a 10 minute walk from the hotel as the concierge thought; it was especially difficult for our ladies in high heels; next time we'd get a taxi. incidentally, the next day the same concierge suggested we went to the bakerswinkel for breakfast. it too was spot on, just across dam sq from the hotel. we returned to the hotel in time for our treatments. my wife emerged from her reflexology session with Dan looking 10 years younger and glowing; my hour long massage with Sarah shot by in what felt like 20 mins and I felt fab. If both ladies read this review, many thanks. we have both had treatments in many other places, but both agreed that these 2 were the tops I also went for a swim before my massage; nice pool, nice changing rooms; adequate to stretch off any jet lag. There is also a small reasonably equipped gym, and a couple of sauna cabins. the hotel is located just on the edge of the red light area, and you have to go through this area to get to Dam Sq, but its not threatening as it once was several years ago, and there were plenty of police in evidence. prostitution is clearly legal in Holland, and the site of scantily dressed women touting for business in the infamous Amsterdam glass doorways is not for the faint hearted. When we returned to the hotel at about 12.30 a.m, we asked if there was a bar open. We were directed upstairs to a comfortable lounge (the bar is apparently being refurbished) and we were well looked after by the pleasant barman 'til about 1.30, tho we were the only ones in the lounge. At the heart of any of our stays is the question of cleanliness; we will not be happy with anywhere which is dirty or grubby. This hotel was immaculate, with crisp bed linen and towels, and clean bedrooms, bathrooms and common areas. Coupled with a wonderful location, brilliant concierge and well organised (our masseuses came into the hotel to meet our bookings; they seem to be 'sub contracted' by the hotel) and of the highest standards massage treatments, we would immediately and happily stay here again. this hotel wasn't cheap, but for 1 night the price wasn't the be all and end all of our stay. it was beautiful and we have no criticisms to make; we'll be back", "Date": "March 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Moscow", "Title": "“Losing a Couple of Steps”", "Author": "telco", "ReviewID": "UR26039671", "Content": "The Grand is possibly my favorite hotel in the world, having worked in 25 countries. But, nevertheless: I confess to being somewhat... disappointed with my stay November 12 - 15, 2008. I have repeatedly recommended the hotel in the past to my firm's clients over the past decade. Now... I am not so sure. The stay was OK, but just that... OK. I had room 8, I believe. In the room, in the shower, the tray to hold toiletries was missing. So, all of the toiletries had to be picked up off the floor. The drawer in the table was broken. It stuck out and made sitting at the table uncomfortable. Both issues were reported, a staffer came and nothing was done, the tray was not replaced, the drawer was not fixed. I was advised, that \"yes\" the desks have that problem, and it has been pointed out, and can't be fixed. The breakfasts were as always spectacular, the \"chocolate\" dinner was revolting. My friend tried the alternative dishes and liked them, I months later still shudder at the not wholly supressed memory of chicken or squab with (ugh) chocolate sauce. Overall, a decent stay, but not a Sofitel Grand experience. The staff, were, as always, absolutely excellent.", "Date": "March 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "san francisco", "Title": "“A Gem of a hotel!”", "Author": "worldtraveler_1037", "ReviewID": "UR24420561", "Content": "Just stayed for 8 days at The Amsterdam Grand. We stayed in an updated room (they are about halfway done with the refurbishing) and I cannot say enough about it. The exterior of the hotel is amazing - the entry way majestic and private. The room was beautiful, the service even better. Our seven year old had her cot already set up in a convenient place in the room with bedding and everything upon our check in. They brought us afternoon snacks of dried fruit, plums and m&m's (with our daughter in mind;-) The room was spotless and spacious. Neils (the person who we booked our reservation with) was so friendly, hospitable and gracious. It was a treat to see him behind the counter on our comings and goings A real asset to the hotel indeed! Upon our arrival our taxi from the airport tried to overcharge us - a few guys from the hotel acted on our behalf and intervened (without us even asking!) and we ended up paying the correct amount. On the way back to the airport they made sure we got an honest taxi driver and a nice cab. That's service! My only gripe would be that the concierge was a bit inconsistent. They certainly tried hard but sometimes the advice on where to eat with our seven year old was a bit off (more bar like that we wanted) BUT when I asked for a list of toy and clothing stores for children he did some research and complied a list (some places which were great - others not so much). A for effort! When I asked for something to be brought to my room, they were there within 1 min of hanging up the phone. I also like that when you received phone messages, they delivered your message to you in a sealed envelope upon your arrival back to the hotel. Very old world. And every person was delightful to our seven year old and genuinely so!", "Date": "February 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maastricht", "Title": "“Excellent stay at the Sofitel The Grand”", "Author": "travellover071", "ReviewID": "UR23605849", "Content": "The hotel is lovely. The building is historically and culturally very interesting, and every important sight of Amsterdam is near by. Great service, nice, spacious rooms, absolutely marvellous French cuisine diners!", "Date": "January 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Hong Kong, China", "Title": "“A great stay at the historic hotel”", "Author": "BTSHK", "ReviewID": "UR23300369", "Content": "We stayed at Sofitel The Grand Amsterdam for 2 nights in early Dec 2008. We took a Connexxion hotel shuttle from the Schiphol airport, and the trip took about 25-30 minutes (with a few other hotel drop-offs). When we tried to check-in at Sofitel, we were told that our booking was not available. We then figured that we were at the wrong hotel (i.e. Sofitel but not Sofitel The Grand)! Fortunately the Connexxion driver was still outside the hotel, and he gave us a ride to the right place. So make sure you communicate the correct hotel name to your driver if you're going to stay there. The hotel itself was a historic and magnificent site. We stayed in a Sofitel suite with courtyard view. The room was huge with a large bed and lounge area, a separate room with closets and a working desk, and a bathroom. The decor and furniture looked a bit old-fashioned at first (e.g. colorful / patterned draperies, tapestry sofa, oak table, etc.), but we actually quite liked them after a while as the ambience was cozy and very different from other contemporary / modern hotels we had previously stayed in. The most important thing was we felt comfortable in the suite. The courtyard (from our window) was nice - would be relaxing to have a walk around there. However, as the weather was rather cold and rainy, we did not spend time out there during our stay. The hotel offered turn-down service in the early evening. Some people might not like it but we were fine and appreciated it. We also enjoyed a complimentary welcome drink at the restaurant. Hotel staff were friendly and helpful. We bought our tickets to the Van Gogh Museum at the reception / concierge (to avoid line-up at the museum). A hotel staff also recommended a great Indonesian restaurant to us (can't remember the name now...but I did take one of their cards). To sum it up, we were happy with our stay and would certainly go back next time we're in Amsterdam.", "Date": "January 5, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Toronto", "Title": "“We had a nice time at Sofitel Amsterdam.”", "Author": "LastMinuteDecision", "ReviewID": "UR23099638", "Content": "We stayed at this hotel through 'a friend of a friend'. As such, I don't have anything bad to say. Our stay was free, and all our needs were met. ...Couldn't ask for more, really. Our room was nice enough, albeit a bit on the small side for my liking. We only stayed one night (which is not uncommon for us, especially since we usually only go to Holland for the weekend), but staff was sure to check that our needs were met at all times. I would definitely stay there again...even if it meant paying. ;-) In fact, I look forward to it!", "Date": "December 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Old-fashioned rooms”", "Author": "SixtyDays", "ReviewID": "UR22807923", "Content": "Stayed here for 2 nights whilst on business. The hotel itself is well located in central Amsterdam though make sure you know how to find it if walking there. The building is impressive and the public space in the lobby is beautiful and what I was hoping the rest of the hotel would look like as well. However, the corridors and rooms were old-fashioned and quite chintzy which was a real disappointed as I was hoping for modern design in an old-fashioned building (similar to the Sofitel Bayerpost in Munich which is a fantastic hotel). I am an A-Club Platinum member so not sure whether I was upgraded, but my room was of a decent size, although the bathroom was not much bigger than a normal hotel room. The room service menu was expensive as expected and the food was ok, but nothing exceptional. Overall, for the price of more than EUR250 per night I was a bit disappointed and had expected more. Don't get me wrong, the hotel is definitely a 5-star hotel with good service, but it is need of a refresh which the renovation program is meant to achieve. Until that is completed I am more likely to stay in another hotel. If you enjoy old-fashioned \"classic\" hotel room designs you will enjoy the Grand, but for more contemporary design, I would suggest you look elsewhere.", "Date": "December 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“There on Business - Great Staff!”", "Author": "Adelaide408", "ReviewID": "UR21182473", "Content": "I just got back from a few days at The Grand and overall it was quite nice... I was there for a conference that my company planned and threw and the on-site staff was excellent. The meeting room was quite nice with a Nespresso machine, a retractable screen and natural light! (most conference rooms are always dark and dreary.) The actual hotel room was average, though. For 315 euro a night, i was hoping for something a little bit nicer. The bed was incredibly comfortable, but it was two twin mattresses pushed together... I was there by myself, so it was fine... I would have been annoyed if my husband and I were there together and we had a crack between us! The floors in the guest rooms are heated - which is a nice perk on a rainy day in Amsterdam. Also, the rooms are slightly larger than many European hotel rooms. The internet was insanely expensive to get in your room, so avoid that if you can. The food at the hotel was delicious - I ate at the restaurant for lunch, had room service for dinner one night and had lunch during the conference. The breakfast was included in the room rate but was essentially limited to fruit and pastries. Overall I would certainly recommend this hotel. The location is fantastic and the staff was excellent.", "Date": "October 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oslo", "Title": "“Very good hotel with scharm”", "Author": "noj64", "ReviewID": "UR20610469", "Content": "I stayed here for 3 days with my wife. The hotel is very good and the atmosphere is very nice. Very good service from the staff. Please don't do any rehabilitations in the bar area. That area is very good. I did not like the new rooms. To modern. The bed was VERY good. After a long day walk it was very nice to relax in the garden with one Duvel beer and a glas of wine.", "Date": "October 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Merthyr Tydfil, South Wales", "Title": "“Nice Hotel”", "Author": "IanrJones10", "ReviewID": "UR20492996", "Content": "Stayed for 2 nights. This was our first time at the hotel and we were pleasantly surprised. We hadn't seen the pre-remodel lobby area and rooms so to us the hotel seemed bright and fresh. The bar area is traditional it it would be a great shame if the hotel plans to remodel this. We had a refurbished room on the top floor. Our only comment would be that the designers have dressed the room with one table and short sofa too many. Without those two pieces of furniture at the end of the bed the room would appear almost spacious. With those 2 pieces of furniture the room appeared a little cluttered. We had dinner at the hotel and the food was great. The advantage of a hotel like the Grand is that it is in the centre of Amsterdam but removed from the hustle and bustle. We would certainly stay here again.", "Date": "September 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "3", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Modern Refurb Spoils Classic Hotel + Loyalty Disregarded”", "Author": "Simon1944", "ReviewID": "UR20441786", "Content": "Until this year, this was my all time favourite hotel. The size, the housekeeping and the concierge service were excellent and remain so - but alas the style is changing. The public areas and the rooms were warm, comfortable, and relaxing in a traditional European style - but all this is going. On entering you can see that the classic lobby desk has been replaced with two internally illuminated marble plinths over which a tacky modern chandelier has been hung. The lobby now looks like the entrance to overpriced Middle Eastern disco. I am a Sofitel Privelege member entitled to an upgrade, if available. On check in I was allocated what I later learned to be one of the worst rooms in the hotel. Not only did a quarter of the room appear to have been taken out to create space for another room but the room has been refurbished in garish clashing colours - not in the least relaxing or comfortable on the eye. I was able to change to an unrefurbished room which was better in every way - but by my next visit to Amsterdam in Sept 2009 these will have all gone. During my visit I asked to see another refurbished room and my initial impressions were confirmed - not a place to stay after a hard day's business. Clearly some Sofitel Paris HQ based brand manager is trying to make their mark irrespective of local tradition. Even the superb Roger & Gallet toiletries have been replaced with the less impressive Hermes brand. On check out - despite being responsible annually for three bookings and about 4,500 euros of business, I was told not even my own booking counted for Sofitel Privelege points because the booking was made through an agency. I spoke to and Assistant Manager who said he would talk to the General Manager and get back to me. Some days later he left an unsatisfactory message with my office but has failed to communicate by email. (This report is copied to him to give Sofitel the opportunity to respond via this site). Finally - salt in the wound! Last week via email I was offered Gold Status membership of the new Accor loyalty programme which replaces the Sofitel programme. Despite following the instructions it was impossible to obtain Gold Status or transfer my Sofitel points - and none of my emails to Accor have been answered.", "Date": "September 28, 2008"}, {"Ratings": {"Overall": "2.0", "Value": "3"}, "AuthorLocation": "California", "Title": "“One rude experience ruined it for me.....”", "Author": "ArtemisLA", "ReviewID": "UR18670126", "Content": "I stayed here just this week and had a great time, but a very creepy manager ruined my whole impression of the place on the very last day. Amazing modern-meets-old furniture and fresh flowers in the lobby of this old former convent and state house, beautiful terrace, friendly and efficient staff, butter soft beds, and a REALLY great staff and fabulous breakfast buffet -- but if you're under 40 and wear jeans while you're on vacation, expect to get the pat down by hotel security if you dare to use the business center. I guess he thought I strolled in from the pot cafe next door. In sum, one rude experience ruined it for me. Sometimes people forget they are in the hospitality industry. A shame.", "Date": "August 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Excellent choice”", "Author": "sxa93", "ReviewID": "UR17811127", "Content": "Sofitel is most certainly a royal venue at Amsterdam. My wife and I were booked in a suite, and we were very impressed with the front office staff who welcomed us with a cheerful friendliness that made us feel we were meeting old friends. The suite was excellent. A Bose wave sound system was a part of the furniture, and perhaps that made me fall in love with the hotel all over. The view from the room was one of the canal. The hotel's location lends itself to easy walks downtown. The museums are close by, as are the pubs and the night clubs. The infamous red light district is also a stone's throw fronm this hotel. I would consider this the best place to tour Amsterdam.", "Date": "July 12, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "australia", "Title": "“Grand Style”", "Author": "heatherjbelle", "ReviewID": "UR17165563", "Content": "I had the pleasure of spending 7 nights at the Sofitel Grand Demure in Amsterdam while attending a conference with a girl friend. The Decor was just beautiful and the internal garden just lovely, this Hotel is very Grand and stands upto its name. The weather was not so kind to us but the Hotel Staff were excellent. We had been at The Burj in Dubai before arriving and I can say the Burj staff could learn at lot from the staff at this Hotel. The Hotel is under renovation and only had around 30 rooms available. At no time did we hear the renovations or see work people, it was all handled very well. Our room over looked the front courtyard and canal which was pleasant and it was so nice to be able to have the window open for fresh air at night. It is close to the Red Light area but you wouldnt know it, is very safe. We used the pool and steam room which was very clean. The breakfast buffet was excellent, we didnt need to eat for the rest of the day, the fresh stawberries and raspberries were a real treat. I am the Latte queen, coming from Australia we are used to our coffee a certain way, the dutch are not so much into Lattes but they managed to master my tastes very early on in the stay. The staff made our stay very enjoyable and I would recommend to other travellers. I can imagine this Hotel will be even more Grand after the renovation, well done Soitel and thank you for a pleasant stay. You will remain on my list as a beautiful place to stay and excellent service.", "Date": "June 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "leesburg", "Title": "“WORTH EVERY PENNY OF THE $600/NIGHT WE PAID!!!! LOVED IT”", "Author": "dixie12345", "ReviewID": "UR16250174", "Content": "Large, luxurious rooms in a exellent location. It was worth every penny we paid for it. I highly recommend it to anyone!", "Date": "May 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Alexandria va.", "Title": "“Great location”", "Author": "Tedandtre", "ReviewID": "UR15433668", "Content": "I was there with my wife for 3 days for a business meeting. Our room was above average. We were on the first floor next to the canal but the noise was acceptable. We ate in the dining room for breakfast and had catered lunches for our meetings, all of which were good. I liked the location which was certrally located. The internal garden next to and serviced by the bar was epically nice.I thought the staff was uniformaly friendly and attentive.", "Date": "April 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bethesda, MD", "Title": "“Excellent tourist location”", "Author": "mgreene", "ReviewID": "UR13868724", "Content": "We stayed at the Grand Amsterdam for a combination of business and leisure travel. My husband was traveling for business (making the cost of the hotel less of an issue), while I went sight-seeing. We were generally very happy with the Grand Amsterdam. The room was adequate in size, and nicely appointed. The bed was very comfortable. The bathrooms are well appointed, with nice toiletries and a good shower. I did wish for a double-sink, but those seem to be less common outside the U.S. (I'm not sure who thought up the rectangular toilet seat - very cute, but doesn't fit the round shape of the object sitting on it). We ate at the restaurant and found it very good, if pricey. We also used the gym - it has only three pieces of cardio equipment and one weight machine, but they were all in good condition. We used the pool and sauna - nice options after a day of touring. The hotel is very well located. We don't mind a little walking and only used a cab to take us to the train station when we left. There of lots of shops, restuarants, and attractions very nearby, and the Anne Frank House and Van Gogh Museum are an easy 20 minute walk. One note if you are traveling soon - ask about the ongoing construction or plan to be up by 8:00 a.m. sharp - the pounding on the building is noticable.", "Date": "February 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "scotland", "Title": "“good hotel undergoing needed renovations”", "Author": "floober", "ReviewID": "UR13400856", "Content": "this is a nice hotel which is going through a much needed renovation project. the bar has been closed and an obviously temporary one has been set up, though for a temporary bar it is very nice with good service. the room i was in was a good size and very clean though does need updating as it was a touch 80's esque. all the staff i encountered were very friendly and helpful when called upon.the spa is minimal but the pool is big enough so long as you dont have to share it with anyone else. in summary this is a hotel i have stayed at twice now and i feel i have experienced all that it has to offer, in saying that, i would not stay here again as i feel that twice is enough and i would like to experience other hotels in amsterdam but i would recommend it as it is a good hotel. oh...it is also in a great location just on the edge of the redlight district ,you feel, as indeed you are, bang in the middle of things.", "Date": "February 9, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Thailand", "Title": "“Dreadful experience at the Grand”", "Author": "leemondsamui", "ReviewID": "UR13244385", "Content": "This has to be without doubt the worst experience I have every had at a 4 or 5 star hotel ( I would have been upset at a 3 star rating for this place). On arrival our room was not ready. Once we were introduced to our room it looked tired and dim with 2 twin beds (requested double/ king). The first night I was called by the reception at 2am because of a problem with my credit card (transpires operator error at the reception). Having travelled extensively around the world the 5 star rating is simply a joke! It seems it is some corrupt method of extracting more money from the unsuspecting public. I imagine their return occupancy rates to be me minimal if not non existent. I would wish you luck with this place but you would need more than look to enjoy this place!", "Date": "February 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Fantastic hotel”", "Author": "CBR11", "ReviewID": "UR13225254", "Content": "Just returned from what was an excellent stay at The Grand. My wife and I and another couple stayed for 2 nights and had a great time. We arrived from a really early flight at about 10 am and didn't really expect to get checked in before 3pm.We got checked in by around 11am but what we really appreciated was that they upgraded us both to a Junior Suite, beautiful high ceilings , fantastically comfortable beds and good bathrooms. I had emailed the conscierge a week earlier to book a restaurant and had 'mentioned' that both parties were there to celebrate a birthday so perhaps that helped in the upgrade.The hotel is a beautiful old building with alot of history and the location is second to none being just around the corner from the RLD, 2 minutes walk from Dam Square and even next door to The Greenhouse Coffee Shop(for those of you who require a herbal pick me up). We used a taxi to get to The Van Gogh Museum and Rijks museum ( both superb) and there seemed to be a Mercedes taxi on tap in the hotel courtyard at all times which was great .. The service in the hotel was top notch and the breakfast buffet was one of the best I have had(champagne and all). Another nice feature of the hotel was being able to go for a sauna and swim after a hard days sightseeing,( I think it is one of the very few hotels in Amsterdam to have these facilities). To sum up The Grand,a Top quality hotel,Great location , Impeccable service and a perfect place to spoil yourself for a few days in what is a beautiful city.", "Date": "February 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "1", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "new york", "Title": "“Mixed feelings”", "Author": "happycamperNewYork", "ReviewID": "UR11135619", "Content": "In many ways this is a lovely hotel in a great location but they do enough things wrong to mar your stay. Be wary of the front desk staff. They will either treat you with respect or contempt but you never know which it will be. The rooms are dated; the wall paper was peeling in mine and carpet had pulled away from the wall in many places. But the rooms are large (for Europe) and the bathroom was spotless. The pool and locker room were also clean and bright but if you book a massage you must pay in cash. Be prepared to sleep with earplugs. There is no other way to put it. The noise level is bad.", "Date": "November 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "manhattan ny", "Title": "“Dutch treat”", "Author": "juliansorl", "ReviewID": "UR11107867", "Content": "Our third time at this hotel, and the place is still revealing itself. We were upgraded to a jr suite on the OLD courtyard. The court wasnt very noisy since the windows were double glass, but the courtyard's lights at night could be a problem unless you draw the curtains which the evening maid will do for you. The room was nice size with high ceilings probably equal to a normal hotel room here in the states but with very nice understated old dutch modern furniture and deep ruby carpets, obviously the place needs an update but it was still very posh compared to other amsterdam hotels, and the services are very good. I love the room service kitchen, breakfast, lunch, and dinner were all truly wonderful and their coffee was so good. I love how convenient it is the rest of city; it is literally in the middle of this circular city. I had some clothes cleaned over night since I missed the early morning pickup, and I thought they would be automatically delivered when done, but I had to ask for them, and I had them in ten minutes, so the place isnt' perfect. However, they are thoughtful in other ways, like on thanksgiving they surprised us with a dessert tray of punkin pies, and thinking my friend and I were business travelers, they rearranged our room and divided the king into two twins . I love the amstel too but the grand is special as well in it's own slightly more casual and user friendly way. The dollar does not go far in europe but i still found the hotel an overall fairvalue, but hope that things get better for our dollar so I can soon return to the grand again.", "Date": "November 27, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Toronto", "Title": "“Nice but NOISE !”", "Author": "MZ-TarvelGuy", "ReviewID": "UR10963399", "Content": "Stayed on business Nov 12-15 2007. Overall in a good location, very nice hotel, good service, bar, etc. Room was clean but very dated and a bit \"worn\", but not too bad. The hotel is RIGHT on a canal and there was VERY noisey contruction all day long immediately out the window. Would not stay there again if there were construction. Otherwise ok. Daily rate was between 300 & 350 euro per night.", "Date": "November 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Houston, Texas", "Title": "“Very comfortable”", "Author": "Lpmch", "ReviewID": "UR10043271", "Content": "Checked in at very short notice for one night via the tourist office - which was originally all that was available. The staff was very helpful in arranging for us to extend to three nights. The rooms are very pleasant ,comfortable and clean with enough of a feeling of luxury to make you feel good about the place. Great location for the town centre but from our room no view at all. Breakfast was good and as plentiful as you want- if a little erratic in the organisation. Hotel and Bar staff very pleasant. A few hiccoughs in that they ended up taking several hundred Euro too much credit card authorisation over and above the room costs even if you accept that they should hold authorisation in case of extras. The receptionist soon found the mistake when it was pointed out, and it was put right after checkout. They were also very good in rectifying the misunderstanding over whether or not breakfast was included for the extended two nights. The building itself is internally beautiful and historic. Unfortunately my wife was put off using the bar facilities after we saw several mice. We were told, with profuse apologies, that this was an ongoing problem during nearby canal restoration works.", "Date": "October 5, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "ATLANTA, GA", "Title": "“Great Location, Nice Hotel”", "Author": "rivieramayaguy", "ReviewID": "UR8425061", "Content": "We stayed at The Grand for 3 nights 02-05 August 2007. This hotel is in a terrific location, easy to reach the Dam Square, Central Station, etc. We did not experience any noise problems mentioned by others. Entering via the lovely entrance courtyard we felt somewhat removed from all of the crowds of people. Our room looked out on the canal but we were not affected by people walking by. Room was in good shape, not excellent, but certainly what you would expect from a 4 star hotel. Our only disappointment was the concierge staff. We felt they were indifferent to our rather simple (restaurants, sightseeing) requests. Other than that, we'd certainly return. We have previously stayed at the Amstel but liked the location of The Grand much better.", "Date": "August 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fairfax, VA", "Title": "“Great Hotel--loved the history”", "Author": "DKat", "ReviewID": "UR8273725", "Content": "My husband and I decided to stay here after an exhaustive search of the hotels in AMS. I ended up getting a great deal on the hotel website--295 Euros for a junior suite with breakfast included. The room was very large and overlooked the canal. The location in great--centrally located and easy to get to everything (although AMS is really not that big compared to London, etc...) . Location is very near red light district and there are some rather loud bars just down the street from the hotel. However, even with out room facing out toward the street, I really didn't hear them. The courtyard of the hotel was another plus--quiet and beautful. I also loved the historic backgroud of the hotel and enjoyed exploring some of the older meeting rooms. All in all--a great stay at the Grand!", "Date": "August 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Torrington, CT", "Title": "“Best Location, Loved the Pool”", "Author": "Ski_Luv", "ReviewID": "UR8244263", "Content": "Stayed 4 nights for our 10th anniv. For a first time visit to Amsterdam, we couldn't suggest a better place. Especially if you're still recovering from the flight from the states, I hit the spa twice a day for help with that. Our room was lovely, all the sites are in easy walking distance. Our only mistake was not discovering the Grand's own bar until the last night. We thought it looked expensive, but was actually quite reasonable and just as cozy. If you like red wine, give the \"house red\" a try. If you have an early departure, give yourself lots of time for grabbing a taxi downstairs. It gets competitive.", "Date": "July 27, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“With a good room it works.”", "Author": "Mikelibra", "ReviewID": "UR8224882", "Content": "This would be my choice for Amsterdam having stayed in most of the major hotels in this city over some 30 years. I must admit that I have yet to find a really good 5 star in this city. But it has a good location close to the Dam and about a 10 minute walk to the Central Station but it is a very, very touristy area. It needs, as of June 2007, some serious renovations in the rooms as they are slightly tired and could use an upgrade given itâ€™s rating. Many different room type configurations, some better than others,so look at the room first. On the whole housekeeping is good as is room service, the Dutch breakfast in particular. On property restaurant is expensive and so so, nothing special, but there are any number of good eating establishments in the area, with my preference being for Indonesian.", "Date": "July 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "new york, ny", "Title": "“Great Experience at the Grand”", "Author": "lxrytraveler", "ReviewID": "UR8083107", "Content": "My wife and I just returned from a 3-night stay at the Grand for our one-year wedding anniversary. Our experience was perfect. We checked in at 8:00am and not only did they have a room for us, they upgraded us for free. Both the front desk people and the concierges were very friendly and helpful with reservations, arrangements, etc. I don't think it was a 5-star hotel in the same way some are, maybe very very high 4-star but we did not have any complaints. Also, while we were there, there were several celebrities staying there at the same time and we never felt like they were favored to our detriment. I want to also commend Udo who was an evening concierge for all of his help and great recommendations. We would definitely return.", "Date": "July 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“The Grand Amsterdam”", "Author": "JOCK65", "ReviewID": "UR7635947", "Content": "Just back from a weekend at the The Grand with two other couples, the hotel itself is on a great site and very central. The rating is five star but is probably more like a very high four as some of the place is in need of a spruce up (its not in bad nick just not five star) however the staff more than made up for any slight shortfall with great service and lots of handy tips. The Sunday bruch is also a good way to come round after a heavy night with a great varied buffet and hair of the dog included in the price. If you have a Sofitel loyalty card the room upgrades a well worth it. We would go back again.", "Date": "May 17, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Average - not worth the Euros”", "Author": "Msp07", "ReviewID": "UR7589206", "Content": "Pros: good location, impressive courtyard, courtious reception desk Cons: Concierge (both I dealt with) very rude and not at all helpful, rooms very dated in need of updating, Not worth the cost. I would stay around the corner at the Radisson SAS Hotel - much better experience overall.", "Date": "May 11, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cambridge, MA", "Title": "“Comfort with excellent service”", "Author": "theresama40", "ReviewID": "UR7380620", "Content": "We spent four nights at the Grand over Easter weekend. Room: Our junior suite was very spacious with large windows overlooking the canal. The room was extremely comfortable: great bed, spacious and well appointed bath. If only the decor was a little less bland: blond wood, glass tables, and print fabrics reminded me more of a suburban chain hotel than of a historic property in a fascinating city. (As an aside, why aren't there more affordable boutique design hotels in Amsterdam?) Public spaces: The public spaces were much more interesting than our room. Make sure to take a peek at the gorgeous conference rooms. The pool was nice to retreat to at the end of a busy day sightseeing, even if it did seem more like an oversized bathtub. The fitness room was much less attractive, located in a tiny hallway on the way to the pool. The restaurant where we had breakfast was lovely, but the staff seemed overwhelmed at breakfast time. Service: Excellent! The staff couldn't have been nicer or more helpful. They made everything easy, from finding a restaurant when we arrived late to renting bicycles. Location: Very centrally located. And the proximity of the red light district really isn't an issue -- we were able to avoid it completely, without any trouble. Overall, a very comfortable hotel in a great location with a wonderful staff. If it only had a little more sense of style. . .", "Date": "April 17, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Great stay and very convienent”", "Author": "dagnyfreckles", "ReviewID": "UR7281351", "Content": "We got this hotel at a last minute bargain, and I am glad we did. The room, although small (but not smaller than normal European hotel rooms), was very comfortable. The king-size bed was fantastic and I always enjoy a place that gives you a robe with the towels. Very convienent, right next to Dam Square and walkable from the Train Station. I would definitely stay here again.", "Date": "April 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Canada", "Title": "“Great service, great location”", "Author": "markmccauley", "ReviewID": "UR7229185", "Content": "This is a nice hotel. For the price, there are other places I would stay in Amsterdam on my next visit. The rooms are dated (not in a good way), but the staff are friendly and helpful. My colleague says the frites are the best she has ever had in the world. The temperature in the room (in March) was way too hot. I had the window open all day and night and I still couldn't get the temp below a steady boil.", "Date": "March 27, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Bolton, England", "Title": "“Fabulous Weekend at The Grand”", "Author": "molliemoo", "ReviewID": "UR7155350", "Content": "This is the second time I have stayed at The Grand, the first being approximately five years ago. I chose it this time because I have tried other hotels since and they have not come close in matching the standards of this hotel. This trip was from Friday till Sunday and was a birthday present to my StepMum for her 50th birthday. They have never been to Amsterdam before and I wanted it to be memorable for her. We arrived at lunchtime and felt special as soon as we entered the extremely elegant courtyard. The doorstaff welcomed us and we entered the beautifully maintained lobby area. My parents were very impressed. I love the fabrics and choices of furniture in this area and how it blends so perfectly through into the lounge bar. The reception staff welcomed us with very friendly faces and manners and told us they had upgraded us to a deluxe room. As only one room was ready we decided to have a quick look at the room and go out exploring this beautiful city. The room was perfect. Huge and square and with very high ceilings it made the room feel even bigger. We had a huge bed with feather pillows and quilt that was a dream to sleep in. The bathroom was spotless with everything you needed and perfect white towels. The shower is one of the most powerful showers I have ever had the pleasure of using. Our room had a view of the canal which was truly beautiful whilst my parents room had a view of the inner courtyard which again was beautiful. The staff in the hotel are obviuosly trained to a high standard and it shows on every single level. They are courteous, helpful, professional and extremely friendly without being intrusive. They are also courteous to each other. Nothing was too much trouble for them and never once did I hear the word 'no', it was always 'of course'. The concierge team that they have are very knowledgeable and helped us hugely with many different things all of which was done with what seemed to be no effort or bother at all. The Hotel itself is steeped in history and is maintained and restored to a very high standard. The public areas are spotless and very tasteful and elegant. The lounge bar is a pleasure to be in. They also have a business room where you can use the computers and the internet if needed. Once you retire to your room it is quiet and very comfortable and after many miles of walking, the bed is a welcome retreat. I can now honestly say after staying in two other hotels I will only ever return to this one, this is truly my favourite place and I can be one really fussy traveller. I recommend this hotel and it is a rareity in that it is truly deserving of it's star rating.", "Date": "March 13, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edinburgh, Scotland", "Title": "“Good hotel, great location”", "Author": "bigbird01", "ReviewID": "UR7017712", "Content": "Location: Great!!! You are right in the center of Amsterdam, very close to red light district but set in a very secluded and quiet courtyard. Food: We only had room service while staying but food was very good. Service: The attitute of the staff was very helpful and efficient. The concierge was useful and helped out with museum tickets. Room: Managed to get upgraded from Deluxe room to Appartment. Room was large and clean. The decor was a bit dated but overall ok. The bed was great, very comfortable. Overall: Service was fast and efficient, Food was good and location was great. I would happily stay here again.", "Date": "March 12, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Perfectly Pretentious”", "Author": "lamerazure", "ReviewID": "UR6906500", "Content": "I had high hopes for this hotel, but was greatly disappointed (to say the least). This may be attributed to the less than friendly staff or pathetic service for breakfast. They did bring a welcome gift upon arrival. Although it was a nice gesture, it did not compensate for the lack of hospitality experienced during the remainder of the stay. The staff forced smiles and were extremely aloof. The concierge was not helpful in the least...except for the umbrella that we borrowed for the day. The business center is impressive. There's a great view of the property (it's opposite of the main building) and internet usage is free. It is open 24 hours, but you will require staff escort after 10 (you have to walk across the courtyard to get there). The property itself is grandiose and centrally located, but dated. Please be sure of where you are going... we walked two blocks in the wrong direction and ended up in the middle of the Red Light district at an unfriendly hour. There are also two \"coffee shops\" (side by side) on the walk back to the hotel. I detest the smell of hash, and it permeated the HALL where our room was located on Friday night. The room was very large (deluxe room), especially by European standards. I didn't like the bathroom. There is not a separate shower and the water is not well contained. The beds are super comfortable, but that's standard with Sofitel. Decor is reminiscent of my Grandmother's bedroom. The window treatments matched the wall paper... so basically a continuous stream of English roses with a repugnant yellow background. Ick. In short, I do not enjoy being pessimistic about travel/accommodations. The Sofitel Grand Amsterdam provides a lovely facade, but it's not worth the price. I'm sure you can have a much more pleasant stay SOMEWHERE ELSE. I'm going to further explore my options next time around :)", "Date": "March 3, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "belgium", "Title": "“Very dated”", "Author": "topsmed", "ReviewID": "UR6820747", "Content": "The location is very central and the building (a former city hall) has a lot of potential. The rooms are terribly dated (the bathroom is just fine, typical Sofitel, but small: no separate shower). The spa is small, dark and very hot. The food at CafÃ© Roux is good but not outstanding. Breakfast is a decent buffet with average service and little attention to detail (e.g. wilted flowers in chipped vases on the tables). Given the rates they charge, the place should be completely renovated (which they plan to do).", "Date": "February 21, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Los Angeles Ca", "Title": "“The Grand is Grand!”", "Author": "tyrellco", "ReviewID": "UR6814586", "Content": "Stayed for 4-days in Feb. The hotel was great. We were quite happy with everything. We would definetly stay again as the service and location were great.", "Date": "February 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Croydon, United Kingdom", "Title": "“Grand hotel which lives upto its name”", "Author": "alanreynolds", "ReviewID": "UR6526049", "Content": "I stayed two nights Thursday and Friday 28 and 29 December 20. I had booked the cheapest room through the Accor website using my frequent guest number, and on arrival I was upgraded to a 5th floor suite (room 536). The hotel did not seem to be that busy, in the interval between Christmas and New Year. The hotel is about 10 minutes walk from Central Station (itself a EUR 3.60 train ride from Schipol Airport), though not that easy to find from the map. It sits in a courtyard, set back from a narrow street fronting onto one of the old canals. At the time of my visit, they were doing works to gas/electricity in the road, so the access to the bridge to the shopping street and to Dam Square was blocked to car traffic. The location, in old Amsterdam, is excellent from a scenery and a shopping point of view. The suite had a huge comfortable bed and I slept well. This Sofitel had plenty of cupboard space. The bathroom was tiled and had a bidet as well as WC, basin and bath. The latter had two half doors - see photo - which were not enough to stop the shower soaking the floor. Breakfast was good, though expensive at EUR 28. I did not eat in the hotel. The bar was friendly but smoky. I used the tiled Spa area for its swimming pool. Nice to swim in but not more than about 12 metres in length. If there were more than 3 using it together, it would be crowded. Concierge was full of knowledge and helpful advice about where to find the Anne Frank House, get an Indonesian meal etc. All in all, an excellent stay. At full price, I would hesitate about staying again though.", "Date": "December 31, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“Absolutely perfect!!!!”", "Author": "MazzWootten", "ReviewID": "UR6184824", "Content": "After reading the reviews on here, I decided to book this hotel for a romantic surprise weekend away for my Fiance and I, for his 30th birthday weekend. I telephoned the hotel direct, and told them it was a surprise for his birthday. They said they would try and upgrade us if there was the facility when we arrived. We took a taxi to hotel from Airport, and arrived late evening, and checked in without issue. When we arrived up at our room, we had been upgraded to the MOST beautiful suite I have ever seen. Beautiful bathroom, fantastic canal view, with HUGE windows. We spent some time in the pool and sauna area, and this was fantastic as on two occasions we were the only people in the fitness complex. Attention to detail was five star, including the towel and linen changes, the refilling of toiletries, and the general demeanour of the staff. The bed was fantastic.. slept for hours, which felt like days!! The location was amazing, just two minutes walk from dam square, and two minutes the other way to RLD. We had a beautiful champagne room service breakfast the morning of his birthday, and the hotel gave us a delft pottery replica of the hotel as a present with our room service filled with sweets! All in all it was the most fantastic stay ever, we totally totally enjoyed ourselves! 5****", "Date": "November 28, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Norwich, Norfolk", "Title": "“Weekend break with the best bed”", "Author": "Citybreaker2", "ReviewID": "UR6130698", "Content": "Booked through airmiles so wasnt sure if would get treated differently. However, having read other reviews on this site, emailed to ask for room overlooking the main street - replied within 1 hour to confirm had done so. And what a room .......... lovely big room, with all mod cons and the bed was to die for. Huge fluffy pillows and duvet and both slept like a log!!!! Great location, nice and central for everything, staff friendly and yes you can ask for more tea and coffee sachets, as mentioned in previous reviews on this forum. Top tips, if flying into schipol - get the 3.60 euro train ticket to centraal station - you can walk from there to hotel v.quickly. Also, although Amsterdam is very small and you can walk to most - the 24 or 48 hour tram tourer tickets are great value - the trams are so easier to pick up and clean and you can see a lot more. I think it was 6 euros ish for 24 hours and 10 euros for 48 hours - you need to get them stamped by conductor on first usage. Thoroughly recommend hotel and would go back", "Date": "November 14, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Monaco", "Title": "“The perfect place to stay in Amsterdam!”", "Author": "maccarma", "ReviewID": "UR6055052", "Content": "Stayed at The Grand two nights in two connecting rooms (one king size bed for my wife and myself, second twin beds for our two kids). The location is just perfect, in the heart of Amsterdam at walking distance of main attractions. The Hotel itself is beautiful, an ancient historical building well renovated and decorated. The concierges were extremely helpful and caring. Rooms spacious and with VERY comfortable beds. Hotel facilities very good. Evevrything perfect.... One \"negative\" detail: we expected a much more \"luxurious\" breakfast buffet, the one we had was just fine.... We would definitely come back! AAA! Highly recommended. PS: the afternoon tea at bar, with scones and sandwiches is a total MUST!", "Date": "November 4, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New England", "Title": "“Perfect (for what we wanted)”", "Author": "jhsgooner", "ReviewID": "UR5880226", "Content": "Stayed for a long weekend in Amsterdam. The last time I had been to the town was 15 years ago as a backpacking student, so the local hostel wasn't an option. I tried Amsterdam Escape but no availability so I thought I'd try the Grand's apartment option, which gives you all of the amenities of a hotel but with its own private entrance. The apartment itself was nice - definitely a bit more on the antiquey, English style but no complaints about the decor. The living room overlooked the canal, so we got a bit of noise from revellers but the bedroom was very quiet. Ordered quite a bit from room service - not the cheapest option but not as outrageous as hotels in New York or London. Good location in Central Amsterdam, within easy walking distance to all the major sights. Only a couple of complaints: our room had an Ethernet connection but in a part of the apartment that had no desk or chairs, so not very easy to get any work done or check online for sights. The other was the disappointing water pressure in the shower. All in all, minor inconveniences, especially since I wasn't really there to work. The staff is all very polite and helpful and never put off by the barrage of questions and requests I had. Used the pool, which was refreshing since Amsterdam is pretty humid, even though the air temperature was in the low 70s. Their recommendation for Indonesian was outstanding (Puri Mas).", "Date": "September 26, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "1", "Overall": "3.0", "Value": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Los Altos, California", "Title": "“Very nice hotel but service leaves something to be desired.”", "Author": "ParisDreamin'", "ReviewID": "UR5824444", "Content": "OK, so the hotel is very nice. The room was elegant and stylish. The view of the small canal from the room was a nice bonus. The common areas of the hotel, particularly the courtyard, were gorgeous. The location is OK, not bad, not great. The air-conditioning was somewhat feeble in our room, bringing the temperature to about 72 degrees or so only when set at about 50 degrees. I wanted badly to think of this as the 5-star hotel that it attempts to be. BUT... The service was spotty. Everyone that we encountered was very pleasant, and the concierge was very useful, especially as they sold tickets to the Anne Frank House, the Van Gogh museum, and the Rijksmuseum, the 3 attractions in Amsterdam most likely to generate a line at the door for tickets. The ability to get the tickets from the concierge was a nice bonus. The front desk staff was pleasant enough as well; that was not the problem. Check-in, when we arrived, was OK, a little slow, but not enough so as to put up a fuss. When I attempted to exchange some currency at the desk, however, it took about 20 minutes to do so (and there was no line at the desk). The desk clerk seemed repeatedly distracted by doing other things, and was not really focusing on making the exchange for us. Even when he did it, for whatever reason, he was repeatedly shuffling papers, as if distracted. Regardless, I didn't think much of it. It was check-out that I found to be a fiasco. I called down to have our bags brought down and to have a taxi called to take us to the train station. I was assured that a taxi would be called and that it would be waiting for us after we checked out. We followed the bags down shortly. There was one person in front of me in line checking out already. I waited for about 10 minutes for this person to check out, as there appeared to be an endless amount of paper shuffling once again, by a different front desk clerk. When I arrived at the desk to check out, it took another 10 minutes or so to check me out as well, with the same paper shuffling routine as well as the desk clerk disappearing to the back for a few minutes for whatever reason. After finally getting checked out, we exited to the front, where no taxi was waiting, despite the fact that about 25 minutes had passed since I was assured on the phone that a cab would be called immediately. I asked the bellboy/doorman about the cab, and he replied that he knew that we were going to the train station and that a taxi had been called and would be there any minute. About 10 more minutes passed, and I asked him again about the taxi. He replied that he had just called for one, implying that he had not called earlier and had not been frank about it initially. We then waited another 10 minutes or so before the taxi arrived. Needless to say, we needed to hustle a little to catch our train when we got to the station. Now, I am not snobby or snooty about hotels, travel, or service. I am simply being frank about this, because I don't think that the process of checking out and getting a taxi for transportation should take the better part of an hour, not at a hotel that fancies itself a five star luxury hotel and not at $500 per night. It's a shame, since I think that Sofitel hotels in general maintain a wonderful level of excellence.", "Date": "September 21, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "UK", "Title": "“Fab Hotel”", "Author": "kimpet", "ReviewID": "UR5814162", "Content": "Lovely elegant comfortable Hotel, very central, lovely rooms. Only one itsy bit of moans, its very expensive !!!!! Would definitely go back though,", "Date": "September 18, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "wirral", "Title": "“pure luxury - excellent”", "Author": "snoopyjoe", "ReviewID": "UR5775584", "Content": "Would just like to say that my sister and I visited this wonderful hotel for two nights. Wow Wow Wow - cannot fault a single thing with this hotel, a real gem of a find - If you are lucky enough to be travelling here you will have a wonderful time. Staff extremely attentive and polite. Didn't have breakfast here - thought it a little expensive but plenty of places to eat elsewhere so not a problem. Cannot wait to take my husband here next year for a wonderful romantic break!", "Date": "September 6, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Mateo", "Title": "“Best in Amsterdam”", "Author": "Tipster2000", "ReviewID": "UR5775292", "Content": "My stay at the Grand Sofitel Demeure for 4 nights in July, 2006 was excellent. I paid 295 euros as a summer rate for a spacious junior suite on the courtyard. Clean and well maintained. Very quiet except for muffled early evening conversations from outdoor diners in the courtyard. Top location on a quiet street only a couple of blocks from the Dam. Secluded feeling. Intimate atmosphere. No smoking rooms. Four computers in business center for free internet access. Superb dinners in wonderful courtyard during the summer--expensive, but worth the price. Very good breakfast buffet. Friendly and efficient staff. I prefer to the Pulitzer and L'Europe. Don't confuse with the other Sofitel in Amsterdam that is closer to the train station. Only defect was thermostat that had to be turned on or off manually--strong and effective air conditioning, but never turned off except by a flip of the switch. Probably a quirk of my room. An elegant and very satisfying hotel.", "Date": "September 6, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Colorado, U.S.A.", "Title": "“Excellent Experience”", "Author": "olivia_c", "ReviewID": "UR5711555", "Content": "We stayed at the Grand Amsterdam for four nights the end of July, en route from the U.S. to Africa. I had done a lot of internet research on hotels and prices, and this looked perfect - and it was. We have three teenage children and so needed two rooms, which really increases the cost of lodging -- but still wanted a four or five star experience. As noted by the other readers, this hotel is lovely, professional and comfortable, and treated our children with as much respect as they did adults. We had one courtyard room (junior suite, with room for a single bed in the small tv/changing room), which was wonderfully quiet, and a canal room which had minimal noise. The deciding factor for us in choosing this hotel was that it is air conditioned, and this proved to be important - it was quite hot the week we were there, and to come back to an air conditioned room after walking for hours, and look out over a beautiful, tree and flower filled courtyard, was lovely. Friends of ours stayed at one of the canal hotels, which they found quite charming but quite hot. We wanted to arrive in Africa well-rested, and air conditioning made sleeping much more comfortable. I found a very good rate on premierhotels.com, which included breakfast - breakfast is very expensive separately, and we would not have done it otherwise, but it turned out to be one of those experiences that really make a travel day. It is a comprehensive buffet with fresh orange juice and incredible hot chocolate, and was a wonderful way to start the day. It also allowed us to eat a light tea/snack in early afternoon, and then a more substantial dinner. We had both tea and lunch in the courtyard restaurant, and both were excellent - although a little pricey. Even though we booked through an internet website and I was anxious about every aspect of the reservation, we had absolutely no problems, including with the price. It's still a good idea to bring written confirmation, though, since it makes it easier for everyone when you're holding an actual document. As for location, the red light district literally began at the end of the block, but there was almost no spill-over of activity, and it was easy to avoid it. We did walk the edges a number of times, and it provided a great opportunity for our small-town kids to see another side of life and a very natural way for us to talk with them more about those kinds of activities. I would definitely stay at the Grand again, and wouldn't hesitate to recommend it to a wide range of people.", "Date": "August 26, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbus", "Title": "“Loved the Grand Demeure”", "Author": "rcohen936", "ReviewID": "UR5707148", "Content": "This hotel is perfect in every way. It's location near Dam square. It's Cafe Roux restaurant ,buffet breakfast, housekeeping staff, front desk, concierge, bartender,etc. Our room was quite large. We were upgraded to a Jr. Suite upon arrival. Our every request was handled without any problems. My wife & I were celebrating our anniversary with the final two days in Amsterdam. I've become a Sofitel customer since staying here. They even arranged a fixed rate for our taxi returning to Schipol airport Bob C. Columbus Ohio", "Date": "August 24, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Beautiful hotel”", "Author": "LMontagu", "ReviewID": "UR5700986", "Content": "The hotel is beautiful & elegant with great facilities. The room was a brilliant size for Europe & very comfortable with all I needed. Travelled on business & the staff were excellent with all of my needs, very professional, friendly & helpful and always with a smile. I felt very looked after. The hotel is in the red light ditrict so wonderful atmosphere & perfect for exploring. My only small complaint is that it was a little (very slightly) noisy at times (i was overlooking a canal) but overall absolutely wonderful, no hesitation in recommending both business & leisure travellers. Enjoy!", "Date": "August 23, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Ontario, Canada", "Title": "“Every Minute Was An Excellent Experience”", "Author": "KGD'sMOM", "ReviewID": "UR5600979", "Content": "My husband, daughter and myself spent three nights at the Grand in August. It rained the entire time we were there but we enjoyed the city and the hotel provided umbrella's. We booked a superior room with two single beds and they put a cot in the room for our daughter. The two single's were together and all three had duvet's and feather beds. It wasn't a large room but nicely decorated, with a view of the canal. We enjoyed the turn down service with Belgian chocolates and slippers. Our daughter loved the pool and spa area. The robes, slippers, and Roger and Gallet toiletries were a nice touch in the change rooms. Every single person we encountered made us feel welcome. It's a beautiful hotel in a very central location. I booked the room on their own website with their hot deals. Around the corner is Renee's Bakery, we ate breakfast there and it was delicious. In fact all the Bakery's we went to had fantastic (and fattening) food. If we ever return that will be the hotel we stay at.", "Date": "August 11, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "New Zealand", "Title": "“Truly deserves the title of \"The Grand Hotel\"”", "Author": "A TripAdvisor Member", "ReviewID": "UR5317438", "Content": "My Husband and I had the pleasure of staying in this wonderful Hotel for 1 week. I cannot rate it highly enough! Being our first trip to Europe I cannot imagine a better introduction . From the moment I stepped into the courtyard I could feel the history.Coming from New Zealand we had been warned not to expect the larger suites we have here,and although smaller they certainly made up for that in every other area.The service was exceptional from every Staff member! The food excellent!! I love your City,your warm friendly people,Thank You!", "Date": "June 7, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "MÃ¼nchen", "Title": "“Nice hotel with improvement potential”", "Author": "emaxxmuc", "ReviewID": "UR5192568", "Content": "We stayed 3days in this hotel and enjoyed it a lot. Never the less there are some points they should work on: Pros: +Location (itÂ´s really in the center of amsterdam) +If you have a room with courtyard view itÂ´s quiet (I donÂ´t know the other rooms) +Nice and -for Amsterdam-standard- quite big rooms, furnished in an old fashioned but nice way +good business center Cons: -The quality of service is sometimes not the one of a 5-star hotel (waiting time and some of the guys are a little bit arrogant). -Take your reservation with you - they tried to charge a much higher price at the check out compared to the one I booked at [--] (Of course this could happen anywhere, but I read about the same thing in another review too, so be prepared) -Paying 28â‚¬ p.P. for a breakfast is redicolous - go elsewhere in Joordan Quarter -The resteraunt-tip from the hotel-staff had two problems: A) It was closed and B) from outside it looked like a tourist-trap I would never walk in Enjoy your trip...", "Date": "May 23, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "London, UK", "Title": "“Beautiful hotel”", "Author": "Figa7", "ReviewID": "UR5022134", "Content": "I stayed in this hotel for one night recently and absolutely loved it! We got the train from the airport to the city (just over â‚¬3) and then got a taxi for â‚¬11 to the hotel. We arrived early so we couldn't check-in straightaway as the room wasn't ready yet but the receptionist gave us a map of the city and gave us advice on the best restaurants and sites nearby. She couldn't have been more helpful. The room was huge and had a canal view. Large bathroom as well. Location was great. Red-light district is just around the corner from the hotel but the hotel itself is very quiet. Our room looked out over the front of the hotel and we couldn't hear a thing. Plenty of things to see and do nearby and nearly everything is within walking distance. I recommend that you get the I Amsterdam card when you get there - you get free trams and buses and entrance into most of the major museums and sites. You also get 2 free canal boat rides and discounts on a lot of other attractions. We got the 48-hr card for â‚¬43 - well worth it!", "Date": "April 30, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Excellent until checkout”", "Author": "Gothicist", "ReviewID": "UR5018443", "Content": "We stayed here for three nights. It is as comfortable, indeed as luxurious as any reasonable person could ask. The staff was pleasant and helpful, but unintrusive. Some people might find the location too close to the Red Light district, to the right of the entrance, but to the left is the University area. Amsterdam is a compact and dense city. We walked to the museum neighborhood in about 45 minutes. Trams and taxis are plentiful and reasonable. And English is virutally the second native tongue. The hotel restaurant is very good as is the one in the nearby Hotel Europe, and there are many nearby restaurants in all price (and quality) ranges. Only at the time of checkout was there acrimony. We had found a good rate on the internet, oddly through a hotel site based in Utrecht, averaging 265 euros, and they had already taken it from our credit card. They insisted that the actual rate was 295 euros per day, plus city tax. The first person refused to budge, and her supervisor at first said it was impossible to adjust. We had our confirmation number, and then the supervisor relented. If you are paying less than the full rate, I recommend you keep proof of the agreed price. Except for this, it was a superior hotel.", "Date": "April 29, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Paris, France", "Title": "“An absolute no-fault!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4987262", "Content": "I have been to Dam during '06 Easter week end and enjoyed a three-night stay at The Grand. From the entrance into the impressive courtyard until the final moment of the check-out, everything has been absolutely perfect. My 5th floor room was awesome with a huge floor-to-ceiling window overlooking the city, an amazing bathroom and all the luxury that one would expect from a five-star hotel. The room service was not cheap but the service and the dishes could not get faulty. Make sure to try out the spa on the groundfloor with its swimming pool, turkish bath, sauna and jacuzzi. This will make your day whole, believe me. All in all, I think I have found THE place where I will stay in Amsterdam whenever I come back. I had already been there five times, staying at the Amstel or the Kras. Don't get me wrong, the Amstel is a perfect hotel in every sense of the term, but The Grand is about three times cheaper (!) and almost as good as the Amstel, so the latter can't stand the comparison!", "Date": "April 19, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "aberdeen", "Title": "“Fantastic location”", "Author": "dreamholiday", "ReviewID": "UR4734911", "Content": "Stayed in this hotel for a long weekend last year and it really was beautiful. Fantastic breakfasts! Had dinner in the restuarant and that was excellent also. Only down side was the bar was really smoky but then most of Amsterdam is! Would recommend the hotel but probably will not go back to Amsterdam as it was nice but i hate smoking!!", "Date": "March 26, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Solid four stars”", "Author": "TrutherReviewer", "ReviewID": "UR4734276", "Content": "I recently spent five nights at the Grand. While it was comfortable and the location very good, I cannot consider this hotel five star. The front desk, while friendly, gave information that was often incorrect. The first instance involved train schedules and payment for train travel, the second directions within the city to a well-known modern design shop on a principle canal (they were off by a twenty-five mintue walk). Also, the main restaurant and room service quit cooking at 10:30, except for very rudimentary room service offerings (not even eggs). I'd rate it four stars with a smile. Not bad, but hardly five stars.", "Date": "March 26, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Staffordshire, England", "Title": "“Loved this Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR4568482", "Content": "Stayed at the Grand for 2 nights last weekend in a Junior Suite and could not fault it in any way. Location is great, on the edge of the red light district but lovely and peaceful. Staff were extremely helpful - nothing was too much trouble. Ate breakfast in the Cafe Roux and found it to be excellent value for money, with extremely attentive wating staff. Would definitely recommend this hotel.", "Date": "March 2, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Birmingham", "Title": "“Art at The Grand”", "Author": "A.B.GBirmingham", "ReviewID": "UR4472254", "Content": "For the past five years we have treated ourselves to a 3 night stay at The Grand. We don't have much to add to the previous very positive comments except: If you are interested in C20 Art ask to see the Marriage Chamber, which is absolutely stunning. There is also an original painting in the entrance to the Roux Restaurant (by the CoBrA school) Staff as friendly and helpful as ever, lovely room but we felt that there had been some cost cutting since last time (Summer 2005): 1.The changing rooms at the swimming pool used to have slippers for pool side; individual bottles of toiletries etc now there are just dispensers. 2. The restaurant used to make a feature of the fixed price menu, now it is almost hidden away on the main menu and only 2 choices per course (3 courses) at 38 euros - not such good value. This may sound petty but it is a 5* hotel charging 5* prices and, unless you get a very good deal on the breakfast - go elsewhere, it's not worth 28euros!", "Date": "February 20, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Great Location & Beautiful Hotel”", "Author": "AussieCraig67", "ReviewID": "UR4250970", "Content": "A great hotel - lovely building and perfect location. Just two blocks from the Red Light District, it feels a world away if that is not your thing. The staff were extremely helpful and the rooms finished well (the bathroom was especially nice, capped by heated floor tiles - a little luxury in the chill of Amsterdam winter). There is also a very lush restaurant in the hotel which serves excellent food and a good wine list. We will definitely stay here on our next visit to Amsterdam.", "Date": "December 19, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Antwerp, Belgium", "Title": "“The story of a great experience”", "Author": "DavidBelgium", "ReviewID": "UR4089349", "Content": "Room (standard): The room wasnâ€™t really big but certainly spacious. A very large and comfortable bed. The dÃ©cor of the room was very warm and classic. A very large window overlooking the inner garden. The bathroom wasnâ€™t very big but luxurious and plenty of souvenirs like a lot of Roger & Gallet products (which I was pleased to find there as I use them every day), a peak with little mirror, â€¦ Area: The hotel is in the center of Amsterdam but in a safe and discreet location. The bars and shops not far from the hotel arenâ€™t really nice, you can smell marihuana everywhere, but I suppose thatâ€™s Amsterdam. Staff: Very professional, simply top! Very friendly and helpful. Breakfast: I took breakfast in my room, which was expensive (32â‚¬) but very good. As you can see on the pictures it was breakfast and dinner in one. Bar: The bar is very cosy with typical English furniture, very friendly and professional waiters. Ideal for a nice drink in the evening. CafÃ© Roux: I had dinner in the restaurant, it was really excellent. Iâ€™ve visited a lot of restaurants but I must say Iâ€™ve tasted the best terrine ever in cafÃ© Roux. My compliments to the very friendly sommelier, who served excellent wines with a story to every bottle. I would certainly recommend the restaurant. If you like old chique and are willing to pay a reasonable amount, go there. This is the best hotel I ever stayed until now. The attention to details are incredible: chocolates on the bed in the evening, slippers with the logo of the hotel, the room constantly smelled like a rose, â€¦ The only negative thing about a hotel like The Grand is that it makes it more difficult to appreciate a more mediocrate hotel in the future.", "Date": "November 6, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Expensive but worth it!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4080773", "Content": "I stayed in the Grand at the end of October 2005 and stayed in a standard single room. I agree with most of the previous comments, the hotel was well preseneted with a really nice garden at the back (which my room faced). All the staff were very helpfull, even when Ifound a mouse plus droppings under the table in the lobby. One point worth mentioning is that if you are asked if you would fill out a survey, say yes as they give you a free drinks voucher for the bar. The room was a fair size with a huge bathroom, free slippers and gowns (as you would expect). Tried the room service which was expensive but again well presented and the food was excellent. With regards to beakfast (26 euros) it wasn't the biggest breakfast I have seen but there was smoked salmon, eggs, mushrooms etc. Used the gym a few times but to be honest the gym was a left down, it only had a running machine, cross trainer and bike (but enough for a quick workout if you feel guilty afer all the food). Finally in summary expenisive but by far the smartest hotel in Amsterdam.", "Date": "November 2, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "2", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Birmingham", "Title": "“Good but overpriced”", "Author": "cs0025", "ReviewID": "UR4017006", "Content": "I stayed at The Grand with my wife on a short break. Lovely building with lots of history, friendly personnel and a great breakfast in a trully memorable cafÃ© that is very popular. Rooms are not as well decorated as you'd expect for a luxury place that charges you those rates. No complimentary water in the room neither international newspapers available. Carefull about the restaurant recommendations at the concierge, which were disappointing.", "Date": "October 12, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“Fantastic hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR4003129", "Content": "We stayed for three nights in the Grand and couldn't have been more impressed. We had perfect peace and quiet in a lovely room overlooking the central courtyard (away from the front street which does border onto the more 'lively' red light district). The staff were friendly, spoke perfect English, and there was no effort spared to make our stay enjoyable and relaxing. A truly 5-star experience for us.", "Date": "October 9, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Interesting Hotel!”", "Author": "bertie", "ReviewID": "UR3939701", "Content": "We have just returned from 3 nights at the Sofitel Grand, staying in a Junior Suite. Our welcome was excellent making us feel as though we had definitely made the right choice. All the staff were friendly throughout the stay although we had a few blips with level of service which is a shame as the hotel has a lot of the ingredients to make it excellent. The location is interesting! In a beautiful building with a lot of history. Be warned though, it is VERY close to the red light district. We are certainly not prudes but the location of the hotel meant that, mainly in the evenings, the area was full of large groups of men on what seemed like 'lads nights out'! I also hate to say that a lot of them were English too who seemed to have had a sherry too many!! Hence lots of noise and lager drinking in the bars nearby the hotel!! Not conducive to a romantic night out!! On our last evening the gas in the hotel kitchens went out and therefore the menu in the restaurant was extremely limited. We had to revert to room service (again a restricted menu because of the problem) and no apology was made for this inconvenience. In our mind the hotel should have given notice that there was a problem so that we had time to make alterntiave arrangements (apparently it had been out all day). Not good for a 5 star hotel. We would return with a group of mates for fun weekend. We wouldn't return for a romantic weekend away with a partner!!", "Date": "September 26, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "San Francisco, CA", "Title": "“Historic, Charming, Central, and Worth the Stars”", "Author": "A TripAdvisor Member", "ReviewID": "UR3844595", "Content": "My husband and I were in Amsterdam for several days. We got a good deal at this otherwise pricey hotel (stay 4 nights, 1 night is free). The rooms and service were really 5-star, especially by European standards. The room and bathroom had all the amenities. The staff was courteous and always helpful. The turndown service with hotel slippers and chocolates made us feel very special. They were helpful in confiming our flights and making reservations for us. Try to get breakfast included, as it is a very nice European spread in their upscale French restaurant, inclusive of cappuccinos or whatever you want. The hotel is quite historic and has been around more than 5 centuries, first as a convent, then as Town Hall. The Queen was married at this hotel. If you are looking for a place which is charming, does not feel like a large chain hotel, and is luxurious, stay here. Our friends who stayed at the more modern Dylan found it to be \"hip,\" but the rooms were dirtied (the white sofa was no longer white and the walls and furniture there were scuffed) and the staff there was not as helpful. The Grand is very central and we did not need to take a cab or public transportation anywhere. It is very close to the red light district, but is tucked away from that traffic.", "Date": "September 5, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "England", "Title": "“Excellent Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3832628", "Content": "Just returned from a weekend spent at this excellent hotel. On arrival we were upgraded to a junior suite and also given a complementary token for a glass of champagne as we had to wait all of 15 mins for our room. The location is excellent, but also very peacefull. We had a meal from the Room Service Menu one evening, just a burger and fries but it was excellent value and very tasty. Everything about this hotel is impressive, the service is second to none, this hotel truly deserves its 5* rating.", "Date": "August 31, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Miami Beach", "Title": "“Truly Grand”", "Author": "ziggymbg", "ReviewID": "UR3805292", "Content": "After having spent many weeks reading countless reviews I finally decided on The Grand. I do not regret my choice as The Grand was truly grand! Everything; the hotel grounds, my room, the staff, the location could not have been any better. From the first moment I walked off the busy street into the beautiful quite courtyard I knew this place was special from top to bottom.Simply breathtaking. It was like walking into royalty, into history, my very own centuries old estate. Pleasant, finely dressed, prompt and professional staff greeted me at every turn with a smile and there was a lot of staff. One young man even gave me tour of the various old rooms used in history for weddings, meetings etc. etc. Another gave me an umbrella when it rained, arranged a massage, and recomfirmed my appointments. Treated like a guest should be treated. My room was spacious and comfortable. I remember reading other reviews criticizing the old wall paper and decor but to be honest after being in The Swiss Hotel in Berlin and the Hotel Joseph in Prague it was nice to be in a older classic setting so I had no problem with this at all. The bed was great and the bathroom very nice with all of the Roger and Gallet products I could possibly fit into my suitcase!! Add a canal view, fluffy bathrobe and slippers, and I was in heaven. Oh, and the turn down service every night with a yummy chocolate, and slippers placed on the floor by the head of my bed was just over the top. Stunning! Whenever I left my room be it a stroll in my bathrobe to the spa or for a day or night out on the town, I chose to walk down the marvelous stained glass staircase fantasizing about all famous people who too had descended those stairs. The sense of history was prevalent throught this hotel. The garden was very nice too. Nice extras: a business center with 4 computer terminals and free internet usage, unlike all the other hotels I was in that had only one terminal and a lot of waiting time to use them. Not here. Also this hotel never felt crowded or rushed or busy. (I had thought about staying in the Krasnapolsky and I'm so glad I did not choose that train station; they were so busy and crowded and full of people pushing and shoving and THEIR business center charged quite a fee for internet usage.) The location of the Grand was unbelievable; easy tram access, right near Dam Sqaure but totally away from all of the craziness, next to one the best coffeshops in town, across the canal from my favorite restaurant \"van Kerkwijk\", and short walks to all of the nicest parts of the center city, the red light area, as well as the Rembrandtplain, Leidisplain etc. In addition, the security at night was top notch... The Grand was truly grand in everyway, I had a magical stay, and I highly recommend it.", "Date": "August 24, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Augusta, GA", "Title": "“Great Hotel....Great Location”", "Author": "A TripAdvisor Member", "ReviewID": "UR3768855", "Content": "My wife and I just got back from a post cruise 2-night stay at The Grand and could not have been happier. The staff was incredibly friendly and the room was glorious. The location is convenient to everything you would want to see in town and within walking distance of some of the major attractions. We followed the concierge's suggestions for dinner at a casual local restaurant and he was right on. The next time I am in Amsterdam I will be staying at the Grand again.", "Date": "August 16, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Edmonton, Alberta Canada", "Title": "“The best Amsterdam Hotel - full stop”", "Author": "Smitten", "ReviewID": "UR3726368", "Content": "My husband, eight year old son and I stayed at the Sofitel Grand Demeure for 4 glorious days in Amsterdam after a Holland America cruise that ended in Rotterdam - after being pampered for 12 days in the Baltic - it was going to be tough for any hotel to compete. The moment we entered the courtyard at the Sofitel (July 14, 2005) we knew that this was heaven - no matter where you turn on the property there is someone to meet your every need - you will be hard pressed to find that kind of hotel staff anywhere, even in North America. We stayed in a junior suite which was way more space then we needed but the bed is to die for. The best European bed you can get with great maid service. There is a pool which children love, (with lots of towels) as well as a dry sauna, steam, and a gym. The room amenities are top notch complete with slippers to wear whilst you make your way to the spa. The gym isn't top notch but if you need a work out it will do. A bonus is free internet access to a computer room what a great idea for a hotel and you meet the nicest people in there. Good way to make your way back to trip advisor! I am told the restuarant is the best - and although we did want to go, our 8 year cannot sit still for that amount of time to let others enjoy their food so we opted out. As books say it is only a block from the red light district and no worries about that - you would never know and security is it's finest in the evening as well as during the day. Amsteram is very much a walking city and we did not take a tram once - so even to get to Vondelpark, the Van Gogh, Anne Frank's House you can walk everywhere - there is a great variety of restaurants in the neighborhood - and I can tell you what a treat it was to come home to the Sofitel for 4 evenings with friendly staff - a fresh basket full of apples each day at reception and the beds to die for. If you are carrying hardly any luggage you can walk it from the train station. Also a good tip is to buy tickets to Anne Frank's House, the museums etc you can do that at the concierge at the Sofitel - will save time lining up somewhere else - and there is no surcharge for this service. You also meet the nicest guests right in the lobby - I am sure that is because of the staff - there is very much a relaxed feeling at the Sofitel. We will go back again and again when we return to Amsterdam - the stay wouldn't be complete without the Grand Demeure. What a fabulous memory we left Europe with.", "Date": "August 1, 2005"}], "HotelInfo": {"Name": "Sofitel Legend The Grand Amsterdam", "HotelURL": "/ShowUserReviews-g188590-d189389-Reviews-Sofitel_Legend_The_Grand_Amsterdam-Amsterdam_Noord_Holland.html", "Price": "$336 - $741*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Oudezijds Voorburgwal 197</span>, <span class=\"locality\"><span property=\"v:locality\">Amsterdam</span> <span property=\"v:postal-code\">1012 EX</span></span>, <span class=\"country-name\" property=\"v:country-name\">The Netherlands</span> </span></span></address>", "HotelID": "189389", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/54/7c/9c/exterior.jpg"}}