{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "England", "Title": "“Confortable Rooms”", "Author": "lialo", "ReviewID": "UR139576322", "Content": "We were in this hotel for one week. It has spacious room, very comfortable beds, great location and very easy transport accessibility. The staff was very friendly and helpful. I would return here without hesitation.", "Date": "September 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Riga, Latvia", "Title": "“Incredibly nice stay”", "Author": "Ilgvares I", "ReviewID": "UR138969479", "Content": "I was in large group of people from different Parliaments worldwide for seminar organized by Congreso de los Diputados, on March this year. We stayed at the Hotel for two weeks and I must say that during that period I felt almost like home, so - everything was great – room, hotel, service, bar, location, even - wine bar opposite of the hotel front door is superb. The food in the hotel is regular, means ok. Yes, I have to admit, that Israel's front desk team was great by solving some of my special needs regarding my room. That hotel is my recommendation!", "Date": "August 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Solid hotel”", "Author": "hookedonafeeling", "ReviewID": "UR138589407", "Content": "Stayed here back in July when rooms in Chueca are at a premium. The hotel was reasonably priced, perfectly located, had a friendly staff, and was very clean. My only complaint is that the beds were overly hard Also, as someone else mentioned, the pictures of the rooftop pool are VERY deceiving. It's essentially a hot tub and the space is so small that it only holds 2 lounge chairs. Still, if you know all of that ahead of time, you can't go wrong here.", "Date": "August 27, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Maybe okay for tourists, but not for meetings”", "Author": "Amy B", "ReviewID": "UR136887964", "Content": "The location is great, this is true. Very central. And the lunches were okay (aside from the restaurant staff not understanding that the vegetarian in our group was not vegan...). However, if you are planning to have a meeting with this hotel, I would strongly recommend going elsewhere. The conference staff are incredibly disorganized and unhelpful, and were very inflexible with basic changes and/or requests that a normal meeting situation demands. The meeting spaces themselves are small and smelled terrible (ie: at best, dusty and stale, at worst, like an overflowing toilet). Water and coffee were not refreshed throughout the day and we kept running out (although we paid a LOT for this service), and there were a lot of mistakes, delays and confusion overall. In terms of the hotel rooms, they were average but fine. Good towels. The pool is very small and thus FULL of people and very cloudy water. The pool opening hours were also inconvenient. All in all, as a place to stay as a tourist, it is average at best. And for business, I would not recommend it at all.", "Date": "August 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great, Good Value Hotel”", "Author": "TravellingClaireb", "ReviewID": "UR136268862", "Content": "Stayed for two nights in July. The room was lovely, very large with a great bathroom. The hotel location is very good, within walking distance of most of the main sights. The rooftop pool area is a nice addition, however be aware that it is very small. Only about 6 people can fit comfortably in the area so most of the time it's to busy to be used. Overall I thought this was a great hotel and a bargain for £50 per night.", "Date": "August 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "", "Title": "“Great location, good service and large rooms”", "Author": "Journeyma", "ReviewID": "UR136203168", "Content": "I went to Madrid for the first time a couple of weeks ago, as I have never been in Madrid I wanted to find a hotel close to everything and Catalonia Gran Via lived up to my expectations. I rate the hotel as a typical 4-star hotel.", "Date": "August 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Good hotel, great rates”", "Author": "Danny_jp", "ReviewID": "UR136161343", "Content": "Stayed for two nights on a short business trip. Booked the hotel directly from their website. Great location and big rooms. I got a double room, and like many in Europe, it was two single beds pushed together. Room had a mini bar and free WiFi. However, internet access was very very very slow. Speedtest rated it as only 0.200 Mbps. But fast enough for a Skype call. Had breakfast everyday in a small cafe around the corner. 3.25 vs 19 euro :-)", "Date": "August 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Spain", "Title": "“Very good location. Friendly staff but quite old hotel”", "Author": "seasea01", "ReviewID": "UR135421307", "Content": "I often use this hotel for business. The staff is very friendly and efficient. The rooms sometimes are ok, but some need a refurbishment and are not in good conditions for a 4 star hotel. Location is perfect. I would suggest the manager to keep the pool open from sunrise to sunset. The fact that the woman that cleans the swimming pool area leaves at 8pm is a poor explanation to close the pool at 8. Customers that want to relax after a hard day visiting the city or working can't do it many times. When my room is near rhe swimming pool I see people trying to use that facility before noticing it's closed.", "Date": "July 26, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Birmingham", "Title": "“Possibly my worst ever check-in experience”", "Author": "jon G", "ReviewID": "UR134345302", "Content": "There is a lesson to be learnt - if you want a double bed you need to specify that in the booking-myself and my wife booked in for our romantic weekend and were shown a room with twin beds - it took over an hour of complaining before we finally were given a double room we thought we'd booked (albeit we had to change after the first night) The lack of empathy and help was marked and we lost an hour of our first evening battling with their staff with very little apology.... Also dont be fooled by the picture of the pool it is extremely tiny and just 4 or 5 sun beds and the roof pool is packed.... Nice central location between the main park, shops and Plaza Major just a short walk away... Overall the rooms are spacious and clean although given our experience we won't be going back!!", "Date": "July 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Manchester", "Title": "“Great location, brilliant pool on roof!”", "Author": "Ben1982Manchester", "ReviewID": "UR133916974", "Content": "Great hotel on centrally located Gran Via, walking distance to Puerta del Sol, Chueca, Retiro park and most central attractions. Nice rooms, good service and the pool on the roof is brilliant. Not massive and busy at certain times (4-6), but lovely for a refreshing dip after a hot Madrid day. Breakfast available in the hotel but we had lovely breakfast and cortados con hielo at Mercado de la Reina across the road, much recommended. Loved Madrid, can't wait to go back.", "Date": "July 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Varese, Italy", "Title": "“a good compromise”", "Author": "Gualty1970", "ReviewID": "UR133256931", "Content": "The price is higher than the same standard you can get in others similar hotels in Europe. But this justify a very good position in the city centre. Service is likely positive. Rooms are cleaned. A good compromise especially for business staying.", "Date": "July 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "tampa, fl", "Title": "“Average Choice”", "Author": "gus g", "ReviewID": "UR131760900", "Content": "Located perfectly in the Gran Via aerea. 5 minutes from Puerta Del Sol. 10 minutes from Parque del Retiro. Parking is not really closed from the Hotel and costs 30Euros per day.", "Date": "June 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Good choice”", "Author": "Jen W", "ReviewID": "UR131361389", "Content": "I stayed in this hotel for one night in a standard room and was very impressed by it. It is modern and clean, the room was immaculate and a good size - with a separate area by the window with two chairs. Ours was room 321 and I would ask for it again. The only downside was the pool, which we had been looking forward to. It was very small - like a large bath - and there weren't enough loungers. The ones there were were all used - one woman was lying across three and refused to move. maybe just a bad bunch of guests when we visited, but it means we couldn't enjoy the facilities. On the positive side, the location is excellent - plenty of good bars and restaurants nearby and easy walking distance to Madrid's excellent galleries. As a woman alone I felt safe walking around at night as the main road is light, bright and well used.", "Date": "June 5, 2012"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow", "Title": "“Great Hotel”", "Author": "Lesley18Glasgow", "ReviewID": "UR130512555", "Content": "My friend and I stayed in this hotel and were impressed by it. Hotel is modern and clean. Staff were polite. We asked for a quiet room as we did not want a room facing the main road. Room was at the side and was indeed quiet, did not hear traffic. The room was clean and very tidy. There was a small kind of area off the room with a small table and two chairs, fine if you had time to chill out. Limited English speaking channels on TV but we were not there to watch TV. Roof top pool is clean albeit a small area, a few loungers about but unfortunately we did not have time to use the pool, too busy sight- seeing in a beautiful city. Hotel is well located for the excellent restaurants and tapas bars. Would definitely recommend.", "Date": "May 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Great location in Madrid”", "Author": "Alina M", "ReviewID": "UR129940212", "Content": "The hotel is in the center of the city, neear to the metro station. It is clean and the staff is frendly. The breakfast was plentiful and diversified. If we will come back to Madrid, Catalonia Grad Via will be our first choise.", "Date": "May 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Saint Paul, Minnesota", "Title": "“This place is perfectly fine”", "Author": "canfieldo", "ReviewID": "UR128360423", "Content": "I was there for a week, April 15-21, 2012. There was nothing wrong with this hotel at all. I had none of the problems some other reviewers describe. The room was fine, the breakfast buffet was good, my 5th floor room looked out over a side street, but rarely was there much noise. The hotel tended to be a little overheated, but I could open my windows. Wi-fi was free, though it tended to kick off with even brief non-use. You have to sign in often. The location is great, right on Gran Via, two blocks from a Metro stop, four blocks from Puerta Del Sol. I would definitely stay there again.", "Date": "April 22, 2012"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“Central location but very poor”", "Author": "Philyellen", "ReviewID": "UR128044418", "Content": "This hotel is very cheap and well located in the centre of Madrid. I can see why.... It's very dated inside and I had a choice between either a room that smelt terrible or a room with a view of a wall and that's it. Not recommended. Clearly not 4 stars as they say.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Zurich/Switzerland", "Title": "“A **** Hotel???”", "Author": "gentiana", "ReviewID": "UR127171471", "Content": "It was the louziest **** Hotel I ever stayed worldwide! I was only booked in a Standard-room,3rd floor, although I expected something else! It was below ***! ROOM: The bed was so hard one could have easely slept on the floor. The nice melody of whatever electricity utensils made it unable to sleep through at night. The windows were not even properly insolated, the room with a \"view\" into the patio (next housewall). The Bathtube showed a lenght for a 10 years old , self I am rather of \"barroque appearance\". Although the room was very clean. BREAKFAST. Great selection what ever you expect on a breakfast-buffet. In the **** Hotel I liked most the cold fried eggs and the cold baccon!! RECEPTION: The male receptionists were extremly friendly and helpfull in contrary to the females. To say \"Thank you and Good Bye\"? - Words unknown in that **** Hotel", "Date": "April 3, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Long Beach, California", "Title": "“Great location”", "Author": "jozzy3000", "ReviewID": "UR126866179", "Content": "Again, I can't say this is the nicest four star hotel I've stayed in. Pretty basic amenities and the rooms were basic as well. This was a really great location! It was central to everything in the city. The Reina Sofia was the farthest site we walked to and it was only about 15-20 minutes. El prado is 10 minutes away walking distance and you're very close to a lot of the great restaurants.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Walnut Creek, CA", "Title": "“VERY SPECIAL hotel gran via, barcelona, Spain”", "Author": "Adrienne R", "ReviewID": "UR126359998", "Content": "This is the greatest location! Small hotel, Many years ago, before remodeling to a hotel, was a mansion. We had booked a double and when we checked in the desk clerk, looking at my 6'2\" husband, and my being 5'8\",and American suggested we may be more comfortable in a room with twin beds (which could be pushed together) since the European doubles were just that, a small, (by American standards,) double bed... no queen or king!, but we could still have the courtyard view, and balcony for the same rate. (we were glad we did!) The room was quiet, bathroom was immaculate, great shower, etc. etc The the location was just TERRIFIC . Very large breakfast buffet and VERY helpful staff. This is an older EUOPEAN hotel at a very reasonable price. If you get a chance wander around, see the lovely ballroom, the majestic staircase and just imagine what it must have been as a private home!.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow", "Title": "“Great Hotel, Great location”", "Author": "juliag35", "ReviewID": "UR125633034", "Content": "we stayed here in February for a long weekend, the Hotel was perfect for our visit, i was a bit apprehensive after reading some of the reviews so was pleasantly surprised. Our room was quite spacious with a sofa and arm chair, large flat screen tv and a good sized double sink bathroom with jacuzzi bath. I found the beds comfortable and both the room and Hotel spotlessly clean. There was a terrace outside the room that you could access through glass sliding doors which was lovely. The Hotel has a little cafe/bar at the entrance which we used frequently for a cuppa and a heat after enduring the freezing cold weather we had whilst here. The breakfast was a huge range of foods, cold meats, toast, cereal, fruit, pastries, bacon and eggs, it was a bit cold so id get there early. The location really is the best thing about this place, we got the subway from the airport which was fast and efficient and the subway station was yards away from the hotel. The city tour bus also stops just across the road. There is a nice shopping area close by which had some lovely looking restaurants unfortunately they were closed at night when we went back to find them. All in all i would definitely recommend this hotel and will stay here again.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "seattle", "Title": "“great location in 'old Madrid'”", "Author": "davidgmg", "ReviewID": "UR125164451", "Content": "I'm here for a 4 nite stay using this hotel as a base for sightseeing. The room is large but i know some rooms are smaller. Basic amenities including a very hard 'Mexican\" style single bed. I don't find it terrible but those with American tastes may. My room has a refrigerator and mini bar. has a huge walk in shower plus a full bathtub. Great neighborhood for walking and exloring. Since the bldg is shaped as a rectangle the view is of the back of the bldg. Not a big deal but some view of outside would be preferred. Rooms on the Gran Via side however may be noisy as its a well traveled road. I found the best price by e mailing hotel direct. Easy also to get to. I took the express airport bus from Madrid airport to the Plaza Ciebela stop and walked a few blocks. Easy to do and get a map from Madrid info ctr before hopping on. I think it was the 2nd stop after leaving the airport. The included brkfst really is wonderful and much more extensive than any hotel I've stayed at recently. Overall my impressions are quite good. Free internet in the room was a nice perk and the fact that you can drink the water from the sink. I'd stay here again as I've been able to walk everywhere and took the Metro which stops close by.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "dublin", "Title": "“Good Hotel, not a 4 star!”", "Author": "agusDD", "ReviewID": "UR124272934", "Content": "The location is great, and the hotel is ok. The breakfast was very good, and for being in such a central location there was almost no noise. The hotel is in a very nice old building. I don't know if we were lucky but our room had a huge terrace with great views. This compensated the fact that the room was not great at all and it was actually quiet difficult to arrive to it as you ad to take an elevator, then some stairs, and then a few hallways. For the price we were paying this was excellent value for money.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montescudo, Emilia-Romagna, Italy", "Title": "“The perfect stay in Madrid”", "Author": "Tati_Fabio", "ReviewID": "UR120379396", "Content": "We stayed there three nights and everything was really excellent! Great position in down town, on the main road (Gran Via) and easy to reach by bus or tube, wide and refurbished room with all the comforts you can desire: AC, well stocked minibar, courtesy set including bathrobes and slippers, electrical safe, flat screen TV, pillows menu, free Internet Wi.Fi. connection and afternoon tidying, very rich breakfast buffet with fresh juices, many kind of cakes and pastries, eggs, ham. turkey, sausages, cheese, bacon, bread, toastes, yogurt, cereals, teas and so on. A particular mention for the entire staff that was always nice and helpful. We definitively reccomend this hotel to anyone, for business or tourism, and we hope to come back soon", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "moscow", "Title": "“Catalonia Gran Via, Madrid”", "Author": "mahulka", "ReviewID": "UR119951241", "Content": "pluses: great location, helpful stuff, minuses: stuffy rooms, overused furniture, in whole - the hotel needs renovation general impression: ok, but the next time I'd rather stay somewhere else", "Date": "October 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Washington DC", "Title": "“Location, location, location”", "Author": "AuntAnnie", "ReviewID": "UR119351657", "Content": "Could not ask for a better location. Easy walk to Puerto del Sol, Plaza Mayor, Plaza Santa Ana (for tapas). Also, could walk to the Prado and the Thyssen-Bornremisza Museum. Good bar across street for tapas. Stayed 5 nights beginning Spetember 29th with Road Scholar. Seemed to be mainly a tour group hotel. As many as three groups at a time. Breakfast was good. The biggest negative was that half the rooms did not have air conditioning. From what I could make out there was a problem with the system that affected many rooms. Windows open, but street noise is lound. My ipod helped a lot for getting to sleep, but garbage trucks at 3:30 were my wake up call. In room safe has a daily charge, which was waived for our group, but there was a 20 Euro deposit for the key. Front desk staff spoke English well. Would probably not stay there again.", "Date": "October 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Tel Aviv", "Title": "“Best location.”", "Author": "YMTLV", "ReviewID": "UR116839043", "Content": "Stayed for 6 nights with my family at wonderful Madrid in this hotel. Good: LOCATION! We walked everywhere by foot with 2 kids aged 7 and 10! Rooms are clean. Got 2 rooms with connecting doors, as we asked a few days before arrival. They were at 1st floor facing a patio, so they were very quiet. Breakfast buffet was good (although we twice found sanitary issues). Bad: We woke up sometimes in the morning form waiking up calls to other rooms. Bathroom cosmetics: Only Shampoo and soap bar are provided. Bottom line: I would go there again. Fair price for reasonalble value.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Diego", "Title": "“Wonderful hotel - great location!”", "Author": "JJfromSD", "ReviewID": "UR116589518", "Content": "Spent 4 nights at this hotel as part of a large family vacation. 20 people total. The staff was wonderful. Our rooms were ready for us early which was so nice after a long flight from the US. Our room was spacious and quiet. The breakfast buffet was excellent. Would definitely stay here again.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Belfast", "Title": "“Good Location, Great price”", "Author": "sombochris", "ReviewID": "UR116214399", "Content": "The Hotel is in a great location, within easy walking distance to many of the main attractions. The staff did not appear to speak much english, but it waas a good opportunity for me to practice my Spanish. The bar staff and waitresses were very friendly and polite. The room was a good size with a reasonably stocked mini bar. Bathroom was very clean. Overall I was happy and didn't spend a fortune, I would stay there again", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Long Island, NY", "Title": "“Great location & lovely hotel.”", "Author": "Mamagata", "ReviewID": "UR115465407", "Content": "The location couldn't be better - an easy walk to the Prado, Thyssen, Puerta del Sol, and Plaza Mayor. Truly the heart of Madrid. We had a huge, comfortable room and large bathroom. The breakfast was excellent. The desk clerk was very helpful and printed our boarding passes for our flight home. If we return to Madrid we'll stay here again.", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“very nice affordable hotel centrally located”", "Author": "persilja", "ReviewID": "UR114994677", "Content": "very nice affordable hotel centrally located. Very helpful personal at the reception desk. We asked to see the room before chosing and we were shown a very nice, stylishly decorated modern double room with an extra bed for our 16 year old son. The room was very quiet.Very clean Roomy.Would definitely recommend this hotel. The hotel was undergoing renovations in the nextdoor buildning but our stay was not in the least effected.", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "amsterdam", "Title": "“Comfortable hotel at very handy place”", "Author": "marcelet", "ReviewID": "UR113264499", "Content": "I alsways stay at this hotel when for business in Madrid, at around €90 the value for money is superb. Slightly run own and old fashioned in amenities, but A/C, TV, Wireless Internet and the restaurant are all worthwile.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“You're right in the action\"”", "Author": "UncleDunc", "ReviewID": "UR113138654", "Content": "For shopping, walking, being in touch that everything that makes Madrid such a great town, this is a great place to stay. Shop on the Gran Via, right outside the front door, walk on over to the the Prada (sp?), the Palace, you're right in the action. Our room faced the street, which meant we had a great view of a national strike that happened while we were there. Breakfast was great, and a neat little bar at the front was a super resting spot from our walking travels. Would we go back? Certainly. I gave it a 'very good' because no matter who you are, you can always do better.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Jupiter, Florida", "Title": "“NEVER AGAIN!”", "Author": "jmorales12", "ReviewID": "UR109905500", "Content": "Where to begin! We came with the idea that this hotel was named after a very famous Architecture Gaudi.....the main lobby was VERY DECEIVING! Looked very nice but as you go up to your room.....the nightmare begins! We got to the floor and found that the hall was very narrow and barely labeled as to where our room was....once we got to our front door the card key wouldn't work so we had to get hotel staff for that which took some time until we finally met someone half way,,,, then the Air Conditioning was broken and once again we called for help and by this time we were already an hour in and it was 9 pm and we were extremely tired and still waiting.....We finally had to leave to eat and once we arrived from eating they placed us in a different room. The air was BARELY working and the room was very stuffy and narrow in size. The only good thing about this place was the internet- wifi was free....that was it :(", "Date": "May 26, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“DO NOT STAY HERE- UNLESS YOU WANT SOMETHING STOLEN”", "Author": "jaynedearden", "ReviewID": "UR107769050", "Content": "I stayed here in May 2011. The staff were generally very unfriendly and it took an absolute age to check in. My friend had a suite in which nothing worked and the jacuzzi bath would nt work and staff would not come to fix it. On my departure I realised I had left a very expensive necklace in my room so when I called them from the airport they said it wasn;t here. I know I left it there and explained the exact place. They are still denying this. Clearly the maid has stolen it. I am going to take this further with the police. AVOID at all costs", "Date": "May 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Geneva", "Title": "“Great location and service”", "Author": "anvas", "ReviewID": "UR101339691", "Content": "Very nice hotel. Great location close to Prado Museum, Presidential Palace and Sun Square (all 10-20 minutes walking). Very helpful and friendly staff. We stayed in a suite (got a free upgrade from a junior suite) – so do not know how standard rooms are. Though lobby initially looks a bit modest – overall very nicely decorated premises with interesting details. Very good full breakfast. Located on a busy central street (attraction in itself) but at night very quiet. . The hotel offers some nice options: Extension of check out by 18.00 for 40 Euros (very useful but may be seasonal) and upgrades to a junior suite or a suite for some very reasonable price (again may be seasonal). For transfer from and to the airport take a “Yellow” shuttle bus. Very comfortable, runs every 20 minutes, costs only 2 Euros per person and takes to a central square (don’t recall the name but it’s the third stop from the airport and last but one stop on the route – check info desk in the airport or the driver) – which is just 7 minutes nice walk to the Gaudi Hotel. Check out great and very reasonably priced bars and restaurant located in the area between the Sun Square (Plaza del Sol) and Santa Ana Square (all 10 minutes walk from the Hotel. Enjoy Madrid!", "Date": "March 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Just okay for a night stay”", "Author": "michaellas", "ReviewID": "UR100869130", "Content": "I recently stayed at the Catalonia Gaud with a friend. We only had one night in Madrid and thus planned on spending little time in our room. Therefore when we arrived and our room was stuffy with a mildewy smell we didn't bother complaining to switch rooms. Other than the stuffiness the room was fine, it was clean with nice beds, a nice bedroom etc... We opened the window to let the room air out however our window only opened to an indoor patio, so we got no fresh air. Later that not when we returned to our rooms, just hoping to crash, the room was unbearably hot. We tried the AC for a few minutes but it didn't work, only hot air came out, so we turned it off. It was so late though that we just passed out. We woke up a few hrs later unable to sleep in the very hot room. We called the reception and they told us that the AC does not work in any of the rooms but that they would come up and check on our room and try to help us out, yet nothing happened. In addition to the heat by around 8 am the hotel was so loud with tour groups it was hard to sleep anyways. For 100 euro a night we had higher hopes from this 4 star hotel... That being said, the staff was friendly and the location is excellent, it's just not the best, nor most comfortable place for a good night's rest.", "Date": "March 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Buenos Aires, Argentina", "Title": "“good for the price”", "Author": "prinzessinmaria", "ReviewID": "UR98828910", "Content": "Fabulous location, free fast wifi internet, comfortable bed, large room, very quiet. Last floor has rooms with terrace, nice view to Metropolis building, but access is by stairs...and no baggage carriage service...anyway was a very good location, room and stay,for the price. probably will be back", "Date": "March 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Location and breakfast are really good!”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR91596255", "Content": "The location is really good and one can walk to many of the sites. Breakfast is really good Spanish food.", "Date": "January 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Munich, Germany", "Title": "“central location”", "Author": "ClaudiaB7", "ReviewID": "UR90906430", "Content": "Central location. The personnel is very helpful ready to take care of you (nice customer service). The rooms and bed sheets saw better times.", "Date": "December 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "paris", "Title": "“Very average”", "Author": "allgau58", "ReviewID": "UR69849662", "Content": "The room was quiet but dark; You have to pay extra for everything that should be included in a four star property: inroom safe, internet (expensive). The hotel needs to be refurbished. Hotel staff ok but not welcoming and not really interested in the well being of the guest. Hotel catering a lot for tour groups I think. All in all an experience i will not renew.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Eastbourne, United Kingdom", "Title": "“Four star location but not a four star hotel, tired & shabby”", "Author": "mpaul1967", "ReviewID": "UR68623862", "Content": "This hotel from the outside looked grand & palatial,however the public areas are not of a 4 star standard with tired & worn furnishings in the reception area ,great view looking up the main staircase atrium, we had a room on the floor at the front overlooking Gran Via. The room it self was to say the least very dissapointing the small occasional table was of IKEA quality & was chipped,the armchairs were rickety & worn fabric, no lock on bathroom door. The overall decor was not of a particularly high standard.The corridors on our floor were dark & dingy & had the appearance of an old office interior. Location wise its spot on for central Madrid,at best this hotel is a 3 star hotel in a 4 star location.", "Date": "June 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Reading, Penna", "Title": "“Great location”", "Author": "Occasionaltraveler4", "ReviewID": "UR67372396", "Content": "We read many of the reviews before booking the hotel. This hotel was well priced- important since we had 2 rooms. We wanted a base station to be able to walk anywhere in Old Madrid. Walks to the Real Palace, Plaza Mayor, the 3 museums, Retiro Park, Royal Gardens were easy from this location just north of Puerto de Sol. It would have been nice to have a rooftop lounge area- but we were touring most of the day. Breakfast was fine and part of the room rates. Our rooms were extremely quiet, facing away from the Gran Via. The Gran Via was easy to stroll at night safely. It seems to be a popular strolling avenue.", "Date": "June 13, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dumfries, Virginia", "Title": "“Great Loacatgion. Unpleasant Staff”", "Author": "Lopezwj", "ReviewID": "UR63167321", "Content": "We booked the Catalonia Las Cortes. When we arrived, there was construction in the street and they offered to transfer us to the Catalonia Gaudi for the same rate and they threw in the breakfast. When the hotel hired taxi took us to the Gaudi, we checked in and told them we would be staying tor 4 nights. They told us they only had a room for one night. I told the receptionist that I was not about to move to another hotel. She proceeded to call the Catalonia Las Cortes and gave us a room for the 4 nights. The rooms were large but outdated and dark. No AC and it was warm in Madrid. No help with our luggage. Bathroom was modern and clean. Good breakfast but expensive. Location was great for exploring Madrid. We were able to walk to all the sights of interest and did not have to take the metro. The staff was not very pleasant and seemed bothered when we asked for information or assistance. Maybe it is a Madrid thing, but hotel personnel in Andalusia were much more pleasant than the folks we encountered in Madrid hotel. By the way, we speak fluent Spanish. Bottom line, I would pick another hotel for my next trip to Madrid. Definitely not a 4 star hotel. Two stars at best.", "Date": "May 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "brooklyn", "Title": "“Wonderful location!”", "Author": "tinkk23", "ReviewID": "UR60514647", "Content": "After an 8 night stay at the Gaudi, I was pleased with the location and the overall hotel. Being on Gran Via made life easy and the restaurants in Chueca were amazing. The staff was pleasant and when needed very helpful (just don't ask them for advice on where to eat). The rooms are small but clean and the beds are just ok. Getting around the city was very easy and if you need to take a taxi it is around 5 euro. No one really speaks English but you can get by. We travelled with 6 people, two of which were elderly. When ordering in do not order Paella for 6 it's way too much and pricey. On the first day or so take the cheesy double decker tour, it will allow you to see all of the city and map out what you want to do and it's location. We had a problem with a leak in our room and were moved within 15minutes in the middle of the night. We got a suite with two balconies overlooking the Gran Via....beautiful and surprisingly quiet. Breakfast was good and again no one really smiles. I would stay here for the location and definitely for the access to Chueca.", "Date": "April 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brighton, UK", "Title": "“Excellent value”", "Author": "Gavyn", "ReviewID": "UR58390858", "Content": "I booked the Catalonia Gaudi at the last minute for a one night stay after a business trip. The price attracted me the most and upon arrival I was pleasantly surprised. The hotel is modern , clean, nice sized rooms with inner bedroom door for peace and quite and friendly staff. It's also greatly located on Gran Via which is at the hart of Madrid. Great location for going out in the evening. It's a 2 minute walk to Gran Via metro station and therefore fantastic for getting around the city. The hotel also have a secure room for storing your bags upon check out. This meant I could make the most of my last day around the city. Don't understand why it was such good vale. I would have paid more.", "Date": "March 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Porto", "Title": "“Excelent headquarter to walk around Madrid”", "Author": "RPereira2008", "ReviewID": "UR39159912", "Content": "I was very impressed with Catalonia Gaudi. First I’ve booked the hotel through booking.com and was surprised with the low price for a hotel so well located. In fact its location is extraordinary: next to several subway stations (Gran Via and Bank of Spain), 10 minutes walk away from Chueca and Puerta del Sol. I’ve travelled with my wife, my sister and my brother in law. Our room was very good and big (it had a sofa in front of the TV and a huge bathroom) however my sister’s was smaller (but comfortable too). I believe that I was just lucky because the standard rooms should be like the one of my sister. The staff was very friendly and helpful.", "Date": "August 29, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Los Angeles", "Title": "“Old, small rooms but excellent downtown location.”", "Author": "kalirick", "ReviewID": "UR34856539", "Content": "If it is more important to have a downtown Madrid experience than is it to have a great room than this is your place. The rooms are small and have old furniture, but the location is in the center of the Gran Via of Madrid. Hotel is within walking distance of important downtown monuments and more excellent restaurants than you will ever need.", "Date": "July 15, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Sewell, New Jersey", "Title": "“Great location - but just so-so”", "Author": "muszekfan", "ReviewID": "UR33377653", "Content": "We were on a tour - this hotel's location was fabulous - right in the middle of everything, but we were disappointed with the rooms - they were a bit shabby and the customer service wasn't very impressive. The hotel seemed very understaffed - from the front desk right down to the little bar off the lobby. Not sure how it stacks up price-wise (as mentioned, we were on a tour), but if it's pricey, keep looking. Otherwise, it's Ok for a few days. Decent buffet breakfst - gotta give them credit for that!\"", "Date": "June 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Army moves us all over", "Title": "“modern, great location, english speakers, minor issues”", "Author": "Jmenn", "ReviewID": "UR32639405", "Content": "While we were there for 3 nights someone pulled the fire alarm late at night and they wouldn't offer anything like breakfast free the next morning, we had been informed breakfast was included but it wasn't, and parking was ridiculous to find. The lot they recommend is pricy. However, we loved Madrid and the central location was great.", "Date": "June 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Wirral", "Title": "“Lovely Hotel, Ideally situated”", "Author": "Jolliess", "ReviewID": "UR29462825", "Content": "Lovely, Clean and spacious Hotel with friendly and helpful staff, ideally situated for all main attractions, the metro and tour buses. Enjoyed a delicious meal in the restrurant, not too expensive, excellent value for money, the waiting on staff were lovely. Will return again.", "Date": "May 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“Unbeatable location”", "Author": "swj101", "ReviewID": "UR26988778", "Content": "It's true the interiors are a bit dated, but the staff were extremely helpful and friendly. The location was perfect and decent value for money. Breakfast was five star too and included in the rate.", "Date": "March 28, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Copenhagen", "Title": "“Great location”", "Author": "lookright", "ReviewID": "UR22575397", "Content": "The hotel was OK. The location in the center of Madrid is great. It is easy to get to the shopping streets and great restaurants, and an easy walk to Plaza Mayor and Plaza del Sol. The room was big and nice, but looks old with the brown wood on the walls. It was like living in a closet. Breakfast was fin with hot english breakfast and Spanish tapas. The receptionist was not very serviceminded and they did not have time ti guide or talk to the guest. I was more important to look down and do nothing. Bring af guide book because you will not get any help from the staff. But over all a nice stay!", "Date": "December 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Comfortable, clean hotel, well situated”", "Author": "elninomagico", "ReviewID": "UR22370471", "Content": "I stayed here along with a friend in November 2008 for 3 nights. We found a really good deal on the Hotel's website. In brief, the hotel is very clean, bathroom is spacious; good supply of toiletries, towels etc. The beds in the room were both very comfortable with lots of pillows, wooden panel floors; but this wasn't an issue either. Well stocked and pretty reasonable minibar prices in comparison to other minibar prices in other hotels. The hotel does has heating but there is no air conditioning. We both found that even in the winter, the rooms could get a bit warm and there is no natural ventilation i.e one cannot open the windows. Staff friendly and helpful; both my friend and I speak Spanish but I believe they do speak good English. Location is very good, close to the Metro and on Gran Via. We used the Metro frequently and didn't have any problems. Having said that I've used the Metro in most European cities and not had any issues. Having said that, we were mindful of our positioning on the Metro especially at busy times; by that, I mean, standing in such a manner where it would be difficult for anyone to thief of you. Again, my friend and I probably didn't look like tourists as we didn't carry valuables, cameras etc. As per the previous reviewer, it is disappointing when such crimes are committed on holiday. At night I felt safe walking home as the local area is well policed, especially at the weekend. Wouldn't have an issue staying here again if the price were reasonable. I wouldn't pay more than £75 $130 a night though.", "Date": "December 2, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Roxburghshire, Scotland", "Title": "“19 stay at the Gaudi”", "Author": "PWF", "ReviewID": "UR22170407", "Content": "Football squad of 19 stayed at the Gaudi for 3 nights in November 08. The hotel is an excellent location for the sights of Madrid, situated near one end of the Gran Via. However you should be warned that about 200 yards away, just off the Gran Via, are permanently stationed prostitutes who appear to ply their trade quited openly 24/7. It has to be some sort of tolerance zone as it is always well policed, so it's not particularly threatening but it wasn't in the brochure !! Anyway, back to the hotel. Clean, spacious rooms, good shower etc, sound-proofed (at least those not facing Gran Via were OK), plenty of wardrobe space and proper coat-hangers (i.e. not the ones which assume you're a thief). Lifts were fine too. Breakfast selection was good, served up to 11.00, decent bar (but shuts at midnight), safe facilities in each room and a quality TV with plenty of channels. Staff polite and friendly, speak English. Were especially helpful when one of our number was robbed on the metro (by the way, don't expect any help from the British Embassy, total waste of space). Which brings me to an unfortunate feature of Madrid - the thieving vermin who prey on tourists. Another one of our number had his pocket dipped - you really have to watch your possessions like a hawk. 2 out 19 robbed and a couple of near misses. I've travelled quite extensively around Europe, my wife was robbed in Barcelona and two of our group in Madrid. Don't tell me the police don't know the culprits - they need to get this vermin off the streets. How are you supposed to enjoy a relaxing break when you are in constant fear of being robbed. Finally, went to the Bernabau to see a Real Madrid game. Box Office ticket prices were extortionate, ended up getting tickets off a tout. The shop in the city centre which sells tickets remained closed (despite the notice in the window saying it should be open) and one of the locals commented that they just opened when they felt like it. Manana. Overall, good hotel, stay enjoyable though soured by the thieves. Good cheap food at Zaharas on Gran Via, plenty of selection down the side streets, quality souvenirs on Floor 7 of Cortes Inglese.", "Date": "November 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Portugal", "Title": "“Great location but ...”", "Author": "AlbCab", "ReviewID": "UR21686212", "Content": "I choosed this hotel for its location, in the centre of Madrid. There is a metro stop within a 4 minutes walk, and around the corner there are many restaurants and bars. The decoration of the room was a bit run down and dated, and the room was reasonable seized but dark, as the only window led to a small interior courtyard, but then no noise at all from the busy Gran Via. The only view was a wall about 3 meters away from our window. The modern bathroom was very nice and clean . The bed was very confortable also. Very good breakfast (worth the 15 euro) and friendly staff. Maybe a 3 ½ star not a 4 star hotel.", "Date": "November 10, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Great hotel and location”", "Author": "shenka", "ReviewID": "UR21227604", "Content": "We stayed at this hotel for six nights in October, the front desk was very helpful to us, especially Sandra, the included breakfast buffet was more than adequate, the rooms very clean and surprisingly quiet being on the Gran Via. Overall, a nice stay in Madird.", "Date": "October 26, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "england", "Title": "“Noisy and full of coach parties”", "Author": "ladypfromengland", "ReviewID": "UR20841866", "Content": "on a very busy main road. went for a conference - had bag stolen from dining room at breakfast - conference room was in basement with no windows - bedroom was so noisy that we had to change rooms. there are much better hotels to stay at in madrid and would have checked out if we had not paid in advance. the condom machine opposite the lift was presumably there to provide a need created by some of the 'ladies' in the bar late at night.", "Date": "October 13, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "YorksUK", "Title": "“Great Hotel”", "Author": "AndyPR", "ReviewID": "UR18466090", "Content": "Went for a weekend away without the kids. We had a great time and found the hotel superb. Not sure if our room was a standard room, but it was amazing. Big room, big bathroom, and we had two jaccuzzi's. One on the balcony and one in the bathroom. Very nice. In terms of location, very central, and we walked everywhere with ease. Staff very helpful, all in all, a great hotel.", "Date": "July 31, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Espoo, Finland", "Title": "“Great location”", "Author": "Heut", "ReviewID": "UR15794772", "Content": "We stayed at the Gaudi 30.4.08 - 4.5.08. Not our first nor second choice but the ones we wanted were fully booked. The hotel is in a great location, you can walk every where. No major complaints, just a bunch of little things. Breakfast was good, but irritating that there was NEVER an opened sparkling wine bottle, nor any champagne glasses available - had to be asked for... Hotel a bit run down and drab, but as we really did nothing more than sleep there it was adequate. Pillows uncomfortable. The in-room safe that you have to pay extra for is ridicoulous - they should just charge 5 eur more per night and include it in the price, also update to new digital safes so that you do not have to carry the key around with you. Madrid is a great city and we loved it! Would love to go back some day. Would I stay at the Gaudi again? No, next time we will book earlier and get the hotel we really want.", "Date": "May 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "warrington cheshire", "Title": "“Central location”", "Author": "frankiemojo", "ReviewID": "UR15466994", "Content": "Just come back from a 4 days stay at this Hotel and would definately go back ,It is in great spot for all sight seeing and shopping.The Hotel upgraded our room to one of the suites which was great ,as we even had hot tub bath on an outdoor terrace with great views and jaccuzi bath inside the room.. The decor is typical of a city hotel but nice and very clean. The bed was a superking size bed and very comfortable. We were on the top floor and a bit of traffic noise could be heard from outside but it was not a problem.Massive selection at breakfast including bacon,egg,croissants,cakes,bread,jams,sparkling wine,tea,coffee,juice,cereals,toast,cheese,ham,salami,too much choice. Great selection of toiletries which included,razor,toothbrush,sewing kits,nail files,tissues ,shoe shine plus the usual shampoos etc were provided in the room. Even little sweets each day. The staff were very friendly and room service very efficient ,and not too expensive. If you do visit Madrid you must go to Ginger restaurant,Plaza Angel ,great food and inexpensive but quality food.Taxis from the airport cost 25-30 euros approx.Tour bus worth doing.", "Date": "April 30, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Reading, United Kingdom", "Title": "“Great location”", "Author": "Leicester_Girl", "ReviewID": "UR12386561", "Content": "My boyfriend and I stayed at the Hotel A Gaudi for a week at the end of August / start of September on a last minute break. We loved Madrid and the hotel is so central that it's literally moments from all of the shops, bars, clubs and restaurants. There is also a metro stop within 5 minutes walk. The road could be heard but was not a problem as it's the pay off between the location and the noise and we certainly had no problems with it. We went room only so cannot comment on the food, but the staff were friendly, rooms were clean and we would recommend this hotel to anyone visiting Madrid.", "Date": "January 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Very nice hotel--GREAT breakfast!”", "Author": "Arthur230", "ReviewID": "UR12312421", "Content": "We enjoyed out stay at the Hotel A. Gaudi (aka Catalonia Gaudi) in November. The room was clean, quiet and roomy with comfortable beds. There were two big windows that opened allowing airflow but no view out of the windows as they opened to the inside---not a big deal to us as we weren't there for the view out the windows! The staff at the front desk was friendly but not overly helpful with recommending restaurants, etc. They did take care of calling a cab for us on our last day there. There is one computer with internet access that can be used for a fee (slide credit card). There is a safe in the room which requires a 20 euro deposit and a fee of 3,9 euros/day. The location is very centrally located and there is only a short walk (a block or two) to the nearest Metro station. The breakfast was included in our price and was a perfect way to start our day! Huge variety of fresh fruits and pastries, eggs, sausage, cheeses, meats, cereals, fresh juices, sparkling wine, on and on. Would definitely stay here again when visiting Madrid!", "Date": "January 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Great hotel”", "Author": "JackyLondon_UK", "ReviewID": "UR10190464", "Content": "Five friends stayed here last weekend and were really impressed with the rooms and the location. The rooms was lovely and very clean. The breakfast was good with lots of selection - although the eggs were a bit cold, but there was plenty of choice. The one complaint I would have was the bar staff were quite slow, only ever one on and at peak times this was not good enough. Some of us had rooms at the back of the hotel and it was so, so quite - recommend asking. But the best thing about this hotel is definately the location, we could not have asked for better.", "Date": "October 21, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "los angeles", "Title": "“good location, but not much else!!”", "Author": "lindafLosAngeles", "ReviewID": "UR10078375", "Content": "Stayed here for 4 nights on our recent trip to Spain. The ceiling leaked two times in two days when it rained in different locations and made the room musty smelling. There was no iron available in the entire hotel for pressing. The front desk staff was young and uninformed about everything. The only 2 good things were the location, near to the metro and the Prado museum, and the included breakfast buffet. It is really only a 2 star hotel. Stay at your own risk!!", "Date": "October 14, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Groningen", "Title": "“great place to stay”", "Author": "JoepfromHolland", "ReviewID": "UR8702796", "Content": "Four star hotel and worth it! Friendly and helpfull staff, clean and good rooms. Good location at the Gran Via, the center of town. No traffic noise due to the good isolation. Extensive breakfast.", "Date": "September 12, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bergen County, NJ", "Title": "“Nice Hotel/Great Location”", "Author": "NJTraveler604", "ReviewID": "UR8230018", "Content": "Stayed at hotel for 3 days July 5h-8th. Hotel is in a great location. Walking distance to all major sights and museums. Rooms were very clean, not huge but perfectly fine. The floors had laminate flooring which was actually nice. Carpet can sometimes be gross. The buffet breakfast which was included was excellent. Everything from eggs, pastries, yogurt, fresh fruit and cereal. The staff was very helpful. They recommended a great paella restaurant very close by, all spoke english and were happy to help with directions. This is a very nice hotel in a great location. I am a pretty picky person and I was very pleased.", "Date": "July 24, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cambridgeshire, UK", "Title": "“Very nice hotel”", "Author": "Padfink", "ReviewID": "UR7772026", "Content": "This is a lovely, very convenient hotel. It is very good value. The rooms were spotlessly clean, the beds were comfortable and the breakfast buffet selection was incredibly good. Although there were large groups staying there we didn't hear them at all (the sound proofing is obviously very good as I am a very light sleeper) and the staff were all very helpful. It is very convenient for all the madrid attractions and there are loads of lovely restaurants within a 5 minute radius of the hotel. We enjoyed our stay so much that we went back a couple of weeks later for another night on the way back through madrid and it was just as nice the second time. I'd definately recommend it and I would definately go back. (The only idiotic thing is that they charge 4 euros per night to use the safe in your room and require a 20 euro cash deposit - they won't take a credit card deposit etc which is all very bizarre!!)", "Date": "June 5, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Glasgow", "Title": "“No better than average”", "Author": "BearsdenBrian", "ReviewID": "UR7631456", "Content": "This was our 7th visit to this wonderful city but the hotel was probably our least favourite. Nothing particularly wrong, but the room was dark and fairly plain. 2 single beds. Nice modern bathroom. There wasn't a view except for a wall about 6 feet away from our window (Room 309). Breakfast was an extra 15 euros, which we declined. The location can't be faulted. Handy for all the sights. We find Madrid a very easy city to get around and none of the major sights are more than about 20 minutes walk away. Metro stops are everywhere and this is a great way to get around too. Minor problem here. I was pick-pocketed in the metro but they only got my specs in their case so they dropped them when they found out what they were. A close shave. We,ve stayed at Emperador, Carlos V, Opera and Florida Norte and would say they were all better than the Gaudi. Lastly, we went into the stylish De LasLetras next door for a nightcap..lovely ambiance...but 2 Gins and Tonic......25 euros!!!", "Date": "May 16, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "bedfordshire UK", "Title": "“ideal for sightseeing”", "Author": "kirkbedfordshireUK", "ReviewID": "UR7226279", "Content": "Very helpful staff,central location for all the sights.Room cleaned well every day.Good choice of breakfast but hot food could have been hotter.spacious room very quiet !", "Date": "March 26, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Overall good - but expect 3* not 4*”", "Author": "KXCAUS", "ReviewID": "UR6815238", "Content": "We stayed at the Hotel A. Gaudi for 3 nights and enjoyed the hotel, however i would only consider this a 3* standard. The room was relatively small, although it did have a nice enclosed balcony which added character. We stayed in a room facing the main road, although noise was not an issue. The location is perfect, especially if want to visit the museums. I would recommend this hotel, but only if you can get it at discounted prices, it would not be worth the full price they suggest.", "Date": "February 20, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "USA", "Title": "“Solid hotel”", "Author": "Ron9", "ReviewID": "UR5322732", "Content": "My wife and I stayed there for 3 nights at the end of May. We found the staff friendly and helpful, in stark contrast to many of the people we encountered in Madrid, especially in restaurants. The room was nice, though a little small, and there were two twin beds. The breakfast and location were great. For a 3 1/2 star hotel, we were generally pleased.", "Date": "June 7, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Nice stay in madrid”", "Author": "dancluvr", "ReviewID": "UR5224029", "Content": "We spent 2 nights at the Hotel Gaudi. It was fine. The negatives were few, one being that we requested a non-smoking room and as with many hotels it was clear that people had smoked in the room. Both of us are highly allergic to the smoke so that was frustrating. The second was the \"fitness center\", which as with most hotels was a hotel room with a few pieces of barely working equipment, but here they also decided to have the sauna in the same room. It was really hot and hard to work out at all. The positives are many. THe room was clean and bathroom was very nice. The hotel staff is multilingual, very accomodating and helpful when trying to figure out places to go. The location is prime. It is located right in the middle of the city so we were able to walk west and see palacio real and opera house, etc. and then the next day we went east and saw the prado and the riena sofia, etc. We walked to el retiro and plaza mayor. Also right around the corner from the hotel are many restaurants and bars. We had dinner at a fantastic place called the la gloria de las montanas. excellent food, not very expensive. We spent a late night out in plaza de santa ana also within walking distance. Just 2 blocks away is a metro stop which made getting to and from the airport quite easy. All in all it is a great location with nice people for around $100 a night.", "Date": "May 27, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "london", "Title": "“Ideally located”", "Author": "exploreanew", "ReviewID": "UR5146791", "Content": "We spent a week at the Gaudi which is ideally located for many of the major attractions - major art galleries, the palace and museums, and Atosha station are within easy walking distance for seniors. We found the staff helpful and friendly. The breakfasts were good with a wide assortment of fruit, cheese, cold meats, fried foods, cakes and bread and croissants baked on the premises. As one other person commented, some of the decor might be criticised but everywhere was clean and our room was really just for sleeping. We experienced no problems with the bathroom, which was in marble and had a nice powerful shower. We would return to this hotel were we to go back to Madrid.", "Date": "May 17, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Greece", "Title": "“Loved the Gaudi hotel but...”", "Author": "mariak", "ReviewID": "UR5027295", "Content": "It was a nice experience, clean hotel and central, the rooms are spacious, the breakfast is tasty. The only con I can find is that a couple of our group lost their wallets and passports when going together on having some buffet breakfast. They left their things at the table and didn´t find them on the way back. Of course, the hotel management doesn´t have any responsibility. Those people were careless maybe, but I didn´t feel so safe there after that. On the whole it is a hotel that I would reccomend to everybody and I would stay there again in the future.", "Date": "May 2, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Great Location”", "Author": "hayeda", "ReviewID": "UR4475209", "Content": "We stayed here for 2 nights during January and overall we were very pleased with it. The location of the hotel is great, just on the main street of Madrid, within a walking distance to all major attractions. The hotel itself is small and not very new, but definitely adequate. The breakfast buffet was quite satisfactory, although the supply of tea and coffee was problematic during rush hours. Initially we were given a room which overlooks a wall and that was too claustrophobic for my husband so he asked for a better one. The recepcionist was understanding and gave us a much better room at an upper floor directly overseeing the busy main street. Sitting in front of the window and watching people go by at night was very nice. The size of the room and the bathroom was more than adequate. Overall, I can recommend this place.", "Date": "February 21, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“Nice but not quite a 4 star”", "Author": "RandT", "ReviewID": "UR4255629", "Content": "This is a classic hotel, a good central location on the Gran Via in Madrid. My room had two single beds which were fairly comfortable and the bathroom is nice, with marble. Good shower with lots of hot water and good water pressure. The room was not as clean as I would have liked and I thought it could have been a little nicer to rank 4 stars. I've stayed in better 3 stars. But, if you get a promo price on this hotel like I did 77 Euro a night it is a good value and the location is excellent. The staff is helpful and courteous. The wireless internet is expensive, 9 Euro for 2 hours.", "Date": "December 22, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Unknown", "Title": "“Expecting the worst, turned out alright”", "Author": "A TripAdvisor Member", "ReviewID": "UR3941732", "Content": "Went there for my \"stag weekend\" (bachelor party) in Madrid. Expecting a poor hotel but actually it was ok. Service was good. Location is great though bear in mind it is on the edge of Madrid's gay district. Rooms - pretty basic, but clean, modernish and tidy. Sizes and views from each room varied. Aim for a room on the 7th floor. They are somewhat larger with a sofa and coffee table with great views over the rooftops. Others in my group had rooms with small windows facing inwards into a shaft in the middle of the hotel building. Not so good but they did have a large shower. The TV in my room did not work - not a big deal - but would have been nice to have been able to watch the BBC news whilst resting after a big night out. One downside is that the hotel charge almost 4 euros a night for a key for the safe in the room. A bit cheeky to charge in a supposedly 4 star hotel. The corridors can be confusing to navigate (its a bit maze-like but you soon get used to it) and the lifts (elevators) can be tempremental - on more than 1 occasion I got fed up of being in the lift and having to get out as it would keep re-opening the doors and refuse to move. The bar is excellent value - 1 euro 80 for a coffee and a couple of euros for a beer. If you're on a budget, want to be close to the night time action and like good service you can't really ask for much more than this.", "Date": "September 27, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Basque Country, Spain", "Title": "“Good hotel, great staff, excellent location”", "Author": "HansPfaall", "ReviewID": "UR3744940", "Content": "I've just returned from a weekend in Madrid (Aug 2005) and I'm absolutely satisfied with the Catalonia Hotel Gaudí. Hotel Gaudí it's a quality hotel (4 stars, it belongs to the Catalonia Chain), absolutely centrally located (on the Gran Via, just meters or in walking distance to Fuencarral, Alcalá, Sol...) but really quiet (even being in that 24h busy street) and with very good value for your money. The rooms are not very large (the bathroom it is), but are very comfortable. The hotel has a gym, a jacuzzi and other facilities. Oh! and the air conditioning is absolutley silent and quick, which is essencial in a city like Madrid in august! The only thing we missed is a own parking but there are five public ones on the surroundings. If you come by car and it's the first time you visit madrid maybe you prefer other location but if you know the city or you reach by bus, train or plane... the location is great! Also, the staff is very kind and usefull if you have a trouble: on the reception desk the staff is young and multilingual, the rooms are quickly cleaned (even if you leave the room at 12:30 and you return at 14:30... like us) and if you have any kind of problem they make everything they can asap. Just to finish: a great choice for your time in Madrid no matter if you visit Madrid as a tourist or by other reasons.", "Date": "August 8, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Unknown", "Title": "“Nothing Great, Nothing Terrible”", "Author": "A TripAdvisor Member", "ReviewID": "UR3536148", "Content": "I spent a full week at this hotel and did little more than sleep and shower in it. The pros here are its location and friendly and helpful staff. All the major plazas and restaurants are walkable from here. If this is of key importance, then the following cons might be overlooked. The maids did not replace the bed with fresh sheets, they simply re-made the bed. We did receive fresh bathtowels. The bathroom had a lingering odor of cologne and sewage intertwined which was already present when we first walked into the room and remained until we checked out. (Keeping the bathroom door closed helped the situation a little) Although the air conditioning unit was whisper quiet, we could hear toilets flushing and showers running from the rooms above us through the pipes in the bathroom. This noise was very frequent. I spent no more than 10 minutes in the whirlpool area. The room was not inviting or relaxing in any way; it felt like a cellar. Half the jets in the pool did not work and the area in general was unkept. There was a sauna and some workout equipment there, but I cannot comment because I did not use them. Overall, my stay in Madrid was not effected negatively in any way by hotel Gaudi, but if you are going to spend a lot of time in the hotel room, look elsewhere. It is overpriced for what they have to offer.", "Date": "June 7, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Ok hotel”", "Author": "Jolien", "ReviewID": "UR3524067", "Content": "Stayed at the hotel for 6 days. The room was average size with a nice size bathroom but the bathroom had a prevalent musty odor. It looked clean but you get a faint odor from the bathroom just from being in the room. The breakfast was not bad. I wouldn't consider trying out the jacuzzi because even though it was functioning while we were there, the room it was in was not at all relaxing (it was darkly lit with one flourescent light), and the area around it didn't look like it had been cleaned very well (saw bootprint marks around the jacuzzi). At least the hotel was in a good location and a lot of Madrid sights were within walking distance. The fridge and the AC turned on were very quiet and the room we stayed in didn't get very much street noise either so that was good. Overall, I would not go back to this hotel if I were to go back to Madrid.", "Date": "June 3, 2005"}], "HotelInfo": {"Name": "Catalonia Gran Via", "HotelURL": "/ShowUserReviews-g187514-d190157-Reviews-Catalonia_Gran_Via-Madrid.html", "Price": "$109 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Gran Via 7-9</span> | <span class=\"extended-address\">Old Quarter</span>, <span class=\"locality\"><span property=\"v:postal-code\">28013</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> (Formerly Catalonia Gaudi)</span></span></address>", "HotelID": "190157", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/1a/ab/1a/piscina-exterior-con.jpg"}}