{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scarsdale", "Title": "“Beautiful hotel”", "Author": "Michael B", "ReviewID": "UR128298127", "Content": "This is Madrid's equivalent of a lovely Four Seasons, Ritz Carlton or even Mandarin Oriental. Our rooms were beautiful (especially the upgrade), large (unusual for Europe) and even ready early. The hotel is very well located and impeccably kept. Minor nits: The concierges can be slightly warmer, and the gym is only OK. Overall, though, very highly recommended.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Wonderful Property, Staff Rude”", "Author": "Pieper5", "ReviewID": "UR128174547", "Content": "We had wonderful rooms, 3 of us traveling in Spain. But the stuck-up staff was a thorne-in-the backside. Upon arrival at 4pm, one of my traveling partners asked what resturants were in the area, we all needed to eat. The responce 'nothing at this time of day' and pointed us to the lounge/bar for $50.00 hamburgers. Well the next morning, while exploring, behind the hotel, a huge department store with restraunts and market. Plus 1/2 block away entire street filled with restraunts all open! And that was only the start of dealing with the staff!", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“Excellent base for a couple of days in madrid”", "Author": "66JJ", "ReviewID": "UR127597110", "Content": "We loved everything about this hotel from the rooms to the proximity of shopping and restaurants and tourist sites. The best thing about this hotel is the staff. They cannot do enough for you from the door men, front staff and concierge. The restaurant staff even took the time to explain all the wine regions very patiently in English. Will stay here again and recommend to friends.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "US", "Title": "“Like no other in Madrid”", "Author": "jdr1000", "ReviewID": "UR127484739", "Content": "My usual place in Madrid, service, room and location are still the best in Madrid. Great Breakfast, best Onion soup for dinner. Also noticed the prices for laundry at the hotel and those were offensive. This time I tried the Tse Yang restaurant and do not recommend it. Will stay here again for sure.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Great rooms”", "Author": "KevinHogarth", "ReviewID": "UR127247231", "Content": "The best aspect of this hotel is the rooms. They are really very well designed and comfortable. I have stayed here a few times on business and would stay here if I were spending my own money. There's a good breakfast too.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Perfect”", "Author": "A P", "ReviewID": "UR126205195", "Content": "My fiance and I stayed here for 5 nights during the Christmas holidays. We were impressed in every way! We stayed in a junior suite, which was well appointed, spacious and really made us feel at home. The bathroom was big and beautiful and it had plenty of everything we needed. Now onto the service.... It was incredible! We felt very welcomed from the moment we arrived. All of the staff was professional, courteous and friendly. We were especially impressed with Willy and Silvia in the Magnum bar area. Besides making great drinks, both of them were so friendly and helpful and we would try to make it a point every evening to go grab a cocktail, just so that we could sit and chat with them. We also had the pleasure of meeting the Assistant Director, Xavier, who was an absolute pleasure. He graciously sent some chocolate covered strawberries and champagne up to our room to welcome us to the hotel. The hotel's staff was very attentive and they even remembered my birthday (on Christmas Day), and surprised me with a cake and a birthday note in our room. The location of the hotel is excellent if you are looking for high end shopping, as all the nice boutiques are nearby. It is also convenient because Corte Ingles sits right behind the hotel, and they have a grocery store inside. We ordered room service on Christmas Day from Tse Yang restaurant, which is in the hotel. The food was excellent and we were definitely impressed. Highly recommended!", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great stay”", "Author": "beth j", "ReviewID": "UR125734152", "Content": "This hotel has very nice design and fresh feel to it, while still keeping some gandeur so perfect for Madrid. The service good and warm. The food was very good but found it overpriced compared to other nice places in the city. Our room was a bit small and teh view restriced and some of the furniture a little scratched here and there. Otherwise an excellent experience.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Just Perfect”", "Author": "andrejnb", "ReviewID": "UR125331183", "Content": "Perfect from Check In to Check Out ! Very well located, superb staff, clean, comfortable and quiet. Nothing else to say.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“We like the Villa Magna”", "Author": "Traveller10071", "ReviewID": "UR124969979", "Content": "Refurbished (in the shades of beige now apparently obligatory for hotel decorators) since our last visit, the Villa Magna is splendidly located for most things one would want to do in Madrid: Calle Serrano (think Bond Street) at the back door, the Retiro, Prado, Thyssen an enjoyable stroll away. Lots of very pleasant and helpful staff. Wonderfully comfortable bed and pillows. Only grumbles were lack of equipment to make tea or coffee and, oddly, only one easy chair in our deluxe double room, which really wasn’t huge. Our third visit and we’d certainly go back.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Not a hotel that would exceed one's expectations”", "Author": "jacqueline118", "ReviewID": "UR124331803", "Content": "Interestingly enough I just received an email after our three night stay at this hotel asking us to fill in a survey as to whether this hotel exceeded our expectations. Sadly to say this hotel did not. Despite the accolades and being a leading hotel of the world we could say, at best, that what we received was good but not great - and would probably make us consider staying elsewhere next time we are in Madrid. Why, you may ask? Well firstly before we even arrived - was our disappointment with the airport transfer from the airport to the hotel. On line the hotel advertises a Mercedes S class stretch limousine transfer with a private chaffeur - when we wrote to enquire about an airport transfer they only offered us some Mercedes shuttle bus transfer service. We queried the type of vehicle offered by email and received no response. The transfer was there when we arrived but as mentioned it was a shuttle bus Mercedes and not a comfortable S class stretch limousine as what was advertised as the transfer vehicle on the website. If the hotel had only advised that maybe there was not one available - then we would have been more appeased - but they didn't so this made us somewhat dissatisfied. On arrival at the hotel - reception was pleasant enough yet appeared to have had more than one reservation for us - something we were not aware of as we had only made one reservation online for the hotel, quoting 380 Euros for the first night and 400 for the subsequent nights - reception changed this on check in to 400 for the first two nights and 380 for the last night - probably in case we wanted to check out and not stay - they would then still have get the higher rate. Talk about austerity measures in Spain - or should we just call it day light robbery. On arrival in the room - it was fairly much what we expected - but no more - actually in fact less. There was no complimentary water in the bathroom nor to drink - there was no tea or coffee making service available nor a butler service providing this at no charge. However you could via room service order tea or coffee at an exorbitant 9 or 10 euros each. Whoa!! Don't call me frugal but I do call this pricing somewhat over the top. When we contacted reception to query whether there was any complimentary tea or coffee available we were told sorry no - but later when we went downstairs we did receive a complimentary welcome cocktail voucher for the bar - this was well received and we made our way to the bar when it opened (a place we would not normally venture to) and proceeded to enjoy ourselves for the next few hours trying out delightful Spanish red wine, some appetisers, and a complimentary cocktail from the hotel. We then proceeded to the Chinese restaurant where we had a set menu which was well prepared but as we were so full from the time we had spent in the bar we could not fully appreciate it. The decor and service were pleasant and must be an OK place to go as it was popular there during the lunch hour of the day we arrived. Back to the room we stayed in - the hotel did deliver a fruit bowl with two crunchy green apples and a red apple - which we enjoyed. Aside from this and ourselves the room had no life, no greenery, no flowers. Somewhat austere in line with the economic measures the government is taking in Spain at the moment. The bath and shower were OK. Housekeeping provided more bath essence when we requested it, but the complimentary shoe shine highly promoted in the guest compendium was done to a level which made me not want to get my second pair of shoes done. As for the black stockings and inhaler drugs left in our room by accident (?) by housekeeping it made you question the kind of job they had done. Supposedly we were meant to receive two turn down services a day - but on our last day there they must have thought they would save themselves some time and money by not appearing, nor providing this service. Over our three days there we enjoyed breakfast in the Villa Magna Restaurant. The cooked food was divine and beautifully presented but the buffet food on offer although pleasant to the eye and to taste - was somewhat austere. The dining room on the second day was so warm that the cheeses displayed were covered in beads of sweat and not at all appetising to look at. In addition some of the restaurant staff were so busy gossiping with each other they had no time to check whether the customers plates needed clearing. The daily gossip session appeared to be a morning ritual. Our dining table on a daily basis started to appear like a recycling centre with all these empty dishes waiting to be cleared but seemingly invisible to the staff who were there to clear it away. They brought plates of food to the table but appeared to have some aversion to dealing with dirty dishes and taking them away. In addition they were so inattentive to detail that they did not even notice whether the salt and pepper shakers were filled with salt and pepper and or just plain salt. Two days in a row both our salt and pepper shakers were filled with just plain salt. Not something I would have expected from a restaurant in a leading hotel of the world. We had tea in the lounge twice at a high price of 9 Euros per teapot which contained no more than two averages sized cups of tea. The tea options were plentiful and the tea tasted fine. The lounge chairs were extremely comfortable and it was a nice place to relax and unwind. The cookies provided were tasty and a pleasant accompaniment to the tea. We would recommend the Mandalay tea and Japanese green tea. Safety and security wise this hotel had no security key to the different room levels, any stranger could go up or down and to any guest floor they desired. There were security cameras on the floors but still a security key lock to the guest rooms would be something you would expect from a hotel that markets themselves at this level. Enough said, out of five I would only rank this hotel that charged more than other hotels in town, a 3 1/2 to 4 out of a 5. I feel that some of the staff are resting on their laurels and it is just a matter of time before they lose out to their competitors in the market place if they keep up this level of inadequate service.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "spain", "Title": "“Top hotel with top location”", "Author": "likemallorca", "ReviewID": "UR123874667", "Content": "The hotel is a real 5 star grand luxe hotel. Close to many attractions of Madrid. The service so as the facilities are first class. It is quiet everywhere although the hotel has a high occupation. Rooms are carefully decorated and with care to every single detail. Breakfast has a buffet but a lot of cooked dishes are ordered from the kitchen on your demand. Book this hotel and you will not be disappointed.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Henley-on-Thames, United Kingdom", "Title": "“The Perfect Room”", "Author": "Sateasy", "ReviewID": "UR123665730", "Content": "We stayed here for one night this January. This hotel is everything one should expect from a five star hotel in a city: elegant, spacious, quiet, modern, discreet, and professional. But the room was designed by mind-readers! I would describe it as modern masculine luxury, with everything where you expected it: dressing room conjoined with bathroom, plentiful drawers and cupboards loaded with toiletries and extra essentials, light switches in logical places and super-soft sheets. Our only gripe: why are there hotels still charging for wi-fi?", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“A fine five star”", "Author": "IntrepidTraveller16", "ReviewID": "UR121878410", "Content": "I stayed in a deluxe room for 2 nights in December. The word I would use to describe this hotel is \"generous\" The rooms were generously proportioned, the bathroom huge and luxurious. There was a generous supply of various items - toiletries, robes, slippers, fruit, bottled water. The in-room facilities were many. The minibar was stocked full of everything one could want. The service, from reception and concierge to the restaurant and bar, was excellent and exceedingly helpful. The cleaning of the room and turndown services were very professional. The bed was decked generously with the finest and smoothest bed linens - I fell asleep instantly! It may not have the most modern and edgy design, but then, it is not that kind of hotel. This is a classic, elegant hotel with the very highest of modern five star facilities, service and dining. It also happens to be located in an excellent part of town for shopping.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lucknow, India", "Title": "“Amazing hotel”", "Author": "sakshi82", "ReviewID": "UR120844516", "Content": "My stay at the Villa Magna was excellent in all aspects. We have been upgraded to a suite which was new renovated, very clean and elegant creating a wonderful atmosphere. The staff overall was professional and helpful at any time. We booked this hotel Through MY KIND OF VACATIONS (www.mykindofvacations.com) so all thanx to them.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Luxury and location”", "Author": "paulus70", "ReviewID": "UR120452130", "Content": "Very atentive staff. Good rooms. a little too classic decoration almost heavy. The location for shopping is wonderful.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Nice neo-art deco property”", "Author": "S6blr", "ReviewID": "UR120147775", "Content": "Good location, the staff amazing, we were upgraded to a 2-room corner suite on arrival. Only thing I could flaw in the property was the LCD TV's are hidden behind a mirror, and you have to damn near stand 2 feet in front of them to change a channel or the volume. Nice big bathrooms, showers, really a stylish place.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Very Calming”", "Author": "rmendell7244", "ReviewID": "UR119793423", "Content": "This hotel was beautiful. The rooms are great with wonderful views of the busy Madrid streets. I think it was a great location. You can walk to the beautiful parks. It's around all the shopping.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“A haven of calm in Madrid”", "Author": "jobymaloby", "ReviewID": "UR119765520", "Content": "This is simply a stunning hotel - probably the best in Madrid. They completely understand the essence of service. It is the little touches when they anticipate and fulfil your needs before you need to ask that sets them apart from others. Thanks for a great stay. I will definitely return!", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Excellent Madrid Hotel”", "Author": "brennamt", "ReviewID": "UR119040551", "Content": "To begin, I always preface that I stay at higher end hotels (Ritz Carlton, Four Seasons, Mandarin Oriental) and expect to pay top prices to receive service etc. The Villa Magna is a wonderful hotel is a great location in Madrid. It is slightly outside the center of the city in the higher end shopping area of the city. The service is impeccable at the hotel. Upon arrival, we had to wait about 30-60 minutes for our rooms. We sat in the lounge and were eagerly helped with coffee and fruit for breakfast. Rather than simply send us off the restaurant or outside, the hotel accommodated us in the lounge - well done! Breakfast was great. Yes, it can be pricey, but you get what you pay for. Excellent coffee, great fruits and wonderful service. Each meal, I was brought a large bowl of oatmeal with fruit as they remembered what I has ordered. You can drink and smoke a cigar in patio outside the bar or in the front veranda. Dinner and tapas items are also excellent - order tinto verano rather than sangria. The rooms are well appointed and have been redone. Very spacious and bright. Bathrooms are large and marble with typical European showed/bath deal. Gym is very small. There is a Reebock club about a block away if you need a bigger gym - it is very nice. Overall, I was extremely pleased with the hotel in every way. When you go to Madrid, stay here.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Excellent Hotel in Posh Madrid Location”", "Author": "NYC_27", "ReviewID": "UR119006564", "Content": "I recently returned from Madrid from a 5 day stay at the Hotel Villa Magna. I am truly puzzled by Melanie's review below because the beds (which have luxurious pillow topped mattresses, down comforters and what are likely 500 thread count sheets) were BY FAR the most comfortable beds I have ever slept in at a European hotel! The air conditioning was outstanding--which isnt often the case in Europe- (and this was a pleasure since it was 95 degrees daily during my stay). The hotel is extremely luxurious and the service is superb. The location (whcih connects to Serrano street through the Corte Ingles department store (Spain's equivalent of Saks 5th Ave) could not be better located if you are looking to stay in the upscale \"Barrio de Salamanca\", which is the Madrid equivalent of Madison Avenue/Upper East Side in NYC. All in all-- it was a fabulous, comfortable hotel that made a great home away from home for 5 days. My only complaint (and the only reason I am giving 4 instead of 5 stars) was the breakfast which I thought was seriously lacking given the luxurious nature of the hotel. The breakfast buffet options were fairly meagre and although the options they did have (croissants, a selection of cheese, fresh fruit and fresh juices) were all of excellent quality, I think it would have been much more in line with the quality of the hotel to have had a more ample and generous breakfast buffet", "Date": "October 6, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“Great Experience at Villa Magna”", "Author": "jimmysi", "ReviewID": "UR118326636", "Content": "I'm overdue in writing this as our trip to Madrid was back in June, but I wanted to say how nice I thought the Villa Magna was. It's in a great neighborhood (Serrano I think) and is close to the best shopping in Madrid if that's your thing. More important it's a healthy walking distance to all fo the museums so it's well situated for sightseeing. We actually stayed twice on the front and back ends of our trip...the first stay started off with being accomodated with our room in the morning after our international flight...a pleasant surprise which also came with an upgrade to a junior suite. The rooms are contemporary and nicely decorated with huge dressing areas and bathrooms. The building is also set back from the road so it's quiet. The bar and restaurant are expensive for what they are...our rate included breakfast but we had dinner there one night which was OK but pricey. I would suggest drinks and tapas on the front patio or in the courtyard. Great service all around...we'd definitely stay there again.", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "london", "Title": "“Shame about the concierge”", "Author": "sunnyislesbeach", "ReviewID": "UR117632812", "Content": "Great location and the most comfortable beds, top quality bed linen and great bath towels. Room cleanliness excellent. Concierge are very suspect. They gave very poor advice on restaurants. Also at breakfast one could not wear shorts, ridiculous. We stay in Four Seasons Hotels and have never heard such rubbish.", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Lancashire", "Title": "“Good base to explore Madrid”", "Author": "Edina", "ReviewID": "UR116245498", "Content": "Friendly hotel in a good location. Bed and pillows very comfortable. All staff very friendly and helpful. The air conditioning was rather erratic, too hot and then too cold. We did not like the shower over the bath with no thermostat control, resulting in water temperature ranging from freezing to scalding, depending on demand elsewhere in the hotel. In a hotel of this standard would expect a stand alone shower. The hotel seemed very quiet the four nights we stayed.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Miami Beach, Florida", "Title": "“Stunning”", "Author": "yiliam", "ReviewID": "UR116002895", "Content": "This hotel is like staying at a Four Seasons or a Ritz. We were traveling for over a month all over eastern Europe and Vila Magna was our very last hotel before we flew back home. What a great choice that was. I loved everything and everyone at this hotel. the location is perfect and gorgeous. I must say the only thing that I would tell them to change soon are all and I mean all the area rugs thru out the hotel including inside the rooms but besides that I was in heaven during my visit in Madrid thanks to Villa Magna. PS. Make sure you walk to the St James Restaurant for the best Paella ever and make a visit to the Lladro store across fro the Corte Ingles that is right outside the back door of Villa Magna Hotel.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Los Angeles", "Title": "“all five star hotels should send their staff to train here”", "Author": "frmrbrit", "ReviewID": "UR115958720", "Content": "From the outside rather an ordinary building but beautiful rooms and public areas. Reception staff efficient and pleasant, lightening fast room service, and the most luxurious sheets I've ever slept on. Hotel is on a main room but sound proofing is excellent. Highly recommend", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Geneva", "Title": "“Good shopping location, friendly service”", "Author": "bruhlmeier", "ReviewID": "UR114680508", "Content": "In gerenal excellent service, from check-in to breakfast (not lots of choice but excellent quality) buffet, from bell captain to room keeper.... all very friendly and helpful. Bed sheet and blanket are so soft, seems smooth as silk...sleep so well during our 4 nights stay. The room keeper changed the bed sheet seems twice a day, kind of waste? They work so well, I shouldn't complaint? Tse Yang the Chinese restaurant is good for western standard, not enough for real Chinese taste, but at least has good wine card and excellent service.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“The hotel of choice.”", "Author": "hamad7", "ReviewID": "UR114633064", "Content": "Thanks for the positive reviews on this hotel as it was nothing less than how other trip advisors members described this hotel. I agree with all of the positive points mentioned however the only comment I have is about the language. Room service staff should understand other languages other than spanish, at least English. Although the room service food was a world class, we never got the order the way we wanted it, and that is because the person on the other side of the phone didn't understand what I am asking for. Otherwise everything was perfect. I liked the prestige room more than the junior suit.", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Bronxville, New York", "Title": "“Swanky”", "Author": "J_and_A_1", "ReviewID": "UR112919452", "Content": "This hotel is designed to impress. As many have mentioned, the exterior is nothing to look at, but the hotel is set back from a tree lined road and has a large fountain in the middle of the motor court. Off to one side is a private garden for hotel guests. Inside it is all about the new high end contemporary design. Cool modern furniture and bold art work grace the main floor. It all looks very nice and expensive. The only area that we thought was a little to over the top was the bar. There are also nice outdoor areas for cocktails or dining. We stayed in a prestige room. The room was very spacious and continued the high end contemporary design of the rest of the hotel. The white paneled walls were full of moldings and there was a tray ceiling. There were four chairs in the room, plus a chair at the desk. It would have been nice if there was a couch somewhere in the room instead of so many chairs. Also none of the chairs were set up to view the TV. The TV in the mirror was cool looking, but a regular flat screen would have provided a better picture. So the room was very attractive to look at, but not as functional as it should have been. A great feature of this room was a full closet area that you passed through on the way into the bathroom. There was lots of shelf space and enough room to put two bags aside. The large bathroom was all white Carrera marble with two sinks, large tub, and separate rain shower and water closet. The room had great lighting in various forms, but the controls were very difficult to figure out. It was very strange the way it all worked and was a little annoying until you figured it out. We stayed in an odd number room with a view of average looking buildings. The even rooms face the tree lined street which must be a better view, but we are not sure about street noise if any. As mentioned, the hotel is set back a little from the road. There is a nice but small gym and stylish locker rooms with steam, sauna, and showers. We did not have a chance to eat in the hotel. We stayed here one night on the back end of our trip to Spain. At the beginning of the trip we stayed just down the street at the Grand Melia Fenix. We liked that hotel better because it had a great club level with a roof top terrace which we really enjoyed along with a room with a private outdoor hot tub. The Villa Magna is also a little farther away from the main tourist locations, but it is right next to the best shopping streets in the city and the nicest neighborhood. If you want nice modern rooms, a pretty good location, and a feeling that you are at the best hotel in town, then stay here.", "Date": "June 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Woodstock, Vermont", "Title": "“Wow! This hotel is amazing.”", "Author": "loriel", "ReviewID": "UR110327511", "Content": "I love this hotel. I love it so much that I'm writing this review while I'm still here--sitting in my most comfortable bed using the free high-speed internet, recovering from jet lag and a late night out. Villa Magna is just what I had hoped it would be and then some. I did a lot of research before choosing Hotel Villa Magna. I didn't want to stay in the old city because it is so crowded, noisy and touristy. I didn't want to stay at the Ritz because my work would balk at it and all the other high end hotels had something I didn't like about them. The staff is attentive, helpful and kind. It was my birthday while I was here and a bottle of champagne and birthday cake were delivered to my room. Watching soccer in the upscale bar was great fun last night. I can walk to everything and while the hotel isn't gorgeous on the outside, the inside is tasteful, grand, comfortable and really lovely. My room is huge. The amenities are top notch. The gym is certainly well equipped enough and the spa offers lots of high end services. This is a great place for business--easy to meet people here and a great place for pleasure. I love this hotel and, if you can afford it, I cannot say enough good things about this place.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Best Hotel in Madrid”", "Author": "PedroMaciel", "ReviewID": "UR110067867", "Content": "I spent 5 nights there and it was outstanding. The rooms, the service, location, and the meals. It was all perfect. The concierge advice was precious and precise. I will return many times. Thank you.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Great hotel, great staff”", "Author": "KittyCatSingapore", "ReviewID": "UR108879847", "Content": "I enjoyed the hotel tremendously. Staff was professional and friendly with a great attitude and smiles. I greatly enjoyed my stay and would recommend to this hotel. Location was a plus for easy shopping.", "Date": "May 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "sao paulo, brazil", "Title": "“Excellent hotel in beautiful Madrid.”", "Author": "claudiaspiandorim", "ReviewID": "UR108244195", "Content": "Very nice hotel in Madrid. Gorgeous and big rooms, tasty breakfast, good bar and very well located in the neighborhood of Salamanca . Yes, it is a bit expensive but t is definitely worth it. Great restaurants and shopping in the area.", "Date": "May 14, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“best hotel I ever stayed in”", "Author": "lando9", "ReviewID": "UR101021719", "Content": "Aside from the fact that there was no television in the room (but you are in Spain so why would you want to watch TV) and you had to renew the internet connection every day, I would say this is by far the best hotel we stayed in. Period. The rooms were gorgeous, the sheets were extraordinarily comfortable (to the point where I did not want to get out of bed), and the service was amazing. I would not recommend frequenting the restaurant of the hotel because it is pricey. However, everything else was worth the price. On our first night, they offered us a free bottle of champagne, chocolate covered strawberries, and apples. It's conveniently located to high end shopping as well as about 200 meters to the closest metro station (Ruben Dario). Overall, I loved my stay here and would definitely come back.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "tetbury", "Title": "“5 Star Service with a smile”", "Author": "rufusTetbury", "ReviewID": "UR99253748", "Content": "True five star service here. Friendly, relaxed, smart and stylish, and that goes for all the staff too. We thoroughly enjoyed our stay here and did not want to leave. The only thing we missed was to be able to make a drink in the room. Excellent shopping district and far enough away from the crowds for some peace and quiet.", "Date": "March 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Like the stay”", "Author": "mstefens", "ReviewID": "UR98429863", "Content": "Nice stylish rooms, front desk very helpful, central location a block from 2 different metro stops and several major squares, quiet, spacious room, decent price for this quality. Would happily come here again.", "Date": "February 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "scotland", "Title": "“Great hotel in a great location”", "Author": "fcmoll", "ReviewID": "UR96648949", "Content": "We really enjoyed our stay here. We were in a suite that was clean, spacious and comfortable. The service let this hotel down slightly. My husband did not get the paper he had asked for on two of the three mornings and the last morning he got no paper at all. The turn down service was very disappointing. The room was always prepared for one guest despite it being booked by and for a couple.", "Date": "February 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Costa Blanca", "Title": "“One of the best luxury city hotels in the world - and the best in Madrid”", "Author": "thewanderers_spain", "ReviewID": "UR92157699", "Content": "We live in Spain and have travelled extensively around Spain and more so around the world. We are often in Madrid either for shopping or on our way through to somewhere else. Madrid is one of the most elegant yet dynamic cities in the world. The food is world class, along with the shopping, sightseeing and nightlife. I have stayed in various hotels in Madrid over the years and up until recently I thought the Ritz was probably the best choice. But I hadn't been back to the Villa Magna in 18 years. All I can say if that I was stunned. Sure, the outside look of the building is a bit 1960's concrete but even that is coming in to vogue. The refit and remodel inside is truly gorgeous. I love the 1920's meets the 1950's retro elegance. Elegant is the only way to describe this place (and Madrid itself). The rooms are possibly the best rooms at any city luxury hotel I have been to. It makes such a nice change from the Four Seasons/ Ritz Carlton identikit rooms you find all over the world and it also is a nice change from the Ian Schrager/Philip Starke identikit \"contemporary\" rubbish with small rooms that now litter the world. This is truly a world class city hotel. Unique and stylish. Perfectly located but peaceful. The staff are great too. Highly trained, efficient and seem very motivated to please their guests. Any request is dealt with immediately. We used to concierge to suggest the best seafood restaurant in town and boy, was it (O'Pazo). Overall, this hotel is value for money because it is so good. Book one of the larger rooms as they are really lovely. Do some shopping outside the hotel (the best shopping in Madrid). Take in a museum. Have a siesta. Go for a cocktail in the bar (a martini suits the retro elegance) and then have an amazing meal at O'Pazo. That is one perfect day. If you are there for two days then skip the shopping on day two, take in the Retiro park, walk the streets of the centre of town, go back to your delightful room for a siesta and a change of clothes and then head out into the night for tapas and copas! Enjoy. You are lucky to be in Madrid and lucky to be staying in the Villa Magna....", "Date": "January 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Miami, Florida", "Title": "“Superb”", "Author": "hdss379", "ReviewID": "UR91969986", "Content": "We were extremely pleased with our stay. The staff is excellent. The restaurant and bar are excellent. The location is within walking distance to the Prado and Ritiro Park. Buses run right in front and are easy to use. The rooms were spacious and well tended. No complaints and only high praise for this hotel.", "Date": "January 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great hotel! High quality! Recomended!”", "Author": "x5marano", "ReviewID": "UR91119900", "Content": "My friend and I stayed for 4 nights - we booked and paid in advance for a deluxe room - cost about 1469 euros - which was a significant discount to their rack rate at the time. The hotel is in a very good position - we walked to all the major tourist destinations - Prado, Plaza Mayor, Park del Retiro, Reina Sofia gallery etc. Rooms have been refurbished to a very high standard, and the soundproofing of our windows which overlooked Paseo de la Castellana was excellent - virtually no traffic noise when the window was closed. Physically and servicewise it is definitely 5 star. Service from all staff was always friendly and helpful. The mini bar and restaurant prices were such that we were not incilined to drink and eat there.", "Date": "December 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“High quality, good location - smallish rooms - food and wine expensive”", "Author": "BobR90", "ReviewID": "UR88892645", "Content": "My wife and I stayed for 4 nights Expensive - we booked and paid in advance for a deluxe room - cost about 1469 euros - which was a significant discount to their rack rate at the time. On the positive side : the hotel is in a very good position - we walked to all the major tourist destinations - Prado, Plaza Mayor, Park del Retiro, Reina Sofia gallery etc. Rooms have been refurbished to a very high standard, and the soundproofing of our windows which overlooked Paseo de la Castellana was excellent - virtually no traffic noise when the window was closed. Physically and servicewise it is definitely 5 star. Service from all staff was always friendly and helpful. On the less positive side : the deluxe room was smaller than it appears on the internet. It seemed to me a standard hotel room size, whereas the internet photos and 40 sq m description conveys spaciousness. The mini bar and restaurant prices were such that we were not incilined to drink and eat there. Eg mini bar beer was about 9 euros I think. Cooked breakfast 37 euros, club sandwich / spag bol 22 euros. I'm sure the food would have been high quality but we were disinclined to spend over $ 100 for breakfast.", "Date": "December 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tunis, Tunisia", "Title": "“Perfect Hotel, Perfect location, Perfect Staff”", "Author": "BusinessShipTrav", "ReviewID": "UR79013755", "Content": "One of the best if not the Best in Madrid. Excellent Staff. Spent two nights and nothing to say from the Check in to the Check out. Just didn't understand why Internet access is limited to 24hrs and must be renewed daily. Rooms are very comfortable. Good mix between trendy and modern atmosphere and classic style.", "Date": "September 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Excellent Hotel!”", "Author": "FullertonLosAngeles", "ReviewID": "UR78361556", "Content": "We stayed at Villa Magna with our 5 and 8 year old children. It was an oasis and pleasure to return to after long days sightseeing. The service was exceptional. The breakfast in the morning was a delight. Our rooms were fantastic. I would strongly recommend this hotel. Esteban at the concierge was especially helpful in retrieving my luggage from the airline. Thank you for the great memories Villa Magna!", "Date": "September 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Excellent, top notch, white glove service hotel”", "Author": "solomonpageguy", "ReviewID": "UR77990496", "Content": "Our family was travelling to Spain on vacation and after leaving Barcelona we spent 4 nights at the Villa Magna. Our travel agent has gotten excellent deals on our European trips in five star places and this hotel was no exception. The hotel was excellent, with quality and service consistent with any Ritz-Carlton or Four Seasons property we have been to. The outside is not promising, but inside it is completely renovated and perfect. Large suites, marble bathrooms, great showers, incredible maid service, excellent conciergies, very attentive service. Also, excellent, excellent breakfast buffet with authentic Spanish food (ham is everywhere) and great English speaking servers + adequate, immaculate gym. Would recommend for both business people, which seems who they primarily service and families. Very good Chinese (yes, Chinese) restaurant in the building. Good location, not far from Prado, Retiro and the other sights and not in the hustle and bustle of Grand Via. Reminded me of 5th Ave. in NYC, with tree lined elegance.", "Date": "September 2, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "La Mirada, CA", "Title": "“Villa Magna- The Best Hotel in all of Madrid”", "Author": "YoMan", "ReviewID": "UR74319682", "Content": "Stayed 4 nights at the remodeled Villa Magna in early August. The rooms were fabulous and spacious; some of the largest in Europe. The service was even better. All the employees are true professionals that really care about your stay. I did not notice any of the \"arrogance\" suggested by another reviewer and I was traveling with my family and dressed like a typical tourist. Nightly turn down service with a nice surprise on many of the nights, including complimentary wine, fruit, ham, etc. Get the Breakfast included option if available, the breakfast if fabulous if you appreciate a European Breakfast. Yes, the food and beverage are not inexpensive, but the hotel does have overhead to cover and the prices are what one would expect at a 5 star resort. I would definitely put the hotel on par with any Four Seasons. Hotel is a little further from the traditional tourist area, about a 7 euro cab ride or a metro ride. On the other hand it is literally backed up to the best upscale shopping district in all of Madrid.", "Date": "August 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“Stunning Rooms, Great location... shame about the snobby people!!!”", "Author": "debbiej127", "ReviewID": "UR69483987", "Content": "We stayed here for a few nights and was delighted with our room! I have stayed in many 5 star hotels in Spain and not all are on par with the real 5 star hotesl you get in England. This however was :0). Great location, all the best designer shops, it's just like being in Bond street but soooo much better and cleaner! The beds were so nice I had trouble getting up! Great Asian restaurant the staff were amazing. The downfall for us was that many staff in the hotel were very snobby, unless you wore a suit all day you will fit right in there. Other than that perfect, will go back again and stay somewhere else ( in the cooler season 36 degrees was a tiny bit to hot for us LOL.)", "Date": "July 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Panama", "Title": "“5 Stars and More”", "Author": "adbtesh", "ReviewID": "UR59875159", "Content": "Just remodeled rooms with all amenities. Superb staff that respond to all your needs. Walking distance to the best shops and door to door with El Corte Ingles of Serrano Ave. I will not stay at any other place in Madrid.", "Date": "March 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“One of the best hotels I've ever stayed at - Solid 5 star property”", "Author": "purewaves", "ReviewID": "UR59412725", "Content": "It's a real pleasure to write a review about such an overwhelmingly wonderful hotel. We had a luxurious and comfortable stay here just a few days ago. It was so good, we almost didn't want to leave! Pros - Superb rooms, high quality bedding (good luck getting out of bed!), high standard bathroom facilities including awesome shower rooms, comfortable lounge downstairs, wonderful entertainment system, white glove, high class service, fast room service, very helpful concierge. Cons - The fact that I kept getting static shocks when I pushed the elevator button was my biggest day to day gripe :) But if I really had to think about it, the menu pricing for room service was insane (as expected in a 5 star hotel I guess), i.e. $20 for fruit salad and $10 for mineral water. Also, the internet policy is a bit annoying. You have to get new codes every 24 hrs and they limit how much you use. Also, we had a conference that ran until 3pm but they wouldn't allow us a late check out to coincide with that. Overall, this hotel totally rocks. It's one of the best I've ever stayed in. I would love to stay here again. In fact, I'd probably go out of my way to ensure that I did stay here if and when I return to Madrid.", "Date": "March 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bali", "Title": "“not a real 5 star”", "Author": "surferbali", "ReviewID": "UR58907621", "Content": "far from a real 5 star no cofee or tea making facilities no hook in bathroom for towels no go green policy, no change of towels or linen need to get on daily basis your password of internet down in fron office, and slow internet some staff great others not so. Ladies in Lounge and Rocio in breakfast great. restaurant did not want to serve other food than the menu need to look for a better 5 star next time when in spain", "Date": "March 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Frankfurt am Main", "Title": "“Absolut the best hotel in Madrid with a friendly service”", "Author": "mametge", "ReviewID": "UR53845238", "Content": "We just came back from a 4 night stay at the hotel Villa Magna. I have stayed there 7 years ago when it was still a Hyatt hotel and was not very impressed. The hotel was closed for refurbishment and now they have the best room product in Madrid if not even one of the best in Europe. The rooms are very spacious and the design is absolutely fantastic. Housekeeping did a great job as well. We had an event in the hotel and the service was just above any imagination. Even in the bar and restaurant all staff members were always smiling and friendly to us and attended immediately to our needs. Nothing was too much to ask for. Thank you to the whole team for an unforgettable stay! This was definitely not my last stay in Madrid.", "Date": "January 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“Superb hotel. Favorite in all of Europe for luxurious comfort”", "Author": "dianeNorthCarolina", "ReviewID": "UR47974235", "Content": "Now part of the Leading Hotels of the World collection, this hotel is superb! Great location in heart of Madrid's version of Rodeo Drive and easy walk to the metro and access to everything in Madrid. Luxurious rooms, lobbies and common space. Probably the single most comfortable room I've ever had in Europe -- spacious, light-filled with a super-sized bathroom with the most modern features including a waterfall shower, separate tub, and walk-through closet with built in drawers, shelves and plenty of room for hanging clothes. Face it, when you come for a week or more to Europe, you are not traveling light. Windows that open for fresh air or close to block out street sounds, great draperies to block out light if you aren't on Madrid time just yet. Umbrellas in case of a surprise shower provided at the front desk, Knowledgeable and personable staff with good english (not found often in Madrid). This hotel gets 5 stars from a very picky traveler. My heartfelt recommendation.", "Date": "October 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "US", "Title": "“The Best in Madrid”", "Author": "jdr1000", "ReviewID": "UR47750107", "Content": "I used to stay at this hotel for years before it started the construction. Stayed at the Palace (Westin) during those years and I can tell you that we are back on track. The Villa Magna is simply one of the best in Europe. The service is excellent, location is unmatched and the renovated rooms are very comfortable. Gym has all you could need and the food is as good as always. The staff remains mostly the same and they told me the construction time was used to re train all of them for months and now feel more prepared than ever to put the hotel back where it belongs, at the top.", "Date": "October 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dublin", "Title": "“Our first look at the Villa Magna ( formerly Park Hyatt managed ) 31.05.2009!”", "Author": "Flyer007Dublin", "ReviewID": "UR31660790", "Content": "During our stay at the Hesperia Madrid Hotel ( 5 star rated, One of the Leading Hotels of the World, Santceloni Relais and Chateaux Restaurant ) from the 30th of May 2009 to the 01st of June 2009 we had the opportunity to have a visit to the famous Villa Magna Hotel Madrid equally a member of the Leading Hotels of the World since 2009 formerly a Park Hyatt Hotel. The Villa Magna is like our hotel the Hesperia located at the famous Paseo de la Castellana but a bit more to the south - around 20 min. walking/strolling distance between the two hotels. The building itself of the Villa Magna had really somewhat surprised us because of the name \" Villa \" we had first thought it is a more classical building but in reality we were greeted by a renovated 60' s style building, this we found good because we like actually 60s/70s style buildings, but it was never the less a surprise to us given the name. The entrance was nice with fountains and big drive-way and beautiful lighted tree decoration and very nice more historic, think art deco touch entrance with doorman who opened only the second door out of two, the first odd enough we must open by ourselves to get in / the same had happened at our exit from the hotel. Our first impressions of the hotel it was gleaming modern and new, no wonder it comes fresh from a full renovation which also saw the hotel closed for a longer time and a change of management - formerly it was known as Villa Magna, a Park Hyatt Hotel Madrid. OK, so good, Folks! We saw large spaces all in gleaming marble - mostly in creme and white - and the lobby check-in/ check-out was directly to the left staffed with a lady who gave my fiancee a new hotel brochure which describes the whole hotel at a glance only 4 pages of glossy paper, this we thought represents the hotel just perfectly. Coming from the Hesperia which is decidedly more spanish in colour and warm design, here at the Villa Magna we found actually a more international design in the lobby and the hall plus the lobby Bar and the Lounge. Here are spaces of quiet modern and lofty design with modern art touches on the walls but it comes across rather cold at times especially at the time of our visit, there had not been many people around but seating row upon seating row was rather cold presented in a more modern and glossy design without the warmness of being at a grand hotel in the classical 5 star sense. We had also a look at the Outside Terrace which seemed nicer and much warmer furnished in terms of colour and design than the inside of the Lounge of the Hotel, however we had 2 freshly pressed orange juices at the Lobby Bar to really soak up the service and the atmosphere in our own time during our Visit. Many readers will be probably surprised by the price tag for the juices as they came in at 26.00 Euro incl. Tax and Service. Each glass had 250 ml of juice by the way. This price tag reflects surely the hotel as a status symbol - in fact this is what it is! The juice was also served with crisps on the side. ( In the Hesperia we had two non-alcoholic signature cocktails named VERY WELL! served with an asian nut mix and a bowl of colourful M&Ms to go with for 16.00 Euros incl. VAT and Service Charge ). You can also read our complete Hesperia Review - see our profile here at Tripadvisor - you can also read the reviews from the Eurostars Tower Madrid - located in the second-highest building in Spain the SyV Tower in northern Madrid as well of the Intercontinental Madrid and the Hilton Madrid Airport - a stunner! In all of this hotels we had actually stayed in between 1 night and 3 nights a time! Coming back now to our first look at the Villa Magna, our own verdict from our visit concludes as following: 1.) We ordered first Water melon juice in the Bar which was not available so we had that orange juice 2.) The Service in itself is professional but somewhat cold and even underwhelming without real friendliness, 3.) Room-prices start at 350 Euro a night for a double room without Breakfast - at the Hesperia we had an upgraded 3 room-Business suite incl. full Breakfast and Welcome gifts plus free Voss and San Pellegrino Water for 240 Euros for 2 nights!, 4.) The Public-Toilets are only signed at the Villa Magna in spanish short form without any indication of a normal sign for female or male - when you do not speak spanish this could be a problem! 5.) The seating in all areas looks fine and super stylish - even expensive! - but when you are somewhat shorter - like my fiancee 1. 53m in size - than the seating in the Bar gets very much uncomfortable for her after a certain time! 6.) The location is Superb especially for shoppers because El Corte Ingles is less than 50 m away and Serrano with all the luxury boutiques is also only meters from the hotel! 7.) When you are a 60s/70s building afficonado like we are than the building will be fine - but when you are not a fan of such architecture than it looks more like a office building to you in style of the 60s/70s that is! All in all we can recommend the hotel, but be prepared financially and be in the mood for international high-end style, Michelin starred Restaurant and steeper prices than you would expect in Madrid, than you should be alright. Would we try the hotel? Liking many other Leading Hotels of the World and the romance of true luxury hotels we think with the right reason and preparation financially we should and would give the famous Villa Magna Madrid a try for real. Thank You. Do not forget to FLY!STAY!EXPLORE! MORE! and try to stay also in new properties. ( by the way the Hesperia Madrid was also our first Hesperia ever! we stayed in.)", "Date": "June 5, 2009"}], "HotelInfo": {"Name": "Hotel Villa Magna", "HotelURL": "/ShowUserReviews-g187514-d190161-Reviews-Hotel_Villa_Magna-Madrid.html", "Price": "$125 - $619*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Paseo de la Castellana 22</span>, <span class=\"locality\"><span property=\"v:postal-code\">28046</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "190161", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/81/e4/48/hotel-villa-magna.jpg"}}