{"Reviews": [{"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Jakarta, Indonesia", "Title": "“Rooms to be rented - CAN NOT CHECK IN AFTER 9PM!!”", "Author": "ruthnainggolan", "ReviewID": "UR127360162", "Content": "Well as the name implies this property provides rooms to be rented. Definitely not a hotel. The only plus point is free wifi in the room with strong signal, location also close to Urgell Metro station but its not a tourist area. You can have rooms with the same price in Plaza Cataluna. Dont expect that you can sleep well, at night it is very noisy, either from the street or from the pipe or neighbour. Please be informed that you can not check in after 9PM. We had to do an \"amazing race\" sort of thing when we get off the Aeroport Bus at 8.30 and have to run all the way looking for Urgell street", "Date": "April 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lucerne, Switzerland", "Title": "“Great value”", "Author": "Travel G", "ReviewID": "UR122086539", "Content": "We booked an economy double room for two nights at less than thirty euro a night. Not right in the tourist area, but a 10 minute walk away or you can use the metro which is 20m away from the front door. Absolutely spotless rooms, very bright and modern. We worried the economy double would be too small but it was very roomy. If you don't mind some street noise, try and ask for a room looking over the street. They had already charged our credit card for two nights when we arrived, so make sure you show up or give ample notice of cancellations because they do things by the book. Only negative would be the water-saving spring taps in the bathroom were extremely annoying, but the bathrooms themselves were spotless. A quiet, clean stay and excellent value.", "Date": "December 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Powell River", "Title": "“Great place, great location”", "Author": "Bridget A", "ReviewID": "UR120958842", "Content": "We stayed here in September and would definitely recommend it to our friends. The room was very cute and the whole place had lots of character. Our room had a balcony overlooking a central courtyard - a great place to sit and enjoy a glass of wine after many hours on foot! The bathroom was always clean and we were pleasantly suprised to discover a well-outfitted kitchen. The area was very quiet (in comparison to other places we stayed in various cities). The hotel itself was alway very quiet. The Barri Gotic and La Rambla are about a 15 minute walk away, and there is a Metro Station (Urgell) about 100 meters from the front door. The only down side to this place is that there is only staff manning the office until 9pm - so don't lose/misplace your key to the front door (or try to check-in late)! Otherwise, it's a fantastic place and great value!", "Date": "November 23, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Cardiff, Wales. G B", "Title": "“was really looking forward to my holiday in Barcelona”", "Author": "bethanaged5", "ReviewID": "UR120776804", "Content": "CalliUrgell 63. Hostel bookers let me down. Due to sudden health issues I was unable to travel. Contacted Barcelona rooms/Hostel bookers, and they didn't have the good manners to reply. I contacted them 9 days before due date requesting change of date and also wrote a letter but.......NO REPLY. also NO REFUND.", "Date": "November 19, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Loved this place”", "Author": "Robert B", "ReviewID": "UR117879604", "Content": "Loved Barcelona, loved this hostel. Great price, very clean, very convenient, helpful staff. I am recommending you to everybody I know that might go to Barcelona. Well done ! Thank you. The Brailsford family.", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "California", "Title": "“Great Flat Hotel”", "Author": "estrellas007", "ReviewID": "UR115928150", "Content": "Feels like you live in this place! Fully equipped kitchen (store down the street), 2 bathrooms both with showers, a common eating area, computer access, Daniel can do laundry for you! We actually stayed here on our return trip home for serving in the Peace Corps in the South Pacific (Jan 2010). We loved the neighborhood. Corner access to metro, air bus drops off on corner, walking distance to plaza de cataluna for shopping and eating, also close to the university. We stayed on the 3rd floor, but there were other flats on various levels. We stayed for 2 weeks. Daniel was wonderful and helped us practice Spanish (even though he speaks perfect English!) We stayed in 3 of the bedrooms during our stay. All rooms were great.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Chicago, IL", "Title": "“I would have given this hotel 4 stars, but...”", "Author": "KMNchicago", "ReviewID": "UR115864306", "Content": "This hotel was really well decorated and clean. The location is great...not even half a block from the red line Urgell stop. The airport shuttle is less than two blocks away...very convenient! The bathroom was kept very clean and the sheets/towels were changed every other day. There is Wi-Fi, but the signal is pretty weak. My only real problem with this place is that you CANNOT check in after 9pm. I knew this when I booked the room, but will never make this mistake again. Our train ended up getting in late from Valencia unexpectedly and we had to book another room for the night because we could not check in. If we had cancelled, we would have lost our deposit which was equal to one night's stay. I feel that this policy doesn't make sense for travelers. You can't always control what time you arrive somewhere. If it wasn't for this, I would have definitely given this place 4 stars. One more thing...DON'T stay in a room with a balcony. The street noise is VERY loud.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Bozeman, Montana", "Title": "“wonderful retreat in the heart of Barcelona”", "Author": "ArtistaGrl", "ReviewID": "UR115324898", "Content": "We stayed here in the Summer of 2011 for 3 nights. It was like having our own apartment in the heart of Barcelona to come home to at the end of the day. The office to check into the building was a bit hard to find because there were no large signs for the hotel. We had no problem checking in early, however, and the lack of attention made this place a hidden gem. The building was quiet, and we never saw another guest during our stay. There were two bathrooms to the floor, both extremely clean and spacious for European standards. The common area had a few small tables for eating or whatever else you could find a use for, with a window overlooking the central square and other apartment buildings on the block. Our room was clean and inviting with a small balcony and wonderful view after dark, when the lights of everyone's homes lit up the sky like stars. The terracotta floors and high ceiling kept our room pretty cool throughout the day. The location was perfect, with a metro stop literally one block away and several great restaurants within walking distance. We liked to have breakfast every morning at a little cafe just outside our hotel. They made the best cappuccinos and fresh squeezed orange juice with our meals. (You know its good when the locals eat there too!) I would stay here again in a heartbeat.", "Date": "July 13, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "New York", "Title": "“This is a bare bones and very loud hostel- pictures are inaccurate”", "Author": "SariPoage", "ReviewID": "UR113624800", "Content": "I stayed in this hostel as a single female traveler. I chose this place because it was the cheapest place I could find while still seeming clean and safe. The hostel is fairly clean, which is about the only plus about it. There is a kitchen but it closes at 2pm. Aside from that there really is nothing you could claim to make it \"apartment style living.\" My room was a tiny cell with a terribly uncomfortable mattress. There was also a small desk in it and a safe. Aside from that it was honestly very depressing. There werent even sheets on the bed. Only a mattress cover and a blanket. The pillows were also tiny squares and pretty pathetic. Even with all that- I could have been ok if it hadnt been so loud in the hostel. There were some slamming doors on my floor, but most of the noise came from other areas in the building. Even with ear plugs I would be woken up multiple times a night with people screaming or pounding on doors or otherwie making a loud noise. I've stayed in a lot of hostels and this was by far the worse in terms of noise. Also note- the shared bathrooms require you to bring a towel in every time you use them because there aren't any hand towels in them. Also, there is one computer that people can use which was nice but I had expected more with their advertisements. Free wifi. If they didn't make me pay for my entire stay upfront (even before I saw the room) I would have left after 1 night and found a new place.", "Date": "June 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Calgary, Canada", "Title": "“Great hotel, reasonable price and great location”", "Author": "0lunap0", "ReviewID": "UR108821137", "Content": "We stayed there on October 2010. We baraly ran into somebody in those days so it was quiet and nice. The room was clean and had all what we needed. It also had a high ceiling so we never felt hot there. I am particularly picky with bathrooms but they had two of them for one floor and they kept them very clean. Only downs was that they had the speakers outside of our room and they would sometimes leave them playing music all day but at night we would turn them off. We got a room with view to the inside patio, probably if you get one with view to the main street it will be a bit noisy.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bolton, England", "Title": "“Great Find!”", "Author": "GoDiscover", "ReviewID": "UR108265043", "Content": "We stayed in a fantastic two bedroom self contained apartment at the Barcelona Rooms. It is a lovely old building which has been been completely refurbished inside and the apartment was light,modern and painted with bright colours. We had two bedrooms, a bathroom, shower room, kitchen, dining area and lounge (the sofa converted to a further single bed). The furnishings were all modern and everything was great quality and spotlessly clean. The apartment also had doors on to a balcony / central open roof type area. The location couldn't have been better - there is the Urgell Metro station on the corner of the street and the Airport Bus also stops at the corner and was €9 for a return trip which was great. (point to note - for the return trip, the bus stop is one street back from the main road - a local corner shop pointed us in the right direction. The apartment is an easy walk to the Ramblas and there are also several nice Restaurants close by. Daniel was extremely helpful - both on the telephone before our visit, and also when we were there, and provided us with maps and directions to the local points of interest. On arrival, you need to press the entry buzzer on the outside of the building - it helps if you've checked out the street view on google maps first so that you knownwhat you're looking for as it isn't immediately obvious! (at the moment the building is covered with scaffolding and netting so it is quite easy to spot - our apartment was at the rear so this wasn't a problem at all) Would go back here without hesitation. I would recommend these apartments to anyone for an excellent value break - you won't be disappointed.", "Date": "May 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "The Hague, The Netherlands", "Title": "“Absolutely loved it!”", "Author": "Marlies84", "ReviewID": "UR108119572", "Content": "Great place to stay! Nice location, nice comfy rooms, beautifully decorated with nice colours and tiled. No negatives really! Showers and bathroom are very good, and all is clean. Large kitchen too with free use of cereals, tea coffee etc. Totally recommend this place! It's a gem, and for such a friendly price :)", "Date": "May 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Espoo, Finland", "Title": "“Nice hostel with nice location”", "Author": "AarniH", "ReviewID": "UR102210089", "Content": "This hostel is located right next to the metro Urgell (Gran via/Compte d`urgell exit), and few minutes away to Aerobus stop from the airport, and bit further away the stop to the airport. There is plenty of restaurants and bars nearby, you can reach the old town, and all the other places quickly by metro or by walking. There is a cafe just between the hostel and metro station, Supermarket is located on the same street about 100meters away. My room was located on the second floor, Big enough for one, there was tv with dvd player, little safe and a french balcony on the room. The same apparment had 4 other rooms, two bathrooms, two toilets, kitchen and a living room. One computer was available plus free wifi if you have your laptop with you.", "Date": "March 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Awesome Hostel”", "Author": "Kymlee", "ReviewID": "UR92306947", "Content": "Great hostel, don´t look any further. Rooms are nice, big and comfy. Thanks!", "Date": "January 9, 2011"}], "HotelInfo": {"Name": "Barcelona Rooms", "HotelURL": "/ShowUserReviews-g187497-d1905091-Reviews-Barcelona_Rooms-Barcelona_Catalonia.html", "Price": "$50 - $106*", "Address": "<div class=\"wrap_bl wrap\">", "HotelID": "1905091", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/6b/23/0c/common-area-second-floor.jpg"}}