{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lee's Summit, Missouri", "Title": "“Hotel Art Nouveau is Fabulous!”", "Author": "sumiga", "ReviewID": "UR119302875", "Content": "I loved this hotel! I stayed in Berlin by myself for a few days. I felt very safe here and the owners were fantastic! It is a very beautiful boutique hotel with a great breakfast room with beautiful views out of the windows. My room was fantastic! I had more than enough room, clean shower, and the free WiFi worked great! (No fitness center, but seriously would you really use it if there was one?) It is in a great location within walking distance of Kurfursentdamm Street where there are lots of great shops and restaurants. I would recommend this hotel to anyone! Loved it, loved it, loved it!", "Date": "October 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Limassol, Cyprus", "Title": "“great location, friendly service, spacious rooms”", "Author": "CarolinaMcB", "ReviewID": "UR115458207", "Content": "We were greeted by the very friendly owners who were very happy to help us with any queries, restaurant recommendations, even offered to book for us. We were also given very useful maps of Berlin. We stayed in a lovely spacious comfortable room with a separate toilet and shower rooms and a great little balcony. Although it was within a very short walk to the main road of ku'damm it felt very homely. The breakfast was lovely prepared by the ppl who run it in front of you every morning and although they had set times it was very flexible. It had a good selection of fresh fruit salad, whole fruit, nuts, muesli, selection of cereals, yogurt, fruit juice, cheese, cold cuts, boiled eggs, a good selection of teas and coffees. Coffee and tea available all day and night at no extra charge and there is a help-yourself bar (at very reasonable prices) with nibbles (crisps, cheese puffs & pretzels) available even when the reception was closed after hours and a chart where drinks consumed were noted down and paid for at the end of your stay. The breakfast room could also be used as a living room which is where the bar was in the evenings. Unfortunately the old style 'cage' lift was broken for the whole duration of our 5-day stay as they were waiting on the rare spare parts to arrive and with the hotel located on the fourth floor of a block of apartments it was a little bit of a workout going up and down the stairs, great for burning off nibbles at bar! Not so great when carrying heavy suitcases up the stairs but we were offered help. Upon check-in a key to the downstairs main door is also handed over with room key. This hotel was a great option for us as we met up with friends and their two children so at night they would put kids to sleep next door to us and we would socialize on our balcony. By no means is this a 'regular' hotel with a lobby and large hotel facilities, room service and all the bonus, no gym, no pool but we did not need any of that and it was a very pleasurable safe, clean stay at reasonable prices. Rooms were cleaned daily unlike the balcony, a very small minus. Another small minus, could not get the wireless internet although owner supplied us with password and only had a signal around the reception area. Luckily we were too busy to mind. Location is great! There were bus stops and metro stations within a short walking distance as well as restaurants and shops. All in all a very good choice.", "Date": "July 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "The Hague", "Title": "“Fantastic little hotel near Kurfuerstendamm”", "Author": "prasenberg", "ReviewID": "UR106658484", "Content": "I don't like big chain hotels, I like my hotels to have some character. It doesn't get any better than the Hotel Art Nouveau in Berlin. Located on the 2nd and 4th floor of an apartment building, it oozes atmosphere. The old elevator, the beautiful decorations, the wood, everything. I loved every minute of it. The location is excellent. Near the famous Kurfuerstendamm, one block from the U-Bahn. Shops, including restaurants, are nearby. The rooms have a small TV, excellent and free wifi, a small bathroom, nice beds and a beautiful desk. They are maybe slightly smaller than you'd expect, but they were large enough for me. The hotel serves breakfast and in a nice touch: you can get a drink or some food at night too. Just write down what you took and that's it. They trust their guests, which adds to the general atmosphere. Besides that, the owners are very helpful and welcoming. I can't find any fault in this hotel. Perfect!", "Date": "May 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“A Special Hotel in a wonderful city”", "Author": "SusieQChicago", "ReviewID": "UR94549683", "Content": "My husband and I and our two adult children stayed at the Hotel Art Nouveau the week before Christmas, including Christmas Eve and Christmas Day. The two of us have stayed at the Hotel two other times and felt that we were returning home again. It is great to feel that you know the hotel and the neighborhood. Christine and Gerd are wonderful hosts and are always available to suggest museums and other activities and have a wonderful list of restaurants, stores and nightclubs in the Savignyplatz area. The hotel is well situated since it is near 3 S-bahn lines and a U-bahn stop is only a few blocks away. This time we had a few problems and Gerd was always available to get boots fixed for us or obtain over the counter drugs we needed. We were able to tell him what we needed and it was available on our return at the end of the day. The rooms are very tastefully decorated by Christine in an electic manner - a few antiques, cute sayings, modern pictures by up and coming artists, wall hangings, and vibrant colors on the walls. The rooms are very spacious- this time my husband and I were upgraded to a suite and our kids had regular rooms. The beds and the linens are high quality and it was hard to get up and get going in the morning. Since it was the Christmas season, we had a special treat one night - Gluhwein made by Gerd (as my son said, lots of alcohol just like he liked it) and Christine's homemade Christmas cookies. When we arrived, Gerd made us a special cocktail to toast our arrival and he gave us suggestions for our visit to Berlin. He also had a suggestion for a restaurant open on Christmas Eve when most of the restaurants are closed. The joy of staying at this Hotel is the pesonal service. Christine and Gerd truly want you to experience Berlin and they go the extra mile to make sure that you have a wonderful experience. They are happy to make reservations for you. They find out what you are interested in and then go the extra mile to help you enjoy your visit. It is a much more personal experience than staying in a big hotel. The honor bar is also a big plus - it is fully stocked with wine, beer and soda and juice. If you would like something else, you tell them and they will get it for you. When we were there in 2009, we were there for Father's Day (same day as Himmelfahrt) and they gave all the fatherss little bottles of sekt to celebrate the occasion. At the end of the day, this is a great place to stay because of all the personal service but if you need a lobby and room service, try a big hotel. PS - This December Berlin had snow - the Christmas Markets were magical with all the smells, food, wine etc. And all the Christmas lights. What a great time to visit.", "Date": "January 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“It was like home away from home”", "Author": "aap057", "ReviewID": "UR88022863", "Content": "We are 9 (senior) partners in a Norwegian consulting company visiting Berlin for spending 3 days and having a good time in combination with doing some work together. Finding Hotel Art Nouveau in a Berlin guidebook with a recommendation, I, as the organizer of the trip, chose to send them a request. When contacting the hotel, I got a proposal very quickly, and also lots of help in finding/booking restaurants, concert tickets etc before our arrival. When there - the owner and manager was most helpful and friendly. The atmosphere is informal and including, the size - only 20 rooms - makes it very personal. We all got large rooms with new bathrooms, the breakfast room and \"Honesty Bar\" was in the middle, and we settled in - feeling at home immediately. This is not your de luxe hotel, but so nice! We also used the conference facilities - which worked well for us - being 9 people. The location is perfect both for shopping and sightseeing. I higly recommend Hotel Art Nouveau. This is a place to live while in Berlin - with books and antiques - and quite reasonable priced. Several of the 9 partners have already invited their spouses/partners for a stay at this place if going to Berlin.", "Date": "November 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Berlin's Hidden Treasure...Hotel Art Nouveau”", "Author": "DesertRatCalifornia", "ReviewID": "UR81598561", "Content": "This boutique hotel is like coming home to visit favorite relatives...owners Christine and Gerd are not only gracious hosts but they were experts in guiding us to the best that Berlin has to offer. From restaurants to museums, to some best kept secrets about Berlin, we followed all of their suggestions and were never disappointed. While my traveling companions had been to Berlin in 1974, this was my first visit and I had no idea of what to expect. Not only is this 22 room Victorian- era hotel lovingly maintained, it is located in a lovely tree-lined neighborhood of shops and restaurants---at least 100 within a ten minute walk! It is virtually impossible for larger hotels to offer the type of personal service offered by the Hotel Art Nouveau. Because of Christine and Gerd, I can't wait to return to Berlin and the Hotel Art Nouveau; they made my visit to Berlin very special.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Nice and Friendly B&B in Great Neighborhood”", "Author": "60763Nancy", "ReviewID": "UR79193381", "Content": "This is a pleasant B&B type hotel off the Ku'damm, but away from most of the tourist hubub. It is family run and the proprietor is helpful. Don't expect the amenities of a large hotel - it's not that type of place. However, there is free Wi-Fi and television in the rooms w/ mostly German channels, but has CNN and BBC. Rooms are spacious and well kept. Breakfast is limited, but adequate (cereals, toast, yogurt, etc.) The neighborhood is terrific - a \"real\" part of Berlin where people live and has great restaurants. Hotel is a few blocks from Savignyplatz S-Bahn station, and very easy to get anywhere from that station. Also, good place to rent bikes near the station called Rad Kunst. Enjoy.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Could not have made a better choice for a hotel in Berlin”", "Author": "TravelingSwiss", "ReviewID": "UR76430687", "Content": "I went with two other girl friends, and the hotel accommodated us with a beautiful, large room with three beds. The hotel was very well located, great value for your money and as a family-run business, one definitely feels at home. (Literally, you can walk to the kitchen in the middle of the night, take drinks out of the fridge, etc.) The rooms were amazing! Very original and very SPACIOUS (which is rare!) Lastly, the owners were wonderful and extremely helpful.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Mercersburg", "Title": "“Family run hotel is personal, well located, and is an excellent value.”", "Author": "3rdGeneration", "ReviewID": "UR72476737", "Content": "Although located on a fairly busy street, the rooms faced an inner courtyard which provided privacy and quiet. The proprietors were very helpful in recommending good restaurants and sight seeing ideas. Breakfast (included with the room) was always of the highest caliber. Our room was adequate size- there was a heat wave in the 90'S F. while we were there and the hotel has no air conditioning. We had fans provided, however. Location was good for transportation and easy access to items of interest for tourists. The owners were fluent in English as well.", "Date": "July 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sydney", "Title": "“Captured the essence of Berlin”", "Author": "pdar", "ReviewID": "UR64198779", "Content": "I'm usually happy enough with 'clean and comfortable' wherever I stay, but this hotel offered much more than that. It captured the essence and feeling of a city renowned for its art, culture and history. The owners and staff were courteous and friendly, particularly during the volcanic ash episode. Their helpfulness and support when I and several others needed to change their travel plans because of it was particularly appreciated.", "Date": "May 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Murfreesboro, TN", "Title": "“BEST hidden gem in Berlin!”", "Author": "luvmyminninegirl", "ReviewID": "UR62434559", "Content": "This hotel was so beautiful and the staff was extra helpful! It was out of the way, yet close to it all!", "Date": "April 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“A hidden gem of a hotel”", "Author": "EricHalfaBee", "ReviewID": "UR56888052", "Content": "This is a very charming hotel, with an old lift in the stairwell and very high ceilings, individually styled rooms, a great breakfast and after hours drinks. If you like Parisian pension style hotels, you will like this hotel too.", "Date": "February 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“Just like being in a friend's house”", "Author": "talblet", "ReviewID": "UR23113005", "Content": "Stayed three nights in this great hotel. Great location near the Ku'damm. Owners and all staff really friendly and very welcoming on arrival, including welcome drink. The whole place feels like home from comfortable home. We had keys to main front door, hotel front door and our room naturally. We had room 5 which was terrific and very spacious. Splendid shower after walking our socks off round this enormous, fascinating town. Breakfasts were delicious. Loads of tourist info and suggestions from the owners as to how and what to see. Honesty Bar open whenever we got back. We recommend going in December with all the wonderful Christmas Markets including the gluhwein and wonderful street decorations - makes London look v. boring in comparison. All in all a wonderful city beak in a lovely small and intimate hotel.", "Date": "December 30, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“Wonderful boutique hotel”", "Author": "garbo", "ReviewID": "UR8015020", "Content": "My husband and i had a great stay at the Hotel Art Nouveau last summer. The owners of the small property are very friendly and go out of their way to help you with your travel plans. The hotel is close to the train line, that can take you to Brandenburg gate, reichstag and other key sites. The hotel is in a mostly residential neighorhood, which is full of great restaurants. There is a german pub across the street and an Italian restaurant around the corner. There is a gas station/convenience store adjacent to the hotel, which was great to pick up a map, drinks, or snacks. The hotel is on the fourth floor of an old art nouveau building. You take a lovely antique lift to the hotel. The breakfast was really nice. Cereals, breads, meats, cheeses, juices, all the standard European fare. One great thing, is in the afternoon and at night, the breakfast room has an honor system. They have wine, beer and other drinks in their fridge. You just write down what you had and they charge it to your room. Plus normal prices! We had a very comfortable room with ensuite bathroom. The room had an antique chest in it with wooden floors. Lovely large windows that opened up to the back of the property. The only downside of this place and it wasn't their fault, was that we were there during a heatwave and it was unbelieveably hot. Like most hotels in Europe, that aren't business class, they don't have airconditioning or fans. They have a simple computer with free internet. Wasn't working very well when we were there, but i am sure it's fine now. Otherwise a great stay and i would highly recommend this hotel.", "Date": "June 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Coast", "Title": "“Charming, friendly Berlin headquarters”", "Author": "travelman1938", "ReviewID": "UR7390653", "Content": "The combination of location, style, charm, value and warmth of welcome have made the Art Nouveau my Berlin headquarters for the past 10 years. HIgh ceilings, spacious rooms, big windows, hardwood floors, and interesting art. If you're there to enjoy the city, owners Christine and Gerd Schlenzka will point you in the right direction. They know all the neighborhood restaurants (many good ones) and Christine stays current on Berlin's vibrant art scene. On my last visit they recommended a special lunch deal at the Michelin-starred restaurant in the Swissotel. It was an extrordinary 3-course meal for about 25 euros. They also sent us to Rogacki, a fabulous Berlin seafood bar known only to locals. Very off the beaten path and inexpensive. Example: three fresh Normandy oysters and a generous glass of white wine for a mere 7 euros. I saw quibbles in a previous post about small TVs, no fresh juice, and lukewarm coffee. If those things are really important go to one of the boring, impersonal chain hotels where you'll pay an extra 20 euros for breakfast...but the TV will be good. I've been traveling frequently in Germany for 30 years. This place is a gem...a throwback. Soon all the family-owned hotels will be run out of busines by the Mercures and Novotels of the world. BTW, my coffee's always been hot.", "Date": "April 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bristol, UK", "Title": "“Hotel that feels like home”", "Author": "MillieMorley", "ReviewID": "UR7340927", "Content": "The tasteful, 'Hotel Art Noveau' is situated in the heart of Berlin. The hotel is almost on the corner of Mommsenstraße and Leibnizstraße and is a 10 minute walk from the S-Bahn Station - Savignyplatz. The Hotel itself is located on the 4th floor of a beautiful art deco building. You go up to the 4th floor via an old parisian inspired wrought iron lift and are greeted by the front door of the hotel. The hotel is run by Mr and Mrs Schlenka - who speak perfect English and are very friendly and helpful. We arrived late on Thursday evening (day before Good Friday) and they made provisions for us to collect our keys from the Sushi Bar on the ground floor. The next morning at breakfast they greeted us and welcomed us to Berlin. We stayed in the Japanese Room (Room 1) and it was very comfortable indeed. A large room (around 16 foot square) with a small en-suite bathroom in the corner. The bed was SO comfortable, and it was so light and airy. The only bad thing I have to say about it, is that the duvet was so warm and snugly that it was hard work to get up in the morning! It was so comfortable! Breakfast is included in the price and is traditionally German - meats, cheeses and bread as well as cereal and yogurt. All very nice indeed! In the evenings, there is an honesty bar which contains beer, juice, soda and champagne! Other people have written that staying in Art Nouveau is like staying at a friends house, and I totally agree. The whole place is so welcoming and friendly - it really feels like home. Close to the hotel are some very nice restaurants. The whole area including the streets Bleibtreustraße, Mommsenstraße and Ku'damm have some really nice places to eat. We ate at Mey on Bleibtreustraße - a Turkish restaurant. There is a big Turkish population in the city and you can get some really fine food. It was a really nice meal - lots of meat so vegetarians may want to give it a miss. We also ate in the 12 Apostles restaurant, a basic Italian restaurant that is famous for its pizzas named after the 12 apostles. This place is opposite the S-Bahn Station on Savignyplatz - but I reccommend you make a reservation, its very popular. Also near the station on Bleibtreustraße is Ali Baba, a basic pizza and pasta restaurant that sells really nice slices. Its also very popular because its so cheap so get there early! Travellers Tips: If you fly into Berlin Schoenefeld airport (East Berlin) take the S-Bahn Train (S9) (S=Schnell B=Train) to Spandau and get off at Savignyplatz. The hotel is a 10 minute walk from this station. Alternatively, you can get off at Zoologischer Garten and get a Taxi to the hotel. Zoologischer Garten is one stop before Savignyplatz. The fare is 2,10 Euros. Get your tickets inside the airport or inside the station. Once you leave the main airport doors, the station is 400m across the road. Look out for a big green 'S'. Eating: There are lots of places to eat around Savignyplatz. Ali Baba, Mey, 12 Apostles, Lubtisch but they get very busy so I recommend you book. Trains: The public transport system is excellent in Berlin. The S-Bahn and U-Bahn run frequently over a 24 hour period. The closest train to Hotel Art Nouveau is Savignyplatz. People Watching: On our last day we spent the day in Scheunenviertel which means Barn Quarter. It was traditionally a Jewish area in Berlin and is in the 'Mitte' district. We took the U-Bahn (underground train) to Orienburgerstrasse and it brings you out right in the centre of the district. Here you will find numerous restaurants and bars. We drank in Studio 54 which is in an old warehouse that was used illegally for parties etc in late 1989 when the wall fell. We also ate in Da Da Falafel - a big hit with those on a tight budget and they were possibly the best Falafels I have ever eaten. Not far from here (30 min walk) is some pretty cool shopping outlets like Addidas Originals and Puma. Also there is the Hackescher Hof, a big shopping warehouse which is home to lots of different shops. Here you will find a shop dedicated to Ampelmann (Traffic light Men). The cool little red and green men can be found on just about anything from keyrings to T-shirts. Email me if you need anymore info - ej_hazellathotmail.com", "Date": "April 12, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "San Francisco", "Title": "“Doesn't Live Up To The Hype”", "Author": "selmrl", "ReviewID": "UR6032426", "Content": "Recognizing that hotel experiences are highly subjective and that many of the reviews of Hotel Art Nouveau are positive, I wanted to share our mediocre experience. I'm not really sure why the hotel is named what it is. I noted a couple of art nouveau pieces, but the only item in our room that clearly was of that period was a single nightstand. Everything else is, well, just a hodgepodge of disparate styles. We stayed in the \"suite\" called Peter for a week. It's the strangest suite I've been in. One enters through the kitchen and the fold-out bed/sitting room is in the kitchen as well. Looking at the floor plan in the breakfast room, I noticed that some of the regular rooms were larger than our suite. Also, if you stay in Peter, don't plan to sleep past 8:00 during the week. There is an elementary school next door and the kids raise quite a racket first thing in the morning. If 8:00 is your wake up time, no need for an alarm clock. Closing the double windows blocks out the noise pretty well, but then you lose the fresh air. The breakfast buffet is okay. I've had better and worse. The owners had some very good restaurant recommendations and we liked the neighborhood. Pretty easy to get around by train, subway or bus. So, overall, I rate our experience here as average which was disappointing. My expectations were higher based on others' reviews.", "Date": "October 31, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Bologna, Italy", "Title": "“2nd time always good.”", "Author": "paoloz", "ReviewID": "UR5966929", "Content": "After last year's stay at this hotel i decided to comeback. The room wasn't as nice looking as the one i had last year, nevertheless it was pleasant, clean and after all had it's own style too, very good mattress and clean bathroom, a bit noisy being near to a passage corridor. The breakfast room is lovely, very stilish as all the hotel which is set in a Art Deco Building and has the reception at 4th floor !, Breakfast is served buffet style and is very very good and abundant as with most hotels in Germany, which i love. The owners and personnel are nice and well mannered, always ready to help. I come here on business visit and it gives me just that privacy i need at the end of the day. You get your own keys and is a bit like going up to your own apartement, you don't have to go through reception if you don't want. All in all the hotel is just perfect for me. I will go back next year too......", "Date": "October 18, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“A Warm Hotel and a Great Staff”", "Author": "A TripAdvisor Member", "ReviewID": "UR4363281", "Content": "The hotel is like staying in somebody's beautiful apartment; the hosts are so friendly & helpful if you need them or fancy a chat, but they don't intrude if you would rather be left alone. Wonderful breakfast and honor bar, and the pillows & duvets are some of the best things about the hotel. The only thing I missed was an actual bath, after lots of walking a soak would have been relaxing but the hot power shower almost made up for it. We booked this through a fantastic hotel booking website called Tablet Hotels, which is very well designed and easy to use.", "Date": "January 19, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Washington, DC", "Title": "“Chilly Outside and Warm Inside”", "Author": "mado2", "ReviewID": "UR4306993", "Content": "Stayed for 4 nights in November and while the weather in Berlin was snowy and cold, the atmosphere in this hotel was just the opposite. The owners are great -- they provided a warm welcome and great tips for a first trip to Berlin. The location of the hotel is perfect. It is a lovely neighborhood with many local restaurants and excellent shopping. The rooms are comfortable -- it feels more like a B&B than a city hotel. I plan to return to Berlin and this hotel when the weather is just a bit warmer!", "Date": "December 28, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Geneva", "Title": "“We'll Be Back”", "Author": "Veyrite", "ReviewID": "UR3912606", "Content": "Spent 4 nights here with another couple for our annual city-break together. Need much longer to see the best of Berlin, so we'll be back. Well placed in old Western part, just off Ku'damm, and close to S-Bahn and access to other parts of Berlin, Schoenefeld and Potsdam. Access by the hall and 30s-style lift to the 4th floor is a taster of what's to come. Chic rooms in art nouveau style were very comfortable. B&B only, but friendly owners very knowledgeable on the many good local restaurants within minutes' walk, equally helpful on what to do come rain or shine. Honesty bar, well stocked with good but inexpensive German beer and wine. Being B&B, no lounge area but that would really have been a bonus. Excellent value.", "Date": "September 18, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Belfast", "Title": "“My home from home in the Berlin :-)”", "Author": "Hodkinson", "ReviewID": "UR3704867", "Content": "This is one of the most enjoyable hotel stays I've had! Why? Because it didn't feel like I was staying in a hotel! This is a lovely old Jugendstil or Art Nouveau building (hence the name) with more character than any hotel chain would ever offer you. The Schlenzkas give you freedom to have your stay largely on your own terms and do not charge the earth for it either. We stayed in the Red 'Christina' Suite which was just perfect in every way for us. A good sized living room with wonderful chaise longue and modern bathroom and a bedroom to die for - all minimalistically furnished with a mix of classic antique and modern pieces , but with ample storage space and a stunning bed. Unlike many hotels, we were not pushed into the breakfast room before 9AM and on to the street by 10 by the cleaners - instead you could have breakfast any time up to 10:30 and the cleaning staff came to service the room when it was convenient for you to have it done! I'd recommend it to anyone looking to slow the pace of their trip down and relax into life in Berlin. With great local restaurants like Tavola Calda and the numerous options on offer in the bustling Savigny Platz and it's off-shoot streets only 10 minutes walk away, you are never far away from your brunch or evening meal! Another 15 minutes on the S-Bahn takes you to Hackescher Markt where your evening can really get into full swing. I'll be back in Berlin soon and I'll be back at Hotel Art Nouveau!!", "Date": "July 27, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Excellent Value. Caring Owners.”", "Author": "A TripAdvisor Member", "ReviewID": "UR3695187", "Content": "We spent three nights at Hotel Art Nouveau in July. It's located on the 4th floor of a lovely, restored art nouveau building just off the Ku'damn, near alot of good restaurants and stores. Safe, upscale neighborhood. The owners are very friendly, helpful and generous. The breakfast room offers free coffee, tea and snacks 24/7, and an honor bar (reasonably priced). The only downside is no air conditioning, but heat waves are rare in Berlin. The rooms are comfortably but do vary in size and design, so it's better to request a specific room from their website. We would not hesitate to stay again.", "Date": "July 23, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Belgium", "Title": "“Attention!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3488847", "Content": "The Hotel is mediocre on all the aspects. Decoration has nothing to see with art nouveau. Very expensive for what it offers. This hotel occupies only two floors of a old building. I have many doubts on the origin of the positive reviews produced about this hotel in the InterNet... The category is of a pension one * or ** maximum!!!!!! It is my opinion and the opinion of others that also were in this hotel. A scandal...", "Date": "May 20, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Warm hospitality amidst the snow”", "Author": "A TripAdvisor Member", "ReviewID": "UR3213492", "Content": "During our mid-February trip, the snow fell on Berlin. We had the added pleasure of staying at the Art Nouveau, where the owners warm hospitality, coupled with the spacious and beautifully designed room, made it a trip to remember. Quite simply the perfect base from which to see the City.", "Date": "February 21, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Oregon", "Title": "“A great experience.”", "Author": "A TripAdvisor Member", "ReviewID": "UR2991272", "Content": "We had a wonderful time at the Hotel. The owners were gracious and the guests from all over the world were interesting. I would reccommend this hotel highly if you want the \"feel\" of Berlin.", "Date": "January 9, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London", "Title": "“Gorgeous room”", "Author": "London34", "ReviewID": "UR2317724", "Content": "Lovely, huge room. Breakfasts great. We loved the antique lift with the iron gates that you have to close and the location was nice if a little off the beaten track. Staff are a bit odd though. We asked if they could book us a table at a restaurant that we had chosen. They seemed a bit put out that we didn't ask for their recommendations. When we arrived at the restaurant there was no reservation and when we got back to the hotel they never mentioned it. Still a very good value and lovely hotel. Just avoid the staff!", "Date": "July 23, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London, UK", "Title": "“Personalised, contemporary rooms.”", "Author": "A TripAdvisor Member", "ReviewID": "UR1777520", "Content": "Just returned from our second visit to Art Nouveau (Easter 2004). All rooms beautifully styled and personalised with pictures and orniments -feels like staying in a friend's home rather than a hotel. Great dining room for continental breakfast and lots of good 'happening' restaurants and bars within easy walking distance for supper.", "Date": "April 13, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Portland, OR", "Title": "“Great hotel in Berlin's best neighborhood”", "Author": "A TripAdvisor Member", "ReviewID": "UR1537540", "Content": "First read about this hotel in Gemütlichkeit, The Travel Letter for Germany, Austria & Switzerland. It was absolutely right on the mark. Wonderful, high-ceiling, airy rooms with hardwood floors; knowledgeable, helpful management (they know all the good restaurants); super location in Savigny Platz neighborhood. One of the suites, #16, has to be one of the best hotel rooms (and best deals) in Berlin; two big rooms, stereo, CD player, TV in each room, huge bed, and very quiet on inner courtyard. Have stayed there half a dozen times and am always well-treated.* (*I am bewildered by the earlier review claiming deceptive financial practices. The owners are straight-up people. I have canceled by phone a couple of times and gotten a full refund.)", "Date": "January 4, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Austin, Texas", "Title": "“Beware - unscrupulous business practices!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1373429", "Content": "I feel it is important to warn travelers about deciding to stay at the Hotel Art Nouveau in Berlin based on our experience: My husband and I were traveling to Germany for our wedding, and we wanted to stay one night in Berlin with my parents. After reading reviews, we made reservations at the Hotel Art Nouveau. Fifteen days before we were suppose to stay at the hotel, our plans changed, and my husband immediately called to cancel our reservations. The staff person (who later we believe was the Hotel Art Nouveau owner) said, Good! Thank you for calling and letting us know and we hope you will stay with us later. There was no discussion that we needed to follow-up with a written cancellation and we trusted all would be well.However, our next creditcard statement included a charge for $250 for both rooms we had reserved. We contacted the Hotel Art Noveau. The owner immediately told us we had no proof of ever calling. When we contacted the phone company and provided proof of a call on the date we had told him we had cancelled, he said that proving that we called did not provide proof that we had cancelled the rooms.The Hotel Art Nouveau owner also told us to look on their Web site and at the bottom of their emails where it says in small writing all cancellations must be written HOWEVER, while all other reservation information is in English and German, the written requirement is only in German at the very bottom of each screen not easy to find. When we pointed out this fact, the owner agreed it was misleading and said that he would no longer communicate with us about the charge.Our concern is how many non-German-speaking travelers have made reservations with the Hotel Art Noveau and then cancelled by phone only later to be charged for their rooms and then forced to pay ..... I warn all those who seek to stay at the Hotel Art Noveau to be extremely careful and not become victims to unscrupulous business practices.", "Date": "October 1, 2003"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London, England", "Title": "“Had a great time a the Art Nouveau”", "Author": "A TripAdvisor Member", "ReviewID": "UR1275746", "Content": "We had a reakky good stay in this delightful family run hotel in a quiet and convenient part of Berlin. The owners could not have been more helpful and welcoming. The rooms are all very individual and comfortable. We are looking forward to returning.", "Date": "September 7, 2003"}], "HotelInfo": {"Name": "Hotel Art Nouveau", "HotelURL": "/ShowUserReviews-g187323-d190597-Reviews-Hotel_Art_Nouveau-Berlin.html", "Price": "$139 - $320*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Leibnitzstrasse 59</span>, <span class=\"locality\"><span property=\"v:postal-code\">10629</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "190597", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/e1/19/e11956fc1537e7cddfa1278bd16a5dcd5large.jpg"}}