{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Santo Domingo, Dominican Republic", "Title": "“Nice modern and clean hotel, great location”", "Author": "holajaviDR", "ReviewID": "UR137026511", "Content": "My first choice every time I visit Madrid! Good neighborhood with many restaurants and shops nearby, including El Corte Ingles, which has a large supermarket on the bottom floor. Airport is 15 minutes away on taxi (aprox 20 EUR).", "Date": "August 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good Location & Large cool rooms”", "Author": "Emma13a", "ReviewID": "UR134130106", "Content": "Great location with stores, restaurants, parks, metro, a taxi rank all within walking distance of the hotel front door. The lobby is small but the room I stayed in was gigantic and it was really worth having the private balcony to sit outside at night in privacy and relax. The room was clean, attractive and the cleaning staff were always so friendly and positive - even though we could not speak the same language. A very funny place to stay.", "Date": "July 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Minneapolis", "Title": "“Liked it so much we came back the next week”", "Author": "MinneapolisMaguire", "ReviewID": "UR133404317", "Content": "For all the reasons cited by previous reviewers, we quite liked this hotel. In fact, when we returned to Madrid for a night later in our trip, we stayed there again. We did not experience any noise problems. The service in the restaurant was very good, and we liked the food. Special thanks to the bar staff, who held up well amidst the EuroCup madness. (And congratulations to the team and country for winning the Cup!)", "Date": "July 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Good hotel in a busy part of town”", "Author": "Dec105", "ReviewID": "UR133231357", "Content": "Hotel Vincci Soma is a good quality hotel, located in a busy part of town - close to shopping, transport links, tourist attractions and good quality restaurants and bars. It's on a busy street, but has a fairly low key street presence (the taxi driver had a bit of difficulty in finding it). Reason being that the lobby is quite small, and you have to move upstairs to the first floor to locate the restaurant, conference facilities etc. Price wise, there are better deals to be found in Madrid if you shop around, but this was a business related trip and the hotel was booked by the local business partner (at a discounted rate, apparently). Room quality was good but (am I alone in this ?) two single beds pushed together does not constitute a double bed or a double room. The bathroom had both a shower and a bath (rare enough in hotels these days) as well as a decent selection of freebies. Room safe (free) is provided, with usual minibar and wall mounted flat TV. Also, there was a stylish looking radio / music system but which didn't appear to have an ipod dock (just one of those little connections, where you have to bring your own lead - which I didn't). Buffet breakfast was very good - particularly the fresh orange juice. Now my gripe - internet access has an extra charge, and no free wireless. Why can bars and cafes provide this as a matter of course, but not hotels? Otherwise, Vincci Soma has many positives. It's right beside a Metro stop (Goya) and not far from the museum belt. Shoppers will be pleased with the array of well known stores in the immediate vicinity (including two branches of El Cort Ingles). The general area is quite upmarket with a good lively nightime buzz.", "Date": "July 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Nice hotel”", "Author": "Mlim20", "ReviewID": "UR131802437", "Content": "Had a lovely 3 night stay in Vincci Soma in March. Staff were very helpful. Room was modern and clean with a large bathroom. The hotel is a little far from the SOL/Plaza Mayor area but with the reliable Metro, you can get anywhere pretty fast. Metro stop Goya is across the street and taxi's are pretty cheap. We took a cab ride from Cibeles to the hotel for about €5. from the airport, take the Airport Shuttle €2 to O'Connel or Cibeles and then take a cab. You can also take the Metro from Cibeles to Goya with a change of train. Few restaurants are open in the area at night, we didn't try the one in the hotel, but we found VIPS just down the street that was still open at 11pm. If you want to get away from the hustle and bustle of Gran Via, I would recommend this hotel.", "Date": "June 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Well-Located and Good Value for Madrid”", "Author": "tonyy38", "ReviewID": "UR131709539", "Content": "Good and pleasant service, a location making major sites easy to visit and a comfortable room made this hotel a good choice. There are numerous eateries nearby with very good quality food and wine at very reasonable prices. For the tourist who prefers a larger hotel, this is a good choice. If you have time just to explore,take your camera and visit the famous Parque de Retiro which is within comfortable walking distance.", "Date": "June 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Good comfortable hotel”", "Author": "Lizard7275", "ReviewID": "UR130617025", "Content": "In the best neighbourhood in Madrid, this modern hotel offers comfortable rooms and a good restaurant. Prices vary depending on the day but generally they are fair for the quality of the rooms and the location.We go there everytime we stay in Madrid.", "Date": "May 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "richmond", "Title": "“Pleasant Experience”", "Author": "travellerRichmond", "ReviewID": "UR130572020", "Content": "This hotel has an excellent location and the staff were very welcoming and helpful, offering a high standard of service. We were helped with our luggage on arrival and the bar service was excellent. The only small failing was the lack of soundproofing - so a noisy family in the next room managed to wake us earlier than we wanted. Would recommend to others however.", "Date": "May 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Almeria", "Title": "“Great location but noisy rooms”", "Author": "ColinaAlmeria", "ReviewID": "UR129179094", "Content": "This is a modern hotel, situated opposite the Goya metro station which leads to all the main historical sites of Madrid. The area is full of shops and restaurants. We stayed there due to its closeness to the Palacio de Deportes concert venue and would recommend anyone to do the same. The staff were very pleasant and helpful. The hotel is clean, the rooms are spacious and comfortable but is advertised as having 'soundproofed rooms' and it most certainly does not. You cannot hear street noise but, as the room floors are wooden and/or laminate, you hear every footstep, you hear voice and bathroom activity noise from next door and above and there is a disco in the basement which vibrates as high as our room on the 8th floor - most annoying and we got very little sleep.", "Date": "May 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Good Location & Value for money”", "Author": "FlipFlop33", "ReviewID": "UR128592176", "Content": "The hotel is located on the Calle Goya where you find great shopping possibilities; also the Corte Ingles is just up the road. If you head into the side streets you find loads of nice small restaurants, also really tipical ones you would expect in Madrid. So overall great area to stay either for a weekend trip but also if you go on business and have a bit of spare time. Taxis are just outside the hotel, so no problem to get transportation to where ever you need to go. Free Wifi is availble in the room, rooms are good, clean, well equiped bathroom, overall good impression. Staff was very nice and helpful as we had troubles with flights and needed to extend our stay. Breakfast on the first floor; nice buffet with good choice; good coffee!!", "Date": "April 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Lovely hotel”", "Author": "kloug17", "ReviewID": "UR128514582", "Content": "This a great hotel in walking distance from lots of shops, restaurants and a fantastic park to walk in. The reception staff were ever so kind and helpful and a reall pleasure to deal with. My Colleague had a requested a quiet room and that's what he got! the rooms a pleasantly decorated very IKEA style but I love that minimal look. They also provide toothbrush and toothpaste if your silly like me and had forgotton also a razor and comb which was a nice added touch. All in all I would definately come back and stay. One thing I would point out which is very normal in Spain is smoking is allowed in hotel rooms and there was a slight tobacco smell on entering but it didn't bother me that much.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "belfast", "Title": "“Good location, pretty standard overall”", "Author": "lesmax41", "ReviewID": "UR128436940", "Content": "I had a single room which was clean and the toiletries were nice. However, the linen was notably harsh and I don't have sensitive skin. The room was quite dark during the day yet too light at night if that makes sense. No English channels on the tv which isn't a huge deal but would've been nice. No tea or coffee making facilities. On a more positive note, all the staff were very pleasant and helpful. The breakfast was excellent too though I paid for this as part of my package so it might be quite expensive otherwise. They had a fab new coffee machine installed the morning I was leaving! Nice location, very close to the metro so easy to find and eliminates cost of taxis. However, for the standard of room I had, I think it was a wee bit expensive. I must say however, the wifi is now free throughout the hotel!", "Date": "April 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Great place to stay although quite far from city center”", "Author": "singmearainbow", "ReviewID": "UR127675922", "Content": "Stayed here for a night with my boyfriend. The hotel itself is very nice. The room was nice, very modern design, and very clean. The staff are all friendly. The location might be a problem. It's in a good shopping area but if you're interested in going to the cultural center of madrid (plaza mayor, etc), it's a little bit far. It is located about 5 minutes walking distance from the metro stop Goya which you can take to go to Puerto del Sol..but if you don't want to spend on transportation just to get to the city center, this may not be the place for you", "Date": "April 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Funky little hotel in a good location”", "Author": "Chris W", "ReviewID": "UR127135374", "Content": "The Vincci Soma is an unassuming building on Calle Goya, nestled amongst a bunch of shops. The rooms are pretty cool - funky furniture, cool lighting, glass prints on the walls. Maybe not overly huge, but comfortable. My friends got the room with the balcony, and I'd certainly recommend paying a bit more for that, as it's a great place to sit outside and enjoy the Spanish sun! The bar/restaurant is nice. The bar in the evening has a nice ambiance, good food, and nice staff. Breakfast was pretty crowded and it was completely self-serve, but a decent selection to soothe our hangovers. The location is good, there is plenty nearby, but you really need to get a cab to anywhere of note - Plaza Mayor, Puerta del Sol, Malazanya, Chueca, etc. otherwise it's a long-ish walk Once again the staff at the hotel shone through when I told them that my mobile phone had been stolen when out the night before. They kindly called the bar we'd been at and offered to help with anything we needed. Would recommend for a nice stay in Madrid.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Munich, Germany", "Title": "“Somewhere between 3 and 4 points...”", "Author": "AloneOnTheWall", "ReviewID": "UR127057714", "Content": "Stayed at Vincci 2 weeks ago and will be back today. This probably answers the point would I recommend it. So let's look at the pro's and con's: Pro - Clean - Central location - Very good breakfast (several assortments of fresh cheese, tomatos, fig mustard, very good coffee from a Jura and Nespresso coffee machine, etc.), this was the biggest surprise so far in Madrid, in a positive way. - Very nice bar, that get's crowded in the evening (good if you arrive late and need a bit of a wind down) - Fast check-in and check-out and friendly, helpful staff at reception, who try their best communicating in English Cons - if you book a single room it has London-size proportion, i.e. small, really small... I'm still amazed that rooms this size are allowed. - Although clean the rooms and particularly the bathrooms look a bit \"old\" you could say run-down. This is not at a point yet where one would feel pushed back, but it slowly get's there. Maybe it was just my room - The \"look\" out of the window was towards a run-down appartment building and it's wall, combined with serveral cables, and other \"nice\" stuff. Depends on what you do: I would have been a bit disappointed if I had been there on a private trip. For a business trip it's perfect.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "West Bloomfield MI", "Title": "“One whole week at a bad hotel”", "Author": "WeNeedRestaurants", "ReviewID": "UR126930151", "Content": "The only positive things I can tell about this hotel is its excellent location in central Madrid and its courteous staff. Otherwise, pretty bad. The room was small, sound insulation was non-existent, so resting was impossible after 6 am due to all kinds of noises coming from everywhere. The bathtub had a pretty large crack partially hidden by a clumsy patch. The shover was amply adorned by mold in-between tiles. The bar was nice but quite expensive. Finally, if you try to change dates once you are there, no problem, for double the price you can stay there as long as you wish.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wroclaw", "Title": "“OK”", "Author": "Pawel_EPWR", "ReviewID": "UR123263184", "Content": "The location of the hotel was the best and regarding the location the prices were very convenient. The staff were extremely friendly and were on hand to advise how to get around the city. The room is comnfortable and amenities in the bathroom were more than enough. Great breakfast! No tea/coffee facilities in room.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Next Time I will stay somewhere else!”", "Author": "Globalphile", "ReviewID": "UR120897792", "Content": "I was hoping to like the hotel but ended leaving very frustrated. Next time I will stay somewhere else. My room was very small, granted I am a single traveler, but my prior hotels in Spain were much larger. The rude desk clerk said of course I could have a better room if I paid 20 Euros more a night. Immediately I had issues with their wifi. I had a poor signal and I had major trouble connecting to their system for the 4 nights I was there. I am here on business and need my internet as a key component of what I am doind. Even the hard wire system in the room did not work. The heating system was horrible. I needed the fan on to mask the noise of the street at night, but even at the coolest setting the air blew out hot. I had to leave the window open while working even though all I heard was street noise below. The TV was old and remote did not work some of the time. I found the staff somewhat gruff and rude, even in the dining room. Granted this is the city, but smile and be friendly, like your team in Valencia where I am now. Also they did not have one English newspaper. Even the smaller ones in Rioja had the International Herald Tribune. And one more thing, make sure the toilet seat can stay up. The aim gets a little harder in the middle of the night!! As some of my readers in the past might know, I generally do not give out negative feedback but in this case I have to let people know that this hotels needs to invest some time in an upgrade in its finishes as well as in its electronics and technology. They might also tell the staff to lighten up and smile!!!", "Date": "November 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Espoo", "Title": "“Nice hotel, good value, especially for shopping oriented”", "Author": "JYL072", "ReviewID": "UR120693236", "Content": "Vincci Soma is located in Salamanca district and near a huge El Corte Ingles -department store. There are also streets full of small shops around so location is nice for a shopper. And location is not so bad for any visitor of the city. You can reach center of Madrid by walking or by effective metro network. Single room I was staying was nice and had everything needed. It was clean. Only problems were early housekeepers with high-heel shoes keeping noise. Disco in same building also woke me up on one night. I'm not sure if that could be avoided in some other room. As a surprise hotel also has a gym and saunas for men and women. Unfortunately mens sauna was a bit broken eg a higher sitting place was missing. Breakfast was extremely nice containing wide selection of fruits, vegetables, local ham and sausage specialties as well as traditional bacon, eggs. Also Churros with chocolate were served. Service in the hotel was generally good.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "NY", "Title": "“central, trendy, well priced”", "Author": "joanixNy", "ReviewID": "UR120663784", "Content": "centrally located close to everything and public transport, well decorated, professional service and well priced. I recommend", "Date": "November 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Downhill alert for Vincci Soma?”", "Author": "rmajumdar", "ReviewID": "UR119862368", "Content": "I stayed in the Vincci Soma in February and had a good time (albeit after they'd moved me from a noisy room with blanked out windows) so I decided to book here again on my last visit to Madrid. Unfortunately the experience this time was not so enjoyable. Despite requesting (several months in advance) a similar room to the one I'd had before I got a smaller room at the back of the hotel and on a lower floor. I was told it wasn't possible to change. Seems being a returning visitor doesn’t get you any favours. The single room although small and with a view of next door's drying laundry was clean and had a safe (although no iron). The bathroom just had a large shower but was spotless. Unfortunately I had to request soap and shampoo on the second day and toilet roll the day after as housekeeping didn’t replace them. There’s free WiFi in the hotel but the signal in my room varied between very weak and mostly non-existent. The TV quality was very poor although this was also the case on my last visit and seems to be a problem throughout the hotel. They should sort this out. I also noticed the carpets on the third floor didn't look too sparkling. Not necessarily a problem but can be indicative of general standards in the hotel. All the above were minor irritants but just about bearable. The dealbreaker was the nightclub next to the hotel. I’d noticed this on my last visit but it didn’t affect me as I was on the 6th floor. This time I was on the 3rd floor and never got any sleep on a Thursday night until the disco ended in the early hours. Very wearing. The walls were pretty thin as well so I was more aquainted with my neighbours comings and goings than was strictly necessary. If you can’t guarantee a room on a high floor I would seriously consider another hotel. On the plus side the staff at the front desk are very friendly and helpful. They even understood my poor Spanish and would switch to English when I struggled. The rates aren’t too bad and the location in Barrio Salamanca is great. Once you been to Madrid a few times it’s the ideal area to stay in. There’s a couple of El Cortes Ingles department stores nearby. There’s very few tourists around and the bars and restaurants are very good. There’s also plenty of metro stations and getting to the airport costs just a couple of Euros. I visit Madrid a couple of times a year and I’d like to stay at the Vincci Soma again but I don’t want to end up in a poor room. As it seems they can’t honour requests, even several months in advance I’m afraid I’ll have to look elsewhere. A real shame.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Vincci Soma - convenient and modern, bring ear plugs”", "Author": "keithyboyhelsinki", "ReviewID": "UR119506958", "Content": "as per other reviews, either ask for a room away from the nightclub next door or bring earplugs. It only really disturbed me on the Friday night where I went out of the hotel at 5am to see what the fuss was about only to see a large group of young individuals partying away and keeping everyone awake, must be against residential noise pollution laws but apparently the police don't care. Otherwise the hotel was nice. They did us a deal on the breakfast so we got it for 11 euros. Would say it's worth it unless you goto self catering because you don't get much change for a meal. Otherwise try the restaurant in VIPS (for breakfast looked good) - out of the hotel and turn right. Metro was conveniently located and bus tour was out the hotel and turn right. Went to some good restaurants not too far away and also Real Madrid and the Palace. Gym is also a nice touch, rooms are modern and there is a trick in making the TV work. Couple of news channels in English and safe in the room which is good and free wifi which is also good.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "jakkalsfontein, west coast. south africa", "Title": "“Small but comfortable”", "Author": "jvm64", "ReviewID": "UR118720267", "Content": "The rooms are small, comfortable, clean and the hotel is well situated. When booking specifically ask for a room away from the discoteque noise. Breakfasts are expensive. Good shopping in the area and the Metro is over the road and easy to use", "Date": "September 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Great location, pleasant, comfortable stay.”", "Author": "Smurfy71", "ReviewID": "UR118652614", "Content": "We chose the Vincci Soma mainly for its location as we went to see a concert in the nearby Palacio Deportes. We arrived by flight to Madrid airport and took the Metro to Goya station which was just across the road from the hotel, the concert venue was a 5 min walk down the Calle Goya all very easy and convenient. Smooth and friendly checkin, modern bright room on the 7th floor, well insulated by double, double glazing from the road noise outside. Comfortable bed with a pillow menu should you need. All the standard fair of a 4star city hotel, minibar, music centre, flat screen tv, hairdryer etc. It was a nice touch to have free in room wifi, not all hotels around the world seem to offer this, and i feel it should be standard in this day and age. (plus it was not slow either!!) Our breakfast was served in the hotel main restaurant, which included a large array of both hot and continental choices, served us well for the day ahead. The Vincci Soma is also well located for the heart of the city, being about a 20 min walk or 1.50€ each way on the Metro. Only negative as has been previously commented, inter-room noise could at times be heard more than normal, but it did not detract overall and we still had a good sleep. All in all a good stay, pre-booking offered good value for money for a city hotel and would return should we need to stay in Madrid again.", "Date": "September 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Washington, DC", "Title": "“Good service; sleep far from the discotheque.”", "Author": "20007", "ReviewID": "UR118368523", "Content": "The rooms are comfortable, though the walls between rooms are a bit thin. Also, there is a discotheque on the premises or nearby, so it's best to ask for a room as far away as possible. The thermostat was set to freezing in the summer, and the engineer seemed unable to adjust the temperature. Other than that, the service was very efficient and friendly. Good location, too.", "Date": "September 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Lausanne, Switzerland", "Title": "“Good hotel at a reasonable price”", "Author": "SwissCow", "ReviewID": "UR117669070", "Content": "I stayed at the Vincci Soma Hotel in Madrid for 5 nights during the Christmas holiday in December 2010. The location of the hotel is very close to the Goya metro station, in case you want to use Metro to go around the city. There is a shopping area around the hotel. The single room was very small, but they keep it clean. In my room there were a bed, a desk and chair, a removable bench to place a suitcase, a TV and music sets, an air-conditioning, a refrigerator under the desk, a wardrobe with a safe inside. A bathroom was with shower, toilet and washbasin, equipped also with a hair dryer. New towels and toiletries were provided to me every day. However, during nights in December it was too cold inside, so I had to use air-conditioning system to make the room warm. I liked the service there and the hosts were very welcoming, friendly and helpful, especially in providing directions to sightseeing places. There is a wireless internet (included in the price) available in this hotel. I took breakfast there, which was a very good one: from salty and sweet things over fruits and deserts to yoghurts, coffee and juices. For other meals, there are some restaurants around the hotel. All in all, I highly recommend this hotel at a very reasonable price.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“OK”", "Author": "e-ris077", "ReviewID": "UR117218738", "Content": "Pics of the hotel are misleading! There seems to be a public roof terrace, but this is a private one for the executive suite. Rooms are OK; small but clean. Top floor was smelly (sewer). Breakfast is good. Location great for shopping (next to H&M and Mango and the Goya shopping area). Nice cevezeria at the opposite of the hotel.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Finland", "Title": "“Good breakfast”", "Author": "morrisen", "ReviewID": "UR117037286", "Content": "Stayed here for five nights, and we where pleased with the breakfast. The room was nice, and did look like the pictures. I did however notice that the renovation was not done as immaculately as I would have expected considering their star rating. The window could not be closed completely, and the floor in the bathroom looked and sounded like it was water damaged. Was happy that they provided a safe in the room. The location was good, next to Goya metro station. The sound from the elevator and the basement disco was surprisingly disturbing some nights, but would consider staying here again.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“not my style of room, but wonderful location!”", "Author": "JagaBee", "ReviewID": "UR116105415", "Content": "stayed here for business and honestly the style of room is not my choice, but for work we were holding a function in house so that was the reason. Room wise the Vincci Via 66 I stayed was much nicer (or to my liking...) however the location of Vincci Soma was excellent! It's in the Goya/Salamanca area which reminds be of Woollahra x Paddington in Sydney. With lovely boutiques, cafes, restaurants around it is definitely the place to be. I was staying on Gran Via but much prefer this location. Even though the rooms are not what i usually prefer but size and facilities are great and comes with free wifi. Service is better at times, on arrival there wasnt anyone helping with my luggage but on check out there was... Overall would recommend this hotel for anyone on business or leisure.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Evora, Portugal", "Title": "“Great location!”", "Author": "ptomaz", "ReviewID": "UR115063171", "Content": "I had booked a room from pleasure and business - 2 nights with my wife and son plus 2 nights for business meeting. The hotel had a really great location in shopping area. Public transports were also avaliable closer. Room was big with for the three of us and equipped with all \"standard\" package in hotel rooms - safe deposit, refrigerator, tooth brush, and so on... Good value for money. The worst point was noise during night in first room. Some maintenance operations should also been done, but nothing serious.", "Date": "July 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Nice place”", "Author": "Mancio74", "ReviewID": "UR114951241", "Content": "The hotel is nice, room are clean and standard. Location is good, close to the center.", "Date": "July 2, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Peak District", "Title": "“Hugely disappointing for a four star hotel”", "Author": "ianjmorley", "ReviewID": "UR114836028", "Content": "i booked this as I wanted a decent hotel close to the centre of Madrid. What a let down. I'd booked a single room - it was the smallest room I've ever seen. I can't believe they even let these rooms out they're so small. Two electrical sockets didn't work so you could only ever have the spotlight above the bed on. The TV picture was awful. The bed sheets had holes in them. On a broader level the reception area in the hotel was very dark and ininviting. The first floor library was hot and has no windows and there is no pool, just a gym. This is really not a four star hotel.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Metro Manila, Philippines", "Title": "“Ideal Location!”", "Author": "Madrid_1st_timer", "ReviewID": "UR112478837", "Content": "My wife & I took a 3-wk trip around 5 major European cities for our 25th wedding anniversary and we stayed at the Vincchi Soma during our Madrid leg on the recommendation of my wife's brother. Initially, I was a bit concerned about the hotel's location since it seems to be situated away from Puerta del Sol. However, after having stayed there for 4 nights, I now feel that the location of this hotel is probably its strongest asset. It's along Calle Goya and within immediate vicinity of a Metro station, a bus route, supermarkets, department stores and some fine eating places. As a result, it is within a 10-minute ride to Puerta del Sol without the noise and bustle accompanying it. The room facilities were more than adequate - with a very comfortable king-size bed, strong airconditioning and strong & hot water in the bathroom. No problems encountered with the free WiFi which was accessible from inside the room. Self-service printing was easily available on a 24 hr. basis from the hotel's well-designed library on the 1st floor. Reception staff were approachable, professional, efficient and helpful - particularly in providing directions to sites, suggesting bus routes, etc. The hotel is clearly marked from the outside - though it has quite a narrow facade and its lobby is small and not very well-lit. Some suggestions for improvement: a) Provide an electric hot water thermos + free coffee sachets in the rooms. A number of hotels provide this for free. b) The stereo equipment takes up almost half the writing desk - which makes it less comfortable to set-up one' s laptop. c)", "Date": "June 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "mallorca", "Title": "“Highly recommendable¡¡¡¡¡”", "Author": "SophieMallorca", "ReviewID": "UR108334722", "Content": "Highly recommendable¡ Location is excellent, room and restaurant absolutely wonderful¡¡¡ We were surprised by the variety and quality of the breakfast. We are very grateful to the reception staff. This was a very special journey for us and the reception was very professional and kindly helped us with all our doubts and questions. They offered a lovely room and made all the efforts to make of our holidays an unforgettable experience. We will go back soon¡ Thanks¡", "Date": "May 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Good, not great”", "Author": "Lanie54", "ReviewID": "UR104703930", "Content": "My husband had a conference that was taking place at this hotel, so I came along for the ride. The location is terrific -- the Salamanca neighborhood is lovely, smaller streets, beautiful architecture, lots of shops, restaurants and services. Yet it's still close enough to walk to all the major sites. it's just a few minutes to the Retiro Park and maybe 20 minutes to the Prado and Thyssen. I easily walked all the way to the Palace and back, but for those who don't walk much, there is easy metro access. We liked the area much better than the hotels that are in the mobs of tourists around the museums, Puerta del Sol etc. The positives about the hotel? The price is right , the rooms are well-kept and decorated in a modern style, free wifi worked perfectly, and the 2nd floor breakfast room/restaurant is very nice, especially in the daytime when huge windows let in lots of light with a nice view. The breakfast buffet is excellent (it was included in our rate so I don't know what it costs a la carte) and the service at breakfast was very good. Plates were removed quickly and buffet offerings were kept filled and tidy..and were never felt rushed. The adjoining bar area is nice for a relaxing chat. The places to improve? The entrance/lobby is like entering a dark cave (first impressions count!) and we never found the front desk staff to be terribly warm and friendly. They certainly were not rude, but we didn't feel any \"warm embrace\". For example, we asked for a map, but no one went the extra step of opening it up, circling the hotel, etc. (That did happen in subsequent hotels in Spain on this trip.) The rooms (I assume we were in a standard room) were quite small, with a ton of stuff jammed in (the nice work desk was half covered with radio/stereo equipment!). You might want to spend a few dollars more for some space. Our room faced an interior courtyard, so it was quiet, but also very dark; think about asking for a room facing outdoors. And last but not least, the room was stifling! We had the air conditioning on at all times, but it never got cool -- don't know if it was the time of year (late March, maybe the system wasn't switched over yet?) or what, but many of the conference attendees said the same thing, so it was not just our room. We probably would not return to the Vincci Soma, but a lot of that has to do with the fact that Madrid's hotel rates are much lower than London, Paris or Rome and you can get higher quality for what we think is still an acceptable price.", "Date": "April 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stuttgart, Germany", "Title": "“very relaxing”", "Author": "Delbert53", "ReviewID": "UR104402427", "Content": "We booked a standard room at the Vincci Soma for our last day in Madrid. Upon arrival we were told by the friendly woman at the desk that all the rooms had been taken, so we were upgraded to their last available room. An older gentleman behind us, whose job appeared to be to carry bags, seemed concerned that we were getting an upgrade, with the desk clerk telling him it couldn't be helped. I didn't understand what the man had to do with my check-in, but as we received the key and headed to the elevator, he made no attempt to take our bags and simply pointed to the elevator. Actually, I always prefer to take my own bag, so this was ideal. The room was incredible....a junior suite, perhaps...outside terrace on the 9th floor with automatic awning, lanterns that could be lit at night if you had the votive candles, amazing shower and separate tub. Having been exhausted by all our walking through Castilla-Leon the prior week, this room was an oasis for us. The \"problem\" was that it was so comfortable, we couldn't leave it except to head out for food/wine to bring back and enjoy w/a view of the Salamanca district. The king-size bed was so comfortable, I slept for nearly 12 hours. I was happy the check-out was at 12:00. Needless to say, I returned to Germany fully rested. Check-out was smooth and friendly, with a young bellman storing our bags and later taking them outside for us, pointing the way to the Goya station. The hotel's location is great, especially if you're headed to the airport the next day(s). Catch the Goya line across the street with one change to the pink line, and you're at the airport, in 30 min. and for 2 euro (including a 1 euro supplement at the airport). The streets in this neighborhood are tree-lined, lots of fashionable shoe shops, tapas, more \"real\" than the very center of the city, which is easy to reach on foot or by subway for 1 euro. The subway system is idiot-proof. Anyone can figure it out. The hotel's comfortable library had two speedy laptops with printers, free use. There was also a fast and free WiFi in the room. I would return, and I would get the junior suite without hesitation.", "Date": "April 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lanzarote", "Title": "“Nice Hotel and perfect location”", "Author": "Eileeniz", "ReviewID": "UR101264384", "Content": "It is the second time I go to this hotel . I think is really good . The only thing I did not like about the Hotel is that room lighs are very poor. You can hardly read , specially when you turn them on", "Date": "March 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“well located comfortable hotel”", "Author": "alzoy", "ReviewID": "UR98802555", "Content": "Travelling with children aged 13 and 10 this was a comfortable hotel with spacious clean rooms. The staff was friendly and courteous and ready to help.Good shops both for shopping and eating nearby.Taxi rank just outside the hotel.The walk to the Retiro park , Peurta de sol ,the Real palacio was wonderful with good weather helping.", "Date": "March 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great hotel, excellent service”", "Author": "92456", "ReviewID": "UR98115237", "Content": "Neat, clean + tidy with comfortable beds, lovey crisp sheets. Quiet rooms with windows that open so you can get fresh air if you so desire...very nice. The bathroom has a wonderful long bathtub ... the service here is excellent. Breakfast is delicious and the location is really great. Metro station is across the street and all around you is terrific shopping and dining. I will be returning in April for a longer stay and am very much looking forward to it!", "Date": "February 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Aylesbury", "Title": "“Modern hotel at a great price”", "Author": "MunkyJay", "ReviewID": "UR92707159", "Content": "I booked this hotel for a five night stay with my wife. The check-in was easy and quick. We took the metro to get here - make sure you use the Centro Comercial exit to find the hotel! The rooms are modern, with large beds, TV and CD player. Very clean and tidy hotel. Still looks pretty new. Reception staff don't always appear very happy, but they are always helpful. Great value for money compared to other hotels in this class.", "Date": "January 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Arizona", "Title": "“Falls short of expectations”", "Author": "monacal", "ReviewID": "UR88636235", "Content": "This hotel is located in a select area of Madrid, close to metro and fashionable shops. However, I would not return there. I found it short of expectations, especially if one is guided by the photos in the internet. The lobby is a small dark area with treacherous steps owing to the poor illumination. In general I found the hotel dark and somber. Walls painted in grey, carpets already showing a lot of dirt. The rooms are small and sparingly furnished in a so-called \"modern frugal\" style. As compared to other hotels I stayed in Madrid I found it over-priced and I will not return to it. One positive comment: the breafast service was good and the restaurant has a pleasant atmosphere. Also, it provides free internet service but despite this, the gloom all aorund me put me off. Overpriced for what it offers.", "Date": "November 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "ontario", "Title": "“Quiet, no surprises, very nice indeed.”", "Author": "lettienets", "ReviewID": "UR85963462", "Content": "I spent two nights here, solo traveller at the end of my trip. First greeted very efficiently by staff and then helped myself to a delicious fresh apple from a bowl at the desk, and then a bellman took my luggage up to my room. Although small, on second floor it was spotless, with crisp good quality sheets and the bathroom had lots of little amenities. Window in bath and bedroom, faced a rooftop but that was ok because it was quiet. There was a little ante room by the bathroom so you never got noise from hall. Mini fridge had jelly candy! Staff spoke English. Knew the time of Mass at the nearby church too. Very upscale neighbourhood for shopping.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Great Hotel in Madrid”", "Author": "tpilcher1", "ReviewID": "UR84902094", "Content": "My friend and I spent three pleasant nights at this hotel in mid-September 2010. We were both happy with the accommodations and the hotel staff. The hotel is clean, modern, and well-located. Easy access to Retiro Park, Metro, and city center. The hotel rates, which we had locked in several months before arriving, were amazingly low given the high quality of the rooms, amenities, and the always helpful and pleasant staff. I had read a few negative reviews about this hotel on the web, especially regarding the hotel staff, but we found everything and everyone there to be perfectly agreeable and obliging. Staff allowed us to check in early after our arrival from U.S. Loved the library, free newspapers, and the wifi access, which worked well even on the ninth floor. I’m a 44-yr old male living in DC, well-traveled, Spanish-speaker. I would not have taken the time to write this review if I did not feel that the hotel and it’s staff earned my gratitude and admiration.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "1.0", "Value": "1", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ny", "Title": "“Don't stay here, foreigner”", "Author": "sortiz06", "ReviewID": "UR84367432", "Content": "A very unhelpful and rude staff, especially the reception staff. It also seems that the hotel has connections to thieves as someone came into our room (with a key) and stole some of our goods (including cash) and after it was reported the hotel, management did nothing to help the situation. In fact we were pushed aside as if we were the culprits. Do not do it to yourselves. Also no free wifi. (you have to pay 24 hours)", "Date": "October 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great Hotel - lovely location”", "Author": "Goggo99", "ReviewID": "UR80831474", "Content": "My husband and myself stayed at the Vincci Soma for 4 days in September. We have stayed at the hotel on previous occasions and the experience this time was as pleasant as it always is. We arrived well before check in time but were given our room straight away, the reception staff is friendly and efficient. The room we were allocated had a huge corridor leading into the bedroom, making the room feel very big. Really comfortable beds with lovely soft sheets and very quiet. I can highly recommend breakfast at the Vincci Soma, there is a vast choice of fresh juices, wonderful fruits, cold meats, salmon, cooked breakfast, cakes and much more. Also, the hotel has a very nice bar where you can relax with a cold glass of wine before going out for the evening. The location is excellent, Salamanca has a great atmosphere and wonderful shops. Goya Metro station is right across from the Vincci Soma. On the day we were due to check out I asked if I could have a later check-out which I was immediately granted, very nice! I am very happy to recommend this hotel.", "Date": "September 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, England", "Title": "“Brilliant location, brilliant rooms, brilliant price”", "Author": "Tajine", "ReviewID": "UR73877068", "Content": "The Soma Vincci is situated in the Salamandar area of Madrid in Goya. It’s very easy to get to on the metro so no need to waste money on a cab. The hotel is next to El Corte Ingles as you come out of the tube and look down Goya. First thing I noticed was the area is really nice, chilled and relaxed with posh shops and cafes but very central, you can find Prada, H&M and a variety of other boutique stores along Goya. The hotel is great and a total bargain in Madrid city, all things considered it’s one of my top hotels for location, style and value for money. The reception is small but modern, as is the whole hotel. Front of house upgraded me from a single to a double and happily got me knives and forks and napkin for my take away supper. They seemed professional and friendly. The room itself was modern and minimal. The bathroom was very clean with a bath and shower. There were lots of freebies in the bathroom, a bit more than you would normally get. The bed was two singles together and was really comfortable with nice linen and an assortment of pillows – There’s a pillow menu if you are really fussy. I used the minibar in the room because I arrived late and was dying of thirst – It was very expensive and definitely not recommended as El Corte Ingles has a supermarket where things are much cheaper and it stays open until 10pm. The room has a comfy modern chair, clean wooden floorboards and a flatscreen tv with a few English channels. The room was also airconditioned. All in all this place is a brilliant find and I will most certainly be returning. I found the room very very quiet maybe as I was at the back of the hotel. One point that may be an important one to note is that my room really, really smelt badly of tobacco. I would have moved room but I arrived at 1am and was feeling exhausted and they’d already been polite enough to upgrade me – I didn’t have the energy to make a fuss. While I was in the room I didn’t notice the smell too much but each time I came out and returned it shocked me how bad the cigarette smell was. You may want to insist on a non smoking room, however the whole of Madrid is pretty bad when it comes to smoking!", "Date": "August 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Nice hotel - great location”", "Author": "sborkar", "ReviewID": "UR69224137", "Content": "Nice location, great staff - would stay there again next time in Madrid", "Date": "June 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "mumbaikar", "Title": "“Home away from home”", "Author": "darrypars", "ReviewID": "UR68924606", "Content": "We had the good fortune of spending 3 nights at the vincci soma in mid june and came away very happy. Due to a server glitch our booking for three rooms was unavailable to them however, the reception staff who recognised this as a genuine error gave us three rooms, one an apartment, one a superior room and one a standard room. the apartment turned out to be a boon for us because we had that much more room for family time together. They also included breakfast for the standard room which is not normally the case. The staff and the bell staff also broke through the language barrier to show us the way to the nearest supermarket and restaurants... The location is in a very stylish part of town away from the madness of the city and yet only a kilometer away.. located a short walk from reitro park which was the highpoint of our trip. The breakfast was lavish and complete and the serving staff also volunteered to wash our baby serving vessels which was very touching. All in all it was a home away from home for us travelling to a foreign city with no one in our party knowing spanish...cant wait to get there again and stay there...", "Date": "June 28, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Rome, Italy", "Title": "“Unfair behaviour”", "Author": "mgrazian", "ReviewID": "UR67344768", "Content": "The hotel is good and its position is really convenient, even if breakfast can be considered expensive, but we had a bad experience in it. During our check in at the reception desk one of our bags was stolen. The hotel video camera was not working and nobody of hotel staff saw anything. The hotel staff made our sure they should have made aware their insurance company about the fact and we should have get a reimbursement. But after we had gone they never answered to our emails and we've got no news from them. Obviously now I've no hope to receive even a minimal reimbursement from their insurance because 3 month have passed. So my advice is: be carefull during the check in operations...some thieves could be in the nearby!", "Date": "June 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kansas City Missouri", "Title": "“Terrific Location, Free WiFi”", "Author": "KCTraveler50Plus", "ReviewID": "UR65751749", "Content": "Location, location, location! This hotel is within walking distance of most of the major museums in Madrid, a prime consideration for us. And the hotel's neighborhood is terrific -- reminds me of the Upper West Side in NYC. Pharmacy, H&M right next door, metro down the block, El Corte Ingles department store about 2 blocks away, cafes, magazine stands -- all within 2-3 blocks. The bed was very comfortable, the wifi signal always strong (or prime importance to me!), the water pressure was great (of even GREATER importance to me!). Had an inner room on the 5th floor, very quiet. All the usual amenities -- hair dryer, room safe, shampoo, etc. Would definitely stay here again.", "Date": "May 29, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Good location...and that's about it”", "Author": "crazy4nature", "ReviewID": "UR60565889", "Content": "I stayed at Vincci Soma during a business trip in February. The location is very convenient, on a busy street with quick access to metros, taxis, buses, restaurants, ATMs, boutiques, etc. The lobby was dark, front desk staff uninterested in helping, heavy smell of cigarrette everywhere, particularly at the restaurant. Room was very basic, with Ikea furnishings, heater did not work. If you choose this hotel, make sure you ask for an interior room as there is plenty of noise from the street and the discoteque downstairs. Breakfast and dinner were adequate. Definitely not good value for the rates, won't be staying here again.", "Date": "April 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Cincinnati, OH", "Title": "“Great location - mediocre hotel”", "Author": "martian13", "ReviewID": "UR51074033", "Content": "Pros: Clean room Great location Sometimes helpful staff Strong wi-fi signal Close to the subway. Cons: Ordered a double bed, got two twins pushed together. We slept like that for a week because they had \"no other rooms.\" Their public computers where one worked and the other was broken. (I wasn't going to lug my laptop over. I'm really glad I did.) We lost our hot water for a day. Room too small to relax. We stayed out of it most of the time. I won't complain about the price. I bought as part of a package. We didn't eat at the restaurant. Only bothered by the disco one night. I recommend this only for location, and it's not a flea-bag hotel", "Date": "December 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Atlanta", "Title": "“BASIC AND CLEAN”", "Author": "ChloefromGA", "ReviewID": "UR46745315", "Content": "Wanted a safe neighborhood and close to the metro, and this hotel did it. The room at the top floor was very quiet... althought the first night, the neighbors next room made quite bit of noise till 3 am. Soft, clean and fresh bed everyday, clean and efficient showers. We used the free internet computers in the library (which was almost empty during the day) to get in touch w/ everyone at home. Decor is very basic (felt like a hostal more than a hotel) but we just came to the hotel for sleep and shower anyways. TV with local and foreign channels, stereo, hair dryer, toiletries, fresh towels daily, and room safe (very useful). We had a nonsmoking room but cigarette smoke lingered in the halls and rooms... perhaps from old times or unrespectful guests... A great simple sandwich shop and cerveceria across the street, el corte ingles next block, Zara and H&M clothing store (in case of emergency, ladies ... so affordable, chic, fashion) right next door to the hotel. There is also a pharmacy that is open 24hrs... all these within 2 blocks. About 20-30 min. walking and metro ride to Puerta del Sol... a little inconvenient if you need to stop by the hotel couple of times a day. We went to a bullfight (Plaza de Toros) walking from the hotel.. in about 30 min. - or direct metro line 10min. or less. This is a great location for shopping, metro connections, safety and for those budget conscious.", "Date": "October 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Great Stay!!”", "Author": "jrich00", "ReviewID": "UR34296918", "Content": "First off- I loved Madrid! I loved my room at Vincci Soma!!- it was clean, had a contemporary decor, was spacious and very comfortable. The ONLY complaint I have was the thin walls, as it was annoying hearing what the people in next room were watching on TV and when the hotel club is open you can definitely hear the music. But aside from that- the hotel was located in a great area, the staff was nice, the hotel was beautiful. FREE wi-fi internet service in the rooms! It was just an all around GREAT vacation! I would definitely stay at Vincci Soma again!!", "Date": "July 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Great location, great hotel shame about the noise”", "Author": "Summer027", "ReviewID": "UR31837792", "Content": "Location is fantastic - 2/3 minute walk to the Goya metro station which is only 4 stops to the centre of Madrid. You can walk to Retiro Park (similar to Hyde Park) and there are lots of fab clothes shops on your door step. Hotel is clean, spacious and great chic decor. Free internet in the library and nice cafe/resturant. They even have a mini gym. Staff is freindly and helpful. The only downside is that if you are a light sleeper the noise from the nightclub in the basement is rather loud. I stayed on the 3rd floor and you could really hear it esp. on Friday and Saturday up until 6am! I'm happy that I sleep rather soundly despite the noise and only noticed it on Saturday when I woke to a particular song! All in all it was fab and I suppose if you want to go to a club, it would be quite handy to have a boogie next door. If you stay at this hotel request a high floor room as this might help block out the noise.", "Date": "June 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York, NY", "Title": "“Simple. Chic. Charming. Beautiful Hotel = A Simply Perfect Vacation!”", "Author": "holdynb", "ReviewID": "UR31011650", "Content": "Amazing, in every sense of the word. We were very nervous about staying at this hotel because European hotels that have seemingly high stars on sites such as these generally have tiny rooms and nothing special to offer. Vincci SoMa shattered this notion in every way. One of the best things about this hotel is the LOCATION! Don't stay on the loud crazy tourist filled Gran Via and Centro Madrid, stay HERE! the barrio (neighborhood) Salamanca in Madrid is like the Gramercy Area/Murry Hill Area/Upper East Side of Manhattan, very, very chic. It is also close to the Goya Metro stop (connects you easily to any line, it is so simple to use, I live in NYC and often found myself in awe at the ease)so within 15 minutes on Madrids Great metro you are in the city's center with all the tourist and hot spots. Then you can return to your hotel which is on quiet but beautiful tree lined streets with stores from Gucci, Blvgari and Prada to H&m and Zara, you really could simply explore the area of the hotel and have a great time. In fact the bus tour goes through the area the hotel is in because it is so nice! For a great affordable price we had a nice spacious double (queen sized) room that was beautifully decorated with simple, chic decor. From the closet to the bathroom, no detail goes unnoticed. I loved how simple the decor was, but it was chic, not dated at all like some \"simple\" hotels in the USA with furniture that looks like it should have stayed in the 70's. The staff was great, spoke perfect english, and were always willing to help us no matter the time of the day. The cleaning staff did an excellent job cleaning our room and whenever we passed them in the halls they had the biggest smiles and the friendliest greetings. Only con, tv is small, and only had two English channels that were bbcnews and cnn-UK. But, that is good since you are in a great city so go out and explore! Free Wi-fi internet in the hotel made up for it so bring your laptop and easily plan your days out or stay connected!We had a nice room on the 8th floor so didn't hear any noise from the street or other rooms!! The entire hotel was calm and quiet, just perfect!", "Date": "May 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "london", "Title": "“good but beware the disco”", "Author": "jeff22London", "ReviewID": "UR29370532", "Content": "I endorse previous comments; it's a bit out of town but right on a direct metro (3/4 stops). However, we bothered by disco noise from the hotel basement, despite being on the 5th floor.", "Date": "May 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "London", "Title": "“Nice rooms, good for transport links”", "Author": "adventurerette", "ReviewID": "UR23249166", "Content": "I booked this hotel primarily because we got a deal that looked good value for money - it looked good on the website, too. Style: a fairly minimalist hotel, but with lots of lovely touches. The staff there were very friendly and helpful. Rooms - our twin room had plenty of space for us both. Big wardrobe with lots of storage and a safe. Great big bathroom with amazing shower and a good deep bath, and some nice toiletries too. Beds were really comfortable with crisp linen. Good flat-screen wall-mounted TV (with a couple of English language channels) and a lot of other space beside that. Nice style to the room - good lamps, and felt modern. Food - we didn't eat there, so can't say. Facilities - the only one we used was their left luggage room (free!) but they had a pleasant library, bar and restaurant. Cleanliness - absolutely spotless Privacy - very private. We couldn't hear anyone, and it was well insulated with double glazing from the traffic noise outside. Presumably the air conditioning in the summer means that the windows can be kept closed then, too! Location - really handy for the Goya tube, but this isn't in a central part of town so if you want to get to a few bars/cafes then you have to travel. If you want to be able to just \"pop out\" to some nearby bar hopping then you'd probably have to pay for somewhere more expensive to get the same level of quality. The area is a nice area, though, close to the Parque del Retiro for a lovely 20-30 minute saunter over to the Prado. Overall: would recommend if you manage to get a deal and you don't mind hopping on the metro to get to places.", "Date": "January 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Clean, large modern rooms near great restaurants and metro”", "Author": "WheretonextBOS", "ReviewID": "UR21479105", "Content": "Very clean, modern hotel in a convenient location. The beautiful park is nearby and the Goya metro stop only a block or two away. We had tapas at a great tapas place that was not a tourist spot at all - Carzola at General Pardinas 80. Dinner at Focolare General Pardinas 40 which I enjoyed as well. The hotel room was very large and appealing. The window overlooked busy street but even on a Friday night the noise wasn't bad. WiFi was very slow. Our room was non-smoking but a large amount of smoke smell found it's way into the room in the middle of the night. We didn't complain so I can't comment on hotel's response but if there is a non-smoking floor you may wish to request it. 30 euro cab ride to the Airport - took us 15 minutes at 6:30am on a Saturday but I would plan for longer at other times.", "Date": "November 2, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Glasgow, UK", "Title": "“Great experience”", "Author": "DHogg", "ReviewID": "UR18579841", "Content": "I stayed at Vincci Soma hotel, in the Salamanca district of Madrid with my girlfriend. It was modern, convenient (just over from Goya metro station) and made our stay in Madrid very easy and enjoyable. The room was relatively small, but to be expected for a central location at the price we paid. Decor was modern, simplistic and inviting. The bathroom was to a high specification, no problems there. The hotel catered for a wide range of guests, from businesspeople to tourists like ourselves. The reception was helpful, spoke good English and operated a good concierge service. Highly recommended, as is Madrid - a great city to explore!", "Date": "August 3, 2008"}], "HotelInfo": {"Name": "Vincci Soma", "HotelURL": "/ShowUserReviews-g187514-d190572-Reviews-Vincci_Soma-Madrid.html", "Price": "$94 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Calle Goya 79</span>, <span class=\"locality\"><span property=\"v:postal-code\">28001</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "190572", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/73/53/06/terraza.jpg"}}