{"Reviews": [{"Ratings": {"Overall": "2.0", "Value": "2", "Service": "1", "Location": "3"}, "AuthorLocation": "San Francisco", "Title": "“AC Santo Mauro not friendly to families”", "Author": "SeveJ", "ReviewID": "UR139098321", "Content": "I booked a room for a three night stay at the AC Santo Mauro and found out when I was checking in that they would only allow three \"people\" in a room. I was checking in with my wife and two young children (under 8 years old) and they wanted my to pay for another room. The property is well located and nice looking, but clearly not welcoming for families. I also thought the staffs handling of the problem was rude. There are many other options with better location and amenities for the price in Madrid.", "Date": "September 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent”", "Author": "Sallymcchat", "ReviewID": "UR138853263", "Content": "This is a beautiful and extremely elegant hotel. Although it is part of Marriott it doesn't at all feel like it as it has it's own personality. The rooms are very large and contemporary and the inside public areas are very nicely appointed. We visited this hotel in summer but I would imagine it would be equally beautiful in winter as it is very welcoming. The girls on the front desk are very very helpful. If possible I would request a room in the main part of the hotel but these rooms are probably more expensive.", "Date": "August 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Clinton, New Jersey", "Title": "“Triple A service, great experience”", "Author": "Djexis", "ReviewID": "UR136432609", "Content": "Stayed here while on business in Madrid. Had a room on the second floor, king bed. Room was clean, iPod dock (tower) was a nice touch. Very large flat screen tv was nice. Bathroom was clean and recently renovated. Only thing I missed was an iron and ironing board, but being a five star hotel I suppose I shouldn't have expected one. Regardless the hotel staff were extremely attentive and ironed my shirts in 30 minutes or so. Pack an iron if you are traveling for personal holiday, and don't want to pay 11 euro for each shirt. Wish I could have swam in the pool, looked beautiful. Breakfast was a bit pricy, 18 euro for continental breakfast, but the rolls and pastries were fresh and tasty. I wouldn't hesitate to stay here again.", "Date": "August 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Beautiful property - excellent service!”", "Author": "gatrjeny", "ReviewID": "UR134094500", "Content": "I absolutely loved staying at this hotel. The location wasn't exactly in the center of the city -- it was a couple of train stops away from the center, but the location was sufficiently close to the metro and to the center of the city. Upon check-in I was handed my room in the second floor and unfortunately we had some issues with the A/C in that room and after our first night we requested it to be checked and fixed. After a visit from their maintenance man and an inability to fix it, we were moved to another room. The second room was located in the lower level of the other building and although the room was bigger and more comfortable (the A/C worked to perfection) it was a pain for luggage as we had no elevator and had to take multiple stairs (up and down and up again) to exit the other building and enter this new one. Although this was a bit of an inconvenience, it did not create a bad experience. The staff was very accommodating and took care of the situation quickly and efficiently. I enjoyed the property most of all. The building is set in a tranquil landscape with a beautiful surrounding. The backyard patio almost had a spa feel. It seemed like a modern day palace. And I think it had some history to that effect. The lobby is small (hotel is small, so makes sense) and the dining room and sitting rooms in the lobby level are beautiful... Plenty of sitting and lounging areas to make for a comfortable relaxing atmosphere after a hectic day of walking the Madrid streets (and taking excursions from the city as well). I would recommend this hotel to anyone looking for a beautiful relaxing ending to their busy madrid days.", "Date": "July 11, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Pricey, but spacious.”", "Author": "skohn", "ReviewID": "UR131830632", "Content": "Rooms were very spacious-- bathroom was huge plus a separate walk-in closet! There was a big tub and a large shower. The rooms are spread out across the property-- we were in an area that had a single staircase to only two rooms (ours and one other). Beds were comfy. Fresh flowers in the bathroom were my favorite perk! (Although they didn't have any washcloths and there wasn't an iron to borrow on-site either.) The outdoor patio on the grounds is lovely- with large umbrellas misting you in the hot, hot weather. Some of the rooms are under construction so request one away from any potential noise. Being a big jet-lagged I slept in until 11AM on Friday morning and was awoken by hammers banging. Hard to complain since it was 11AM, so just try to do what you can to avoid the situation all together. The one downside is that you feel a bit nickeled & dimed. The inviting bikes were something crazy like 25 Euros for 30 mins, the WiFi was outrageous and the mediocre drinks at the bar were very expensive.", "Date": "June 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Like staying in Versailles”", "Author": "retiredtravelwriter", "ReviewID": "UR131589024", "Content": "I've stayed in a lot of splendid boutique hotels, but never one as unexpectedly serendipitous as this one! From the outside it looks like an elegant family home of a wealthy aristocrat rather than a hotel. But if was not until we went inside that I was really blown away by the elegance and charm of this incredible hotel. Its now part of the Marriott group but even the JW Marriotts or Ritz Carltons cannot come close to matching the splendour here. Only later I found that it had been the home of the Count of Santo Mauro, and after that the Portuguese embassy. It then became the jewel in the AC hotel chain's crown, and with the Spanish economy in free-fall, Marriott has recently bought this chain. The rooms are spacious, beautifully fitted out in classic-modern style, and the hotel is located in the best and safest area of Madrid, and in walking distance of the city's most elegant shopping. Breakfast is served in the dining room which is a \"must-do experience\", because this dining room was originally the Count's library which has been only slightly modified and is absolutely splendid, as are all the reception rooms in this hotel. The food is excellent, Spanish/international cuisine, though the service still has quite a bit of room for improvement. I am not likely to review any other Madrid hotels, because I'm most unlikely to ever want to stay anywhere else. And the room rates at this time are possibly the best value for money for a super-luxury hotel that you will find in Europe.", "Date": "June 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bethesda", "Title": "“Splendid Hotel”", "Author": "Mike-Bethesda", "ReviewID": "UR130854127", "Content": "We spend three nights at this hotel and were extremely pleased. It is 5 minutes from a metro station but we found it very easy and pleasant to walk to the city center from there ( Plaza Mayor is about a 25 minutes walk) The hotel is truly a 5 star property in every aspect. It is very private as they only have 49 rooms, so you will not see too many people around, but if you are looking for a romantic stay in a great hotel that was aristocratic residence in the 19th century than this is one of the best places that we've stayed. The common area of the hotel is breathtaking. The salons, restaurant/bar, gardens are as nice as you can get. The rooms are great and it gave us the feel that we were the guests at some palace. They even have a small indoor pool. Highly reccomended.", "Date": "May 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“A little stuffy, but very large rooms”", "Author": "Dave L", "ReviewID": "UR129138757", "Content": "We had free nights with Marriott and stayed at another property in Madrid 3 other nights before we left for Portugal. We chose to try the AC Santo Mauro on our return trip and used points. They gave us an upgrade to a Superior Room - which means that it has a king size bed and is a little larger. The hotel is an old palace and has been remodeled since to create the hotel. The staff explained the hotel has been a Marriott property for approximately a year (as most of the AC hotels are such). The staff is friendly, but they mostly cater to an older clientele - so expect them to act as such. If you check out the website - it is exactly how it looks. The lobby consists of formal living rooms all decorated to period. The bar is nice, but dark and the staff is friendly. Each of the rooms is clean with all the amenities including a free mini-bar. The rooms are huge. Internet is free in the common areas, but there is a fee if you want to use it in the room. Staff will be helpful getting you to where to need to go. Things we liked: - Very large rooms that have modern updates, but still feel like the period of the hotel - Sitting area in each room with large tv and plenty of English speaking TV stations - Free mini bar - Clean Rooms Things that we didn't like: - Staff is friendly, but overall a pretty stuffy (formal is a nice way to put it) - Expensive if you don't stay with points - but you will get a nice hotel - Location is a little out of the way, but not hard to find a taxi", "Date": "April 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Guilford", "Title": "“Great Historic Hotel in Great Neighborhood”", "Author": "Gandalf610", "ReviewID": "UR128330758", "Content": "This is a great Hotel and is full of the History of Spain and Europe. It was the former home of a Duke and includes the mansion, library, and Ballroom. Even the stables have been converted to top shelf Hotel rooms. The staff is very friendly and the location is convenient to major shopping venues. I would not recommend brining young children.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chadds Ford, Pennsylvania", "Title": "“elegant”", "Author": "dickpat", "ReviewID": "UR128175563", "Content": "Marriott has recently taken over the AC hotels and we found two in Madrid that were available on our dates using points. We would never have spent the 300 plus Euros for a room. The 50 room hotel is truly elegant and a bit more formal than our taste. It is located in an Embassy district and very convenient for the tourist. The Clientel seems to be upscale business travellers. the public rooms and dining room are very formal while the gardens are very relaxing. The staff was pleasant and helpful. The pool and fitness area were excellent and we were the only ones that seemed to use them. Not a place to take the kids. The taxi fare to the airport is about half what their literature tells you.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sofia, Bulgaria", "Title": "“The best hotel in EU!”", "Author": "MarielaNordell", "ReviewID": "UR126943494", "Content": "The best hotel and best hotel service in Europe! Im soooo impressed! Highly recommend this hotel! Amazing place, great service, perfect staff!", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Birmingham", "Title": "“Excellent relaxing stay”", "Author": "pnireland", "ReviewID": "UR122775680", "Content": "Stay at the hotel for 5 days over the new year. I used Marriott points to book the room, but paid to upgrade to a superior room in the main building. The room was spacious, with a very large TV and 4 comfortable chairs and a separate 'dressing room'. The room was very quiet - it was end of the corridor and it overlooked the garden. All of the staff (reception, concierge and restaurant) were extremely friendly and helpful. The leisure facilities are good and it was nice to relax in the pool before going out for the New Year celebrations. The hotel is a good 15 minute walk from the old Town, but just a short walk to the nearest metro (Ruben Dario) that takes you to the main tourist areas. Also there is a Carrefour just down Calle de Zurbano, which was useful to buy alcoholic drinks for the room (only soft drinks in our minibar). Overall, an excellent stay in a quiet part of Madrid.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Beautiful hotel, beautiful room.”", "Author": "Rachelle1950", "ReviewID": "UR120764343", "Content": "My husband and I stayed with my daughter and her husband at the AC Santo Mauro in Madrid in October 2011. A recently renovated ducal palace, this beautiful, small hotel went way beyond expectations. Our rooms in the historic guest house were gorgeous. The service by the low key professional staff was excellent, and breakfast in the walled gardens was delicious. What a nice surprise! And a great location, with a beautiful cocktail lounge to relax in before going out to a late night dinner. We always felt safe in this area of Madrid, but I still appreciated that the hotel kept a man on street duty to greet guests' late night taxis. I can't say enough about the lovely, traditionally decorated common rooms and gardens, as well as our huge bedroom which was sleek and contemporary, and incredibly clean. If I ever find myself in Madrid, I will return.", "Date": "November 18, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "London", "Title": "“Beware the bureaucracy of Marriott Central Reservations”", "Author": "Nigel26", "ReviewID": "UR120751101", "Content": "I wanted to revisit this hotel in February 2012 and telephoned the reservation number from the website only to find that this was a central reservations desk for Marriott and the individual to whom I spoke could not answer questions about the accommodation. She gave me an email address for the hotel and I emailed my request.No reply. My next email to Central Reservations produced a helpful reply promising a direct rely from the hotel who had been copied in but on a different email from the one I had originally been given. No reply again. My final email produced a patronising step by step guide to making an online reservation from Marriott Customer Care. Still no answer to any of my questions. My reservation of a suite will now be made elsewhere. An attractive boutique property has already seemingly been ruined by a generic hotel chain.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Disapoiting”", "Author": "paulus70", "ReviewID": "UR120453601", "Content": "I was expecting more , the room was nice but not in the main building. Service slow non existant. Breakfast very poor. The pool beautiful but a bit too much chlorine.", "Date": "November 11, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Lovely old world charm”", "Author": "SAMD_10", "ReviewID": "UR118290857", "Content": "This was a perfect location for us. Our daughter is studying abroad this semester at the International Institute, just a few blocks away. We used Marriott points to get a standard room, then paid to upgrade to a much larger room. It was worth it, the room was very spacious. Internet was 12 Euros for each 24 hours in the room, but there is free internet in the lobby area on the first floor. The people at the concierge desk were very nice, and most spoke enough English to understand us. My only complaints were that one night we came back around midnight to find that the housekeeping staff who did turndown service left our door unlocked and opened a few inches, and on another occasion, the person checking the minibar walked right into my room while i was getting dressed without knocking. My door had been locked. Other than that, the hotel was a perfect location to the metro, just a 5 minute walk. I would stay there again if i came to Madrid.", "Date": "September 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Menlo Park Ca", "Title": "“Great...in most ways”", "Author": "suz_c_mitchell", "ReviewID": "UR115224257", "Content": "Beautiful old estate, picturesque, and a healthy walk to everything. Great front desk but no concierage level. Only a few speak English which had us curious--since the marketing of the spot came up my Marriott email. Although the European way is to have long enjoyable meals, I think 45 minutes without a waiter in sight is an extreme. But food was good :). Rooms nice. Neighborhood stellar. I'd consider returning, but I better remember my iPhone to translate everything again!", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "3.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Overrated”", "Author": "Bobmeyer", "ReviewID": "UR115207196", "Content": "Used Marriott points for 2 rooms for 2 nights, so I can't complain about the cost, but definitely not worth the going rate which I understand is over 300 euros per night, per room. Rooms adequate in size, but nothing special. Upon returning to the hotel after midnight the first night, we found the air conditioning in one room was not working. Another room was provided, but we had to pack up and move ourselves with no apology or compensation such as a complimentary breakfast. Even when working the ac was working it was barely adequate. Because my wife is Platinum with Marriott she was entitled to a free breakfast each morning which she did not use. I had one cup of coffee the first morning (no one came around with refills), but because I was not staying in my wife's room (I was with my son and she was with my daughter) they insisted I pay 8 euros for the coffee. Eventually a manager intervened to say there would be no charge. Overall the stay was a disappointment.", "Date": "July 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fab hotel in a lovely part of Madrid”", "Author": "cjwsky", "ReviewID": "UR99241558", "Content": "just perfect from arrival to departure. Rooms were spacious, staff incredible, I wish I could find a fault & I travel for a living.", "Date": "March 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brentwood, NH", "Title": "“Gorgeous Old Hotel”", "Author": "jayh-7", "ReviewID": "UR93402939", "Content": "Hotel was at one time an embassy residence, the old charm and details remain. Rooms tastefully decorated and renovated. Service was very good, quality bed linens and very comfortable bed. Location is not directly in the center of town but it is walking distance in a beautiful neighborhood filled with foreign embassies.", "Date": "January 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Beautiful hotel in a beautiful city with wonderful service”", "Author": "suri13", "ReviewID": "UR89028691", "Content": "Everything was excellent, from the service, to the bed, but the only change I would request would be free WIFI in the private bedrooms instead of in the common sitting room...", "Date": "December 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Canada", "Title": "“Definitely not a five-star hotel”", "Author": "TTTCanada", "ReviewID": "UR67189409", "Content": "The hotel building is lovely and charming, as is the terrace. However, a few aspects disqualify this hotel from deserving a five-star rating. The service varies widely from adequate to indifferent to inexistent. The room I got was incredibly noisy, what with the noise from the street and the lobby. You can ask to have a quiet room, but in my opinion such noisy rooms should not even be exist in a five-star hotel. Spend your money elsewhere!", "Date": "June 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Paris", "Title": "“Mixed feelings”", "Author": "gruntsculpin", "ReviewID": "UR64823271", "Content": "The main part of the hotel is in a very beautiful building - an old mansion with gardens. There is a charming swimming pool and small fitness centre in the basement. And the staff were pleasant and helpful. But, and this is a big but when you're paying 300 euros a night, the rooms in the part of the hotel we were in are very noisy as they give onto a main road. If you manage to get a room in the main building overlooking the garden then I can imagine having an idyllic time here. But if you end up in one of the other sections be sure to pack your ear-plugs. We ended up putting on the antiquated air conditioning to try and drown out the traffic noise but the thermostat was broken and we baked! Also, for the final two days of our stay they had installed a metal detector and we had to pass through this every time we entered the building. Apparently somebody \"very important\" was staying in the hotel but I would have thought all guests are important and subjecting them to body searches is hardly a good way to reflect this.", "Date": "May 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Estoril", "Title": "“unluky experience”", "Author": "Pombalino", "ReviewID": "UR61283102", "Content": "Beautiful old building and welcoming gardens.Well decorated public areas,attentive and discret service. modern rooms,but...poor maintenance!Frigobar out of service never replaced,Damaged shutters and windows providing unwanted light and traffic noise!Light drainpipe smell in the spacious and well eqiped bathroom . needs a vigorous refreshing.", "Date": "April 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Europe", "Title": "“Discrete quality and dedicated good service”", "Author": "Advisor31", "ReviewID": "UR53874240", "Content": "Discrete and exclusive hotel. Wonderful building, beautiful breakfast room. Staff was very attentive and helpful if you ask: I was provided with a silent room as I have a very sensitive sleep and prefer to have windows open. Perhaps the place would benefit from complementary breakfast, just make you feel more relaxed. Overall, if you value discrete quality, you will like this place. Will stay again.", "Date": "January 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "london", "Title": "“Standards are slipping”", "Author": "buitenverwachting", "ReviewID": "UR51141060", "Content": "On arrival the receptionist offered choices of room that one moment later she said were unavailable. On the last night staff started noisily setting up an adjacent room at 4 am for a function. What was the main lounge has been closed off for functions so that guests are now confined to two smaller rooms, one for smokers, which are cramped and with uncomfortable small vinyl armchairs.", "Date": "December 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Stockholm", "Title": "“Intimate, friendly and top class service”", "Author": "pontusdahlgren", "ReviewID": "UR46744365", "Content": "A very nice hotel with style, yet intimate and friendly. The restaurant is excellent and the staff very attentive and helpful. In Madrid this hotel is top two (together with Ritz) but better value for money.", "Date": "October 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "skicesana", "Title": "“Ideal base while in Madrid”", "Author": "skicesana", "ReviewID": "UR42691209", "Content": "I stay at the AC Santo Mauro frequently while on business in Madrid. Each time, I have found the room to be extremely comfortable, the amenities excellent. However, the service is the thing that stands out above all else at this hotel. The front of house, cleaning and bell staff are all extremely friendly, helpful and professional. I really cannot say enough. No request is too much and every query is answered with an outstanding combination of friendly familiarity, while maintaining professionalism at all times. Another high point of this hotel is the bar and summer service in the garden terrace. This is a true rarity for Madrid and adds to the hotel. The one real fault I can find with the hotel is the lack of an effective business center. A relatively small investment in a decent computer and NEW PRINTER would make a world of difference. The existing facilities border on useless. All in all, an excellent hotel by any standard with service that is second to none.", "Date": "September 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "dublin", "Title": "“Great atmosphere”", "Author": "extravert", "ReviewID": "UR23499982", "Content": "We stayed here with our 3 kids and found that the hotel was delighted to help us in every way. Right in the centre of madrid it is ideally placed for those wishing to see the city. We had been warned about thebreakfast E30 by other travellers on trip Advisor so we weren't surprised by it and went out for breakfast. The place wasl ighted up for christmas and could not have looked more beautiful.", "Date": "January 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“What a cool place!”", "Author": "thedevilatplay", "ReviewID": "UR23401015", "Content": "This place is a sea of tranquility in busy Madrid. This is a seriously cool place - with chilled out music on the hotels own CD being the background sound. The decor is funky in a converted palace - the staff couldn't more helpful but are never intrusive. You walk in through a courtyard and the world just seems to go a little slower! Stay here!!!", "Date": "January 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Los Angeles, California", "Title": "“Very so so”", "Author": "IlViaggio", "ReviewID": "UR21109878", "Content": "Very so so. Good things: the room service hamburger was outstanding. The club sandwich was close. The bar and the garden are lovley. I appreciated that they gave me a one hour internet access card. They did not explain how to use it. The service was nice. The bad: as previously mentioned, 30 euros for breakfast? Ridiculous, and this is no matter what you order. We had an early flight and ordered a very basic continental breakfast to wake us up... and yes, it was 30 euros. No free internet. And in a hotel that charges these rates and if I am paying for a suite I do not ever want to have a combination shower-tub. That is just not something I will tolerate. Any building that was remodeled lately needs to know that a shower should be separate from a tub. In short, I might be back but only if there are no other options.", "Date": "October 22, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Osseo, Minnesota", "Title": "“Not Recommended. Service Not 4 or 5 Stars...or even 3”", "Author": "Atozz1", "ReviewID": "UR17820397", "Content": "We were traveling through Spain for 3 weeks in June/July 2008. We stayed at several 5 star hotels along the way. This was not only the worst of our visit but on of the worst that I've ever stayed in. The rooms are clean and large and decently furnished with a large bath -- although the primary color is grey. I like modern but I like more eclectic with some color. After 5 nights the grey/black monotone colors really got to me. The lobby is small -- well there really isn't anything to the hotel except the rooms and a very small check-in area and in the back a smallish lounge and the breakfast/dining room which is tiny (its like a library in a large home). But it isn't so much the rooms as it is 3 other things. The first and largest is the SERVICE. The people are never around. Just try to get served in the bar/lounge area -- and if you do -- just try to get your bill. Each time had to walk around trying to search for service personel. At least with 50 rooms they somehow remember your room number so if you give up and don't sign the bill, it will make it to your room. And don't even try to dial the front desk for help they never answered. I had a pair of pants ironed and they never showed up at the promised time. I had to followup (which took forever) to get them delivered - we almost missed our dinner reservation. The front desk is also the concierge -- these people are nice and speak excellent english, but I was very disappointed when they made a reservation for me and never communicated the results back. I had to physcially go back downstairs to the desk to find out the outcome -- since they rarely answer the phone quickly. They also said walking to the Parado museum would take about 15min.....maybe if one were to run!!! It took closer to 40min.....with an 8 year old this was brutal! The pool is large -- but TOXIC. It is in the basement and there is a very very very strong chlorine smell. When you swim in it it's even worse, taking a breath of air jut above the water makes you gasp. I refused to let my daughter swim in it after the first time - - I have a bit of asthma and I was coughing for days after. I typically understand that 5 star hotel breakfasts can be expensive and I go with the flow. But at 30 euros each (for adults and kids) I don't care how good it is. There were no other options - no a la carte menu not even with room service. In fact when I was served a coffee in the lounge in the morning I was charged for two 30 euro breakfasts (my daughter happened to be sitting next to me). We had this fixed, but I found it very strange that we couldn't get a simple breakfast. We did have dinner outside one night -- good food/creative but spendy. I think there are a ton better places to stay than this one -- we didn't have too much of a choice as we had to book last minute and our first choices were full.", "Date": "July 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Yorkshire", "Title": "“Not good enough for a 5 star luxury hotel”", "Author": "Franklin10", "ReviewID": "UR16369565", "Content": "Rooms were dark because they are no windows, wooden floors echo in the hotel, therefore noisy, sauna was out of action, and dinner and breakfast were very expensive. For this price you expect a hotel with high excellence. Staff however were very helpful. In general we felt we paid too much for our 5 day stay. Bearing in mind what other 5 star city centre hotels offer, our stay was sadly a rip-off. The location is not in the city centre: 10 -15 mins walk to metro stations Ruben Dario or Alonso Martinez.", "Date": "May 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Jersey, United Kingdom", "Title": "“Really Excellent Hotel & Good Value”", "Author": "RusNewton", "ReviewID": "UR15251329", "Content": "We spent four days in Madrid at Santo Mauro hotel. We spoke to the hotel and discussed the fact that we are a family and normally take two adjoining rooms - one for myself & my wife, one for our two children. They recommended we take a duplex suite, costing about EUR 400 per night, which we booked. It is very much a five-star place. On arrival the staff were very welcoming and friendly, and throughout our visit they would do things like personally escort us to the pool to help us find it the first time, rather than just direct us. The room was fantastic: downstairs we had a well furnished double room with a living room and bathroom plus complimentary mini-bar which was great in such a hot city. Upstairs, our kids had a twin room, another living room - and a GYM! Wow! Hotel is near the Paseo Castellano district which includes the main shopping streets such as Serrano. We walked to some attractions, otherwise used taxis or public transport. Madrid is absolutely heaving with cabs and they are extremely cheap - I don't think we ever spent more than five euros. We had one breakfast in the hotel which was lovely, but at thirty euros per head, very expensive. I would suggest if you want to eat in the hotel you try to get an inclusive rate. We didn't have dinner in the hotel because it was a bit 'formal' for the children. We would wholeheartedly recommend this hotel.", "Date": "April 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "London", "Title": "“Wonderful but pricey”", "Author": "DoranDoran", "ReviewID": "UR14361213", "Content": "I must confess to dreading visiting this hotel. I have stayed in it's sister hotel the El Retiro (also run by AC) and franly, when you are spending your own money the last thing you want to do is feel let down by a hotel that doesn't come up to your expectations. We booked a suite (102) inside the main building and WOW what a wonderful room. 4 x Floor to (high) ceiling windows with frnch doors that open onto the street below (no balcony though). Although a suite, there is only one giant room separated by an open shelving / bookcase affair which is very tasteful. IF however, you wanted to use this room for say interviews or meetings, you would find the glimpses of the bed through the screens would probably be an issue for you. The decoration of the rooms is typical of AC hotels, slick dark greys and brown shades and metal finish lamps. In some AC hotels (Alicante springs immediately to mind) this \"industrial minimalism\" teamed with black wallpaper can create very dreary and depressing rooms. In the Santo Mauro, where most of the architecture is 19th Century, this mixes very well. Grumbles : You have to open the glass sound proof windows in oorder to shut the outer blackout curtains (electric blinds would be better), the bathroom was \"adequate\" but could have been vetter decorated and there was a certain whiff of drains that would could only overcome by keeping the door closed at all times. Loved : look in the wardroble and there are antique shoe boxes. Put them outside your door for a free shoeshine - perfect touch of style!", "Date": "March 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Great Boutique hotel”", "Author": "sti5brigade", "ReviewID": "UR11402761", "Content": "Stay in Madrid often This is by far the best that I've stayed in so far. The only downside is that this is definately reflected in the price, which for a room is 250 Euro's + but well worth it compared to most of the dross out there (I've stayed in more expensive and they were not as good) This hotel is small and is located centrally enough on a quiet residential street The reception is small and the bar area is personalised in that you sit in the lounge and they bring the drinks to you Room is what makes this. I walked across a courtyard and had a room just off the courtyard outside the main hotel Rooms large, with separate dressing room Loved the shower, loved the comfort of the beds - got a superb nights sleep which when your staying away you need and many business travellers do tend to sleep badly when they are away in hotels Breakfast was room service and was good. I would definately recommend this hotel for tourists prepared to pay more for better quality. There are so many poor hotels out there that this should be looked at........", "Date": "December 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Perfect small hotel”", "Author": "DOHI", "ReviewID": "UR8518013", "Content": "Small hotel, in the salamanca district, fnatastic staff - beautiful rooms and public areas. Excellent room service.", "Date": "August 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sunnyvale, CA", "Title": "“Will stay more at the Santo Mauro!”", "Author": "Renierk", "ReviewID": "UR6448675", "Content": "Tucked away on a quiet street but walking distance to many of Madrid's main attractions, the Santo Mauro is a lovely respite from the bustle of the city. My room was really a suite, with a bedroom and work area on the first floor, a second smaller bedroom, dining table and small workout room on the second floor. In addition, the Santo Mauro is equipped with a small pool (too small, frankly, for exercise) and a fitness facility. Other public areas are welcoming and comfortable. If possible, book a rate that includes an excellent breakfast spread and you'll be fine until dinner. The staff was exceptionally helpful and friendly during my stay, anticipating my needs ahead of my asking.", "Date": "December 16, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Dobbs Ferry, New York", "Title": "“European 5-star, but not American 5-star”", "Author": "DFTripper", "ReviewID": "UR4159102", "Content": "Having traveled extensively, and being a self-proclaimed Hotel Snob, I found this hotel to be \"fine\". It is not as fabulous as the Mandarin Oriental in San Francisco, nor the Mykynos Grand in Greece. I think that the European idea of 5-star is very different from the American. That being said, this hotel was very nice, but nothing spectacular. There are no pictures on the walls, no carpets/area rugs, and very simple furnishings. The \"King\" bed was actually two fulls pushed together. The marble bathroom was very nice. The \"mini bar\" was free. The staff was EXTREMELY pleasant, and attentive. The rooms are very clean, and private-- there were only four rooms in our building, and we never saw another guest, although we did hear them! We visited the Ritz, and the Westin, and if I had to pick another hotel, I would probably go with the Westin since it is closest to an American 5 star (although I would only rate it a 4). It was not in the center of tourist attractions, but I truly enjoyed that. Unless you need to be next door to the Prado, it's in a fine quiet, and safe, location. Overall, I did enjoy the AC Santo Mauro, but it was not one of the most spectacular hotels that I have ever stayed in.", "Date": "December 2, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "1"}, "AuthorLocation": "New York, NY (Manhattan)", "Title": "“Not a 5 Star Hotel”", "Author": "TTCG", "ReviewID": "UR4038958", "Content": "We stayed at the AC Santo Mauro for four days during mid-October 2005. The hotel is grossly overrated. Had it been classified as a three star hotel, it would have met expectations. However, expecting a luxury/5-star hotel/European boutique setting, we were dismayed by the experience. In light of another TripAdvisor review, we (thankfully) requested a room in the main part of the hotel. Even there, however, the hotel was disappointing. The accommodations are very loud and have no acoustic protection (no carpeting, not even an area rug, needed given the open hallway structure of the building and wood flooring). Any noise/voices in the hallway carry directly into one's room and awakened us each morning. We could also hear guests walking in the room above us. Furthermore, although we spend little time in the room, it is generally a pleasure to return after an extensive day and evening of touring, etc. Not at the AC Santo Mauro. The rooms are barren with no color or character whatsoever. The television has limited channels, with no movie capability. The bed is a hard platform with mattress, seemingly unaccompanied by even a cushioned pad or other fill. The linens were sub-standard, rough and dry second-grade linen sheets, with no alternative (cotton sheets) available at the hotel. The hair-dryer was broken. The hotel and rooms are dark. The business center is generally unavailable and/or the computers were down. The fitness room is stuffy and humid and other than a limited set of free weights, offers very little. The location is not in central Madrid, and requires a 15-20 minute walk or cab to get there. With that said, the staff was nice and attentive upon request. If the environment is commensurate with what is anticipated, this hotel is fine. If you desire or are accustomed to a true 5-star hotel, without question, stay at the Ritz or the Westin. We write only because had this information been available to us, our first trip to Madrid would have been even better. The city and dining were fantastic. We will return soon, but not to the AC Santo Mauro.", "Date": "October 20, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "4", "Rooms": "2"}, "AuthorLocation": "London, UK", "Title": "“Disappointing”", "Author": "London_UKCaroline", "ReviewID": "UR3433142", "Content": "I booked to stay in this hotel for a number of nights in suite(having looked at the reviews on this site). I found the hotel extremely disappointing, and whilst it might have had its day the rooms were quite tired. It was unusually warm weather at the time of my stay and the air conditioning in our room was not working very well (other guests had the same problem) so we had a very unpleasant night. Whilst the staff were helpful and offered us another room for the rest of our stay I just thought the hotel to be below the standard I had expected and moved to the Ritz which was much nicer and equally friendly.", "Date": "May 2, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“One of the most special hotels of Madrid”", "Author": "A TripAdvisor Member", "ReviewID": "UR3429400", "Content": "A very good hotel. It have a typical athmosphere of relaxing and luxe. I had a standard room in te main building and it was very nice. Especially the beds and the free minibar. The interior en exterior are magnifficent! I took a lot of pictures from the hotel,it looked like a museum.... I stayed a year ago in the ritz and the santo mauro was deffinately better. It is very smal and a lot cleaner in comparation to the ritz.", "Date": "May 1, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Milan, Italy", "Title": "“Not what it seems”", "Author": "ilbaldini", "ReviewID": "UR3045880", "Content": "I have had the privelage of staying in the best hotels around Europe - the Hotel du Cap in Antibes, the London Mandarin and l'Hermitage in Monaco are just some examples. But the most over-rated hotel in my experience to date must be the AC Santo Mauro. This hotel is divided into two parts to it. The main building - where the reception, various lounges, various restaurants, garden, swimming pool, gym - is certainly beautiful, with antique furniture fit enough for Louis XIV. The swimming pool is as good as other reviewers have made it out to be, but the gym is lacking not only in equipment, but also in quality. It's in a quiet area and furthermore the staff are very proffesionnal. This part of the building has rooms (as seen on this website) which follow all the other themes and taste seen in the main building of the hotel. Then there's the other part. One gets there by walking past the square courtyardand in this part, one finds some of the suites. And it is a shock. The rooms are rectangular. This lays the foundation for the first problem - like a garage, the rooms have a large door (really large), but no windows. The room was decorated in a fashionably \"minimalist\" and supposedly \"catalan\" style which translates to no paintings on the wall, and only black and white interior decorations. At night (in September) it was hot, but of course our only option is to use the air conditioning (which was slightly noisy). Furthermore the light in the courtyard at night filters through the stylish but useless curtains that cover the door. However the rooms in the main building are in the style/theme of the main building itself. So the question is, what is the point of having a set of rooms which have nothing to do with the rest of the hotel and don't appear in the website? It's a question that AC have not been able to answer to me and (apparently) numerous customers. My advice; go, but make sure that you are getting a room in the main building. Otherwise go to the Ritz (it's not \"snotty\" as another reviewer presumes it to be).", "Date": "January 24, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“They should write the book on the ideal hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR2857344", "Content": "This is my ideal hotel. Small, but without sacrificing any luxury or service. Set in a classic beautiful old building but modernized recently to reflect contemporary styling. In a great part of the city. Staff friendly and helpful. Wireless internet, pool, excellent food. I can see why \"some people\" come to live for 3 months...", "Date": "December 1, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London, UK", "Title": "“Fabulous boutique hotel”", "Author": "Holly29", "ReviewID": "UR1868492", "Content": "Cannot recommend this hotel highly enough. Beautiful hotel, great gardens and courtyard, and really central (in Chamberi, near Castellana and a stone's throw from Salamanca and the museums). The rooms are huge, airy, high ceilings, large windows with silk drapes, funky furniture, huge baths... The indoor swimming pool is brilliant, and has a nice gym and sauna too. The restaurant, in the former library, is gorgeous. But do try breakfast in bed, huge portions, lovely.... Perfect for a romantic weekend with your loved one, but also a great place to meet people for drink/dinner. Friendly, helpful staff. Can't say fairer than that ... oh and celebrity quotient high!", "Date": "May 4, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“Superb”", "Author": "A TripAdvisor Member", "ReviewID": "UR1090534", "Content": "Decided to avoid the corporate boxes and the sniffy Ritz, ending up in the Santo Mauro. Slightly off the beaten track, this is a small, understated 5* hotel to the North of the centre of town. The hotel itself is fairly impressive - spotlessly clean and a nice mix of old and new furnishings - but what really sets this place apart are the staff. Keen to help but without being overly deferential, charming and \"real\" human beings. What impressed us both was the fact that this culture is evident in every single member of staff we came into contact with during our four days there. I cannot fault them.Make no mistake, this is an expensive option (it was a celebration so we stayed in one of the suites) and you will find grander surroundings and/or funkier furniture in Madrid if you want it. But if you want a relatively quiet backwater in impeccable surroundings with brilliant staff then this is the place.", "Date": "June 17, 2003"}], "HotelInfo": {"Name": "AC Santo Mauro, An Autograph Collection", "HotelURL": "/ShowUserReviews-g187514-d190571-Reviews-AC_Santo_Mauro_An_Autograph_Collection-Madrid.html", "Price": "$309 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Zurbano 36</span>, <span class=\"locality\"><span property=\"v:postal-code\">28010</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "190571", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/be/a3/bea3dce07246b74beb70cac16e0ebcdc5large.jpg"}}