{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great hotel in a great location”", "Author": "2penniesworth", "ReviewID": "UR128379619", "Content": "We spent our 'mini-moon' at the hotel El Palace and had a wonderful 4 night stay. The hotel interiors are very grand and ornate yet have a very 'new' and fresh feel. Our room, on the 5th floor was very quiet, clean and well decorated. The bathroom was beautiful, a small bath, seperate shower cubicle with rainfall shower and hand held attachment (ideal if you do not wish to get your hair wet every time you shower) and a WC with its own door. The bed was very comfortable although it was 2 beds pushed together to form a super king - a pet hate of mine. Rooms do not come with an iron or ironing board. There is an ironing service offered at a (high) charge but we phoned down to reception and they brought both within 5 minutes of our call. Room keys are of the old style with an enormous tassle on. This is presumably to encourage you to hand in the key to the concierge before leaving the hotel. This was no problem for us and we never had to wait for our key even when arriving back to the hotel after midnight. The concierge was very helpful for us, booking restaurants and giving recommendations, they also helped us get FC Barcelona tickets before we arrived. We did not eat in the hotel and there really was no need. The Palace is situated near a plethora of cafes, tapas bars and restaurants. We were a 10 minute stroll from the nearest metro or Placa de la Catyluna and the start of Las Ramblas. We could not have picked a better location. We had a fab stay in Barcelona and a lot of that was down to our choice of hotel. After a hectic day walking the streets of the gothic quarter and las ramblas it was lovely to come back to a calm, quiet hotel for some rest and relaxation.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Billericay, United Kingdom", "Title": "“Beautiful”", "Author": "EssexSyd", "ReviewID": "UR128281783", "Content": "The hotel has clearly had a lot of TLC on it. They have kept the traditional feel but at the sametime our room was modern and very up to date. We stayed in a Junior Suite (423). Having travelled with hand luggage only the toliteries are very welcome, including a wet razor. We were shown to our room which had a welcome plate of fruit and a bottle of water. Only observation here, is that the water was not replaced and the fruit plate was removed before everything was eaten. The hotel is ideally located for exploring Barcelona but I receommend a room at the rear, although we had air conditioning it was nice to open the windows. I did think the description of overlooking a traditional courtyard was a bit of a stretch but it depends on what you consider a traditional courtyard. Staff could not do enough for you and the Cocktail bar is like stepping back in time to a 1930's era. Cocktails range from €12 - €18. We did not eat at the hotel as we like to find somewhere where the locals eat. As any City the tourist areas rip you off in charges. The fitness room is free but there are charges for the Spa. Cannot comment on these as we did not use them. Also I do think that in this day and age Wi-Fi should be free. Would we stay at the hotel again - YES!", "Date": "April 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“OK hotel”", "Author": "Gimclm", "ReviewID": "UR128156417", "Content": "The hotel has recently been refurbished an looks really nice. It is however let down by 3 flaws. Firstly there is no in room wifi, which means that if you have an iPad you have to go down to the foyer and get a pass code to access the web for just 1 hour whilst sitting in the entrance hall. This is annoying and becomes tedious after a couple of days. Secondly the Metro trains clearly run under the hotel and their noise is significant and the fact that they start up at 5am means getting a good night's sleep is difficult. This is compounded by the third issue which is that the room doors almost slam shut meaning that once the first person exits their room in the morning, everyone on that floor is woken. A real shame because it is not a cheap hotel and could have been very nice indeed.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stockholm", "Title": "“Almost a five-star experience”", "Author": "LaralouStockholm", "ReviewID": "UR128132843", "Content": "Our five-day vacation stay at this well-located hotel was largely pleasant, mostly due to the very professional and helpful staff. The large opulent lobby area impresses with old-style luxury hotel atmosphere and plenty of comfy sofas, while the rooms are nice but not particularly special as compared to other five-star hotel rooms. The room seemed smaller than indicated which probably reflects including in the advertised size, the \"dead\" space hallway leading into the room and the large bath area, which included both a shower and a regular bathtub. The shower only had a tiny plastic soap dish to hold the soap, shampoo, conditioner - not to mention my face wash, razor, shaving lotion - so some things had to be put on the shower floor and other things kept falling off the tiny dish. I guess this is a typical design with no function issue. The smallish working desk didn't have a desk lamp; the only lighting being ceiling downlights that could only all be turned on at once, making it difficult for one person to work at the desk while the other went to bed earlier or got up later. After I requested a desk lamp, the hotel did put one in. Ask for one when you check-in to avoid loss of sleep and irritation!. More irritating is that this pricey hotel charges for in-room wifi (15 Euro per day) while offering a cable-internet connection in the room. When paying over 400 Euro a day for a smallish room, I expect to get the wifi free. I also disliked the bedding, this must be the first 5-star hotel I have stayed in that does not have high-quality sheets and duvets. The sheets felt and looked basic, no choice of pillows, and worst of all, there was only a thin brown blanket(doesn't feel \"fresh\" or comfy) stretched across the king-size bed. Perhaps I am spoiled (I spend about 75 hotel nights a year in 4 or 5 star hotels), but I like a down or feather duvet - one for each side of the bed but big enough to share. Surprisingly there were only 2 bath towels and 2 hand towels in the room - no wash cloth and no extra bath towel for drying hair (we were two in the room). The towels were standard size and rather worn: thin and even fraying on the edges. The closet and clothing storage area is located in the bath area, which some may find less convenient. The armchair in our room was soiled from use (brownish discoloration on the arm rests and the front of the seat area), making it unattractive to sit on. The breakfast cost 28 Euro per person, and was pretty standard fare. I would have liked more fruits - I was disappointed there were no berries (all over Europe there are Spanish strawberries sold cheaply now). The breakfast room is a canvas covered outdoor garden and a bit cold. One morning we were put by the door to the patio where smokers go and it was very cold with the door frequently opening (and often being left open). I was surprised that when we sat in the lobby, no one ever came up and asked if we would like to order some coffee or a drink (a couple of times we sat for 20 - 30 minutes and staff would merely walk by, even though the lobby was nearly empty). But when I tracked down the bartender and ordered tea, it was very nicely served. The location of the hotel is good. Barcelona boasts many high-end and other hotels may offer more real luxury for the price. If you want heavy drapes, lots of gold and gild, embossed wall-paper, and \"old-world luxury\", this hotel may suit you. If so, ask for a high-floor room (only 6 floors) to avoid traffic noise, (you can still hear the subway rumble if the room is quiet and you're not distracted. This did not bother us but might a light sleeper.)", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Antonio, TX", "Title": "“El Palace....a Wonderful Hotel.”", "Author": "Randyk47", "ReviewID": "UR127819696", "Content": "We stayed at the El Palace Hotel in March 2012. The hotel was wonderful from the doorman to front desk to the concierge to the restaurant and bar staff. Our room was spacious, well appointed, and in almost new condition. We only stayed one night, a stopover to catch a cruise out of Barcelona, and wish we'd had more time to explore the city and take advantage of a great hotel.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Newport Beach, California", "Title": "“Hands down the best hotel in Spain”", "Author": "MLumiere", "ReviewID": "UR127795342", "Content": "If you like opulent interiors with silk and velvet drapes, cozy beautiful furniture of the last centuries combined with technology and convenience of the modern civilization than El Palace hotel in Barcelona will impress you. Contemporary big bathrooms with a separate toilet, with cascade shower for those who like being washed by the rain, or a more traditional (the boring one) as well. The lavish rooms are big, equipped with Mirror/TV and fireplace, and very, very quite thanks to the little hallway separating the entry and the room itself by a door. The beds are very comfortable. We had our breakfast in a garden area of the hotel. So delicious and the verity is of great restaurants. Don't forget to enjoy the Rein de Rein lounge downstairs where local jazz bands often perform. Special thanks to Javier, who was so helpfull not only with our luggage, but with other things, like recommendations and letting us feel very welcome and taken care of. Next time i'm in Barcelona, El Palace is my home.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Singaproe", "Title": "“Centrally located 5 star hotel”", "Author": "thirawit l", "ReviewID": "UR127792754", "Content": "Our family holiday started in Barcelona. We arrived early, as usual, normal check in time was 3pm. I asked for 1 room for my elderly parents, they accommodated my request and found a room. All the staff were very courteous and assisted in finding us restaurants and attractions. The buffet breakfast is excellent. The rooms were quite spacious, the facilities have been renovated. The location is close to Catalunya Square, easy walking distance to La Rambla. Definitely will come back.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newton, Massachusetts, United States", "Title": "“great place all around”", "Author": "Fred M", "ReviewID": "UR127790880", "Content": "This hotel is completely centrally located. The staff is top notch. Francisco at the Concierge station got us front row tix to a Catalan guitar concert in the Music Hall, an expert guide for a walking tour of the sites, the best restaurant recommendations, etc. Room service was at the door minutes after calling. The entire place was completely restored just 2 years ago and simply looks like the 1919 Ritz but brand new.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "US", "Title": "“Great Service, Location and Installations”", "Author": "jdr1000", "ReviewID": "UR127484220", "Content": "I tried The Palace Hotel for the first time last month, it was a great experience. My first stay here was back when it was a Ritz but the new name also comes with new rooms, menu, and a complete remodel but keeping the classic feel to the property. Food at the bar is very good, service overall excellent. I should mention that we found out about a general city strike during our stay and asked the front desk to change our checkout date for a day earlier, was told a charge for the non used night was going to apply, I asked for no charge on this and was told no, not happy but I understood it was their right to do so, so no hard feelings there. HOWEVER, two minutes after I hung up, the person at front desk called and informed me that there was not going to be a charge. It was their option and took the side of the customer. Do not miss the ham and tomato bread, had it 5 times during our stay and would take home if they let me.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stockton-on-Tees", "Title": "“Wonderful First Stay in Barcelona”", "Author": "Al1Stockton_on_Tees", "ReviewID": "UR127453819", "Content": "This hotel has spoiled me for any other break! The furnishings are very opulent and traditional yet it's bang up to date with the bathroom, TV in the mirror and so on. We stayed as a family in the classic room with our fifteen year old daughter and she loved it, although there was a slight problem with the lights flickering and she thought it seemed like the Hollywood Tower of Terror (Disney) hotel! The position was great for getting around on foot to see all of the sights and, after reading recommendations on this site about asking for a higher room, we found it very peaceful and quiet when we needed to recharge our batteries! That said, I never noticed any \"rumbling\" from the underground even when we were on the ground floor. Unfortunately the restaurant was closed for our four day trip, 2-6th April, due to holidays but we asked for recommendations from concierge and they were great! The staff were all helpful and friendly and I'd definitely love to return but I'd hope for less rain next time! A lovely break and it would be great to stay here again.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Stately and elegant”", "Author": "RCochrane", "ReviewID": "UR127413742", "Content": "Beautifully decorated and elegant hotel. The lounge is spectacular. The staff was exceptionally helpful and courteous in planning our excursions. The location is superb for walking to shopping and restaurants. Prices in the bars/lounges are quite high, but that is to be expected at a Ritz. There is a sports bar across the street that is a great place when Barcelona Soccer is playing (especially if they win.) If you have the \"loot,\" it is a terrific place to stay in Barcelona.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cincinnati", "Title": "“Awesome Stay!!”", "Author": "CincyParrotthead", "ReviewID": "UR127142257", "Content": "We stayed at the El Palace for four nights during our recent visit to Barcelona. It was an incredible stay. The location is really perfect for exploring Las Ramblas, the Barri Gotic, and L'Eixample. Walking into the hotel, it really feels like you are walking back in time with old-fashioned service and a beautiful lobby area. Also, make sure to eat at the Hotel Restaurant, Caelis. They definitely deserve their Michelin Star. All in all, a great experience!!", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow", "Title": "“Charming”", "Author": "alff2000", "ReviewID": "UR126729612", "Content": "We would definetly stay again. Advantages: - Excellent location - Wonderful kids amenities (they provided everything we needed and presented our boy a toy which he loved) - Excellent breakfast - Wonderful friendly and helpful staff - I liked the style of decoration, very gorgeous Areas of improvement: - No free wifi in rooms Note: To park the car with special prices you should ask the help of the porter", "Date": "March 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Old world charm in the middle of the city”", "Author": "Myron K", "ReviewID": "UR126501237", "Content": "After staying at a bunch of hotels in Barcelona, El Palace combine the charm of old world luxury with re-done rooms, VERY friendly staff right in the middle of Barcelona. Had brunch at hotel, which was very nice in the garden. Room was very comfortable and clean. I would stay there again.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Basildon, United Kingdom", "Title": "“Barcelona Fiftieth”", "Author": "NigelM_007", "ReviewID": "UR126265873", "Content": "We chose this hotel through a Thomas Cook Flexible trip brochure and on recommendation from an experienced travel consultant at a local Thomas Cook travel agency. It was to celebrate a fiftieth birthday with a week’s stay in a luxury five star hotel. The break was to be a surprise for my partner, but the cat was let out of the bag, when Thomas Cook sent through marked envelopes in the post with their name on the outside. Our destination was the El Palace Hotel in Barcelona flying with Easyjet with a private taxi transfer to our hotel. We got caught up in the bag fiasco at Gatwick airport (power outage on the conveyor belt), but luckily our baggage was transferred without any delay to our destination. We found the El Palace Hotel in Barcelona a very luxurious hotel with the following excellent points: - 1. Excellent customer service 2. Excellent accommodation 3. Excellent food 4. Excellent location 5. Friendly and helpful staff The only downside we had a very slow draining bathroom sink after a few days which was not rectified on our first mention of it. It was rectified on the second mention. The prices for hotel extras we found to be a little on the expensive side, but for a five star hotel I suppose this is to be expected. Overall prices for most items in Barcelona were expensive in comparison to the UK. If a quiet stay is required, then this is not the right hotel, as it is located on one the main roads into Barcelona. We found our room to be well insulated from the traffic noise though, and we slept soundly on very comfortable beds. The hotel staff assisted us with excellent service in re-arranging our pick up time on our return journey back to the UK, as this was booked for 5:45am in the morning for a 10:55 flight back to the UK. We did ask the staff at our local Thomas Cook agency to change this, but did not find them very helpful in accommodating this. Overall our stay was very enjoyable and we would not hesitate in returning to this hotel again.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "surrey uk", "Title": "“amazing”", "Author": "abbyjabe", "ReviewID": "UR125751795", "Content": "Fab hotel, great location. Defiantly has the wow factor as soon as you walk through the door. Service impeccable. Breakfast is served in a heated garden room and is the best buffet breakfast I have ever had. It was my first romantic weekend away with my new boyfriend and it was a dream. Highly recommend it. Shopping in Barca is great to and just outside your door. Head to the markets for the most amazing colours and vibrancy. Enjoy x", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Great Location”", "Author": "geoffthomas51", "ReviewID": "UR125577900", "Content": "The hotel is perfectly located for sightseeing. This beautiful old hotel is very focused on good service and there was always a member of staff to cater for every reqirement. The breakfast was 30 euros but all visitors receive a 50 euros voucher for the restaurants so we used it on breakfast and we were not disappointed. The food and garden room setting were a highlight of our stay. The classic room was large and totally adequate. If you prefer to use the bath please note it is small.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Paris, France", "Title": "“A historical hotel offering a modern experience”", "Author": "Snoopy2011_11", "ReviewID": "UR125540216", "Content": "I stayed the night of 29th of feb at el palace barcelona, this hotel is one of the ritz building this genius has created ! Now it has been revamp with full new deco and works My room 407 was great ! The deco is very tradi but comfort and fully equiped! The extra the bathroom, former roman bath that make you feel like cesar !!! The l occitane products were great and finally one hotel which offers real quality products !!!! And hand crean toooo !!! The bfst lounge is in a patio so you can enjoy the morning freshness surrounding by trees buffet is awesome, staff is always keen to help ! I higly rec this place !!! Weel done to the hotel !!!", "Date": "March 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Rio de Janeiro", "Title": "“Not bad but far from the top notch rate”", "Author": "Amashir", "ReviewID": "UR125492734", "Content": "In my arrival the doormen were very attentive, helping with the luggage and took great pains to open the door before I entered. The lobby is so beautiful, a classical palace with beautiful pillars and a mix of light and dark hues. Once in reception, too many people to check-in. The first impression is that that’s an understaffing hotel. A negative feature that is just annoying - 15 minutes to check in. Location - It´s close to the city center, and a metro station is nearby. 10 minutes away from Las Rambla. Rooms - The management really should close some of them and use for storage or stock rooms. I was on the second floor and had to change it just minutes after I arrived. In the fifth floor I didn’t notice anything. If you keep your noisy room for all the days, your value of this hotel will be 1/5, instead the 4/5 it can achieve. Staff – so friendly and pleasure in general, but some of them need training in the luxury service, like the man who took my bags up and receiving no tip (not deserved) slammed the door and frowning when he saw me in the lobby. So rude. Restaurants – one Michelin star Caellis is brilliant. Don't lose the opportunity to taste this delicious restaurant. The second restaurant is simply part of an open living room, not very suggestive. Not feel like going. Breakfast is served in a lovely setting, the food offered is ok but not worth the money. Gym – Really poor. One of the the worst areas in the hotel. 3 machines and one of them out of service. It could be a great hotel if taking care of some points but meanwhile that’s a correct, nice and comfortable hotel far from the top notch rate.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Uncasville, Connecticut", "Title": "“Alore and Silvio”", "Author": "ami g", "ReviewID": "UR125277056", "Content": "Great Hotel, very good customer service The Hotel is in Great location 5 Min to Plaça de Catalunya", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Westport, Connecticut", "Title": "“Five Star Heaven”", "Author": "Sunshine118", "ReviewID": "UR125099353", "Content": "My husband and I just returned from a fabulous stay at El Palace. What a wonderful luxury hotel in the heart of Barcelona! I loved the hotel's location, which is accessible to all the major areas, eg, The Gothic Quarter, Las Ramblas, Passeig de Gracia shopping, Gaudi's La Casa Mila,etc. Our room was elegant, yet comfortable and the bathroom was spacious and had every amenity including heated towels, a fabulous rain shower, sunken bathtub and bath products from L'Occitane. Also, I am a very sensitive sleeper and was pleased that I enjoyed 10 peaceful nights at the hotel. In addition, the staff at El Palace is incredible. From Mariano in reception, to Eloi, our bellman and all of the concierge staff - Xavier, Francisco, Alexis, Alex, Michael, we were treated like royalty! Their insight, knowledge, professionalism and advice really made our trip so memorable.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wantage, United Kingdom", "Title": "“Luxury in the centre of Barcelona”", "Author": "CJD091", "ReviewID": "UR125019836", "Content": "The El Palace is situated on a very busy main through route - the Gran Via de Corts Catalans. We were concerned that it may be noisy from the road as our room overlooked it but the sound proofing was adequate. The location is good for access to the City and is 15 mins away from Sagrada Familia in the other direction. The service in the hotel is excellent but beware of the prices in the bars, mini bars and spa. We included breakfast in our price but at €28 each if we hadn't it would have been more than we would have wanted to pay. However if cava and smoked salmon are what you want for breakfast then that price may be about right. We dined out every evening so are unable to comment on the quality of the food. There were not may eating in the restaurant so we wanted places where there was more atmosphere. In the busier summer months it may of course be rather different. We had a great week in Barcelona and we enjoyed our experience and stay at El Palace.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix", "Title": "“Fabulous Stay”", "Author": "AhwatukeeArizona", "ReviewID": "UR124584313", "Content": "My husband and I just spent 5 fabulous nights at El Palace. We were greeted with a wonderful aroma in the lobby to wonderful service. Our room and bathroom were very spacious. The location in Barcelona was absolutely perfect. The concierge Alex, Katherina and Celine with guest relations were so helpful with travel tips and restaurant recommendations. We would recommend this hotel for your stay in Barcelona. We can't wait to come back. Thank you everyone at El Palace Hotel.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Gorgeous hotel, perfect location”", "Author": "Alexandra S", "ReviewID": "UR124567349", "Content": "I can't believe it took me this long to write this review of El Palace, because the memory of it has stayed with me in a wonderful way. From arrival with elegantly dressed doormen who scooped up our luggage and delivered it quickly to the room, to the always helpful and charming concierge desk, to the waiters in the restaurant, everyone at El Palace aimed to serve and please. Our room overlooked the main street, so I was worried about noise. Nothing to worry about, and we were only about 3 floors up. In fact, I spent time out on our balcony looking at the passersby, and the architecture of this grand city. We had a beautiful marble bathroom, and two comfortable beds with plenty of room and pillows. Closet space was excellent. A writing desk to capture our memories at the end of the day. The decor is opulent and grand throughout the lobby, with many places to sit and start conversation. Despite the large, open space, it gives off an intimate feel. I used the hotel computers, stationed adjacent to the lobby, which were high speed and practical. The formal dining room looked nice, though we didn't eat there since we wanted to spend our money eating out in the many amazing city restaurants. The breakfast and lunch terrace was nicely decorated and almost felt like you were eating outdoors. My only complaint was the price for the food. Breakfast was very expensive. Thank goodness it tasted good. The location of the hotel is excellent. Close to metros.. a couple blocks from bustling Passeig de Gracia which hosts major shopping, terrific restaurants and the extraordinary Gaudi Casa Batllo mansion. You are maybe a 10-minute walk away from the top of Las Ramblas, and will cross a large, open square getting there, in which you will see everyone from performers to people walking to work. It was an incredible week.. and I loved calling El Palace home in Barcelona. We will return!", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Elegant Old Hotel”", "Author": "OldCritical", "ReviewID": "UR124455325", "Content": "We stayed here for a few days before our cruise. It is a lovely hotel, and the location is excellent too. The only thing I can fault is the beds. They were too firm for our family. We had two rooms, and each of the rooms had a nice sitting area with a fireplace. The breakfast was wonderful too, and we enjoyed meeting every evening in the comfortable hotel bar. If you don't mind a rather hard bed, this is a good choice for Barcelona.", "Date": "February 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Long Beach, California", "Title": "“A true classic jewel.”", "Author": "KimberlySchultz", "ReviewID": "UR124388327", "Content": "We spent two nights at this palace last month. What a luxurious hotel!!! Very well located, just a few minutes walk from Las Ramblas. The staff were helpful and very friendly. We were upgraded to a junior suite (honeymoon trip), elegant and spacious. They even gave us a bottle of Champagne, excellent detail.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Charlotte", "Title": "“El Palace Hotel”", "Author": "carolr", "ReviewID": "UR124210141", "Content": "My husband and I are spending our last night at this beautiful hotel tonight and want to complement the entire staff and premises. Celine, the manager, sought us out to introduce herself to us, and has been extremely courteous and friendly. We were upgraded to a junior suite, which is most comfortable. The recent renovations still give it the \"old world charm\" that we enjoy. We also visited several other hotels while here, and realize that this one is superior!", "Date": "February 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Low Quality Service”", "Author": "AlinHauca", "ReviewID": "UR124139893", "Content": "RoomService - Bad. Nobody speak English they will bring you something else. Not too much to order. Old personal rusty without energy Breakfast - poor. Totally disappointing. Room - junior suite with window in interior yard. No coffee or tea maker in Room 200 ml free still water in Room only for two person No weight scale in bathroom Coffee Expresso in bar is like American Cofee hotel is very clean , beautiful classical style looking very luxurious just they should fix some of minuses", "Date": "February 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Alberta", "Title": "“Wonderful hotel and great location”", "Author": "Deborah_girl", "ReviewID": "UR123083034", "Content": "We stayed at El Palace for a week in January and found this to be a luxurious hotel in a great location. The rooms were very spacious and the beds were exceptionally comfortable. We even had a huge walk in closet. I am so pleased that we chose this hotel over other options. The staff were friendly, helpful and quick to respond to our needs. My husband advised the hotel that we were celebrating my 60th birthday and retirement and on our arrival were given a complimentary bottle of champagne. When we return to Barcelona, we will definitley stay here again!", "Date": "January 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Phuket", "Title": "“A true palace.”", "Author": "Jimmy_Cumming", "ReviewID": "UR123057952", "Content": "Only a few minutes walk form the main shopping street of Las Ramblas, this hotel shouldn't be described a hotel, it's more like stepping into a palace. We had a long 13 hour flight and all we wanted was to get to the hotel and do a bit of sightseeing. When we stepped in, your were greeted by a glistening chandelier, accompanied by two guards. The lounge was draped with green and purple hues and was the main highlight of the hotel. We actually got upgraded and we got a fabulous room. The room itself was elegant and very spacious with an oversized bath and rain shower. A definite choice in the heart of Barcelona!", "Date": "January 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Superb Hotel”", "Author": "KPC80", "ReviewID": "UR123013287", "Content": "This hotel is just superb, the decor and the staff are fantastic. The only snobbish chap was one on reception on the 7th Jan, the day of arrival who refused to accept our bed and breakfast booking because it was from some inferior travel-agent!! Apart from that we had a superb stay with breakfast not quite the 5 star rating.", "Date": "January 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“NIce hotel but not the best location”", "Author": "billB36", "ReviewID": "UR122816047", "Content": "We loved this hotel actually but we found it just a block or two too out of the main area. It was all within walking distance but after a long day, two blocks felt like more then that. I would stay here again but be more prepared for the location. There were always taxis outside and we got around ok.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dammam, Saudi Arabia", "Title": "“Smells nice”", "Author": "M_AlMajdouie", "ReviewID": "UR122786626", "Content": "I posted my review previously, I was looking to find any similar smell that this hotel uses and I just found in Wal Mart this perfume (Paul Sebastian), almost the same smell El Palace uses in their rooms & facilities. :)", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Amazing hotel, with great rooms in a very good location”", "Author": "LucasSantos", "ReviewID": "UR122781236", "Content": "Me, my wife and my parentes stayed @ El Palace during a car trip across Spain, France and Andorra. We stayed here in oct/11. The hotel is just amazing, from the smell until the restaurants. We stayed here for 4 nights and had a pleasant time. They offer all you can expect from a member of the leading hotels of the world, from location to comfort, from service to good drinks. The breakfast, asked at the room is very good, with different kind of breads, cheeses and ham, but the breakfast at the saloon was amazing. The saloon was beautiful, with plenty space between the tables. They have everything you need and much, much more. The room was just great, we had a suite with sofa and a large bathroom, but with view to the internal patio. The Bed was nice and large with a big screen tv and complimentary fresh fruits and spanish sparkling wine. The bathroom was great, with plenty space, separate large rain shower and tub and separate toilet as well. We tried the restaurant at the end of the lobby, at the main bar and the food was great, from the salad to pasta, everything very good and after the dinner we went to the downstairs bar and find a very nice small bar with a live pocket show where we had some good drinks with good music. The only point is that sometimes you can listening the subway from some areas of the hotel, but nothing that will make your stay less pleasant.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "East Sussex", "Title": "“It was OK”", "Author": "skyecorrina", "ReviewID": "UR122594510", "Content": "We booked a de-luxe double for 5 nights arriving on Christmas Day having been collected from the airport by the hotel car. On arrival we were upgraded to a 1st floor suite with an aspect looking out directly to rooms on the opposit site of former courtyard. To enable privacy, the windows were at least 80% opaque glass and with 3 sets of window dressings, natural light was seriously impeded. However as the weather was brilliant sunshine every day which meant we were out all day we were not too bothered. The room was well appointed with everything as it should be. The suite consisted of a bedroom, lounge, large bathroom with separate shower room and a luggage storage space. The decent sized bedroom had built in wardrobes, a wall-mounted flat screen TV and bedside tables. The bed was exceptionally comfortable with a daily linen change. Lighting was excellent with a nightlight for in-bed reading in addition to lamps. The lounge contained a desk & chair, a sofa, armchairs and a 2nd wall-mounted TV. A mini-bar with limited stock is provided but no courtesy tray for hot drinks but this arrangement is fairly standard in Europe. I cannot function without tea as soon as my eyes are open so took my own travel kettle etc and this did not attract any comment (this has been known in other places but I like tea hot not tepid after a 10 minute journey from a kitchen!).Housekeeping and replenishment services were excellent given it was a holiday period for the local people as well. The bathroom offered a double wash basin unit with plenty of space for two sets of toiletries etc, a jacuzzi which worked and was spotless, a large walk-in shower with the option of overhead or hand held waterflow. Only slight issue was the decor was very dark in the shower area but lighting and mirrors in the grooming area were excellent. We took breakfast in a large room with central buffet tables. This area is either a conservatory or is actually outside but cleverly disguised as an indoor room for winter months. It is heated by two types of heating -high wall-mounted electric bar heaters and moveable outdoor patio heaters. Despite their best efforts, these heaters are not adequate. As our visit progressed I was wearing more layers each morning and I observed other guests resorting to outdoor clothing at breakfast. The food was fine but my other half felt that there should have been a cook to order menu for a hotel of this calibre. There was certainly no evidence of this being available. We had dinner in the AE restaurant on Christmas night which was absolutely fine but not exceptional. We also dined at their Michelin star restaurant Caelis and that's another story! Please see separate review. Suffice to say it was a week ago and we are still awestruck!!! The location of El Palace is very central with excellent access to good shopping streets, a short distance to the Barrio Gotic, a healthy walk to beach and nearby the Gaudi hotspots. This was our 2nd visit to Barca and we still have not used a bus or underground train. Lots of people comment about noise from the underground. I noticed it but it was not obstrusive. This is a city centre after all. We tend to use 5 star hotels in cities and although El Palace does not equate to other places we have stayed in recent times it was very good value. We would probably give it another chance.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cheshire", "Title": "“Good but not great”", "Author": "IrishKaren", "ReviewID": "UR122515189", "Content": "I'm going to go against the grain here and say that I don't think El Palace compares with some of the more famous five star hotels that I've stayed in (George V, The Hassler). We were picked up by the hotel car and taken swiftly to the hotel, lead into reception and checked in(our room wasn't ready but it was 11.30 am) so we went to the restaurant to have lunch, it is decorated beautifully in keeping with the history of the building,they have done a great job sourcing beautiful reproduction furniture. We had lunch and it was fantastic but there was just no atmosphere, the place felt dead and we were the only people in it making it hard to sit back and relax. We stayed in a one bedroom suite and it was nice but just nice nothing amazing, the colours of the room were muted and the room felt dark and gloomy, the seating area only had one small sofa and two upright chairs so it wasn't a great place to lounge in. As it was our wedding anniversary my husband had (as a surprise) requested flowers, bubbly & cake in the room on arrival(he booked this two months in advance). They weren't there and when he tried to speak to reception got nowhere so he had to go downstairs and after a long conversation with them they explained they hadn't known if he wanted them on arrival or later in the day, its areas like this that they fall down in, a top 5 star hotel would do their utmost to make find out as it kind of ruined the surprise! Other things such as a leaking radiator which had obviously been like it for some time as the carpet was discloured, not being able to get through to room service, a breakfast delivered without butter, salt, jam and milk and you can understand why I wasn't blown away. The staff are friendly but they don't go out of their way to help, we had drink each night when we returned from dinner and bang on 12 the bar was shut, we weren't asked if we would like another drink..... We were on the 6th floor and you can here the metro, not enough to stop me sleeping but it's there. We had dinner in their michelin star restaurant and I wasn't impressed with it (please see my seperate review), the breakfast was good, it's in a good spot, walking distance to the shops etc. It was a nice stay but nothing special and for the money I don't think we would return.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Burlington, Vermont", "Title": "“Amazing bathroom!”", "Author": "DoubleBock", "ReviewID": "UR122194358", "Content": "Look at the pics - what a gorgeous place and the bathroom was as big as many of the hotel rooms I've stayed in! Rooms were large by European standards, and the walk-in closet was fantastic. Beautiful lobby, and the breakfast buffet was very satisfying. Can't say how good the beds were because we were so jet-lagged we could have slept in the hallway. Most European beds I found hard as a rock and I remember these as being close to that. Very nice location -- close to lots of restaurants, bars, and shopping. Only 10 minute walk to Las Ramblas. The area felt very safe, even at night. Staff was very friendly and helpful. Obviously one of the best hotels in Barcelona. Price was included in my travel package but I'm betting it was astronomical. Stay here if you can afford to pay for first class accommodations -- you won't be disappointed.", "Date": "December 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nelspruit, South Africa", "Title": "“A PALACE, NOT A HOTEL”", "Author": "SUNBIRDnelspruit", "ReviewID": "UR122029854", "Content": "We were blown away with HOTEL EL PALACE BARCELONA (OLD RITZ) - never in all our travels have we had such service from any hotel. 5 Star service in every way. The hotel it self, is so beautiful that we were both blown away. We received exactly what we have asked for, a quiet room, away from the elevators, top floor and received a free upgrade on top of it. Free wi fi is available in the reception and lounge areas. The restaurant;s breakfast is out of this world, the selection so fantastic and well presented. The room it self, comes with everything you need. Do not expect a view if you want quietness, but this did not matter. This hotel is close to everything you want to experience in Barcelona, on the Las Rambles, close to wonderful restaurantants, all the shops, pharmacies, hop on hop off bus routes, the squares, etc. We are still blown away with this hotel and it staff - a must for every person who wants to stay in a beautiful 5 star hotel with good rates. Thank you El Palace for making our stay in Barcelona unforgettable.", "Date": "December 23, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "jakarta", "Title": "“a very well maintained hotel”", "Author": "mchendra", "ReviewID": "UR121999455", "Content": "it's a grand hotel. straight away feel homey when entering the property. very clean and the room is very spacious. the breakfast variety is not as many compared to some big hotel but very good quality food. lots of variety of spanish ham, iberico. very tasty, it melts in your mouth. the apple turnover is the best yet tasted. we also dine in the cafetaria. the chef is michelin rated so the food is quite good with a reasonable price.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Elegant and comfortable, but a little noisy.”", "Author": "Max92", "ReviewID": "UR121881908", "Content": "First the good, and it really is good: The hotel is elegant and comfortable; the staff are courteous and helpful; and everything is clean and works. The location, close to, but away from, the madding crowd, was perfect for us. The L'Occitane cosmetics are a nice touch. Style and pampering are words that come to mind. Of course, you get what you pay for, and it ain't cheap. We followed advice of previous reviewers and asked for the top floor and an internal room. The less than perfect are that their king-sized bed is really two twins (cleverly connected, but even so...), you can still hear and feel the metro even on the top floor (though it's not nearly as noticeable as in the lobby), we had no traffic noise - but plenty of noise from the airconditioning units on the roof (white noise, but still noise), and they charge for wi-fi in the room (though it's free in the lobby), which I find outrageous.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Christmas Elegance”", "Author": "CultureVulture88", "ReviewID": "UR121725757", "Content": "We stayed here for two nights on a recent pre-Christmas break and really enjoyed the glamour and old fashioned style. Previously The Ritz (not sure if they still own it) it was refurbished four years ago. We stayed on the sixth floor in a room with a roman bath which was perfectly addictive. Breakfast was not to be missed in the covered courtyard. Staff and concierge were as to be expected, divine. It is well placed for shopping being just a stone's throw from Chanel, Louis Vuitton etc, but it's taxi ride for heel wearing ladies (or indeed men for that matter?!) if you want to have dinner in the Gothic Quarter.", "Date": "December 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Elegance and Style in Barcelona”", "Author": "Judd", "ReviewID": "UR121562587", "Content": "For our first visit to Barcelona, having consulted all the usual sources, we chose the El Palace Hotel. We knew from the moment we arrived at the entrance, we couldn't have made a better choice. Well-located on a lovely boulevard and close to the Ramblas, this long-time Barcelona Ritz hotel has been beautifully up-dated on at least two occasions since it dropped the Ritz label in 1988. While the up-dating has incorporated all the modern conveniences, the decor is classic in style. The lobby, which incorporates a bar and a dining area at its far end, is huge and very elegant, with lovely sofas and magnificent chandeliers. The dining room for breakfast is reminiscent of a English garden room. There is a Michelin-starred dining room which unfortunately we felt obliged to avoid, still suffering the effects of excessive eating during a just-completed Mediterranean cruise. We did, however, sample (and were happy with) the food and drink in both the less-formal dining area and the breakfast room. In summary, the public areas of the hotel are as good as they come. Our room, on the top floor of the hotel, was of a good size and equally attractive and functional, with quality furnishings and a great bathroom including both a bath and separate shower. It's obvious that a lot of thought had gone into the planning as all one's needs seemed to be taken into account. The flat-screen television, for example, was incorporated into a mirror, so that one was unaware of a television in the room until it was activated with the remote control. A very comfortable bed and quiet heating and airconditioning systems made sleeping very easy. Of course, it is important also to have good staff. From the doorman to the front desk to the chambermaid, every one we encountered was very professional, congenial and proficient in English. We used to great advantage the very strong concierge desk in making arrangements for evening musical events and shopping recommendations. Yes, there were some minor concerns - if you didn't have (but require) an adapter for North American plugs, you have to ask for one; the standard bar of soap is hand-sized and not bath-sized, but the latter is available on request. In short, this is a great hotel if elegance and style and location are what you seek at a reasonable cost. We recommend it without reservation.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“The Royal Treatment”", "Author": "BulaSF", "ReviewID": "UR121558189", "Content": "Highly recommend this beautiful hotel. Can walk everywhere from this location. The staff and service is amazing. The rooms are so luxurious that it's hard to leave. Can't wait to go back!", "Date": "December 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantasic experience”", "Author": "SallyB2", "ReviewID": "UR121187083", "Content": "This hotel is aptly named. It is a palace in all senses. The restoration is a triumph. We treated ourselves to a Privilege Junior Suite (separate living and bedroom) and just loved the space. The separate shower stall in the ultra-luxurious bathroom was out of this world! Everything was super-luxurious in this hotel. The magnificent downstairs rooms are perfect for a drink, and the informative, friendly and professional barmen are first-class. Breakfast in a magnificent glass-covered area produced the best buffet I have ever seen anywhere. A special word for the wonderful and friendly housekeepers: they kept our room spotless, and never intruded. The location is perfect to see central Barcelona. We also took the hop-on hop-off buses and saw all the sights. We particularly appreciated the good tips of the concierge - they recommended excellent restaurants - as well as simple pizzerias when all we needed was a light meal. The people at Reception were efficient but disinterested. A superb experience. Only draw-back: we did not meet one manager during our 4 night stay; even the most perfectly oiled machine needs a human face to represent it. So Hotel Palace - put a duty manager on show and get him/her to say hello to the guests and show some warmth.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“Wonderful stay at El Palace Hotel”", "Author": "Natacha G", "ReviewID": "UR120946030", "Content": "PERFECT LOCATION - 10-15 minutes by feet from every touristic point in Barcelona (passeig de gracia, barrio ghotico, ramblas, marina) 20min by feet from Sagrada familia, subway close to the hotel 5 STARS HOTEL - no doubt. It is actually the former Ritz hotel totally restored in 2008. The prices remain however (surprisingly) very reasonable. Very good surprise. Restaurant / Breakfast : very good and reasonable prices given the quality All the staff is very gentle and dedicated to the clients Luxury Rooms", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jeddah, Saudi Arabia", "Title": "“Unforgettable Experience”", "Author": "NihalF", "ReviewID": "UR120895677", "Content": "From personal experience, this hotel should be ranked as one the top three hotels in Barcelona. Once u put a foot there, u can see, sense and smell the touches of luxury and dedication. If u like classic design, then this is definitely the place to go, u can see it from the reception through the lobby, bar, terrace all the way to their incredible rooms. the service is outstanding, we arrive a few hours before our check-in time, and since the room was ready, we went to bar for a couple of drinks, then we were surprised by the hotels manager greeting us and apologizing for nothing they've done wrong, and putting our drinks on the house for three two days \"Unbelievable\". The room service is very fast and the food is extraordinary. and they have L'occitane products in the bathrooms. Highly recommended!!! cant wait to go back..", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“Grand Old Hotel in a perfect location”", "Author": "MinisterOfCulture", "ReviewID": "UR120838521", "Content": "Hotel El Palace is in a perfect location - two blocks from the Passeig de Gracia, and within walking distance of the Barri Gotic and the center of historic Barcelona. The public rooms are in a grand style from the turn of the 20th century, but the rooms are very comfortable and modern, with beautiful bath/dressing rooms - double sinks, separate rain shower stall and separate bathtub, and a private toilet. Service was excellent and very friendly.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Waterlooville, United Kingdom", "Title": "“Delighful!”", "Author": "donmat1964", "ReviewID": "UR120819379", "Content": "The first mention should go to the excellent staff, very attentive, knowledgeable, kind and truely interested in making your stay perfect. Had a great room on the second floor with a balcony over looking the side street, Large room, fun TV in the 'mirror', no noise slept soundly. Breakfast is good although the over head heaters very hot and asked to be seated away from them. The toaster provided was inadequate and took an age to toast the bread!", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Corona del Mar, California", "Title": "“A nice hotel, close to everything.”", "Author": "madagee", "ReviewID": "UR120801890", "Content": "This is a beautiful hotel with old world style and new world service. The breakfast area was in a beautiful atrium with outdoor seating available. The staff was very helpful. We also stayed there because we were told they had a remodeled gym in the hotel. It is a small, workout room and it may have been remodeled, but it only consists of two treadmills, two bikes and a small bright green bench. We affectionately called it a \"Barbie workout room.\" We would definitely stay here again. It is so convenient to everything you would want to do in Barcelona.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manhattan Beach, California", "Title": "“Most elegant and convenient place to stay”", "Author": "susieq090", "ReviewID": "UR120533895", "Content": "Conveniently located to the Born, Gothic and La Ramblas, gorgeous interior and exterior (the old Ritz) , rooms were heavenly, loved the flat screen TV. This is the only place to stay in Barcelona. Fabulous daily breakfast buffet, best we've ever had!", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia, USA", "Title": "“Ever Wonder What 5-Stars Smell Like?”", "Author": "pelirroja01", "ReviewID": "UR120531028", "Content": "We went to El Palace as part of our Honeymoon. The hotel is located in a great area close to but not really in any specific area (about a 10 minute walk from the bus you can take from the airport and about 5 minutes from the closest Metro). This was our first '5-star' hotel and it did not disappoint. The rooms were large for European standards complete with a foyer, bathroom with separate tub and shower (with the rain-shower head), a large bedroom area and a walk-in closet bigger than the bathroom (you could easily sleep 2 kids or small adults in the closet). The entire place just smelled nice -- if you ever wondered what angel's tears smelled like it would probably be the scent in the halls (but less in the bedrooms) of the El Palace. We had accidentally left our guidebook on the plane and so went directly to the concierge and asked what there was to do around town. Every person we spoke to at the concierge desk (there were a few that rotated depending on time of day) spoke perfect English and were extremely helpful and patient with us. We had the buffet breakfast every day in the hotel which was situated in an outdoorish (part was actually open air and part had a semi-permanent canopy over top. The brunch was great and had alot of diversity with Spanish staples like sausages as well as an interesting Asian dim sum area. There was a club downstairs that we unfortunately never made it to as well as a spa in the hotel that we also never made it to. The Michelin Starred restaurant in the building looked great but had a lot of fois gras dishes which due to a strange twist in fate is the only food I'm actually allergic to so we did not try that either. Most people there were older than us (we're late 20s) and there were some kids ranging from around 5 up to teenage years. I got the impression we were there outside of tourist season (early October) and so the hotel wasn't packed. The entire time we wore Tshirts and jeans and not once did we get a disapproving look from the staff -- everyone was super friendly and most spoke at least English and Catalan if not Spanish and other languages as well (we heard German, French, and Mandarin from the guests in addition to English and Spanish). If you're looking for a beautiful hotel that clearly says 'old world charm' with a fantastic staff and a laid back but clearly 'expensive' vibe this is a great place. If you're looking for a trendy hotel right in the middle of the 'beautiful people' this is probably not the place for you. Equally good for couples and for families.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "BAKERSFIELD, ca", "Title": "“A Very Wonderful Experience”", "Author": "Jcoston", "ReviewID": "UR120442188", "Content": "We stayed at this wonderful hotel to celebrating our 50th Anniversary. What a wonderful choice. It is in the perfect location. We were walking distance to all the sources of Barcelona. I can't wait to to back again.. It is truly a BEAUTIFUL PLACE. The Hotel itself was just like being in a castle. I felt like a Queen!", "Date": "November 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Make you feel welcomed in Barcelona.”", "Author": "EnjoyOurLife", "ReviewID": "UR120420035", "Content": "Excellent service and friendly staffs. Convenient located. A lot of tourist spots are within walking distance. We'll definitely go back to this hotel.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“When in Barcelona”", "Author": "V R", "ReviewID": "UR120289451", "Content": "....there is no better place to stay than at the El Palace. The location is perfect. The staff could not have been more helpful. Restaurant recommendations were right on, requests were handled with professionalism and speed. The lobby is spectacular and the rooms were beautifully appointed and spotless. We will definitely be back!", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vienna, Austria", "Title": "“The perfect hotel”", "Author": "Raimund Z", "ReviewID": "UR120257055", "Content": "this hotel is really close to perfect: Wonderful rooms, good view across Barcelona (at least from the top floor, where we stayed), very friendly and attentive staff, great architecture, perfectly situated and yet silent. Magnificent!", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Anniversary trip”", "Author": "Russsant", "ReviewID": "UR120222975", "Content": "The Palace is the best hotel in Barcelona. Not only is the facility a top notch world class hotel, the location is great (within walking distance to everything). Add to that the staff, which consistently goes above and beyond, is the very best of any hotel I've stayed at in the world. I sharedwithnthem this was our 25th anniversary and they upgraded us at no extra charged to a Junior Suite and sent a bottle of great Cava to our room. What a great way to start our vacation and celebration. Thanks to everyone at the Palace and we'll see you again soon!", "Date": "November 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“Amazing and walking distance to everything”", "Author": "thelocationlocation", "ReviewID": "UR120107614", "Content": "What an wonderful hotel, it is old style glitz and glamour but the staff are so friendly and helpful that there is no snooty-ness, they bent over backwards to answer questions, make reservations and order taxis! The rooms are gorgeous and luxurios with huge bathroom and double sink. The hotel is tucked away off of the shopping strip but was within easy walking distance of all the sites including La ramblas & Sagrada Família, seeing lots of others on the way. Loved this hotel and not only would recommend but can not wait to return! Beautiful city, people, food and hotel.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Connecticut", "Title": "“Wonderful Stay!”", "Author": "CTLola24", "ReviewID": "UR119863472", "Content": "My husband and I recently returned from a 7 night stay at the Palace. The hotel, formerly known as the Ritz, was closed for two years to undergo a renovation that is now completed. This is indeed a 5 star hotel--excellent location! We had a great time and would recommend this hotel to anyone. The Trip Advisor advice to request a high floor away from the lift resulted in us having a room on the top floor with a small balcony---perfect! The rooms have sound proof windows and room darkening shades but we never found the street noise to be a bother. The bathrooms are lovely with separate shower/tub and a separate room for the toliet. Bathrobes and slippers are provided. Beds are very comfortable.We had a classic deluxe double with an additional twin bed for our 20 year old son. Housekeeping services were excellent. The public rooms are old world European, very elegant. The staff was gracious ,friendly and very competent. The concierge was able to arrange futbol tickets to see Team Barcelona while we were there. They also helped with tickets to a flamenco performance and train tickets to Figures--home of the Salvador Dali museum. We had breakfast in the Garden Room twice---pricey but lovely. We also had cocktails in the bar area and also dinner at the hotel one evening--just wonderful. There is a late night lounge with live music in the basement that had fabulous drinks, great bartenders and was a fun way to end a long day of touring. I would recommend the hotel and the city of Barcelona to anyone! We had a great time!", "Date": "October 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Old World at it's best”", "Author": "RolfParis", "ReviewID": "UR119766557", "Content": "2 nights at El Palace, the former Ritz hotel, wonderful lobby in Louis XVI style, great breakfast in the covered interior courtyard, very efficient concierge, comfortable rooms, TV with many international channels, Manager Cristina does a great job", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Coral Gables, Florida", "Title": "“Fabulous hotel”", "Author": "Madi38", "ReviewID": "UR119703814", "Content": "El Palace made our stay in Barcelona very special. The service, rooms, location were all excellent. The concierge desk were tremendously helpful. The complimentary breakfast was the best we have had in Europe, served in a magnificent outdoor/indoor space with warm heaters for a chilly morning. This hotel was once a Ritz Hotel and it has all the amenities of a Ritz. We would definitely stay there again on our next trip back to Barcelona.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Grand & Luxurious!!”", "Author": "AngiePang", "ReviewID": "UR119643357", "Content": "My husband & I stayed at this amazing hotel after disembarking from a Mediterranean Cruise and we were more than impressed with El Palace! The hotel is very elegant and the decor is sumptuous and lavish. The service is exceptional - from the door man to the Reception Desk to all the staff, the service is faultless. The room was very beautiful, the bed extremely comfortable the bathroom was splendid! We were also very happy with our breakfasts and dinner - impeccably prepared and very tasty! The location is very good - central to all the amazing sites of Barcelona. Really, there nothing negative we could say about El Palace - we will have no hesitation in recommending this opulent and refined establishment and look forward to returning to El Palace in the future!", "Date": "October 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Great hotel and very friendly staff. I only wish if the provided tea maker in the room.”", "Author": "Phono_London", "ReviewID": "UR119595532", "Content": "Found the hotel very good. Rooms are very spacious. Location is great as it's away from the hustle bustle but still within walking distance from all heart of the city. A bit expensive. The only criticism I have is that there was no water kettle or coffee in the room. I would expect such a hotel to have this in the room.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Beautiful Hotel in a Great Location”", "Author": "travelbug90587", "ReviewID": "UR119359734", "Content": "My husband and I stayed at El Palace for three nights in early October. We chose this hotel for its proximity to our daughter's apartment (she is studying in Barca for the semester). We went into it having read all the reviews on TripAdvisor so we were prepared for the train vibration. The hotel is very formal and grand. The bar/salon area is beautiful and we enjoyed a nice afternoon snack and drinks there one afternoon. Our room was on the 4th floor and spacious, with a separate sitting area with a desk, couch and TV. The bathroom was quite large with a shower, double sink and tub. The tub was very modern with many settings for a wonderful spa experience. The gym was too small for my husband and not much choice of equipment. The service at every point was great, from the bellman, Norman, who showed us to our room to the maids who came in twice daily and did a great job. The front desk staff was pleasant and helpful, except I always seem to have trouble with restaurant recommendations from the staff at high-end hotels. I can never get a good, local, inexpensive name from them. They always want to send us to expensive touristy spots no matter how much I ask them not to. They sent us to La Gavina on the waterfront. The food was not good and the prices were high. Don't go there! Other than that, we enjoyed our stay at El Palace. As long as you can get over feeling the floor vibrate every once in a while, you will enjoy this hotel.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "marbella", "Title": "“1st anniversary break”", "Author": "tracy h", "ReviewID": "UR119302758", "Content": "excellent standard of hotel. Spacious rooms. Breakfast and service amazing.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "vancouver", "Title": "“El Palace Hotel”", "Author": "yvr14", "ReviewID": "UR119076291", "Content": "We stayed at El Palace for a couple of nights before our cruise this year. We thoroughly enjoyed our stay. We loved the location as we were able to walk to most places. The service was excellent and the room very comfortable and clean. While they did charge for Wireless access, they do have computers in the business area off the lobby that one can use for free. We are planning to return next year. While we did hear the noise from the subway, it didn't disturb our sleep.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nigeria", "Title": "“A place for Kings!”", "Author": "emcorp", "ReviewID": "UR119069413", "Content": "The El Palace in Barcelona is a beautiful hotel recently renovated. It is right in the heart of the Catolonia area. Although located on a major high street, once inside its very quite. I did not experience any of the noise some recent reviewers complained about rather my sleep was blissfull. While the service was excellent and the hotel luxurious, you sort of get a sense that this place is more suited for the retired, elderly crowd. However, if i ever return to barcelona i will certainly stay at the El Palace!", "Date": "October 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Curitiba, Brazil", "Title": "“Too much noise”", "Author": "BrazilMaria", "ReviewID": "UR118901006", "Content": "The noise began at 4 or 5 in the morning, we believe it was either the subway or the elevators... Although I sleep well like a rock, this intermitent noise disturbed mine and my husband´s sleep. This noise ocurred in intervals of 10-15 minutes. We stayed on the 5th floor and had a hard time sleeping. Unfortunately this noise obscured our stay.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Do not stay here if you want to get any sleep..”", "Author": "DoctorLily", "ReviewID": "UR118583159", "Content": "Elegant, luxurious hotel with beautiful, spacious rooms. Friendly, helpful staff. Very expensive drinks in the bar downstairs but the live music was good. I ordered the club sandwich at the bar and it was good, so were the fries that came with it. The temperature in the shower alternated between scalding hot and cold. I spilled water on the bathroom floor. After I wiped it up, the towel was covered with dirt and long hairs from the previous guest. The noise and vibration from the train were unbearable. I didn't get any sleep my first night as a result of it. I was on the 2nd floor initially but requested to be moved to the 6th floor. The noise and vibration weren't as bad there but my sleep was still disrupted. El Palace is nice, elegant, and in a great location, but the noise and vibration made it impossible for me to sleep peacefully, and I'm not a light sleeper. I wouldn't stay here again even if it was free.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sydney NSW", "Title": "“Another world....”", "Author": "PaulaSydneyNSW", "ReviewID": "UR118487558", "Content": "The Doorman was appalled that I opened the front door myself and slipped inside unassisted. Another guest was standing in the opulent foyer, looking very much a \"Camilla look-alike\" I was looking around for \"Charles\". This hotel is everything you would expect of a Palace. Grand in style, abundant in offerings. Clean and well appointed, the room was large, lavish and very comfortable. I did hear the trains, but a mere distant rumbling and not at all annoying, the main train station is just two blocks away. I had lashed out on something special for my last night in Barcelona, and was not disappointed. I had breakfast at the city markets so can't comment on their dining services, I can only imagine they are in keeping with the rest of this hotel and are of an acceptable standard. It was fun to stay in this rather \"royal\" style of hotel.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "the netherlands", "Title": "“Traditional, beautiful hotel, right in the centre”", "Author": "fancytraveller", "ReviewID": "UR118364017", "Content": "Me and my husband stayed at the El Palace hotel in Barcelona this summer for 2 nights. We had received a very nice upgrade and the room was beautiful. The service was good, the hotel renovated, old luxury, and impressive. I found the breakfast to be good, but not the best I have had in 5 star hotels. There is a great bar in the hotel, where they serve cocktails and where time has stood still, very nice! They had a good housekeeping service, we always found our room clean and good turn down service. It's well positioned, in the city centre.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Alicante, Spain", "Title": "“Almost faultless stay”", "Author": "Shears43", "ReviewID": "UR118295653", "Content": "After an 11 day holiday covering Florence and Venice my Wife and I stayed here for two nights en route to our home in Spain. This is an exceptionally good hotel, well situated and with excellent service. The noise from the trains was minimal but we were on the top floor. The only problem was with housekeeping but this was soon resolved. Staff very helpful and accommodating. Would recommend and certain to stay again.", "Date": "September 19, 2011"}, {"Ratings": {"Location": "5", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Andalusia", "Title": "“Mixed”", "Author": "29692", "ReviewID": "UR118189000", "Content": "El Palace is in a good location, roughly between La Rambla and Gaudi's Sacrada Familia. Breakfasts are better value than you may think. A basket of croissants, bread rolls, danish pastries and pain au chocolat is 14 euros and perfect for 2 people (one each of all above) Beer in the hotel is the cheapest drink at 7 euros and is served with complimentary cheese straws, crisps and nuts. The house keeping is adequate but they should clean all blankets and bed spreads after each guest if possible to avoid what happened to me, a stained blanket. Mini-Bar prices are as you would expect but 5 euros for 0.5 litre bottles of water is more expensive than it should be for such a basic necessity. The concierge was average, nowhere near as useful as the tourist information office situated near Gaudi's La Pedrera. Overall, I found Barcelona worth seeing. It has good transport and walking around is pretty easy but I got irritated at the lack of information in Castellano and of how all plays etc are in Catalan. If you want to be in the best areas, check out the Starbucks, they are well located.", "Date": "September 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Excellence!”", "Author": "TheLearnedDoctor", "ReviewID": "UR118014234", "Content": "This is a beautiful hotel in a great location. The rooms and large, clean and comfortable. The bathrooms are very large and modern. Service was excellent. I highly recommend this hotel.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Best Staff, Old World Ambience”", "Author": "mego58", "ReviewID": "UR117960221", "Content": "My 24 year old daughter and I just did a mother daughter trip and stayed at El Palace Hotel. The Staff was very helpful(Concierge were great) and the service was top notch, Our room which was a junior suite was exquisite, everything down to the nightly turn down service to the quality of the linens. Everyone spoke English and being from the States I felt at home there. The one major issue I had was the constant subway noise that seemed to run under the hotel. It disturbed our sleep and I found it very unpleasant.We had room 126, so I would not suggest that particular room. we also heard the room service bell constantly as we were next to the butler's pantry.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dammam, Saudi Arabia", "Title": "“Wonderful Hotel”", "Author": "M_AlMajdouie", "ReviewID": "UR117950671", "Content": "I was shifted from Rey Juan Carlos I Hotel to El Palace due to electrical difficulties as the receptionist told me! Regardless the train little sounds ,and the internet way of serving, El Palace experience was totally great experience", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "houston", "Title": "“Elegant Rooms and Gracious Service”", "Author": "lyang", "ReviewID": "UR117872211", "Content": "I loved this hotel. It has such an old-world feel and the service is impeccable. Here, the doorman smiles, and the beds are always turned down for the evening. The room is gorgeous and the bathrooms are very nice. It's just like the photos. As a lovely surprise, we received a complementary bottle of cava for our anniversary. This hotel was near enough to the sights, so we always walked to the Gothic quarter, the Borne neighborhood, and Passig de Gracia. I am a spa-junkie and I had the most FABULOUS deep-tissue massage and facial at the Mayan Luxury Spa. It's not large by any means. You won't find pools and jaccuzies and their locker room is tiny. But what you will find is a very professional service and what they do is fantastic. I started off in their sauna, and the day just melted away. I was so tired from running from one Barcelona attraction to the other, that I needed this time for myself. It was so nice.. and quiet. Candles and lavendar smells. After my services, I was offered tea and fruit on their daybed. This experience definately exceeded my expectations. Husbands and boyfriends.. if you are reading.. surprise your ladies. Some negatives- Honestly, yes, you hear the rumble. We stayed on the 6th floor and we heard it. I don't think it was that bad, but I feel like it's a shame that this hotel has that problem. It's worse on the first floor. At the spa, during the service, I didn't hear it.. but I think I was really enjoying myself. I don't really know what the timings are for it.. but it seems very random to me. Another negative.. sometimes.. the water switches temperatures.. hot to cold.. but it corrects itself soon enough. Third negative.. though maybe not entirely their fault.. It's a European hotel, so it has European beds.. which means they have double hard/firm beds. However, they do not have European rooms.. because we thought our standard room was huge! Overall, fantastic stay.. some misses.. but I would stay here again.", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dublin", "Title": "“Pure Luxury !”", "Author": "landinglight", "ReviewID": "UR117577601", "Content": "We stayed here for just four nights and loved it. The hotel is well situated within walking distance of shopping and the Old Town. There are some small restaurants/bars nearby too. The room we had has beautiful and the bathroom had a massive shower and a sunken Roman bath. Breakfast was to die for ! I don't think I've ever seen such a selection before, and if you want something different, just ask. The Hotel caters for all nationalities. The staff very helpful and friendly. I would definitely go back.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York", "Title": "“Wonderful Hotel”", "Author": "Jonathan B", "ReviewID": "UR117534977", "Content": "We had the delight of staying in this hotel just as they were completing the renovations. We were not able enjoy the Bar downstairs that had a grand piano and beautiful antique brass coffee machine as the paint was still drying! However I did get to see where the athletic room with pool will be located in the future. The staff was attentive and able to answer questions and give suggestions. the location was righ in the center of everything, We walked a couple short blocks to eat Tapas and take tour buses. The concierge gave wonderful recommendations and when we decided to rent a car they had one available right at the hotel all taken care of...it was a brand new Mini", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Luxury and top-notch service”", "Author": "adamhach", "ReviewID": "UR117475894", "Content": "My wife and I spent 3 nights here in July while celebrating our anniversary - decided to splurge a bit on a nice hotel. This hotel is absolutely beautiful, with a turn-back-the-clock plush feel. From the moment walked in the door we were treated like royalty. We made a passing reference to the recent Wimbledon final and the front desk clerk - unsure of the outcome - called a concierge who ran over to fill us in on the details. This set the tone for the rest of our stay...the staff was always willing to go the extra mile. The room was very nice with a spacious sitting area and massive bathroom - which was actually split into two separate rooms - one for the shower and one for the toilet. Bed was comfortable. Nice bathrobes. High end toiletrees. Just an all around luxury experience. The location is also quite good. The Ramblas is a short walk away and the tony Eixample neighborhood - home to many Gaudi houses - is also very close. If this hotel is within your budget, you will not be disappointed if you choose to stay here.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Centreville, Virginia", "Title": "“Lovely hotel in a great location”", "Author": "VA_Newlywed_0813", "ReviewID": "UR117268578", "Content": "My husband and I stayed here before and after our Mediterranean cruise and loved this hotel. Everyone, from the doorman to the concierge to the housekeeping staff, was amazing. A wonderful smell permeated the common areas and the facility was very clean. The bathroom was beautiful and modern and the television was IN the mirror over the fireplace. The hotel offers turndown service and free wi-fi, but there's a catch. You must request a login from the front desk and it's good for only 1 hour per day. I've read that the hotel offers shuttle service to the airport and cruise terminal, but neither of these proved true. Still, the hotel was great and in a great location. We were two blocks from Las Ramblas and did lots of walking! There are also two metro stops within walking distance of the hotel, making it easy to navigate the city. An added bonus is that we arrived in Barcelona at 8:30am and were relieved to find that our room was ready and available for a nap after a long international flight. However this spoiled us because after our cruise returned to Barcelona we were expecting the same grace but found that the hotel was completely booked (9 cruises were coming and going that day) and had to wait from 8am until 2pm to get our room).", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Nice”", "Author": "AnaBt", "ReviewID": "UR117145856", "Content": "I stayed at this hotel at the beggining of the year and it was very good. It is all renovated and so comfortable - and I was in the smallest room! Also very classy, old style class Room: clean, spacious, beautiful decoration Bathroom: stylish, clean Breaskfast was fantastic (great variaty) ! - and in a really nice place Staff was kind and always there when you needed. Location: good but not great - near to a lot of touristic sites, but not so close either (walk to Las Ramblas takes around 15 mins). My only issues: 1) shower - it really changed temperature - boiling water to cold in seconds- and vice-versa in the middle of your shower! I hope they fixed it 2) train (?) noise : I think it was the train, or subway, and it went on day and night. Nothing too bad (but I was in 5th floor)", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Manchester", "Title": "“Fabulous Stay Truly 5 Star!!!”", "Author": "Salford66", "ReviewID": "UR116922860", "Content": "After staying at two other supposedly 5 Star hotels on my trip one being a new hotel and one modern I decided to go with something traditional and it worked. I was doing this part of my trip alone so I wanted to feel safe and I did. From entering the hotel to the day I left I was treated like a queen (albeit was August and not very busy, Barcelona residents leave town in August). The concierge team were my saving grace can't thank them enough. The maids were like little fairies, so quiet and discreet. The rooms were lovely although one complaint I had was the location of the TV it was on the side not in front of the bed but this is minor and only my personal preference. I was on the top floor and did hear the train but it was pretty distant and I got used to it after one night. Not sure how noisy it would be on the first floor? I did like the Gothic, Born area of the cIty for its bars and narrow streets but I heard that this was sometimes a little unsafe. I must also commend the beautiful lady who greeted me as I arrived and was constantly 'there'. She was so gracious and professional I think her name was Christine but I may be wrong anyway she was the best. All in all a truly 5 or 6 star experience, very rare in this day and age even at the most expensive hotels. Well worth it!!!", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Coutainville", "Title": "“No Doubt, The Palace is the Palace”", "Author": "Educoutain", "ReviewID": "UR116885410", "Content": "I had the chance to stay at El Palace last July. it has been from the beginning to the end a real luxury and personalized experience that few hotel in the world can offer to the guest. The welcoming smile and the generosity, humility and kindness of the staff warm my heart. The attention paid to details of the entire hotel, the rooms are absolutely top notch and immaculate. The restaurant, DO NOT MISS the gastronomic restaurant Caelis which has been a truly moment of pure sensation with the product and the style of the cuisine. Everything has been so well organized for me and my guest, thanks to two person who are a real plus in the staff and know what is the meaning of luxury service. POR FAVOR, ask for Katharina and Celine to have a memorable stay at the Palace and to feel the proper way of Barcelona. One point missing at the hotel, a swimming pool, but the hotel is not so far from the see.", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Kennesaw, Georgia", "Title": "“As Advertised”", "Author": "Danielle B", "ReviewID": "UR116817133", "Content": "What you see on their website is what you get. Great location, great restaurant and bar, and very helpful and friendly service. The bed was a little too firm for my liking, but I would recommend to friends and family.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "NY", "Title": "“Great hotel !!”", "Author": "NyFrequentflyer", "ReviewID": "UR116612492", "Content": "We stayed at the Palace for 5 nights in July and had a wondersful time. The hotel is gorgeous, the staff exceptional, and the room lovely. There are two very good restaurants in the hotel and many more within walking distance. A short walk to Las Ramblas for great people watching, eating, and starting hop on, hop off bus tours.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“What an amazing hotel; incredible service”", "Author": "Katherine6659", "ReviewID": "UR116582336", "Content": "After returning from our cruise we had one more night in Barcelona before flying back to the states. We arrived at the hotel around 9am and they gave us a room immediately. It was clear they went out of their way to find us an available room. The rooms was awesome, and the service Ritz Carlton quality. Beautiful living room with quaint bar. First class breakfast buffet next morning included in the room price was served in their atrium. Really beautiful, great service, delicious. There are many less expensive hotels, but if you are looking for high end or want to splurge you will not be disappointed.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "atlanta", "Title": "“Best hotel in Barcelona”", "Author": "swh-cv", "ReviewID": "UR116503832", "Content": "We were at your palace for one night prior to a cruise. It was gorgeous and the staff was beautiul. We will be back!", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "TN", "Title": "“Great for Business and Fun”", "Author": "JCFFB", "ReviewID": "UR116434025", "Content": "Very nice hotel. Great staff, even though the front desk was a little indifferent at times. The rooms were wonderful. Nice, clean, big, modern...really as nice as it can get in a big city European Hotel. The bathrooms were awesome. The locations is really ideal. Close to everything. easy walk, or easy cab ride to every where you want to go. The bar upstairs was good. The bar downstairs was amazing. live music, great bar tender. We went downstairs every night we were there. Hard to find much to complain about.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“I honestly have to say that this is by far one of the nicest hotels I have ever stayed at.”", "Author": "Wizeone23", "ReviewID": "UR116305466", "Content": "I have stayed at many 5 star hotels around the world. All modern and fancy and great service. This hotel is the old Ritz! Renovated. But still in keeping with the period furniture and brass railing on the stairs. The large swag drapes. Opulence from the 15-15th century with guilded furniture. If you like that, then this is the place for you. The staff was fabulous. And let me tell you I am fussy. We were served comp. champagne when we arrinved. Exactly what I needed! We I can keep going but no need. You get the idea. Oh its close to everything. High end shopping and the Ramblas, which is a fantastic shopping, eating, enterntainment marquise of Barcelona. A must see.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lithuania", "Title": "“El Palace - very nice place to stay”", "Author": "tico7676", "ReviewID": "UR116107783", "Content": "We enjoyed our stay in El Palace a lot. Room was neat and quite spacious. The location superb. Just couple of blocks from Catalunia square, Rambla and Pacei dei Gracia. The service was very good. Michelin star restaurant - outstanding food and good vine selection. The only thing which we didin't like - the metro beneath. You could feel the trains passing by, despite the fact that we were on the 4th floor. It was not bad, but for such a hotel it was a minus. Part from that - everything was perfect and we will gladly stay there once again.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Flower Mound, Texas", "Title": "“Beautiful Hotel, Good Location in Barcelona”", "Author": "Sevaer", "ReviewID": "UR115861079", "Content": "My wife, son, and I stayed here after our cruise for a few days. It is a beautiful hotel with a very nice staff. I liked that there were good restaurants nearby. We had a junior suite and it was very nice. Be sure to check the bar out downstairs, it is very cool with all the woodwork and just a neat setting. We were here on a Sunday and had the brunch at the hotel restaurant which is in an outdoor courtyard. It is beautiful the way they have it set up. Before our cruise, we stayed at Le Meridien near La Ramblas, and it was nice but much more expensive and I thought El Palace had more class.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Toronto", "Title": "“An elegant and peaceful hotel in the middle of Barcelona”", "Author": "Kanuckian", "ReviewID": "UR115849690", "Content": "I chose this hotel based on reviews on TripAdvisor - I was not disappointed and most of the reviews were accurate. I did not give the hotel 5 stars because of 2 things - the constant (but not too loud) noise from the underground Metro line, and the way that wireless internet is handled. If you want \"free WiFi\" - you have to go down to the hall or business center (which are very beautiful and comfortable), then ask the front desk for a \"code\" which allows you to use the WiFi for 1 hr - then if you need more time, you must go back to the counter and ask for another one. For a hotel of this caliber, they should understand that their guests want absolute comfort, privacy and convenience without being \"nickled and dimed\". If you want to stay in your room - no problem, it's just an extra 15 Euro/day for WiFi. Those are my only (small) complaints. The hotel is beautiful, the location is great - most of the sightseeing is easily within walking distance. The staff was outstanding and very pleasant. I would recommend this hotel to couples, families and singles for short stays in Barcelona.", "Date": "July 27, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Madison, Wisconsin", "Title": "“Elegant and great service”", "Author": "jmdubs", "ReviewID": "UR115575673", "Content": "Large rooms and bathrooms. Very clean. Great service. Turn down service with dark chocolates every night was a plus for me!", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Long Island, New York", "Title": "“Absolutely Perfect\"”", "Author": "HENAM73", "ReviewID": "UR115368972", "Content": "From the minute we stepped into the hotel, which was very early on a holiday morning, we were treated famously. Despite the early hour (9 AM) the staff was able to get a room ready for us and from there we were able to start our day touring in Barcelona. The breakfast room was magnificent with great choices and excellent service. The hotel itself is old world beautiful, the rooms are spacious and quiet (the subway underneath is really not an issue, don't let that bother you). The bathrooms are magnificent with rain drop showers and whirlpool baths. Service- outstanding, whatever you wanted was there in minutes. The concierges were very courteous and helpful. One of the best hotels we have ever stayed in. Centrally located, can walk to many attractions and the harbor. Expensive but worth every penny!!", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Beautiful hotel, wonderful staff!”", "Author": "rduke01", "ReviewID": "UR115358679", "Content": "Stayed here in early July and would heartily recommend it to everyone. Pricey, but definitely worth it. The hotel is first class and the staff are so helpful and friendly. Ask for Alexis in customer service....he is a great resource in helping with tours, sight seeing and restaurants. Loved every minute of our stay here! You do hear the vibrations from the nearby metro, but it is really no big deal. It would be nice if wifi was available in the rooms as well, but again, not a big deal, as internet is available in the business center.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "east hampton, ny", "Title": "“lives up to its rep”", "Author": "trigger18", "ReviewID": "UR115173645", "Content": "Arrived exhausted after a night flight from NY. The initial reception was a bit cool, as there was discrepancy over the date we were to check out. Rather than accept that I had reserved for 3 nights rather than 4, the desk attendant proceded to pull out a book of all correspondence and communication we had exchanged, apparently in an attempt to prove me wrong. No big deal, but certainly not an embrace of \"the customer is always right\" philosophy. After that shaky start all was wonderful. Javier showed us to our lovely room on the fourth floor and explained the workings of the room and its features with wit and grace, and he had a cheery greeting whenever we saw him during our stay. Room furnishings and the bath were not \"showy\" but definitely of a 5 star calibre. Can't imagine that the minor rumbling of the metro beneath the hotel could annoy anyone but the most finicky traveller. For us it was a non-issue. Hallways are wide and bright. The lobby is magnificent as is the breakfast terrace (although breakfast prices seem unreasonably high.) There is a bar at the rear of the lobby, but it is very quiet, and there is actually only table seating.....no bar stools. The place to go for more action is the scotch bar, down a staircase from the lobby. This relatively small room features a proper bar, 2 attentive and amusing bartenders, and live entertainment in the evenings until 2 a.m. Even the size of the pours seems more generous than the usually stingy European style. HIghly recommend a visit or two downstairs. The hotel is in a lovely residential neighborhood that's an easy morning stroll to several breakfast options, as well as restaurants for lunch and dinner. The major sites and shopping are also walkable or an easy cab ride. (Concierge service is great. There seemed always to be at least 3 or 4 on duty, and they arranged for a perfect private walking tour our first day in town.) Were originally scheduled to stay at the Mandarin Oriental but decided on a more Old World experience. After checking out the MO on the busy Passeig de Gracia I'm convinced we made the absolute right decision.", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Encinitas", "Title": "“Loved This Hotel and Barcelona. They made our stay Perfect!!”", "Author": "pixiecaribe", "ReviewID": "UR114997194", "Content": "My boyfriend and I spent 3-/12 days at the El Palace Hotel before departing on a cruise. This hotel did not disappoint!!! We had an early flight into Barcelona and as soon as we arrived at the hotel, the staff advised that they had held a room for us so we could get comfortable right away. Both of us I were blown away by the staff and attention to detail at this hotel. Nothing was overlooked. When I inquired at 10 p.m., before leaving for dinner, if we could possibly get additional pillows for our room the next day, the gentlemen immediately informed me that the pillows would be in our room upon our return that evening. His response was \"we are a 24 hour hotel, just let us know what and when you need something and we'll take care of it\". Impressive! The room was a very nice size, not huge but definitely big enough for two. The bed was super comfortable and the room was extremely clean. Our room was cleaned every day and turned down even if we left twice in one evening. They didn't miss a detail! Our room at the front of the hotel on the third floor overlooked the lovely boulevard and statue. The bath was beyond huge and was separated by a hallway with another door for extreme privacy. We could practically swim in the mosaic tub. We felt as if we had checked into a beautiful spa when going into the bath. The huge glassed in shower is separate from the tub and has a waterfall shower head directly from the ceiling. Felt so great, we never wanted to leave the bath!! From the third floor I have to admit you can hear and feel the rumble of the subway. It never bothered my boyfriend but it took me a day to get used to it. If you are bothered by noise and some light shaking, this aspect will annoy you. Also, the breakfast is very expensive. We had a continental breakfast included with our room. I ordered cereal and fresh fruit once and it was $22 Ouch! But there are option! One morning I walked across the street to the market picked up some fresh fruit and yogurt for about 3 Euro. There are many little restaurants close to the hotel so that is also a great option. I definitely would not let this aspect deter you as there are tons of options for breakfast and the hotel is just too fantastic to let those little issue scare you away. Also, buy bottles of water from the market across the street. To exchange money, there is also a bank directly across the street. Bring your passport! I did want to eat in their beautiful restaurant downstairs but couldn't justify the prices of an additional $20 per person or $40 per day. Perhaps if we stayed a week, we would have experienced it but there was just so much to do and see! Barcelona is a vibrant, exciting city with so much to do during the day and a place where the city really gets going around 9 or 10 p.m. for dinner. We loved this aspect of the city. You don't have to eat late but it is definitely part of the fun and part of the overall experience of Barcelona. We never had a bad experience. The architecture, art, food and people were everything that we had hoped for and more! We would leave for dinner at 10 p.m. and stroll through the streets. We would finish up around Midnight or 1 a.m. and would walk back to the El Palace. We never felt any fear. Of course, it is always good to be aware of your surroundings and not pull wads of cash out in public. Tthere are pickpockets, as everywhere, but if you exercise good judgement and keep your valuables in front pockets and purses in front of you and walk with confidence there won't be any problems. Also, ladies, don't hang your purse on the back of your chair especially in outdoor cafes. The hotel is in a fantastic location with easy walking access to everything. Places not to miss! Sagrada Família - Make sure you go inside ... Incredible!!! Casa Milà (don't miss the roof terrace). You might want to take the elevator as it is about 12 flights and pretty exhausting. Anything and everything Gaudi. Las Ramblas - Experience it both day and night - Completely difference experiences.. During the day a must see is Mercat de Boqueria, this is the most amazing marketplace ever! Sights, sounds, colors & smells - Beautiful!! Walk all the way to the end of Las Ramblas, you won't be disappointed. Eat tapas late at night, one recommendation is Divinus which is about 4 to 5 long blocks from the hotel. Yummy! We also ate at 4 Cats which we also loved. I believe it is located in the Gothic district another area of Barcelona which is terrific to explore! Narrow alleys filled with shops, tapa bars, cava bars and apartments. You'll have to ask the hotel for the location of 4 Cats, it is pretty tough to find located in a narrow little alleyway but well worth the experience to find it! Too much to see in just three and a half days! Day Three, we took a day trip to Montserrat for Cava tasting and a vist to the Basilica. It was above and beyond and worth the hour trip each way The Benedictine Monk retreat and Basilica is spectacular with amazing views of Catalunya. After visiting the Basilica take the cable car to the top of the mountain to experience magnificent views of the very unusual rock formations and breathtaking views from every direction. You will be blown away by the views. Wear good walking shoes and take time to explore!! We can't wait to return to Barcelona and we will definitely be back to El Palace Hotel where we received a warm, warm welcome every time we walked in the door! We belong to Leading Hotels of the World and received some very nice perks such as free Continental breakfast, early check-in and free in-room Internet. If you forget to pack something, there is every shop in the world in Barcelona. Save room in your luggage to bring home some treasures. Please don't hesitate to contact me if you have any questions - karsd@aol.com. Above all else, Enjoy Barcelona", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Big Disappointment, Poor Value, Surly Reception, and TOO MUCH NOISE AND VIBRATION!!”", "Author": "SaraMB", "ReviewID": "UR114931484", "Content": "Barcelona was our last destination on our two week visit to Spain and I thought I had saved the best hotel for last. Boy, were we disappointed. The check-in process was the poorest service we received after staying at several wonderful and welcoming hotels in Spain (including the Westin Palace in Madrid, the AlmaSevilla and the Hotel Alhambra Palace). The male receptionist was downright obnoxious and impolite. Also, when I asked for a room on a higher floor to avoid the rumble of the subway, he sneered at me and said that he was not aware of any noise or vibration and that the 2nd floor would be fine for our Junior Suite (this conversation took place while several trains shook the reception area). Well, he was of course very very wrong, the vibration at this hotel is quite intense throughout the property and we were moved to the 5th floor later that evening, but it was still about the same. We also had to wait over an hour for our bags to be brought up to our room after check-in. The bellhop seemed very out of sorts when he finally arrived and told us he was too busy. (understaffed property??) Also, none of the check-in staff told us about ANY of the amenities of the hotel. I had to make a point of stopping by the concierge desk and asked them directly, something all our other hotels always make a point of doing (isn't that part of good service??). In addition, when I called housekeeping and the front desk for service in our room, the phone just rang and rang. No one picked up at housekeeping and the front desk didn't answer until after about 15 rings. Deeply frustrated with paying more than $600 a night for terrible service, I went down to the front desk and complained. They listened while I spoke, but were still generally unhelpful and unwelcoming. While the room was clean, the size was no where near what we expect from a Junior Suite, just the size of a regular guest room. Also, the sheets were not of good quality and so filled with pilled areas that it rubbed against my legs and disturbed my sleep (that is when I finally did fall asleep from the metro noise and vibration). The best part of the room was the bathroom which was spacious. They have a \"pillow menu\" which is a joke since they don't really provide any special pillows at all. One other point worth mentioning, the key they provide is a regular key with very large key fob tassle which you much drop off everytime you leave the hotel. So, when you return, you have to stop by the concierge to pick it up. This presents two problems: 1) If they are helping someone, you will have to wait quite a long time while until they are finished, 2) they never ask for any identification which made me feel uneasy and questioned their security since at times it was a new concierge who had not seen us before. There were other issues with the restaurant and concierge service too (ex. no reservation as promised when we showed up at a restaurant) but I don't want to make this review any longer than it already is! We would never stay at the property again. It was a complete dissapointment and overpriced. Be forewarned if you choose it, you will not have a restful satisfying stay. This is definitely not a 5 or even 4 star property. BE FOREWARNED IF YOU CHOOSE TO STAY HERE!!!!", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Couldn't have been better !”", "Author": "caferaca", "ReviewID": "UR114804567", "Content": "From the moment we walked in to the time we left we were treated like Kings. Wonderful staff and service, and an upgrade to a Junior suite! When we are next in Barcelona we know where we'll be staying :)", "Date": "June 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Covent Garden", "Title": "“Wonderful stay”", "Author": "AQ_gooner", "ReviewID": "UR114783027", "Content": "We were there for our honeymoon and the place was wonderful. Great location and excellent staff", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "The Hague, The Netherlands", "Title": "“Simply the best”", "Author": "Hawet", "ReviewID": "UR114647278", "Content": "This is the second time we stayed in the centrally located El Palace, and it was just as wonderful as last year. As a welcome present we had a box of chocolates in the room, and a free glass of champagne in the bar. We had a \"classic de luxe\" room, large and very comfortable (with two easy chairs, working area, etc.). The TV screen, when not in use, is a beautiful big mirror, and the minibar is hidden behind a trompe l'oeil wall panel. Beautiful bathroom, with separate shower. WC behind sliding door. A beautiful orchid in the bathroom, also lots of l'Occitane toiletries, and, needless to say, bathrobes and slippers. The turn down service each night was impeccable: of course the beds were made ready for the night, curtains were closed, bedlamps were put on – but also the bins were emptied, we got clean towels, clean \"bed mats\", chocolates and some reading matter. The beds were very comfortable, and the far-away rumbling of the metro, which is mentioned in one of the reviews, didn't bother us at all. In the morning we got the newspaper of our choice. Breakfast (a lavish buffet, with freshly pressed juice) is in the lovely Garden restaurant. The lobby is a sumptuous affair, all chandeliers and antiques, but somehow very welcoming. At the end of the lobby is the AE brasserie, which is open from 11.00 AM to 23.00 PM, and where we had a very good lunch. But don't forget to have dinner at the Michelin starred Caelis restaurant , which is just about perfect. There is also a downstairs bar (open from 18.00 PM), often with life music, but we did not go there. One word about the hotel staff: they really make you feel welcome, giving excellent service with a smile. (E.g.: the concierge looked up some trains for us, and even called the station to find out from which platform they would depart!)", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Comfortable, Elegant and Grand”", "Author": "cmoc-h", "ReviewID": "UR114537177", "Content": "We stayed for 2 nights in this delightful hotel in a classic deluxe and it was extremely comfortable. The staff are so welcoming and helpful and the bar service is really slick. We were on the third floor of the hotel overlooking a side street and only felt the occasional rumble from the metro but it certaintly didn't keep us awake and the soundproofing is so good there is no traffic noise either. Our room was spacious with a wonderful roomy bathroom that had 2 sinks, bath and great rain shower along with L'Occitane toiletries. The hotel drinks are very expensive but then it is 5 star but the bar is beautiful. (Euro 14 for a Bloody Mary and Euro 7 for a coke / coffee / tea). Perhaps if they lowered their bar prices slightly more people might stay to have a drink (bar was always very empty). There is also a lovely outside patio area where you can have drinks and breakfast and there is also a downstairs cocktail bar with live music from 10.30. We didn't eat in the hotel. We had breakfast each day at Farga a 5 minute walk along Grand Via just past Passeig Garcia. We would definitely return to this hotel and Barcelona has so much to offer the holidaymaker. The hotel does not offer free wi-fi but there are terminals you can use.", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "essex", "Title": "“Good location but noisy”", "Author": "cricketfan99", "ReviewID": "UR113620139", "Content": "Spent two nights at this elegant old hotel. Impressive public rooms and good central location. Staff were pleasant and helpful. The hotel would appear to sit on top of the Metro and our bedroom shook each time a train passed. The room itself was of good size and quite comfortable - the bathroom was well equipped. Breakfast was adequate.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Excellent Service”", "Author": "ACLosAngeles", "ReviewID": "UR113094823", "Content": "We stayed at El Palace for three nights. Since we had arranged to stay in a \"hip\" hotel in Madrid, we opted for a traditional, old-school hotel in Barcelona. There is something to be said for traditional and old-school service that you just do not get in any of these younger, hip hotels! The hotel was renovated about a year or two ago, and it is very elegant, opulent and beautiful. The service is, in one word: impeccable. The staff was definitely formal and ready to serve at a moment's notice, but there was always an underlying friendliness and warmth - in other words, I never felt them to be \"snooty\". We are part of the leaders club, so we were given an upgrade to a junior suite. We stayed in room 329. There was no view, but the room was located in a corner of the hotel (not sure if it was side or rear of hotel) and was very, very quiet. It was quite generous in size, and the bathroom was separated into two separate rooms. One room held the commode, with a large and spacious vanity area; the other room was another large vanity area with two sinks, and a large shower with wonderful hot-hot-hot water and terrific water pressure. The towels were fluffy, and they provided slippers and robes. To give an example of the impeccable service, I requested an iron and ironing board to touch up some clothing. I was told it would arrive in \"one minute\". In what seemed like 45 seconds, they were knocking at the door. I didn't stand there with a timer or anything, and cannot promise you it was less than one minute, but for sure I can tell you that the iron and ironing board arrived in less than 2 minutes! The same thing happened when I asked for a bucket of ice. Unfortunately, my husband and I were both taken ill on our last day in Barcelona. A few hours later, when we were not feeling better, we asked the concierge to send a doctor. Again, with impeccable service, the doctor was knocking on our door in less than 15 minutes. He prescribed medication, and within a few hours were on our way to recovery and were able to travel to London the next day as scheduled. The staff couldn't have been nicer - they didn't bother us while we were sick, and upon checkout inquired if we were feeling better, and expressed how sorry they were that we missed our last day of site seeing in Barcelona. The hotel is in a great location. It's walking distance, but away from the noise and craziness of Las Ramblas and the Boqueria. It is also walking distance from Sagrada Familia and La Pedrera. It is a cab ride away from Park Guell, which I highly recommend. I thought it would be \"just a park\", but it is so special and amazing! Park Guell is located on a hilltop, and even though I am a person that likes to walk, I opted for a cab as it was a warm day out. It is a long walk to get to the beach, but if you are a walker and if you are out and about exploring, then you will not find it to be that far. If you don't like to walk that much, then it is probably a quick cab ride to the beach.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic hotel with great service and location”", "Author": "yakinamac", "ReviewID": "UR112284645", "Content": "We stayed in a deluxe double room at El Palace for four nights, and had a wonderful time. The staff were charming and attentive, the room spacious and beautifully furnished, and the bathroom (we didn't have one of the Roman baths) very elegant, with both a bath and rainwater shower. The public rooms are opulent and comfortable, with breakfast in the garden/conservatory a relaxed and tranquil affair, served until the supremely civilised hour of 11am - for anyone, like me, who's not a morning person, this is as good as it gets. The hotel is well situated for exploring Barcelona, just a couple of roads away from the shopping and street performers of La Rambla, and within easy walking distance of Gaudi's Sagrada Familia and Casa Batllo. It's a little further to the marina and beach, but still very easily walkable. Overall, El Palace is a gorgeous, romantic hotel, well worth the money. Can't imagine wanting to stay anywhere else in Barcelona.", "Date": "June 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Victoria, Canada", "Title": "“Fantastic hotel, loved the Roman bath.”", "Author": "Laurie M", "ReviewID": "UR112103359", "Content": "Beautiful hotel, excellent product in room. Loved my Roman bath. The champagne in the grand lounge was excellent and the room itself fabulous. The new night club is uber cool. I had a small problem with the pillow menu. Requested a special pillow as I've a problem neck. Received it the first day, the second day it was taken from our room. Three pillows delivered to room later the second night we're all wrong. Finally got it back day 3. Ordered a car to the airport , the driver was 20 minutes late. We we're trying to phone the hotel when he finally showed up. For $117 Euro he should have been waiting at the airport. Small problems as hotel is fantastic, staff friendly and helpful!", "Date": "June 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“excellent”", "Author": "joseywales1900", "ReviewID": "UR111448778", "Content": "This was one of the best place we stayed. Great staff. Very helpful with everything. Thanks a million.", "Date": "June 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Bournemouth, United Kingdom", "Title": "“Fantastic hotel with excellent service”", "Author": "david_dean24", "ReviewID": "UR111247263", "Content": "Well what can I say, this hotel was perfect in every single way. I made the booking some months in advance as a surprise proposal for my now Fiancee. I emailed the hotel for assitance with champagne, chocolate covered strawberries and flowers for our room upon arrival and they were only too pleased to assist. They even gave us a guided tour of the hotel upon arrival. We were upgraded to a lovely room with a fantastic lighting system. The bathroom was very luxurious with all the added extras you would expect in a 5 star hotel. The mini-bar in the room was expensive, but to be fair they usually always are. Breakfast is a surcharge, so we decided to actually eat out. Barcelona is expensive, but it seems that most cities within the Euro zone are equally expensive. The hotel was perfectly located with only a short walk into the main centre. Do be aware though, that Sunday's are very quiet, with the majority of shops closed. Highly reccomended.", "Date": "June 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gulf Coast", "Title": "“Fabulous!”", "Author": "travelzalot08", "ReviewID": "UR110151456", "Content": "Lovely room, terrific bathroom, excellent customer service and Great Location.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "None", "Title": "“Beautiful hotel, great location, but some issues . . .”", "Author": "Travelleraroundthewo", "ReviewID": "UR109987660", "Content": "We stayed at this hotel last week. The building, location and interior are fantastic. This was the former Ritz but apparently lost its Ritz status about 8 years ago, according to hotel staff. We had requested an upper floor. Upon check-in they upgraded us to a junior suite. The room was newly rennovated and fanstastic. Style, service and the rest was great. It is near the Passeig de Gracia street and metro stop so it is very convenient but out of the circus of La Rambla, etc. The issues we had are that the hotel is still trying to be the Ritz with its drink prices, etc. Mini bar items were between 5 and 15 euros. A chocolate bar was 15 euros. A beer in the bar was 8 euros. Just a bit out of touch for what it was. Second, the lights flickered on an off the first day we were there but stopped doing that for the rest of the stay. The shower pressure and temparture were horrible. It would go from normal to almost off then hot to cold every few seconds. Not in keeping with the beautiful rennovation on this bathroom. The biggest issue, and likely the cause of the loss of the Ritz name, is that the metro runs under the building. Many said it is not a big deal. We were on the top floor and could still hear/feel it. It felt like a mini earthquake every 15 minutes. I asked the reception about it and at first he said he didn't know what I was talking about then said it was the metro but it stopped at midnight. It does NOT stop at midnight. We heard/felt it all night long. Reception said it affects every room. Finally, watch the pickpockets, purse thieves and the (dishonest) cab drivers in Barcelona. They are everywhere. We saw a nicely dressed guy in a nice restaurant try to snatch a girls purse. When we were checking in one of the guest had been pickpockted on La Rambla. Two and perhaps 3 cab drivers tried to rip us off. One took us for a long ride and then dumped us at what he said was our stop. I got out and told him I would pay him once I verified. When he realized I had got him he sped away without us paying but leaving us stranded in a strange neighborhood. I speak spanish but they all pretend to get lost and take you accidently to the wrong place/hotel. So beware.", "Date": "May 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Rooms": "4", "Service": "3", "Location": "3"}, "AuthorLocation": "hilton head", "Title": "“Nice hotel but a few flaws”", "Author": "msdillo", "ReviewID": "UR109954679", "Content": "We stayed for three nights here. The location is good, if somewhat noisy. The room was fine, pretty large and had a fireplace with a TV in a mirror over it. A young lady found us as we were checking in and was very helpful in recommending restaurants, giving maps, etc. There were two negatives, however. There is no free WiFi in the rooms and if you use the business center (which is free) you only get an hour at a time. Then each time you want to go back, you need to get a new password from the desk. Very awkward. This was the only hotel on our trip that didn't offer free WiFi so they should fix this. The second neg was the breakfast. It is held in a room that is really outdoors and can be quite chilly in the morning. They do have heaters they can turn on if you ask. The hot items on their buffet were consistenly cold. Cold, runny eggs, cold bacon and sausage, etc. And don't go to their basement bar - the drinks are outrageous.", "Date": "May 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Clacton-on-Sea, United Kingdom", "Title": "“Best Hotel I have ever been to!”", "Author": "Bigm64", "ReviewID": "UR109824135", "Content": "This was a trip to celebrate a special birthday for my partner, and this certainly turned out to be a special one!!! I contacted the hotel prior to departure from the UK, to order some champaign for the room on arrival, a massive surprise was waiting at check in, they had upgraded our room from a basic booking to a Junior Suite, and the champaign was on ice, in the room (Absolutely fantastic), this hotel is the most luxurious I have ever been in and our room was stunning due to its decor and comfort, the bathroom was out of this world! The staff are very friendly, all spoke english and very courteous and we were made to feel very welcome. The hotels location is only a short walk (10 minute or so) from all the transport links and La Rambla, and is located on one of the very beautiful tree lined streets a few minutes from Placa Catalunya. We had a wonderful stay, loved this hotel and its little personal touches. A very big thank you to the Hotel management and staff, for a wonderful stay.", "Date": "May 25, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "london", "Title": "“Standards need raising”", "Author": "buitenverwachting", "ReviewID": "UR109508161", "Content": "Arrival is unimpressive - waiting 10 minutes for a porter to take up one's luggage is sloppy and having only two lifts make coming and going laborious - especially when staff use them as service lifts. The general impression is that the hotel is understaffed, reinforced by the room service number being eternally engaged. The room was a mess - dar, with heavy unmatched furnishings and cheap-looking built-out wardrobes. The bathroom was good but spoiled by a bidet mounted so close to the wall to be unusable. The breakfast is good but overall we were most disappointed, feeling that the hotel was better five years ago before the refurbishment. Altogether not worth five stars and not to be revisited.", "Date": "May 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Everything was fine”", "Author": "LEVA_O", "ReviewID": "UR108918224", "Content": "Very friendly hotel, offering quality service and has a convenient location. Comfort rooms, pleasantly decorated and always thoroughly cleaned. A fairly wide selection of dishes for breakfast. Staff attentive and friendly. I would recommend this hotel for everyone`s stay in Barcelona, and gladly dwell in it in my next visit to this amazing city.", "Date": "May 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Grandeur and style to match the city..... Excellent”", "Author": "Gerryp58", "ReviewID": "UR108341541", "Content": "Good Location to give access to all parts of Barcelona. Superb room high above the traffic with soundproofing which really works! We may well have had the best room on the corner sharing a balcony with giant cherubs . Classy service and excellent (though not cheap) breakfast experience. The rain shower is as good as they say. About the only fault is the omission of complementary mineral water in the room.", "Date": "May 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“REALLY GRAND”", "Author": "Rodolphe", "ReviewID": "UR107857082", "Content": "outstanding service, most comfortable rooms with great bathrooms and excellent bedding, bathroom amenities could be less common. Incredible breakfast in the interior courtyard - Excellent Rolf MB Paris", "Date": "May 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“A Fabulous Stay in a Truely 5-Star Boutique Hotel”", "Author": "1rameses2", "ReviewID": "UR107352695", "Content": "We felt very much at home in this very luxurous hotel. The Reception was friendly & courteous. We were led to our room by the staff personally. Our Classic Delux room was large & very comfortable. The Bath-room was more than adequate & well fitted; the shower stall with the over-head rain shower was so heavenly that we could easily have spent the whole morning/evening inside.Breakfast was a delight in the covered Garden. And best of all was the free 24 hours daily wired high-speed internet service. The location of the hotel was very central with the shops & sights all within walking distance.We have no heasitation in recommending Le Palace Hotel to tourists visiting Barcelona.", "Date": "May 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boulder, Colorado", "Title": "“Prettty Good Hotel, But Not The Best”", "Author": "2travelnlife", "ReviewID": "UR105386993", "Content": "I picked this hotel becaue of he reviews on Trip Advisor and it was prettty good. I'd recommend it and I'd probably stay here again. Price a bit high, but location and decor worth it!", "Date": "April 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Lancashire", "Title": "“Absolute luxury with friendly relaxed service - perfect!”", "Author": "sallyf49", "ReviewID": "UR105360013", "Content": "I was a little daunted at first by the grandness & luxury of El Palace but within seconds I felt comfortable & relaxed due to the warm welcome of all members of staff. Nothing was too much trouble. Everything about the room was wonderful - the Roman Bath room is amazing! In spite of it's location at a busy junction, there was no traffic noise at all. El Palace is expensive, as you'd expect for a luxury hotel - but worth every euro.", "Date": "April 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Totally Awesome!”", "Author": "Missninnewyork", "ReviewID": "UR105156359", "Content": "The Hotel was comfortable, clean and Gorgeous! the Staff helped in finding local spots to eat and tips a nd direction on site seeing and night life. The recently renovated rooms with a victian like decor and madernized bathroom with a deep relaxing bath tub and rain fall shower. The Hotel has an amazing contnential breakfast , which happened to me incuded in my package. What a variety in breads, grains and pastries, basic eggs and beans and extensive savories in cured meats, cheeses and smoked salmon, fresh juices and (Cava) ,Champage. Really got me through the day of exploring the wide spead city. Also in the evning , althogh the drinks were a bit pricey ,the top shelf liquor and the craetive garnishes garnishes made them well worth in the amiance of the scotch bar! Beautiful decor and fabulous entertainment and an extremely central location , thumbs up times infinity!", "Date": "April 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Recommend”", "Author": "Formulieraan", "ReviewID": "UR104869202", "Content": "El Palace is a genuine 5-star where everything is just right. Except maybe the bar downstairs who has drinks in a very high price range and is deserted for most of the time. Other than that, there isn't anything bad we could say about the place. My room was clean and nicely decorated, airport pick up worked out well and the service in the hotel is firs class. I recommend this hotel to everyone.", "Date": "April 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“five star hotel ruined by three star management”", "Author": "noah2366", "ReviewID": "UR102969675", "Content": "The building is lovely, the proportions, size and window light of all the rooms reminiscent of the hotel's hey day as the Ritz. There remain a great many glimpses of that greatness. The welcome on arrival, the grand foyer and the spendour of the Great lounge. In hotel of this quality - and frankly in a guest house of no quality - there is just no excuse for complete lack of hotel wifi. There is some sort of pay per access system. That of itself would be annoying when €2 on a room rate would leave them ahead of the game but it isn't just the money. The system available - even on their own PC's in the \"business suite\" - requires entering personal details including email address and a valid mobile number so that one can receive spam for years to come. Utterly hideous. And then there were just an array of little details betraying the fact that the owners of this grand old place simply don't have 5 star DNA. Some would be easy to overlook or forgive except that this hotel is brand new after a two year refit. So many silly little cost saving corners have been cut that the place is the shape of a football! The bathrooms have cheapest most hideous toilette tissue that no guest in this hotel will ever have in their home. King size beds (in all three of the rooms of our group) made up by pushing together two singles, Not just separate divans and separate mattresses but even the three inch thick mattress toppers were separate so that only the polycotton sheet joins them. Hiding the flat screen TV behind a mirror might have seemed like a swish way of maintaining a period look, but the TV maker uses a mirror and frame from B&Q which would never have graced a room in this hotel otherwise. Meanwhile the TV itself is so small in a postage stamp in the centre of the mirror so that subtitles are barely readable. No DVD player, no ipod connection, no radio, no usb connection. On the plus side there is a tremendous basement bar with live music which makes you feel you have stepped back 70 years. The food is is fine and served in decent quantity if not terribly exciting. The position is great and an easy walk to all the good bits of Barcelona (a fairly long walk to the beach but ok).", "Date": "April 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Santa Barbara, California", "Title": "“Our most favorite hotel on our trip”", "Author": "AmyLee4", "ReviewID": "UR102705147", "Content": "Loved, loved, loved this hotel. The room and the bathroom were very well appointed and incredibly beautiful. We received very personal service from everyone who worked at the hotel. Great dining recommendations from the concierge. We will definitely stay there again.", "Date": "April 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hannover, Germany", "Title": "“Pure quality and exceptional service”", "Author": "HookEm95", "ReviewID": "UR102627038", "Content": "El Palace Hotel is by far the most elegant hotel that I have stayed at in Europe. The staff are committed to service. We were greeted upon arrival by Celine who showed us around the hotel and took us to our room. We had a Privilege Junior Suite with our 7-year-old. The suite offered a very large bedroom with flat screen TV, connecting sitting room with flat screen TV and an enormous bath - I mean HUGE! Double sinks, closets, separate tub and shower, plus separate water closet. The suite also had a separate half bath with sink and toilet which is great when you have a child with you on vacation. When we came back from sightseeing for a few hours after checking in, we were surprised to see a wonderful treat waiting for us - Cava, orange juice and a lovely cake - all of which we enjoyed after dinner at the hotel's casual restaurant. Plus they had made up a rollaway bed for our daughter and left her a lovely plush bear to take home. All in all, an excellent stay that we will always remember. FYI - make sure to go down to the new bar and try both the Mojito and Espresso Martini - they are THE BEST!", "Date": "April 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stourbridge, United Kingdom", "Title": "“Elegant hotel with friendly and helpful staff”", "Author": "Scoop124", "ReviewID": "UR102429459", "Content": "We spent 6 nights in this hotel and enjoyed every minute. Our room was comfortable, spacious, well laid out, bright and had windows overlooking the Gran Via. Little touches like the walk in wardrobe and bathroom separated from the bedroom by a passage were really thoughtful. We were on the third floor and yes, we could hear the metro rumble, but we didn't find it intrusive. The staff could not have been more helpful. If you are staying over a Sunday, the afternoon brunch is superb and well worth the price. The hotel is well located and most of the sights are within walking distance. We found the Metro really easy to use for getting to places like Park Guell", "Date": "April 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Very clean, good location,excellent rooms and staff.!”", "Author": "STD2011", "ReviewID": "UR102324034", "Content": "My only suggestion is to use coffee jars for filter coffee in each table with the essential milk at the breakfast rather than waiting the staff to refill your cup .", "Date": "March 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Drexel Hill, Pennsylvania", "Title": "“Wonderful hotel... feeling of the \"Ritz\" back in the days!”", "Author": "petpringles", "ReviewID": "UR102251496", "Content": "But with the updated comforts of home...maybe even better! A short walk from the Plaza Catalunya...we found the staff ready to cater to us in ever way. From the doorman to the concierge to housekeeping...top service! Turn down service with chocolates to booking our tours...wonderful service abounds. The room we were given was just magnificent...over looking the Gran Via Corts. The room more than lived up to expectations with all the amenities. Starting with the room lighting...fantastic. Sensors for lights on the hallway turns on automatically, the size of the room and elegant style but the best part was the bathroom. With forest rain shower effect that will pamper anyone. We have stayed in many luxury hotels and this hotel is in the lines of the St. George Palace Hotel in Athens and Luna Bagliolini in Venice or even the Grand Hotel Europe in St. Petersburg. The noise from the tram is a minor nuisance and the room can use coffee makers...but that's all we can think of that can make the stay greater. Coming from Belgium prior to Barcelona where we stayed at Royal Windsor Hotel by the Grand Place...this hotel wins by a mile. Warm staff, wonderful hotel, beautiful city...makes a perfect ending to a fantastic European vacation.", "Date": "March 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great hotel, perfect location”", "Author": "nitti", "ReviewID": "UR102185043", "Content": "We stayed here for 5 nights with our 16 year old daughter who was finishing up an exchange program in Barcelona. The staff went out of its way to make sure we had an enjoyable stay - - you could tell that they are knocking themselves out to bring back the old Ritz glamour and hospitality and it shows. We booked the Junior Privilege Suite and it was perfect for the three of us, king bed, nice sitting area, and a high quality rollaway that was set up for our daughter and made up with all the best linens. We loved the huge dressing room/closet that gave everyone privacy. The piece de resistance; however, was the bathroom which was the largest we've ever had in Europe. Enormous tub, separate walk in shower, large enough for four people with two overhead showerheads and two hand held shower nozzles, L'Occitane bath products, loofah sponges, thick towels, bathrobes, slippers - the works. And a good size toilet area within the bathroom but containing a heavy high quality door for privacy. Could not have asked for anything else. Reading lights everywhere and accessible. Motion detector light that went on and off in case you had to use the bathroom at night. Large screen tv with a swivel. We had a back room so it was also very quiet. And there is simply no better location - - we walked all over the city from our hotel with ease. My daughter's host family, who have lived in Spain for generations, confirmed this - - saying they couldn't imagine a better located hotel. All in all a wonderful place!", "Date": "March 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bangalore", "Title": "“Period hotel close to downtown”", "Author": "tvarad", "ReviewID": "UR101673216", "Content": "Stayed there for three nights in March and had a great time. Rooms were top quality as is to be expected at a property of this level. The period theme of the property makes it very pretty. The included breakfast had a lot of variety. It's within walking distance of Las Ramblas - the main tourist drag, the port area and also the old city. Staff was polite and extremely helpful. The only caveat is that they don't offer unpaid wi-fi which I find puzzling since they provide ethernet access included in the hotel room price. Other than that, I have no complaints about the hotel.", "Date": "March 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great Elegant Hotel – Highly Recommended”", "Author": "gumber1", "ReviewID": "UR101483499", "Content": "Pros Great, elegant, lovely hotel at a reasonable rate. Rooms were great; spacious with a huge bed, walk in wardrobe and a small balcony. Nice bathroom and no problems with the shower temperature. Location was good being close to the main square (Catalunya) and a few Metro stations. The staff were friendly and helpful. Cons I asked for a room on a high floor away from the lift and noise of metro. Unfortunately none of these requests were adhered to. To be fair I didn't kick up a fuss as we had a room looking out onto the street, with a balcony. Food in the hotel is very expensive (28 Euro for breakfast I think) and unfortunately the noise from the Metro can be pretty annoying at times.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rhode Island", "Title": "“Such a wonderful home away from home in Barcelona!”", "Author": "KRRI", "ReviewID": "UR101448395", "Content": "We were spoiled rotten by El Palace from the moment we arrived. Everyone is delightful, kind, thoughtful, helpful, and VERY willing to make the extra effort on your behalf. We had a dinner reservation one night at a VERY obscure restaurant (La Luna-you MUST go!) and ad Con Gracia (don't even think about NOT going!) and even the door man made the extra effort to explain to the cab driver where in the world we were going in Barcelona. The concierge were equally as helpful and the rooms, beds, bathrooms, were all exactly as one could hope for. The biggest plus - AFTER the incredibly attentive service - is the perfect location!! Don't hesitate to stay here - you won't be disappointed!!!", "Date": "March 24, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Toronto, Canada", "Title": "“would stay at this hotel again in an instant FABULOUS”", "Author": "harper8", "ReviewID": "UR101379447", "Content": "beautiful lobby, beautiful guest rooms, beautiful terrace for breakfast, excellent and attentive staff, perfect location, short walk to all major tourist sites, bottle of sparkly in room on arrival, perfect way to start a vacation!", "Date": "March 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Telford, United Kingdom", "Title": "“If you stay in Barcelona - stay here - wonderful hotel”", "Author": "Jandini", "ReviewID": "UR101036564", "Content": "Beautiful hotel, impeccable service and friendly staff made our stay for my husband's 40th wonderful. We booked 2 nights here and 2 nights in the AbAC hotel - wish we had booked the full 4 nights here. Love the coctail bar with Live band playing at 10.30 and 12.30 - so perfect way to end an evening out. Stunning lounge and breakfast rooms - we pushed the boat out and had breakfast there just once - 30 Euros each! - pleasant enough but was likewarm - but tasty. Overall if I go to Barcelona again - I would definately choose this hotel - cash permitting. Not the cheapest place to stay - but worth every penny in my book. Location is very good - walkable to Cathedral, Las Ramblas and Placa Cataluna etc so a very good base if you want to walk to some of the sights. Overall excellent hotel.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Great hotel---some suggestions though”", "Author": "dgelbard", "ReviewID": "UR100935172", "Content": "This hotel is luxurious and beautiful and in a great location. The staff are friendly and the hotel is good value. We booked more than a month in advance on booking.com and got a great room for €140 the first night and €160 the second night which is amazing value for a 5 star hotel. The place has L'Occitane toiletries and cool mirrors that double as TVs. My only complaints are that the beds are hard and the pillows aren't great, and the guys at the check-in desk were not very friendly. One of them even took a personal call on his mobile phone while he was checking us in. He didn't really greet us or seem welcoming. But the rest of the staff were very nice. We will stay there again when we come to Barcelona!**Just make sure you stay on a high floor since the Metro runs underneath the hotel and rumbles a lot", "Date": "March 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Large, Luxurious Room and Bath”", "Author": "westvillagelady", "ReviewID": "UR100263929", "Content": "We stayed six nights at El Palace last week on our first trip to Barcelona. It was truly a five star hotel experience. The hotel has been recently redone in opulent style. The lobby and other common spaces, including a majestic courtyard to take breakfast on (although we wished this was open all day, especially in the afternoon), are just gorgeous. The highlight though was our room. We were upgraded at check-in to a junior suite. It was a large room, luxury linens, seating area, desk. We loved. But the bathroom is worth it's own review! European bathrooms usually leave a lot to be desired, but this one was quite large and had the most wonderful walk-in shower with a bench and four showerheads. Wish they'd have free wireless in the room, but they gave us a cable which was fine. Great location, great hotel, we'll be back!", "Date": "March 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bay Village, Ohio", "Title": "“Only wish our visit could have been longer”", "Author": "diinbay", "ReviewID": "UR100201132", "Content": "We stayed in a Privilege Junior Suite. Unfortunately, we only had two nights to spend in Barcelona, but this hotel made it very enjoyable. The Junior Suite was lovely with a fabulous bathroom including a separate shower and toilet room, whirlpool tub and walk-in closet. The hotel was conveniently located for sight-seeing, and the staff was helpful and friendly. We also highly recommend dinner at the Michelin-starred Caelis and drinks in the jazz club/bar on the lower level. Would definitely stay here again.", "Date": "March 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“Almost perfect”", "Author": "powderdog", "ReviewID": "UR99425756", "Content": "First time in Barcelona we initially planned to stay at a regular hotel, but when booking I did a search for a historical hotel in Barcelona and hit El Palace. The price was reasonable and the location looked great so it wasn't a hard decision. So with great expectations, we walked from the train to the hotel. (Easy to find, short walk) Would this be a hotel like the Grand Plaza in Rome ? (In that hotel we recieved fantastic service simply by smiling and being polite to all of the staff - I know a lot of people has another experience) But this was even better. Smaller, but in every other way better. We did anyway smile to everyone and got lots in return. We almost felt like a part of a big family after a few days. Well, some facts now. A room of proper size, not big, but big enough. French balcony and a big luxurious bath. No noise from the street outside. The location was, as expected perfect. We used our legs almost all the time. Almost everything was within walking distance, from La Rambla to La Sagrada Familia. So why just almost perfect ? Well....I have a back which due to a small injury needs a medium to soft matress, and when it is as hard as they were at El Palace I can't sleep more than a couple of hours before it hurts. Knowing how to deal with my back I asked for an extra thin matress on the top. The concierge said that this was no problem, but when the maid came (Probably the head-maid, she was the archtype of a spanish grandmother :) she said that it was not possible to do this. I tried to tell her that it was just to.......but got just No-No-No in return. Hard luck... I didn't want this to ruin an in every other way perfect week, so I tried to ignore it, and after three more nights I probably got used to it, and managed to sleep all night. Do we want to go back ? In Barcelona yes. But for the best hotelbed in the world, try The Peninsula in NY.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Outstanding!!”", "Author": "RosieCompton", "ReviewID": "UR97924195", "Content": "We stayed in February for 3 nights and our stay was absolutely outstanding. The service was impeccable. The concierge could not have been more helpful in organizing excursions for us, suggesting and making reservations at restaurants, and recommending what to see. We had been to Barcelona before so we wanted to see things we had not seen before. The rooms were gorgeous and the lobby sitting room was magnificent. The location was ideal. Easy walking to all areas. I would highly recommend this hotel to all.", "Date": "February 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“Ideal in Every Way”", "Author": "Mousewife", "ReviewID": "UR97429033", "Content": "As with every hotel afilliated with the \"Leading Hotels of the World\" chain that I have stayed in, I found the Palace entirely satisfactory. Its location is ideal, centrally located between the old town and the bustling Eixample, giving easy access to both the medieval core and the modern city. The gothic cathedrals and the twentieth century Gaudi and Montaner houses are all within a short, pleasant stroll; Sagrada Familia is a convenient subway ride away. As for the hotel itself, the staff was unfailingly friendly and helpful, always had at least adequate English, and fulfilled every request. The hotel cultivates a (perhaps inauthentic, but nevertheless pleasing) old-world charm, with a grand lobby, doormen in snappy uniforms, and much bowing and scraping. The building is elegant and our room, while not enormous, was adequate, with an excellent view, a large and comfortable bathroom with double sinks, a good shower, and superior sound buffering. Last but not least, the Palace offered what may be the most comfortable mattress I have ever slept on.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good hotel at reasonable price”", "Author": "Clirim", "ReviewID": "UR96271306", "Content": "I stayed here in February 2011 for three nights. Staff was friendly and gave me the right advice about places to visit and to eat in the city. The room was very clean and the bed was comfortable. I have to say that the bath wasn’t that comfortable and the hot water on the shower wasn’t keeping the water temperature stable. Also from the room you can hear the underground trains passing by, but none of these was a major issue. I would recommend this hotel.", "Date": "February 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Texas", "Title": "“Great hotel at a surprisingly reasonable price!”", "Author": "LibraryHRGuy", "ReviewID": "UR95713281", "Content": "We spent a week here last month and were very pleased with our stay. Perhaps because January is not the busy tourist season for Barcelona, the rates were very reasonable for such a luxurious hotel. We paid 205 euros a night for a \"Classic Deluxe\" with a king bed. I just looked at the hotel's web site and it seems to be showing even cheaper rates for February. The room we stayed in was absolutely gorgeous, having been recently renovated. It had beautiful fabrics, carpet, and wall-coverings, and very good sound proofing. The hotel is on a corner, the intersection of two busy streets. We were on the fifth floor overlooking Carrer Roger de Lluria. All we had to do was close the window and the traffic noise was gone. The vintage building has been outfitted with steel framed, double-glazed windows that seal tightly and very effectively block the street noise. However, the best part of the room was the beautiful, spacious, completely redone bathroom. It had a tub, a separate walk-in shower, and a large countertop with two sinks. The toilet was in a separate compartment with a sliding frosted glass door. Compared to the usual cramped and inconvenient European bathrooms that I'm used to encountering, this place was superb. They even included a beautiful, live (not plastic!) orchid sitting on the countertop in the bathroom. The room was really more like what I usually find in a high-end American resort than in an urban hotel in Europe. I have stayed in rooms in Europe comparable to this one, but they typically cost two to three times as much as this. The staff of the hotel could not have been more gracious or accommodating. The reception desk personnel, concierge, and door man were all very welcoming and helpful. Guests have to deal with concierge frequently because your room key needs to be turned in to the concierge every time you leave the hotel. The rooms keys here are attached to a large fabric tassel that you don't want to carry in your pocket. I haven't encountered this for years in a big city in Europe, but here you leave your key with the desk when you step out of the hotel. The locks on the rooms seem to be some kind of fancy electronic system, but there aren't any of the usual plastic key cards. it all worked fine though and there was always someone at the concierge desk when you needed your key. The staff at breakfast in the Garden were also very pleasant and accommodating. Breakfast was pricey -- 28 euros -- but the elaborate buffet was great. There were hot scrambled eggs, lavish Spanish hams and cheeses, fresh-squeezed fruit juices, and a huge array of fresh pastries. The \"Garden\" is sort of a large tented space that is heated with propane heaters when it's chilly. It's a beautiful space with a glass wall at the end of it overlooking a small outdoor area with a fountain. We enjoyed the breakfast so much that we went every day during our stay, despite the cost. I noticed another posting that mentioned problems with the elevators. Both guest elevators were out of service at one point during our stay. The staff did a very good job of seeing that everyone was promptly escorted to a service elevator in a staff area of the hotel to go upstairs. It wasn't too much of problem for us, but for a traveler with mobility challenges, it could be a big problem. The service elevators are a long walk from the lobby and it's up a half flight of stairs and down a another half-flight to get there. It did appear that you could access the service elevators from a street entrance without having to negotiate any stairs, although we never did that. Interestingly, free WiFi was available in the lobby and using an ethernet connection in the room was also free. The front desk will provide you with an ethernet cord if you need one. However, WiFi in the room was only available at a stiff price. I was traveling with an iPad that can only use a WiFi connection, so I just succumbed and paid a ridiculous 40 euros for every 72 hours of WiFi service in the room. Unfortunately, this hotel's website, like most hotel websites, provides no useful details about internet service. Overall, we were very pleased with our stay and would absolutely stay here again. We've already recommended the hotel to a friend who is planning a visit to Barcelona and we hope to return next winter.", "Date": "February 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "CASABLANCA", "Title": "“EXCELLENT SERVICE”", "Author": "TAMER69", "ReviewID": "UR95454954", "Content": "on average an excellent hotel with very nice rooms, very professional staff ( kind, polite and efficient) and the best breakfast i found in Barcelona. Really a very good hotel to recommand and thanks to all the staff .", "Date": "February 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hawaii", "Title": "“So beautiful!”", "Author": "bougainvilla", "ReviewID": "UR94767351", "Content": "This hotel was intended as a one night splurge after our cruise. It did not disappoint. I had been sick on the cruise so we asked for a room with two toilets. They upgraded us to a fabulous suite. The service was attentive, especially because the elevators were both under repair and we had to use the service elevator. We were there on a Sunday, and nothing is open. There was no soup to be found within a 7 block radius of the hotel. So the hotel made up chicken soup for me! While it was pricey, it hit the spot. If you like a hotel with an old world atmosphere, great service, and can afford the prices, this is the place to stay! All that and free internet too!", "Date": "January 28, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“The best of the very best”", "Author": "worldtraveller2012", "ReviewID": "UR94358813", "Content": "Went with fiancée for 3 nights. From the time of check-in it felt like a great holiday. The room was large & modern. Very comfortable bed. Large and spacious bathroom. Got a nice view of the main street from the window. Location couldn't have been better. Service was impeccable from all the staff. Concierge recommended wonderful restaurants and shops. Very well placed out business center with free internet. Truly felt like staying in a grand palace.", "Date": "January 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Lovely Hotel with Impeccable Service”", "Author": "jhkester", "ReviewID": "UR93379012", "Content": "This hotel is the former Ritz in Barcelona and has been well-restored. The rooms are beautiful (though the TV positioning a bit odd), and the bathrooms are large and clean. The lunch food we had was delicious. The staff are extremely attentive, and always willing to help you navigate Barcelona or find a restaurant. You truly feel like the only guest in what is a rather large hotel.", "Date": "January 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Excellent, with a few qualifications”", "Author": "d2fan", "ReviewID": "UR92725408", "Content": "We stayed at El Palace for a week and generally had a very enjoyable experience. The rooms are comfortable and well-appointed, though drawer space in our walk-in closet was almost non-existent. Our third floor windows completely shut out the noise from the main avenue right outside. The hotel retains the very lavish and ornate style of its Ritz heritage so be prepared for that kind of opulent decor. The service was generally as one would expect, but if you've stayed at other top hotels in the world, especially in Asia, you'll notice it's very much of the European variety, i.e. efficient and courteous but without a sense of genuine warmth. The concierge in particular suffered from this. Food was good and we had a wonderful meal at Caelis (although the cavernous dining room borders on a ballroom feeling). Prices are as you would expect in a five star European hotel, and we ate breakfast elsewhere most mornings. We found the location to be excellent. It's close to the centre of things and in an upmarket area of town, far enough away from the tourist hotspots. Comments by other reviewers are worth noting. The rumble from the metro line directly below is quite noticeable but didn't bother us too much. Yes, our shower also ran hot and cold, and we found that the bath water wasn't especially hot (this improved after we mentioned it to them). Pillows are strange, as the standard issue appears to be a kind of lumpy bolster - not what you'd expect in a five star. There is a 'pillow menu', which we asked for and managed to obtain soft down and feather ones. But this menu was nowhere apparent in our room - odd if you make a point of having such a thing. It's little points like this which can be faulted at El Palace - there's nothing seriously wrong, but they need to pay a little more attention to some of the small details before they will rank among the top players internationally.", "Date": "January 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Jose", "Title": "“Superb, a real 5 star hotel !!!”", "Author": "hermann_kruse", "ReviewID": "UR89856283", "Content": "Great hotel with superb lobby and salon. Rooms and bathrooms are very comfortable and luxurious. The shower is simply great !!! The hotel is very well located, close to most attractions in Barcelona. Food and room service are great, expensive but great. Worth the fare if you want a top quality experience. Hotel personnel knows about top dinning and is willing to help you with reservations.", "Date": "December 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lake City, Florida", "Title": "“Wonderful Hotel!”", "Author": "HavingFunTravelin", "ReviewID": "UR88526024", "Content": "We thoroughly enjoyed staying at El Palace Hotel. The staff always treated us very well. The lobby is beautifully furnished. The rooms were spacious and luxurious. The bathroom was quite large with a toilet room, 2 sinks, a tub, and separate shower. Everything was clean and well kept. Our room was on the 4th floor and was very quiet. The hotel is in a great location. Very easy to walk to Las Ramblas & Gaudi's houses. The hotel is Old World luxury with modern amenities. Very nice! We would definitely stay here again.", "Date": "November 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Thornhill, Canada", "Title": "“definitely grand lux”", "Author": "Jeff_from_TO", "ReviewID": "UR85994853", "Content": "Recently stayed at the Palace. Beautiful hotel. Paid a few euro extra over other five star hotels and well worth it. Definitely Five Star Grand Lux. Entire hotel was recently redone and they did an excellent job of keeping the old world luxury and blending modern conveniences. Staff was friendly and helpful although restaurant suggestions were not that great. Better off using Trip Advisor. Room was spacious, immaculate, washroom was clean and modern. I suggest having breakfast (it's expensive!!) at least once in the dining area. If the day is mild, they open the doors and it is wonderful. The bar at night is a great area to unwind with a drink before calling it a night. The room was very quiet. We did hear the train but it was not an issue and did not affect our sleep. Much happier that staying on Las Ramblas. Close to everything.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Peterborough, United Kingdom", "Title": "“Lovely Hotel”", "Author": "lesleyd", "ReviewID": "UR85953450", "Content": "Confirm other's reviews - spacious bathrooms, quality fixtures and fittings, calm tradionally furnished rooms. Pictures on the website are accurate. Excellent location. We were on the first floor and although we did 'feel' rather than hear the metro it didn't seem frequent and certainly did not disturb us. The public areas seemed little used - prices heavy, more so than a usual 5*.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Superb hotel with excellent staff”", "Author": "marg_loomes", "ReviewID": "UR85800444", "Content": "This is a lovely hotel. The staff are very friendly and attentive. it's a pleasure to return to after a day of sightseeing. Very well located and good value too.", "Date": "November 3, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Great Location...But”", "Author": "Ocala123", "ReviewID": "UR85698397", "Content": "Just spent 4 nights at the Palace. Room was great but the street noise was terrible. The windows did nothing to shut out the noise and the worse thing was the hotel sits on top of the Metro. You hear the rumble of the trains all night. It is like the train stops and starts under your bed. When I went to check out they wanted to charge me a different rate than what was on my printout. They had much discussion of this. They tried to tell me it was my fault that the rates were wrong. I told them that it was their website printout not mine. The gentleman was mad and threw my papers over on another desk. He blamed me for not telling her before check out......What? However he did only charge me the rate that was on my printout. We travled all over Spain and this was the most expensive hotel and our least favorite.", "Date": "November 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Old World Glamour + Modern Amenities”", "Author": "nyc1111", "ReviewID": "UR84830382", "Content": "The Palace Hotel definitely stands out among the numerous contemporary, chic hotels with minimalistic aesthetics. The lobby and the rooms are elegant and romantic, and equipped with all sorts of modern amenities. The decor was elaborate but tasteful, evoking old world glamour. While the room we had wasn't particularly big, the bathroom (double vanity, separate tub and shower) and the walk-in closet were so spacious that it felt like a mini-suite. The garden in which breakfast was served was lovely as well - bright, airy and beautifully furnished.", "Date": "October 25, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Niagara area", "Title": "“Lovely but.......”", "Author": "RDTravelMom", "ReviewID": "UR84760790", "Content": "Lovely elegant hotel. Great location on Gran Via as others have mentioned. Definitely their greatest asset is the staff....all very kind and accomodating. Spacious room but the bed was not the most comfortable and the pillows were very hard....causing sore necks & heads each morning. When asked for a softer pillow none were to be had......and no attempt to get one. ...a variety would help. Very quiet location which is great after a day of sight-seeing. However the bar and lounge area were empty each night of our 3 days there. We would have liked to have relaxed there for a nightcap after our great dinners out but it just felt so desolate in the lounge. No doubt it was empty due to the outrageous drink prices. We've had cocktails all over Europe as well as all across North America...from N.Y. to Chicago to L.A. and Vancouver to Toronto but these were the most extreme prices.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Mateo, California", "Title": "“Perfect location, good service, great rooms”", "Author": "JoKnits", "ReviewID": "UR84653732", "Content": "We stayed here at the start of our Spain/Portugal trip with daughters aged 9 and 11. The location is great - good, safe neighborhood, close to the Placa Cataluyna, easy walk to the Gaudi masterpieces, Gothic quarter, and everything else. We requested: connecting rooms, high floor, away from elevator, breakfast included, and a ride from the airport. All were attended to perfectly. Our rooms were very large and connected as requested. Check-in was efficient and helpful. The concierge made a reservation for us at El Gran Cafe, per my request. The beds were very comfortable. Although the hotel is on a busy street, our room was very quiet due to excellent soundproofing. The second night, the concierge recommended a restaurant called Windsor, which was a taxi ride (we could have walked, but it's a longer walk). The food was excellent - and they were very helpful about modifying the items for kids' palates (our kids eat fairly adventurously, but things like ensuring fries as the side went over very well!). We ate lunch in the hotel restaurant one day - I wouldn't recommend this. The food was good, but it was rather expensive and I think we would have done just as well to explore on our own. It was convenient, however! The breakfast was very good - many choices of foods and beverages. The room in which they serve breakfast is lovely. The hotel doormen and bellmen were great about getting taxis, loading our suitcases, and so forth.", "Date": "October 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Durham, United Kingdom", "Title": "“One of the greatest hotels”", "Author": "DanielKUK", "ReviewID": "UR84575655", "Content": "This hotel is a great place and it is realy five star hotel. We stayed there for a weekend in April, it was gift for my girlfriends birthsday. We had wonderful stay in this hotel and Barcelona is a beautiful city.", "Date": "October 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Palm Beach, Florida", "Title": "“Beyond excellent!”", "Author": "cracker32", "ReviewID": "UR84136189", "Content": "This is one of the best, if not the best, hotel we have ever stayed in. Everything was perfect - service, staff, assistance, cleanliness, location, bar, restaurant .", "Date": "October 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Wow! Incredibly beautiful, luxurious hotel at an exceptional price!”", "Author": "theobsessivetraveler", "ReviewID": "UR84096747", "Content": "We reserved El Palace for our last night of our tour of Spain. I had read that the hotel had just completed a renovation, which is what I always look for in hotels (new always trumps worn). What I didn't realize is that El Palace used to be the Ritz, so the renovation went all out luxury. Before I describe the room, etc., I should say that this hotel is extremely well situated, just a few blocks from the Gaudi buildings and the Passeig de Gracia. You can easily walk to everything from here. For no reason at all, we were upgraded to a junior suite, which was one of the most spectacular rooms we have stayed in. The king-sized bed had the requisite fine crisp sheets, ample pillows, and super comfortable mattress. The room was large enough to have a love seat, coffee table, and two chairs for relaxing in. Blackout silk drapes assured total darkness over large soundproof windows (that opened!), but the most sophisticated lighting system I have seen in a hotel room assured plenty of light at night. The suite had a huge closet/cloakroom with a full length mirror and tons of storage. The limestone clad bathroom was so spacious and perfectly clean and new, I could have lived in it. Two sinks, a jacuzzi tub, toilet in its own stall, and a huge shower, with double rain-head showers, a long bench and two handheld showers created all this comfort. What luxury! In the morning, the breakfast was delicious (as it was all over Spain). However, I have to give special kudos to the pastry chef. I am a food writer specializing in bread, and had some of the best chocolate croissants I have ever eaten. Also, the bread in Spain tends toward mediocrity (why?), so I was delighted to finally get some delicious crispy, very fresh, whole wheat rolls. The buffet was served in the garden room, with a full array of juices, cured meats and fish, fruit, hot beverages, English breakfast items like baked beans, eggs, and sausages, and of course that incredible bakery. Completing this experience was of course a very professional and competent staff. Did I say that our room was under 250 euro? How is this deal possible with this level of luxury and service?", "Date": "October 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Midlands", "Title": "“Beautiful hotel in good location with fantastic service”", "Author": "Deb500Midlands", "ReviewID": "UR83274311", "Content": "Just returned from a long weekend at the Palace hotel. It was wonderful, can't fault it. The public areas were opulent, the rooms extremely comfortable - our bathroom was fantastic- and the service was tremendous. The staff were friendly and helpful, nothing was too much trouble. Highly recommend this hotel!", "Date": "October 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Wonderful hotel, great location, amazing staff”", "Author": "MiladinP", "ReviewID": "UR83274245", "Content": "Let me state the obvious right away – this is not a cheap hotel, but you cannot beat the value you get for your money. We stayed in a number of 5-star hotels on our trip, and Barcelona’s El Palace was undoubtedly the best. We were traveling with a child, and we were driving so we had a a car which can be quite a problem in Barcelona. From the moment we pulled in front of El Palace, the hotel staff took care of us every step of the way! Instead of having us deal with messy narrow underground parking in Barcelona, they parked the car for us every time, and took it out on moments notice. The moment they noticed we’re with a small child (4 year old) they upgraded us to a junior suite. Room was wonderful – quiet and spacious, clean and modern, with jet bath and rain shower, and with an extra bed set up for our boy. Waiting for us was complimentary Cava (Spanish bubbly), and each day on our return to the room we found chocolates which only made every day even better! Staff was extremely friendly and helpful on every step, including making friends with our kid. And lastly, restaurant and scotch bar are hard to beat. You may have heard that in Barcelona you should stay on La Rambla. Take my advice – do NOT stay there! It is one huge tourist trap, with bad and overprices restaurants, and really nothing you should see... ever. You should explore Barri Gotic and Born areas (which BTW, has some of the best restaurants), and Ports, but stay away from La Rambla. El Palace is located on large street, so easy to find, but a few blocks detached from over-touristy and over-crowded La Rambla. You’re only two blocks (5 mins on foot) away from Plaza Catalunia and from entrance into Passeig de Gracia, which has both attractions (Gaudi’s houses), great restaurants, and great shopping. Metro station is very close to hotel, so you’re also close to wherever else you want to get to. Even better, taxis in Barcelona are dirt cheap and getting from and to El Palace is trivial, and you won’t have to suffer and pay for stop’n’go crawling through La Rambla. Overall, quality of service as well as hotel and room quality made our stay in El Palace absolutely wonderful, and we highly recommend this hotel for a stay in Barcelona. Next time we come to Barcelona, we are definitely coming back to El Palace!", "Date": "October 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Friendliest Staff”", "Author": "AstridBrooklyn_NY", "ReviewID": "UR83056449", "Content": "Feel free to book this hotel, it was a real positive experience. I would have to say that the staff were the most outstanding feature. Almost everyone was bilingual and easy to communicate with. The concierge staff were the best, offering directions, making reservations etc. The room was large and clean with a recently renovated, large bathroom. I loved the location on the Grand Via. It was a 2 - 4 block walk to many desirable spots be they the metro, the Placa de Catalunya or the Bus Turistica. I appreciated that the location was near enough to be convenient but not directly in the busy, noisy main drag. If I had to say anything negative, it would be that the breakfast is way over priced but there are numerous breakfast bars within 1 to 2 blocks of the hotel.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“excellent, wonderful”", "Author": "LiviaCSTA", "ReviewID": "UR83041959", "Content": "The hotel was completely renovated in 2008. The rooms are new, spacious and very comfortable. There is a closet inside the bedroom and the bathroom is quite large. All the equipments (TV, bath, etc) are new and very modern. No doubt a 5 star hotel that deserves this category. I definitely recommend it.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Very comfortable, very quiet and great service!”", "Author": "Meg297", "ReviewID": "UR82413827", "Content": "From the time we stepped out of our car, the service was fabulous. Everyone we dealt with during our stay was friendly and helpful. We had heard great things about the Concierge and they lived up to the high bar that had been set. The rooms were very comfortable and VERY quiet, which made for a good night's sleep.", "Date": "October 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portland, OR", "Title": "“Good Hotel - Not great beds or Internet”", "Author": "grapdad", "ReviewID": "UR81682904", "Content": "We booked this based on the 2009 upgrade to the hotel, which is impressive. It's a classic 5 star hotel in the same vein as the Ritz in Madrid, where we also stayed. Good location, nice rooms, absolutely the worst Wi-Fi I have ever encountered in 10 years of travel. It's out of the dark ages. They partner with a company called Kubli, which while helpful, denied my payment on a limitless AMEX card, through their help line, finally got me connected, since \"they don't work well with FireFox (??)\", and the connection speed then dropped from the standard 54mbps to 8! I fetched an Ethernet cable from the Consierge, which was free, and here I am. Also there are no down comforters on the bed and the pillows feel like they are made of kapok (for you young-uns, look it up). Other than that, it was an enjoyable two night experience. I will not be back.", "Date": "October 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Wonderful hotel in a great location”", "Author": "DM2176", "ReviewID": "UR81494748", "Content": "This hotel is definitely worth a visit. The room was lovely (large double with roman bath) and the main hotel areas are also quite grand and very elegant. This is not a contemporary hotel (our usual choice), but was a very nice change and had all the modern comforts, but with a touch of old class. My only gripe about the hotel was the bar / waiting staff in the main lounge. We waited quite a while to order a drink and in the end gave up as we were ignored until we moved seats. The drinks were also very expensive, and are way above even top London prices. I would recommend this hotel, but find a nearby bar for drinks.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Jordan", "Title": "“Fantastic Hotel”", "Author": "Scott142", "ReviewID": "UR81390419", "Content": "We stayed at the Palace from Sept. 8-12. Fantastic. Amazing buffet breakfast with meats, eggs, cereal, yogurt, fruits, and of course sparkling wine. (28 Euro per person). Staff was friendly and prompt. The room was great. Very comfortable bed. The Roman bath was a really fun twist. Location is close to shopping, great restaurants and a short walk to Las Ramblas. This was our 4th trip to Barcelona and we would deffinately go back to the Palace. It truely is beautiful and a top notch hotel.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Recently renovated with wonderful features! Well located!”", "Author": "Travel-Mom0222", "ReviewID": "UR81126031", "Content": "We had a great stay! Our request for adjoining rooms on a high floor were provided without a fuss. The weather was very hot during our stay and the AC worked well. The rooms were spacious and clean. The service and quality of appointments were synonomous with other \"Leading Hotels of the World.\" The breakfast buffet had a wide selection of offerings; the champagne mimosa was especially delicious. Rather than using the expresso machine, I recommend you ask for fresh coffee with hot milk. The hotel is about a 10 minute walk from the Gaudi houses and Catalunya Plaza. High speed internet is free using an ethernet provided cable. The flat screen TV is behind the mirror and there are rain fall showers, separate tubs, and sound proofed walls. Ask for a balcony room on the bloulevard side and in the distance, you can see the spires of La Sagrada de Familia.", "Date": "September 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tokyo", "Title": "“Excellent Stay with Sophisticated Service”", "Author": "Yotaro", "ReviewID": "UR80446136", "Content": "We stayed for 4 nights at this hotel. Hospitable staffs and their sophisticated services supported our pleasant stays. Especially, hotel concierge arranged our tickets for flamenco show very speedy and precisely under our request. If we stayed in Barcelona next time, we would choose this hotel.", "Date": "September 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "belgium", "Title": "“Top experience”", "Author": "topsmed", "ReviewID": "UR79768572", "Content": "On my first visit in a few years, I found the former Ritz in great shape after an almost completed and superb renovation. The location is close to all the major sites but away from the crowds of the Ramblas. As other reviewers have noted, you can sometimes feel that the underground is passing under the hotel but this was not a major issue. The rooms are large, luxurious and very nicely refurbished. The bathroom with Roman bath (and a large separate rain shower) is one of my favourites anywhere. The public areas have been refreshed, and lunch next to the hall bar was very good. The other bar will open only in a few months. Breakfast is a 5-star buffet served in a beautiful covered garden and an experience not to be missed (unusually good service). The Palace is definitely the best option in Barcelona (I checked out the new Mandarin Oriental for a drink in the garden, and I was shocked by the poor service). With a good fitness / spa / pool, the Palace could be among the best European city hotels.", "Date": "September 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“5 stars in every respect”", "Author": "ejtpalmer", "ReviewID": "UR79677415", "Content": "This is a great hotel and will make all the difference to your stay in Barcelona. The style is Old World opulence but with all the modern amenities. The staff were all very helpful. Nothing even slightly negative to say. Have at least one drink at the bar and breakfast out on the patio.", "Date": "September 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Fantastic Hotel”", "Author": "LondonParisPeckham", "ReviewID": "UR78876167", "Content": "I booked two nights at this hotel because I couldn't get into the Hilton Diagonal Mar (where I've stayed before). What a choice! This now officially becomes the best hotel I've ever stayed at. I've been into the Paris Ritz before and this place is more luxurious! It would be a £500 night hotel if it was in Paris or London, I couldn't believe the value that I got. Service was top class, food was excellent and the room was sensational, spotlessly clean with walk in showers, chandeliers and a mirror that becomes a TV which I've never seen anywhere before - a bit gimmicky maybe but very clever. The dining room is magnificent as is the bar area - its pricy in the bar but to be expected really. The location in the centre of the town is great, of course you are away from the beach and there is no pool, although the beach isn't too far away. If you're in Barca for sightseeing or business you really can't do better. One tip - there is more than one Palace Hotel in Barcelona - in fact I think there are three - so write the address down and show it to the taxi driver before he sets off as you could end up at the wrong address - as I did on one occasion.", "Date": "September 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai", "Title": "“I loved El Palace in Barcelona and this is why...”", "Author": "TTMdots", "ReviewID": "UR78721570", "Content": "The service was impeccable! There was not even one exception. Everybody was so professional, helpful and polite! Special mention to Alexis the multilingual concierge guy. From the moment we stepped in, he was so courteous, discreet, professional really the perfect person to be there! All porters have also been so polite. Breakfast is one of the best we’ve ever had in a 5 star hotel. The breakfast area is gorgeous! The hotel location is just perfect, most of Barcelona sights area short and pleasant walk away. I cannot rate this hotel with less than 5 stars even though there are clearly some parts of the hotel which are not finished yet… I think that by the end of the year when the jazz bar will open it will be so nice! One think to keep in mind if you want to visit other cities around Barcelona, is that the hotel does not have good deals with car rental companies so they are charging too much. The good thing is that 200 m down the road there is a europcar office and we rented a nice small car for 25 euros per day!", "Date": "September 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Barcelona home you would like to come back”", "Author": "travellingpen", "ReviewID": "UR77981716", "Content": "Though they are still in the middle of refurbishment, we did not notice/hear anything. We booked Classic room, but got upgraded to Junior suite. Spa was not ready in August 2010, so that was a slight minus. Reception, bell persons are very helpful, though we found concierge staffs are incredibly arrogant. No internet access in the room. Drainage problems with the bathtub. We think they have still a lot to finalise, but overall our stay was comfortable.", "Date": "September 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Shallotte, North Carolina", "Title": "“Treated Like Royalty at the Palace”", "Author": "wunderlust07", "ReviewID": "UR76246842", "Content": "The Palace is a great location for reaching the La Ramblas and the Gaudi sites. The hotel is beautifully renovated with a lovely sitting room off the lobby, spacious bedrooms, comfortable bedding, and perfectly appointed bath including a great rain shower. It served as an oasis after a full day of touring and its staff could not be more accommodating. If you need any help with directions or local eateries make sure you talk to David, the doorman, who greets you each day with a perfect smile and helping hand. What a wonderful place to stay…we will be back!", "Date": "August 22, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Los Angeles, California", "Title": "“Doesn't get better than this”", "Author": "MLMalcolm", "ReviewID": "UR76132807", "Content": "This hotel is splendid. Gorgeous rooms, stunning lobby. Very ornate, so if you like a sleek modern look it is not the place for you. Concierge staff is FABULOUS. Perfect location. Much quieter than the Las Ramblas. Just perfect.", "Date": "August 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Renovation completed. Even taxi drivers don't know it.”", "Author": "fakeis", "ReviewID": "UR76098412", "Content": "Stayed for 3 nights. Taxi drivers always got confused because there are so many hotels in the area with \"Palace\" in it's name. Just make sure you tell them the address. Not so many drivers know it was the former Ritz Hotel either. Hotel is almost done with the renovation. The Reception desk area was just finishing when I was checking out (temporary desk was set next to the concierge before). But no issues with the service, it was all excellently run. Concierge helped me before and during my stay and offered great advice and service. Room was large and kept clean. Showers, tub, faucets and everything run well (and brand new just after the renovation). Even though the building is old, no need to be scared of a century old plumbing system as in other European old 5 star hotels. Nice large bed too. The subway seems to run right underneath the hotel and made some noise/rumble every time it passed under us, but was not such a nuisance. Much better than police car sirens and car alarms that go off every 10 minutes in NY or other large cities. Staff were excellent in all areas, maybe because they are former Ritz employees? You can easily spot top level skill and pride among the staff in an excellent hotel, and it's evident here at El Palace. Just one thing. The TV in the framed mirror is a nice idea, but it sporadically seems to freeze up when trying to change the channel. Maybe the reception or the remote is not so good? But I like the idea because it keeps the room in line with the elegant, classic atmosphere of the hotel.", "Date": "August 20, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Lake Ozark", "Title": "“One of the best!”", "Author": "GlenDonnach", "ReviewID": "UR73500383", "Content": "I have stayed at many hotels throughout the world but never at \"The Palace.\" The recent renovation of the hotel was very well done, our rooms was spacious, the bathroom wonderful,(my wife's description) and the decor was very tastefully done. It is the type of elegant hotel that I adore and would highly recommend it for anyone. It was within easy walking distance of many attractions as well as shopping. On my return to Barcelona, it will be my preferred place to stay", "Date": "August 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“A Trip To Remember”", "Author": "ryhy", "ReviewID": "UR73008856", "Content": "The El Palace hotel is a spectacular hotel in Barcelona Spain that gives you an experience of a life time. I was sincerely impressed with the service and helpfulness of the staff. Everybody was always asking if they could do something for us or weather we were okay. If you are going to go to Barcelona make sure you stay at the El Palace hotel. If you are travelling with kids and you get everyone in one room ask for joining rooms as well as a view no matter what type of room you are staying in.", "Date": "July 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Great Location, on the pricey side.”", "Author": "Ischia1", "ReviewID": "UR72433774", "Content": "Our stay at El Palace was wonderful. It is a short walk from Las Ramblas and the shopping district. It is near a few Metro stations, making it easy to navigate Barcelona. It was a bit pricier than other options, and for this reason, I would probably stay in a less expensive hotel on future visits. That being said, the hotel room was large, with a spacious walk-in closet and large, renovated bathroom. (I don't know what I'd find elsewhere). We chose this hotel b/c of the positive reviews and we were celebrating our honeymoon, so decided to \"splurge\". We were not disappointed at all, the service was exceptional, the rooms were clean and comfortable, and the location was great. Highly recommend this hotel.", "Date": "July 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“A true 5 star Barcelona hotel”", "Author": "scruffybags", "ReviewID": "UR72309456", "Content": "Stayed in this hotel for 3 nights in July. Had also considered staying at the Mandarin Oriental and the Hotel Arts, but was so pleased to have chosen this hotel. As you will have read the hotel has been recently refurbished. Our bedroom (standard king) was beautiful and finished to a top luxury standard, with heavy doors, plush seats and a fantastic bathroom. Loved the walk in rain shower, excellent water pressure. Room was large, with a walk in wardrobe and long entry corridor. Bathrobes provided. Excellent Loewe TV with good selection of channels. Soundproofing was excellent and we could not hear any noise from the corridor or other rooms. Lovely small balcony which we could stand on. The public areas are equally beautiful, with a huge luxurious bar/reception room. Excellent service here and throughout the hotel. We didn't try breakfast due to the cost (32 Euros/person). There main restaurant looked fantastic and I believe it has a Michelin star. Free internet available in the rooms. I am sure once they complete all the renovations (I believe they are building a pool and second bar) this hotel will be the best in Barcelona.", "Date": "July 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Shanghai, China", "Title": "“Exactly what every upscale heritage hotel should be like”", "Author": "Shiru", "ReviewID": "UR69997434", "Content": "Newly renovated in exquisite taste, with a very convenient location and excellent personalized service, El Palace is a gem. Our room was absolutely comfortable, roomy, with a lovely view of the city. My husband and I are frequent travelers, both for business and pleasure. Seldom do we encounter such a lovely hotel. Will definitely come back next time we are in Barcelona.", "Date": "July 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "chester, ct", "Title": "“Outstanding visit”", "Author": "travelerChester_Ct", "ReviewID": "UR69371778", "Content": "Excellent location, large room with great bathroom, fabulous amenities, great balcony, wonderful restaurant, elegant common areas, meticulous and accommodating housekeeping staff, competitive room rate, knowledgeable concierge and bell staff.", "Date": "July 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Windsor Locks, Connecticut", "Title": "“Awesome Renovation”", "Author": "Buzz355", "ReviewID": "UR69275634", "Content": "The renovation of this hotel has produced some awesome rooms. I really like the bathrooms where the shower has this large plate stuck to the ceiling which produces something resembling a rainshower. I also like the separate entrance into the shower from the bathtub - that make sense even though no one else (to my knowledge) designs their bathrooms that way. The TV within the mirror is also a nice touch. The amenities are also first rate (L'Occitane). My only nit is that they don't give you a chocolate when they turn down your bed nor do they provide free wi fi service. Oh, by the way, they also attach your room key to a huge monster tassle with a brass cap. Now really - how convenient is it to put that huge thing in your pocket or purse? Overall though, this is an excellent hotel.", "Date": "June 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, England", "Title": "“An Oasis of calm and comfort: the luxury of a lost age!”", "Author": "monarlo", "ReviewID": "UR68717518", "Content": "PROS The hotel was gloriously luxurious and immaculate throughout, all in splendid 19th Century style. Our room was enormous (we got a free upgrade to a Junior Suite) and extremely plush and comfortable. The bed was vast; there were two huge tvs (with lots of English channels) , separate hallway, two bathrooms, amazing rain shower & jacuzzi bath, etc. The staff were all very friendly, and the concierge so helpful with all sorts of questions we had about the city. None of that snootiness one can sometimes come across expensive hotels. The hotel was perfectly situated right in the centre of the City. CONS None I can think of! SUMMARY We felt truly well looked after, and hardly wanted to leave the hotel at all. This is 5-star living at its very best, and I'm sure this will soon be the number one hotel in Barcelona.", "Date": "June 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gothenburg, Sweden", "Title": "“A beautiful hotel with excellent service”", "Author": "JEH81", "ReviewID": "UR67344068", "Content": "Excellent service from the start, where the consergiere took care of our luggage and requests efficiently. The first thing that striked us was the beautiful decoration of the hotel. Our room was very stylish and romantic. The comfort of the bathroom was excellent, and the cleaning of the room perfect. The breakfast was superb with numerous choices for every taste, and a beatiful setting in the garden. Thank you El Palace Hotel for making our honeymoon memorable!", "Date": "June 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mountain View, California", "Title": "“Newly refurbished, beautifully done”", "Author": "omeeda", "ReviewID": "UR66754947", "Content": "I was traveling throughout spain w my parents and stayed at the palace for 5 days in early June. The hotel has gone under a recent facelift, and I think they did a great job. There is a perfect blend between modern touches and classic style. I would highly recommend this hotel to anyone staying in Barcelona. The bathroom alone is worth the stay. Best rain shower EVER! Location is great, only a few blocks from La Rambla. Concierge was also quite helpful in helping w dinner reservations. All his recommendations were good. Did not partake in the breakfast, but at 30+ Euros per person, I dont know who would! Free wired internet was a plus.", "Date": "June 7, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "aberdeen", "Title": "“Fanatastic”", "Author": "andersonAberdeen", "ReviewID": "UR65478475", "Content": "My daughter and I have an annual trip each year and the Palace Hotel certainly added to our experience this year. It is reminiscent of a lost age of luxury service and general beauty. The location is perfect for site seeing and shopping. The staff were extremely polite and helpful, and we enjoyed a great dinner there on our last night - perhaps a little expensive, but then so is Barcelona and for the surroundings and the service it was worth every Euro. The bar in the evening is a perfect antedote to the busy streets and sites of daytime, and the Gin and Tonics are a work of art! If ever I was returning to Barcelona I would return to the Palace/Ritz", "Date": "May 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kingston, Canada", "Title": "“Charming and enchanting”", "Author": "noucamp", "ReviewID": "UR65345998", "Content": "The old Ritz Barcelona preserves the same atmosphere and magical elegance it had at the begining of the century, coupled with the amenities of modern life. It is not a hotel for business travelers, but it is a wonderful spot to be pampered and enjoy the luxury. Service from hotel personnel is superb with the personalized attention you'd expect from a hotel of this category.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Extremely comfortable”", "Author": "Jan_Bache", "ReviewID": "UR63083700", "Content": "Elegant and a truly nice hotel. Newly renovated, so very nice rooms. A former Ritz hotel, so the decor is ostentatious and 19th century .. BUT in a very good way. The hotel is placed right at the border between the \"fancy\" part of the Rambla and the old part of the city. So do be prepared to do some walking. The staff was polite and friendly.", "Date": "May 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "atlanta", "Title": "“Beautiful hotel, Great location”", "Author": "2dogsAtlanta", "ReviewID": "UR61286879", "Content": "Four days of sight seeing in Barcelona. This was the perfect hotel. From the prior reviews and pictures on the internet the hotel has obviously been redone. Our room was state of the art down to the motion sensor to turn on a night light if you got up at night. The restaurant was pricey 100 euro for salad, water and an entree, but all of Barcelona is pricey. Service was as grand as the hotel and the location is about as good as it gets. Center of town, many near by restaurants (try Moo, it is superb). The only problem is the hotel is built on the subway line and about every 2 minutes there is a very deep rumble that can be heard throughout the entire building (even on the sixth floor). We did not really find it a problem and is the only negative thing I can say about the hotel even thought it is a small problem.", "Date": "April 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Malaga, Spain", "Title": "“Superb refurbishment..Now one of the best Hotels in Barcelona”", "Author": "batw", "ReviewID": "UR61013041", "Content": "I reviewed this hotel over 5 years ago, after checking in and checking out 10 minutes later. Approx 1 month ago I was contacted by Sr Joan Valls, the superb General Manager. He had read my negative review and invited me to a complimentary stay, following the Hotel's 30 million Euro refit....I was very impressed that he had made that much of an effort. I took him up on his offer and I was not disappointed. My room, a standard one, was far superior to many an executive room or junior suite that I have had in other hotels. The Plasma TV was cleverly concealed in an elegant Gilt edged mirror and the oversized bathroom had a superb sunken bath, in keeping with the style of the original hotel (The Palace started life as the Ritz, one of only 4 worldwide opened by Cesar Ritz). Breakfast was in a beautiful garden room and the choice of hot and cold buffet was excellent. Staff were both extremely friendly and professional, without being pretentious. The Hotel is in it's \"soft opening\" phase, so renovations are still being carried out. By year end there will be a new Spa (guests currently are offered use of a nearby health club at reduced rates) and there are plans to install a large indoor pool in the basement ballroom, along the lines of that of the Ritz, Paris (considered to be the largest and best indoor Hotel pool in the world). Once renovations are complete, I can honestly say that El Palace will undoubtedly become the Number 1 hotel in Barcelona. If I am forced to find fault, I would say that the beautiful breakfast room floor needs restoring/repolishing and the junior male waiters need to smarten up their uniforms. Larger, more substantial pillows are also needed on the beds. Apart from that, everything was perfect...give it a try, you won't be disappointed. Please also disregard any negative comments written before November 2009, when the Hotel reopened.", "Date": "April 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chanhassen, Minnesota", "Title": "“The staff was very helpful and the room very clean, great location.”", "Author": "Mercedes244", "ReviewID": "UR60936375", "Content": "The hotel was close to the metro station and many of the major sites. It was in a very nice part of town, my daughter and I felt safe walking around the area. The hotel staff were friendly and gave good recommendations for dinner and places to see. We stayed there for the first couple nights of our trip, left to tour others parts of Spain and came back. The hotel was able to store a duffle bag for us until we returned. I was amazed how quiet the hotel was especially being in the middle of the city. The hotel also smelled really good and had really, really nice bathrooms.", "Date": "April 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Saratoga, CA", "Title": "“A Wonderful Hotel”", "Author": "Albertm", "ReviewID": "UR59724261", "Content": "We stayed at this elegant hotel six years ago and were pleased. The hotel has been refurbished with new furniture, new bathrooms, new carpets, and fresh paint. You can pamper yourself in the large beautiful rooms and comfortable beds. The staff is helpful and the location for walking is great.", "Date": "March 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Elegant 5 star hotel within walking distance to everywhere”", "Author": "maodohsiao", "ReviewID": "UR59458579", "Content": "My husband just returned from staying at the El Palace for 4 nights. The hotel is still in the \"soft opening\" stage; as a result of it, it is very quiet. During our stays, we rarely saw other guests. Staffs were very friendly. We got a newly renovated room on the top floor (6th floor). The room was very spacious. The bathroom has double vanity (horray!), separate bath and shower + the toilet was in a room by itself. The cons of the hotel: a) we were on the 6th floor and can still hear the subway/metro when it passes under the building. I can only imagine how much louder it would get if the room were on the lower floor b) it is within walking distance to all the major attractions. However, it is still a bit of a walk. During the day, it's totally fine walking everywhere. But at night time, after you have a large meal and drinks, it becomes a hike at 11pm/12am. We spent 2 nights at Hotel Neri which was right off La Rambla. It was def nice to be able to get home within 3 minutes after a night out. The pro, of course, would be that you get a very clam haven after a hectic day out in Barcelona. Overall, highly recommended if you don't mind walking....", "Date": "March 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hilversum", "Title": "“brilliant place for a romantic trip to Barcelona”", "Author": "EvavanErk", "ReviewID": "UR55131878", "Content": "Just stayed with my husband at the Palace and loved every minute of it. We were celebrating our anniversary. We loved staying in one of the new rooms of the Palace. Staff is friendly and helpfull, rooms are lovely, bathroom is super. The hotel is being renovated but we didn't hear a thing. The parts that are ready are very done in style. Prices are really nice during renovation.", "Date": "February 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "san clemente, ca", "Title": "“A Grand and Elegant Hotel”", "Author": "michaelapond", "ReviewID": "UR48506838", "Content": "As I have worked for a major U.S. airline for many years I have been lucky enough to stay in some of the worlds leading hotels. On our latest vacation to Barcelona, my husband and I had the good fortune to stay at the newly renovated Palace Hotel (formerly known as The Ritz.), We recommend this grand and elegant hotel to anyone who wants to experience old world charm, elegance and excellent service. The Palace Hotel is one of the best of the best and the staff goes out of their way to meet their customer's needs. We wil be back!", "Date": "November 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Alexandria, VA", "Title": "“Faded Glory”", "Author": "GKGAlexandria_VA", "ReviewID": "UR17461804", "Content": "Faded grandeur, but we had a junior suite with two bathrooms that was very large and clean for a reasonable price, with a nice breakfast included. The hotel is very convenient for sight seeing.", "Date": "July 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Superb Hotel”", "Author": "JasmineMarti", "ReviewID": "UR13494567", "Content": "We had a Junior Suite at the Palace Hotel, which was very beautiful and spacious. The bathrooms were made of orange marble. The service was outstanding. Their brakfast buffet is unequaled in quality and variety, and the maitre d' is the best! Our entire family was very pleased with the stay. I should add that the location is also very convenient. Fully recommend this hotel.", "Date": "February 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Virginia, USA", "Title": "“A classic hotel”", "Author": "Ramblingman27", "ReviewID": "UR10657386", "Content": "Great location just blocks away from Las Ramblas on the Gran Via de les Corts - a quick and direct taxi ride from the airport.. Old world style and class at this hotel, including great beds and linens in spacious rooms furnished with antiques. Soon to undergo renovation; one hopes the changes will be minimal. A great place to stay in a lovely city.", "Date": "November 7, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“DO NOT GO HERE...shutting down in 2 weeks for TWO YEARS!”", "Author": "lovinlifelisa", "ReviewID": "UR10046481", "Content": "I just checked in today....and couldn't waste any time to post this review with the hope of saving someone else from a HUGE mistake in staying here! The staff is NOT professional, and are only trying to buy time for the next two weeks before they shut down for TWO YEARS! No one greeted us, no one had a smile. The carpet is totally all torn on the stairs...NO KIDDING...our room had pillows with blood stains...NO KIDDING...the seams in the carpet in the entry of the door to our room were all torn...NO KIDDING...there were dirty black finger prints all over the bathroom door handles form the inside...NO KIDDING...and the windows had face prints all over them from the previous guest...NO KIDDING...and no bars of soap in the bathroom at all...NO KIDDING. When I asked to talk to the manager...the response was \"there is no manager\" on weekends, only the housekeeping manager...and when I talked with him...he told me I am in THE best room...NO KIDDING! They tried to wash the wall, brought us two new pillows and some bars of soap...and not even a gentle apology or acknowledgement of the grosteque situation...NO KIDDING! Yes, we are talking about the same hotel...and I travel a lot...and am NOT a picky traveler. These are things you do not have to even think about for a 5+ hotel (and they are listed in the Luxury Hotels of the World as well). After a bit more discussion with the \"manager\" come to find out they are shutting down in 2 weeks...so the staff that is here is obviously the bare minimum. PLEASE...tell everyone you know so that they cancel their reservation!!!!! I even have photos I plan to post later...NO KIDDING!", "Date": "October 6, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sawbridgeworth, United Kingdom", "Title": "“Great service but very tired”", "Author": "Vixen28", "ReviewID": "UR10002454", "Content": "Stayed for 3 nights for my wife's birthday. Great Location for shopping, the port and sightseeing. All the staff were very helpful and polite and focused on making our stay enjoyable. Excellent breakfast buffet with lots of choice. Main disappointment is the decor of the rooms, which truly does need the refurbishment that is promised in November. Bathroom also needed work and the shower was not what I expect from a good quality hotel. If you are prepared to put up with those shortcomings its a fine example of a 'Grand European Hotel'.", "Date": "September 25, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Old fashioned grandeur”", "Author": "Swindoneric", "ReviewID": "UR8446439", "Content": "We've just come back after a few days at the Palace and loved it. Is some of the grandeur faded? Probably. They are about to start a refurbishment programme and my wife and I both hope that this doesn't detract from the magic of the place. Old fashioned room - but huge. Everything worked perfectly for us. The staff were very friendly and everyone speaks English. The hotel is about 5 mins from Las Ramblas and 20 mins from the Port Area. We loved it and would stay again tomorrow.", "Date": "August 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "OK", "Title": "“Barcelona's grand old lady”", "Author": "OKaren", "ReviewID": "UR8427767", "Content": "Coming back to our quiet room at the Palace after long days of sightseeing was a pleasure. The bed was very comfortable, and there were always plenty of big, thick towels in the bathroom, along with bathrobes. The staff was very helpful in booking tours and anything else we needed. English speaking staff members were always on duty. I will definitely stay there again.", "Date": "August 15, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "San Francisco", "Title": "“Totally overrated”", "Author": "worldtraveler52", "ReviewID": "UR8226010", "Content": "I definitely would not stay in this hotel again. I think it probably was fabulous in its day - the rooms are large (we had adjoining ones), the lobby is lovely, and when it was a Ritz maybe it was great. But it is way past it's prime. The toilets wobbled, the elevators are slow, the smell of smoking was unacceptable even in non-smoking rooms, and it was very dusty. What they need is a major remodel. Definitely not a five star hotel no matter what the Spanish goverment says.", "Date": "July 24, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Brentwood", "Title": "“Very grand, impressive hotel”", "Author": "DebbieBrentwood", "ReviewID": "UR7544663", "Content": "We have just returned from a long weekend in Barcelona. We were booked into the Husa Oriente but less than 24 hours before were informed that our hotel had technical problems and we had to be relocated. They had moved us to the Palace Hotel, formerly the Ritz. There were eight in our party, including 4 teenage children, split into 4 rooms. Although the change was a little worrying we were pleasantly surprised. The Palace is a very grand hotel, the rooms are enormous, 2 spacious bathrooms with seperate w.c. per bathroom, good showers, very good maid service. The reception staff were very helpful, arranging taxis, recommending restaurants, giving directions etc. The hotel has a lot of history (read the book in the room), in the middle of a busy old city, it is not a modern Las Vegas hotel so don't go there if that is what you are looking for in a hotel. Use the metro, easy to get to, cheap to use, don't use the turistic bus on a Sunday - too many queues. Highly recommended for a city break.", "Date": "May 4, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“Disappointing and Overpriced”", "Author": "LAGoldie007", "ReviewID": "UR7382487", "Content": "The public rooms of the hotel were superficially impressive, but the furniture was sad and in need of replacement. Likewise for our guest rooms, which were large and furnished with antiques, but were tired and in need of renovation in critical ways. The beds and pillows were second rate. The bathrooms were worse, including a plastic tub and smelly drains in the sinks. The concierges sent us to a tourist trap of a restaurant and were unhelpful in trying to arrange a tour of a site in the city.", "Date": "April 18, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Kennett Square, Pennsylvania", "Title": "“Fabulous Hotel Palace Barcelona!”", "Author": "MLtravels", "ReviewID": "UR7303040", "Content": "I just returned as a solo traveler to Barcelona and stayed at the Hotel Palace in early April 2007. After much research, I was delighted with my choice and would stay at this property again. The service was amazing...all employees pleasant and eager to make your stay most comfortable. I decided on the breaksfast plan which was well worth the cost. A full and fresh breakfast offered in an elegant dining room. The room was beautiful! It was large and very comfortable. The maid service was excellent....very clean room and bathroom with service twice a day. After my arrival, a staff member arrived with a bottle of wine and chocolates. I felt very safe in this hotel. The lobby was wonderful and very inviting to sit and read and to enjoy social moments. It was centrally located to all the famous sights of Barcelona. I can honestly say, there was not one issue or slight complaint I had with this hotel. A perfect holiday in Barcelona at the Hotel Palace!!", "Date": "April 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Faded Beauty But I'd Still Recommend It”", "Author": "lsugaralmond", "ReviewID": "UR7300448", "Content": "We stayed at The Palace over Easter weekend 2007 and I would thorougly recommend it! The decor in the rooms is a bit beyond its best and shabby around the edges, but everything is provided and the rooms are enormous, with massive bathrooms. The reason I'd really recommend this hotel though is the service - the best I've ever had anywhere in the world. All the staff speak fluent English - even the chamber maids - and they were incredibly friendly, approachable and helpful. Our TV remote batteries died - there was someone at the door with fresh ones almost the second we'd hung up the phone to ask for them. My boyfriend wanted to know the score in a football game happening in England - the concierge checked on the internet for him right away. We wanted a restaurant recommendation - the concierge not only made several recommendations, but left a note in our pigeon-hole with their addresses and directions. In every situation, they did their absolute utmost to help us, and always graciously and with good humour. We would definitely stay again, so what if the carpets are a bit faded?", "Date": "April 9, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London", "Title": "“Classic & Elegant”", "Author": "lyana", "ReviewID": "UR6748282", "Content": "We're just back from a short break from 1/2 - 3/2. We choose this hotel based from its 5 star rating and its location which is very near to Plaza Catalunya. Although there are other 5 star hotels which is in that area ie Le Meridian & Hotel Majestic - we didn't like both the hotel's room deco (based from hotel pics) and it is slightly more expensive that this Palace Hotel and so we decided to book this hotel. We got a good rate from the hotel's website [-] at the rate of euro190 & euro170 for 2 nite Compared with both hotels (we did check out both of them) we love Palace Hotel much better. The deco of the hotel's lobby & restaurant are so exquisite. Here's the details:- ROOM The room is really huge for a standard room - about 38m2. Which far bigger than the other 5 star hotels. As soon as you enter, there are a hallway that leads to the bathroom on the right and the bedroom straight ahead. Very comfortable King bed with 2 comfortable wide pillows and 2 square pillows. 2 sofa and a coffee table in front of the main windows. Flat tv and a walking closet!! we certainly didn't expect that at all - although the deco is a bit simple, it should have more of flowers and some more furniture since the room is huge. The furniture in the bedroom are sheer exquisite antiques, which you rarely find in other modern hotels these days. However, lack of sound proof actually lets us down - we can actually hear footsteps from the room upstairs. Luckily, they (guest on the room upstairs) check outs after the 1st nite so we were lucky. I think because of the age of the buiding (which is built in 1919) they needs to improve the sound proofing and the reception did explain to us that they are planning to do the renovation to improve the problem - starting nxt July 07. Yes, the carpeting and the bathroom is a bit outdated but it did nothing to prevent us from having a good time. Contrast from previous review -- we did not have any problem with the shower. It was overall good. LOCATION The hotel is sitiuated in the corner lot, in front of the main road Gran Via which can be bit noisy with lack of sound proof Main attractions - Plaza Catalunya and La Ramblas is just 10 minutes walk , about 2 blocks away. We always had a nice walk from and to the hotel, as the area is very well cared for with lots of shops. It was great to stay away from the hotel in La ramblas area as it can be quite busy sometime and more area to walk and explore. Take the Touristic bus which has stop at the Plaza catalunya - it is essential in Barcelona as the city is really huge. Passage De Gracia - main street for shopping is just 10 mins walk STAFF & SERVICE I would give 10/10 to the service given by their staff. They are absolutely fantastic. When we arrived at the hotel, the bell boy - Louis showed us tour of the hotel - the restaurants and everything you need to know about the guest room BREAKFAST I would say the Diana restaurant which is the breakfast room is an absolute stunner - it felt like having a breakfast in a park! The rate didn't include breakfast but we decided to check out the breakfast - it was a bit pricey at 21 euro per person but worth it. There are lots of choices to choose from - 2 types 0f spanish omelletes, scrambled eggs, baked beans, sausages, choices of breads, fruits, cereals and even a special breakfast area especially for diabetic Although we had a great time but I think we would't stay again at this hotel, just simply because lack of the sound proof but we might check it out after they had finished their renovation.", "Date": "February 5, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manhattan Beach, California", "Title": "“Great Location, Unfriendly, Inhospitable Front Desk”", "Author": "cubsfan73", "ReviewID": "UR6534598", "Content": "My wife and I travelled to Barcelona to stay at the Ritz at the end of November. The good: It is a beautiful old hotel with an incredible location. The doorman and the bellhops were very helpful and friendly. The rooms have a lot of great character that one would expect from a grand old hotel. The bad: While the doorman and bellhops were friendly, the front desk was not as hospitable. They were unfriendly and rude during check in. And at check out, after having spend 5 nights, they insisted that someone made a call from our room and we would have to pay for it. We proved to the mean lady at the front that we were at the Palau Nacional (beautiful venue) at the time of the call and clearly one of the maids/hotel workers had made the call from our room during turn-down service. After having spend 5 nights, she was insistent on the 3 euro charge and was very rude. One experience like this can lend a bad taste to an entire vacation. With so many other great hotels in Barcelona, I will never stay at this hotel again nor recommend it to any of my friends. I hope the 3 euros was worth it to the hotel.", "Date": "January 1, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "England", "Title": "“Excellent stay at the Palace”", "Author": "Lizlovestotravel", "ReviewID": "UR6481077", "Content": "Booked through special offer on Travelzoo. Went for a room rather than taking free upgrade to a suite as was told that these had no windows and we like a view. Fabulous frontage, reception, lounge etc with groovy chandeliers and all very nicely decorated for Christmas. Huge, high room, about the floor space of our entire downstairs, massive comfy bed and large bathroom with freebie toiletries, slippers & nice thick towelling robes. Staff and concierge all very helpful and friendly. Chose to have a lie-in rather than breakfast which was £15 pp, better to go a cafe locally if on a budget. Only tiny problems - had to remind about our welcome cava & chocs which then arrived promptly and a little noise from the road and Metro but we live in the country so prob most people wouldn't even notice. The flatscreen telly looked so incongruous in what was once the Ritz! Overall very pleasant and comfortable stay, excellent position for walking to Ramblas, old town in one direction or La Pedrera, Sagrada Familia etc in the other. Loads of bars & restaurants every where.", "Date": "December 22, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "new york", "Title": "“Worst shower ever”", "Author": "u2thousand", "ReviewID": "UR6335777", "Content": "Very nice old hotel. Beautiful lobby. But the shower was a disaster, if you can call it a shower. it was basically a showerhead with a drain to catch the water, no walls, so you freeze as you're taking a shower....until the water starts to flip out on you, first it scalds you, then it freezes you, then it goes back to giving you 3rd degree burns on 80% of your body.", "Date": "December 5, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "bayreuth, germany", "Title": "“nothing to complain”", "Author": "shivaowner", "ReviewID": "UR6020601", "Content": "stayed there in october. The location is good, because an underground-garage is near, you can reach it easily and it´s only a ten minutes walk to the very heart of the town, and five minutes to the area where you find many nice shops and several buildings of gaudi. The building is a typical turn of the century hotel in a style you would await in a palace. the ground floor rooms are magnificent in a vaguely french style as in all ritz hotels and well maintained. Our room was although only an ordinary one big with a comfortable bed, the usual fittings including a marble mantlepiece. The bathroom was tiled with pink marble. i´ve seen this before in josephine baker´s house and that comes to me when i say ritzy. unfortunately a cheap restauration took place and parts of the former golden-coloured plumbing were replaced by chrome, but only parts. as i am no decorator, i could use it as well. room service was fast, efficient and friendly. isolation from the noise outside is very efficient. we would stay there again.", "Date": "October 28, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "North Yorkshire, England.", "Title": "“Fantastic hotel with great service”", "Author": "AC100", "ReviewID": "UR5935038", "Content": "I too was worried that I had made an incorrect choice after reading some of the reviews but after contacting the hotel beforehand they assured me that although the renovations would not start until 2007 we would be allocated a very nice room. The building itself is so impressive - in particular the Hall Bar/Lounge and the entrance. We had booked the standard deluxe room and it was spotlessly clean, full of antique furniture, a huge huge bed (very very comfortable), robes, slippers etc. The blackout linings at the window were excellent and we heard very little noise - it certainly did not disturb our sleep. Breakfast was excellent - every choice you could think of and omelettes and eggs made to order. The Hall Bar service was excellent. I would certainly return - because of the wonderfully central location and the facilities offered. The room service was the quickest room service I have experienced. Try \"Little Italy\" restaurant on the street opposite on the other side of the Gran Via (live jazz with excellent food). If you like traditional decor and furnishings you can't beat it - if you prefer modern 'cold' hotels don't stay here.", "Date": "October 10, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orange County, CA", "Title": "“A wonderful experience!”", "Author": "TravelingGardener", "ReviewID": "UR5881231", "Content": "After reading several disappointing reviews, we were concerned about the reservation we had made for this property. We contacted the hotel directly and were informed that renovation would be starting the month after we would be here. I saw on Trip Advisor that some of the rooms had been renovated, but not all of them. We were assured that we would be well taken care of and decided to stick with our reservation. Upon our arrival at the hotel, we were informed that we had been upgraded to a mini suite and it was beautiful and spacious. The bed was larger than king size and was entered through double doors off the living room. There was a walk-in closet with separate hanging areas for my husband and myself - all paneled in a beautiful cognac colored wood stain. The bathroom was extremely large with double sinks - a separate glassed in area for the toilet and bidet, and then a large tub and separate shower at the end of the room. The shower had several different spray heads aimed at various areas of one's anatomy which was great. We thought the staff was cordial, courteous and personable. Our only regret was the fact that they were having a wedding reception the night of our arrival and so the main public room was closed off to the hotel guests - but was open the next morning. We believe it's always a good idea to communicate with your hotels before arrival and have had excellent service and attention when we have done this. We did hear from other guests that their rooms were not renovated yet, but were large and spacious. I would add that my husband and I both had massages while we were there and they were two of the best we've ever had! The breakfast buffet was included in our room rate and we were delighted with the choices as well as the service. The setting was elegant and beautiful. We will definitely return to this property for not only it's excellent location, but also for the attention and service we received as guests.", "Date": "September 27, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Virginia", "Title": "“recent stay”", "Author": "ssaffold", "ReviewID": "UR5620366", "Content": "3 blocks from Las Ramblas Older building Large, comfortable rooms Consierge", "Date": "August 17, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Chicago", "Title": "“Still a very good hotel”", "Author": "SMTORD", "ReviewID": "UR4952691", "Content": "We stayed here for a week in '04, and the reviews on TripAdvisor since then did give us pause for concern in booking again for Feb. '06. We visit Europe 4-5 times a year, and always stay in 4-or 5-star hotels, many of them also affiliated with LHW. I E-mailed them in November with my concerns about the renovation and the complaints registered here. I received a prompt E-Mail back, stating that the renovation would not start until later in '06 and we would be assured of a room in fine condition. We paid 190 Euros/nt for the identical room we had on the sixth floor two years ago. It was great; good bedding, high-quality linens, bathrobes and slippers, nice toiletries, a gift of chocolates and Spanish wine in the room. Everything was exceptionally clean. Yes, there were some \"dings\" on the chair by the desk, and a couple of very minor spots on the carpeting. Planning to write a review here upon our return, I specifically looked for the issues that were noted in previous reviews. But for the most part, there is very little to criticize. The service remains exemplary. The doorman, David (from Pennsylvania) is a gem... very helpful with directions, recommendations, and a taxi when we needed one. Both he and the concierege staff remembered us and gave us a warm welcome. The concierge staff are great... they provided wonderful restaurant recommendations. The location, for us, is ideal... several great tapas places within a few blocks, 4 blocks from Plaza Catalunya and the top of Las Ramblas. With the windows closed, no street noise to be heard at all. The only thing you have to be careful about is that the taxi drivers still know the hotel as \"the Ritz\", not \"the Palace\". There are several hotels in BCN with \"palace\" as part of the name, and we were taken to several of them by mistake. You have to give the driver the name AND street address.... get the hotel's card when you arrive, and provide it to any taxi driver you use. Is it the Four Seasons in Istanbul, the Grand Bretagne in Athens, or the Grand Hotel in Stockholm? No, it is showing a bit of wear. It needs some TLC to restore its former luster. But it is still a very well-managed, charming, old-world hotel in a great location in Barcelona.", "Date": "April 8, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Ontario, Canada", "Title": "“A wonderful experience”", "Author": "BrWo", "ReviewID": "UR4721051", "Content": "We stayed at the hotel in May pre-cruise, two rooms, one for my wife and son and I, one for my inlaws. My inlaws had a standard room, we had a junior suite. It was a wonderful experience. I will agree that there are some items that will benefit from the curent upgrading--such as the air conditioning system--but it is a beautiful and classic hotel. Our junior suite had two large and perfectly maintained bathrooms and curtains to separate the sleeping and sitting area. When I asked for sheets for the fold out sofa where our son was to sleep, a team from housekeeping arrived and brought a complete mattress to put on top of the pull out mattress so our son would be more comfortable--amazing service. My inlaws were delighted with their room as well. The public areas are spectacular, and the breakfast room is one of the best I have ever seen. This hotel is a jewel, and it just needs a litte shine to return to former glory", "Date": "March 21, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Chicago, IL", "Title": "“Misses the mark for \"5 star GL\"”", "Author": "dgil58", "ReviewID": "UR4627401", "Content": "You can see how this was once \"the hotel\" in Barcelona (when it was The Ritz), and there is still a lot to love here, but it's not all it could be, anymore. The public spaces are grand, and a lot of the furnishings and fixtures were beautiful antiques, incl. in the room. Some, however, were too well worn, others not so clean looking (too many fingerprints on elevator doors, windows and headboards) - although the most important items like linens and baths were pristine. Some updating and attention to details (install modern locks and safes, brighten the room decor, bring back the robes, etc.)would go a long way. Since we spent 5 days here, we appreciatated the spaciousness of the rooms, the high ceilings, large double vanities,twin closets and comfy king bed. We had a great view over Barcelona to Mt Tibidabo and La Sagrada Familia from our small terrace on the top floor, and service was efficient and unobtrusive. We actually chose this hotel for its compromise location, on the lower edge of the upscale Eixample area, and while only a few blocks from the center of it all, Plaza de Catalunya, it was far enough from La Rambla's crowds to be quiet and relaxing. However, we found that the Barri Gotic/Born/Old City areas (away from touristy La Rambla)were more enjoyable and unique to Barcelona - and wished we had chosen to stay somewhere there, instead.", "Date": "March 16, 2006"}, {"Ratings": {"Overall": "2.0", "Rooms": "2"}, "AuthorLocation": "jersey", "Title": "“Not worth the money”", "Author": "wwtraveler", "ReviewID": "UR4441156", "Content": "For the price, it was not worth the money. The location is reasonable, but I could not get a good night sleep because the mattress was old and soft. My husband and I would end up sinking towards the middle of the bed while we slept. When I complained to the hotel they simply shrugged their shoulders and didn't do anything about it.", "Date": "February 7, 2006"}], "HotelInfo": {"Name": "El Palace Hotel", "HotelURL": "/ShowUserReviews-g187497-d190617-Reviews-El_Palace_Hotel-Barcelona_Catalonia.html", "Price": "$314 - $604*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Gran Via de les Corts Catalanes, 668</span>, <span class=\"locality\"><span property=\"v:postal-code\">08010</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "190617", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/71/57/97/classic-deluxe-room-01.jpg"}}