{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Waterloo, Belgium", "Title": "“Bad Luck”", "Author": "KlausWendel", "ReviewID": "UR128057011", "Content": "The hotel is perfectly located, however parking is a problem and expensive. We got room 21, which on the first glance looked spacious, comfortable and design. Unfortunatelly we discovered rapidly that too much design can become impracticalble. Washing basin in the middle of the room, bathtube only accessible to young sportspeople, bed under a roof frame, with no place to put your head, japanese wardroben, nice looking and painted in whit, but too small to put a suite. We were told that other rooms are better. The restaurant was a compensation and worth the money.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Great hotel, great location”", "Author": "Jae2468", "ReviewID": "UR127327819", "Content": "What a fabulous hotel. Excellent location. The layout is a bit quirky as it is 2 buildings together, but that just adds to the charm. The lounge, bar area is so comfy and welcoming. And fairly popular. We stayed in the smaller part, only 4 rooms on a floor. The rooms were well appointed and comfortable. Big windows let in a lot of light. Bathrooms were modern and had a bath and shower. US outlet at the desk was very nice, but they also had a box of all kinds of chargers in case you lost or forgot yours. Staff was friendly and helpful. Great location. And the ever-popular free wifi. I would stay there again.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“the Dylan - my preferred location in Amsterdam”", "Author": "Martin B", "ReviewID": "UR126900785", "Content": "If you visit Amsterdam, you mus stay at the Dylan, the rooms are superb, I recently stayed their on a business trip and even though i arrived late in the evening the welcome and the attention to detail from the staff was second to none. the newly refurbished courtyard suites are superb, the restaurant whether it is the Michelin starred or the new bistro, the food is amazing. The Dylan the best in Amsterdam!!!!", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scarborough, United Kingdom", "Title": "“Zensational”", "Author": "RichardAndHannah", "ReviewID": "UR125919023", "Content": "A perfect choice for a romantic Valentine's weekend. We had booked a weekend including a boat tour of the canal on Sunday but this was cancelled because the canal was frozen for the first time in 15 years. Far from being a disappointment, this really enhanced the weekend allowing us to walk through Amsterdam on top of the water, with people skating past us. Wonderful! The hotel was well appointed and the staff were friendly and helpful. We booked a canal suite and this was lovely, on two floors with the Zensation white theme which was very relaxing and had every amenity you could think of including a sophisticated AV centre with DVD, iPod docking etc which was more than enough for anyone. The bed was huge and the view of the frozen canal was spectacular. On Saturday we dined in the Vinckles restaurant which is widely regarded as the best in Amsterdam and we find it hard to disagree, with the most sumptuous menu and an excellent accompanying wine list. We would definitely go there again. On Sunday we tried the 'high wine' evening, which was also well chosen and very enjoyable. Throughout both evenings the staff were friendly and courteous. The limo transfer from the airport was well worth it, with a friendly driver giving us a historical tour of Amsterdam on the way to the hotel. The hotel is sited just on the edge of the nine streets so perfect for shopping and coffee houses, and was about 20 minutes by car from Schiphol, so great for the quick weekend getaway. Overall we would thoroughly recommend this hotel for anyone wanting to enjoy a quiet and romantic weekend in Amsterdam.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Denmark", "Title": "“No door to toilet”", "Author": "mcristo", "ReviewID": "UR125552294", "Content": "Stayed one night. Great location and very nice and helpful staff. They do not help with luggage but guess that is normal in Amsterdam The duplex room was nice at Eur 275 but there is no door to the toilet! A bit too modern for my taste. only the great service and superb consierge would make me come back", "Date": "March 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "den bosch", "Title": "“Fantastic Dylan..”", "Author": "flyingdutchie", "ReviewID": "UR124881652", "Content": "My husband and I spent one night in the Dylan in Amsterdam. We live not too far from Amsterdam so normally we don't see the 'need' to spend the night there. We've only stayed in the Hotel de l'Europe before. This time we had something to celebrate so we decided to stay a night and I chose the Dylan. We like the location better than for example hotel de l'Europe. We really like the part of Amsterdam where the Dylan is located. I booked a Loxura room and we were surprised how beautiful it was and so was the bathroom. All the furniture is very stylish and fashionable. I also booked a 'romantic package' (as a surprise for my husband) with the rose-leaves all over the room, the bed and the bath and a nice candle light was on when we came back from dinner. We really enjoyed that. Furthermore we liked the lobby with the nice places to sit and the chimney and all. The service is absolutely super in the whole hotel. We also went to dinner at Vinkeles which was great too. The food was really very good (beautifully served) and the service top. I really recommend this hotel. It is fantastic!", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Traismauer, Austria", "Title": "“Home away from home”", "Author": "Prokop62", "ReviewID": "UR123631313", "Content": "Been using the dylan as my base for Amsterdam business frequently during the last year - a very good place this is indeed ... - before finding this gem have been in numerous other 5 * hotels in city - but Dylan exceeds them by far ... - main reason for that - besides their lovely rooms which do have charakter & luxury .... - is the team which really goes the extra mile to make your stay as comfortable and easy going as possible .... - Great backround ofice run by Carol, Bar headed by Pascal who does the best Belinins next to Harrys bar in Venice .. Jost as the Maitre `d .... - their signiture restaurant - the \"Vinkels\" is very very good as well ... - this also has a spill over to their bar menue which is soooo positivly different to the usual boring stuff you get everywhere else.... So highly recomendable ... - mind you it is not the cheapest option in town though ..", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Groningen, The Netherlands", "Title": "“Most fashionable hotel of Amsterdam”", "Author": "RafaelRedczus", "ReviewID": "UR122780168", "Content": "Great cosmopolic atmosphere with very personal service. Room #25 was superb: cosy (like an attick - not very suitable for very tall people) and private. Negative: the bed incl. the pillow isn't my thing. Not as comfortable as for example the beds used in the Sofitel The Grand (also Amsterdam). Also a quite noisy airsystem. Final note: one of the most romantic hotels we've ever visited (and we've see a lot!).", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Chic and stylish hotel in good location.”", "Author": "PelePurves", "ReviewID": "UR122354250", "Content": "Chic and stylish boutique hotel. Good atmosphere with friendly, efficient and attentive staff. Well heeled clientele.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“its glory time has passed...”", "Author": "upstreet", "ReviewID": "UR122319361", "Content": "i never write a review when i am satisfied. here we were not so it deserves one 1. hotel and rooms don t smell fresh. in the room it was terrible. there is no scented candle. 2. service is approximative : they wanted to charge us the breakfast of a family of five, they ask if we need a cab when we pay 80 euro per day to park outside,... 3. parking is terribly expensive for being in the street on a meter. when iced rain came they were unable to park it inside 4. rooms are unequal. the first duplex they proposed was terrible. with a mini fridge on the floor 5...... in conclusiob they need a big turn around if they want to continue to charge those prices....", "Date": "December 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“OK but there are better options for the price.”", "Author": "advice55", "ReviewID": "UR121240888", "Content": "The location right on the canal in the nicest part of the city is great. The ambience and level of comfort in the communal rooms is excellent. The staff were helpful and friendly. Other positive point is that the rooms are large for a city centre hotel. However this hotel only scores an average mark because for the price, EUR375 per night, the room was a bit old and tired. There was evidence of mice in the room. I know it's an old hotel but it did not make for a restful night sleep. Also room #5 was noisy. Some carpet on the corridors and a soundproofed door to the stairs leading to the restaurant and lounge would help. For the same price stay at Hotel 717, just a few minutes walk away and much better value for money.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Great location, stylish and excellent service, though a little expensive for what it is.”", "Author": "dhh1980", "ReviewID": "UR121206963", "Content": "Really liked this place. Centrally located on one of the canal streets, but set back from the street a bit behind an iron gate like a little surprise. Close to great shopping and some excellent restaurants. The room was quite big, as well. Can't say enough about the staff, they're helpful and nice. I thought the bathroom design was strange....you can't stop the water running out from the shower all over the place. That's my only gripe though. Husband thought $500 USD was a bit much for what it was. I agree, but these days the exchange rate is just not favorable, I guess.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Great location, friendly staff...but terrible bed”", "Author": "DCR_11", "ReviewID": "UR119966888", "Content": "The Dylan is beautifully situated, right in the fashionable area with the Negen Straatjes (Nine Streets) with lots of small boutiques. Great for shopping. We have mixed feelings about our stay. Staff is very friendly, breakfast is good and some of the rooms are nice. However we had a Duplex room with a tiny bed. So, if possible avoid this room (number 18). We had asked for two similar rooms next to each other, since we were travelling with our two daugthers. At the time of booking this was not possible, we had to upgrade to a Duplex room (â‚¬500/night), whereas our daughters stayed in a double room on the same floor. Upon arrival we asked once more, whether is was possible to have two adjacent rooms, but those were not available. When we went to bed, we discovered that the bed in our room was very small. The two person bed was not longer than 1.85m, which is very uncomfortable if you are 1.95 m tall! I was not amused, so we called reception in the middle of the night. At first they said all beds were 2 meters long, which I denied. The manager on duty came up, and admitted the bed was quite short! The offered us another room (â‚¬395/night), with a normal bed...next to our daugthers' room! It was very unpleasant to move rooms in the middle of the night, to finally end up in the room you had originally asked for! The next morning I asked to pay for the room we slept in, which was â‚¬105 cheaper than the room we originally got. The hotel didn't accept this and instead offered us breakfast. I was quite amazed how this was handled. You move guests in the middle of the night to another (cheaper) room, and then make them pay for the other room?!? Disappointing. However, if you manage to get another room, you will enjoy your stay in this hotel!", "Date": "October 31, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Lovely Lobby, Peculiar Room, Well Located. So- So.”", "Author": "MonarchosSeven", "ReviewID": "UR119908899", "Content": "This was my first time in Amsterdam. My friend chose the Dylan Hotel. A recommendation by a friend. I was given the websites address to choose a \"themed\" room, for our visit. They have themed rooms there. Oh boy..... (!) Well, I made a mistake and chose the \"Loft.\" On line, I thought it looked fun. And better to stay in an A- framed style wooden loft when in Holland, than an Asian style room! When in Rome... right? I cannot say that it was all bad, nor all pleasant. But not a hotel I would chose again, regardless of the room. If you go and are traveling with children (as I can be like, at times) this \"loft\" may serve one well. The living area is spacious. I chose to sleep there, instead of the bed. My friend kept hitting his head on the upper doorway when passing through certain walkways (like the steps down into the bathroom). I found this rather amusing, though! Beware... The bathroom was large, but had NO doors. Privacy is necessary for just about anyone who uses modern cutlery and walks upright. My companion was annoyed that he was too tall for he shower. My companion stands about five feet- nine inches. Not a basket ball player, nor a model! We both found it very drafty. When time to depart, I had called for assistance for the luggage twice. Nobody ever arrived. I began to depart this \"loft\" via the private staircase that was circular, uneven, and made of wood that was warped. I managed to get a piece of luggage tightly suspended between the walls, stick in mid- air. I was SO lucky that a neighbor had heard the sounds of my trouble, and came to aid me. Thankfully, he even helped me all the way through the long lobby and over to the front desk. A very long walk when with four cases! Incredibly kind! The lobby is lovely. The reception area is nice. The location is very good. Will I go back? No. Nor can I recommend this hotel to anyone I like! I wish I could say that they \"tried.\" But even so, this was not the case. Oh well.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“can't wait to return....”", "Author": "rkjlondon", "ReviewID": "UR119463928", "Content": "Beautiful hotel...in a great location...faultless. Very memorable stay in Amsterdam...I can't wait to return...", "Date": "October 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "mallorca", "Title": "“Delightful place”", "Author": "godfatherMallorca", "ReviewID": "UR118512998", "Content": "There are several hotels that qualify as 'better than good', in Amsterdam but some friends were staying at the Dylan, so we joined them. Rather than enthuse about its style and charm, the generous-sized rooms, and the perfect location (which have all been done by other helpful reviewers), I'd like to single out the check-in counter-staff and concierges for special notice. Impeccable. One or two of the waiters rather let the side down, I fear (one preternaturally stupid, the other just plain rude)...otherwise it'd have been five stars from me. I'd be happy to go there again.", "Date": "September 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Still a haven in the middle of the city”", "Author": "BluebellChloe", "ReviewID": "UR117879164", "Content": "Stayed here a few times when it was blakes, and not much has changed really, accept perhaps we weren't as blown away this time quite like our first stay ten yrs ago. It's still a great hotel, great location and very stylishy done We ate in the vinkless restaurant, and ten courses later needed to be rolled to our room, it was very very good.", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "New York, NY", "Title": "“Incredibly Romantic”", "Author": "JetSetNY22", "ReviewID": "UR117101238", "Content": "We stayed in this hotel the first night of a 12-night stay in Europe. You know it's going to be a great stay when you arrive at a hotel and they are shooting a Mercedes-Benz advertisement in front. This didn't stop the manager (who was overseeing the shoot) from greeting us at our taxi and ushering us into reception. The staff was meticulous. I love a reception that offers seating at the front desk; it makes the check in process more intimate. The hotel is comfortably enchanting and offers little first class touches. Breakfast included champagne, delicious baked breads, high quality granolas, fruits, meets and cheeses. They had air conditioning and an ipod docking station. The Dylan is ensconsed along a canal, far enough away from the riff raff but close enough to walk to all the tourist areas. We felt very well taken care of and at home at the Dylan.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Chic and comfortable. Excellent.”", "Author": "Em-Atlanta", "ReviewID": "UR116812056", "Content": "Great hotel and very nice staff. Great location and bicycles are included!", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Paris, France", "Title": "“warm place,i like”", "Author": "571Annette", "ReviewID": "UR116756410", "Content": "Warm,nice place in the old school,room was clean,bathroom clean too, but tiny and small, kind reception, wake up call on time. I like also restaurant inside hotel,big space,interesting and delicious menu,you can see young chiefs cooking for you,no smell from open kitchen. 15min walk from downtown and 10min drive in taxi from airport, what give this hotel very comfortable location, good advice for everybody to stay there in time of your trip.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "1", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Ghent, Belgium", "Title": "“Lovely restaured contemporary hotel in the heart of Amsterdam”", "Author": "Iris17", "ReviewID": "UR116420708", "Content": "I loved this hotel from the moment I entered. Part of the Small Luxury Hotel group, it is very luxurious, beautiful, bang in the middle of Amsterdam, yet providing a quiet escape from the city ambiance. The staff are excellent, the food and wine is great. They have a Michelin star restaurant which is honestly exceptional. However, they really must invest in basic room comfort, which you do find in other hotels of this level: e.g. no large mirrow in the bathroom, leaving me to blow dry my hair in a small shaving mirror, only hard pillows on offer and noise from the cleaners in the corridor meaning that I did not sleep very well at all. After two days with very little sleep, the beauty of it all started to fade...", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Nice hotel but very bad bar staff/service experience”", "Author": "beatr10", "ReviewID": "UR115788647", "Content": "The room we stayed in was wonderful and clean. The bathroom was amazing. The staff bar, however, was bad mannered and showed to be nervous. We stayed 2 nights and on one morning we were woken up by loud music that I guess by mistake went on for 2 minutes in the courtyard garden. Also, the noise from the planes flying over the hotel just after 4.30 kept us awake untill 8 when the music started.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "miami", "Title": "“Impressive”", "Author": "wlbatl", "ReviewID": "UR115420867", "Content": "The Dylan is a beautiful oasis of calm centrally located on a quiet canal-side street. We were made to feel welcome from the moment of our arrival straight through until departure. The inner courtyard is a lovely place to relax, have drinks and snacks. Our deluxe room (#14) was spacious, quiet, and well-appointed. It appeared to have been recently renovated and overlooked the courtyard from the second floor. The concierge was very helpful with dining and sightseeing recommendations. One evening we called him from the street to ask whether any good restaurants were nearby. We enjoyed his choice. Apparently he called the restaurant ahead of our arrival and its proprietor treated us warmly. The service and ambience of the Dylan are not to be missed.", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Florida", "Title": "“Very hip hotel, good location”", "Author": "MomakFlorida", "ReviewID": "UR115023711", "Content": "We looked for a hotel in a good area that would be comfortable to stay with my 10 & 12 yr old boys. The room at this hotel was fantastic. Very old, interesting building with a hip, modern, design interior. The room was elegant and so comfortable at the same time. Great location where I felt safe walking around with my kids and many interesting sites nearby. The floating flower market is over-rated as well as the market. They are tourist traps that frankly can be passed over. The boat tour is a nice way to look around the city and we enjoyed the evening one as it was cooler and less crowded. Definitely try the desserts at hotel restaurant. We had the best macaroon dessert here! Breakfast had a variety of items although it does look like some things sit out a bit too long and should be freshened up more frequently.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Alexandria, Virginia", "Title": "“Chic Hotel in the heart of the city.............”", "Author": "bellab323", "ReviewID": "UR112796101", "Content": "My husband and I spent 3 nights at this very \"chic\" boutique hotel during our visit to The Netherlands in April. The Dylan is beautifully appointed and truly a great place to stay in this lovely city. We were vitually within walking distance of \"everything\".....restaurants, museums, shops etc. Our room was beautifully appointed with a gorgeous bed and a very nice sitting area - superb stereo system - flat screen TV - and separate bathroom. The bathtub was divine, and we had lush towels and wonderful soaps and ammenities. The staff could not have been more courteous or helpful. They were watchful to our needs in a very understated and professional manner. We loved everything about the hotel and would highly recommend it to your readers. Linda and Jack Burton Alexandria, Virginia USA", "Date": "June 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mumbai | London", "Title": "“Highly recommended boutique hotel”", "Author": "pacman888", "ReviewID": "UR109973659", "Content": "It was my first trip to Amsterdam in 10 years and I was here on a 1 day business trip as part of a 5 day trip to Europe. Amsterdam was day 4 after Munich, London and Brussels. This hotel was recommended by a friend who now lives in Amsterdam and I was very pleasantly surprised by all aspects of the hotel. Staff was excellent. Check-in was smooth. They upgraded me to a duplex room which was very large with a bathroom on the top level. My rate did include buffet breakfast and was told that I would be charged for any extra items which I was happy to pay. Highly recommended.", "Date": "May 26, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Their mgmt lacks the ethical standards of a first class hotel”", "Author": "cdowdy", "ReviewID": "UR109665889", "Content": "One of the things I expect from a first class hotel is that the customer is given the benefit of the doubt and misunderstandings are resolved in favor of the customer. My issue with The Dylan was that upon arrival I was told breakfast was included in our rate...great! The Dylan has a nice restaurant and a leisurely breakfast on the grounds sounded like a great way to start each of our days in Amsterdam. Unfortunately when checkout arrived, breakfast was on our account. I asked for it to be removed and was told we didn't eat the \"right\" breakfast. Since we wanted something Ala Carte and had not eaten from their buffet that wasn't allowed. Nevermind our breakfast was priced less than their buffet and nobody mentioned we were constrained to the buffet. In the end the mgmt said it was our mistake but they would be \"kind enough\" to refund one of our breakfasts but we were on the hook for the rest. I could expect this treatment from a typical chain hotel but to be nickel and dimed by a supposed first class hotel just jades our view our our entire stay. I can't believe they would risk a dissatisfied customer for 20 euros when we were spending 20 times that per night. But that's the type of treatment you can expect if you stay there. Otherwise the hotel can be congratulated on a great location. As far as the room itself I couldn't determine if the furniture was supposed to look aged or simply scraped up and had seen better days. Frankly I can't recommend a hotel that charges a high of rates as they do but don't view their customer as their top priority. I'd look elsewhere. Amsterdam isn't that large a city so you don't need the perfect location to enjoy your stay.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Longview, Texas", "Title": "“A Dream of a Hotel”", "Author": "Robbinwood", "ReviewID": "UR106143875", "Content": "This property is on a canal in a good section of the city. Walking distance to lots of things including the Trams, Anne Frank House, nice restaurants etc. The staff was wonderful...attentive and friendly. We stayed in one of the rooms that had just been remodeled this month and it was wonderful. The restaurant Vinkeles is a Michelin one star. They offered a special Easter evening meal while we were there and it was certainly a hi-lite of our stay. I only wish we could find more \"small luxury hotels\" like this jewel!", "Date": "April 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "nyc", "Title": "“love this hotel”", "Author": "pandora412", "ReviewID": "UR91983632", "Content": "We checked in to The Dylan after leaving the Amstel intercontinental. This staff wonderful, they were so warm and professional and did everything they could to make our stay special!! I highly reccommend staying at The dylan. . It is a very special boutique Hotel. one of my favorite small hotels, the location is excellent! we will stay there again when we return to Amsterdam.", "Date": "January 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Corpus Christi, Texas", "Title": "“spectacular”", "Author": "SEureka", "ReviewID": "UR90946711", "Content": "Checking into the Dylan was a breeze. The driver picked us up at the airport and gave us a great overview of the city and its canal system on our way to the hotel. We were greeted by such a friendly and gracious staff. Our room was even more beautiful and comfortable than we imagined. Great bathtub, super hot water, wonderful view, comfortable bed...everything was perfect. We were so grateful to be allowed to check in early. The concierge was extremely helpful and kind. The location is superb. The lounge and bar area were warm and inviting. Our roomservice was delicious and served very quickly. But what surprised us the most was the fantastic staff. EVERYONE was so friendly and helpful. We were so spoiled that we will never be able to stay anywhere else in Amsterdam!", "Date": "December 28, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great but with flaws..”", "Author": "happyholidayhippo", "ReviewID": "UR88654907", "Content": "My boyfriend and I stayed in the Dylan whilst visiting a good friend of mine who lives in Amsterdam. Check in was fine and we were taken up to our room which was at the other end of the hotel on the top floor which was nice as it was quiet. The room was unusual but lovely, long and thin but still spacious. The next morning I jumped in the shower and it was a weak trickle which also couldn't hold the temperature so it would be cold and then go to scorching. It took me nearly 30 minutes compared to my usual 10 and put me in a grumpy mood! We told the front desk on our way out and they said that someone would fix it. We went out sightseeing for the day, returned and asked if the shower had been fixed and they said yes as if they had found a problem and fixed it. However the hower was no better and again we told them on our way out to dinner. The next morning I had the same terrible shower experience. We checked out, told them that it still hadn't been fixed and put it in the comments card but have had no response. What is the point of a comments card if you are not going to respond to feedback? Nice hotel but unfortunately this left a bad taste in our mouth for the money we were paying and the lack of follow up is terrible service for what is supposed to be a high class hotel.", "Date": "November 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zurich", "Title": "“Perfect Amsterdam Hideaway”", "Author": "centuriontraveller3", "ReviewID": "UR85665355", "Content": "The Dylan is almost too good to be true. It's canal-side location, the little patio, the minimalistic furniture, the wood strip floors throughout the lobby, bar, in fact the entire hotel, the cosy bar with the fireplaces, the small winding staircases leading to the upper floors, the fact that they serve you Egg Benedict even late night at the bar, the Vynkeles Gourmet Restaurant - stay at the Dylan once, and you will never, never want to stay at another Amsterdam hotel again. Only downside is the cost, but we always feel it's worth it.", "Date": "November 2, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Reading, UK", "Title": "“Wonderful location and great service....”", "Author": "luxurybackpacker", "ReviewID": "UR82058817", "Content": "This hotel is in a great location surrounded by little cafes and lovely boutiques. Easy walk to main areas too. Beautiful shared space, and immaculate service. Our room was very design - a little overengineered in some ways, but truly comfortable and luxurious. Would highly recommend overall.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Redditch", "Title": "“Good and bad”", "Author": "alibax", "ReviewID": "UR79874617", "Content": "My husband and I arrived at the Dylan on 10th September for IBC looking like drowned rats as it was pouring with rain and the taxi dropped us nearby but not outside. Check in was ok the young lady did not speak much and did not ask us if we would like a table for dinner. Our room 20 was a good size in a horrible colour-red, but with a good size bathroom. The only problem with it was that we could not figure out how to turn off the bathroom lights and as the door is glass we put up with it until the next day. (switch is in cupboard above sink) On Saturday breakfast was nice with lovely orange juice and service. After walking around IBC for the day I decided to stay in on Saturday night to rest my leg as I have injured it. The problem with this plan is that I could not eat or drink in the hotel because the whole of the downstairs had been booked out for a party. I had no option but to stay in my room. Our room overlooked the courtyard where some of the party was happening and the noice was horrendous, it went on until 11.45pm and then the staff made noice until 12.30am putting all the furniture back and cleaning up. Room service was not very nice either so I was stuck wit a bar of chocolate and a bottle of water. I would have liked to have sat in the bar with a glass of champagne,some food and my book instead! We have been to Amsterdam many times and always at different hotels, this was the most expensive and we expected a little more but it was a let down which is a shame.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hamburg, Germany", "Title": "“5 Star Hotel Service !!!”", "Author": "Burgsinn", "ReviewID": "UR77918028", "Content": "We had a wonderful stay at the dylan hotel. we have stayed in Amsterdam many times and in many of the top hotels but this was by far the best experience. the staff and service, attention to detail, welcome,ambience of room and lounge/terrace were all outstanding. the attentive staff were so friendly and you never had to wait for a thing. yet they were not hovering over you or making you feel like you had to order more drinks or more food. i noticed that the staff were also very friendly to tourists to who just wanted to pop into the hotel to have a look at the grand building and the beautiful terrace. i thought this was very nice to see as sometimes the 5 star hotels can be a bit arrogant. the concierge, the reception, the bar staff and the housekeeping were all tip top. we will definitely be going back to the Dylan.", "Date": "September 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Classy and Chic”", "Author": "Marinetrooper", "ReviewID": "UR74226638", "Content": "We were wow'd upon entering the hotel. The building is gorgeous and the chic black window frames on old stone and modern white walls gave the Dylan and very sleek and refined image. Downside is that the rooms are a bit small, the wash basin had some black mold stains, the floor in the bathroom was a bit soiled and the toilet flush button is very hard to push. The gym was also very small with 3 machines but they were well maintained and very new. But all this is easily made up for by the personal level of service that can't be matched by bigger hotel chains. The concierge is very professional and seasoned. If you are renting bikes from them...beware if you are shorter than 5'4\". Their bikes are very tall. The Michelin star restaurant was good and the food was precise...appetizers were good but mains only ok. All in all, We loved the Dylan and would go back again.", "Date": "August 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Australia", "Title": "“A great base - great rooms, service and food”", "Author": "MymAustralia", "ReviewID": "UR70458819", "Content": "We booked the Dylan partly for practicality and partly as it looked on the website like a good place to base ourselves during some important meetings that were going to require a lot of preparation. We were very pleased we did. Our first room wasn't right for working in but would have been pleasant otherwise. Iit overlooked the room of an enclosed courtyard. So we upgraded (at our cost but that's fair) to a better room on a top floor. High windows, lots of light, overlooking the main courtyard. Perfect for planning, discussing and writing. The bathroom was reached by a spiral staircase, in what would have been an attic in years gone by. All aspects of the room were very well chosen and fresh. The staff were great, e.g. printing out docs, turning around the pressing of shirts quickly, getting an extra chair for working at the desk. We never managed to dine in the formal restaurant but very good meals were available from lunchtime onwards, so we could eat well downstairs when we needed a break. Or sit in the open courtyard over a drink.", "Date": "July 11, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“A bit cold and too expensive”", "Author": "HookedonEurope11", "ReviewID": "UR66856049", "Content": "My husband and I were in Amsterdam in May. The downside was that we were there 17 days after the \"trash strike\". We stayed at The Dylan hotel. It is in a wonderful location, right on the 3rd canal. When we first checked in, the staff was professional and courteous, but not overly welcoming. To get to our suite we had to walk through and behind the reception area. The room was all white, floors, walls, bedding, couches, etc. It was stylish, but not very charming or inviting. There were 2 very large windows facing the canal. The living area was on the bottom floor and the bedroom was upsairs. At night there was a lot of noise from the area outside even though we were in a mostly quiet area. The beds were two twins put together, not a king bed. The stairs were so narrow that we couldn't even bring our suitcases up, so the had to be in the main entrance on the floor during our stay. There was a closest in the wall that you could use for one suitcase. The bathroom was a good size with a nice shower and bathtub. We decided after 2 nights that we could not stay there for another day with the garbage piled up in the city. We advised the front desk at noon on a Tuesday that we would not be staying until Thursday. The would not refund me for the 2 nights that we would not be staying, only 1 of those nights. I understand that there is a 48 hour cancellation policy, but at 750 Euro a night, with garbage all over the city and in the canals, I thought they would be more understanding. Overall, the cold, all white room wasn't my taste and the staff were professional, but not welcoming. I wouldn't spend that kind of money and not feel right at home again.", "Date": "June 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Boutique Luxury in the heart of the Nine Streets”", "Author": "megpickard", "ReviewID": "UR65845529", "Content": "I've stayed in a few hotels in Amsterdam in the last year, and the Dylan has been the best by far. Even though the rooms aren't huge, and the hotel's vintage shows in some of the architectural features (the worn spiral stairs down to the ground floor from my room were a bit precarious!) the hotel has the feel of a well-appointed home in which you are a valued and welcome guest. My room was cosy, overlooking quiet gardens and other houses at the back of the building, and was beautifully quiet the nights I stayed there. The bed was comfortable, bathroom extremely spacious and with a lovely big bath - perfect for trying out the Molton Brown toiletries supplied. There was a sliding window from the bathroom to the bedroom (not sure why). Breakfast was served in a stylish room downstairs, and was ample and tasty, while the bar area was very swish indeed - all leather sofas and quiet modern elegance. One night I was there, the other guests included a number of international footballers and a touring rock group, but I didn't hear a peep from them after I left the bar area. Food was good in the restaurant, and I had room service one night, which was fine though it took a while for the tray to be taken away (it was still outside the room the morning after). You also can't fault the location: right in the middle of the Nine Streets, and just moments from good eating, shopping and sightseeing. Alas, I was there for work, so precious little time for any of the above - but next time I return as a tourist, I'd definitely like to stay at the Dylan.", "Date": "May 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“I heart The Dylan.”", "Author": "jobrainez", "ReviewID": "UR65630650", "Content": "This place is pricey, but so delicious. It was the perfect spot to relax and unwind on my way home from a long business trip in Europe. The location, of course, is unbeatable. The public spaces are lovely. The staff is warm and gracious. And my room - just a simple double - was absolutely charming and impeccably appointed. It's not a large room, mind you, but the \"Kimono\" design made me feel like I was in my own personal studio in the city. I love boutique hotels but dislike overly minimalist and sleek design, so this is perfect for me. I stayed at the Pulitzer (on SPG points) last time I was in town and I VASTLY prefer The Dylan. The Pulitzer is also lovely, but it's more traditional/classic - more of a typical hotel - than warm/contemporary. I think The Dylan is a wonderful and unique experience.", "Date": "May 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“a nice shoebox”", "Author": "carlParis", "ReviewID": "UR59206558", "Content": "It's a nice and trendy hotel, very well locate, but everything is small there. The lobby is small, the gym room is exceptionnally small (3 people can fit only), and our room was small too. InRoom breakfast was average. Parking is a real problem. I prefered the Pulitzer.", "Date": "March 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“I would happily return here.”", "Author": "Percyone", "ReviewID": "UR53432033", "Content": "I spent a lovely weekend staying here. Our bedroom was bright, light and very comfortable. The bathroom was heavenly and the products great. The concierge were not great on tips of where to go shopping/eating but we found our own way as the hotel is well located. I would happily return here.", "Date": "January 14, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Amsterdam", "Title": "“Best of Amsterdam, Bar None”", "Author": "urban_n0mad", "ReviewID": "UR52626331", "Content": "The Dylan was a wonderful experience. We stayed here for two nights over NYE. ROOM: Our room was extremely spacious, as was the bathroom. Should note that we received an upgrade from the Deluxe Double to the Superior Canal View room. I specifically requested the Kimono ahead of time; recommend you look at the various room styles the Dylan offers and choose one in advance, since each is so vastly different. The room was fantastically designed - sliding doors between the bathroom and the rest of the room allowed you to have everything completely open. It was amazing to take a bath while looking outside at the houses lining the canals. Our room also had a cozy couch with plenty of great reading material on the side tables - design/travel books and magazines, amsterdam-specific, etc. Lots of attention to detail with superb little touches in general. The one thing the Dylan could improve in the rooms would be an update to the outdated CD Bose system. There was a jack for our iPod still though. STAFF: Really made this hotel stand out. Especially considering that service in Holland leaves a lot to be desired. Whatever we requested was brought to the room within mintutes, with a smile (extra towels, ironing board, etc). We had a very charming bartender who kicked off our NYE in style - thanks, Pascal! Also special thanks to Joost. RESTAURANT: Unfortunately the restaurant Vinkeles (MIchelin star) is being renovated through end of January '10 so didn't get to try. Bar & incredibly spacious lounge area with cozy fireplace were still open though. All room service we ordered was excellent - they do an especially fabulous breakfast. LOCATION: The hotel is located right in the fashionable Nine Streets districts, my favorite area of Amsterdam. Lots of great little cafes, boutiques, restaurants. Recommend checking out Goodies for incredible Italian lunch/dinner, Cafe Nielsen for brunch, and Cafe Wolvenstraat for an afternoon drink with a great vibe (they also do great Thai dishes). Book the Dylan - more than worth it!!", "Date": "January 5, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Antwerp, Belgium", "Title": "“Not that special, simply OK”", "Author": "VeroniqueVdp", "ReviewID": "UR49390659", "Content": "I agree with the previous review and probably wouldn't go back either. There was nothing really wrong with this hotel but it was not that special. It is just a nice boutique hotel, with friendly staff and very efficient concierge. I advise you do not book a room with canal view if you want a quiet night : the rooms do not have double glazed windows and there often is a lot of noice on the street (you can actually hear people talking !). Small bathrooms. Limited buffet breakfast. Cozy lounge/bar area.", "Date": "November 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Lviv", "Title": "“Best Hotel in the Netherlands”", "Author": "viktoriyab", "ReviewID": "UR45685576", "Content": "This hotel is amazing. Each room has its own little story to tell. The rooms are big, clean, and have great design. Our room was two levels, bathroom was on the second level and a huge bathtub, super comfortable and fits two people. The service was great, everyone at the hotel was super nice and friendly. They have free tickets to several museums in Amsterdam which is really beneficial to museum lovers (that way you don't have to stand in a huge 2 mile line at the museum). The restaurant is amazing!!! The food is so delicious and every plate is a presentation of something. Really great and super tasty food. Our friend wanted her lamb more well-done and the Chef of the restaurant personally brought her the plate back!!!!! The location of the hotel is perfect, you are close not only to the main attractions of the city but also to the train station. Hotel also offers great bicycles that you can rent for a day. It is a great way to see the city. This hotel is perfect for your honeymoon but also for a business conference. It has super big conference room which is decorated in a very tasteful yet fashionable way. This hotel is amazing and I will stay there every time I got to Amsterdam!!!!! Three thumbs up!", "Date": "October 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "New York", "Title": "“I probably wouldn't go back”", "Author": "NaomiNY", "ReviewID": "UR37045854", "Content": "I wanted to write about the Dylan because I am not sure that it's worth the money and the hype. I am a seasoned traveler with pretty discriminating tastes in hotels and restaurants. There was nothing WRONG with the Dylan but there was nothing spectacular about it either. I don't know what the other hotels in Amsterdam are like as this was our first visit there but I was generally underwhelmed with the delux room that we paid for. The room was small and the bathroom was a steep staircase below that made me think twice about going to the bathroom (and I am in great shape). The cleaning staff was sloppy (the nightstand had streaks of dust) and the restaurant for breakfast had the smallest offering of breakfast choices that I had ever seen in a 5 star hotel. I also ordered scrambled eggs which came out like yellow cottage cheese and was inedible. My conclusion is that it's not worth the hype or the price.", "Date": "August 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York, NY", "Title": "“A truly special place in the heart of Amsterdam”", "Author": "columbiakat", "ReviewID": "UR32297409", "Content": "My husband and I visited The Dylan at the end of May for a 3-night stay. I read the previous review from the couple that had a terrible stay at The Dylan and am perplexed by their experience b/c our stay could not have been more perfect. Our flight arrived very early in the morning and we were pleasantly surprised to learn our room was ready. Two of the staff met us in the courtyard to assist us with our bags and the front desk was fully staffed and completely professional. They knew our names before we even sat down to check-in. We stayed in a Loft style suite that had windows overlooking the courtyard. It was a charming, Dutch style room with steep stairs leading up to the large sitting area. The ceilings were pitched with exposed beams lending to the charm. The room was bright, clean and airy. The large bathroom had a separate shower and large soaking tub. All of the bathroom amenities were from Molton Brown. There were two televisions in the room and complimentary Wi-Fi. The king size bed was extremely comfortable. For those people who have never visited Amsterdam, The Dylan is very centrally located unlike some of the larger chains like the Intercontinental Amstel. We used the tram system and walked everywhere and did not need to use taxisâ€¦we have been to Amsterdam quite a few times so we are familiar with the transit system. For those who are first time visitors, The Dylan always asks if you need a taxi and are happy to arrange transportation to the airport, dinners, etc. The breakfast served at the hotel is exceptional especially for a continental buffet spread. We were expecting just a few rolls and some coffee but every morning there was yogurt, granola, cereal, cold cuts, cheese, breads, pastries, fruit, fresh squeezed juice & you can order eggs any way that you like. It is served in a room w/ exposed brick that served as a bakery complete with the original ovens. While the previous reviewer notes that Amsterdam is not a foodie city, every meal we had was solid. Unfortunately we were there only for 3 nights as we had a list of places to try like Marius. The concierge at the hotel booked every reservation for us and even managed to snag us a last minute booking at De Kas, which was a real treat. Unfortunately, we were not able to use bicycles available at the hotel (They are not free but available for a small fee) as it rained the day we had reserved them. They are limited so if you really want to use them on your stay, I would suggest emailing the hotel and booking them in advance. Iâ€™m a researcher by nature and have read all the reviews and while our room was light and airy it seems that some of the rooms are darker due to the dÃ©cor. The common rooms at the hotel (restaurant, bar) are definitely dark due to the manner in which they are decorated (dark wood, etc.) but it is a boutique hotel and really no different than other trendy hotels. The style definitely mirrors our own (clean lines, more modern) but some people may prefer something else. No detail is overlooked at this hotel. We always had fresh apples & water in our room everyday. We had beautiful orchids decorating our room and throughout the hotel. There are blankets on the furniture in the courtyard so you can sit out even when itâ€™s a bit chilly. And one last mention about the staff at The Dylan. Every correspondence that I had with the hotel prior to my trip and every interaction that we had with staff during our stay was extremely pleasant & professional. Every single time we walked in and out, we were greeted by no less than 4 people (front desk, bartenders, concierge, etc.), which is why my husband and I cannot understand the previous reviewerâ€™s experience at the front desk. For 4 days, we never saw less than 2 people sitting at the front desk. Is this hotel for everyone? Perhaps not but if you, like us, enjoy not being an anonymous guest in a huge chain hotel then The Dylan is perfect for you. Itâ€™s truly an exceptional boutique hotel with the friendliest staff and after being spoiled for 4 days, our only complaint is that we had to leave!", "Date": "June 14, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "London ,UK", "Title": "“trendy ,boring and very dark”", "Author": "Frontierman", "ReviewID": "UR29949547", "Content": "Generally the reviews of this hotel are good so we booked for a 3 night weekend break .On check-in we sat at the desk for 10 minutes before the receptionist acknowledged our presence .She was on the phone .Very rude and unwelcoming We asked the concierge if we could rent a bike .he said no they were all out .When asked if he could help us organise bike rentals, he told us the shop was down the road.i reminded him that in a hotel with this price tag i expected him to organise it for us .I complained to the manager about the attitude of his staff and he was very apologetic and organised complimentary bikes . The hotel restaurant was over priced ,boring and the food was tastless ,avoid it .Although Amsterdam is not really a foodie city there are much better options ,such as Yamagata's at the Okura hotel which was excellent and a pancake house 200 M from the Anne Frank House called the pancake bakery BUT the worst thing about the Dylan was it was so dark.Our bedroom had one small window and lots of dark wooden furniture Overall i would give the Dylan a miss .Try the Grand or Pullitzer or the Amstel which is very expensive . Some advice -dont miss the Anne Frank House and the Van Gogh museum and pre book the Anne Frank visit on the Internet ,it saves a lot of time lining up .", "Date": "May 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Basel", "Title": "“One of the best places I have ever stayed in”", "Author": "gleonhard", "ReviewID": "UR27145597", "Content": "- and I stay in a lot of good hotels. Beautiful salon and lobby, fireplace, great food, good music everywhere, very nice rooms, and great people and superb location. Worth every cent!", "Date": "March 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Quite simply Perfect”", "Author": "rvrman21", "ReviewID": "UR26719952", "Content": "The position is fantastic, the ambiance great and the staff friendly but genuine. The rooms was luxurious , one little niggle was the open plan bathroom offered little privacy. After countless trips to this great city on biz and pleasure I have at last found THE hotel. Expensive, yes, especially for us Brits, but worth every â‚¬.", "Date": "March 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New Forest, UK", "Title": "“Great Hotel - loved the communal areas”", "Author": "Lizzie020", "ReviewID": "UR24590496", "Content": "We loved the hotel, thought the bar, restaurant and lounge were superb. The staff were very friendly and helpful when we ran into a little difficulty. The bedroom was good, but not really very luxurious - wardrobe was non existent, and the room itself was small. It was our decision to go for a two-floor room, but the bathroom upstairs was a bit impractical - steep stairs to climb in the dark in the middle of the night! The breakfasts are expensive - we ate out the second day, but the quality of food was good.", "Date": "February 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“If you have the money stay here”", "Author": "Andy043", "ReviewID": "UR24093892", "Content": "Canel facing room was great, service excellent and dinner on Saturday evening in the hotel restaurant was amongst the best I have ever had. Staff friendly and professional and v helpful. Hotel is in an excellent location enabling you to walk to most places. 1000 euros for two nights (including Sat night dinner), so not cheap but if you have that sort of budget for a weekend then stay here!", "Date": "February 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Amsterdam's Most Beautiful Boutique Hotel On a Canal”", "Author": "Palmosa", "ReviewID": "UR23766005", "Content": "I spent five nights at the Dylan Hotel in October while visiting a daughter in graduate school in Amsterdam. The Dylan is everything that a 5 star hotel should be. Top service without the attitude, lovely rooms (perhaps needing a little touching up), with a highly rated and delicious restaurant, Vinkeles on the premises. The staff was always very friendly and accommodating. It is an extremely elegant hotel. The location is central Amsterdam with the medieval canals, like the Singel within a five minute walk. Two other restaurants stand out from that visit: Balthazar's Keuken in the Jordaan neighborhood very close to the Dylan Hotel. Book early. My daughter chose it for her next birthday dinner with friends. Amsterdam's finest fish restaurant, near the RAI Center and a cab ride away, Visandeschelde. I booked a return to the Dylan for March and have already been contacted by a member of the staff welcoming me back.", "Date": "January 21, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "denver", "Title": "“Perfect location, beautiful dutch style”", "Author": "plushblush", "ReviewID": "UR22132779", "Content": "We just returned from a beautiful 3-night stay at the Dylan. The location could not possibly be better right in the heart of the 9 small streets, and the hotel has a perfect inspired dutch style - simply gorgeous. We were lucky to be traveling off season, and received a very good value in the \"garden room\" - with beautiful soft decor on the top floor overlooking the canals. The room was overly spacious. It is expensive but perfect for a splurge romantic weekend, and look for the off-season values. I agree that the bed could have been more comfortable and we asked for an extra duvet which helped a lot, but overall a very beautiful sexy place. For a great dinner, try Lust - right around the corner - right out of the hotel, right again - it books up on busy nights - really great atmosphere and food.", "Date": "November 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "", "Title": "“Perfect location, real style.”", "Author": "QIKI", "ReviewID": "UR21910534", "Content": "We stayed in Amsterdam for the weekend for a blend of business and pleasure. This hotel is wonderful and is in the authentic heart of Amsterdam - it was great to walk out of the hotel and feel the pulse of the city immediately. The design of the hotel is just exquisite. It underlines the true sense of style that the Dutch are renowned for. The size of the rooms and the comfort of the mattresses left a little to be desired... when you stay here you realise you're paying for the location and the fantastic design of the hotel - i sleep anywhere usually but found myself tossing and turning on both nights due to the mattress. Our stay at the hotel felt like a real treat, but it has to be said an expensive one. We both left feeling we had shared a special experience and would recommend the Dylan to anyone who wants to splash out.", "Date": "November 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Top of the range!”", "Author": "msstrips", "ReviewID": "UR20932547", "Content": "We thoroughly enjoyed our stay. The Dylan is fantastic, so stylish and yet the atmosphere is friendly rather than stuffy... Reception is very cool, and we were checked in straight away, no wait. The receptionist then brought us to our room - no. 13, on the second floor - and our bags were brought to us 5 minutes later. Our room (standard) wasn't particularly big, but had 2 huge windows looking onto the neighbour's gardens, flat screen TV and Bose sound system. Well stocked minibar, safe and bathrobes standard. The bathroom was the same size of the room, with a lovely stone sink and bath / shower, and also had a huge window. The bar and the restaurant are lovely, and so is the patio - although we didn't get to sit outside. The service is excellent! The Dylan is located in a quiet, residential area, yet within easy walking distance from lovely restaurants, bars, cafes, museums, etc. The many little cafes and restaurants on Prinsengratch canal are wonderful for people watching. We loved the Joordan area too for restaurants and nightlife. A lot nicer than Rembrandt square and Dam Square!", "Date": "October 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sweden", "Title": "“EuropeÂ´s no 1 boutique hotel”", "Author": "PGT86", "ReviewID": "UR16635650", "Content": "We had the pleasure of spendning 3 nightÂ´s at The Dylan in May 01-04. We reserved two completely different roomcategories, one stadard duplex. The duplex has a minimalistic white design, spacious with bathroom on the second level. We also reserved the Manhattansuite, Hempels masterpiece and personal replica, 45 sqm. The Manhattan is a designersdream, black & gold with beautiful woodenfloor in dark Mahogany. The Suite is located on the second floor with 5 magnificent large windows facing the Zen garden, draped with hundreds of meters of tafted silk. A lot of heart and compassion was put in to the Manhattansuite when it was designed, no question about that. Recently FG Stilj made a fantastic job remodeling all public areas. Fantastic and very tastfully done. As the owner of TDG Design Group and with a lot of exerience in \"hard\" design, i will give The Dylan a 5 out of 5, this is without no doubt the best boutique hotel in Europe. Finally, maybe the most important Dylan access: The staff Kind, helpfull and always one step a head. We are looking forward staying at The Dylan soon again, Best Regads P.G. TorÃ©us (Sweden)", "Date": "June 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great hotel, great location, great service!”", "Author": "bfhk", "ReviewID": "UR16241523", "Content": "We stayed in the Dylan for two nights in May and I couldn't recommend this hotel more. It is very centrally located (close to main shopping, restaurants, sights) and the styling and decor are top class. The rooms are luxurious and spacious with a well equipped bathroom (although shower did have some hot/cold issues). The main positive I have about this hotel however is the friendliness and helpfulness of the staff. Great for a short stay, although its central location means it lacks some of the facilities you see in top hotels (pool, spa etc).", "Date": "May 20, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Leeds", "Title": "“The Dylan is a reason to visit Amsterdam”", "Author": "CatK2000", "ReviewID": "UR15773758", "Content": "Make The Dylan a reason to visit Amsterdam. This must be the best hotel in Amsterdam. The decor, atmosphere, the rooms & the staff all add up to the reason they are one of the Small Leading Hotels of the World Group.", "Date": "May 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hyderabad, India", "Title": "“Loved the place!!”", "Author": "Hydeagle", "ReviewID": "UR15269195", "Content": "I was booked to stay in this hotel and was apprehensive given the scathing remarks in other reviews. Nothing could be farther from the truth. It is a lovely hotel and the staff are bunch of wonderful people who went out of their way to be nice and do the needful to make my stay comfortable. (I did see them quietly ignore a rude guest. I guess the moral is - if you are nice, people will be nice in return, rudeness begets rudeness!!) The room is rather small for the price, but remember that you are in Amsterdam where space is at a premium. The bathroom was a revelation and the larger hotel chains would do well to take a few cues from the Dylan on the subject of creating lovely bathrooms. Both the room and the bathroom were well equipped. The complimentary internet access is excellent. The hotel is located in a wonderful area in the centre of Amsterdam and is a short way away from the main attractions. For a 41 roomed hotel, it is very well known in Amsterdam and the locals hold it in high esteem. A taxi driver will have no problem in taking you there (If he does not recognise 'Dylan' tell him to take you to 'Blake's; which is the old name for this property. The public areas on the ground floor, the lounge, cafe etc. are chic and smart. They come across as being sophisticated and classy without being loud or flashy. In fact, nowhere is the hotel brassy, flashy or loud. Each bit of this wonderful hotel is elegant.", "Date": "April 23, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "montreal,", "Title": "“Too Bad, was hoping for a great experience!”", "Author": "katsilver", "ReviewID": "UR13670786", "Content": "How dare they claim to be a luxury hotel. Was booked in the Kimono suite. Towels were frayed and thread bare. No clock in the room and only one bar of soap. Booked the \"museum package\", the website is totally misleading. They offer tickets to the museum of your choice on line, but upon check handed us tickets to the Van Gough and told us we had no choice! When I said I had no use for those tickets the extremely rude and arrogant manager attempted to toss them in the garbage , I found that action disrespectful not only to me but to society. What point was he trying to make? I stopped him and and suggested that he give them to a person who could not afford to go to the museum. The service in the bar was appalling, empty glasses were left on the table as well as dirty ash trays. Again, not the type of service one expects in a bar where they are charging 17 Euros for a drink! This hotel needs to give it's staff a course in customer service.", "Date": "February 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "london", "Title": "“A fabulous location for a fabulous hotel”", "Author": "gascony", "ReviewID": "UR12448463", "Content": "WOW - glad i didn't read the reviews on this hotel before I booked! i either stayed in an entirely different hotel or there was an alignment of sun, moon and stars when i stayed......! location as many others have said is great - in the \"nice\" part of amsterdam. we had booked 2 rooms for 3 nights, including new years eve. i didn't notice the 3pm check-in time but when we arrived they said they had noted our flight arrival details and had our rooms ready - they had also upgraded us. we were 2 girlfriends travelling and they gave us adjoining suites which was very useful. before we arrived i felt i was being stalked by their concierge who seemed oddly worried about our restaurant bookings....thankfully, i gave in and got him to book something for us.....if i hadn't, we would have had a real problem since so many restaurants were closed. the reception team could not have been more helpful/accomodating - my upgraded room had an unpleasant smell (drains - not that surprising in amsterdam i guess but not nice), i told reception about it on my way out to dinner. they said they would have someone look at it and if it wasn't fixable they would move me. when i returned, they had another room ready for me in case i wasn't happy with the repair. the smell had decreased but was still there so i said i'd see how things were the next day......the next day on my way to breakfast they asked if things were ok (without prompting), i said all was fine but nevertheless they had the maintance guy check again. these things happen, what is important is how the hotel deal with the problem - i felt they handled it perfectly. breakfast was a very enjoyable experience - agreed service was a little spotty but it was high quality and very friendly. decor i really liked - quirky and definitely \"designed\" but that's what they advertise. only negative i might point to would be size/quality of rooms vs price.....we were upgraded but even in the upgraded rooms i thought price vs offering was slightly off. nevertheless the overall experience more than made up for this and i wouldn't hesitate to recommend the hotel or to return - it will be my base in amsterdam going forward. friends staying at other high end hotels all much preferred my choice......", "Date": "January 8, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Holliston, MA", "Title": "“All style, no substance”", "Author": "Tremizzle", "ReviewID": "UR10855699", "Content": "This hotel was highly recommended by a friend of mine, whose tastes are usually very similar to my own. We couldn't disagree more about this hotel. I requested an early check-in since we were due to arrive to the hotel by 8:00 a.m., and only had the one day/night in Amsterdam. I received a very courteous reply which stated that they'd try to accommodate my room preference and early arrival, but no guarantees. We arrived as scheduled, received a welcome juice and were told by the front desk staff that our room would be cleaned shortly. She asked us if we'd like to have breakfast while waiting. Well, so far so good. The hotel facade and lobby looked lovely, and it appeared that our room would be available shortly as well; good news since we hadn't slept all night and just wanted a good nap before setting off to explore the city. Although we weren't hungry, we decided to kill time at the limited breakfast buffet. We each had a cup of coffee. My husband had some cheese, and I had a roll. Little did we know the \"buffet\" was $50 USD/person! That's right...we paid $100 for two coffees, some cheese and a roll. Our mistake - I suppose we should have asked the price or looked at the menu. The buffet was very sparse; I can't imagine any of it being worth $50/person. After \"breakfast,\" we went to check on the room. It still wasn't ready, but the front desk assured us it would be cleaned soon. We sat down to wait in the lounge section of the hotel. To make a long story short, we wound up waiting three hours for a room to open because they kept telling us it would only be a few minutes. With only one day to explore the city, we wish they would have just told us when we checked in that a room would not be available earlier than noon. We could have spent that time seeing the city instead of the dark interior of their smoky lounge. Although the restaurant and lobby are stylish, the room was a disappointment. The view was of a roof and looked directly into other windows. The headboard was stained. The sheets were scratchy. The towels were cheap. The modern-styled glass bathroom doors squealed loudly when moved and didn't fit into their grooves. A complimentary evening snack was delivered to our room, which was a nice touch until we realized it was meant for someone else. The room service I ordered later that night arrived incomplete, cold and inedible. At first glance, this hotel looks upscale and modern, but upon closer observation it's obvious they tried to achieve this look with the cheapest materials possible. The staff is only moderately friendly, and they are unprepared to make a simple restaurant recommendation. The Dylan is in a great location, but this cannot make up for the shoddy service, rooms and decor. Although we loved Amsterdam and would like to return, I would not choose the Dylan again.", "Date": "November 16, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "1", "Overall": "2.0", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Mixed feelings”", "Author": "lonsydtraveller", "ReviewID": "UR10389458", "Content": "Stayed at the Dylan for one night. Location was great and the hotel looked fantastic. Room, whilst small, was funky and well equiped. We felt, however, that the staff were singularly disinterested in making us feel welcome. We had cocktails and snacks included in our package but found only one person running the bar who complained constantly about how busy he was and had to be prompted to produce anything at all. We were charged for breakfast (also included in our package) and had to wait 45 minutes to check in. Other problem was that the communal rooms were wreathed in cigarette smoke. Would not stay there again purely because of the poor staff and cigarette smoke.", "Date": "October 28, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Richmond, Virginia", "Title": "“Shabby Formeley Chic”", "Author": "bentley47", "ReviewID": "UR8133527", "Content": "When it was built it was chic reminded me of Morgans in NY. Today it is shabby chic. However since then they have ridden their laurels, first room I thought the maidhad forgotten to clean with the meager what looked like a half eaten cookie she left. Chipped bathroom tile rings aroung sink, and a toilet that didn't work properly. My room overlooked and overheard the conversations of the interior court garden. Demanded a new room that I got the 2nd noght which had been remodeled as was satisfactory. Pros good quiet off street location, nice morning breakfast and as much as hate to say it, the rate of $350 euros was less than other hotels in this star range. Would I stay there again, no but I would have to do some home work to find a replacement", "Date": "July 17, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Seattle", "Title": "“Totally Not Worth It”", "Author": "TravelManSeattle", "ReviewID": "UR8029573", "Content": "We travel a lot--and know good hotels--and this is not one of them (especially for $550 p/night). From a staff that allowed us to wait for 3 hours in their lounge without offering anytihng--to a manager that promised to \"make our late check-in\" right for us--the experience at the Dylan was far less than it should have been. Once we got to our room we had a toilet that didn't really flush anything, a warped bathroom floor, no place to put things in the shower, badly draining shower, and just plain cheap badly performing everything. I tried working with them--but the best they would do is to give us 2 espresso's and comp our bike rental. Not exactly what I would expect for this kind of money. There have to be better places to stay in Amsterdam.", "Date": "June 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "TheHague", "Title": "“Fantastic boutique hotel !”", "Author": "Casualist", "ReviewID": "UR7985702", "Content": "Having read some of the other reviews I'm beginning to wonder if we stayed at the same hotel ! Many places advertise themselves as boutique hotels but fail to deliver, the Dylan certainly does deliver ! The location is fantastic, right on one of the major canals close to the centre and in the nice part of town. Reception is certainly different, with the standard desk being replaced by a more friendly and welcoming large table for everyone to sit at. We were offered a free upgrade to a suite (which was nice !) and this was huge, with fantastic creaky wooden floors and a classic decor, it felt like staying in a palace. There's been some comments on bad design, well its a historic building and like practically every other old building in central Amsterdam space is an issue, which is why the rooms are not like an airport Holiday Inn. To me the narrow wooden spiral staircases give the place character. I was definitely a fan of the bathroom sink, which looked more like a Roman fountain. Certainly no complaints about the service either, which was polite and forthcoming, a real rareity in Holland, which in general could be considered as being one of the least service-oriented countries in the world. The cocktail lounge downstairs was perfect, good cocktails being an endangered species in Holland. OK its not cheap but no hotels in Amsterdam are. And it can be a little noisy with all the creaky wooden floors, but drink enough cocktails and you won't notice ! Generally this hotel delivers what is promised and deserves its place amongst the Leading Small Hotels of The World.", "Date": "June 25, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "NJ", "Title": "“Badly designed Hotel”", "Author": "Lana02", "ReviewID": "UR7779668", "Content": "I have contradicting feelings toward this hotel. The hotel ground are very nice. Nice lounge and bar. The staff varies from very competent to not so. Concierge Michael is great. We had duplex room. The room looks cool at first glance. But then you realize nothing in the room makes sense. Who ever designed the rooms should have there license revoked. First our bed was on the first floor but the bathroom was on the second(via spiral staircase) which is very nice especially at night. Water splashes from the sink, no mirror next to the sink, water spills out off the shower, toilet dos not flash well. Closet(or whatever it is) is a joke. Cheap furnishings. The price is way to high. Of-course location is great. It is right on the canal in the center. There has to be something better for that money.", "Date": "June 5, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Palm Beach", "Title": "“Stolen Things”", "Author": "aspen0360", "ReviewID": "UR7430348", "Content": "My Partner and several friends went tothe Dylan for a long weekend, April 18-22, 2007. Our group had the best 3 suites in the hotel. The hotel is nice enough, but we had all of our personal electronics stolen from our room. Computer, mobile phones (2) Ipod and some small money. The response from the hotel was suprising, the acted as if it were the only time this has ever happened and if we had not locked the items in the safe it was our own fault. For the rechord, the safe is not large enough to store a computer of any kind other than a PDA and now i read on this site that they have had this come up in March. We were offered the phone number to the police, that was all. so while the hotel staff is friendly and the rooms are unique, loosing all of your personal things is not a pleasent expierence particularly irritating is the loss of the computer..", "Date": "April 24, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "New York", "Title": "“poor value, good location”", "Author": "wea74", "ReviewID": "UR7351824", "Content": "The Dylan has a wonderful location, within walking distance of almost everything you'd want to go to and nestled in the interesting 9 Streets area. There is a lot of staff, ranging in competence from very high to very low, generally coolly impersonal but always polite and attempting to accommodate clients' needs - from printing out documents to getting train information. Internet access is available in the rooms at no charge. There are nice towels, robes, slippers, and toiletries. The hotel is highly designed - actually, so highly designed as to be contrived. It has enough drawbacks that I'd advise booking a different hotel if the price to quality ratio matters. The hotel is in love with the colors terra cotta and black. Black works well in rooms that are large and get a fair amount of sunlight. It works badly in small rooms with little natural light. But the hotel uses the same palette regardless of size and light availability. I occupied 3 rooms over a 4-day period. Two of them were \"luxury singles\" (19 and 6); they should be avoided. At 325 euros, they are exceptionally poor value. One room was a double (41, in the new annex) and was excellent, with a few qualifications: no bedside reading lights, no tub, a soiled slipcover on a chair, a window very difficult to raise and lower, only a single small ledge in the shower enclosure. Those may sound like significant qualifications but they are minor compared to the problems with the luxury singles. Number 19 is on the small side; the walls are painted with deep horizontal bands of terra cotta and black and curtained with a heavy material using vertical terra cotta and black stripes. The curtains \"puddle\" on the floor but are so heavy that instead of puddling they drape in an ungainly fashion. The bed is a fourposter. The room is overpowered by the furniture, which also includes two rattan armoire-type cabinets flanking the bathroom. But the real problems with the room were a toilet that flushed very sluggishly, finding 3 squares of toilet paper a trial; flaking paint in the bathtub where the shower attached to the wall; a shower curtain that was dirty at the bottom; light switches that could only be reached by sliding one's hand between the wall and the armoire; a television that faced a bedside table instead of the bed; a door to the bathroom which could not be slid shut because it ran into one of the armoires. The staff apologized and courteously put me in another room - 41, a double - when I asked for one that was more comfortable. That room wore its black and white theme well, got copious sunshine, and was spacious. Because someone else had booked 41 I moved again to a luxury single, number 6. This room seemed even smaller than 19, appeared cheaply furnished, and was extremely depressing because of all the black and the absence of natural light. Here too the toilet labored. An odd feature of the tubs is a marble ledge which runs around them. The ledge is nice, because you can put things on it. But if you want to lie in the tub for a good soak, you have a problem with that ledge which juts out over the back of the tub. A doubled-over towel ameliorates but doesn't completely solve the problem. This is one of many small examples of overdesign that reduces comfort. The buffet breakfast was 25 euros and was tasty, if overpriced. It is very easy to eat in the neighborhood instead.", "Date": "April 14, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Bad, even by Dutch standards”", "Author": "pcinbk", "ReviewID": "UR7326918", "Content": "Dirty, terrible service, ignorant staff, great location that doesn't make up for any of this.", "Date": "April 10, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "New England", "Title": "“A waste of money...”", "Author": "nappieb", "ReviewID": "UR7218233", "Content": "We stayed here during our European trip some months ago and were bitterly disappointed. The staff were somewhat standoffish and service was not good. We had to carry our own bags from the kerbside to the hotel - seven heavy suitcases. On other occasions they were less than helpful. The hotel has been cheaply renovated and the owners apparently regard the style as \"contemporary chic.\" As a result, the prices of the rooms (and everything else) were outrageous. We were awoken at 7:30 am every morning by the construction crew working on a nearby structure. Some rudimentary double glazing and/or soundproofing of rooms during refurbishing could have prevented that intrusion, but no such luck! The food was above average but the portions were small and we quickly tired of the same old cold cuts and exotic fruits for breakfast. Like everything else, the food was ridiculously overpriced. Despite the fact that we didn't make any sort of mess, it took the cleaning crew three trips to service our room and the \"Do Not Disturb\" sign was routinely ignored. We'll never stay at the Dylan again!", "Date": "March 25, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Fantastic hotel”", "Author": "UkAdam", "ReviewID": "UR6828786", "Content": "The hotel location was perfect on a beautiful canel with shops and places to eat around the corner. I was slightly apprehensive about the staff having read a previous review, however, booked as was impressed by the hotel photos. The staff who greeted us were very friendly and all staff we came into contact with during our four night stay were polite and friendly, nothing was too much trouble in their eyes. We only ate bar food at the hotel one night, choosing to eat at local restaurants instead especially due to the hotel prices, however, the food we did eat was to a high standard. The hotel rooms did not disappoint from the photos we had seen. We had a loft style room overlooking the canel, the room was beautiful and very relaxing to be in. Yes the hotel is more expensive than others but a fantastic experience and well worth visiting.", "Date": "February 22, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Boutique-like, classy but snotty!”", "Author": "AvidTravellerLondon", "ReviewID": "UR6628815", "Content": "I love boutique style hotels which is why I booked this place and it WAS lovely. We stayed in a loft style room which was more like an apartment! There was loads of room, sofas and a bed the size of Holland! Upstairs (which made it even more like an apartment) we had a beautiful bathroom and to top it all the location was perfect.....walking distance from the centre. BUT although really nice, if you keep in mind the price of staying there, the phrase \"...well it should be\" kept springing to mind. I had forked out a fortune and was expecting alot. I've stayed in fair amount of boutique hotels so feel able to make a fair comparison. What really let this place down was the staff......you never got the feeling that nothing was too much trouble. They just weren't all that warm and friendly. If you want to go and stay, I'm sure you won't be disappointed but bear this review in mind - then you definately won't be.", "Date": "January 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Best place to stay in Amsterdam!”", "Author": "NewYorkMangosteen", "ReviewID": "UR6540776", "Content": "The last time my husband and I visited Amsterdam, we did not stay at the Dylan, but we did eat dinner there... and had a beautiful meal. We thought the next time we returned to Amsterdam, perhaps we would like to stay at the Dylan, given that it is in a great location, has a cool vibe, and, as we discovered, the food was fabulous. So return to Amsterdam we did this November, and we stayed at the Dylan. After reading the reviews here of it (some negative, some mixed, amongst good ones), we were a bit hesitant, as it is pricier than other hotels. But we are so happy that we decided to stay at the Dylan! We stayed in an amazing room facing the canal, and the staff could not be any nicer. As it was our anniversary, the hotel gave us a gorgeous bottle of red wine to celebrate. The room and the hotel are so wonderful, we bearly left our room, which was HUGE and bright and airy, very zen-like. (Since we had done most of the sightseeing last time we were in Amsterdam, we just wanted to relax and spend time with each other this trip.) We highly recommend the Dylan - for the hotel as well as the restaurant!", "Date": "January 2, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Fantastic boutique hotel”", "Author": "JonnyOnTheGo", "ReviewID": "UR6032351", "Content": "If you're heading to Amsterdam, treat yourself to this luxurious boutique hotel. You won't be disappointed. The Dylan is listed among \"The Best Small Hotels of the World\" for good reason. I'm a regular business traveler who's stayed at some pretty amazing places, but this was right up there with my favorites. First, the location is perfect -- perfectly picturesque. The Dylan sits on a quiet street facing one of Amsterdam's flowing canals. You're just a short walk from most major attractions -- incredible museums (like the Van Gogh and Rijksmuseum), the historic Anne Frank House and the famed Red Light District. The small alleyways nearby feature plenty of nice shops, pubs and cafes. My room at the Dylan was small but appointed beautifully. I walked in to a classical music serenade and immediately slipped under the sheets to rest up from the transatlantic fatigue. The room had many conveniences -- great bath products (I'm a sucker for Molton Brown), fluffy towels and a nice sound system. For about 40 more euros a night, my colleague enjoyed somewhat more lavish accommodations (her room was larger and looked out on a lovely courtyard), but there doesn't appear to be a subpar room in this hotel. We visited the city on business and benefitted from the free wireless Internet access throughout the hotel. The restaurant is lovely, but I hear the food doesn't measure up to the decor. So, skip the meal, plop down on one of the lounge's cushy sofas and enjoy a cocktail. It's a great way to unwind after a busy day in one of Europe's most beautiful capital cities.", "Date": "October 31, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Honeymoon stay at The Dylan”", "Author": "misticane", "ReviewID": "UR5947309", "Content": "I'm truly shocked at the bad reviews on this hotel. We just got back from the Dylan and loved it. We spent a few nights of our honeymoon in Amsterdam at The Dylan and from the moment we arrived we loved it. The design is gorgeous. The front desk guy was so helpful and welcoming. Our room was large and gorgeous. I loved the decor - very Danish Modern. There was a bottle of Crystal Champagne and snacks and a note from the staff congratulating us on our marriage. The concierge was our lifeline for everything we did. So helpful with restaurants and where to go and how to get there. They gave us change, made dinner reservations, we rented bikes from them and rode them all around at night. Highly recommend doing that. It's located in the heart of town on a beautiful canal so we walked everywhere from The Dylan. They also called a cab for us to get back to the hotel. I found the service at the front desk excellent. There are some design flaws the other reviewers mentioned like the sink faucets the water kinda spills out in a weird way. We had to duck down to see ourselves in the mirror which would make shaving very hard. The plumbing is old and the pillows were a little hard. The breakfast spread is nice, but the service was realllly slow. I found that everywhere we went in Amsterdam. It's not a service oriented culture. So, The Dylan's breakfast staff was just about as slow as the rest of the city's. Overall, If you're an older tourist type of person, this hip hotel is probably not for you anyway. It's expensive and has a bar and outdoor lounge where people can drink and smoke late at night. Which we loved. So, if you are a cosmopolitan couple like us, you'd love The Dylan.", "Date": "October 12, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Over Priced, Over Designed, Disapointment”", "Author": "AndMat", "ReviewID": "UR5889323", "Content": "What a disapointment this hotel is! There is so much more to a trendy boutique hotel than just a beautiful building and unfortunately this is the only thing going for the Dylan. Hotel staff were very dismissive, to the point of ignoring you when you are actually standing in the reception room. We had early check-in booked as we were on an early flight, however the room was not ready until almost 3pm, none of the staff offered an explaination or apologised for the inconvenience. Check-in to the room, only to have house keeping come in about 10min after arrival to re-stock the mini bar, explaining they had not had time to do it yet, but would do it now so we would not be charged for missing items. Unbelievable. The rooms whilst supposedly designer chic, are ridiculously over designed. We had the kimono/japanese inspired room which required you to bend over to see into the bathroom mirror, sit on your knees to have a shave, or use the small shaving mirror which was located on the adjacent wall, but the lighting cast a massive shadow which made this useless. The shower dribbled against the wall, so we got the maintenance person to put a new one in, only to find it was equally useless. The rooms have a table and chair at the end of the bed, or a couch, located directly under the plasma tv on the wall, again useless. Not really designer chic! We expressed our concerns to the hotel manager who advised we could not be moved on out first night, but he could change our room on the second. Not wanting the hassle we opted to stay in the existing room, and having spoken to other guests it sounds as though the other rooms are equally overdesigned, although we did not see them first hand. A really disapointing, overpriced hotel. Definately not worth the money. Would not stay here again.", "Date": "September 28, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "York, England", "Title": "“Exceptional Dylan”", "Author": "Kluiten", "ReviewID": "UR5617873", "Content": "I lived in Amsterdam for 4 years, so coming back is always special for me, particularly when I'm bringing a friend with me to impress them with my favourite city. I know WITHOUT QUESTION that service can be dreadful in Amsterdam, but I cannot criticise the service in The Dylan. Not only is it excellent (and helpful) but it made this particular 5 star make you feel as it should do - relaxed, pampered and valued. I have read the other reviews from guests who were 'concerned' about the size of the rooms, but the reality is you're staying in a beautifully restored property, so no, they're not going to be palatial in the standard size - this is the architecture of the period, but I challenge any guest to find a more beautifully renovated house on the main canals that offers the same quality. And service. I loved the 2 nights I just experienced - the service, the room, and the location - and would recommend that if you want to see Amsterdam at its best (it's in the Jordaan so the quality area is where you are), you need to book in. Remember old in Amsterdam sometimes means small, but the best presents . . . . . .", "Date": "August 16, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Rooms": "1", "Location": "4"}, "AuthorLocation": "new york", "Title": "“A disaster”", "Author": "tony10014", "ReviewID": "UR5578068", "Content": "Our bedroom overlooked a courtyard where guests partied until 4:00 or 5:00 am. The windows were not double glazed, so we got no sleep. The hotel may be billed as a designer hotel, but little thought seemed to have gone into the bathrooms. Our shower delivered water vertically downwards onto the tiling at thee nd of the bath, and had no thermostat. With one hand holding the shower, and the other hand constantly adjusting the temperature to the varying water pressure, one needed to ask a friend to perform one's ablutions! The designer window blind disintegrated on use. Breakfast was an exorbitant E24 for a coffee, orange juice, and a few rolls.", "Date": "August 8, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "1", "Service": "1", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Appalling from check-in to check-out”", "Author": "David&Jane", "ReviewID": "UR4997827", "Content": "This hotel bills itself as a deluxe hotel. The design is brilliant and totally impactical. Lights that do not work / baths taking 20 minutes to fill / service that is so amateur that you wonder where they get their staff. Room cleaned at 5.00 p.m. / staff walking into your room at 8.30 a.m. unanounced. The list is endless and more interestingly noone cared. If you want service then don't waste your time. Make sure that you don't leave your bags at reception as they stuck lables all over it that has left a permanent mark. From check in to check out a total disaster. Good value at 50 Euros not 400 Euros.", "Date": "April 23, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Wonderful hotel and staff”", "Author": "Noo36", "ReviewID": "UR4991313", "Content": "We were not sure what to expect at The Dylan after mixed reviews on this site, but we were not disappointed. The hotel was stylish and beautifully looked after, our rooms were a delight, and the staff were wonderful - everyone from the receptionist, to the conceirge, from the room service guys, to the restaurant staff, were friendly and could do not do enough to help. Every request was taken care of with perfect politeness and a smile. The restaurant at the hotel was excellent and we would recommend it. In room breakfasts were vast - way too much for a couple, but delicious. The hotel building is unusual and corridors are long and winding - but that's just a quirk of staying in an old building, and one we rather liked. We went with friends - our rooms were next to each other and they were totally different and unique in their own way - we prefer this to the blandness you can experience in some top hotels. We felt spoilt staying here which made for a very enjoyable, relaxed time in Amsterdam. We'd definetly go back.", "Date": "April 20, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Great, eccentric but click hotel”", "Author": "ladbroke", "ReviewID": "UR4398893", "Content": "I read one of the below reviews expecting the dylan to be past its prime after the changeover from ANoushka Hempel, shabby rooms, etc but was very pleasantly surprised. I went to amsterdam, a city i love and have visited many times for work and for pleasure, with a new partner - we were really surprised by the polite and professional (not at all snobby) service, great room service, great cocktails in the bar, and best of all, a great room. Booked a cheap (â‚¬230) rate off the internet and was expecting a broom closet, but the room was very nice, large (by Amsterdam standards), loads of character, clean, kept-up-looking, just very very cool. I'd not hesitate to recommend the dylan especially as there are not too many options in AMsterdam for characterful, stylish hotels.", "Date": "January 30, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Stylish property for a city trip”", "Author": "Family-C-L", "ReviewID": "UR4349812", "Content": "This is a chic and special property, converted from an antique Dutch bakery (I believe) so the architectural construction is unique. This allows for interesting rooms (we had a duplex suite), but also some inconveniences like you need to be no taller than 5 ft. to look into the bathroom mirror. But for us, it was a weekend stay for pleasure, so we dealt with it. The thing about Dutch service, and I preface the following sentence by saying that I'm totally generalizing and appropriating stereotypes (half of the staff is probably not Dutch, but even still...), the guest does not feel like s/he is a VIP, but rather a friend or an acquaintance. When we checked in, the concierge had no problems telling us that the property used to be the Blakes and since it became the Dylan, he has seen the quality of the guests drop (!). Well, I hope he wasn't refering to us....... smile Later on we borrowed hotel bicycles to tour the city. The staff volunteered to waive the rental charge without us asking (that was nice of them), but then when we came back, he said with a measure of scorn in his eyes: \"oh you're back late.\" We felt like maybe we should have insited on paying the 15 euros! The location is excellent and we loved the breakfast (not included in the rate). The aforementioned casualness of the Dutch staff is a plus in another way since you feel very laid back and easy around them. In other words, if you like more formal service, then the Dylan is probably not for you. But if you want a place that is chic, good to people watch and admire old Dutch architecture, then it's a good place.", "Date": "January 13, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "2", "Service": "1", "Rooms": "4"}, "AuthorLocation": "Altrincham", "Title": "“Great hotel, shame about the theiving staff!”", "Author": "CarrieHooton", "ReviewID": "UR4129374", "Content": "We stayed at the Dylan for 3 nights. On the face of it - not bad at all. Nice little hotel, staff could have been bit more attentive but nice nonetheless. Our room was very well decorated although it was a little small and there was nowehere near enough room to hang clothes - bit of a problem when there are no ironing facilities. Hotel is very well located. We had a marvellous time, as we always do in Amsterdam. The hotel was very pricey but it was a treat so who cares. Sadly our stay was ruined when we left the hotel. I (stupidly) left a bag full of duty-free cosmetics in the bathroom cupboard. With hindsight thank christ it wasn't jewellery. We checked out mid-morning and left our bags ready for collection later that day. I realised I'd left my \"goodies\" and thought (as with every other half-way decent hotel) they would have been handed in by housekeeping. Not so! I explained what had happened to the staff and they really couldn't have cared less. There was no sincere apology and they didn't seen surprised or concerned at what I as saying. They couldn't wait to get rid of me as their new \"victims\" were checking in and hearing my complaint. No resolution was offered - nothing...and we had just spent a fortune at their hotel. I am disgusted and would NOT recommend this hotel to anybody. Absolutely shameful !!!!", "Date": "November 21, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Belgrade, Serbia", "Title": "“one of the best hotels in europe”", "Author": "tikvica", "ReviewID": "UR3993600", "Content": "The Dylan was one of the best experiences I've had with the hotels in Europe. Very luxury car waited for us ont he airport, warm welcome at the reception. We got the perfect room on the first floor, with a canal view. Perfectly designed (Anoushka Hempel style, as all blake hotels), biggest and greatest bed I've ever slept on. Perfecty lit room. Didn't have air-con problems :) The staff is very well trained and pleasant - they all look good in very nice uniforms, they're always smiling - and the best thign is that you don't see'em most of the time, but the're always there. Even if you get out of you room for 15 minutes, when you come back you find everything clean and proper, and you don't get to see any of the staff. You can even find an eye-mask and anti-hangover stuff in the mini-bar. The restaurant and the food are perfect, very nice and big selection. Pricy, though, but that's the thing with all the good hotels. At least here you get really good stuff for your money.", "Date": "October 5, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“The Dylan (Watch Out)”", "Author": "Bakesie", "ReviewID": "UR3676246", "Content": "Just returned from a two night stay at the Dylan Hotel (formerly Blakes) and it was one of the worst hotels I have ever stayed in. Maybe that is the reason why this property keeps changing ownership. Mark my words......do not even consider this hotel if you expect any comfort. The first night the room was visually appealing upon entering but were everything from the drapes to the sheets to the towels were dated and filthy. The room was completely unfunctional as well, shower was awful and nothing in the room worked properly. (and I mean nothing). The flooring was made of a material you could not walk on barefoot. It was 75 degrees outside but management felt it was not necessary to turn on the air conditioner in the rooms. My room was a complete sweat box and sweated thru the night. When I called the front desk to change rooms I was told there would be a $400.00 upgrade charge because the only room available that night available was a suite. The next morning I immediately went to change rooms for the next night and they put me in another room. This room again was decent upon first inspection but again had no air-conditioning. We were forced to leave the windows open for air and the mosquitoes were awful and kept us up all night biting us. It was worse than camping out. Once again, nothing in the rooms functioned properly and upon closer inspection of the stuff in the room, this new room was outdated, stuffy and overall of poor sanitary standards. The General Manager of the hotel was off on vacation and I still have not gotten any explanation or apology for this nightmare of a stay. You would figure after the first night of a miserable stay, management would have put me in a room that was somewhat comfortable. The staff could care less and I advise you all to stay away from this property. I also stayed in the American Hotel in Ledspelein and it was significantly better. The Dylan needs to be torn down and rebuilt from scratch if it wants to be thought of as a high end hotel.", "Date": "July 17, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Dallas, TX", "Title": "“Not a cool hotel... in any respect.”", "Author": "SMMMMM", "ReviewID": "UR3633257", "Content": "Given the rates and adverstising for this hotel one would at least expect basic luxuries like air conditioning. Do not be deceived. They will say that their rooms are air conditioned. Most are not! They have some sort of fan that blows, but no cool air. They twice put me in rooms that they claimed had air conditioning, only for me to find out that the staff had lied. Eventually they placed a portable unit in my room for one night and moved me to a room that was barely cooler the next night. Additional bizarre details include the fact that you need to be four feet tall to shave in the bathroom mirror. Any taller and you will find yourself looking into a cabinet, not a mirror. That is, of course, if you manage to get enough water flowing out of the sink, or shower, to actually manage to wash. The hotel looks cool from the common areas and is a joke when it comes to basic utlities in the rooms. It is great to be in a cool hotel, but not when it is falling apart. Additionally, the bar and the restaurant were lame. In my 5 day stay I never saw a crowd or any semblance of what could be described as a scene. Save your money and stay somewhere else. This is no luxury hotel.", "Date": "July 3, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Excellent service and food”", "Author": "A TripAdvisor Member", "ReviewID": "UR3300774", "Content": "Stayed here 3 nights in March (it is now called the Dylan) 2 nights in a superior room with canal view and last night in a duplex suite with canal view. The staff were excellent, they knew our names and were friendly and helpful. Really enjoyed the fusion food in the restaurant. The breakfast was good as well, although a little annoying when you pay an inclusive room rate and find this only covers the basic continental breakfast and all fruit, yoghurt, eggs etc are payable extra. The rooms were a little disappointing, I have to agree with one of the previous reviewers that they tended towards design over practicality. The design is quite stark, rather than romantic. Having said that, the beds were very comfortable and the baths huge. We had problems with our shower, hence our upgrade to the duplex suite for the final night. The bed in the suite was one of the most comfortable I've slept on with superb bed linen. There were DVD and CD players in both rooms. The location was very good, within walking distance of all major attractions, but away from the noisy areas like Dam square. I would recommend this hotel, especially when the new spa facilities are built.", "Date": "March 25, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Great service”", "Author": "A TripAdvisor Member", "ReviewID": "UR3211769", "Content": "Mangement and the name just changed January 1st 2005 to the Dylan. The staff was wonderful and very helpful. Concierge made the stay so much better by providing wonderful dining recommendations. Hotel dining room is best in the city.", "Date": "February 20, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "New York, New York", "Title": "“amazing service”", "Author": "A TripAdvisor Member", "ReviewID": "UR2600980", "Content": "From the moment i checked in i knew this hotel was special. I was greeted with champagne and a pleasant staff willing to accomodate me even though i had no reservation. The room was amazing. Max, the conceirge, thought of everything including giving me an umbrella for rain was in the forecast. The hotel thought of everything so that I wouldnt have to. The service is amazing even if some of the design is a case of form over function.", "Date": "September 26, 2004"}], "HotelInfo": {"Name": "The Dylan", "HotelURL": "/ShowUserReviews-g188590-d190667-Reviews-The_Dylan-Amsterdam_Noord_Holland.html", "Price": "$402 - $797*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Keizersgracht 384</span>, <span class=\"locality\"><span property=\"v:locality\">Amsterdam</span> <span property=\"v:postal-code\">1016 GB</span></span>, <span class=\"country-name\" property=\"v:country-name\">The Netherlands</span> </span></span></address>", "HotelID": "190667", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/4c/80/a5/the-dylan-front-side.jpg"}}